{"title":"ADAMA Reports Third Quarter and First Nine Months 2023 Results - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2lsL25ld3MtcmVsZWFzZXMvYWRhbWEtcmVwb3J0cy10aGlyZC1xdWFydGVyLWFuZC1maXJzdC1uaW5lLW1vbnRocy0yMDIzLXJlc3VsdHMtMzAxOTcxNDQ0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2lsL25ld3MtcmVsZWFzZXMvYWRhbWEtcmVwb3J0cy10aGlyZC1xdWFydGVyLWFuZC1maXJzdC1uaW5lLW1vbnRocy0yMDIzLXJlc3VsdHMtMzAxOTcxNDQ0Lmh0bWzSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2lsL25ld3MtcmVsZWFzZXMvYWRhbWEtcmVwb3J0cy10aGlyZC1xdWFydGVyLWFuZC1maXJzdC1uaW5lLW1vbnRocy0yMDIzLXJlc3VsdHMtMzAxOTcxNDQ0Lmh0bWzSAQA","guidislink":false,"published":"Mon, 30 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=303, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2lsL25ld3MtcmVsZWFzZXMvYWRhbWEtcmVwb3J0cy10aGlyZC1xdWFydGVyLWFuZC1maXJzdC1uaW5lLW1vbnRocy0yMDIzLXJlc3VsdHMtMzAxOTcxNDQ0Lmh0bWzSAQA?oc=5\" target=\"_blank\">ADAMA Reports Third Quarter and First Nine Months 2023 Results<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ADAMA Reports Third Quarter and First Nine Months 2023 Results - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2lsL25ld3MtcmVsZWFzZXMvYWRhbWEtcmVwb3J0cy10aGlyZC1xdWFydGVyLWFuZC1maXJzdC1uaW5lLW1vbnRocy0yMDIzLXJlc3VsdHMtMzAxOTcxNDQ0Lmh0bWzSAQA?oc=5\" target=\"_blank\">ADAMA Reports Third Quarter and First Nine Months 2023 Results<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Slower market recovery than expected impacting the Company's sales & profit Third Quarter 2023 Highlights: Sales down 24% to $1,033 million ( -20% in RMB terms ; -25% in CER[1] terms), mainly reflecting 12% decrease in volume and 13% decrease in prices ( ; -25% in CER[1] terms), mainly reflecting 12% decrease in volume and 13% decrease in prices Adjusted EBITDA amounted to $35 million vs. $171 million in Q3 2022 vs. in Q3 2022 Adjusted net loss of $115 million ; Reported net loss of $112 million First Nine Months 2023 Highlights: Sales down 17% to $3,524 million ( -12% in RMB terms ; -15% in CER terms), mainly reflecting 10% decrease in volume and 5% decrease in prices ( ; -15% in CER terms), mainly reflecting 10% decrease in volume and 5% decrease in prices Adjusted EBITDA amounted to $312 million vs. $611 million in the first nine months of 2022 vs. in the first nine months of 2022 Adjusted net loss of $135 million ; Reported net loss of $146 million BEIJING and TEL AVIV, Israel, Oct. 30, 2023 \/PRNewswire\/ -- ADAMA Ltd. (the \"Company\") (SZSE 000553), today reported its financial results for the third quarter and nine-month period ended September 30, 2023. Steve Hawkins, President and CEO of ADAMA, said, \"ADAMA continues to contend with difficult market conditions, an outcome of the industry overstocking in 2022 and the current channel destocking to lower than normal inventory levels in light of global high interest rates. This is impacting the consumption of high-cost inventory by the market and the Company, putting pressure on profits. In response ADAMA has taken measures to control costs and improve efficiencies, including strict inventory management, focusing on selective procurement of high-margin products and a cross company reduction of operating expenses. With the season over in the northern hemisphere, we are now looking to the season in Brazil to understand the outlook for the full year of 2023. \"As mentioned in the past, agricultural markets are cyclical in nature. We are encouraged that farmer demand remains good, providing a positive outlook for the future. Farmer demand is the underlying, fundamental engine for these markets and is supported by historically elevated crop prices.\" Table 1. Financial Performance Summary USD (m) As Reported Adjustments Adjusted Q3 2023 Q3 2022 % Change Q3 2023 Q3 2022 Q3 2023 Q3 2022 % Change Revenues 1,033 1,359 (24 %) - - 1,033 1,359 (24 %) Gross profit 185 332 (44 %) 12 41 198 373 (47 %) % of sales 18.0 % 24.4 % 19.2 % 27.4 % Operating income (EBIT) (38) 96 7 4 (31) 100 % of sales (3.7 %) 7.1 % (3.0 %) 7.4 % Income before taxes (110) 10 (3) 4 (113) 14 % of sales (10.6 %) 0.7 % (10.9 %) 1.0 % Net income (loss) (112) 5 (4) 3 (115) 8 % of sales (10.8 %) 0.4 % (11.2 %) 0.6 % EPS - USD (0.0479) 0.0023 (0.0496) 0.0036 - RMB (0.3435) 0.0155 (0.3556) 0.0245 EBITDA 37 177 (79 %) (2) (7) 35 171 (79 %) % of sales 3.6 % 13.0 % 3.4 % 12.5 % USD (m) As Reported Adjustments Adjusted 9M 2023 9M 2022 % Change 9M 2023 9M 2022 9M 2023 9M 2022 % Change Revenues 3,524 4,258 (17 %) - - 3,524 4,258 (17 %) Gross profit 748 1,098 (32 %) 67 126 815 1,224 (33 %) % of sales 21.2 % 25.8 % 23.1 % 28.7 % Operating income (EBIT) 94 363 (74 %) 24 40 117 403 (71 %) % of sales 2.7 % 8.5 % 3.3 % 9.5 % Income before taxes (155) 139 13 44 (142) 182 % of sales (4.4 %) 3.3 % (4.0 %) 4.3 % Net income (loss) (146) 119 11 41 (135) 159 (185 %) % of sales (4.1 %) 2.8 % (3.8 %) 3.7 % EPS - USD (0.0626) 0.0510 (0.0580) 0.0684 - RMB (0.4474) 0.3297 (0.4161) 0.4442 EBITDA 318 605 (47 %) (6) 7 312 611 (49 %) % of sales 9.0 % 14.2 % 8.9 % 14.4 % Notes: \"As Reported\" denotes the Company's financial statements according to the Accounting Standards for Business Enterprises and the implementation guidance, interpretations and other relevant provisions issued or revised subsequently by the Chinese Ministry of Finance (the \"MoF) (collectively referred to as \"ASBE\"). Note that in the reported financial statements, according to the ASBE guidelines [IAS 37], certain items (specifically certain transportation costs and certain idleness charges) are classified under COGS. Please see the appendix to this release for further information. Relevant income statement items contained in this release are also presented on an \"Adjusted\" basis, which exclude items that are of a transitory or non-cash\/non-operational nature that do not impact the ongoing performance of the business, and reflect the way the Company's management and the Board of Directors view the performance of the Company internally. The Company believes that excluding the effects of these items from its operating results allows management and investors to effectively compare the true underlying financial performance of its business from period to period and against its global peers. A detailed summary of these adjustments appears in the appendix below. The number of shares used to calculate both basic and diluted earnings per share in both Q3 & 9M 2023 and 2022 is 2,329.8 million shares. In this table and all tables in this release numbers may not sum due to rounding. The General Crop Protection (CP) Market Environment[2] High crop protection channel inventories across all geographies due to channel loading in 2022 continued to negatively impact channel consumption over Q3 2023. In addition, the distribution channel is opting to buy crop inputs on a \"just in time\" basis and striving to carry minimal inventory given wide high interest rate environment outside China and abundant supply of CP products. As a result, customers are buying much closer to the season, leading to a phasing of purchases into later quarters vs last year. The Brazilian CP market, the largest crop protection market, was down significantly in USD terms[3], mostly driven by lower volumes. This trend, coupled with the ongoing decline in Active Ingredients prices coming out of China, is also putting pressure on commodity crop protection prices. Over Q3 2023 the price trend of crop commodities continued to be mixed. Farmer CP consumption remained positive across most regions supported by strong planted area. Update on the War Situation in Israel On October 7th 2023, an unprecedented attack was launched against Israel, which thrust Israel into a state of war. ADAMA is headquartered in Israel and has three manufacturing sites in the country. ADAMA is continuing the production in its manufacturing sites in Israel, with certain non-significant restrictions, and globally and, at this time, does not expect this situation to have a material impact on ADAMA's ability to support its markets or on ADAMA's consolidated financial results. ADAMA continues to monitor the situation closely and support its people through these challenging times. Portfolio Development Update Product Launches, Registrations & Formulation Mastery Update: During the third quarter of 2023 ADAMA continued to register and launch multiple new products in markets across the globe, adding on to its differentiated product portfolio. New Product Introductions (NPI) percentage out of the full year sales of 2022 reached 22%, referring to products launched over the past 5 years. Differentiated products include products that are based on recently off-patented active ingredients (AI's) that have been classified as high commercial potential - \"Core Leap\" AI's, and products that are based on unique proprietary formulations, products with more than one mode of action, and biologicals. Select launches of differentiated products during the third quarter of 2023 in select countries include: Launch of Almada ® a triple-mode fungicide base on ADAMA's T.O.V. formulation technology against major soybean diseases and two-time winner of the Brazilian Soybean Rust Consortium. Almada ® is the first ADAMA product containing Fluxapyroxad, a \"Core Leap\" AI, for use in soybean. a triple-mode fungicide base on ADAMA's T.O.V. formulation technology against major soybean diseases and two-time winner of the Brazilian Soybean Rust Consortium. Almada is the first ADAMA product containing Fluxapyroxad, a \"Core Leap\" AI, for use in soybean. Launch in Germany , for use in sugar beet, of Mastercop ACT ® , a natural copper-based fungicide, based on ADAMA's proprietary Formulation Mastery technology for low dose products minimizing environmental load (enabling over 50% reduction in copper usage per hectare compared to conventional copper fungicides) and while maintaining its efficacy through optimization of delivery mechanisms. , for use in sugar beet, of , a natural copper-based fungicide, based on products minimizing environmental load (enabling over 50% reduction in copper usage per hectare compared to conventional copper fungicides) and while maintaining its efficacy through optimization of delivery mechanisms. Launch in Australia of Grindstone ® , a flexible herbicide helping farmers to control hard-to-kill broadleaf and woody weeds notably on cereals, fallow and pasture. Grindstone ® is the first global launch based on the \"Core Leap\" AI Aminopyralid. of , a flexible herbicide helping farmers to control hard-to-kill broadleaf and woody weeds notably on cereals, fallow and pasture. is the first global launch based on the \"Core Leap\" AI Aminopyralid. Launch of Adaca ® in India , a herbicide for use in grasses on cereals and pulses, based on Pyroxasulfone, a \"Core Leap\" AI produced in-house by ADAMA. in , a herbicide for use in grasses on cereals and pulses, based on Pyroxasulfone, a \"Core Leap\" AI produced in-house by ADAMA. Launch in Argentina of Apresa®, pre-emergent dual mode of action herbicide for use on soybean and corn. Select registrations of differentiated products during the third quarter of 2023 in select countries include: Registration of Maxentis ® in Malta , Czech Republic and Canada . This registration represents the first registration of an ADAMA prothioconazole mixture in North America in , and . This registration represents the first registration of an ADAMA prothioconazole mixture in Continued roll out of ADAMA's prothioconazole products based on Asorbital® formulation mastery technology platform, including: - Initial registration of Forapro® in Sweden and Malta - Registration of Maganic® in Czech Republic - Registration of Soratel® in Poland Financial Highlights Revenues in the third quarter declined by approximately 24% (-20% in RMB terms; -25% in CER terms) to $1,033 million, reflecting a decrease of 12% in volumes and a decrease of 13% in prices. The lower sales reflect market dynamics of high channel inventories, last-minute purchasing following channel destocking in light of high interest rates and pressure on crop protection product pricing due to the lower channel demand. These results brought the revenues in the first nine months of 2023 to $3,524 million, a decline of approximately 17% (-12% in RMB terms; -15% in CER terms), reflecting a decrease of 10% in volumes and a decrease of 5% in prices. This is in comparison to the record sales the Company achieved in 2022, which reflected the high demand due to supply uncertainty in the market. Table 2. Regional Sales Performance Q3 2023 $m Q3 2022 $m Change USD Change CER 9M 2023 $m 9M 2022 $m Change USD Change CER Europe, Africa & Middle East* 235 257 (9 %) (10 %) 999 1,051 (5 %) (1 %) North America 133 174 (24 %) (24 %) 568 736 (23 %) (22 %) Latin America 350 548 (36 %) (39 %) 912 1,161 (21 %) (24 %) Asia Pacific* 315 380 (17 %) (14 %) 1,044 1,310 (20 %) (16 %) Of which China 130 156 (16 %) (13 %) 453 605 (25 %) (20 %) Total 1,033 1,359 (24 %) (25 %) 3,524 4,258 (17 %) (15 %) Notes: CER: Constant Exchange Rates Numbers may not sum due to rounding * 2022 denote proforma sales. As of 2023, the India, Middle East & Africa (IMA) region has been reorganized such that the countries formerly included in this region are now included in the Europe region (renamed EAME – Europe, Africa & Middle East) or in the Asia Pacific region. Europe, Africa & Middle East (EAME): Sales in EAME decreased in the third quarter and nine-month period following overall crop protection market slow down leading to lower volumes and pressure on prices. In Europe this trend was particularly notable in Northern Europe with high channel inventory and in Central Europe, where cheap grain from Ukraine impacted farmers' investments in crops. The Company succeeded in increasing its sales in France, Italy and Iberia following weak seasons last year and with the company seizing opportunities in the cereal market in France. North America: Consumer & Professional Solutions – Sales in the third quarter and nine-month period were impacted by softening demand both in the consumer and professional solutions markets following a decline in disposable income, an outcome of inflationary pressures and high interest rates, and high channel inventories. Additionally, sales shifted from the third quarter to the fourth quarter to align with season use. In the US Ag market sales in the third quarter and the nine-month period declined reflecting the overall dynamic of the channel lowering inventory levels due to high interest rates with demand focusing on \"just-in-time\" supply from producers. Sales in Canada were significantly impacted in the third quarter among others due to the negative effect of the weather on fungicide sales and pricing pressure. In the nine-month period the decline in sales was more moderate as the sales were supported by the strong performance in the first half of the year following expansion of the Company's portfolio during 2022 and relatively stable pricing in the market. Latin America: Brazil – CP market contraction, characterized by channel destocking and softening pricing, led to a decline in the company's sales in the third quarter and nine-month period. In the rest of LATAM, sales in the third quarter and nine-month period decreased, following pressure on prices and dryer weather than expected. This is despite the strong performance of the biologicals portfolio and gaining market share in some key countries. Asia-Pacific (APAC): In China, the market is experiencing oversupply and pricing pressure impacting both the branded formulation and non-ag sales, while the branded business was supported by the launch of differentiated products. Additionally, the impact was partially offset by the increase of AI sales as a result of active efforts to expand the markets and customers along with the Sanonda Jingzhou site reaching high utilization after relocation. Sales in the wider APAC and in India decreased in the third quarter and first nine-month period despite an increase in volumes sold in the Pacific region in the quarter. Sales were negatively impacted by pressure on prices, especially in Australia and India and the beginning of El Niño and a weak monsoon season. Gross Profit reported in the third quarter reached $185 million (gross margin of 18.0%) compared to $332 million (gross margin of 24.4%) in the same quarter last year and reached $748 million (gross margin of 21.2%) in the first nine-month period compared to $1,098 million (gross margin of 25.8%) last year. Adjustments to reported results : The adjusted gross profit includes reclassification of all inventory impairment, taxes and surcharge and excludes certain transportation costs (classified under operating expenses). Excluding the impact of the abovementioned adjusted items, adjusted gross profit in the third quarter reached $198 million (gross margin of 19.2%) compared to $373 million (gross margin of 27.4%) in the same quarter last year and reached $815 million (gross margin of 23.1%) in the first nine-month period compared to $1,224 million (gross margin of 28.7%) last year. The decline in the gross profit in the first nine months was due to the decline in sales, as described above, high-cost inventory, a provision for inventory impairment and negative exchange rates. In the third quarter, these impacts had a higher adverse effect, though slightly moderated by the positive impact of exchange rates and the initial effect of new inventory sold, priced at market levels. Operating expenses reported in the third quarter and first nine-month period of 2023 were $224 million (21.7% of sales) and $655 million (18.6% of sales), compared to $236 million (17.4% of sales) and $736 million (17.3% of sales) in the corresponding periods last year, respectively. Adjustments to reported results : please refer to the explanation regarding adjustments to the gross profit in respect to certain transportation costs, taxes and surcharges and inventory impairment. Additionally, the Company recorded certain non-operational items within its reported operating expenses amounting to $7 million in Q3 2023 in comparison to $3 million in Q3 2022 and $22 in 9M 2023 in comparison to $31 in 9M 2022. These include mainly (i) non-cash amortization charges in respect of Transfer Assets received from Syngenta related to the 2017 ChemChina-Syngenta acquisition, (ii) charges related to the non-cash amortization of intangible assets created as part of the Purchase Price Allocation (PPA) on acquisitions, with no impact on the ongoing performance of the companies acquired, and (iii) incentive plans - share-based compensation. For further details on these non-operational items, please see the appendix to this release. Excluding the impact of the abovementioned non-operational items, adjusted operating expenses in the third quarter and first nine-month period were $229 million (22.1% of sales) and $698 million (19.8% of sales), compared to $273 million (20.1% of sales) and $821 million (19.3% of sales) in the corresponding periods last year, respectively. The operating expenses were lower in the third quarter and first nine-month period of 2023 mainly due to OPEX management measures, an adjustment of a provision for success-based compensation, lower transportation and logistics costs and the positive impact of exchange rates. Additionally, in the first nine months year of 2022 the Company recorded a provision for doubtful debts in Ukraine. Operating income (loss) reported in the third quarter reached a loss of $38 million (-3.7% of sales) compared to an income of $96 million (7.1% of sales) in the same quarter last year and amounted to an income of $94 million (2.7% of sales) in the first nine-month period compared to an income of $363 million (8.5% of sales) last year. Excluding the impact of the abovementioned non-operational items, adjusted operating income (loss) in the third quarter reached a loss of $31 million (-3.0% of sales) compared to an income of $100 million (7.4% of sales) in the same quarter last year and amounted to an income of $117 million (3.3% of sales) in the first nine-month period compared to an income of $403 million (9.5% of sales) in the same period last year. The Company reached operating loss during the third quarter of 2023 due to the low gross profit and despite lower operating expenses. EBITDA reported in the third quarter amounted to $37 million (3.6% of sales) compared to $177 million (13.0% of sales) in the same quarter last year and amounted to $318 million (9.0% of sales) in the first nine-month period compared to $605 million (14.2% of sales) last year. Excluding the impact of the abovementioned non-operational items, adjusted EBITDA in the third quarter amounted to $35 million (3.4% of sales) compared to $171 million (12.5% of sales) in the same quarter last year and amounted to $312 million (8.9% of sales) in the first nine-month period compared to $611 million (14.4% of sales) last year. Adjusted financial expenses amounted to $82 million in the third quarter and $259 million in the first nine-month period, compared to $86 million and $220 million in the corresponding periods last year, respectively. The lower financial expenses in the quarter were due to lower hedging costs on exchange rates and lower bond interest following the payment of bond principal in November 2022 and the net effect of lower Israeli CPI on the ILS-denominated, CPI-linked bonds. These impacts were moderated by higher bank interest expenses due to the increase in interest rates and an increase in short-term loans. For the nine months, the higher financial expenses were mainly due to higher bank interest expenses as stated above partially offset by lower bond interest and CPI. Adjusted taxes on income in the third quarter amounted to tax expenses of $3 million and an income of $7 million in the first nine-month period, compared to tax expenses of $6 million and $23 million in the corresponding periods last year. Despite reaching losses before tax, the Company recorded tax expenses in the third quarter and recorded a low tax income in the first nine-month period of 2023 , mainly because the generation of the losses were primarily by subsidiaries with relatively lower tax rates than the subsidiaries that generated profit. Additionally, in the third quarter the company recorded tax expenses due to the non-cash impact of the weakness of the BRL in the third quarter that effect the value of non-monetary tax assets. In the first nine months of 2022, the company recognized a high deferred tax asset, related to inter-group sales, that led to a decline in the tax on income. Net loss reported in the third quarter was $112 million and $146 million in the first nine-month period, compared to net income of $5 million (0.4% of sales) and $119 million (2.8% of sales) in the corresponding periods last year, respectively. Excluding the impact of the abovementioned extraordinary and non-operational charges, adjusted net loss in the third quarter was $115 million, and $135 million in the first nine-month period, compared to net income of $8 million (0.6% of sales), and $159 million (3.7% of sales) in the corresponding periods last year, respectively. Trade working capital as of September 30, 2023, was $2,742 million compared to $2,832 million as of September 30, 2022, and compared to $2,844 million as of June 30, 2023. Following the Company's implementation of strict procurement practices, inventory held by the Company reached $2,129 million as of September 30, 2023, in comparison to $2,448 million as of September 30, 2022, and $2,307 million as of June 30, 2023. The decrease in working capital was following the Company's implementation of strict procurement practices, as mentioned, which led to lower trade payables and a decrease in the level of inventory held by the Company. The decrease in receivables reflected the intensive collections as well as the lower sales. Cash Flow: Operating cash flow of $82 million was generated in the third quarter and $63 million generated in the first nine-month period in 2023, compared to $31 million consumed in the third quarter and $246 million consumed in the first nine-month period in 2022. Despite lower sales, the higher cash flow generated in the quarter was primarily due to a decrease in the procurement of goods as well as intensive collection. Net cash used in investing activities was $69 million in the third quarter and $231 million in the first nine months period in 2023, compared to $102 million and $299 million in the corresponding periods last year, respectively. The cash used in investing activities in the third quarter and first nine months period of 2023 reflected the prioritization of investments, part of the actions taken by the Company to improve its cash flow and included investments in new production facilities in ADAMA Anpon, investments in manufacturing capabilities in Israel and investments in intangible assets relating to ADAMA's global registrations as well as the acquisition of AgriNova New Zealand in Q1 2023. Free cash flow of $22 million was consumed in the third quarter and $276 million consumed in the first nine-months period compared to $154 million consumed in the third quarter and $623 million consumed in the corresponding periods last year, respectively, reflecting the aforementioned operating and investing cash flow dynamics. Table 3. Revenues by operating segment Sales by segment Q3 2023 USD (m) % Q3 2022 USD (m) % 9M 2023 USD (m) % 9M 2022 USD (m) % Crop Protection 943 91 % 1,228 90 % 3,233 92 % 3,826 90 % Intermediates and Ingredients 90 9 % 131 10 % 291 8 % 432 10 % Total 1,033 100 % 1,359 100 % 3,524 100 % 4,258 100 % Sales by product category Q3 2023 USD (m) % Q3 2022 USD (m) % 9M 2023 USD (m) % 9M 2022 USD (m) % Herbicides 427 41 % 571 42 % 1,531 43 % 1,932 45 % Insecticides 304 29 % 381 28 % 989 28 % 1,125 26 % Fungicides 212 20 % 276 20 % 713 20 % 769 18 % Intermediates and Ingredients 90 9 % 131 10 % 291 8 % 432 10 % Total 1,033 100 % 1,359 100 % 3,524 100 % 4,258 100 % Notes: The sales split by product category is provided for convenience purposes only and is not representative of the way the Company is managed or in which it makes its operational decisions. Numbers may not sum due to rounding. Further Information All filings of the Company, together with a presentation of the key financial highlights of the period, can be accessed through the Company website at www.adama.com. About ADAMA ADAMA Ltd. is a global leader in crop protection, providing solutions to farmers across the world to combat weeds, insects and disease. ADAMA has one of the widest and most diverse portfolios of active ingredients in the world, state-of-the art R&D, manufacturing and formulation facilities, together with a culture that empowers our people in markets around the world to listen to farmers and ideate from the field. This uniquely positions ADAMA to offer a vast array of distinctive mixtures, formulations and high-quality differentiated products, delivering solutions that meet local farmer and customer needs in over 100 countries globally. For more information, visit us at www.ADAMA.com and follow us on Twitter® at @ADAMAAgri. Contact Rivka Neufeld Global Investor Relations Email: [email protected] Zhujun Wang China Investor Relations Email: [email protected] Abridged Adjusted Consolidated Financial Statements The following abridged consolidated financial statements and notes have been prepared as described in Note 1 in this appendix. While prepared based on the principles of Chinese Accounting Standards (ASBE), they do not contain all of the information which either ASBE or IFRS would require for a complete set of financial statements, and should be read in conjunction with the consolidated financial statements of both ADAMA Ltd. and Adama Agricultural Solutions Ltd. as filed with the Shenzhen and Tel Aviv Stock Exchanges, respectively. Relevant income statement items contained in this release are also presented on an \"Adjusted\" basis, which exclude items that are of a one-time or non-cash\/non-operational nature that do not impact the ongoing performance of the business, and reflect the way the Company's management and the Board of Directors view the performance of the Company internally. The Company believes that excluding the effects of these items from its operating results allows management and investors to effectively compare the true underlying financial performance of its business from period to period and against its global peers. Abridged Consolidated Income Statement for the Third Quarter Adjusted[4] Q3 2023 USD (m) Q3 2022 USD (m) Q3 2023 RMB (m) Q3 2022 RMB (m) Revenues 1,033 1,359 7,407 9,282 Cost of Sales 815 977 5,846 6,671 Other costs 20 10 142 66 Gross profit 198 373 1,418 2,545 % of revenue 19.2 % 27.4 % 19.2 % 27.4 % Selling & Distribution expenses 169 199 1,215 1,361 General & Administrative expenses 36 52 259 356 Research & Development expenses 15 21 110 142 Other operating expenses 8 0 56 2 Total operating expenses 229 273 1,640 1,862 % of revenue 22.1 % 20.1 % 22.1 % 20.1 % Operating income (EBIT) (31) 100 (222) 683 % of revenue (3.0 %) 7.4 % (3.0 %) 7.4 % Financial expenses 82 86 587 587 Income before taxes (113) 14 (809) 96 Taxes on Income 3 6 20 38 Net Income (115) 8 (829) 57 % of revenue (11.2 %) 0.6 % (11.2 %) 0.6 % Adjustments (4) 3 (28) 21 Reported Net income (112) 5 (800) 36 % of revenue (10.8 %) 0.4 % (10.8 %) 0.4 % Adjusted EBITDA 35 171 254 1,165 % of revenue 3.4 % 12.5 % 3.4 % 12.5 % Adjusted EPS[5] – Basic (0.0496) 0.0036 (0.3556) 0.0245 – Diluted (0.0496) 0.0036 (0.3556) 0.0245 Reported EPS5 – Basic (0.0479) 0.0023 (0.3435) 0.0155 – Diluted (0.0479) 0.0023 (0.3435) 0.0155 Abridged Consolidated Income Statement for the First Nine Months Adjusted[6] 9M 2023 USD (m) 9M 2022 USD (m) 9M 2023 RMB (m) 9M 2022 RMB (m) Revenues 3,524 4,258 24,660 28,078 Cost of Sales 2,667 3,004 18,673 19,810 Other costs 42 30 299 201 Gross profit 815 1,224 5,688 8,067 % of revenue 23.1 % 28.7 % 23.1 % 28.7 % Selling & Distribution expenses 540 607 3,782 4,007 General & Administrative expenses 105 146 735 962 Research & Development expenses 53 63 373 416 Other operating expenses 0 5 0 32 Total operating expenses 698 821 4,890 5,417 % of revenue 19.8 % 19.3 % 19.8 % 19.3 % Operating income (EBIT) 117 403 799 2,650 % of revenue 3.3 % 9.5 % 3.2 % 9.4 % Financial expenses 259 220 1,815 1,462 Income before taxes (142) 182 (1,016) 1,188 Taxes on Income (7) 23 (47) 153 Net Income (135) 159 (969) 1,035 % of revenue (3.8 %) 3.7 % (3.9 %) 3.7 % Adjustments 11 41 73 267 Reported Net income (146) 119 (1,042) 768 % of revenue (4.1 %) 2.8 % (4.2 %) 2.7 % Adjusted EBITDA 312 611 2,168 4,027 % of revenue 8.9 % 14.4 % 8.8 % 14.3 % Adjusted EPS[7] – Basic (0.0580) 0.0684 (0.4161) 0.4442 – Diluted (0.0580) 0.0684 (0.4161) 0.4442 Reported EPS7 – Basic (0.0626) 0.0510 (0.4474) 0.3297 – Diluted (0.0626) 0.0510 (0.4474) 0.3297 Abridged Consolidated Balance Sheet September 30 2023 USD (m) September 30 2022 USD (m) September 30 2023 RMB (m) September 30 2022 RMB (m) Assets Current assets: Cash at bank and on hand 737 524 5,294 3,720 Bills and accounts receivable 1,327 1,547 9,529 10,985 Inventories 2,129 2,448 15,284 17,381 Other current assets, receivables and prepaid expenses 266 318 1,908 2,256 Total current assets 4,459 4,836 32,015 34,343 Non-current assets: Fixed assets, net 1,759 1,666 12,629 11,829 Rights of use assets 90 82 646 582 Intangible assets, net 1,457 1,464 10,461 10,393 Deferred tax assets 245 185 1,758 1,314 Other non-current assets 102 105 730 746 Total non-current assets 3,653 3,502 26,225 24,864 Total assets 8,112 8,339 58,240 59,206 Liabilities Current liabilities: Loans and credit from banks and other lenders 1,258 704 9,032 4,997 Bills and accounts payable 724 1,172 5,197 8,322 Other current liabilities 959 892 6,888 6,330 Total current liabilities 2,941 2,768 21,118 19,650 Long-term liabilities: Loans and credit from banks and other lenders 423 591 3,038 4,193 Debentures 1,003 1,120 7,200 7,952 Deferred tax liabilities 42 53 305 379 Employee benefits 90 117 648 827 Other long-term liabilities 458 371 3,290 2,636 Total long-term liabilities 2,017 2,252 14,480 15,986 Total liabilities 4,958 5,019 35,598 35,636 Equity Total equity 3,154 3,319 22,642 23,570 Total liabilities and equity 8,112 8,339 58,240 59,206 Abridged Consolidated Cash Flow Statement for the Third Quarter Q3 2023 USD (m) Q3 2022 USD (m) Q3 2023 RMB (m) Q3 2022 RMB (m) Cash flow from operating activities: Cash flow from operating activities 82 (31) 591 (213) Cash flow from operating activities 82 (31) 591 (213) Investing activities: Acquisitions of fixed and intangible assets (74) (99) (529) (677) Net cash received from disposal of fixed assets, intangible assets and others 1 0 6 2 Other investing activities 4 (3) 30 (22) Cash flow used for investing activities (69) (102) (493) (697) Financing activities: Receipt of loans from banks and other lenders 49 216 353 1,474 Repayment of loans from banks and other lenders (52) (24) (374) (161) Interest payment and other (46) (20) (331) (140) Other financing activities 138 4 987 28 Cash flow from (used for) financing activities 89 176 635 1,201 Effects of exchange rate movement on cash and cash equivalents 1 (5) (23) 161 Net change in cash and cash equivalents 103 38 710 452 Cash and cash equivalents at the beginning of the period 633 475 4,571 3,191 Cash and cash equivalents at the end of the period 736 513 5,281 3,643 Free Cash Flow (22) (154) (97) (1,050) Abridged Consolidated Cash Flow Statement for the First Nine Months 9M 2023 USD (m) 9M 2022 USD (m) 9M 2023 RMB (m) 9M 2022 RMB (m) Cash flow from operating activities: Cash flow from operating activities 63 (246) 526 (1,559) Cash flow from operating activities 63 (246) 526 (1,559) Investing activities: Acquisitions of fixed and intangible assets (244) (298) (1,707) (1,969) Net cash received from disposal of fixed assets, intangible assets and others 5 11 37 72 Acquisition of subsidiaries (22) 0 (148) - Other investing activities 29 (12) 205 (80) Cash flow used for investing activities (231) (299) (1,614) (1,976) Financing activities: Receipt of loans from banks and other lenders 647 590 4,458 3,909 Repayment of loans from banks and other lenders (281) (201) (1,974) (1,324) Interest payment and other (121) (83) (853) (553) Dividends to shareholders (9) (3) (63) (19) Other financing activities 62 (140) 467 (906) Cash flow from (used for) financing activities 298 164 2,036 1,107 Effects of exchange rate movement on cash and cash equivalents (2) (9) 107 311 Net change in cash and cash equivalents 129 (390) 1,056 (2,116) Cash and cash equivalents at the beginning of the period 607 903 4,225 5,759 Cash and cash equivalents at the end of the period 736 513 5,281 3,643 Free Cash Flow (276) (623) (1,849) (4,049) Notes to Abridged Consolidated Financial Statements Note 1: Basis of preparation Basis of presentation and accounting policies: The abridged consolidated financial statements for the quarters ended September 30, 2023 and 2022 incorporate the financial statements of ADAMA Ltd. and of all of its subsidiaries (the \"Company\"), including Adama Agricultural Solutions Ltd. (\"Solutions\") and its subsidiaries. The Company has adopted the Accounting Standards for Business Enterprises (ASBE) issued by the Ministry of Finance (the \"MoF\") and the implementation guidance, interpretations and other relevant provisions issued or revised subsequently by the MoF (collectively referred to as \"ASBE\"). The abridged consolidated financial statements contained in this release are presented in both Chinese Renminbi (RMB), as the Company's shares are traded on the Shenzhen Stock Exchange, as well as in United States dollars ($) as this is the major currency in which the Company's business is conducted. For the purposes of this release, a customary convenience translation has been used for the translation from RMB to US dollars, with Income Statement and Cash Flow items being translated using the quarterly average exchange rate, and Balance Sheet items being translated using the exchange rate at the end of the period. The preparation of financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimated. Note 2: Abridged Financial Statements For ease of use, the financial statements shown in this release have been abridged as follows: Abridged Consolidated Income Statement: \"Gross profit\" in this release is revenue less costs of goods sold, taxes and surcharges, inventory impairment and other idleness charges (in addition to those already included in costs of goods sold); part of the idleness charges is removed in the Adjusted financial statements \"Other operating expenses\" includes impairment losses (not including inventory impairment); gain (loss) from disposal of assets and non-operating income and expenses \"Operating expenses\" in this release differ from those in the formally reported financial statements in that certain transportation costs have been reclassified from COGS to Operating Expenses. \"Financial expenses\" includes net financing expenses and gains\/losses from changes in fair value. Abridged Consolidated Balance Sheet: \"Other current assets, receivables and prepaid expenses\" includes financial assets held for trading; financial assets in respect of derivatives; prepayments; other receivables; and other current assets \"Fixed assets, net\" includes fixed assets and construction in progress \"Intangible assets, net\" includes intangible assets and goodwill \"Other non-current assets\" includes other equity investments; long-term equity investments; long-term receivables; investment property; and other non-current assets \"Loans and credit from banks and other lenders\" includes short-term loans and non-current liabilities due within one year \"Other current liabilities\" includes financial liabilities in respect of derivatives; payables for employee benefits, taxes, interest, dividends and others; advances from customers and other current liabilities \"Other long-term liabilities\" includes long-term payables, provisions, deferred income and other non-current liabilities Income Statement Adjustments Q3 2023 USD (m) Q3 2022 USD (m) Q3 2023 RMB (m) Q3 2022 RMB (m) Net Income (loss) (Reported) (112) 5 (800) 36 Adjustments to COGS & Operating Expenses: 1. Amortization of acquisition-related PPA and other acquisition related costs 4 5 30 35 2. Amortization of Transfer assets received and written-up due to 2017 ChemChina- Syngenta transaction (non-cash) 5 6 34 39 3. Upgrade & Relocation related costs 1 2 6 11 4. Incentive plans (2) (8) (16) (58) 5. ASBEs classifications COGS impact (12) (40) (84) (270) 6. ASBEs classifications OPEX impact 12 40 84 270 Total Adjustments to Operating Income (EBIT) 7 4 53 28 Total Adjustments to EBITDA (2) (7) (14) (47) Adjustments to Financing Expenses: Revaluation of non-cash adjustment related to put option revaluation (7) - (51) - Other financing expenses (4) - (26) - Adjustments to Taxes: 1. Taxes impact (1) (1) (5) (7) Total adjustments to Net Income (4) 3 (28) 21 Net Income (Adjusted) (115) 8 (829) 57 9M 2023 USD (m) 9M 2022 USD (m) 9M 2023 RMB (m) 9M 2022 RMB (m) Net Income (loss) (Reported)) (146) 119 (1,042) 768 Adjustments to COGS & Operating Expenses: 1. Amortization of acquisition-related PPA and other acquisition related costs 13 16 88 104 2. Amortization of Transfer assets received and written-up due to 2017 ChemChina- Syngenta transaction (non-cash) 16 17 109 113 3. Upgrade & Relocation related costs 2 5 16 36 4. Incentive plans (7) 2 (48) 10 5. ASBEs classifications COGS impact (65) (116) (452) (766) 6. ASBEs classifications OPEX impact 65 116 452 766 Total Adjustments to Operating Income (EBIT) 24 40 165 263 Total Adjustments to EBITDA (6) 7 (41) 43 Adjustments to Financing Expenses: Revaluation of non-cash adjustment related to put option revaluation (7) - (51) - Other financing expenses (4) 4 (26) 24 Adjustments to Taxes 1. Taxes impact (2) (3) (15) (20) Total adjustments to Net Income 11 41 73 267 Net Income (Adjusted) (135) 159 (969) 1,035 Notes: Amortization of acquisition-related PPA and other acquisition related costs: a. Amortization of Legacy PPA of 2011 acquisition of Solutions (non-cash): Under ASBE, since the third combined reporting for Q3 2017, the Company has inherited the historical \"legacy\" amortization charge that ChemChina previously was incurring in respect of its acquisition of Solutions in 2011. This amortization is done in a linear manner on a quarterly basis, most of which will have been completed by the end of 2020. b. Amortization of acquisition-related PPA (non-cash) and other acquisition-related costs: Related mainly to the non-cash amortization of intangible assets created as part of the Purchase Price Allocation (PPA) on acquisitions, with no impact on the ongoing performance of the companies acquired, as well as other M&A-related costs. Amortization of Transfer assets received and written-up due to 2017 ChemChina-Syngenta transaction (non-cash): The proceeds from the Divestment of crop protection products in connection with the approval by the EU Commission of the acquisition of Syngenta by ChemChina , net of taxes and transaction expenses, were paid to Syngenta in return for the transfer of a portfolio of products in Europe of similar nature and economic value. Since the products acquired from Syngenta are of the same nature and with the same net economic value as those divested, and since in 2018 the Company adjusted for the one-time gain that it made on the divested products, the additional amortization charge incurred due to the written-up value of the acquired assets is also adjusted to present a consistent view of Divestment and Transfer transactions, which had no net impact on the underlying economic performance of the Company. These additional amortization charges will continue until 2032 but at a reducing rate, yet will still be at a meaningful level until 2028. Upgrade & manufacturing facilities relocation-related costs: These charges all relate to the multi-year Upgrade & Relocation program in China . As part of this program, production assets located in the old production sites in Jingzhou and Huai'An were relocated to new sites in 2020, 2021 and in the coming years. Since some of the older production assets may not be able to be relocated, some of these assets which are no longer operational are being written off (or impaired), while for others, their economic life has been shortened and therefore will be depreciated over a shorter period. Since these are older assets that were built many years ago and will be replaced by newer production facilities at the new sites, and since the ongoing operations of the business will not be impacted thereby, the Company adjusts for the impact of all charges related to the China Upgrade & Relocated program, which include mainly: ( i ) excess procurement costs incurred as the Company continued to fulfill demand for its products, in order to protect its market position, through replacement sourcing at significantly higher costs from third-party suppliers (ii) elevated idleness charges largely related to suspensions at the facilities being relocated These charges have significantly declined since the third quarter of 2022, as the relocation and upgrade of the manufacturing Jingzhou site in China has been completed and is now at a high level of operation. Incentive plans: ADAMA granted certain of its employees, a long-term incentive ( LTI ) in the form of 'phantom' awards linked to the Company's share price. As such, the Company records an expense, or recognizes income, depending on the fluctuation in the Company's share price, regardless of award exercises. To neutralize the impact of such share price movements on the measurement of the Company's performance and expected employee compensation and to reflect the existing phantom awards, in the Company's adjusted financial performance, the LTI is presented on an equity-settled basis in accordance with the value of the existing plan at the grant date. ASBEs classifications COGS impact – according to the ASBE guidelines [ IAS 37], certain items (specifically certain transportation costs) are classified under COGS. ASBEs classifications OPEX impact – according to the ASBE guidelines [ IAS 37], certain items (specifically certain transportation costs) are classified under COGS. Exchange Rate Data for the Company's Principal Functional Currencies September 30 Q3 Average 9M Average 2023 2022 Change 2023 2022 Change 2023 2022 Change EUR\/USD 1.060 0.984 7.73 % 1.088 1.008 7.90 % 1.083 1.064 1.84 % USD\/BRL 5.008 5.407 7.38 % 4.880 5.249 7.03 % 5.009 5.134 2.45 % USD\/PLN 4.370 4.953 11.78 % 4.138 4.706 12.08 % 4.236 4.395 3.62 % USD\/ZAR 18.939 17.953 (5.49 %) 18.655 17.03 (9.54 %) 18.347 15.950 (15.03 %) USD\/AUD 0.648 0.652 (0.58 %) 0.654 0.684 (4.34 %) 0.669 0.707 (5.44 %) GBP\/USD 1.223 1.118 9.40 % 1.265 1.179 7.36 % 1.244 1.256 (0.99 %) USD\/ILS 3.824 3.543 (7.93 %) 3.746 3.400 (10.17 %) 3.643 3.313 (9.95 %) USD L 3M 5.39 % 3.75 % 1.64 bp 5.39 % 2.99 % 2.4 bp 3.56 % 1.69 % 1.87 bp September 30 Q3 Average 9M Average 2023 2022 Change 2023 2022 Change 2023 2022 Change USD\/RMB 7.180 7.100 1.13 % 7.173 6.830 5.03 % 7.008 6.597 6.22 % EUR\/RMB 7.610 6.985 8.94 % 7.803 6.886 13.33 % 7.590 7.017 8.17 % RMB\/BRL 0.697 0.762 8.41 % 0.680 0.769 11.48 % 0.715 0.778 8.16 % RMB\/PLN 0.609 0.658 7.57 % 0.577 0.649 11.08 % 0.604 0.649 6.83 % RMB\/ZAR 2.638 2.529 (4.32 %) 2.601 2.494 (4.30 %) 2.618 2.418 (8.29 %) AUD\/RMB 4.652 4.627 0.54 % 4.693 4.671 0.47 % 4.687 4.666 0.44 % GBP\/RMB 8.783 7.939 10.63 % 9.077 8.051 12.75 % 8.714 8.286 5.17 % RMB\/ILS 0.533 0.499 (6.73 %) 0.522 0.498 (4.90 %) 0.520 0.502 (3.51 %) RMB Shibor 3M 2.30 % 1.67 % 0.63 bp 2.11 % 1.73 % 0.38 bp 2.27 % 2.09 % 0.18 bp Forward looking statement: This press release published by ADAMA Ltd. or ADAMA Agricultural Solutions Ltd. (together the \"Company\") is for marketing and information purposes only, and contains forward-looking statements which are based on Company's management's beliefs and assumptions and on information currently available to the Company's management. By this press release, the Company does not intend to give, and the press release does not constitute, professional or business advice or an offer or recommendation to perform any transaction in the Company's securities. The accuracy, completeness and\/or adequacy of the content of this press release, as well as any estimation and\/or assessment included in this press release, if at all, is not warranted or guaranteed and the Company disclaims any intention and\/or obligation to comply with such content. The Company shall not be liable for any loss, claim, liability or damage of any kind resulting from your reliance on, or reference to, any detail, fact or opinion presented herein. The Company's assessments are based on the information available to the Company as of the date hereof, and may not be realized or be realized in a different manner than the Company estimates, inter alia, due to factors out of the Company's control, including the risk factors listed in the Company's annual reports, changes in the industry or potential operations of the Company's competitors. Any content contained herein shall not constitute or be construed as any regulatory, valuation, legal, tax, accounting and investment advice or any advice of any kind or any part of it, nor shall they constitute or be construed as any recommendation, solicitation, offer or commitment (or any part of it) to buy, sell, subscribe for or underwrite any securities, provide any credit or insurance or engage in any transactions. Before entering into any transactions, you shall ensure that you fully understand the potential risks and returns of such transactions. Before making such decisions, you shall consult the advisors you think necessary, including your accountant, investment advisor and legal and tax specialists. The Company and its affiliates, controlling persons, directors, officials, partners, employees, agents, representatives or their advisors shall not assume any responsibilities of any kind (including negligence or others) for the use of and reliance on such information by you or any person to whom such information are provided. [1] CER – Constant Exchange Rates [2] Sources: Rabobank, Agri Commodity Markets Research, Sep 2023; AgbioInvestor-Quarterly-Briefing-Service-PLUS_Q3-2023; [3] Year-to-date as of Aug 2023, Source: Brazil Industry Panel [4] For an analysis of the differences between the adjusted income statement items and the income statement items as reported in the financial statements, see below \"Analysis of Gaps between Adjusted Income Statement and Income Statement in Financial Statements\". [5] The number of shares used to calculate both basic and diluted earnings per share in both Q3 2023 and 2022 is 2,329.8 million shares. [6] For an analysis of the differences between the adjusted income statement items and the income statement items as reported in the financial statements, see below \"Analysis of Gaps between Adjusted Income Statement and Income Statement in Financial Statements\". [7] The number of shares used to calculate both basic and diluted earnings per share in 9M 2023 and 2022 is 2,329.8 million shares. Logo - https:\/\/mma.prnewswire.com\/media\/799829\/Adama_Agricultural_Solutions_Logo.jpg SOURCE ADAMA Ltd.","filter_flag":1}
{"title":"Solvay Introduces New PVDC Coating Solution for Pharmaceutical Blister Films - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxNDQtc29sdmF5LWludHJvZHVjZXMtbmV3LXB2ZGMtY29hdGluZy1zb2x1dGlvbi1mb3ItcGhhcm1hY2V1dGljYWwtYmxpc3Rlci1maWxtc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxNDQtc29sdmF5LWludHJvZHVjZXMtbmV3LXB2ZGMtY29hdGluZy1zb2x1dGlvbi1mb3ItcGhhcm1hY2V1dGljYWwtYmxpc3Rlci1maWxtc9IBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxNDQtc29sdmF5LWludHJvZHVjZXMtbmV3LXB2ZGMtY29hdGluZy1zb2x1dGlvbi1mb3ItcGhhcm1hY2V1dGljYWwtYmxpc3Rlci1maWxtc9IBAA","guidislink":false,"published":"Mon, 02 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=275, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxNDQtc29sdmF5LWludHJvZHVjZXMtbmV3LXB2ZGMtY29hdGluZy1zb2x1dGlvbi1mb3ItcGhhcm1hY2V1dGljYWwtYmxpc3Rlci1maWxtc9IBAA?oc=5\" target=\"_blank\">Solvay Introduces New PVDC Coating Solution for Pharmaceutical Blister Films<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Solvay Introduces New PVDC Coating Solution for Pharmaceutical Blister Films - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxNDQtc29sdmF5LWludHJvZHVjZXMtbmV3LXB2ZGMtY29hdGluZy1zb2x1dGlvbi1mb3ItcGhhcm1hY2V1dGljYWwtYmxpc3Rlci1maWxtc9IBAA?oc=5\" target=\"_blank\">Solvay Introduces New PVDC Coating Solution for Pharmaceutical Blister Films<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Solvay, a global market leader in specialty materials, has introduced Diofan® Ultra736, a new polyvinylidene chloride (PVDC) coating solution with ultra-high water vapor barrier that allows carbon footprint reduction for pharmaceutical blister films. As an aqueous dispersion, Diofan® Ultra736 is fluorine-free, meets regulatory requirements for direct pharmaceutical contact and supports the design of sustainable films with thinner coating designs. “Consumers and legislators are requesting increased efforts related to carbon footprint reduction from the packaging industry, and one of the most effective means to this end is to reduce the size and weight of packaging products,” says Federico Baruffi, Global Marketing Manager, Packaging, Solvay Specialty Polymers. “Our new Diofan® Ultra736 coating solution can help packaging film manufacturers achieve superior barrier properties with thinner structures, leading to a significant carbon footprint reduction of the blister film.” Diofan® PVDC coatings are widely used in pharmaceutical blister packaging to protect sensitive solid-dose drug preparations as well as in the packaging of delicate food and similar other consumer goods. They can be applied on both plastic and paper-based substrates and are often preferred for their unique combination of water vapor and oxygen barrier. Diofan® Ultra736 PVDC coating was custom-engineered to maximize the water vapor barrier without sacrificing its high oxygen barrier, chemical resistance or transparency. The product also exhibits excellent thermoformability, enabling smaller pack sizes with higher pill density if compared with incumbent alternative coating solutions. Thanks to its ultra-high barrier performance, Diofan® Ultra736 allows the reduction of the coating thickness compared to incumbent mid to high barrier PVDC coatings, without impacting the functionality. In particular, it has been shown that, for Duplex barrier structures, Diofan® Ultra736 enables halving the number of base coat layers while delivering the same water vapor barrier. This approach can contribute to decreasing the overall carbon footprint of final blister film structures by up to 13%.","filter_flag":1}
{"title":"McDonald's partner investing in electric delivery fleet - FoodManufacture.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTAvMzAvTWNEb25hbGQtcy1wYXJ0bmVyLWludmVzdGluZy1pbi1lbGVjdHJpYy1kZWxpdmVyeS1mbGVldNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTAvMzAvTWNEb25hbGQtcy1wYXJ0bmVyLWludmVzdGluZy1pbi1lbGVjdHJpYy1kZWxpdmVyeS1mbGVldNIBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTAvMzAvTWNEb25hbGQtcy1wYXJ0bmVyLWludmVzdGluZy1pbi1lbGVjdHJpYy1kZWxpdmVyeS1mbGVldNIBAA","guidislink":false,"published":"Mon, 30 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=303, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTAvMzAvTWNEb25hbGQtcy1wYXJ0bmVyLWludmVzdGluZy1pbi1lbGVjdHJpYy1kZWxpdmVyeS1mbGVldNIBAA?oc=5\" target=\"_blank\">McDonald's partner investing in electric delivery fleet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"McDonald's partner investing in electric delivery fleet - FoodManufacture.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTAvMzAvTWNEb25hbGQtcy1wYXJ0bmVyLWludmVzdGluZy1pbi1lbGVjdHJpYy1kZWxpdmVyeS1mbGVldNIBAA?oc=5\" target=\"_blank\">McDonald's partner investing in electric delivery fleet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","source.href":"https:\/\/www.foodmanufacture.co.uk","source.title":"FoodManufacture.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The move makes Agrial Fresh Produce, part of the French agriculture group Agrial and home to the Florette foodservice brand, the first fresh produce supplier in the UK to deliver to McDonald’s with an electric HGV. The investment is part of a plan that will see Agrial Fresh Produce increase the number of fully electric vehicles within its distribution fleet. It also intends to replace its current fleet with energy-efficient, third-generation engine vehicles that deliver a 13% improvement in miles per gallon, which Agrial Fresh Produce calculates will translate to an 800 tonne reduction in CO2 emissions by the end of 2024. This announcement forms part of the Agrial group's climate plan, which targets a 50% direct reduction in greenhouse gas emissions and a 35% carbon footprint reduction by 2035. Earlier this year, Agrial Fresh Produce was awarded a Gold EcoVadis rating, which recognised the firm’s commitment to protecting the environment and promoting the use of sustainable farming methods. Agrial has a ‘continual drive to cut emissions’ Based in Wigan, Agrial Fresh Produce falls into the UK arm of Agrial’s vegetable division alongside Axgro, Agrial Fresh Farms and Florette. Jay Booth, head of logistics at Agrial Fresh Produce, said that the group has a commitment to finding solutions that will enable its operations to become more sustainable across all business divisions. “Our first electric HGV is part of our continual drive to invest in carbon saving innovation in as many areas as we can​,” Booth added. “We’re excited to be working with like-minded transport partners such as McDonald’s UK, Martin Brower UK, Volvo and others who share our passion. We can’t wait to see the trucks hit the road.”​ In other news, food and drink manufacturers from across Wales unveiled more than 200 new products at BlasCymru \/ TasteWales last week, an achievement minister Lesley Griffiths praised in an interview with Food Manufacture.​​","filter_flag":1}
{"title":"CJ Foods Names Dr. Gregory Yep to New CTO of Global Food R&D - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2otZm9vZHMtbmFtZXMtZHItZ3JlZ29yeS15ZXAtdG8tbmV3LWN0by1vZi1nbG9iYWwtZm9vZC1yZC0zMDE5NDkzMjguaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2otZm9vZHMtbmFtZXMtZHItZ3JlZ29yeS15ZXAtdG8tbmV3LWN0by1vZi1nbG9iYWwtZm9vZC1yZC0zMDE5NDkzMjguaHRtbNIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2otZm9vZHMtbmFtZXMtZHItZ3JlZ29yeS15ZXAtdG8tbmV3LWN0by1vZi1nbG9iYWwtZm9vZC1yZC0zMDE5NDkzMjguaHRtbNIBAA","guidislink":false,"published":"Mon, 09 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=282, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2otZm9vZHMtbmFtZXMtZHItZ3JlZ29yeS15ZXAtdG8tbmV3LWN0by1vZi1nbG9iYWwtZm9vZC1yZC0zMDE5NDkzMjguaHRtbNIBAA?oc=5\" target=\"_blank\">CJ Foods Names Dr. Gregory Yep to New CTO of Global Food R&amp;D<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CJ Foods Names Dr. Gregory Yep to New CTO of Global Food R&D - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2otZm9vZHMtbmFtZXMtZHItZ3JlZ29yeS15ZXAtdG8tbmV3LWN0by1vZi1nbG9iYWwtZm9vZC1yZC0zMDE5NDkzMjguaHRtbNIBAA?oc=5\" target=\"_blank\">CJ Foods Names Dr. Gregory Yep to New CTO of Global Food R&amp;D<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Footprint Reduction\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Appointment brings new CTO's 30 years of scientific and technical expertise to the company's fast-growing global food business SEOUL, South Korea, Oct. 9, 2023 \/PRNewswire\/ -- CJ Foods, a business unit of South Korea-based CJ CheilJedang, announced that it has appointed Dr. Gregory Yep (aged 57), former head of the R&D center at International Flavors & Fragrances (IFF), as the new CTO of its Global Food R&D division. Dr. Gregory Yep, CTO of Global Food R&D at CJ Foods Yep comes to CJ Foods with an extensive 30+ year career in R&D. He began his career at McCormick in 1993 after earning his doctorate in organic chemistry from Johns Hopkins University. Over the past three decades, he served in various R&D roles at several well-established F&B companies, such as PepsiCo and IFF. Yep's preeminent scientific and technical expertise is closely aligned with CJ Foods' key strategic goals, such as GSP (Global Strategic Product) scale-up, global territory expansion, and identification of white space opportunities. The company is excited about the contributions Yep will bring to executing these strategies to accelerate global growth, for example in CJ's push for product innovations that cater to ever-evolving consumer needs. Yep also has a strong commitment to sustainability, with an emphasis on carbon footprint reduction through sustainable packaging development, manufacturing processes and supply chain management. He also plans to leverage collaborations with other research institutes, experts, and partners, creating synergies that facilitate CJ Foods' development of a truly global R&D organization and setting CJ Foods further apart from competitors. \"We're delighted that someone of Greg's caliber is joining CJ Foods to contribute to our vision of becoming a global leader in food,\" said Minsok Pak, CEO of CJ Foods. \"Our leading Korean food products under the bibigo brand are already beloved by consumers all over the world, and we are excited about the leadership that Greg will provide in our efforts to create a world-class R&D organization.\" Before joining CJ, Yep was the Chief Research & Development, Global Integrated Solutions and Sustainability Officer at IFF, a leading technology and ingredients company based in New York. During his career, he developed distinctive expertise and know-how that span beyond food, including beverage, health, bioscience, and fragrance. Armed with both R&D expertise and insightful business acumen, Yep has earned a reputation as an astute strategist for his pivotal role in delivering business expansion and globalization as CTO. For example, while at PepsiCo, he led the innovation of Gatorade Sports Science Institute to shift the brand's value proposition from a thirst quencher to a healthy sports drink, successfully revitalizing the brand and its business performance. His deep insights and understanding of consumer goods, shaped by his extensive experiences across various roles in both B2B (IFF) and B2C (PepsiCo), have spurred innovation at every R&D organization he has led. About CJ Foods CJ Foods, a business unit of CJ CheilJedang, is a global food company delivering a variety of products ranging from foodstuffs and frozen\/chilled foods to appetizers. As the largest food company in Korea with global sales of 11.1 trillion KRW in 2022, CJ Foods is now leading the globalization of Korean food with its fast-growing bibigo brand. Under bibigo, CJ currently focuses on seven delicious Global Strategic Products of K-food, including Mandu (Korean-style dumpling), chicken, processed rice, Korean sauce, Kimchi, Gim (seaweed), and roll to global consumers. The company operates over 60 sites in multiple regions worldwide including South Korea, the U.S. (Schwan's Company), China, Japan, Southeast Asia, Europe, and Oceania. For more information, visit https:\/\/www.cj.co.kr\/en\/about\/business\/food About CJ CheilJedang CJ CheilJedang is a South Korea-based food & bio company operating globally. Founded in 1953 as the first Korean sugar manufacturer, it is now a leading global food player with brands such as bibigo. It also provides advanced bio products including feed and food additives made by its cutting-edge, fermentation-based bioengineering technologies. The company recorded sales of 30 trillion KRW in 2022. CJ CheilJedang is part of CJ Group, an international company in the fields of Food & Food Services, Bio & Pharma, Entertainment & Media, and Retail & Logistics. For more information, visit https:\/\/www.cj.co.kr\/en SOURCE CJ CheilJedang","filter_flag":1}
