{"title":"LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5","id":"CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA","guidislink":false,"published":"Wed, 09 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=221, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5\" target=\"_blank\">LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5\" target=\"_blank\">LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The new $50 million facility sets the stage for LRS to significantly and sustainably divert more materials from the region's landfills and reduce the overall carbon footprint of the waste and recycling process. ROSEMONT, Ill., Aug. 9, 2023 \/PRNewswire\/ -- LRS — the nation's fifth largest independent waste diversion, recycling and portable services provider — proudly announces the grand opening of The Exchange, a state-of-the-art material recovery facility (MRF) revolutionizing waste management and recycling practices. The new facility is located in the Stockyards neighborhood of Chicago and marks LRS' pursuit to reshape the future of waste and recycling to lessen environmental impact across the Midwest. The Exchange marks a significant milestone in LRS' mission to foster positive change within the industries and communities it serves through responsible waste practices. The Exchange boasts an impressive processing capacity of 25 tons of recyclables per hour and plans for future expansion to 35 tons per hour, playing a pivotal role in enhancing waste diversion efforts in the Chicagoland area. \"The Exchange stands as a powerful embodiment of our vision to become the safest, most innovative waste recycler globally,\" said John Larsen, Chief Operating Officer at LRS. \"It symbolizes our unwavering dedication to spearhead transformative change, not only within our industry but also within the communities we have the privilege to support.\" The facility — which is positioned within LRS' 25-acre eco-park and creates a centralized location to house over 140 waste and recycling trucks to reduce transportation costs and emissions — is equipped to handle various types of waste, including single-stream recyclables, non-hazardous and non-special Municipal Solid Waste (MSW), and other recyclable materials. It uses cutting-edge sorting equipment, including six optical sorters, a CP Auger Screen and three Fire Rover Units, all managed by a skilled team of 11 sorting staff members. The Exchange is projected to divert 224 million pounds of recyclables annually, resulting in thousands of tons of avoided CO2 emissions. The Exchange has not only made significant strides in environmental sustainability, but has also made a positive economic impact on the community. The facility has created over 50 new permanent positions and generated 95 construction jobs. Additionally, it supplies viable recyclable materials to numerous mills in the Midwest, contributing to regional economic development. \"Chicago is proud to welcome The Exchange Facility, a new and technologically advanced recycling sorting facility within city limits that marks an important step in our journey toward sustainable waste management,\" said Department of Streets and Sanitation Commissioner Cole Stallard. \"The Exchange builds efficiencies into our municipal recycling operations, helping us move closer to our waste diversion goals, and ultimately a cleaner, greener, and more resilient Chicago.\" To celebrate this momentous achievement, LRS is hosting a grand opening of The Exchange on August 9, 2023. The event includes a ribbon-cutting ceremony and a celebration following at Marz Brewing Company. Local city officials, the Mayor's Office, long-term partners, members of the media, LRS team members, and more are attending the event. The development of The Exchange was made possible through an investment of over $50 million, along with crucial capital support from a range of different investors, including Closed Loop Partners, a leading circular economy investment firm. In partnership with Closed Loop Partners, LRS aims to integrate new technologies into the facility and bolster potential end markets for recycled materials, furthering the establishment of robust circular systems in the region. \"Closed Loop Partners' Infrastructure Group is proud to invest in leading private and public organizations advancing infrastructure and technologies for materials circularity,\" says Jennifer Louie, managing director, Closed Loop Infrastructure Group, Closed Loop Partners. \"LRS is a leader in building the infrastructure for a circular economy in the Chicagoland region. With capital from our Closed Loop Infrastructure Fund, Circular Plastics Fund and Beverage Fund, we are thrilled to work with the LRS team to improve recycling systems in one of the largest cities in the U.S. Establishing strong partnerships with industry stakeholders remains a core tenet of our work at Closed Loop Partners and we are excited to have the support of the American Beverage Association in this project through Every Bottle Back and our Closed Loop Beverage Fund.\" In addition to the grand opening of The Exchange, LRS is proud to partner with the City of Chicago, Department of Streets of Sanitation (DSS) to unveil the Blue Cart Recycling Map. The City's Blue Cart program provides bi-weekly recycling services via LRS and DSS trucks to single-family homes and multi-unit buildings with four or fewer units in Chicago. The Blue Cart Recycling Map showcases the journey of Chicago's recycling and shares how and where material is sorted as well as tonnage data of recycled materials. Check out the map on DSS's website . The grand opening of The Exchange builds on a transformative beginning to 2023 for LRS. This period included the regionalization of all company operations and the strategic acquisition of Michiana Recycling and Disposal, as well as Environmental Recycling & Disposal and Moen Transfer Station. These impressive business moves serve as a strong indicator of the continued growth and progress that awaits LRS throughout the remainder of this year. For more information about LRS and its groundbreaking facility, The Exchange, please visit lrsrecycles.com . About LRS LRS is among the nation's leading independent waste diversion, recycling and portable services providers. Since 2013, LRS has specialized in delivering an exceptional customer experience for millions of residential and commercial customers across nine states: Illinois, Wisconsin, Iowa, Indiana, Michigan, Minnesota, Kansas, Arkansas and Tennessee. Diversified and growing, LRS also offers affordable roll-off container services, C&D recycling, portable restroom rentals, on-site storage and temporary fencing. LRS owns and operates more than 70 facilities and thrives on the passion of nearly 2,300 full-time employees. The company provides safe, innovative, sustainability-driven services to clean and beautify the cities, neighborhoods, and communities it serves. To learn more visit www.LRSrecycles.com . Media Contact: Meghan Kelly lrs@spoolmarketing.com (630) 360-0020 SOURCE LRS","filter_flag":1}
{"title":"Three-week black bag collections but where do your recycled material end up? - AberdareOnline","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmFiZXJkYXJlb25saW5lLmNvLnVrLzIwMjMvMDgvMjMvdGhyZWUtd2Vlay1ibGFjay1iYWctY29sbGVjdGlvbnMtYnV0LXdoZXJlLWRvLXlvdXItcmVjeWNsZWQtbWF0ZXJpYWwtZW5kLXVwL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmFiZXJkYXJlb25saW5lLmNvLnVrLzIwMjMvMDgvMjMvdGhyZWUtd2Vlay1ibGFjay1iYWctY29sbGVjdGlvbnMtYnV0LXdoZXJlLWRvLXlvdXItcmVjeWNsZWQtbWF0ZXJpYWwtZW5kLXVwL9IBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LmFiZXJkYXJlb25saW5lLmNvLnVrLzIwMjMvMDgvMjMvdGhyZWUtd2Vlay1ibGFjay1iYWctY29sbGVjdGlvbnMtYnV0LXdoZXJlLWRvLXlvdXItcmVjeWNsZWQtbWF0ZXJpYWwtZW5kLXVwL9IBAA","guidislink":false,"published":"Wed, 23 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=235, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmFiZXJkYXJlb25saW5lLmNvLnVrLzIwMjMvMDgvMjMvdGhyZWUtd2Vlay1ibGFjay1iYWctY29sbGVjdGlvbnMtYnV0LXdoZXJlLWRvLXlvdXItcmVjeWNsZWQtbWF0ZXJpYWwtZW5kLXVwL9IBAA?oc=5\" target=\"_blank\">Three-week black bag collections but where do your recycled material end up?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AberdareOnline<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Three-week black bag collections but where do your recycled material end up? - AberdareOnline","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmFiZXJkYXJlb25saW5lLmNvLnVrLzIwMjMvMDgvMjMvdGhyZWUtd2Vlay1ibGFjay1iYWctY29sbGVjdGlvbnMtYnV0LXdoZXJlLWRvLXlvdXItcmVjeWNsZWQtbWF0ZXJpYWwtZW5kLXVwL9IBAA?oc=5\" target=\"_blank\">Three-week black bag collections but where do your recycled material end up?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AberdareOnline<\/font>","source.href":"https:\/\/www.aberdareonline.co.uk","source.title":"AberdareOnline","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Three-week black bag collections but where do your recycled material end up? Rhondda Cynon Taf Council waste collections have been in the news of late and a bit controversial for some people with the 3 weekly collections imposed on residents; waste from Rhondda Cynon Taf Council hit the headlines back in 2019 when plastic waste was discovered piled up in a jungle more than 6,500 miles away in Malaysia. Unfortunately for the council at the time the BBC was doing a series of programs about waste and recycling, I expect some of you will remember the BBC television personality Hugh Fearnley-Whittingstall interviewing the RCT Council Group Director, Prosperity, Development and Frontline Services at the Amgen Cymru waste site Bryn Pica Llwydcoed, the director cut the interview short when Fearnley-Whittingstall questioned him about the councils waste found in Malaysia. The council used an outside contractor Telford-based Lovell Recycling has issue a statement after having been named in relation to a television program over exports of plastic waste to Malaysia, Lovell Recycling was dissolved on 26 June 2022. Rhondda Cynon Taf made a statement to assure residents that “less than 3%” of its waste is exported, and that the overwhelming majority of the recycling done by those who live in the county does not end up blotting a foreign landscape. So where do our council send our waste now, following a Freedom of Information and Environment Information Regulations request the council supplied AberdareOnline with part answers to questions set, the questions and some answers below. I am writing to you under the Freedom of Information and Environmental Information Regulations to request answers to the following questions regarding recycling practices at Rhondda Cynon Taf Council: 1. What percentage of collected recycling is considered unrecyclable due to contamination, as a result of using the current waste recycling vehicle with a process of compacting and compressing the recycling together, in comparison to the alternative use of a vehicle with separate compartments? During the period Apr-22 to Mar-23, 81% of dry mixed recycling collected was recovered. The residual quantity will include materials that cannot be recycled as well as contaminated recyclable materials. The precise quantities affected by contamination is not recorded. 2. At the stage when the recycling vehicle and its recycled waste content are weighed on the weighbridge before entering the recycling sorting center, is this weight considered as completed recycled material, or is it recorded as the weight of the recycling prior to sorting? The weight of recycling reported by the Council to Welsh Government is not taken from weighbridge measurement of DMR on entry to the Bryn Pica Facility. Recycling percentages are calculated based on sorted material reaching a recycling end destination. 3. Is the weight of recycling recorded at the weighbridge the official amount that you provide to the Welsh Government in your statistics report? As above. 4. Once the recycling has been processed into its different categories, do you weigh each type of recycled material that has been sorted, and is this weight reported to the Welsh Government in your statistics? Yes, each material recycling stream (metal, paper, plastic and glass) is sorted at our Bryn Pica facility and weighed prior to sending to recycling companies. Regarding specific types of recyclable materials: 5. Are plastic bags not recyclable? If they are recyclable, where do you send the council plastic bags for processing? We class plastic bags as plastic film. Whilst there are recycling options for plastic film, the technology and availability of capacity is generally underdeveloped within the UK and as such the processing capacity available to councils is limited. The Council’s waste management contractor is currently undertaking trials with a recycling company based in Wales to recycling this material. Where we cannot recycle plastic bags they will be sent for recovery within the Trident Park Energy from Waste Facility. 6. Where do you send your recycled Polyethylene Terephthalate (PET or PETE), such as drink bottles, food bottles\/jars like salad dressing, peanut butter, honey, etc.? The plastics received via DMR collections are graded into a PET\/HDPE blend inclusive of Pots tubs and trays. The waste type is sent to plastic recovery facilities in England. The facilities may vary throughout the length of any given contract but are primarily sent to a site in Derby. 7. Where do you send your recycled High-Density Polyethylene (HDPE), such as milk cartons, detergent bottles, cereal box liners, toys, and buckets? As above 8. Where do you send your recycled Polyvinyl Chloride (PVC or Vinyl), including items like plumbing pipes, credit cards, human and pet toys, rain gutters, and others? As PVC is knownto leach dangerous toxins throughout its lifecycle, such as lead, dioxins, and vinyl chloride, it is considered the most dangerous plastic to human health. Large bulky plastics recovered at HWRC (CRC site in RCT) will be sent locally to Neath for sorting. Any waste types that can’t be recycled will be sent for incineration in Cardiff ERF. Smaller non-recyclable items received at Kerbside will also be sent for incineration at Cardiff ERF or other similar facility. 9. Where do you send your recycled Low-Density Polyethylene (LDPE), which includes flexible versions of HDPE and is commonly used for plastic\/cling wrap, sandwich and bread bags, bubble wrap, garbage bags, and carrier bags? As response to Q5. We do not separate bags specifically but produce a mixed soft plastic grade. 10. Where do you send your recycled Polypropylene (PP), including items like straws, bottle caps, prescription bottles, hot food containers, packaging tape, and DVD\/CD boxes? The PP will be included within one of the two above-mentioned grades depending on its capture area. Smaller uneconomical or difficult to capture items to recycle will be sent for incineration at Cardiff ERF or other similar facility. 11. Where do you send your recycled Polystyrene (PS or Styrofoam), such as cups, takeout food containers, shipping and product packaging, egg cartons, cutlery, and building insulation? White packaging Polystyrene will be recovered for extrusion into new products via the HDPE\/PET PTT contractor. All other food packaging polystyrenes will be sent for incineration. 12. Where do you recycle other types of plastic that do not belong in any of the previous categories or are combinations of multiple types? Are these types of plastic recycled or incinerated? Examples of such combinations include eyeglasses, baby and sports bottles, electronics, CD\/DVDs, lighting fixtures, and clear plastic cutlery.As above. Any plastics that do not fall into specific grades of Bottles Pots tubs and Trays, Rigid plastics, flexible plastics or UPVC are send for incineration. Electronics are managed in line with relevant WEEE legislation\/Directives and are stored, transferred, and recycled accordingly via a producer compliance scheme. 13. Where do you send recycled aluminium cans? Additionally, does this vary depending on where you can achieve the highest price for scrap aluminium? During the reporting year Apr-22 to Mar-23 aluminum cans collected by the Council were sent to various recycling companies in accordance with the RCTCBC DPS contract. 14. Where do you send mattresses to be recycled? It is known that most mattresses are around 80% recyclable in the correct facilities, but according to the National Bed Federation (NBF), only around 19% of mattresses are currently recycled. Bryn Pica, the site has a dedicated mattress recycling facility. 15. Do you send all mattresses received to be recycled, or is there a percentage that goes into landfill or is incinerated? All suitable mattresses are recycled. Unsuitable mattresses are sent for recovery at the Trident Park Energy from Waste Facility. 16. Does Ty Amgen, the Local Authority Waste Disposal Company owned by the council, still accept recycling from Ceredigion County Council? No. 17. Does Rhondda Cynon Taf Council still dispose of Ceredigion County Council waste at Bryn Pica Llwydcoed? No. 18. Does Rhondda Cynon Taf Council dispose of all black bin waste at the Cardiff Energy Recovery Facility (ERF), as you are not part of the Prosiect Gwyrdd? Yes. Regarding Dyfed Recycling, which is part of Owens Group UK and utilizes your services at Amgen Cymru. Dyfed Recycling is a private company that operates in other local authority areas including Llanelli Council, Swansea Council, Neath Council, Port Talbot Council and Carmarthen Council. 19. Does Ty Amgen redistribute recycled waste from Dyfed Recycling? No. Amgen Cymru does not have any business dealing with Dyfed Recycling. 20. Does Ty Amgen accept all types of waste including recycling from Dyfed Recycling and dispose of it in landfill? No. As above. Having followed a Dyfed Recycling vehicle through the A465 roadworks to observe the vehicle turn right at the Baverstock junction and onto the Ty Amgen site, the Local Authority Waste Disposal Company owned by the council. Now the question is why has the council said, Amgen Cymru does not have any business dealing with Dyfed Recycling. AberdareOnline has requested the council to provide an answer as to why the vehicle was on the site if Amgen Cymru or the council does not have any business dealing with Dyfed Recycling. To date, the council has not responded. Dyfed Recycling is not a one-man band it is part of Owens Group UK with a turnover of 70 million. It would appear quite a bit of the recycled material residents assemble and place in clear recycling bags is not recycled but ends up in an incinerator in Cardiff after all. Image RCT Council FB","filter_flag":1}
