{"title":"EcoFlow Powers Up for Amazon's Prime Big Deals Day with Unbeatable Savings - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctcG93ZXJzLXVwLWZvci1hbWF6b25zLXByaW1lLWJpZy1kZWFscy1kYXktd2l0aC11bmJlYXRhYmxlLXNhdmluZ3MtMzAxOTQxNTY5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctcG93ZXJzLXVwLWZvci1hbWF6b25zLXByaW1lLWJpZy1kZWFscy1kYXktd2l0aC11bmJlYXRhYmxlLXNhdmluZ3MtMzAxOTQxNTY5Lmh0bWzSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctcG93ZXJzLXVwLWZvci1hbWF6b25zLXByaW1lLWJpZy1kZWFscy1kYXktd2l0aC11bmJlYXRhYmxlLXNhdmluZ3MtMzAxOTQxNTY5Lmh0bWzSAQA","guidislink":false,"published":"Sun, 01 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=274, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctcG93ZXJzLXVwLWZvci1hbWF6b25zLXByaW1lLWJpZy1kZWFscy1kYXktd2l0aC11bmJlYXRhYmxlLXNhdmluZ3MtMzAxOTQxNTY5Lmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Powers Up for Amazon's Prime Big Deals Day with Unbeatable Savings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EcoFlow Powers Up for Amazon's Prime Big Deals Day with Unbeatable Savings - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctcG93ZXJzLXVwLWZvci1hbWF6b25zLXByaW1lLWJpZy1kZWFscy1kYXktd2l0aC11bmJlYXRhYmxlLXNhdmluZ3MtMzAxOTQxNTY5Lmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Powers Up for Amazon's Prime Big Deals Day with Unbeatable Savings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly energy solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Fall into savings with exclusive deals on best-selling products Oct. 1 to 15 SEATTLE, Oct. 1, 2023 \/PRNewswire\/ -- With the return of cold weather, EcoFlow , a portable power and eco-friendly energy solutions company, is offering its biggest discounts ever on its best-selling portable power stations for Amazon's Prime Big Deals Day sales event. Customers can save on EcoFlow's portable power stations, solar generators, smart devices and more from Oct. 1 to 15. Fall into savings with EcoFlow's exclusive deals on best-selling products Oct. 1 to 15 Whether adventurers seek to power their fall outdoor experiences or early-bird shoppers aim to get ahead of holiday shopping, all of EcoFlow's products are in stock for a hassle- and delay-free shopping experience. EcoFlow will have exclusive deals on their DELTA series including: DELTA Pro : Save up to $900 on DELTA Pro portable power station and up to $2,299 on the DELTA Pro and Smart Extra Battery bundle, for those looking for additional power. Designed for home backup and emergency preparedness with a total 3.6kWh capacity (expandable to 25kWh), it can power your home for days. DELTA Pro has been chosen by 150,000 customers worldwide as an indispensable addition to their homes for safe and reliable backup power. : Save up to on DELTA Pro portable power station and up to on the DELTA Pro and Smart Extra Battery bundle, for those looking for additional power. Designed for home backup and emergency preparedness with a total 3.6kWh capacity (expandable to 25kWh), it can power your home for days. DELTA Pro has been chosen by 150,000 customers worldwide as an indispensable addition to their homes for safe and reliable backup power. DELTA 2: Save up to $250 on DELTA 2, a great solution for tailgating during the football season or preparing for unexpected winter power outages. A versatile power station with 1kWh energy storage that can power over 90% of appliances and charge seven times faster than competitors. DELTA 2 is a top seller, with over 200,000 customers recommending it for its exceptional performance and reliability. Save up to on DELTA 2, a great solution for tailgating during the football season or preparing for unexpected winter power outages. A versatile power station with 1kWh energy storage that can power over 90% of appliances and charge seven times faster than competitors. DELTA 2 is a top seller, with over 200,000 customers recommending it for its exceptional performance and reliability. DELTA 2 Max: Save up to $300 when purchasing DELTA 2 Max, the newest addition to the lineup. Its lightweight design and portability make it suitable when on the go, whether camping or RVing. Add EcoFlow portable solar panels to create a generator free of fume, noise maintenance. This portable power station boasts a 2kWh capacity and keeps your essentials running when you need them most. Other incredible deals include EcoFlow's Smart Devices, including 40% off WAVE 2, a portable battery-powered AC and heating unit with add-on battery and 160W solar panel for year-round outdoor comfort. Customers can enjoy 19% off GLACIER , a portable fridge with integrated ice maker, plug-in battery, wheels, handle, and 110W solar panel, perfect for extended off-grid cooling. On Oct. 3, 6, 9 and 15, EcoFlow will have six-hour flash sales from 12 p.m. ET to 6 p.m. ET. Customers can save up to 48% on bundles including DELTA Pro Extra Battery, DELTA 2 with DELTA 2 waterproof bag, RIVER 2 with a 60W portable solar panel, RIVER 2 Max with a 160W portable solar panel and more. All of these deals are available through the EcoFlow website and the EcoFlow Amazon Store . About EcoFlow EcoFlow is a leading eco-friendly energy solutions company with the vision to power a new world. Since its founding in 2017, EcoFlow aims to become a reliable and trusted energy companion for individuals and families across the world, providing accessible and renewable power solutions at home, outdoors, and in mobile spaces. Today, with operational headquarters located in the USA, Germany, and Japan, EcoFlow has empowered more than 2.5 million users in over 100 markets worldwide. For more information, visit https:\/\/www.ecoflow.com\/us . SOURCE EcoFlow Technology Inc.","filter_flag":1}
