{"title":"How to Manage Resource Constraints with New Abundance | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LXRvLW1hbmFnZS1yZXNvdXJjZS1jb25zdHJhaW50cy13aXRoLW5ldy1hYnVuZGFuY2XSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LXRvLW1hbmFnZS1yZXNvdXJjZS1jb25zdHJhaW50cy13aXRoLW5ldy1hYnVuZGFuY2XSAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LXRvLW1hbmFnZS1yZXNvdXJjZS1jb25zdHJhaW50cy13aXRoLW5ldy1hYnVuZGFuY2XSAQA","guidislink":false,"published":"Wed, 11 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=11, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LXRvLW1hbmFnZS1yZXNvdXJjZS1jb25zdHJhaW50cy13aXRoLW5ldy1hYnVuZGFuY2XSAQA?oc=5\" target=\"_blank\">How to Manage Resource Constraints with New Abundance | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How to Manage Resource Constraints with New Abundance | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LXRvLW1hbmFnZS1yZXNvdXJjZS1jb25zdHJhaW50cy13aXRoLW5ldy1hYnVuZGFuY2XSAQA?oc=5\" target=\"_blank\">How to Manage Resource Constraints with New Abundance | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Since the industrial revolution, we’ve lived in an economic system predicated on high growth. For the past 20 years, that growth has relied on an abundance of capital and other external resources and has benefited from tailwinds like global economic integration. Today, however, that model is at risk — we can see the limits of resource abundance encroaching on multiple timescales. The acute constraints we’ve experienced since the COVID pandemic began, including supply chain disruption, declining workforce availability, and energy shortages, are slowing the rebound to normal rates of growth. Furthermore, slower rebound can be an early warning indicator of deeper systemic change, in this case signaling an era of protracted scarcity of labor, capital, and natural resources that will make growth harder and require new strategies. This new scarcity could threaten the successful business models of today’s large companies, which are built on virtually unlimited access to resources such as labor, raw materials, and energy. But threats to current business models need not threaten business itself, so long as firms embrace new constraints, leverage them to advantage, and perhaps, in the process, uncover new sources of abundance. Recall Michael Porter’s “The Competitive Advantage of Nations” in Harvard Business Review, which argues that a nation’s competitive advantages sometimes stem precisely from those areas with the tightest bounds. Japan, for example, pioneered lean production techniques in part because it was a mountainous island nation with very little excess land. Singapore is another example of a prosperous but highly resource-constrained economy. These constraint-related advantages may include more integrated approaches to sustainability, new types of resource efficiency, and innovation around new inputs. They may also include more radical approaches such as de-materialization or an emphasis on well-being over physical production and consumption. Ultimately, the ability to navigate this environment can be a significant competitive differentiator, giving rise to a new set of models for thriving in a new context. The End of Abundance? Three major global trends are driving resource scarcity for businesses: First, capital is becoming less abundant as interest rates rise, ending a two-decade streak of nearly free capital. In the medium term, interest rates are projected to settle well above the near-zero levels of the past 20 years. Also, the tailwind of global economic integration has played out. Second, pandemic-induced labor shortages are merely a prelude to more widespread and persistent labor scarcity. Compounding pandemic-related shortages, the WEF estimates that, by 2025, half of all workers globally will need to reskill to meet changing labor demands. And the long-term challenge of population aging and decline will take hold in the coming years; the UN reports that two-thirds of the global population already live in countries with births below the replacement rate. Migration into those countries is likely the only way to prevent population decline. Third, the supply chain woes of recent months are also merely harbingers of more persistent resource depletion, scarcity, or price increases. Resource scarcity is already apparent for some inputs like water, which the WWF says will be insufficient for two-thirds of the world’s population by 2025. Depletion of other inputs, including many chemical elements, may occur within the century. Further, as planetary challenges push countries to begin pricing in externalities like climate change, current business models will likely come under pressure even before depletion is fully apparent. For businesses, it will become harder and harder to find easy growth by relying on traditional notions of abundance. Instead, businesses will need to innovate to create new types of abundance, whether that comprises novel sources of talent or new types of input to create offerings with fewer harmful externalities. Prosperity Without Easy Growth Farsighted leaders will counter the global boundary-tightening trends by rethinking business models to navigate and even exploit scarcity in the short term and to find new abundance in the long. This will require leaders to take various strategic actions on different time horizons. Today, adapt your market positioning and your stance on innovation to mitigate and exploit scarcity to your advantage. These actions will be familiar to most companies from other contexts. The challenge will be to take sufficient action, with sufficient speed. Reposition for growth. In each economic crisis, demand patterns shift, and winning formulae for growth change. Even in times of low aggregate growth within a sector or an entire economy, there is always growth somewhere, so reposition into product and market segments that are growing. The 2008 financial crisis significantly shifted demand patterns. So did COVID-19, which significantly increased consumer appetite for digital shopping and consumption. Dell had done big business selling desktop computers to companies. But when the pandemic hit and work-from-home materialized, companies no longer wanted desktops; instead, they had an increased need for laptops for their employees. Dell was able to capitalize on the shift and is now better positioned to support enduring changes in the pattern of work. Now, an impending crisis of scarcity is priming consumers to shift their demands toward sustainable and long-lasting products, as well as to experience and entertainment services. In each economic crisis, demand patterns shift, and winning formulae for growth change. Even in times of low aggregate growth within a sector or an entire economy, there is always growth somewhere, so reposition into product and market segments that are growing. The 2008 financial crisis significantly shifted demand patterns. So did COVID-19, which significantly increased consumer appetite for digital shopping and consumption. Dell had done big business selling desktop computers to companies. But when the pandemic hit and work-from-home materialized, companies no longer wanted desktops; instead, they had an increased need for laptops for their employees. Dell was able to capitalize on the shift and is now better positioned to support enduring changes in the pattern of work. Now, an impending crisis of scarcity is priming consumers to shift their demands toward sustainable and long-lasting products, as well as to experience and entertainment services. Expand talent access. Adapt your talent strategy for advantage today and tomorrow. Create a “bionic organization” by focusing human talent where it is needed most, in areas requiring imagination, empathy, or ethics, and leveraging AI where it is especially adept. Further, broaden your talent search, in order to find the best talent and the freshest perspectives. Expand the search at home by developing upskilling or reskilling capabilities to support evolving talent needs and reach underrepresented populations. For example, Amazon must rely on nontraditional IT and tech workers to staff its rural data centers, so they train talent by partnering with local community colleges to create purpose-built vocational programs. Expand supply by making your talent search global, and by creating a culture and a structure that support borderless collaboration. Africa and South America will have the most population growth in the next century and will therefore be potential sources of labor. Start building an international culture in your company now. Rakuten, a Japan-based e-commerce firm, made the transition early and mandated in 2010 that the company become English-first, in order to become globally relevant. The transition took two years, but the company reaped the rewards, growing revenues from $3.9 billion in 2010 to $15.3 billion in 2021. Build resilient supply systems. We know from physics that there are often early warning signs of critical phase transitions (such as collapses) in complex systems. The signs include increased variance and a slowing down of the return to normal after disturbance. We have seen both occur in supply systems during the COVID pandemic, requiring a more holistic approach to enterprise resilience. For example, Totino’s faced a rotating list of ingredient shortages for its frozen snack, so the company developed a modular set of 25 recipes that allowed it to continue producing despite such shortages. Diversity (in this case of recipes) is one of the six principles that form the pillars of system resilience. Adaptability, another pillar of resilience, can be very valuable in adjusting production capacity in volatile markets. This is relevant in all businesses—even in aluminum smelting, with its notoriously inflexible manufacturing systems. For example, TRIMET, a German aluminum producer, invested in new technology to allow its smelters to vary energy consumption and aluminum production by up to 25% in either direction (compared with the usual range of 5%). This allows TRIMET to adjust consumption to produce at off-peak hours, saving money and energy. In the new volatile and resource-constrained context, companies will have even more reason to tap into each of the six biological principles for creating resilient systems: diversity and adaptability, discussed above, as well as redundancy, modularity, prudence, and embeddedness. In the medium term, find new abundance through innovation and by making environmental sustainability a durable competitive advantage. It’s a challenging task—currently, only 20% of businesses even claim to be able to accomplish it—but it has the power to create true differentiation. Innovate for growth. A stagnating industry or economy is not a death sentence for an individual company. If you can’t find growth passively, make it happen. To that end, innovate to defy the industry average growth rate. In scarcity-constrained, low-growth environments, innovation becomes more important as companies compete more viciously for limited resources. By creating offerings using new inputs and business models, innovators can find reprieve and new abundance. A stagnating industry or economy is not a death sentence for an individual company. If you can’t find growth passively, make it happen. To that end, innovate to defy the industry average growth rate. In scarcity-constrained, low-growth environments, innovation becomes more important as companies compete more viciously for limited resources. By creating offerings using new inputs and business models, innovators can find reprieve and new abundance. Practice disciplined innovation. Continued evolution in technology, shifting economics of input resources, and demands for more sustainable business models require innovation at the very same time that an elevated cost of capital makes it more expensive. A new, more disciplined approach to innovation is therefore necessary. One such approach would be the adoption of “co-ambidexterity,” wherein the assumed tradeoff between exploration and exploitation is broken. Customer interactions are mined more effectively to identify and shape emerging preferences with shorter learning cycles and more targeted innovation. Continued evolution in technology, shifting economics of input resources, and demands for more sustainable business models require innovation at the very same time that an elevated cost of capital makes it more expensive. A new, more disciplined approach to innovation is therefore necessary. One such approach would be the adoption of “co-ambidexterity,” wherein the assumed tradeoff between exploration and exploitation is broken. Customer interactions are mined more effectively to identify and shape emerging preferences with shorter learning cycles and more targeted innovation. Leverage “sustainability scarcity.” When many companies simultaneously attempt to shift to environmentally sustainable and renewable materials, a new (more temporary) scarcity takes hold in the market for sustainable goods. Build advantage by getting one step ahead of such cascading shortages; embrace the bottleneck, and then work to help solve it for yourself and your industry. Do this either by securing your own supply of sustainable materials, as both Coca-Cola and Pepsi have done through investments in recycled plastic R&D and infrastructure, or by contributing to the formation of sustainable resource markets by advocating for advantageous policy, investing in early innovation, or forming coalitions to address supply chain constraints. When many companies simultaneously attempt to shift to environmentally sustainable and renewable materials, a new (more temporary) scarcity takes hold in the market for sustainable goods. Build advantage by getting one step ahead of such cascading shortages; embrace the bottleneck, and then work to help solve it for yourself and your industry. Do this either by securing your own supply of sustainable materials, as both Coca-Cola and Pepsi have done through investments in recycled plastic R&D and infrastructure, or by contributing to the formation of sustainable resource markets by advocating for advantageous policy, investing in early innovation, or forming coalitions to address supply chain constraints. Build sustainable business models. Business leaders must reinvent business models so that companies can thrive even as consumers and governments become more concerned with preventing degradation to the planetary systems that support life. We find that the most successful sustainable business model innovators have reimagined their core business models around new environmental, societal, and financial priorities, rather than simply adding sustainability as a separate consideration. There are many archetypal strategic moves that businesses can make to transform current business models into sustainable ones, including owning the origins, owning the whole cycle, expanding societal value, expanding value chains, innovating in ecosystems, relocalizing or regionalizing, energizing the brand, and building bridges across sectors. For example, Cotopaxi made a name for itself in the outdoor gear market with its colorful bags and clothing by expanding societal value, energizing the brand, and expanding value chains. The zany, mismatched fabric combinations come from the company philosophy of using fabric scraps from other, bigger bags. The company made sustainability and waste reduction synonymous with its brand, and in doing so found market success with a model that minimizes the raw inputs required. In the long term, prepare for a world where material growth may be severely constrained in aggregate. The growth hockey stick, which began with the industrial revolution and created modern business and society, cannot continue indefinitely for reasons of both simple arithmetic and ecological sustainability. We currently have few answers as to how continued prosperity can be reconciled with these escalating constraints. But we can reasonably suppose that the path forward will involve both reducing the material intensity of production and consumption and realigning economic value with what we as humans will value in a resource-constrained future. Stop relying on material growth. Dematerialize your product offering by taking “reduce, reuse, recycle” to the next level; embracing the service and experience underpinning product offerings; or innovating in the digital realm. Selfridges, the British department store, set a goal of having half of its customer transactions based on resale, repair, rentals, or reuse by 2030. This benefits customers, who will have more options for engagement with the brand, and Selfridges, which will create durable business lines with lower material intensity. Importantly, it will also benefit the earth. When it comes to experience, luxury clothing brands are also pioneers. The luxury sneaker brand Golden Goose differentiates itself in a crowded space by promising the highest level of shoe repair. It fits the company’s brand of quality shoes that are built to last and creates an immaterial business arm and differentiator. Another tack that luxury fashion brands could lead is expansion into the metaverse; Morgan Stanley projected in 2021 that luxury fashion in the metaverse could be a $50 billion industry by 2030. Whatever method a business takes to dematerialize, the result is both lower cost and a decoupling of revenue from scarcity-induced instability. Change your metric for success. Become a company that experiments with its metrics for success. Daniel Leventhal, a leading thinker in corporate strategy, posits that leaders might reimagine corporate exploration as experimentation with new metrics of performance. As we value more and more our shared context, it is logical that we will measure and manage it with new metrics that reflect this. The proliferation of ESG and impact investing firms resulted in an abundance of success metrics from which to choose, though at the highest level the goal of a company must of course be dictated by its values. At the level of a nation or society, we could also change our goals. We could, for example, adopt inclusive well-being as an umbrella goal. Or we could adopt inclusive wealth, which is a macroeconomic concept that includes natural capital and human capital, in addition to the more familiar production capital. The US plans to start publishing inclusive wealth metrics, alongside GDP, within the next few years. Such a development would naturally have implications for how companies are taxed and regulated, and therefore how they ought to measure success. Some companies are already experimenting with different ways of measuring value. Everytable, a fast-casual food chain and delivery service, uses economies of scale and central kitchens to beat competitor prices for healthy meals. The company also uses a variable pricing model to reach disadvantaged neighborhoods, capturing customers in more areas precisely because it prioritizes fighting food insecurity as part of the business model. Ultimately, it will be the companies that use these new cascading constraints to their advantage that will succeed by creating new abundance.","filter_flag":1}
{"title":"Philips’ Scope-3 CO2 emissions reduction - News - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi_AFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDExMi1waGlsaXBzLWJlY29tZXMtdGhlLWZpcnN0LWhlYWx0aC10ZWNobm9sb2d5LWNvbXBhbnktdG8taGF2ZS1pdHMtZW50aXJlLXZhbHVlLWNoYWluLWNvMi1lbWlzc2lvbnMtcmVkdWN0aW9uLXRhcmdldHMtYXBwcm92ZWQtYnktdGhlLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi_AFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDExMi1waGlsaXBzLWJlY29tZXMtdGhlLWZpcnN0LWhlYWx0aC10ZWNobm9sb2d5LWNvbXBhbnktdG8taGF2ZS1pdHMtZW50aXJlLXZhbHVlLWNoYWluLWNvMi1lbWlzc2lvbnMtcmVkdWN0aW9uLXRhcmdldHMtYXBwcm92ZWQtYnktdGhlLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLmh0bWzSAQA?oc=5","id":"CBMi_AFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDExMi1waGlsaXBzLWJlY29tZXMtdGhlLWZpcnN0LWhlYWx0aC10ZWNobm9sb2d5LWNvbXBhbnktdG8taGF2ZS1pdHMtZW50aXJlLXZhbHVlLWNoYWluLWNvMi1lbWlzc2lvbnMtcmVkdWN0aW9uLXRhcmdldHMtYXBwcm92ZWQtYnktdGhlLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLmh0bWzSAQA","guidislink":false,"published":"Thu, 12 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=12, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=12, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi_AFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDExMi1waGlsaXBzLWJlY29tZXMtdGhlLWZpcnN0LWhlYWx0aC10ZWNobm9sb2d5LWNvbXBhbnktdG8taGF2ZS1pdHMtZW50aXJlLXZhbHVlLWNoYWluLWNvMi1lbWlzc2lvbnMtcmVkdWN0aW9uLXRhcmdldHMtYXBwcm92ZWQtYnktdGhlLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLmh0bWzSAQA?oc=5\" target=\"_blank\">Philips’ Scope-3 CO2 emissions reduction - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Philips’ Scope-3 CO2 emissions reduction - News - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi_AFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDExMi1waGlsaXBzLWJlY29tZXMtdGhlLWZpcnN0LWhlYWx0aC10ZWNobm9sb2d5LWNvbXBhbnktdG8taGF2ZS1pdHMtZW50aXJlLXZhbHVlLWNoYWluLWNvMi1lbWlzc2lvbnMtcmVkdWN0aW9uLXRhcmdldHMtYXBwcm92ZWQtYnktdGhlLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLmh0bWzSAQA?oc=5\" target=\"_blank\">Philips’ Scope-3 CO2 emissions reduction - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"A track record of science-based targets and action plans In 2018, Philips became the first health technology company to have its CO₂ emission targets approved by the Science Based Targets initiative (SBTi) – a partnership between CDP, the United Nations Global Compact, World Resources Institute (WRI) and the World Wide Fund for Nature (WWF) that drives ambitious climate action in the private sector. By the end of 2020, Philips successfully achieved its 2020 target of carbon-neutrality in its operations. Philips is on a path to reduce total CO₂ equivalent (tCO2e) emissions from its industrial and non-industrial sites by 75% by 2025, and 90% by 2040 (compared to their 2015 emissions). In addition, it aims for a 42% reduction in indirect CO₂ emissions across our entire value chain by 2030, in line with the 1.5 °C global warming scenario (compared to 2020 baseline). Now also becoming the first health technology company to have its Scope 3 targets SBTi-approved, Philips is well positioned to meet its ambitious climate targets for the 2020 – 2040 period. Under the central theme ‘A path towards carbon free healthcare - leaving no one behind’, Philips is hosting a panel discussion on Tuesday, January 17, 2023, 17:00-18:30 (CET) in the SDG Tent at the World Economic Forum Annual Meeting in Davos. Bringing together high-level stakeholders across the public and private sector, the panel will discuss critical opportunities and practical examples that can accelerate rapid action across the value chain towards sustainable and equitable healthcare and create a resilient world where both people and the planet can thrive. Follow the livestream here. For further insights into how the healthcare ecosystem can reduce its carbon footprint, read the recent WEF blog by Philips’ Global Head of Sustainability, Robert Metzke. Philips has adopted a fully integrated approach to doing business responsibly and sustainably. Philips’ ESG framework comprises a comprehensive set of key commitments across all the Environmental, Social and Governance (ESG) dimensions that guide execution of the company’s strategy. It includes ambitious targets and detailed plans of action. [1] By year-end 2022. [2] Health Care Without Harm, Climate-smart health care series Green Paper Number One ‘Health Care’s Climate Footprint: How the Health Sector Contributes to the Global Climate Crisis and Opportunities for Action’. https:\/\/noharm-global.org\/sites\/default\/files\/documents-files\/5961\/HealthCaresClimateFootprint_092319.pdf ","filter_flag":1}
{"title":"Thalia's AMALIA qualified on 12nm FinFET technology - Design and Reuse","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmRlc2lnbi1yZXVzZS5jb20vbmV3cy81NTUwNy90aGFsaWEtYW1hbGlhLTEybm0tZmluZmV0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmRlc2lnbi1yZXVzZS5jb20vbmV3cy81NTUwNy90aGFsaWEtYW1hbGlhLTEybm0tZmluZmV0Lmh0bWzSAQA?oc=5","id":"CBMiRmh0dHBzOi8vd3d3LmRlc2lnbi1yZXVzZS5jb20vbmV3cy81NTUwNy90aGFsaWEtYW1hbGlhLTEybm0tZmluZmV0Lmh0bWzSAQA","guidislink":false,"published":"Mon, 09 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=9, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmRlc2lnbi1yZXVzZS5jb20vbmV3cy81NTUwNy90aGFsaWEtYW1hbGlhLTEybm0tZmluZmV0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Thalia's AMALIA qualified on 12nm FinFET technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Design and Reuse<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Thalia's AMALIA qualified on 12nm FinFET technology - Design and Reuse","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmRlc2lnbi1yZXVzZS5jb20vbmV3cy81NTUwNy90aGFsaWEtYW1hbGlhLTEybm0tZmluZmV0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Thalia's AMALIA qualified on 12nm FinFET technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Design and Reuse<\/font>","source.href":"https:\/\/www.design-reuse.com","source.title":"Design and Reuse","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"January 9, 2023 – Thalia has announced the qualification of its AMALIA platform for 12nm FinFET technology, marking a significant step forward in analog, mixed-signal and RF IP design migration. This qualification enables customers to capitalize on the latest in advanced process technology and accelerate time to market for new products without compromising on cost and resource efficiency. “FinFET technology delivers substantial performance benefits and enables more efficient scaling in semiconductor devices. This is crucial given the shift towards increasingly smaller technology nodes and transistors,\" says Sou Bennani-McCord, Global VP of Sales at Thalia. “Leveraging FinFETs, our customers are engineering devices that are not only smaller and more efficient, but also significantly more powerful, all while ensuring compatibility with a variety of technology nodes. This versatility is key for applications spanning from automotive to IoT, AI and ML, and more, positioning our customers at the cutting edge of electronic design innovation.” AMALIA offers a smooth and reliable IP migration cycle helping semincondor companies maintain competitiveness by adopting state-of-the-art process technologies, like 12 FinFET. It also enables them to speed up their product development cycles, while staying on budget and remaining efficient operationally. By combining an automated IP migration flow with design expertise, the AMALIA software suite simplifies the transition to newer technologies giving customers the flexibility to broaden their product portfolio and extend their market reach in the most efficient way. The AMALIA platform has a proven track record, with validation across more than 50 IPs in domains ranging from RF and Baseband to PMIC and PLL\/ADC, many of which are already in commercial use. The addition of 12nm FinFET technology into AMALIA’s capabilities reinforces Thalia’s dedication to innovation and its commitment to ensuring its customers remain at the forefront of technology. For more information about Thalia and the AMALIA platform, visit https:\/\/www.thalia-da.com\/ About Thalia Thalia is an IP migration specialist with expertise in targeted automation for analog, mixed signal and RF design and migration. Thalia’s AMALIA software suite analyzes, migrates and optimizes existing IP for new technologies and applications. IP houses, Tier 1 players and foundries can leverage the platform to reuse and diversify their product ranges quickly and cost effectively thanks to AMALIA’s AI and ML capabilities that deliver outstanding efficiencies in the analysis, design and verification stages of IP reuse. The result is a reduction in development time of at least 40%, enabling semiconductor businesses to react quickly to changing market demands and maximise business opportunities. The AMALIA platform has been validated on over 50 IPs, in domains ranging from RF and Baseband to PMIC and PLL\/ADC, many of which are already in commercial use. For more information visit www.thalia-da.com ","filter_flag":1}
{"title":"Increasing resilience of material supply by decentral urban factories and secondary raw materials - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZtdGVjLjIwMjMuMTEwNjk2NdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZtdGVjLjIwMjMuMTEwNjk2NdIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZtdGVjLjIwMjMuMTEwNjk2NdIBAA","guidislink":false,"published":"Tue, 03 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=3, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZtdGVjLjIwMjMuMTEwNjk2NdIBAA?oc=5\" target=\"_blank\">Increasing resilience of material supply by decentral urban factories and secondary raw materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Increasing resilience of material supply by decentral urban factories and secondary raw materials - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZtdGVjLjIwMjMuMTEwNjk2NdIBAA?oc=5\" target=\"_blank\">Increasing resilience of material supply by decentral urban factories and secondary raw materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Current production processes are frequently dependent on global supply chains for raw materials and prefabricated inputs. With rising political and global risks, these supply networks are threatened, which leads to a reduction of supply chain resilience. At the same time, urban areas are currently one of the main consumers of products and waste material generators. The raw material sourcing for this consumption commonly takes place in globally connected supply chains due to economy of scale effects. Therefore, cities are especially vulnerable to supply chain disruptions. A recent development which could reduce this vulnerability is the installation of urban factories among other urban production concepts, which can be symbiotically embedded into the urban metabolism to utilize the locally available (waste) materials. This, however, is hampered by the smaller production scale of decentralized urban production facilities, limited knowledge and challenges about the urban material flows and their characteristics. Against this background, we introduce a new factory type which is placed between the primary and secondary industrial sector: An urban secondary raw material factory which utilizes local waste material and other urban material flows for the extraction and refinement of secondary raw materials to supply production sites in its surrounding environment. To enable this small-to medium-scale factory type, the application of new production technologies plays a crucial role. Therefore, this paper proposes an approach for matching relevant potential waste streams to different technologies for waste-to-resource refinement. The applicability of the method for identification and evaluation of suitable technologies regarding their potential to be located in urban environments is demonstrated for plastic and metallic materials. Subsequently, key challenges and characteristics of the new factory type are summarized. With the introduction of this new factory type, the lack of scale effects in urban symbiotic networks is expected to be reduced. In conclusion, challenges such as the data-based management of symbiotic relationships among manufacturing companies are highlighted as still relevant in decentral value chains. 1 Introduction Global urban population is increasing. Currently, 57% of the global population lives in cities and urban regions. For the year 2050, the United Nations expect a rise to 66%. Given an expected global population increase, the absolute number of people living in urban areas will increase from 4.3 bn to 6.4 bn (United Nations, 2021). Urban areas account for a high share of value creation and are therefore important motors of global economy. While cities account for a large portion of consumption, they are mostly not involved in the primary and secondary sector (Pike, 2022), which is the result of limited space for primary activities and the historic change of the relationship between production and the urban environment. Thus, supply chain interruptions can have a large impact on urban living. For most urban regions, the dependency on global supply chains has had minor negative influence on the economic development in the past due to a relatively stable environment. However, different economic, political, and pandemic shocks in last decade have shown the vulnerability of global supply chains. According to Freeman et al. (2017), cities are especially vulnerable to extreme weather conditions, industrial accidents and environmental pollution, transport accidents, infrastructure failures, human and animal health crisis, industrial action, loss of access to finance and ability to import materials. With a disturbance in supply chains, the ability to import materials will decrease and urban life is threatened. Recent examples for supply chain disturbances can be seen in the disruption of supply chains due to the COVID-19 pandemic (Ivanov and Das, 2020) or the grounding of a container ship in the Suez (Lee and Wong, 2021), which had short- and long-term effects on goods supply. Against this background, cities as well as manufacturing industry strive towards increased resilience. Fiksel (2006) defines resilience as the capacity to survive, adapt and grow in the face of turbulent change. According to a literature review conducted by Hohenstein et al. (2015), supply chain resilience can be divided in the four phases readiness, response, recovery, growth. In the context of cities, a sufficient level of supply chain resilience (SCRES) is a key requirement to provide and sustain stability and is therefore desirable and strategies to achieve SCRES have to be developed. A possible contribution to strengthen SCRES can be a revitalization of decentral urban manufacturing (Singh et al., 2017; Herrmann et al., 2020). Key characteristics of these urban production systems are the utilization of their unique urban surrounding and the consideration of the specific local challenges and opportunities. A high potential also lies in embedding a production site in local material flows and the urban metabolism (Kirchherr et al., 2017; Tsui et al., 2021b). In this regard, one scenario is the utilization of urban mines, which are defined as the material in compounds and elements from anthropogenic stock (Lederer et al., 2014). Another source for materials could lie in the involvement of industrial (Jacobsen et al., 2006) or urban symbiotic (Chen et al., 2012) networks, which are understood as the exchange of waste flows between industrial or a broader variety of urban actors as inputs for production processes. These concepts of locally embedded production systems are often associated with environmental benefits (Diez-Ladera, 2016) and can contribute to SCRES. The capability for businesses to cope with vulnerabilities comes at an economical price and therefore has to be adapted to the actual risks to operate businesses in a profitable state (Pettit et al., 2010). For the case of local manufacturing and material utilization, a decrease in production scale can be expected and production systems have to adapt to varying input flows–especially when a direct waste material transformation is intended. To achieve economic feasibility, Chen et al. (2012) state that a certain material mass threshold has to be exceeded for a successful implementation of urban symbiotic systems. Based on these challenges for the supply of urban production, a concept with an additional actor between urban material sources and production is introduced, the Urban Secondary Raw Material Factory (USeRMaFa). The development of strategies for the realization of SCRES in cities by embedding of USeRMaFas into urban environments is highlighted from a larger to a smaller scale in four chapters: The first chapter introduces different scenarios for the relationship between city and production, the second chapter discusses the principle of the USeRMaFa and details the embedding to the urban metabolism. The third chapter discusses requirements for process chains and technologies and the fourth chapter gives examples for possible technological utilization. The concept is tailored towards plastic and metallic materials, which are currently circulated globally (Chen et al., 2012). Especially regions with limited resource availability, such as Western Europe, will therefore suffer from supply chain disruptions. The demand for local concepts is also increasing due to limited trade opportunities and the associated higher export costs. Germany, for example, drastically reduced its exports after an import ban on plastics was declared in China (Statistisches Bundesamt, 2022 7th). The use of collected waste in cities to close material loops is one way to address these challenges, and the proportion of material used in this way is a good indicator of their vulnerability. Currently, this opportunity is hardly used, as shown by the case of Brussels, representative of European cities, where the share of waste utilized in this manner is less than 1% (Zeller et al., 2019). The strategies developed aim to increase resilience and therefore provide approaches on how to increase this ratio. Since material flows and inner-city material cycles are focused on, cities and the integration of production within them are presented in the following with material flow-centred models. 2 Urban production as resilience enabler The integration of production into urban areas is visualized in Figures 1–3 for three scenarios. The city is described as a system with boundaries which are indicated by the dotted line. Across these boundaries, flows of materials, energy, personnel and information can be identified. Reduced in the context of supply chains to material flows and exemplified with the case of a production system, the system can be modelled with input and output flows. The single input flows are realized by supply chains with system-external factors which have different grades of SCRES. The number and volume of resulting material flows across the system boundary is represented in the number and size of the respective arrows. The system is modelled in a state with a constant mass balance, in which the material input and output flows have the same volume and there is neither an increase nor a decrease in the total amount of material within the system in the considered period. These material flows across the system boundaries can be described as product flows into the city and waste flows out of the city. Within the system, these flows are transformed by different actors. Not only can the system boundaries of this model be scaled, which enables the inclusion of various analysis levels, but the input and output flows can also represent the sum of all material flows or individual material groups or materials in the spectrum. Thus, the model can be used for different cases of spatial considerations as well as for total mass flow, material or product-related analyses. Figure 1 shows the scenario “productionless city”. In this scenario, the transformers are the product users. Hence, the system is absolutely dependent on product input from external sources. Additionally, an equivalent waste flow is generated, which has to be recycled or stored outside the system. It thus shows a high dependence on actors and conditions outside its own system. The city depicted in this scenario is therefore dependent on external supply of manufactured goods and no added value is generated by goods production. FIGURE 1 FIGURE 1. Productionless city. Figure 2 shows the scenario “productive city”. In this scenario, another transformation process can be observed. Simplified, raw material is transformed into products and by-products within the system boundaries. Therefore, a new input flow is created. Raw materials that are not directly available in the city must be imported. On the other hand, after transformation through production, products are available which, if not used in the city and transformed into waste flows, cross the system boundary as product output flow. The flows within the system get more complex with the production producing waste as well. In this case, the source for the products needed in the system can be partly within the system itself. Adding another transformation process reduces the input flow and thus the dependence on external factors for finished products. On the other hand, a new flow of raw materials is added that crosses the system boundaries and represents a further dependency. Increasing the number of dependencies can reduce the risk associated with a single dependency. In addition to the waste flow, a product flow of the products manufactured in the system can also be introduced from the system. This also creates further dependencies, but there is also a diversification of external influencing factors, which can reduce risks. FIGURE 2 FIGURE 2. Productive city. Figure 3 describes the scenario “symbiotic productive city”. The symbiotic productive city has the lowest cumulative mass of all system boundary crossing input flows, and due to the constraint of an equilibrated mass balance also output flows, symbolized by the lowest cumulated area of the system boundary crossing arrows (PI, RI, PO, SRO, and WO). This means that mass flows that would otherwise be realized as output will be transformed in a way that allows them to remain in the system. The city’s internal production can specifically produce products that meet internal demand, which reduces product flows out of the city and also reduces product flows into the city while waste flows that leave the system can be reduced. This reduction can be achieved by transforming by-product and waste flows into new raw material. This increase of material efficiency results in a reduction of the raw material mass to be introduced into the system. The secondary raw material can as well be utilized for export which results in reduced costs compared to the export of waste materials. In this case, the number of possible output flows outnumbers the number of input flow categories. This shift towards minimal input demands but diversified output opportunities can also lead to an increase in system resilience as the output of more valuable and diverse material classifications can be increased. The overall effects of supply chain disturbances are reduced within this third stage of the model. The inward allocation of value-adding activities can affect the economic resilience of the system under consideration. This addition of another system internal transformation process diversifies external dependencies and at the same time reduces the dependence induced risks to a minimum. To enable the “symbiotic productive city” scenario, a facilitating additional actor can be integrated in different ways. The next chapter gives an overview of different possibilities of integration and introduces the production-related entities in symbiotic urban networks, leading to the introduction of the aforementioned complementary actor. FIGURE 3 FIGURE 3. Symbiotic productive city. 3 The urban secondary raw material factory–Symbiotic embedding into urban environments Local producers can be categorized into different categories. Tsui et al. (2021a) differentiate between four categories of urban manufacturers: (i) personal fabricators are hobbyists, which make products for personal use, (ii) maker spaces are shared workshops for makers, (iii) mini-factories are small to medium sized factories with fewer than 20 employees and (iv) traditional urban industries are large-scale manufacturers, who have chosen to stay in the city or to purposefully utilize the opportunities of the urban system. Other categories, such as traditional craft manufacturers (carpenters, shoe makers, etc.) as well as “unintended” urban manufacturers [for example because the urban area grew around them (Herrmann et al., 2020)] could also be an addition to the list of urban manufacturers. This heterogenic mass has different production scales and different demand for input materials. Therefore, urban production networks are challenged to adapt to these differences. To realize the adaptation, we introduce different scenarios for the integration of factories into urban environments in the following section. Figure 4 shows different concepts for the material flow integration of urban factories into their surrounding environment according to the previously introduced scenario 3. Here, two sub-scenarios are envisioned. The images show a city-production system with different internal and external material flows. Scenario 3A shows a utilization in form of (urban-)industrial symbiosis, as introduced by Chertow (2004) (“industrial symbiosis consists of place-based exchanges among different entities that yield a collective benefit greater than the sum of individual benefits that could be achieved by acting alone.”) and extended to urban actors like households by Chen et al. (2012). In this concept, the materials are circulated in loops inside of the city system. The outputs from one actor are seen as inputs for other actors. Per definition, the material receiver aims to transform waste to end-products. The input and outputs of the city are therefore reduced and fewer materials have to be im- or exported. The direct material input leads to several challenges regarding the material continuity as well as the possibilities for quality control. This leads to reduced possibilities for contribution of smaller producers–especially as material receivers and stands against the definition of Chertow, which envisions a collective benefit. FIGURE 4 FIGURE 4. The urban secondary raw material factory and its integration in the urban metabolism. The introduction of an aforementioned additional actor–the USeRMaFa–can provide such a collective benefit and is illustrated with Scenario 3B. This factory type is seen as an additional actor that produces semi-finished parts. The resulting parts can be utilized in flexible, distributed production processes by urban producers, thus reducing the burden for urban producers to operate in a higher scale, because the transformation is performed on the largest possible urban scale and the output materials can be used from the different actors. Additionally, the USeRMaFa is able to transform material from the so-called urban mine in form of landfills or currently circulating products. Therefore, it helps to reduce already existing pollution. The integration of this additional step offers the potential to create additional added value, reduced necessary external material input and overall reduced transport routes. The city is less endangered regarding supply chain disruptions, because a source redundancy and a structure for reutilization exist. With knowledge about transformation processes, this approach also becomes economically more viable, as a higher yield can be expected with lower external supply and remaining demand. To unlock the described potential of the introduced factory type, several challenges arise regarding the usage of materials, the integration into urban environments as well as the process chains and production systems. These are discussed in the following sections. 4 Technology and process chains for USeRaMaFa The introduction of USeRMaFa into urban space as a system element can support urban manufacturing, which takes place in so-called urban factories. The concept of purposeful urban factories and sustainable urban manufacturing has gained increasing research interest in recent years. Current concepts and developments are focused on tapping the positive potentials while coping with the specific challenges and requirements of urban factories. 4.1 Requirements for urban factory production systems Urban space can be defined as a densely populated, multi-functional settlement structure, which as a location enables specific potentials for urban factories but is at the same time associated with challenges (Juraschek, 2022). In less densely populated areas, beneficial characteristics for a production site include in most cases low land costs, availability of expansion space and low interference potential from other stakeholders. In a city, vicinity to customers as well as potential employees, urban infrastructure and the opportunity of implementing localized product-service-systems are among the potential benefits. An urban factory is utilizing the locally available resources, as for instance space, energy and knowledge (Juraschek et al., 2018b), and stands in competition with other stakeholders. Thus, factories in urban environments frequently face conflicts delaying or preventing expansion processes and growth or threaten the survival. As a consequence, any technology employed at an urban factory is required to comply with the constraints that are imposed by its location and surroundings. These constraints include, for instance, stricter limits for noise or odor emissions, limited expansion space or higher demands on architectural quality. Going beyond the strategy of lowering negative impacts of a factory, the concept of a holistic Positive Impact Factory was proposed by Herrmann et al. (2014) and Herrmann et al. (2015). By actively integrating and utilizing the specific potentials of urban space, an urban factory can also provide services or urban functions, as for instance education, value creation or product supply, to its surroundings. Figure 5 shows a zoom-in on the USeRMaFa in its immediate urban environment and highlights the core elements of the factory. Positive contributions to the surrounding system as introduced by Herrmann et al. are indicated by the installed energy generators (PV and wind turbines), the energy storage as well as the utilization of a learning environment. FIGURE 5 FIGURE 5. USeRMaFa characteristics and internal material flows. The left-hand side shows possible input sources. These are described in Section 2 and include urban producers, landfills\/urban mine and households. The generated input flows are byproducts from production processes, waste materials, as well as utilities. Here, a challenge is the mix of materials, which requires a highly flexible manufacturing environment to adapt to the different materials and qualities. Local factors, such as the legislative environment also play a role and have a high influence: With stricter regulations for waste separation and collection, lower effort has to be taken in the earlier production stages of the USeRMaFa. Additional utilities include for example virgin materials to mix, auxiliaries, and operating supplies such as coolants and lubricants. These additional utilities cannot always be derived from waste materials and should therefore be reduced to the necessary minimum. In the image center, the production system of the USeRMaFa is depicted. The process chain includes the phases collecting, sorting, separation, production and commissioning, as well as overarching cleaning and testing. In the collecting and sorting phase, the different inputs are stored to overcome the threshold for an economically sound material amount for production. To account for inconsistent input streams, bypass storage capacities can be necessary, which can be a cost factor. The necessity of bypass storages can be reduced in a connected smart city network. With a knowledge of industrial byproducts, planning processes for urban material transformations can be improved (Raabe et al., 2017). Because of possible contaminations, cleaning has to be throughout the transformation processes. In this regard, the necessary amount is dependable on the material type itself, the transforming processes as well as the contamination. To compensate for different input material qualities and properties, the process chain has to be supervised by quality assessment throughout the whole process chain. In this regard, higher efforts than in conventional process chains can be expected. The right-hand side indicates the output material in form of secondary raw materials. The shape of these materials highly depends on the recycled materials and on the used transformation processes. For steel or aluminum-based materials, the output could consist of bars, semi-finished profile bars or sheet metals. Higher valued metals such as copper, silver, or gold could be transformed to ingots. In case of polymer materials, the output materials could include filaments for additive manufacturing processes, pellets for molding and extrusion processes, or olefins and aromates. The shape of these output materials is highly dependent on the production processes. The following sub chapter introduces an excerpt of possible urban compatible processes for different material categories. 4.2 Material processing in USeRMaFas Material processing is a crucial element for the installation of USeRMaFas, as the utilized technologies have to be able for small scale and discontinuous operation and an adaptation to different input materials and qualities must be possible–near zero waste should be targeted. Additionally, the processes must comply to the introduced low interference with other urban actors while also providing high quality materials. This means, that many traditional process chains for secondary raw material production do not apply. Recent technological developments show potential for utilization in USeRMaFas. As an example, for plastic materials, several routes can be possible. In general, a differentiation between thermoplastic polymers, thermosetting polymers and elastomers. While thermoplastics offer the possibility to be remold or formed, the options for the latter are limited. To access repurpose thermoplastics to secondary raw materials, literature offers several options. The simplest solution would consist of a direct remolding to later useable structures like pellets or filaments, but degradation over the extended lifespan can occur and reduce material quality. The necessary machinery can be created in smaller scale and with relatively low effort, as shown with the construction of a process chain for the recycling of PET-wastes to Fused-Deposition-Molding (FDM) filaments in learning factories (Juraschek et al., 2020). Similar approaches are also realized by the company Recyclingfabrik, which collects PLA wastes from 3D-printing and recycles them to new filaments (Recyclingfabrik, 2022). To avoid degradation and reduce the influence of contamination, plastic materials can be treated by chemolysis. The RevolPET technology is able to recover the monomer materials [ethylene glycol (EG) and the corresponding salt of terephthalic acid (TA)] in an extrusion process from PET (Biermann et al., 2021). For other polymers and their combinations, pyrolysis offers one possibility to reduce the polymers to olefins and aromates which can be reutilized for the generation of new plastic materials by pyrolysis (Costa et al., 2021). A similar approach has been adapted for industrial use. The WASTX Plastic technology is a production system, that can be installed in shipping containers and contains the auxiliary processes (cleaning and separating) (Bio Fabrik, 2022). Therefore, these production systems offer the possibility for an installation in urban environments. While pyrolysis offers the possibility for high secondary material quality, it is also connected to high energy consumption. Especially material mixes lead to an increase of necessary energy to break the structures (Erkisi-Arici et al., 2021). The necessary investment and effort is therefore dependent on the quality of the input materials and the quality requirements for the products–which is highly dependent on local legislation. Metals can be recovered by many different approaches and high recycling rates are already possible. Traditional methods like blast furnacing have high spatial and energetic requirements and are therefore usually placed outside cities. With mixed input materials and discontinuous supply, more flexible strategies should be utilized. Pyro-, hydro-, solvo- and biometallurgical processes can recover a high amount of low-grade materials, but are also connected to higher energy or process efforts (Spooren et al., 2020)–and are not necessarily compatible to urban environments due to hazardous materials. Therefore, the USeRMaFa should utilize smaller and low effort strategies which avoid globally applied remelting. For example, the Temconex® process is a continuous extrusion process which can transform chips and powders to high density profiles (Saefkow et al., 2017). Aluminum based sheet scrap materials can be recycled through friction consolidation (Baffari et al., 2019). Depending on the previous material strain, a cold reforming of sheet metals is possible (Takano et al., 2008), which can reduce the necessary energy input. Paraskevas et al. (2015) introduce a method for spark plasma sintering of aluminum sheet metal scrap. Utilizing the flexible, small scale sintering process, it was possible to generate full-dense parts without full remelting. The shown technologies show an excerpt of possible processes for USeRMaFas. The approaches offer higher flexibility and show promising results for an efficient utilization in small\/meso-scale operation. Depending on the recycled materials, the decision whether to apply energy intensive methods has to be made under consideration of economic, such as processing and logistic costs, discontinuity risk, differences between generation and destination, research for new uses, support of new products, extended life of deposits and landfills, and compliance with legislation in operation strategy (Sellitto et al., 2021), as well as ecologic factors. The economic feasibility can however increase with an increase in supply chain disruptions and higher material scarcity. 5 Discussion: Potential contribution to resilience factors of an urban factory As a general definition, resilience describes the capacity or ability of a system to adapt or transform in response to significant internal or external disturbances, shocks and general change processes (Carpenter et al., 2012; Biedermann et al., 2018b). A resilient system is more likely when experiencing such disturbances to preserve its functions and in response to reorganize and restructure itself. This process can be summarized in four properties of readiness, response, recovery and growth (Hohenstein et al., 2015). Resilience can be formed against expected events, which is referred to as specific resilience, or regarding unexpected and unforeseeable disturbance, which can be defined as general resilience (Carpenter et al., 2012). In either case, resilience as a system property can be seen as the opposite to vulnerability. Due to the numerous possibilities of potential disturbances that might occur and complex interconnections in socio-technical systems, it can be complicated to define quantifiable measures for resilience. One approach to analyze a system’s resilience is to investigate the characteristics of contributing or limiting factors. These resilience factors can include but are not limited to redundancy, diversity, modularity, reserves, feedbacks, nestedness, trust, flexibility, transparency, agility, governance, reactivity, adaptability, sharing, robustness, responsiveness, distribution, experimentation, risk reduction, openness, and monitoring (Carpenter et al., 2012; Hohenstein et al., 2015; Biedermann et al., 2018b). Introducing modularity by dividing a large system into smaller sub-systems, separating system elements through boundaries and defining and implementing interfaces, for instance, can prevent the spread of shocks and disturbances and thus raise the ability to remain functional, adapt and transform. Furthermore, modularity as a factor fosters interchangeability and upgradability of system elements. At the same time, splitting up system elements can increase efforts for exchange across the sub-system boundaries and–in the case of a production system–decrease overall efficiency. In Table 1 the potential contributions to the resilience factors of an urban factory by locally introducing a USeRMaFa into the city as well as potential challenges are summarized. TABLE 1 TABLE 1. Influence of USeRMaFas on resilience factors. Establishing USerMaFas to locally utilize available material flows and transform these into useable raw materials as input for production systems can strengthen the resilience of urban factories particularly with the decentralization and distribution of potential raw material sources. This offers redundancy and diversity, which can support avoiding disturbances in long-distance and single source supply chains. Local nestedness of a USerMaFa and short distances to waste material flows as well as urban factories as customers provide advantages due to short reaction times, adaptability to local circumstances and transparency. These main potentials are at the same time imposing challenges regarding the resilience factors, for instance with dependencies on the quality and volume of local waste material flows, exposure to local risk factors and the smaller scale of the production system, which might lead to economic challenges. 6 Final remarks and outlook This paper introduces the concept of an urban material transformation factory, which utilizes urban (waste) material flows for the creation of secondary raw materials. These can be utilized with the intention to support supply chain resilience and to create benefits for local value creation by urban manufacturing. To introduce possible effects of local material circulation and especially secondary raw materials, different urban material flow scenarios are discussed. Here, the introduction of industrial and urban symbiosis was introduced as contributor to SRES. Based on research on general urban factories and their integration into their urban surroundings, general characteristics for USeRMaFas were derived and selected production processes were introduced. With the potential of material transformation in close proximity to the material use, there also exist risks which are discussed in relation to general supply chain resilience factors. Future research should address the multiple influences of the concept on the complex construct “city”. In this regard, the ecologic implications of local material transformation should be addressed, as the lack of scale effects can increase the necessary energy input but can also reduce transport and resource extraction related emissions. On an economic level, as stated by Pettit et al. (2010), the capabilities which are necessary to overcome the disturbances in supply chains for WEEE-materials come with an economic price, which is on the one hand connected to the loss of scale effects when performed in smaller scale as well as on the other hand with the loss of possibilities to produce in low-wage regions. To improve efficiency of urban symbiotic supply chains, the management of symbiotic relationships between the involved actors should be further analyzed. This could be performed by modeling approaches utilizing data obtained from producers and their urban environment. In this regard, quantitative approaches, as introduced for industrial symbiosis networks (Demartini et al., 2022) could be further developed. In regard to current disturbances to supply chains, the increase of capabilities seems to be a potent solution–especially since there is currently a significant amount of materials stored in cities. In regard to an increasing resource scarcity and geopolitical disturbances, a shift towards local supply chains is therefore a promising approach. On a social and human centered level, for (re-)location of production in the urban area, acceptance of the local population for the establishment this production type plays an important role. This can be examined from different perspectives and acceptance in the surrounding population could be considered with acceptance theory models (Davis, 1989; Venkatesh and Xu, 2012). Resilience increases of the USeRMaFas could in this case lead to an enhancement of the performance expectation. General behavioral models, in which social norms are relevant for the intention to act, (Ajzen, 1985; Graf, 2007), can be used to investigate the acceptance of the company management towards the settlement in an urban area. From the factors that influence the respective acceptance, it is possible to deduce what influence the production system can have on the establishment or perpetuation of urban production. In addition to the behavioral human-centered perspectives on urban production and its resilience, social aspects can also be the subject of further research. One aspect that can be examined in this context is the reduction of commuting (Novaco and Gonzalez, 2009). A possible approach for multi-disciplinary research can be the development of demonstrators under involvement of the different actors. These approaches could be aiming to involve different perspectives; as urban manufacturing processes concern different actors. Possible contributions could include production engineering, urban planning, architecture, legal sciences, and sociologists to ensure a multi-dimensional perspective. Further research should also include public and economic actors such as governing bodies, technology suppliers, waste service suppliers and citizens. Data availability statement The original contributions presented in the study are included in the article\/Supplementary Material, further inquiries can be directed to the corresponding author. Author contributions MK, JM, and GS conceived of the presented idea. MK and JM developed the factory concept and the embedding factors. MK lead the editorial process. HC encouraged MK, JM, and GS to further look into different embedding scenarios and supervised the findings of this work. All authors discussed the results and contributed to the final manuscript. Funding The funding for the Junior Research Group Urban Flows and Production was provided from the DFG Universitätspauschale. Additional funding was also provided from the TU Braunschweig publication fund. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Ajzen, I. (1985). “From intentions to actions: A theory of planned behavior,” in From intentions to actions: A theory of planned BehaviorAction control. Editors J. Kuhl, and J. Beckmann (Berlin, Heidelberg: Springer Berlin Heidelberg, 11–39. doi:10.1007\/978-3-642-69746-3_2 CrossRef Full Text | Google Scholar Baffari, D., Buffa, G., Ingarao, G., Masnata, A., and Fratini, L. (2019). Aluminium sheet metal scrap recycling through friction consolidation. Procedia Manuf. 29, 560–566. doi:10.1016\/j.promfg.2019.02.134 CrossRef Full Text | Google Scholar Biedermann, L., Kotzab, H., and Pettit, T. J. (2018b). Theory landscape and research perspectives in current supply chain resilience research. Berlin, Germany: SpringerCham, 26–33. doi:10.1007\/978-3-319-74225-0_4Theory landscape and research perspectives in current supply chain resilience research CrossRef Full Text | Google Scholar Biedermann, L. (2018a). Supply chain resilienz. Wiesbaden: Springer Fachmedien Wiesbaden. Google Scholar Biermann, L., Brepohl, E., Eichert, C., Paschetag, M., Watts, M., and Scholl, S. (2021). Development of a continuous PET depolymerization process as a basis for a back-to-monomer recycling method. Green Process. Synthesis 10, 361–373. doi:10.1515\/gps-2021-0036 CrossRef Full Text | Google Scholar Buecher, D., Gloy, Y.-S., Schmenk, B., and Gries, T. (2018). “Individual on-demand produced clothing: Ultrafast fashion production system,” in Customization 4.0. Editors S. Hankammer, K. Nielsen, F. T. Piller, G. Schuh, and N. Wang (Berlin, GermanyCham: Springer International Publishing, 635–644. doi:10.1007\/978-3-319-77556-2_40 CrossRef Full Text | Google Scholar Bundesamt, Statistisches, and 7 (2022). 25% less plastic waste exported in 2021 year on year. Google Scholar Burggräf, P., Dannapfel, M., Uelpenich, J., and Kasalo, M. (2019). Urban factories: Industry insights and empirical evidence within manufacturing companies in German-speaking countries. Procedia Manuf. 28, 83–89. doi:10.1016\/j.promfg.2018.12.014 CrossRef Full Text | Google Scholar Carpenter, S., Arrow, K., Barrett, S., Biggs, R., Brock, W., and Crépin, A.-S. (2012). General resilience to cope with extreme events. Sustainability 4, 3248–3259. doi:10.3390\/su4123248 CrossRef Full Text | Google Scholar Chen, X., Fujita, T., Ohnishi, S., Fujii, M., and Geng, Y. (2012). The impact of scale, recycling boundary, and type of waste on symbiosis and recycling. J. Industrial Ecol. 16, 129–141. doi:10.1111\/j.1530-9290.2011.00422.x CrossRef Full Text | Google Scholar Costa, P., Pinto, F., Mata, R., Marques, P., Paradela, F., and Costa, L. (2021). Validation of the application of the pyrolysis process for the treatment and transformation of municipal plastic wastes. Chem. Eng. Trans. 86, 859–864. Google Scholar Davis, F. D. (1989). Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Q. 13, 319. doi:10.2307\/249008 CrossRef Full Text | Google Scholar Demartini, M., Tonelli, F., and Govindan, K. (2022). An investigation into modelling approaches for industrial symbiosis: A literature review and research agenda. Clean. Logist. Supply Chain 3, S. 100020. doi:10.1016\/j.clscn.2021.100020 CrossRef Full Text | Google Scholar Diez-Ladera, T. (2016). Fab city whitepaper: Locally productive, globally connected self-sufficient cities. https:\/\/apo.org.au\/node\/314675. Google Scholar El Maraghy, H., and Wiendahl, H.-P. (2016). “Changeable manufacturing,” in CIRP encyclopedia of production engineering. Editors T. I. A. f. Produ, L. Laperrière, and G. Reinhart (Berlin, Heidelberg: Springer Berlin Heidelberg), 1–7. doi:10.1007\/978-3-642-35950-7_6674-3 CrossRef Full Text | Google Scholar Erkisi-Arici, S., Hagen, J., Cerdas, F., and Herrmann, C. (2021). Comparative LCA of municipal solid waste collection and sorting schemes considering regional variability. Procedia CIRP 98, 235–240. doi:10.1016\/j.procir.2021.01.036 CrossRef Full Text | Google Scholar Freeman, R., McMahon, C., and Godfrey, P. (2017). An exploration of the potential for re-distributed manufacturing to contribute to a sustainable, resilient city. Int. J. Sustain. Eng. 10, 260–271. doi:10.1080\/19397038.2017.1318969 CrossRef Full Text | Google Scholar Graf, D. (2007). “Die Theorie des geplanten Verhaltens,” in Theorien in der biologiedidaktischen Forschung: Ein Handbuch für Lehramtsstudenten und Doktoranden; mit 12 Tabellen. Editor D. Krüger (Berlin, Heidelberg: Springer), 33–43. Google Scholar Gutzmer, A. (2016). Urban innovation networks. Berlin, GermanyCham: Springer International Publishing. Google Scholar Hara, S., Maekawa, H., Ikeda, S., and Nakano, S. (2011). Concept of minimal fab and development of minimal equipments. J. Jpn. Soc. Precis. Eng. 77, 249–253. doi:10.2493\/jjspe.77.249 CrossRef Full Text | Google Scholar Herrmann, C., Blume, S., Kurle, D., Schmidt, C., and Thiede, S. (2015). The positive impact factory–transition from eco-efficiency to eco–effectiveness strategies in manufacturing. Procedia CIRP 29, 19–27. doi:10.1016\/j.procir.2015.02.066 CrossRef Full Text | Google Scholar Herrmann, C., Juraschek, M., Burggräf, P., and Kara, S. (2020). Urban production: State of the art and future trends for urban factories. CIRP Ann. 69, 764–787. doi:10.1016\/j.cirp.2020.05.003 CrossRef Full Text | Google Scholar Herrmann, C., Schmidt, C., Kurle, D., Blume, S., and Thiede, S. (2014). Sustainability in manufacturing and factories of the future. Int. J. Precis. Eng. Manuf.-Green Tech. 1, 283–292. doi:10.1007\/s40684-014-0034-z CrossRef Full Text | Google Scholar Hohenstein, N.-O., Feisel, E., Hartmann, E., and Giunipero, L. (2015). Research on the phenomenon of supply chain resilience. Int. J. Phys. Distribution Logist. Manag. 45, 90–117. doi:10.1108\/IJPDLM-05-2013-0128 CrossRef Full Text | Google Scholar Ivanov, D., and Das, A. (2020). Coronavirus (COVID-19\/SARS-CoV-2) and supply chain resilience: A research note. IJISM 13, 90. doi:10.1504\/IJISM.2020.107780 CrossRef Full Text | Google Scholar Jacobsen, N. B., Becht, E. J., Büth, L., Thiede, S., Kara, S., and Herrmann, C. (20062018a). Industrial symbiosis in kalundborg, Denmark: A quantitative assessment of economic and environmental aspects. J. Industrial Ecol. CIRP 1069, 23994–25599. doi:10.1162\/108819806775545411Juraschek10.1016\/j.procir.2017.11.069 CrossRef Full Text | Google Scholar Juraschek, M., Becker, M., Thiede, S., Kara, S., and Herrmann, C. (2019). Life cycle assessment for the comparison of urban and non-urban produced products. Procedia CIRP 80, 405–410. doi:10.1016\/j.procir.2019.01.017 CrossRef Full Text | Google Scholar Juraschek, M., Bucherer, M., Schnabel, F., Hoffschröer, H., Vossen, B., Kreuz, F., et al. (2018b). Urban factories and their potential contribution to the sustainable development of cities. Procedia CIRP 69, 72–77. doi:10.1016\/j.procir.2017.11.067 CrossRef Full Text | Google Scholar Juraschek, M., Büth, L., Thiede, S., and Herrmann, C. (2020). “3-CYCLE—a modular process chain for recycling of plastic waste with filament-based 3D printing for learning factories,” in Enhancing future skills and entrepreneurship (Berlin, GermanyCham): Springer), 79–87. doi:10.1007\/978-3-030-44248-4_8 CrossRef Full Text | Google Scholar Kinkel, S. (2009). Erfolgsfaktor standortplanung. Berlin, Heidelberg: Springer Berlin Heidelberg. Google Scholar Kirchherr, J., Reike, D., and Hekkert, M. (2017). Conceptualizing the circular economy: An analysis of 114 definitions. Resour. Conservation Recycl. 127, 221–232. doi:10.1016\/j.resconrec.2017.09.005 CrossRef Full Text | Google Scholar Lederer, J., Laner, D., and Fellner, J. (2014). A framework for the evaluation of anthropogenic resources: The case study of phosphorus stocks in Austria. J. Clean. Prod. 84, 368–381. doi:10.1016\/j.jclepro.2014.05.078 CrossRef Full Text | Google Scholar Lee, J. M., and Wong, E. Y. (2021). Suez canal blockage: An analysis of legal impact, risks and liabilities to the global supply chain. MATEC Web Conf. 339, 01019. doi:10.1051\/matecconf\/202133901019 CrossRef Full Text | Google Scholar Novaco, R. W., and Gonzalez, O. I. (2009). “Commuting and well-being,” in Technology and psychological well-being. Editor Y. Amichai-Hamburger (Cambridge, UK: Cambridge University Press), 174–205. doi:10.1017\/cbo9780511635373.008 CrossRef Full Text | Google Scholar Paraskevas, D., Vanmeensel, K., Vleugels, J., Dewulf, W., and Duflou, J. R. (2015). Solid state recycling of aluminium sheet scrap by means of spark plasma sintering. KEM 639, 493–498. doi:10.4028\/www.scientific.net\/kem.639.493 CrossRef Full Text | Google Scholar Pettit, T. J., Fiksel, J., and Croxton, K. L. (2010). Ensuring supply chain resilience: Development of a conceptual framework. J. Bus. Logist. 31, 1–21. doi:10.1002\/j.2158-1592.2010.tb00125.x CrossRef Full Text | Google Scholar Pike, A. (2022). Coping with deindustrialization in the global north and south. Int. J. Urban Sci. 26, 1–22. doi:10.1080\/12265934.2020.1730225 CrossRef Full Text | Google Scholar Raabe, B., Low, J. S. C., Juraschek, M., Herrmann, C., Tjandra, T. B., Ng, Y. T., et al. (2017). Collaboration platform for enabling industrial symbiosis: Application of the by-product exchange network model. Procedia CIRP 61, 263–268. doi:10.1016\/j.procir.2016.11.225 CrossRef Full Text | Google Scholar Rappaport, N. (20192022). Vertical urban factory. New York, BarcelonaRecyclingfabrik: Actar Publishers. https:\/\/recyclingfabrik.com\/ (Accessed November 16.). Google Scholar Saefkow, M., List, M., Schubert, A., Lohmüller, A., and Singer, R. F. (2017). Continuous powder extrusion for fabrication of carbon fibre reinforced aluminium. KEM 742, 158–164. doi:10.4028\/www.scientific.net\/kem.742.158 CrossRef Full Text | Google Scholar Sellitto, Miguel Afonso, Murakami, Fábio Kazuhiro, Butturi, Maria Angela, Marinelli, Simona, Kadel, , Nelson, B., et al. (20212017). “Barriers, drivers, and relationships in industrial symbiosis of a network of Brazilian manufacturing companiesEconomic Impact of Ultraefficient Urban Manufacturing,” in Smart economy in smart cities (Singapore): Springer), 26, 443273–454293. doi:10.1016\/j.spc.2020.09.016Sustainable Production and Consumption CrossRef Full Text | Google Scholar Spooren, J., Binnemans, K., Björkmalm, J., Breemersch, K., Dams, Y., Folens, K., et al. (2020). Near-zero-waste processing of low-grade, complex primary ores and secondary raw materials in Europe: Technology development trends. Resour. Conservation Recycl. 160, 104919. doi:10.1016\/j.resconrec.2020.104919 CrossRef Full Text | Google Scholar Stricker, N., and Lanza, G. (2014). The concept of robustness in production systems and its correlation to disturbances. Procedia CIRP 19, 87–92. doi:10.1016\/j.procir.2014.04.078 CrossRef Full Text | Google Scholar Takano, H., Kitazawa, K., and Goto, T. (2008). Incremental forming of nonuniform sheet metal: Possibility of cold recycling process of sheet metal waste. Int. J. Mach. Tools Manuf. 48, 477–482. doi:10.1016\/j.ijmachtools.2007.10.009 CrossRef Full Text | Google Scholar Tsui, T., Peck, D., Geldermans, B., and van Timmeren, A. (2021a). The role of urban manufacturing for a circular economy in cities. Sustainability 13, 23. doi:10.3390\/su13010023 CrossRef Full Text | Google Scholar Tsui, T., Tajbakhsh, A., Peck, D., and van Timmeren, A. (2021b). Circular maker cities: A spatial analysis on factors affecting the presence of waste-to-resource organizations in cities. Ecocity World Summit 22. Google Scholar Venkatesh, V., Thong, J., and Xu, X. (2012). Consumer acceptance and use of information technology: Extending the unified theory of acceptance and use of technology. MIS Q. 36, 157. doi:10.2307\/41410412 CrossRef Full Text | Google Scholar","filter_flag":1}
{"title":"European Union launches second edition of Circular Economy Competition - GhanaWeb","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA","guidislink":false,"published":"Thu, 19 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=19, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5\" target=\"_blank\">European Union launches second edition of Circular Economy Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GhanaWeb<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"European Union launches second edition of Circular Economy Competition - GhanaWeb","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5\" target=\"_blank\">European Union launches second edition of Circular Economy Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GhanaWeb<\/font>","source.href":"https:\/\/www.ghanaweb.com","source.title":"GhanaWeb","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Press Releases of Thursday, 19 January 2023 Source: European Union The European Union presents the second edition of the Circular Economy Competition in line with their support to Ghana to meet SDG Goal 12 i.e., “responsible consumption and production”. It is a contest that aims at supporting small businesses and start-ups operating in the circular economy ecosystem in Ghana. The EU is looking to support innovative ideas and projects that aim to promote resource efficiency and thinking in Ghana across relevant sectors and help unlock the potential of re-thinking the production and delivery of sustainable choices to make these accessible, affordable, and available to the masses in Ghana. The circular economy is not only about waste or transforming waste through reuse and upcycling into new products. It also offers the potential for an economic boost through resource efficiency and industrial transformation. It aims to maintain the value of products, materials, and resources for as long as possible by returning them to the product cycle at the end of their use, while minimizing the generation of waste. The fewer products we discard, the fewer materials we extract, and the better for our environment. This process starts at the very beginning of a product’s lifecycle. Smart product design and production processes can help save resources, avoid inefficient waste management and create new business opportunities. The first CEC was held in Accra and aired on GH One TV and The European Union's official YouTube channel, with 20 shortlisted circular economy business contestants participating. They were - Kasi Coal, AY Farms, Mending Banana & Plantain Stem Papers, Ecocent Recycling LTD, Ento Farms, Podash Processing Company, Sustainable Energy, Makola Gh, and Tiger House LTD amongst others. Ento farms emerged winners after a keen contest and won GHC 65000 in seed funding for their business. They used the funds to expand their facility, purchase equipment, and open a second factory in cape coast. The CEC project aims to create greater economic and employment opportunities for Ghanaians by promoting and supporting sustainable and circular businesses. Interested applicants should visit www.EU-CEC.COM to apply. Application is open from now to 4th February 2023. Solutions envisaged should clearly aim at delivering impact, pursue sustainability and be scalable or replicable post-competition- at the local and national level. Only 20 shortlisted contestants will be selected to participate in the 2023 Circular Economy Competition with the hope to win GHC 100,000 in seed money. Selected contestants will get the opportunity to have intense training with Venture Capitalists, Marketing Guru, and Circular Economy Experts. The Circular Economy Competition is presented by the European Union and supported by GhanaWeb. ","filter_flag":1}
{"title":"33 things you need to know about Chris Skidmore's Net Zero Review - ENDS Report","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuZHNyZXBvcnQuY29tL2FydGljbGUvMTgxMDEwOS8zMy10aGluZ3MtbmVlZC1rbm93LWNocmlzLXNraWRtb3Jlcy1uZXQtemVyby1yZXZpZXfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuZHNyZXBvcnQuY29tL2FydGljbGUvMTgxMDEwOS8zMy10aGluZ3MtbmVlZC1rbm93LWNocmlzLXNraWRtb3Jlcy1uZXQtemVyby1yZXZpZXfSAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmVuZHNyZXBvcnQuY29tL2FydGljbGUvMTgxMDEwOS8zMy10aGluZ3MtbmVlZC1rbm93LWNocmlzLXNraWRtb3Jlcy1uZXQtemVyby1yZXZpZXfSAQA","guidislink":false,"published":"Fri, 13 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=13, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuZHNyZXBvcnQuY29tL2FydGljbGUvMTgxMDEwOS8zMy10aGluZ3MtbmVlZC1rbm93LWNocmlzLXNraWRtb3Jlcy1uZXQtemVyby1yZXZpZXfSAQA?oc=5\" target=\"_blank\">33 things you need to know about Chris Skidmore's Net Zero Review<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ENDS Report<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"33 things you need to know about Chris Skidmore's Net Zero Review - ENDS Report","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuZHNyZXBvcnQuY29tL2FydGljbGUvMTgxMDEwOS8zMy10aGluZ3MtbmVlZC1rbm93LWNocmlzLXNraWRtb3Jlcy1uZXQtemVyby1yZXZpZXfSAQA?oc=5\" target=\"_blank\">33 things you need to know about Chris Skidmore's Net Zero Review<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ENDS Report<\/font>","source.href":"https:\/\/www.endsreport.com","source.title":"ENDS Report","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The review is made up of Skidmore’s findings from more than 50 roundtables with key stakeholders, and the 1,800 responses received following a call for evidence. It is split into two parts, one which emphasises the benefits of net zero for the economy, and the second setting out how to achieve the UK’s 2050 commitment. 1. Government must provide long-term certainty According to the review, the absence of certainty has been “one of the most striking themes of the evidence provided”, with stakeholders reporting that the Net Zero Strategy and other government publications have “not provided adequate certainty to businesses and investors”. Skidmore also calls for a “long-term, stable investment plan” in the next Spending Review, adding that a reluctance to provide long-term funding beyond spending review cycles - while understandable - exacerbates this uncertainty. 2. Net Zero select committees should be created in both Houses of Parliament The review states that while there is significant parliamentary scrutiny of the government’s work to deliver net zero, it is not clear that the current structure is sufficient. It warns that this absence could lead to a lack of single parliamentary scrutiny function and a“missed opportunity” in developing widespread expertise of the government’s decarbonisation activity The review states that among other functions, these committees could act as a “dedicated receiver” of the Climate Change Committee’s annual progress report. 3. A new Office for Net Zero Delivery should be established The review states that this new body should: Have joint ministerial oversight from BEIS and the Cabinet Office Take overall ownership of the delivery of net zero Manage the relationship between the UK government and devolved administrations Own the delivery of priorities that sit outside of any individual government department Advise the government on best delivery practice Identify lessons learned The review calls for this office to be established by Spring 2023. 4. Separate agencies should be created to deliver long-term decarbonisation programmes The review recommends that these agencies should own the long-term delivery of policy ambitions set by departments, be accountable for delivery to their sponsoring departments, regularly publish data on progress and work closely with the devolved administrations. The review also recommends a major expansion of the government’s public reporting on net- zero, it states this could potentially be through the Office for National Statistics’ climate change statistics portal or developed in partnership with the Climate Change Committee (CCC). 5. Government should work with OBR and CCC to set out a process for how it will ensure climate impacts of fiscal decision making are considered The review recommends that the Treasury builds on the recent reporting of Spending Review carbon implications by working with the Office for Budget Responsibility (OBR) and CCC to set out a process for how it will ensure the climate impacts of fiscal decision making are considered. The review states that the government should also commit to publishing the climate impacts of future spending reviews 6. To tackle greenwashing, the UK’s ‘green taxonomy’ should be established at the ‘earliest possibility’ In 2021, the UK government announced work to develop a UK Green Taxonomy, designed to identify economic activities that are environmentally sustainable. Skidmore’s review states it is important for the government to “provide clarity and implement a coherent green taxonomy at the earliest possibility”. The review highlights that currently it can be hard to understand which financial products support the green transition and which ones are just labelled as such. It states that this lack of clarity can “undermine the integrity of capital markets and consumer markets.” Seeking to address this issue, the Financial Conduct Authority (FCA) is currently consulting on aspects of the Sustainability Disclosure Requirement and investment labels to counter greenwashing. The review states that the government and FCA should build on this across a wider scope of sustainability labelled financial products, extending to overseas funds and pension products. It adds that authorities should consider proactively how to align them internationally. 7. Government should consider a Net Zero Charter Mark to acknowledge the best in class among firms The review recommends that in order to recognise company’s efforts to decarbonise, a Net Zero Charter Mark should be established. To be granted this, firms have to be compliant with or ahead of key standards, such as publishing their climate-related financial disclosures, publishing a transition plan with key milestones and progressing against those, and using reliable metrics and data - such as science-based targets - to ensure any disclosure is of high quality. 8. The UK must diversify supply chains for renewable technologies The review highlights that the UK currently relies on just a handful of nations to deliver its net zero supply chains. For example, China accounts for 75% of manufacturing and assembly of solar PV modules and electric vehicle batteries and the Democratic Republic of Congo supplies more than 60% of Cobalt. The review warns that this lack of diversity “creates risk and undermines the resilience of supply chains”. The UK Critical Minerals Strategy, published in July 2022, aimed to outline steps to achieve more diversity, but respondents to the review’s call for evidence said that a more “holistic understanding of critical supply chains for net zero is lacking”. The review states that the government should undertake a net zero infrastructure and technology critical supply chain analysis to inform decisions at the next Spending Review. 9. Wind and solar task forces should be established The government has set many ambitious targets for renewable energy, however according to the review, many businesses made it clear that “more concrete steps are needed to outline how ambition will be met”. Stakeholders were also reportedly clear that a stop-start policy needs to be “avoided at all cost”, with the Association for Renewable Energy and Clean Technology (REA) warning that “sudden policy changes, or reducing support for most affordable renewable technologies, including solar and onshore wind, reduces investor and developer confidence, increasing the cost of capital and overall cost of decarbonisation.” 10. The planning, environmental permitting and grid access processes should be streamlined According to the review, current ambitions to reach a fully decarbonised power sector by 2035 are “at risk due to the time required for developers to go through securing planning permissions, environmental permitting and grid access”. 11. Planning permission should be axed for roof-top solar The review states there should be no planning permission required to install domestic or commercial solar on the rooftops of buildings. Separately, it states that solar farms in the countryside should be “planned piecemeal but in a coordinated fashion as part of a Land Use Strategy that the review encourages in its section on land and agriculture”. 12. ‘No reason’ why onshore wind should not be deployed at scale The report also states that if local communities wish to have onshore wind, and can work with energy suppliers and distribution network operators to find an “agreeable mutually beneficial solution that delivers long-term benefits for local residents, then there is no reason why onshore wind should not be deployed at scale”. 13. Planning and consenting decisions should be streamlined for nuclear power According to the review, the main barrier for new nuclear projects is the need for stable, long-term policy and funding commitments given the long timeframes involved in the building of nuclear plants. Skidmore emphasises the reforms set out in the British Energy Security Strategy need to be implemented including speeding up the set-up of Great British Nuclear (GBN) in early 2023. His review suggests the government and GBN need to set out a clear roadmap in 2023 for reaching a final investment decision in the next Parliament and assess the possibility to increase the current ambitions. It also suggests clear pathways for different nuclear technologies, such as small modular reactors, need to be outlined which consider how to use programmatic approach to deliver further cost reductions in a competitive environment. To ensure nuclear projects are not unnecessarily delayed, the review recommends that the government streamlines planning and consenting decisions, “whilst continuing to drive compliance with the highest security standards.” 14. UK risks falling behind it it doesn’t ‘move quickly’ on hydrogen The report states that hydrogen will play a “vital role” in our future energy mix and adds that given the “nascency of the sector, the UK could be a global leader”. However it warns that the UK “faces a real risk of losing out on the international stage if it does not move quickly”. The review recommends that by the end of 2023, the UK develops and implements an ambitious and pragmatic ’10 year’ delivery roadmap for scaling up production. 15. Sustainable biomass seen as an important role in the net zero transition The review notes that sustainability criteria is needed to “guard against adverse impacts of a finite global supply”. It adds that it is critical that any biomass adheres to a stringent set of sustainability criteria, to guard against unintended adverse impacts like land use change leading to deforestation, particularly as part of global supply chains. It recommends that the government publish its biomass strategy soon as possible. 16. Emissions should be reduced from current oil and gas production To reduce emissions from existing oil and gas production, the review makes several recommendations. These include: Accelerating the end of routine flaring from 2030 to 2025 Ensuring all new oil and gas fields have abatement built in now Ensuring the Climate Compatibility Checkpoint is an effective tool now to shape policy making Consider setting fossil fuel producers operating domestically a 10% storage obligation target to restore carbon dioxide to the geosphere by at least 2035, separate to any investment on nature based solutions. Ensuring greater transparency and data from industry on the carbon intensity of oil & gas (O&G) imports, and also from the North Sea Transition Authority (NSTA) and industry on O&G that is produced. Publish an offshore industries integrated strategy by the end of 2024. However, the review states that “we need to reduce our reliance on hydrocarbons as quickly as possible”. 17. UK has the potential to provide carbon storage solutions to other countries The review says that the carbon capture, utilisation and storage (CCUS) industry represents a unique opportunity for the UK, given the geological storage opportunities under the North and Celtic Sea, which according to the review total an estimated 78 gigatonnes, enough to support the UK’s demand for hundreds of years. It states that with limited EU storage capacity, the UK could provide storage services for other countries, if regulatory barriers can be addressed. The review states the UK must act quickly to “foster certainty and attract the investment that we need.” In 2023, the review says, the government “must act quickly to re-envisage and implement” a clear carbon capture and storage plan beyond 2030. As soon as legislation allows, the review also calls on the government to finalise the business models and regulatory frameworks across the value chain, including for industrial CCS, Energy from Waste with CCS and CO2 transport and storage. 18. Clarity, coordination, and stability is needed for investors and investments Skidmore’s review suggests that through the Green Finance Strategy, a “clear, robust and ambitious approach to disclosure, standard setting, and scaling up green finance” needs to be set out. It also suggests a review is carried out into how the UK can become the most competitive financial centre for green and transition listings, capital raising and project financing. Skidmore suggests a review should be carried out into how to change regulation for emerging net zero technologies to enable their rapid and safe introduction, which are currently uncertain. He says this should be published by this autumn. Skidmore’s review also suggests that the Treasury review by the end of this year how policy incentivises investment in decarbonisation, including via the tax system and capital allowances. These developments aim to provide a more stable environment for businesses to invest in new technologies. Among suggestions under this remit, Skidmore also proposes a new forum for all regulators to coordinate on their messaging about the net zero transition and an overarching financing strategy to be introduced to cover how government actions will scale up private finance to deliver the UK’s net zero. 19. The construction industry needs support with decarbonisation With buildings and construction responsible for an estimated 43% of UK emissions, Skidmore recommends that the government develop a public procurement plan for low-carbon construction and the use of low-carbon materials, by the end of 2023. In terms of machinery, Skidmore also recommends developing a strategy on the decarbonisation of non-road mobile machinery by the end of 2023 as a plan for this is currently absent according to the review. He also proposes more support is given to retrofitting, where existing houses are made more energy efficient through a variety of measures. 20. The UK needs to move rapidly to a more circular economy The review calls for a “more ambitious approach to managing waste and encouraging re-use and recycling” which it says could decrease emissions as well as providing a significant economic opportunity. Skidmore suggests policy on this so far has been “too slow and is failing to grasp these opportunities”. Evidence provided to the review suggested that maximising resource efficiency and improving waste measures would increase GDP by 0.9% by 2035, creating more than 200,000 gross jobs in the UK by 2030. He also notes that the UK currently exports a significant amount of its waste to be processed overseas, but responses to the call for evidence suggested there is an economic opportunity for the UK to process more of its waste here. The government has made a number of commitments in recent years via the Resources and Waste Strategy for England 2018, and the Net Zero Strategy 2021, however the review heard “very clearly” that the UK is not delivering on many of its existing commitments. The review states “a clear national mission focused on the circular economy will overcome the uncertainty of the current policy environment and ensure the long-term commitment that stakeholders are asking for”. It recommends: delivering urgently on commitments that the UK has already made on collection and packaging reforms; launching a task force to work jointly with industry to identify barriers and enablers and develop sector-specific circular economy business models for priority sectors; ending export of UK plastic waste by 2027; and delivering UK recycling infrastructure capacity in key areas. 21. Bring the gas free homes target forward To provide certainty on the gas boiler phase out, which is currently proposed for 2035, Skidmore recommends legislating for 2033 instead. He also suggests setting a legislative target for gas free homes and appliances by the same date. 22. Improve energy efficiency standards Skidmore’s review also suggests that the government legislate for all homes sold by 2033 to have an EPC rating of C or above, with some exceptions. He also recommends legislating to require that by 2025 the minimum energy efficiency rating should be EPC B for all non-domestic buildings, both rented and owned, by 2030, and an EPC B rating for all new non-domestic buildings from 2025. He suggests that all consultations and work to mandate the Future Homes Standard should be brought forward to 2025 to prevent further delays and should include a consultation on delivering a Net Zero Homes Standard. Skidmore also says that putting commercial minimum energy efficiency product standards in place by 2028 could ensure that our market is seen as serious about energy efficiency, attracting more investment. 23. Need to meet deadlines on food, agriculture, nature, and land use targets Skidmore emphasises in the review that net zero and nature are “inextricably linked”. He argues that a land use framework should be published as soon as possible, and at least by mid-2023. He also calls for the government to publish full details of all Environmental Land Management Schemes and future plans by the end of 2023 - with a particular focus on how participants can take advantage of both public and private finance. In terms of reducing emissions, he also calls for the government to ensure that 50% of UK-based food and drink businesses measure and report their scope 3 emissions against a government- and industry-agreed standard. 24. Business encouragement and tax policy to incentivise growth and decarbonisation is needed Skidmore argues that the government should use a balanced approach of tax incentives and disincentives to encourage economic activity that meets the dual objective of growth and decarbonisation. The review found that although there are already some tax benefit schemes in place to support decarbonisation, a net zero tax audit would help to ensure that the taxes not defined as ‘environmental’ also support the transition. Skidmore also suggests that by autumn 2023 the Treasury should review how policy incentivises investment in decarbonisation, including via the tax system and capital allowances. Furthermore, he makes the case that the government should keep tabs on the current business rates incentives to make sure that investing in net zero technologies is not discouraged. 25. Small and Medium Enterprises (SMEs) need more support to reach net zero SMEs account for almost one third of all UK emissions and around half of total UK business emissions, according to analysis by the British Business Bank. However, bigger businesses are able to participate in net zero more easily according to the review. Skidmore outlined a number of measures to encourage and “empower” SMEs to take a more active role in the transition, including tax incentives and working with subcontractors and landlords. He recommended that the government develop an SME role models programme, which provides mentoring for micro businesses and the self-employed by 2023 and setting up a taskforce of suppliers, small business landlords and business groups to agree on how to cut energy use in rented premises by 2023. 26. Work with local authorities and up public engagement The Climate Change Committee (CCC) has noted that: “There is considerable momentum at local government level. However, there is currently a lack of shared understanding of where these good intentions would be most effectively directed.” Skidmore highlights that the government’s current approach to net zero delivery is “creating inefficiencies at a local level”, due to a lack of support and a disjointed and short-term approach to funding. For the next Spending Review, Skidmore suggests that government departments work closely together to deliver local net zero funding reform. Skidmore also suggests that the government improve relationships with local authorities and fully support “at least one” net zero city, local authority and community, to reach net zero by 2030. He also suggests the local planning system and the National Planning Policy Framework is reformed to improve clarity and consistency in terms of net zero. The review also looked at whether a statutory duty should be introduced for local authorities to take account of the UK’s net zero targets, and said it would be useful and needs to be carefully designed. Skidmore calls for more guidance on Local Area Energy Plans and for more Net Zero Neighbourhood plans, as well as setting out a framework for community benefits, emphasising that: “a locally-led, place-based approach to net zero delivery will not just deliver a better tailored, more supported transition, but it can also deliver greater economic and social benefits”. The review also suggests that the government works with local authorities to improve monitoring, reporting and accountability for local net zero delivery as this was a key issue raised in the consultation In terms of energy, Skidmore encourages the government to commit to the Local Electricity Bill to see community projects provide energy directly to local households and businesses, and work with the sector to create a Community Energy Strategy. In terms of increasing public engagement, Skidmore calls for a public engagement plan on net zero for England to be published by 2023. 27. A carbon calculator Skidmore suggested that in 2023 the government run a competition to create a Carbon Calculator to inform consumers of the carbon intensity of different choices. 28. Net zero can permanently reduce energy bills and see money saved in indirect ways Skidmore’s review found that the average household will make a cumulative saving of between £400 and £6,000 by 2050, under planned net zero measures. He also argues that bills will be permanently reduced under the new strategy, homes will go up in value and savings will even be made by the NHS when less illness is caused by cold homes. 29. Net zero could see job creation Throughout the review, Skidmore highlighted the jobs creation element of net zero. He claims that the government’s planned pathway to net zero carbon emissions by 2050 could support 1.18 million direct jobs by 2050. 30. Push is needed for decarbonising the transport sector The transport sector is the largest source of greenhouse gas emissions in the UK, with greenhouse gas emissions remaining stable according to the review. To increase investment, and as part of reducing delays to wider regulatory reform, the review suggests the government bring forward the delayed Future of Transport Bill this Parliament. Key points from this huge section of the review include a recommendation for the government to “swiftly” deliver the Zero Emission Vehicle mandate, to apply from 2024, while continuing to support the uptake of electric and other zero emission vehicles, with improvements to infrastructure and consistency for smart charging. The Review also considered it important that the government maintains support for building domestic supply chains and manufacturing for electric vehicles as part of the Automotive Transformation Fund, and the Faraday Battery Challenge. Responses to the review highlighted that high levels of energy and carbon costs to manufacturing may act as a deterrent in the UK. It also calls for the government to publish the Low Carbon Fuels Strategy in 2023 and the necessary legislation for the sustainable aviation fuels (SAF) mandate to apply from 2025, and for government to set out options for further legislative steps by 2024 and take a leading role in International Maritime Organization (IMO) negotiations to decarbonise the maritime sector. It further sets out that the government should continue to work with industry to set out a clear programme by 2024 to accelerate decarbonisation of the wider freight sector through modal shift and deployment of new technologies, building on the Future of Freight Plan. 31. Government should create a roadmap for deploying research and development (R&D) According to the review, stakeholders across industry and academia were clear that for the UK to have technology which meet net zero ambitions, there must be a clear understanding of the R&D and technological developments that must occur between now and 2050. Stakeholders recommended the government publish a roadmap working backwards from 2050 to determine the critical points at which decisions must be made for the development and deployment of these technologies. The review has called for this to be published by Autumn 2023. 32. Consultation on carbon leakage measures should be sped up The review warns that UK efforts to reach its net zero carbon targets could be “undermined” by carbon leakage. Carbon leakage is the displacement of production and associated emissions from one jurisdiction to another, due to different levels of climate action across jurisdictions including through carbon pricing and climate regulation. The review calls on the government to progress with the consultation on carbon leakage measures and speed up decision-making to enable effective carbon leakage mitigations to be implemented from 2026. It also adds that carbon leakage should be considered within the UK Emissions Trading Scheme. 33. Regulator for carbon offsets should be established The review states that the government should endorse international Voluntary Carbon Markets (VCM) standards “as soon as possible” and consult on formally adopting regulated standards for VCMs and setting up a regulator for carbon credits and offsets by 2024. The review highlights that high-integrity offsets bought by businesses can “play an important role in the transition to net zero”. However, it warns that before voluntary carbon markets can grow responsibly, businesses need assurance of the integrity of any offsets and greenhouse gas removal (GGR) investments. As such, it states that government action can play a key role in setting standards for carbon offsets, providing reassurance to businesses and ensuring that investments lead to credible emissions reductions. The full Net Zero review can be found here.","filter_flag":1}
