{"title":"Recycling Basics and Benefits | US EPA - U.S. EPA.gov","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LmVwYS5nb3YvcmVjeWNsZS9yZWN5Y2xpbmctYmFzaWNzLWFuZC1iZW5lZml0c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LmVwYS5nb3YvcmVjeWNsZS9yZWN5Y2xpbmctYmFzaWNzLWFuZC1iZW5lZml0c9IBAA?oc=5","id":"CBMiOWh0dHBzOi8vd3d3LmVwYS5nb3YvcmVjeWNsZS9yZWN5Y2xpbmctYmFzaWNzLWFuZC1iZW5lZml0c9IBAA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LmVwYS5nb3YvcmVjeWNsZS9yZWN5Y2xpbmctYmFzaWNzLWFuZC1iZW5lZml0c9IBAA?oc=5\" target=\"_blank\">Recycling Basics and Benefits | US EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. EPA.gov<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycling Basics and Benefits | US EPA - U.S. EPA.gov","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LmVwYS5nb3YvcmVjeWNsZS9yZWN5Y2xpbmctYmFzaWNzLWFuZC1iZW5lZml0c9IBAA?oc=5\" target=\"_blank\">Recycling Basics and Benefits | US EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. EPA.gov<\/font>","source.href":"https:\/\/www.epa.gov","source.title":"U.S. EPA.gov","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Recycling is the process of collecting and processing materials that would otherwise be thrown away as trash and turning them into new products. Recycling can benefit your community, the economy, and the environment. Products should only be recycled if they cannot be reduced or reused. EPA promotes the waste management hierarchy, which ranks various waste management strategies from most to least environmentally preferred. The hierarchy prioritizes source reduction and the reuse of waste materials over recycling. On this page: Benefits of Recycling Environment Recycling provides many benefits to our environment. By recycling our materials, we create a healthier planet for ourselves and future generations. Conserve natural resources: Recycling reduces the need to extract resources such as timber, water, and minerals for new products. Climate change: According to the most recent EPA data, the recycling and composting of municipal solid waste (MSW or trash) saved over 193 million metric tons of carbon dioxide equivalent in 2018. Energy savings: Recycling conserves energy. For example, recycling just 10 plastic bottles saves enough energy to power a laptop for more than 25 hours. To estimate how much energy you can save by recycling certain products, EPA developed the individual Waste Reduction Model (iWARM). Waste and pollution reduction: Recycling diverts waste away from landfills and incinerators, which reduces the harmful effects of pollution and emissions. Economy EPA released significant findings on the economic benefits of the recycling industry with an update to the national Recycling Economic Information (REI) Study in 2020. This study analyzes the numbers of jobs, wages and tax revenues attributed to recycling. The study found that in a single year, recycling and reuse activities in the United States accounted for: 681,000 jobs, $37.8 billion in wages, and $5.5 billion in tax revenues. This equates to 1.17 jobs per 1,000 tons of materials recycled and $65.23 in wages and $9.42 in tax revenue for every ton of materials recycled. For more information, check out the full report. Community Environmental Justice: Across the country, waste management facilities are concentrated in underserved communities, and they can have negative impacts on human health, property values, aesthetic and recreation values, and land productivity. Recycling provides these areas with a healthier and more sustainable alternative. International: Waste generated in the United States also affects communities in other countries. Recycled materials are exported to some countries that are not able to manage those materials in an environmentally sound manner. U.S. Recycling System Overview The recycling process is made up of three steps that are repeated over and over again. This creates a continuous loop which is represented by the familiar chasing arrows recycling symbol. The three steps of the recycling process are described below. Step 1: Collection and Processing Businesses and consumers generate recyclables that are then collected by either a private hauler or government entity. There are several methods for collecting recyclables, including curbside collection, drop-off centers, and deposit or refund programs. Visit How do I recycle... Common Recyclables for information on specific materials. After collection, recyclables are sent to a recovery facility to be sorted, cleaned, and processed into materials that can be used in manufacturing. Recyclables are bought and sold just like raw materials would be, and prices go up and down depending on supply and demand in the United States and around the world. Step 2: Manufacturing After processing, recyclables are made into new products at a recycling plant or similar facility. More and more of today's products are being manufactured with recycled content. Recycled materials are also used in new ways such as recovered glass in asphalt to pave roads or recovered plastic in carpeting and park benches. Step 3: Purchasing New Products Made from Recycled Materials You help close the recycling loop by buying new products made from recycled materials. There are thousands of products that contain recycled content. When you go shopping, look for the following: Products that can be easily recycled Products that contain recycled content Below are some of the terms used: Recycled-content product - The product was manufactured with recycled materials either collected from a recycling program or from waste recovered during the normal manufacturing process. The label will sometimes include how much of the content came from recycled materials. Post-consumer content - Very similar to recycled content, but the material comes only from recyclables collected from consumers or businesses through a recycling program. Recyclable product - Products that can be collected, processed, and manufactured into new products after they have been used. These products do not necessarily contain recycled materials. Remember not all kinds of recyclables may be collected in your community, so be sure to check with your local recycling program before you buy. Some common products you can find that are made with recycled content include the following: Aluminum cans Car bumpers Carpeting Cereal boxes Comic books Egg cartons Glass containers Laundry detergent bottles Motor oil Nails Newspapers Paper towels Steel products Trash bags Challenges to Recycling System While the benefits of recycling are clear, the current system still faces many challenges. Many people are confused about what items can be recycled, where they can be recycled and how. This often leads to recyclables going in the trash or trash going in the recycling bin. America’s recycling infrastructure has not kept pace with today’s waste stream. Communication between the manufacturers of new materials and products and the recycling industry needs to be improved to prepare for and optimally manage the recycling of new materials. Domestic markets for recycled materials need to be strengthened in the United States. Historically, some of the recycled materials generated in the U.S. have been exported internationally. However, changing international policies have limited the export of materials. Improving communication among the different sectors of the recycling system is needed to strengthen the development of existing materials markets and to develop new innovative markets. We need to better integrate recycled materials and end-of-life management into product and packaging designs. More consistent measurement methodologies are necessary to improve recycling system performance. These more standardized metrics can then be used to create effective goals and track progress. What is Being Done? The Bipartisan Infrastructure Law: Transforming U.S. Recycling and Waste Management: The Bipartisan Infrastructure Law is a historic investment in the health, equity, and resilience of American communities. With unprecedented funding to support state and local waste management infrastructure and recycling programs, EPA will improve health and safety and help establish and increase recycling programs nationwide. National Recycling Strategy: EPA developed the National Recycling Strategy with a focus on advancing the national municipal solid waste recycling system. It identifies strategic objectives and actions to create a stronger, more resilient, and cost-effective recycling system. Draft Strategy to Prevent Plastics Pollution: This strategy builds upon EPA’s National Recycling Strategy and focuses on actions to reduce, reuse, collect, and capture plastic waste. America Recycles Day: Every year on November 15, EPA reminds everyone of the importance and impact of recycling through education and outreach. Basel Convention: The United States is a signatory to the Basel Convention, but has not yet become a Party to the Convention. The Basel Convention establishes standards for the transboundary movement of various types of waste.","filter_flag":1}
{"title":"Plastic bottles and bags to be made with more recycled content - Islands' Weekly","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA","guidislink":false,"published":"Sat, 11 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=315, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5\" target=\"_blank\">Plastic bottles and bags to be made with more recycled content<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Islands' Weekly<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plastic bottles and bags to be made with more recycled content - Islands' Weekly","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5\" target=\"_blank\">Plastic bottles and bags to be made with more recycled content<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Islands' Weekly<\/font>","source.href":"https:\/\/www.islandsweekly.com","source.title":"Islands' Weekly","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Submitted by the Washington Department of Ecology You can find plastic trash everywhere. It’s one of the most common items in roadside litter. Plastic bottles and containers end up in our lakes and rivers, and plastic refuse mars our parks and public spaces. Moreover, the fossil fuels that go into making these products contribute to climate change. New regulations from the Washington Department of Ecology will help to address some of those problems by increasing the amount of plastic that gets recycled and reused to make new plastic packaging. Companies that sell drinks, milk, wine, trash bags, personal care products, and household cleaners must include more recycled plastic in their packaging, according to the new rule. “You don’t have to look very hard to see that we have a plastic problem – plastic containers are among the most common items we find in roadside litter,” said Ecology Director Laura Watson. “This rule will help us reduce pollution, increase the value of our recycling, and make sure that we’re doing everything possible to keep Washington beautiful and litter-free.” Since January, companies that make trash bags and beverage containers have been required to make their products with at least 10% and 15% recycled content, respectively. The requirements gradually increase over the next 12 years, and expand to include plastic packaging for other common products. By 2036, most plastic packaging will be required to contain at least 50% recycled content. A graph showing the increase in recycled material in plastic containers over the next 12 years. Every year, companies must comply with the requirements, report, and pay fees based on the weight of plastic they sell into the state. Increasing recycled content in plastics is the latest step in implementing a 2021 law passed by the Washington Legislature, aimed at reducing the use of single-use plastics. The law banned single-use plastic bags as well as foam packing peanuts and takeout containers. It also restricted the use of throw-away plastic takeout items at restaurants and lodging establishments and set new standards for recycled plastic content. “Plastic pollution is ugly, harmful, and expensive to clean up,” said Peter Lyon, manager of Ecology’s Solid Waste Management program. “Using recycled plastic to make new products is the sustainable thing to do, and it cuts down on harmful greenhouse gas emissions.”","filter_flag":1}
{"title":"Amcor and NOVA Chemicals announce agreement to source mechanically recycled polyethylene USA - English ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FtY29yLWFuZC1ub3ZhLWNoZW1pY2Fscy1hbm5vdW5jZS1hZ3JlZW1lbnQtdG8tc291cmNlLW1lY2hhbmljYWxseS1yZWN5Y2xlZC1wb2x5ZXRoeWxlbmUtMzAxOTgwNzc5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FtY29yLWFuZC1ub3ZhLWNoZW1pY2Fscy1hbm5vdW5jZS1hZ3JlZW1lbnQtdG8tc291cmNlLW1lY2hhbmljYWxseS1yZWN5Y2xlZC1wb2x5ZXRoeWxlbmUtMzAxOTgwNzc5Lmh0bWzSAQA?oc=5","id":"CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FtY29yLWFuZC1ub3ZhLWNoZW1pY2Fscy1hbm5vdW5jZS1hZ3JlZW1lbnQtdG8tc291cmNlLW1lY2hhbmljYWxseS1yZWN5Y2xlZC1wb2x5ZXRoeWxlbmUtMzAxOTgwNzc5Lmh0bWzSAQA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FtY29yLWFuZC1ub3ZhLWNoZW1pY2Fscy1hbm5vdW5jZS1hZ3JlZW1lbnQtdG8tc291cmNlLW1lY2hhbmljYWxseS1yZWN5Y2xlZC1wb2x5ZXRoeWxlbmUtMzAxOTgwNzc5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Amcor and NOVA Chemicals announce agreement to source mechanically recycled polyethylene USA - English ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Amcor and NOVA Chemicals announce agreement to source mechanically recycled polyethylene USA - English ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FtY29yLWFuZC1ub3ZhLWNoZW1pY2Fscy1hbm5vdW5jZS1hZ3JlZW1lbnQtdG8tc291cmNlLW1lY2hhbmljYWxseS1yZWN5Y2xlZC1wb2x5ZXRoeWxlbmUtMzAxOTgwNzc5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Amcor and NOVA Chemicals announce agreement to source mechanically recycled polyethylene USA - English ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Multiyear collaboration reflects shared commitment to circular content DEERFIELD, Ill., Nov. 8, 2023 \/PRNewswire\/ -- Amcor (NYSE: AMCR, ASX:AMC), a global leader in developing and producing responsible packaging solutions, today announced a Memorandum of Understanding (MOU) with leading sustainable polyethylene producer NOVA Chemicals Corporation (\"NOVA Chemicals\") for the purchase of mechanically recycled polyethylene resin (rPE) for use in flexible packaging films. Increasing the use of rPE in flexible packaging applications is an important element of Amcor's commitment to support packaging circularity. NOVA Chemicals’ first mechanical recycling facility in Connersville, Indiana, is projected to be in operation as early as 2025. The supply agreement would enable Amcor to purchase SYNDIGO™ rPE resin, manufactured at NOVA Chemicals' first mechanical recycling facility in Connersville, Indiana, which is projected to be in operation as early as 2025. The recycling facility was announced in July as a significant expansion of NOVA Chemicals' Circular Solutions business. \"This is an exciting opportunity for us to supplement our rPE supply in support of our target to achieve 30% recycled material usage across our global portfolio by 2030,\" said Fred Stephan, president of Amcor Flexibles North America. \"Incorporating rPE into flexible packaging films helps brand owners meet voluntary commitments on recycled content targets, reduce greenhouse gas emissions, and keep plastic waste in the economy and out of the environment.\" \"We are pleased to work with Amcor to bring more film-grade rPE to market and further drive the circular economy,\" said Greg DeKunder, vice president, NOVA Circular Solutions. \"Reshaping plastics for a better future will take collaboration within our industry, and we share Amcor's commitment to further global packaging circularity.\" NOVA Chemicals plans to expand its recycling footprint across North America over the next several years to help reach its industry-leading ambition of 30% share of total PE sales from products containing recycled content. About Amcor Amcor is a global leader in developing and producing responsible packaging solutions across a variety of materials for food, beverage, pharmaceutical, medical, home and personal-care, and other products. Amcor works with leading companies around the world to protect their products and the people who rely on them, differentiate brands, and improve supply chains through a range of flexible and rigid packaging, specialty cartons, closures, and services. The company is focused on making packaging that is increasingly lighter weight, recyclable and reusable, and made using an increasing amount of recycled content. In fiscal year 2023, 41,000 Amcor people generated $14.7 billion in annual sales from operations that span 218 locations in 41 countries. NYSE: AMCR; ASX: AMC www.amcor.com I LinkedIn I Facebook I YouTube About NOVA Chemicals Corporation NOVA Chemicals aspires to be the leading sustainable polyethylene producer in North America. Our driving purpose is to reshape plastics for a better, more sustainable world by delivering innovative solutions that help make everyday life healthier and safer and acting as a catalyst for a low carbon, zero-plastic-waste future. NOVA Chemicals' innovative and quality product offerings, value chain collaboration, and unique customer experience is what sets us apart; our customers use our products to create easy-to-recycle and recycled content films, packaging, and products. Our employees work to ensure health, safety, security, and environmental stewardship through our commitment to Sustainability and Responsible Care®. NOVA Chemicals, headquartered in Calgary, Alberta, Canada, has nearly 2,500 employees worldwide and is wholly owned by Mubadala Investment Company of the Emirate of Abu Dhabi, United Arab Emirates. Learn more at www.novachem.com or follow us on LinkedIn. NOVA Chemicals' logo is a registered trademark of NOVA Brands Ltd.; authorized use. Responsible Care® is a registered trademark of the Chemistry Industry Association of Canada. SYNDIGO™ is a trademark of NOVA Brands Ltd.; authorized use. SOURCE Amcor","filter_flag":1}
{"title":"Australia strengthens packaging standards with new national laws - Packaging Gateway","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnBhY2thZ2luZy1nYXRld2F5LmNvbS9uZXdzL2F1c3RyYWxpYS1sYXdzLWV4cGFuc2lvbi1wYWNrYWdpbmcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnBhY2thZ2luZy1nYXRld2F5LmNvbS9uZXdzL2F1c3RyYWxpYS1sYXdzLWV4cGFuc2lvbi1wYWNrYWdpbmcv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LnBhY2thZ2luZy1nYXRld2F5LmNvbS9uZXdzL2F1c3RyYWxpYS1sYXdzLWV4cGFuc2lvbi1wYWNrYWdpbmcv0gEA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnBhY2thZ2luZy1nYXRld2F5LmNvbS9uZXdzL2F1c3RyYWxpYS1sYXdzLWV4cGFuc2lvbi1wYWNrYWdpbmcv0gEA?oc=5\" target=\"_blank\">Australia strengthens packaging standards with new national laws<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Gateway<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Australia strengthens packaging standards with new national laws - Packaging Gateway","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnBhY2thZ2luZy1nYXRld2F5LmNvbS9uZXdzL2F1c3RyYWxpYS1sYXdzLWV4cGFuc2lvbi1wYWNrYWdpbmcv0gEA?oc=5\" target=\"_blank\">Australia strengthens packaging standards with new national laws<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Gateway<\/font>","source.href":"https:\/\/www.packaging-gateway.com","source.title":"Packaging Gateway","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The legislation will see national packaging companies collectively responsible for 6.7 million tonnes of waste. Credit: Connect world via Shutterstock. The national environmental ministers of Australia have agreed to develop new packaging standards to expedite the country’s transition towards a circular economy. As part of this, the country will set nationwide minimum recycled content requirements and forbid the use of harmful chemicals in domestic packaging. A government press release said: “This will make decisions at the checkout much easier for shoppers, who won’t have to spend precious time comparing the environmental credentials of different products.” Under these national packaging laws, businesses in the country will be held accountable for the 6.7 million tonnes of packaging they are claimed to collectively dispose of into the Australian market. Ministers also called for a national traceability framework, which they believe will improve customers’ confidence in the use of recycled materials when purchasing recycled products. The framework is crucial in driving the reuse of recovered plastics, glass, and other materials into new products, the government claimed. Australian Food and Grocery Council, in a statement, added: “Any increase in the use of recycled content relies on sufficient collection and processing of that material here in Australia. “Mandatory design standards are essential for a circular economy, but importantly require a recycling system to process the material Australians collect at home. “Traceability of recycling material will provide confidence for Australians to recycle, brands the confidence to procure recycled content and the broader supply chain the confidence to invest in recycling infrastructure, creating local jobs.” The states of Western Australia, Queensland, and South Australia already have a ban in place for a range of single-use plastic items. The ban came into effect on 1 September 2023.","filter_flag":1}
{"title":"Parliament votes to water down EU's packaging waste law - EURACTIV","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9uZXdzL3BhcmxpYW1lbnQtdm90ZXMtdG8td2F0ZXItZG93bi1ldXMtcGFja2FnaW5nLXdhc3RlLWxhdy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9uZXdzL3BhcmxpYW1lbnQtdm90ZXMtdG8td2F0ZXItZG93bi1ldXMtcGFja2FnaW5nLXdhc3RlLWxhdy_SAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9uZXdzL3BhcmxpYW1lbnQtdm90ZXMtdG8td2F0ZXItZG93bi1ldXMtcGFja2FnaW5nLXdhc3RlLWxhdy_SAQA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9uZXdzL3BhcmxpYW1lbnQtdm90ZXMtdG8td2F0ZXItZG93bi1ldXMtcGFja2FnaW5nLXdhc3RlLWxhdy_SAQA?oc=5\" target=\"_blank\">Parliament votes to water down EU's packaging waste law<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EURACTIV<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Parliament votes to water down EU's packaging waste law - EURACTIV","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmV1cmFjdGl2LmNvbS9zZWN0aW9uL2VuZXJneS1lbnZpcm9ubWVudC9uZXdzL3BhcmxpYW1lbnQtdm90ZXMtdG8td2F0ZXItZG93bi1ldXMtcGFja2FnaW5nLXdhc3RlLWxhdy_SAQA?oc=5\" target=\"_blank\">Parliament votes to water down EU's packaging waste law<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EURACTIV<\/font>","source.href":"https:\/\/www.euractiv.com","source.title":"EURACTIV","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The European Parliament adopted its position Wednesday (22 November) on legislation to reduce packaging waste, weakening some key measures on the table following a tense debate on the role of reuse, recycling and bans. Each European produces 190 kilograms of packaging waste yearly, something the new law aimed to reverse with a renewed push on recycling and new targets on reuse and waste prevention. However, lawmakers voted to weaken some of these measures, including on reuse and bans for unnecessary packaging, following political division and intense lobbying. In the end, the Parliament’s stance on the law was passed with 426 votes in favour, 125 against and 74 abstentions, after “a very difficult vote”, according to Nils Torvalds, a Finnish centrist MEP who is one of the lead lawmakers on the file. With the Parliament’s position now adopted, negotiations can start with EU member states to finalise the law in so-called trilogue talks also involving the European Commission. Reuse and bans weakened The Parliament’s position includes reducing unnecessary packaging by 5% by 2030, 10% by 2035 and 15% by 2040. There are also specific measures to reduce plastic packaging, including a ban on very lightweight plastic carrier bags (unless required for hygiene or preventing food waste) and heavy restrictions on single-use formats like miniature hotel toiletries. Overall, lawmakers want to cut the amount of plastic packaging in Europe by 10% by 2030, 15% by 2035 and 20% by 2040. However, measures to reduce packaging waste such as bans on unnecessary packaging, were removed, making environmental organisations question how waste reduction targets will be achieved. Reuse targets were also watered down, with a new provision allowing EU countries to get out of 2030 reuse targets for a specific packaging type if they have a recycling rate of over 85% for that material. Lead EU lawmaker cuts takeaway reuse targets from draft packaging waste law Targets to boost the reuse of packaging in the restaurant sector have been deleted by the European Parliament lawmaker in charge of negotiating a new law on packaging waste, according to a set of amendments seen by EURACTIV. This drew the ire of NGOs and left-wing lawmakers who criticised the European Parliament’s stance as a missed opportunity to boost reuse and pointed the finger at lawmakers for bowing to pressure from industry. “We cannot recycle our way out of this mess,” said Green lawmaker Grace O’Sullivan. “If your single-use plastic cup is recycled into a single-use plastic bag, it is not sustainable. If your plastic junk is swapped for cardboard junk, it is not sustainable. And if we continue to generate levels of waste at current rates, that is, by definition, unsustainable,” she added. The agreed text reads like the “packaging lobby’s Christmas wish list,” said German lawmaker Delara Burkhardt, who was fighting for strong reuse provisions on behalf of the Parliament’s socialist group. “We could have made reusable packaging the norm across Europe, banned unnecessary single-use packaging like disposable cups in fast-food restaurants or individual plastic packaging for fruits and vegetables, and set guidelines against excessive air in shipping packages,” the German MEP said. “The European Parliament has missed a significant opportunity to address the growing waste heaps in the EU,” she added. Similarly, Zero Waste Europe, an environmental pressure group, criticised the removal of bans for disposable plates and cups from dine-in restaurants and single-use packaging for fruit and vegetables. “Granting derogations and exemptions on waste prevention and reuse to ‘appease’ industry players is unacceptable and takes us even further from the ultimate goal of this revision: reducing packaging waste,” said Aline Maigret, head of policy at the NGO. Conservatives satisfied Meanwhile, centre-right and conservative lawmakers welcomed the Parliament vote as a shift away from the “over-regulation and micro-management” contained in the draft proposal by the European Commission. “A ban on packaging alone will not reduce waste,” said Massimiliano Salini, the lead lawmaker on the file for the centre-right European People’s Party (EPP). “We need innovative, fully renewable and recycled packaging formats. These should not be banned,” he added, saying he was happy that bans on certain packaging formats were abandoned. “Our first concern is food safety and health, where single-use packaging plays a key role in our everyday lives. While aiming for reuse, we must be aware of packaging’s life cycle. One cannot generalise, single-use can still be the best environmental solution in certain circumstances,” Salini said. Italian lawmakers weigh on EU's green packaging law ahead of key vote Lawmakers in the European Parliament’s environment committee will vote on their approach to new rules tackling packaging waste on Tuesday (24 October) amid warnings from environmental groups that the law risks being watered down due to a concerted pushback from Italian MEPs. Industry groups were also largely happy with the result. UNESDA, representing the European soft drinks sector, commended “positive efforts” by the European Parliament to create a circular economy. “We very much appreciate MEPs’ efforts in promoting circularity of beverage packaging by enabling closed-loop recycling, mandating the setting-up of Deposit and Return Systems (DRS) and acknowledging the complementarity of reuse and recycling as well as the role of systems enabling refill,” said Nicholas Hodac, director general of UNESDA. Industry groups also welcomed the Parliament’s bigger focus on improving waste collection, which is a precondition to improve recycling. “We welcome the adoption of a mandatory collection target for packaging – an indispensable condition for effective recycling,” said Annick Carpentier, director general at the Alliance for Beverage Cartons and the Environment (ACE). “Overall, ACE is pleased to see that the definition of high-quality recycling remains linked with the quality of recycled materials and their potential to substitute primary raw materials,” she added. On the other hand, the plastics industry was not happy, criticising arbitrary bans and watered targets for recycled content to be incorporated into new products. “It is unfortunate that the decision by the environment committee to reduce the recycled content targets for contact-sensitive packaging has not been reversed in Plenary,” said Virginia Janssens, managing director at Plastics Europe, a trade association. This is a missed opportunity to use the Packaging and Packaging Waste Regulation to boost the development of the market for recycled plastic packaging in Europe,” she added. Definition of 'high-quality' recycling takes centre stage in EU packaging law The European Union wants to reduce waste by encouraging recycling and reuse in its new packaging law, but the pressure is on to get the right definition and criteria for what constitutes “high-quality” recycling. [Edited by Frédéric Simon\/Alice Taylor] Read more with Euractiv The four years that revolutionised EU climate policy As the EU slowly shifts focus from the maelstrom of policymaking to the upcoming elections, it seems a good time to reflect on how much of the Green Deal has actually been achieved, write Kira Taylor. As the EU slowly shifts focus from the maelstrom of policymaking to the upcoming elections, it seems a good time to reflect on how much of the Green Deal has actually been achieved, write Kira Taylor.","filter_flag":1}
{"title":"New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit - Grist","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5","id":"CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5\" target=\"_blank\">New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grist<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit - Grist","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5\" target=\"_blank\">New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grist<\/font>","source.href":"https:\/\/grist.org","source.title":"Grist","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Plastic trash produced by the company PepsiCo has become a “persistent and dangerous form of plastic pollution” for residents of the Buffalo River watershed in upstate New York, according to a new lawsuit filed Wednesday. The suit, brought by New York Attorney General Letitia James, is one of the first legal challenges from a state against a major plastic producer. It draws on a 2022 investigation from James’ office in which PepsiCo-branded plastic packaging was found to be by far the most significant contributor to plastic waste clogging the Buffalo River and its tributaries. Out of nearly 2,000 pieces of plastic trash collected at 13 sites along the waterways, PepsiCo products — which include brands like Aquafina, Cheetos, Gatorade, and Lay’s — accounted for more than 17 percent of those with identifiable branding. All that plastic litter is breaking down into tiny fragments — microplastics — that are winding up in Buffalo’s water supply and the fish that people eat. Some of the chemicals contained in microplastics are carcinogenic, and researchers have raised concerns that the particles could cause reproductive dysfunction and other maladies. “PepsiCo’s irresponsible packaging and marketing endanger Buffalo’s water supply, environment, and public health,” James said in a statement. To support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How The New York lawsuit includes a “public nuisance” claim and requests that the state’s Supreme Court require PepsiCo to reduce the amount of plastic packaging entering the Buffalo River and remediate pollution that has already occurred. It also invokes consumer protection law: Although PepsiCo has “long been aware” of the environmental and human health risks posed by single-use plastic products, the AG’s office says PepsiCo has obscured these risks in communications to the public — in part by promoting plastics recycling and the promise of a so-called “circular economy,” in which plastic products can be endlessly reprocessed rather than eventually turned into waste. New York Attorney General Letitia James Spencer Platt \/ Getty Images One PepsiCo communication cited in the lawsuit says the company’s plastic recycling strategy will “keep the material in the circular economy.” Most plastics — including all of PepsiCo’s snack food wrappers — cannot be recycled, and even the company’s plastic soda bottles can only be turned into a new bottles a few times before they have to be junked. Nationally, only 5 percent of plastics are ever turned into new products. Meanwhile, PepsiCo has repeatedly missed or failed to make progress toward its own targets for plastic reduction and the use of recycled content. Most recently, the company reported an 11 percent increase in virgin plastic use between 2020 and 2022, despite a commitment to reduce virgin plastic by 20 percent by 2030. Between 2018 and 2022, it also reported a decrease in the fraction of its plastic packaging that was reusable, recyclable, or compostable. To support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How In response to Grist’s request for comment, PepsiCo said it is “serious about plastic reduction and effective recycling.” ”This is a complex issue and requires involvement from a variety of stakeholders, including businesses, municipalities, waste-reduction providers, community leaders, and consumers,” a spokesperson said via email. According to a national waste audit coordinated by the nonprofit Break Free From Plastic Pollution, PepsiCo has been among the top three companies creating the most pieces of plastic litter every year since 2018. Only the Coca-Cola Company has consistently produced more plastic litter. Environmental nonprofits have repeatedly sued PepsiCo and other companies over their use of plastic and claims about recyclability, but these suits have been less common at the state level. Last year, Connecticut’s attorney general filed a truth-in-advertising lawsuit against Reynolds Consumer Products, arguing that the company labeled its Hefty trash bags as recyclable “despite full knowledge that their bags were incompatible with recycling facilities in Connecticut.” Minnesota’s attorney general filed a similar lawsuit earlier this year, targeting both the Hefty manufacturer and Walmart. Volunteers pick up trash along the Buffalo River in upstate New York. Courtesy of Buffalo Niagara Waterkeeper Those suits, however, did not invoke public nuisance law — something that makes the PepsiCo case “new and very exciting,” according to Bethany Davis Noll, executive director of the State Energy and Environment Impact Center at the NYU School of Law. She could think of only one other ongoing public nuisance lawsuit related to plastic pollution, filed in 2020 by the nonprofit Earth Island Institute against companies including PepsiCo and Coca-Cola. Public nuisance has played a more prominent role in recent lawsuits filed by attorneys general against manufacturers of PFAS, or “forever chemicals,” which have tainted drinking water supplies worldwide. The New York lawsuit seeks to require PepsiCo to attach a warning label to any single-use plastic products sold in the Buffalo region, conveying plastics’ risks to public health and the environment. It also seeks civil penalties, restitution, and disgorgement of any profits it made through sales in the Buffalo region that were found to have been illegal under New York state’s consumer protection laws. Rachel Karasik, a senior policy associate at the Duke University Nicholas Institute for Energy, Environment, and Sustainability, said a successful case could spur PepsiCo to invest in reuse systems throughout the Buffalo area. In the absence of a New York state-wide extended producer responsibility law for plastic packaging — a policy that makes plastic producers financially responsible for the waste they produce — Karasik also said litigation could yield financing for plastic cleanup and collection activities. Noll hoped the New York attorney general’s case would inspire more legal challenges elsewhere. Plastic pollution is “prevalent all around the country,” she told Grist. “We’ve got to figure out a way to get companies to stop lying about how this stuff is recyclable.”","filter_flag":1}
{"title":"Expanded Polystyrene (EPS) Industry Advances Sustainability with $185M Investment in Recycled Content Resin ... - PR Web","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiowFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvZXhwYW5kZWQtcG9seXN0eXJlbmUtZXBzLWluZHVzdHJ5LWFkdmFuY2VzLXN1c3RhaW5hYmlsaXR5LXdpdGgtMTg1bS1pbnZlc3RtZW50LWluLXJlY3ljbGVkLWNvbnRlbnQtcmVzaW4tdGVjaG5vbG9naWVzLTMwMTk3ODEzNC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiowFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvZXhwYW5kZWQtcG9seXN0eXJlbmUtZXBzLWluZHVzdHJ5LWFkdmFuY2VzLXN1c3RhaW5hYmlsaXR5LXdpdGgtMTg1bS1pbnZlc3RtZW50LWluLXJlY3ljbGVkLWNvbnRlbnQtcmVzaW4tdGVjaG5vbG9naWVzLTMwMTk3ODEzNC5odG1s0gEA?oc=5","id":"CBMiowFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvZXhwYW5kZWQtcG9seXN0eXJlbmUtZXBzLWluZHVzdHJ5LWFkdmFuY2VzLXN1c3RhaW5hYmlsaXR5LXdpdGgtMTg1bS1pbnZlc3RtZW50LWluLXJlY3ljbGVkLWNvbnRlbnQtcmVzaW4tdGVjaG5vbG9naWVzLTMwMTk3ODEzNC5odG1s0gEA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiowFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvZXhwYW5kZWQtcG9seXN0eXJlbmUtZXBzLWluZHVzdHJ5LWFkdmFuY2VzLXN1c3RhaW5hYmlsaXR5LXdpdGgtMTg1bS1pbnZlc3RtZW50LWluLXJlY3ljbGVkLWNvbnRlbnQtcmVzaW4tdGVjaG5vbG9naWVzLTMwMTk3ODEzNC5odG1s0gEA?oc=5\" target=\"_blank\">Expanded Polystyrene (EPS) Industry Advances Sustainability with $185M Investment in Recycled Content Resin ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Web<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Expanded Polystyrene (EPS) Industry Advances Sustainability with $185M Investment in Recycled Content Resin ... - PR Web","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiowFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvZXhwYW5kZWQtcG9seXN0eXJlbmUtZXBzLWluZHVzdHJ5LWFkdmFuY2VzLXN1c3RhaW5hYmlsaXR5LXdpdGgtMTg1bS1pbnZlc3RtZW50LWluLXJlY3ljbGVkLWNvbnRlbnQtcmVzaW4tdGVjaG5vbG9naWVzLTMwMTk3ODEzNC5odG1s0gEA?oc=5\" target=\"_blank\">Expanded Polystyrene (EPS) Industry Advances Sustainability with $185M Investment in Recycled Content Resin ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Web<\/font>","source.href":"https:\/\/www.prweb.com","source.title":"PR Web","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This new product offering has the potential to be a game-changer for the EPS industry. Recycled content resin will further reduce EPS' environmental impacts with even lower energy use, and a smaller carbon footprint. Post this Recycled content EPS has been technically achievable for some time, but historically end users have not been motivated to use it. That trend is changing. With more stringent policy recommendations stemming from national governments, there is mounting pressure for the private sector to take a second look at recycled content capabilities. EPS resin producers are prepared to meet recycled content mandates and extended producer responsibility (EPR) legislation. This commitment to the development of sustainable solutions reinforces environmentally responsible EPS production, and positions them well to comply with future regulations. \"In response to the surging global demand for recycled content resins, we've witnessed remarkable technological innovations across various industries. Notably, the green building sector has embraced using recycled content resin for insulation, offering an eco-conscious solution without sacrificing quality. With a promising growth forecast, recycled content resins are making a substantial impact on sustainability worldwide,\" said David Wilson, Purchasing Manager at RAPAC. \"This new product offering has the potential to be a game-changer for the EPS industry\", said Betsy Bowers, Executive Director of the EPS Industry Alliance (EPS-IA), the North American trade association leading the expanded polystyrene (EPS) industry. \"Recycled content resin will further reduce EPS' environmental impacts with even lower energy use, and a smaller carbon footprint. Despite long standing misconceptions, EPS recycling has a strong track record that will now see even more growth.\" In March 2022 at the UN Environment Assembly, a historic resolution was adopted to develop an international legally binding treaty on plastic pollution, which could have a global impact on many of the day-to-day products used by consumers and manufacturers. The UN Environment Programme (UNEP)'s Intergovernmental Negotiating Committee (INC), which is developing the treaty, will hold its third session (INC-3) from November 13-19, 2023 at the UNEP Headquarters in Nairobi, Kenya. \"As we look towards INC-3, decision makers and NGOs should take notice of this excellent news and the EPS Industry's continued progress for increased sustainability\" added Bowers, who will attend the session. EPS-IA advocates for the responsible use of EPS, as well as research-backed solutions and policies that will positively benefit the environment and the economy. For more information about EPS-IA, visit http:\/\/www.epsindustry.org. ABOUT EPS-IA The EPS Industry Alliance (EPS-IA) is the North American trade association for the expanded polystyrene (EPS) industry. Our members – more than 70 small businesses located in 44 states – manufacture EPS foam insulation used in building and construction and EPS protective packaging for consumer goods including appliances, electronics, pharmaceuticals, furniture, and other products. EPS is a versatile, lightweight material — 98 percent air —that supports a diverse range of industries and significant sectors of our national economy. Media Contact James DeMarco, EPS Industry Alliance (EPS-IA), 9083281060, [email protected], www.epsindustry.org SOURCE EPS Industry Alliance (EPS-IA)","filter_flag":1}
{"title":"Five million bales wrapped with Trioworld's bale wrap with post-consumer recycled content - Mynewsdesk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS90cmlvd29ybGQvcHJlc3NyZWxlYXNlcy9maXZlLW1pbGxpb24tYmFsZXMtd3JhcHBlZC13aXRoLXRyaW93b3JsZHMtYmFsZS13cmFwLXdpdGgtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1jb250ZW50LTMyODYwMDTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS90cmlvd29ybGQvcHJlc3NyZWxlYXNlcy9maXZlLW1pbGxpb24tYmFsZXMtd3JhcHBlZC13aXRoLXRyaW93b3JsZHMtYmFsZS13cmFwLXdpdGgtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1jb250ZW50LTMyODYwMDTSAQA?oc=5","id":"CBMikwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS90cmlvd29ybGQvcHJlc3NyZWxlYXNlcy9maXZlLW1pbGxpb24tYmFsZXMtd3JhcHBlZC13aXRoLXRyaW93b3JsZHMtYmFsZS13cmFwLXdpdGgtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1jb250ZW50LTMyODYwMDTSAQA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS90cmlvd29ybGQvcHJlc3NyZWxlYXNlcy9maXZlLW1pbGxpb24tYmFsZXMtd3JhcHBlZC13aXRoLXRyaW93b3JsZHMtYmFsZS13cmFwLXdpdGgtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1jb250ZW50LTMyODYwMDTSAQA?oc=5\" target=\"_blank\">Five million bales wrapped with Trioworld's bale wrap with post-consumer recycled content<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mynewsdesk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Five million bales wrapped with Trioworld's bale wrap with post-consumer recycled content - Mynewsdesk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS90cmlvd29ybGQvcHJlc3NyZWxlYXNlcy9maXZlLW1pbGxpb24tYmFsZXMtd3JhcHBlZC13aXRoLXRyaW93b3JsZHMtYmFsZS13cmFwLXdpdGgtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1jb250ZW50LTMyODYwMDTSAQA?oc=5\" target=\"_blank\">Five million bales wrapped with Trioworld's bale wrap with post-consumer recycled content<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mynewsdesk<\/font>","source.href":"https:\/\/www.mynewsdesk.com","source.title":"Mynewsdesk","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Trioworld launched the first ever Post-Consumer Recyclates (PCR) based bale wrap in Agritechnica 2019, the world’s largest agricultural exhibition. With more than five million bales successfully wrapped in high-performance bale wrap made of recycled content since then, Trioworld now displays a full assortment of premium products for baled silage with recycled content at Agritechnica 2023. Bale wrap of the future “We believe that this is the bale wrap of the future”, says Anders Larsson, Product manager Agricultural stretch films at Trioworld. “The performance is just as we want it. Silage quality and wrapping performance have proven to be on equal level as with our premium products without PCR. The fact that five million bales have been successfully wrapped with our bale wrap containing recycled material is just additional proof that it really does work”, he continues. What started with the 25 µm bale wrap film has in the last years grown to a full assortment of PCR based products. The Trioworld PCR bale wrap assortment is based on post-consumer recycled material and certified by RecyClass** and has been used and evaluated by farmers and contractors all around the world. Many years of research and development together with field tests have made it possible for Trioworld to be the first producer to offer options with recycled content for all their premium products for baled silage. What makes this so unique is, that this also includes the more efficient high-tech products with reduced thicknesses of 21 or 19 µm as well as net replacement films. Closing the loop in bale wrap What makes Trioworld’s recycled bale wrap extra exceptional is that it is produced from used bale wrap that is collected and recycled into new high-performance PCR film. Trioworld operates three recycling plants in Europe and produces high-performance regranulates from the collected, used bale wrap in their own process, which ensures stable quality and performance. It is a rare and high-tech process to recycle used products into the same level of performance in new products. This solution to recycle used bale wrap into new bale wrap does not only encourage the collection after use but also enables a true circularity which decreases the climate impact significantly. Depending on the product it is now possible to reduce the carbon footprint by up to 43%*** when switching to an alternative with less material usage and post-consumer recycled content. “We are very happy that customers have understood the value of this new way of making silage more sustainable and are looking forward to achieving the goal of having 30% PCR in all our products by 2025”, states Anders Larsson. For more information, please contact: Anders Larsson, Product manager Agricultural Stretch films at Trioworld, +46-703 994650 *Post-Consumer Recyclates, i.e., plastic that has been used for its intended purpose **RecyClass - Recycled plastics traceability certification (www.recyclass.eu) ***LCA modeled 2023 in SimaPro, using data from the ecoinvent inventory database. Reduction in climate impact when comparing 19μm Loop bale wrap to 25μm virgin bale wrap","filter_flag":1}
{"title":"PharmaCos, Stoelzle Pharma's new packaging line for wellbeing products - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9waGFybWFjb3Mtc3RvZWx6bGUtcGhhcm1hLXMtbmV3LDIyODU00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9waGFybWFjb3Mtc3RvZWx6bGUtcGhhcm1hLXMtbmV3LDIyODU00gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9waGFybWFjb3Mtc3RvZWx6bGUtcGhhcm1hLXMtbmV3LDIyODU00gEA","guidislink":false,"published":"Fri, 03 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=307, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9waGFybWFjb3Mtc3RvZWx6bGUtcGhhcm1hLXMtbmV3LDIyODU00gEA?oc=5\" target=\"_blank\">PharmaCos, Stoelzle Pharma's new packaging line for wellbeing products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PharmaCos, Stoelzle Pharma's new packaging line for wellbeing products - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9waGFybWFjb3Mtc3RvZWx6bGUtcGhhcm1hLXMtbmV3LDIyODU00gEA?oc=5\" target=\"_blank\">PharmaCos, Stoelzle Pharma's new packaging line for wellbeing products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Unveiled at the CPHI show, held in Barcelona from October 24 to 27, 2023, the PharmaCos line boasts a diverse range of glass jars, available in sizes ranging from 5 ml to 500 ml, all in amber with a screw neck design, as well as flat-shoulder bottles in capacities ranging from 20 ml to 150 ml, offered in both amber and flint glass. These bottles are equipped with neck finishes of 22\/400 GPI and 24\/410 GPI to meet all specific needs. Recycled and lightweight The new line of standard packaging solutions features high recycled glass contents (73% recycled content in amber glass and 38% in flint glass), coupled with the lightweight design of the bottles. “The PharmaCos range is a sustainable choice for healthcare products,” said Stoelzle Pharma in a statement. Also, to meet the requirements of the health sector, the new line is manufactured \"in a pharmaceutical-grade environment, adhering to the rigorous standards set by the pharmaceutical industry.” A complete glass packaging solution For added convenience, Stoelzle Pharma offers a wide array of caps and closures for the PharmaCos flat-shoulder bottles and cosmetic jars. The selection includes caps, cream or spray pumps, snap caps, flip tops, and pipettes. The caps are available in various materials, including vegan options, wood, and child-resistant closures. Stoelzle Pharma’s comprehensive one-stop-shop concept also includes decoration. Stoelzle provides over 20 different in-house decoration techniques, including screen printing, spraying, acid etching, and environmentally conscious options like eco-friendly ink developed from recycled rubber waste.","filter_flag":1}
{"title":"Plega seating by Derlot among 12 new products on Dezeen Showroom - Dezeen","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8xMS8xMy9wbGVnYS1zZWF0aW5nLWRlcmxvdC1wcm9kdWN0cy1mdXJuaXR1cmUtbGlnaHRpbmctZGV6ZWVuLXNob3dyb29tL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8xMS8xMy9wbGVnYS1zZWF0aW5nLWRlcmxvdC1wcm9kdWN0cy1mdXJuaXR1cmUtbGlnaHRpbmctZGV6ZWVuLXNob3dyb29tL9IBAA?oc=5","id":"CBMiY2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8xMS8xMy9wbGVnYS1zZWF0aW5nLWRlcmxvdC1wcm9kdWN0cy1mdXJuaXR1cmUtbGlnaHRpbmctZGV6ZWVuLXNob3dyb29tL9IBAA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8xMS8xMy9wbGVnYS1zZWF0aW5nLWRlcmxvdC1wcm9kdWN0cy1mdXJuaXR1cmUtbGlnaHRpbmctZGV6ZWVuLXNob3dyb29tL9IBAA?oc=5\" target=\"_blank\">Plega seating by Derlot among 12 new products on Dezeen Showroom<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dezeen<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plega seating by Derlot among 12 new products on Dezeen Showroom - Dezeen","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8xMS8xMy9wbGVnYS1zZWF0aW5nLWRlcmxvdC1wcm9kdWN0cy1mdXJuaXR1cmUtbGlnaHRpbmctZGV6ZWVuLXNob3dyb29tL9IBAA?oc=5\" target=\"_blank\">Plega seating by Derlot among 12 new products on Dezeen Showroom<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dezeen<\/font>","source.href":"https:\/\/www.dezeen.com","source.title":"Dezeen","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Dezeen Showroom: a collection of stools and benches that act as both seating and acoustic solutions is among 12 new products featured on Dezeen Showroom. Plega seating collection by Alexander Lotersztain for Derlot Australian design brand Derlot has created a selection of seats designed to be moved around both workplace and education spaces to facilitate quiet discussion. The seats are comprised of folding flat-pack panels made from compressed polyester felt that contains 60 per cent recycled content, according to Derlot. Plega was recently featured on Dezeen Showroom alongside a slimline table lamp with a swivelling spherical head and a collection of office chairs upholstered in contrasting materials. Read on to see more of the latest products: Madco table lamp by Elisa Ossino for Ambientec Japanese lighting brand Ambientec worked with Italian designer Elisa Ossino on a table lamp characterised by its slim, four-legged frame and rotatable head. The Madco table lamp – which comes in five colours – has a rechargeable bulb and a waterproof design, meaning it can be used indoors or outdoors. Find out more about Madco › Freedom x Kvadrat collection by Humanscale Workplace furniture company Humanscale has created a run of its Freedom chairs that are upholstered in textiles by brand Kvadrat. Chairs in the Freedom x Kvadrat collection maintain their ergonomic functionality but come in a selection of materials including Elle, a tactile fleecy material by Sahco Upholstery, as pictured. Find out more about Freedom x Kvadrat collection › The Phone Booth acoustic pod by Room Workplace furniture brand Room has created a single-person, acoustically sound booth that combines a range of sound-controlling materials and accessories that increase productivity and comfort. The Phone Booth comes in dark and light colourways that share oak timber accents, both of which are wrapped in layers of MDF, PET felt and wool that work together to reduce noise inside the pod. Find out more about The Phone Booth › Noho Move chair by Formway for Noho New Zealand-based furniture brand Noho collaborated with design studio Formway on a dining chair that has the ergonomic integrity of an office task chair. The Noho Move chair has an intuitive tilting mechanism that accommodates fidgeting and stretching, allowing seated users to work and socialise for extended periods, unlike conventional rigid dining chairs. Find out more about Noho Move › Oscillation rug by David Mrugala for Azmas Rugs Indian brand Azmas Rugs has created a rug that is decorated with evolving colour and shape gradient patterns. The brand's Oscillation rug comes in a selection of colourways and is hand-woven in flatweave style by artisans in Rajasthan, India. Find out more about Oscillation › Full Spectrum collection by Carnegie Fabrics American brand Carnegie Fabrics has released a number of new colours that can be applied to a selection of its existing fabrics. The Full Spectrum collection encompasses a variety of new finishes, including single block colour Precision, Herringbone-patterned Ion and Nebula, a pattern made up of strings of individual dots. Find out more about the Full Spectrum collection › Solid+ tiles by Undefasa Spanish tile company Undefasa has designed a collection of tiles that have a natural-looking texture running through them that allows their appearance to withstand scuffs and scratches. Solid+ tiles have crystalline inclusions that further their organic appearance, and come in two styles divided into eight colours. Find out more about Solid+ › EchoPanel acoustic panels by Woven Image Australian company Woven Image have increased its EchoPanel offering by adding five new colourways. The five new hues are named Dusk, Mint, Butter, Cayenne and Nutmeg and can be found throughout the existing collection of EchoPanels with both rounded and striped CNC-cut patterns. Find out more about EchoPanel › Valencia modular seating by Morgan British furniture brand Morgan has released a modular sofa that has tapered backrests reminiscent of rolling hills. Valencia modular seating comes in a selection of upholstery options and is supported by splayed timber legs. Find out more about Valencia › Elements Hush Blocks by 3form American material company 3form has increased its wall-mounted acoustic panel offering by releasing Hush Blocks. The blocks come in four thicknesses and can be mounted in various arrangements to create tactile three-dimensional effects. Find out more about Elements Hush Blocks › Oloïd acoustic lighting by Atelier Oï for Impact Acoustic Swiss design studio Atelier Oï collaborated with acoustic product brand Impact Acoustic on a sculptural lighting fixture that also has sound-dampening qualities. Oloïd acoustic lighting comes in 32 colours and has a complex, pleated appearance reminiscent of lanterns. Find out more about Oloïd › Dezeen Showroom Dezeen Showroom offers an affordable space for brands to launch new products and showcase their designers and projects to Dezeen's huge global audience. For more details email [email protected]. Dezeen Showroom is an example of partnership content on Dezeen. Find out more about partnership content here.","filter_flag":1}
