{"title":"New products, markets add value for Texas timber - Texas Farm Bureau","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdGV4YXNmYXJtYnVyZWF1Lm9yZy9uZXctcHJvZHVjdHMtbWFya2V0cy1hZGQtdmFsdWUtZm9yLXRleGFzLXRpbWJlci_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdGV4YXNmYXJtYnVyZWF1Lm9yZy9uZXctcHJvZHVjdHMtbWFya2V0cy1hZGQtdmFsdWUtZm9yLXRleGFzLXRpbWJlci_SAQA?oc=5","id":"CBMiTGh0dHBzOi8vdGV4YXNmYXJtYnVyZWF1Lm9yZy9uZXctcHJvZHVjdHMtbWFya2V0cy1hZGQtdmFsdWUtZm9yLXRleGFzLXRpbWJlci_SAQA","guidislink":false,"published":"Sun, 27 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=239, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdGV4YXNmYXJtYnVyZWF1Lm9yZy9uZXctcHJvZHVjdHMtbWFya2V0cy1hZGQtdmFsdWUtZm9yLXRleGFzLXRpbWJlci_SAQA?oc=5\" target=\"_blank\">New products, markets add value for Texas timber<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Texas Farm Bureau<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New products, markets add value for Texas timber - Texas Farm Bureau","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdGV4YXNmYXJtYnVyZWF1Lm9yZy9uZXctcHJvZHVjdHMtbWFya2V0cy1hZGQtdmFsdWUtZm9yLXRleGFzLXRpbWJlci_SAQA?oc=5\" target=\"_blank\">New products, markets add value for Texas timber<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Texas Farm Bureau<\/font>","source.href":"https:\/\/texasfarmbureau.org","source.title":"Texas Farm Bureau","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"By Shelby Shank Field Editor The Texas timber sector has experienced fluctuations of supply and demand and other market forces, but new products and opportunities are enhancing the value to trees, according to Texas A&M Forest Service. In East Texas, where much of the traditional timber industry is located across 43 counties, timber tracts cover about 11.5 million acres of the area’s nearly 22 million acres. The impact of fiber grown, managed, harvested, processed and manufactured throughout the state is substantial, contributing about $41 billion to the state’s economy. It also supports over 172,000 jobs each year, according to Dr. Eric Taylor, Texas A&M Forest Service silviculturist. Harvested timber’s value consistently ranks seventh among Texas’ agricultural commodities. Texas timber is turned into a range of products like two-by-fours and plywood for home construction, as well as cardboard boxes, furniture and mass timber for large structures. In 2022, Texas sawmills produced over 1.5 billion board feet of lumber. “The Texas timber industry has softened in some ways and strengthened in others,” Taylor said. “Some things changed, and some things will likely never change. Timber is still heavily tied to lumber and housing starts, but other products are different. A large pine tree might be worth only $70 to a landowner on the stump, while a live-edge slab from a hardwood tree from Central Texas could be worth thousands of dollars.” Despite relatively high prices seen in retail stores, the traditional timber market, including pulpwood and lumber, remains relatively soft for landowners, Taylor noted. The industry’s efficiency in harvesting and replanting timber tracts fills the demand for pulpwood when acres are thinned once or twice around 15 years old to make way for lumber-bound pines to reach maturity at around year 28. Taylor advocates for strategic forest management practices, including lower initial planting densities to ensure healthier tree growth and forest longevity. Prospects for traditional timber products are positive because of Texas’ relatively strong housing market. Housing starts are improving, with an estimated influx of about 1,300 new residents into the state each day. Additionally, lumber exports, particularly to Mexico, remain strong, Taylor said. Traditional products like printing and copy paper are no longer made in Texas, but Taylor said there is a stronger demand for other products like paperboard and cardboard for shipping boxes. Nearly 2.5 million tons of paper-based container board were manufactured in Texas last year. “When you buy something from Amazon, those items come in a box, and that box is made out of paperboard,” Taylor said. “Oftentimes, even little items come in big boxes. That’s part of the industry that Texas timber has captured.” New products are also reshaping the timber industry. Cross-laminated mass timbers offer super-strong constructed support beams that are used by architects and engineers in high-rise buildings and commercial structures because of the environmental benefits over other building materials. Carbon sequestration is an additional benefit for timber landowners, as forests capture carbon from the atmosphere, providing carbon credits for companies aiming to offset emissions. The value of timber is changing how it is managed, but growth in population is changing how timber will be grown. Taylor noted almost 5.1 million East Texans own over 50 acres or less, while land parcellation is shrinking the average size of working forests. Texas A&M Forest Service is working with landowners in smaller tracts to overcome “economy of scale” limitations and combine smaller tracts into a larger tract that is managed in unison. “We are working to educate landowners about their options and help them navigate the changes within the industry. A lot of these changes add value, landowners just need to know their options,” Taylor said.","filter_flag":1}
{"title":"The ultimate surf + turf: Innovative commercial baking process-meets-climate smart seaweed gains patent - BakeryAndSnacks.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5iYWtlcnlhbmRzbmFja3MuY29tL0FydGljbGUvMjAyMy8wOC8xMC9UaGUtdWx0aW1hdGUtc3VyZi10dXJmLUlubm92YXRpdmUtY29tbWVyY2lhbC1iYWtpbmctcHJvY2Vzcy1tZWV0cy1jbGltYXRlLXNtYXJ0LXNlYXdlZWQtZ2FpbnMtcGF0ZW500gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5iYWtlcnlhbmRzbmFja3MuY29tL0FydGljbGUvMjAyMy8wOC8xMC9UaGUtdWx0aW1hdGUtc3VyZi10dXJmLUlubm92YXRpdmUtY29tbWVyY2lhbC1iYWtpbmctcHJvY2Vzcy1tZWV0cy1jbGltYXRlLXNtYXJ0LXNlYXdlZWQtZ2FpbnMtcGF0ZW500gEA?oc=5","id":"CBMilwFodHRwczovL3d3dy5iYWtlcnlhbmRzbmFja3MuY29tL0FydGljbGUvMjAyMy8wOC8xMC9UaGUtdWx0aW1hdGUtc3VyZi10dXJmLUlubm92YXRpdmUtY29tbWVyY2lhbC1iYWtpbmctcHJvY2Vzcy1tZWV0cy1jbGltYXRlLXNtYXJ0LXNlYXdlZWQtZ2FpbnMtcGF0ZW500gEA","guidislink":false,"published":"Thu, 10 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=222, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5iYWtlcnlhbmRzbmFja3MuY29tL0FydGljbGUvMjAyMy8wOC8xMC9UaGUtdWx0aW1hdGUtc3VyZi10dXJmLUlubm92YXRpdmUtY29tbWVyY2lhbC1iYWtpbmctcHJvY2Vzcy1tZWV0cy1jbGltYXRlLXNtYXJ0LXNlYXdlZWQtZ2FpbnMtcGF0ZW500gEA?oc=5\" target=\"_blank\">The ultimate surf + turf: Innovative commercial baking process-meets-climate smart seaweed gains patent<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BakeryAndSnacks.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The ultimate surf + turf: Innovative commercial baking process-meets-climate smart seaweed gains patent - BakeryAndSnacks.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5iYWtlcnlhbmRzbmFja3MuY29tL0FydGljbGUvMjAyMy8wOC8xMC9UaGUtdWx0aW1hdGUtc3VyZi10dXJmLUlubm92YXRpdmUtY29tbWVyY2lhbC1iYWtpbmctcHJvY2Vzcy1tZWV0cy1jbGltYXRlLXNtYXJ0LXNlYXdlZWQtZ2FpbnMtcGF0ZW500gEA?oc=5\" target=\"_blank\">The ultimate surf + turf: Innovative commercial baking process-meets-climate smart seaweed gains patent<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BakeryAndSnacks.com<\/font>","source.href":"https:\/\/www.bakeryandsnacks.com","source.title":"BakeryAndSnacks.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The executives behind food strategy consultancy Changing Tastes - husband and wife team Arlin and Penelope Wassermann - launched Sea & Flour and the concept of a breakthrough line of baked goods at the UN Ocean Conference held in Portugal last year. Pic: GettyImages Laverbread is a food product (bara lawr)​ made from an edible seaweed that grows along the Welsh coastline. It has a unique texture and salty flavour, traditionally eaten fried with bacon and cockles as part of a Welsh breakfast, made into a soup or sauce, or added to artisanal oatcakes, shortbread and cheese. It is also found on east coast of Ireland, where it is also known as sleabhac ​or slake.​ Wild dulse has long been a dietary staple of people in Ireland, Scotland and Wales. It is a smoky, salty, bacon-like flavoured seaweed that will add a healthy kick to any daily meal or smoothie; crisped up in the oven to add to roasted veg; chopped raw for a vibrant crunchy addition to salad; or dried and sprinkled over popcorn. Pic: Momoshares The umami bread from Momoshares is a butter-rich dough studded with roasted seaweed, Japanese-style mayo, pork floss and scallions. After even more intensive R&D, the bakery manufacturer will be rolling out a line of bread, buns, rolls and pizza dough into US retail in the second half of 2023. Sea & Flour’s line of commercial bread products features a blend of clean label seaweed as its primary ingredient: meaning the products don't only boast a higher protein and lower sodium than many standard bread loaves but are also carb-positive (lower calories) and carbon-negative that will help address climate change and expand regenerative coastal agriculture and the blue economy. While the concept is not new - recipes abound on the net for bakes like laverbread sourdough, dulse bread and umami bread - the Philadelphia-based company is the first to integrate seaweed into commercial bakery. It has also earned a patent for its state-of-the-art tech to successfully incorporate seaweed into this intensive process. US Patent No. 11,717,010) pertains to the process of cold washing, processing and granulating seaweed for use in breads and other related products. The process ensures the seaweed can be successfully incorporated into high-volume baking, while delivering the flavour and nutritional benefits of the sea. “We developed a novel way to process seaweeds so they can be combined with common grains and flours in the commercial baking process.​ “Being awarded this patent is recognition of the uniqueness of our approach and the methods we developed and perfected over several years,”​ said Arlin Wasserman, CEO of The Sea & Flour Baking Company. “We’re making seaweed perform successfully as a key ingredient in food manufacturing including in everyday products like breads, rolls and pizza crusts, and we’re excited to see this nutritious and sustainable ingredient play a larger role in our diets.”​ Added Penelope Wasserman, president, “We’ve learned from extensive market research that a significant share of American consumers now want to find ways to eat seaweed more often.”​ Consumer research conducted by Changing Tastes in January 2022 found that 32% of Americans have tried seaweed, with 18% wanting to eat more of it and 25% of those who had never tried it wanting to do so. With 600 million slices of bread being devoured each day by Americans, incorporating the superfood into this versatile staple was an obvious move. Pic: GettyImages There are 20,000 species of seaweed, all of which are edible, though some are more palatable than others. Among the most popular sea vegetables are nori, wakame, kombu, dulse, arame, umibudo (seaweed grapes), dulse, kelp, carragheen, laver and sea lettuce. “Your typical bread products may taste delicious, but they often lack nutritional value,” ​said Penelope Wasserman, who is also a member of the Bone Health & Osteoporosis Foundation’s Ambassadors Leadership Council. “Osteoporosis and hypertension are two of the most common chronic diseases plaguing Americans today. Sea vegetables help keep our bones strong and are a rich source of vitamin K and calcium, which help prevent bone loss. Sea & Flour products help consumers get more out of what they’re already eating, adding rich health benefits while also being better for the Earth.”​ Why put seaweed in bread? Pic: GettyImages It’s good for people Seaweed is rich in protein and essential vitamins and minerals: actually, it’s the best bioavailable source of most nutrients and specifically high in vitamin A and K, as well as a good source of iron, calcium, folate, magnesium and zinc. It can be used to replace sodium content in foods (healthy heart); is the best dietary source of iodine (support the thyroid gland); and packs in antioxidants (protects against cell damage), and fibre (preventing many chronic diseases). It’s good for the planet Farming seaweed is a carbon-negative process: decreasing carbon and nitrogen while increasing oxygen levels. According to Sea & Flour, it is instrumental in encouraging ‘species of marine life back to areas that haven’t been seen in decades. ‘Conventional baking with sea plants will help expand regenerative farming in coastal communities, creating new livelihoods for people who are struggling because fish have left due to climate change.’ It’s good for society The company contends that by eating Sea & Flour bread, consumers will have a hand in reversing the effects of global warming. ‘Today, our children don’t believe their future is sustainable because of the fearful messages they get without any realistic options for change. Making foods they already eat and like part of the solution brings about positive impact and changes the collective consciousness to one that’s hopeful instead of hopeless giving a new meaning to our daily bread.’ “Our goal is to help food manufacturers and retailers make products that consumers already love do more for them in terms of nutritional value while also doing more for the planet,” ​added Arlin Wasserman.","filter_flag":1}
{"title":"Healy is just one of the newer, weirder multi-level marketing schemes - OnlySky Media","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vb25seXNreS5tZWRpYS9jY2Fzc2lkeS90aGUtaGVhbHktd2VhcmFibGUtanVzdC1hLW5ld2VyLXdlaXJkZXItbXVsdGktbGV2ZWwtbWFya2V0aW5nLXNjaGVtZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vb25seXNreS5tZWRpYS9jY2Fzc2lkeS90aGUtaGVhbHktd2VhcmFibGUtanVzdC1hLW5ld2VyLXdlaXJkZXItbXVsdGktbGV2ZWwtbWFya2V0aW5nLXNjaGVtZS_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vb25seXNreS5tZWRpYS9jY2Fzc2lkeS90aGUtaGVhbHktd2VhcmFibGUtanVzdC1hLW5ld2VyLXdlaXJkZXItbXVsdGktbGV2ZWwtbWFya2V0aW5nLXNjaGVtZS_SAQA","guidislink":false,"published":"Sun, 13 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=225, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vb25seXNreS5tZWRpYS9jY2Fzc2lkeS90aGUtaGVhbHktd2VhcmFibGUtanVzdC1hLW5ld2VyLXdlaXJkZXItbXVsdGktbGV2ZWwtbWFya2V0aW5nLXNjaGVtZS_SAQA?oc=5\" target=\"_blank\">Healy is just one of the newer, weirder multi-level marketing schemes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">OnlySky Media<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Healy is just one of the newer, weirder multi-level marketing schemes - OnlySky Media","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vb25seXNreS5tZWRpYS9jY2Fzc2lkeS90aGUtaGVhbHktd2VhcmFibGUtanVzdC1hLW5ld2VyLXdlaXJkZXItbXVsdGktbGV2ZWwtbWFya2V0aW5nLXNjaGVtZS_SAQA?oc=5\" target=\"_blank\">Healy is just one of the newer, weirder multi-level marketing schemes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">OnlySky Media<\/font>","source.href":"https:\/\/onlysky.media","source.title":"OnlySky Media","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Overview: Healy World only entered the multi-level marketing world a few years ago. But it's been blitzing social media in the past few months to try to gain new distributors. In the past, these schemes usually pushed nonessential consumer goods like makeup, supplements, and the like. Now, Healy World is hoping to attract new distributors to sell its $500-and-up device and programs. Unfortunately, this is one product that's flawed from its very core. Reading Time: 9 minutes In ye olden daies, multi-level marketing schemes (MLMs) tended to focus on the same generally-nonessential consumer goods: Supplements, cosmetics, kitchen toys, weight-loss snake oil, etc. After a while, new products entered the fold: Pearls—dyed and embedded in oysters, stretchy clothes that covered a multitude of sins, international travel, legal services, insurance, and the like. But now, the next generation of MLM products seek the attention and money of people who don’t understand just how predatory these schemes truly are. And Healy, one of the newer products entering the MLM fold, might be the weirdest one yet. Related MLM posts: MLM coaches scavenge a declining industry; Claims of MLM success amid the pandemic are slightly exaggerated; Toxic optimism in MLMs; Yes, MLMs are a cult.) Healy: A woo gadget for the modern age The “Healy” is a wearable device that claims to send vibes of various natures to its wearer. A basic Healy unit resembles an alarm tag, similar to retail theft-prevention tags. Healy World also sells a smartwatch, and the MagHealy, which looks a bit like a fire alarm. With a smartphone, users can easily customize these products’ functions. That is, quite literally, its only FDA-approved function. Otherwise, it does nothing discernible. For the USD$2,000+ it costs, by contrast, the MagHealy apparently just sends out magnetic waves. If connected properly to a user’s body, a Healy can act as a TENS (transcutaneous electrical nerve stimulator) unit. TENS units utilize microcurrents to hopefully bring temporary pain relief to users. According to the “Science” section on their website, however, the Healy’s electrical stimulations and “frequencies” actually make users’ cells change behavior: As we just mentioned, the transport of matter into and out of the cell functions by a kind of magnetically controlled valve mechanism. The voltage potential, i.e., the difference between the voltage inside the cell and the voltage between the cells, is responsible for healthy (physiological) cell metabolism. In principle, this mechanism explains why frequencies can be applied for many different purposes. “The Scientific Basis of Frequency Application,” Healy World (archive) According to its fans and salespeople, wearing a Healy can cure everything from autism to chronic pain to depression to infertility to basic cuts and scrapes. However, the FDA has approved use only as a TENS unit. The FDA’s premarket notification repeats the same limitation in its “Regulation Number” field. In fact, they specifically cautioned Healy World about making claims beyond that. In response, Healy World has decided that the FDA isn’t its real dad: Notice: Healy is a microcurrent medical device that has been cleared by the U.S. Food and Drug Administration only for local relief of acute, chronic, and arthritis pain and muscle soreness due to overexertion. Healy also has non-medical applications that use Individualized Microcurrent Frequencies (IMF) to harmonize your Bioenergetic Field. Always use your Healy in accordance with its Instructions for Use. “Manage Your Pain with Healy,” Healy Shop (archive) Needless to say, not a single bit of evidence supports even the existence of a “Bioenergetic Field.” There is a legitimate biological field regarding bioenergetic systems, but it’s not the same thing. The science behind Healy, such as it is Healy World is based out of Germany. Though they cite two scientists as the inspiration for the device, the company’s two owners\/developers very obviously have little-to-no legitimate medical training or experience. One of its main developers, Nuno Nina, runs woo clinics around the world. He claims to have developed a “unique, ideal” healing water. Using his excellent knowledge in engineering and biochemistry, Nuno Nina has been able to develop water with unique, ideal properties: high negative ORP (oxidation-reduction potential) * rH2 lower than 10 * active hydrogen * neutral pH * biominerals “About Nuno,” Nuno Nina Akademy (archive) Nina also claims to have created “144,000 ‘Gold Frequencies.'” The founder of Healy, Marcus Schmieke, appears to have no medical background whatsoever. That said, he’s written a truly impressive number of New Age woo books. Healy World bases a lot of their ideas on the work of Björn Nordenström, a Swedish radiologist. Decades ago, he announced the existence of “a new, electrically-controlled circulatory system in the body.” By passing electrical current through this system, he claimed to have cured cancer. Unfortunately, Nordenström actively avoiding providing support for this claim. Healy World also draws upon the work of Robert Becker, an orthopedic surgeon. Around the same time as Nordenström’s announcements in the mid-1980s, Becker published a much-criticized book called The Body Electric. It described various electrical experiments he’d conducted over the years, then swept into a theoretical framework for future study: We encounter some strange creatures, such as dogs in which implanted battery packs stimulate bone growth and salamanders in which cancer was induced on their tails and allowed to spread to other locations but which recovered entirely from all the cancer when the tails were amputated through the original tumors. [. . .] But when he raises electromagnetism to the foundation of life his book becomes largely theoretical and ends with a proposal for a new vitalism – in which electromagnetism is seen as the force that binds us and differentiates us from the inanimate universe. Review, The New York Times, April 21, 1985 (archive) Vitalism, of course, is another field of solid woo. Among other things, this expansive theory predicts that only living organisms can produce organic molecules, as well as claiming that humans produce an energy field. It’s been debunked for years. Friedrich Wöhler disproved it in 1828 by producing urea without any vitalistic life forces involved at all. Not to be deterred, its modern-day believers use it in a wide range of pseudoscientific therapies of dubious value, like the equally debunked healing touch. This Healy stuff sure does rest on a solid foundation! It’s just not the foundation that Healy World wants it to be. Even Quackwatch has a lengthy critical article up about it. The sheer audacity of this price list Healy World seems to have entered the MLM world right around the beginning of the pandemic. In the past couple of months, though, the company’s distributors have been blitzing Instagram with marketing. One Healy distributor promises the moon, and she promises it constantly. At one point, she convinced the mother of a severely autistic boy that she could communicate with him through this thing: This same distributor listed packages and contents, but strangely no prices at all: She even tried to show how gosh-darned versatile the Healy is by attaching it to a jug of water: If you’re remembering Nina’s own forays into woo water, then good. That’s probably where she got the idea. Her omission of prices isn’t unusual, either. Few of these distributors seem to talk much about prices. And I can see why. According to one site’s price list, oh boy are Healy products expensive. At a bare minimum, buyers can expect to shell out about USD$500 for just a basic Healy unit. That cost can soar upward into $3,000 and $5,000 very quickly with add-ons and optional programs. That said, interested parties will be happy to know that Healy add-on kits for their pets are quite reasonably priced at around $60, not counting connectors, travel cases, etc. (Please don’t use a TENS unit on pets.) This marketing has a deeper purpose than just sales If someone sees the endless deluge of bright-eyed woo posts about Healy and wants to order a package, something interesting happens upon checkout: Customers must have a “referral link” from someone who sells Healy products. Clicking that link at the end of the boxed statement leads customers to an information-gathering form. At the bottom of it, customers must check a box to share their information “with a local Healy World Member.” These aren’t just members of the Healy World fan club, like the one operated by the Beanie Baby company or Neopets. They are distributors for the MLM that Healy World operates. When I looked up how one could become a Healy World Member, I got led straight to one Healy World distributor’s sign-up website. There, the distributor explained that “member” really means “distributor”: Why Become A Healy Distributor? As a Healy World member, you can rely on a variety of support models to build your business community “JOIN OUR INTERNATIONAL HEALY DISTRIBUTOR TEAM!”, WearableFrequencyDevices.com (archive) So normies can’t simply buy Healy products on their own. They must either use a distributor’s referral code or sign up to be distributors themselves. And like all MLMs, Healy World’s compensation plan is absolutely byzantine. Why they’re called multi-level marketing The entire term multi-level marketing derives from the fact that distributors in these schemes draw income from a number of sources. First and foremost, they usually profit from their own sales activity in the form of commissions. More importantly in most MLMs, distributors get a commission percentage of all the sales of the people they sign up to work under themselves (their downline), and all the sales of the people who those people sign up under their own selves, and so on. By the same token, whoever signed the distributor up to the program (their upline) gets a commission from everything the distributor and their downline buy. That second bit is where most MLM distributors focus. They tend to make a lot more money on commissions from downline sales than they do on anything they sell by themselves. So they tend to want to “build a team” as quickly as they can. In addition to upline and downline commissions, most MLM companies provide bonuses of various kinds to especially prolific sellers and teambuilders. Healy, for example, apparently sponsored a quick trip to Bali as an incentive earlier this year. I’m sure it was fun; MLM incentive trips tend to be really nice. Many MLMs also famously offer high-producing distributors a subsidized lease on a luxury car, which the distributors like to call free cars. It’s not free, however. If distributors fail to hit sales targets that month, they get to pay for the (luxury) car lease themselves that month. How to make money with Healy, sorta Like all MLMs, Healy World demands that each distributor make a certain amount of sales on their own. However, these sales don’t simply qualify the distributor to receive a commission. The amount of a distributor’s sales determines their overall level of commission. And Healy World expects a lot of personal sales. The distributor receives a 30% bonus on sales, paid out weekly. To get an extra 10% commission, the distributor must sell 5000 “DPV,” or “Device Personal Volume,” by month’s end. This usually roughly correlates to USD, but not always. Here, it seems to be about twice its cost in Euros. So 2100€ in sales translates to 5250 DPV. (Their diagram confusingly refers to DPV as BV, or “bonus volume.” I’m sure that’s no accident. I’m decent at reading these compensation plans by now, and this one is just dizzyingly complicated.) In addition, all those program subscriptions for the Healy device generate a commission as well. If they can generate 1000 Customer Subscription Volume (CSV) per month, they’ll earn 15% of that as a bonus. Obviously, an MLM focuses hard on “growing your team,” as Healy World puts it on page 10 of their compensation statement. They pay distributors for enrolling people into their downline. The more people on the team, and the more downline team members sign up underneath them, the more money the distributor makes. Eventually, large upline owners get money from giving speeches and teaching sales to their downline. The compensation plan spends most of its pages talking about the benefits to prolific teambuilders. On p. 21, we see some truly exorbitant bonuses paid out to their top ranks. But if a Healy seller doesn’t sell anything that month on their own, then they don’t get counted as “Active.” If they’re not active that month, bonuses roll over them, or “compress,” to the next upline above them who is Active. For someone with a huge social-media footprint and tons of followers who have way more money than they have critical thinking skills, the Healy might make them some good money. From what I’m seeing in the Healyverse, everyone else trying to make money out of this scheme is having a very tough time making sales. That assessment very much appears to include the lady I mentioned earlier—you know, the one scamming the desperate mother of that autistic kid. Her sales tactics smack of pure desperation to me. If it were selling well, she’d never need to stoop to such a level. The appeal of these new MLM devices like Healy There are other pseudoscientific medical devices entering the MLM world besides the Healy. One is the LifeWave X39 patch. According to a stem cell biologist’s review of it earlier this year, it makes some truly stunning claims for a patch lacking any drugs or therapeutic mechanisms: Activate your stem cells! Patented phototherapy is designed to elevate a peptide known to enhance stem cell activity Supports relief of minor aches and pains. More energy and better sleep – must be experienced to be believed Supports natural wound healing process Maintains healthy inflammatory response “LifeWave X39 stem cell patch story has holes,” The Niche, February 2023 (archive) And consumers can gain these dubious, utterly-unsupported benefits for a measly $150-280 per monthly pack of patches. At least it’s far less expensive, I suppose, which makes it an easier product to sell within a social-media network. These devices no doubt appeal to some people who want an easy way to manage their own health—and perhaps more importantly, their fears about health. After following the Instagrams of various women shilling the Healy (I found zero men selling it), I came away with a real sense of the anxiety they must feel nowadays. Almost all of them embrace most or all of the misinformation flying around constantly about the pandemic and its vaccines and safety measures. As a result of their fears and beliefs, it must be really scary for them to think about getting sick. And it must feel very empowering indeed to think that they have this super-secret way to keep from getting sick—which they will share with their “Soul Sister Collective” downline and customers—for a price, of course.","filter_flag":1}
{"title":"Centre releases fact sheet to promote agroforestry - Hindustan Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vaW5kaWEtbmV3cy9pbmRpYS1pbXBsZW1lbnRzLW5ldy1sYXctdG8tcHJvbW90ZS1hZ3JvZm9yZXN0cnktbGlzdHMtMzYtc3BlY2llcy1zdWl0YWJsZS1mb3ItY3VsdGl2YXRpb24tYW5kLXRpbWJlci1oYXJ2ZXN0aW5nLTEwMTY5MjU1Njk0MDA5OS5odG1s0gGzAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9pbmRpYS1uZXdzL2luZGlhLWltcGxlbWVudHMtbmV3LWxhdy10by1wcm9tb3RlLWFncm9mb3Jlc3RyeS1saXN0cy0zNi1zcGVjaWVzLXN1aXRhYmxlLWZvci1jdWx0aXZhdGlvbi1hbmQtdGltYmVyLWhhcnZlc3RpbmctMTAxNjkyNTU2OTQwMDk5LWFtcC5odG1s?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vaW5kaWEtbmV3cy9pbmRpYS1pbXBsZW1lbnRzLW5ldy1sYXctdG8tcHJvbW90ZS1hZ3JvZm9yZXN0cnktbGlzdHMtMzYtc3BlY2llcy1zdWl0YWJsZS1mb3ItY3VsdGl2YXRpb24tYW5kLXRpbWJlci1oYXJ2ZXN0aW5nLTEwMTY5MjU1Njk0MDA5OS5odG1s0gGzAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9pbmRpYS1uZXdzL2luZGlhLWltcGxlbWVudHMtbmV3LWxhdy10by1wcm9tb3RlLWFncm9mb3Jlc3RyeS1saXN0cy0zNi1zcGVjaWVzLXN1aXRhYmxlLWZvci1jdWx0aXZhdGlvbi1hbmQtdGltYmVyLWhhcnZlc3RpbmctMTAxNjkyNTU2OTQwMDk5LWFtcC5odG1s?oc=5","id":"CBMirwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vaW5kaWEtbmV3cy9pbmRpYS1pbXBsZW1lbnRzLW5ldy1sYXctdG8tcHJvbW90ZS1hZ3JvZm9yZXN0cnktbGlzdHMtMzYtc3BlY2llcy1zdWl0YWJsZS1mb3ItY3VsdGl2YXRpb24tYW5kLXRpbWJlci1oYXJ2ZXN0aW5nLTEwMTY5MjU1Njk0MDA5OS5odG1s0gGzAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9pbmRpYS1uZXdzL2luZGlhLWltcGxlbWVudHMtbmV3LWxhdy10by1wcm9tb3RlLWFncm9mb3Jlc3RyeS1saXN0cy0zNi1zcGVjaWVzLXN1aXRhYmxlLWZvci1jdWx0aXZhdGlvbi1hbmQtdGltYmVyLWhhcnZlc3RpbmctMTAxNjkyNTU2OTQwMDk5LWFtcC5odG1s","guidislink":false,"published":"Mon, 21 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=233, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vaW5kaWEtbmV3cy9pbmRpYS1pbXBsZW1lbnRzLW5ldy1sYXctdG8tcHJvbW90ZS1hZ3JvZm9yZXN0cnktbGlzdHMtMzYtc3BlY2llcy1zdWl0YWJsZS1mb3ItY3VsdGl2YXRpb24tYW5kLXRpbWJlci1oYXJ2ZXN0aW5nLTEwMTY5MjU1Njk0MDA5OS5odG1s0gGzAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9pbmRpYS1uZXdzL2luZGlhLWltcGxlbWVudHMtbmV3LWxhdy10by1wcm9tb3RlLWFncm9mb3Jlc3RyeS1saXN0cy0zNi1zcGVjaWVzLXN1aXRhYmxlLWZvci1jdWx0aXZhdGlvbi1hbmQtdGltYmVyLWhhcnZlc3RpbmctMTAxNjkyNTU2OTQwMDk5LWFtcC5odG1s?oc=5\" target=\"_blank\">Centre releases fact sheet to promote agroforestry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hindustan Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Centre releases fact sheet to promote agroforestry - Hindustan Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vaW5kaWEtbmV3cy9pbmRpYS1pbXBsZW1lbnRzLW5ldy1sYXctdG8tcHJvbW90ZS1hZ3JvZm9yZXN0cnktbGlzdHMtMzYtc3BlY2llcy1zdWl0YWJsZS1mb3ItY3VsdGl2YXRpb24tYW5kLXRpbWJlci1oYXJ2ZXN0aW5nLTEwMTY5MjU1Njk0MDA5OS5odG1s0gGzAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9pbmRpYS1uZXdzL2luZGlhLWltcGxlbWVudHMtbmV3LWxhdy10by1wcm9tb3RlLWFncm9mb3Jlc3RyeS1saXN0cy0zNi1zcGVjaWVzLXN1aXRhYmxlLWZvci1jdWx0aXZhdGlvbi1hbmQtdGltYmVyLWhhcnZlc3RpbmctMTAxNjkyNTU2OTQwMDk5LWFtcC5odG1s?oc=5\" target=\"_blank\">Centre releases fact sheet to promote agroforestry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hindustan Times<\/font>","source.href":"https:\/\/www.hindustantimes.com","source.title":"Hindustan Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"After enacting a new law to regulate forest conservation in India that exempts agroforestry and plantations from regulatory oversight so that farmers can practice agroforestry on private land and harvest timber as required, the central government has published a fact sheet listing 36 species that can be grown in different agro-climatic zones. The report released on the ministry’s website details cultivating 36 specific species, including bamboo, that are suitable for agroforestry systems and home gardens (Representative photo) Read here: Agri officials deployed in cotton belt after pink bollworm attack in Punjab’s Bathinda Get ready to catch the final stages of the World Cup only on Crickit. Anytime, Anywhere. Explore now! “Agroforestry is a combination of practising agriculture and forestry together on the same unit of land. It is a traditional practice recognizing and promoting trees and\/or livestock on farms in a special arrangement pattern,” the FAQ document prepared by the Indian Council of Forestry Research and Education and released by the environment ministry on August 16 said. The report released on the ministry’s website details cultivating 36 specific species, including bamboo, that are suitable for agroforestry systems and home gardens. “Information is also on prospective state-specific agroforestry tree species, ICFRE-developed agro climate-specific models, supplemented with state-specific felling and transit regulations,” the FAQ stated. The 36 species include Leucaena leucocephala, or subabul, and various varieties of eucalyptus. Subabul is considered an invasive species that has been reported as a weed in more than 20 countries, according to an International Union for Conservation of Nature (IUCN) database. Eucalyptus is considered highly water-intensive. The list also includes important timber species such as poplar, teak, shisham (Indian rosewood) and mahogany. The production of teak in India is considered to be less than 3% of total consumption. With increasing prices due to low harvests in India and significant demand, imports have been increasing. Between 2009 and 2019, India imported about 10 million cubic metres (cum) of round wood and 900,000 cum of sawn and chipped teakwood, according to the FAQ. India imported mahogany to the tune of $53.86 million in 2018, with demand on the rise. Agroforestry practices have both financial and environmental advantages, the FAQ said. These include farm profitability; the combined output of trees, crops, and livestock per unit area is greater than the combined output of any one of the components acting alone; mulch and leaf litter as manure and bio-pesticides from tree components; crops and livestock protected from wind damage; new products from agroforestry increasing financial flexibility and diversification of farming enterprises and diversification; and carbon sequestration, among others. The preamble of the Forest Conservation (Amendment) Act 2023 focuses on achieving India’s goal of net-zero greenhouse gas emissions by 2070. India’s nationally determined contribution goal speaks of creating carbon sinks of additional 2.5 to 3.0 billion tonnes of carbon dioxide equivalent by 2030. “There were apprehensions that plantations on the lands of individuals and organisations can attract provisions of the Forest Conservation Act. Therefore, clarity has been provided in the bill that provisions of the Act will not be applicable in the private lands, which will encourage plantation in private lands, thereby helping the country to increase the area under green cover, enhancing the carbon sink and reducing the biotic pressure on forests,” environment minister Bhupender Yadav had said in an interview to HT on August 12. Read here: Green energy to power dedicated agri feeders in Bihar “In addition to these, it will also help in making our country Atmanirbhar (self-reliant) by generating additional income to our farmers while simultaneously reducing the wood import Bills of the country,” he had said. “These are comprehensive guidelines,” said Chetan Agrawal, a Gurugram- based forest researcher. “Leucaena leucocephala is now generally recognised as an invasive species and should probably not be promoted. Some states are actively considering its removal. In addition to the environmental benefits mentioned in the document, there is also need to recognise the environmental and hydrological trade-offs of certain fast-growing species and the need to manage the same, particularly in lower rainfall zones.” \"Invasive species need to be screened out. Species that can do well under climate change conditions need to be considered. The biodiversity co-benefits need to be looked at. Also, plantations on abandoned agricultural land need careful attention so that their density does not exceed hydrologic trade-off thresholds,\" said Jagdish Krishnaswamy, dean of School of Environment and Sustainability at Indian Institute for Human Settlements, Bengaluru.","filter_flag":1}
