{"title":"Green beauty in 2023 challenges are greenwashing, rising costs and transparency says The Green Chemist Consultancy - CosmeticsDesign-Europe.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDgvR3JlZW4tYmVhdXR5LWluLTIwMjMtY2hhbGxlbmdlcy1hcmUtZ3JlZW53YXNoaW5nLXJpc2luZy1jb3N0cy1hbmQtdHJhbnNwYXJlbmN5LXNheXMtVGhlLUdyZWVuLUNoZW1pc3QtQ29uc3VsdGFuY3nSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDgvR3JlZW4tYmVhdXR5LWluLTIwMjMtY2hhbGxlbmdlcy1hcmUtZ3JlZW53YXNoaW5nLXJpc2luZy1jb3N0cy1hbmQtdHJhbnNwYXJlbmN5LXNheXMtVGhlLUdyZWVuLUNoZW1pc3QtQ29uc3VsdGFuY3nSAQA?oc=5","id":"CBMiqwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDgvR3JlZW4tYmVhdXR5LWluLTIwMjMtY2hhbGxlbmdlcy1hcmUtZ3JlZW53YXNoaW5nLXJpc2luZy1jb3N0cy1hbmQtdHJhbnNwYXJlbmN5LXNheXMtVGhlLUdyZWVuLUNoZW1pc3QtQ29uc3VsdGFuY3nSAQA","guidislink":false,"published":"Wed, 08 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=67, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDgvR3JlZW4tYmVhdXR5LWluLTIwMjMtY2hhbGxlbmdlcy1hcmUtZ3JlZW53YXNoaW5nLXJpc2luZy1jb3N0cy1hbmQtdHJhbnNwYXJlbmN5LXNheXMtVGhlLUdyZWVuLUNoZW1pc3QtQ29uc3VsdGFuY3nSAQA?oc=5\" target=\"_blank\">Green beauty in 2023 challenges are greenwashing, rising costs and transparency says The Green Chemist Consultancy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Green beauty in 2023 challenges are greenwashing, rising costs and transparency says The Green Chemist Consultancy - CosmeticsDesign-Europe.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tZXVyb3BlLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDgvR3JlZW4tYmVhdXR5LWluLTIwMjMtY2hhbGxlbmdlcy1hcmUtZ3JlZW53YXNoaW5nLXJpc2luZy1jb3N0cy1hbmQtdHJhbnNwYXJlbmN5LXNheXMtVGhlLUdyZWVuLUNoZW1pc3QtQ29uc3VsdGFuY3nSAQA?oc=5\" target=\"_blank\">Green beauty in 2023 challenges are greenwashing, rising costs and transparency says The Green Chemist Consultancy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-europe.com","source.title":"CosmeticsDesign-Europe.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Barbara Olioso PhD MRSC, managing director of The Green Chemist Consultancy and opening keynote at the in-Cosmetics Global Sustainability Zone conference programme in Barcelona later this month, said sustainability remained absolutely front-and-centre for beauty in 2023, but there were challenges ahead. Olioso told CosmeticsDesign-Europe that addressing greenwashing was one of the issues highest up on the green beauty agenda today. Green beauty consumers and certifications​ “We live at a time where, for consumers, it is difficult to know what is really true or right,” she said. “…So, how does a consumer navigate the confusing market place? At present, the options are – going for a certified beauty product or scoring to decide accordingly.” And green beauty certifications and scoring systems, she said, had certainly gained ground in recent months as brands looked at ways to gain credibility when it came to green beauty claims. But she said with such a plethora of options out there – COSMOS, Natrue, EU Ecolabel, Eco Beauty Score, Green Score and the Green Impact Index, to name just a few – the question was: which system held most consumer appeal? Olioso said the biggest challenge ahead for industry would be the “harmonisation” of these certifications and scoring systems. “It would be fantastic to have one system for the whole industry. It will probably take longer than a year, but it is good to put the idea out there as it is very much needed to manage ingredient costs and to dissipate the confusion amongst consumers.” Supply chains and raw material innovation​ On the industry side, Olioso said it had also now become increasingly paramount to build out “transparent and reliable supply chains” in green beauty to offer a “truly sustainable beauty product”. Investing in this, however, resulted in higher price tags for end products, she said. Add into this product price hike were rising raw material costs creating a very real challenge for the manufacturing of green beauty and personal care products, though industry had continued to innovate well in recent years, she said. “As a formulator, I have seen a lot of progress in relation to green chemistry ingredients. So, formulators have, more than ever before, access to novel ingredients designed for performance and lower environmental impact.” Compared to what was available twenty years ago, she said green chemistry ingredients with antimicrobial properties, for example, had multiplied dramatically. The next challenge for raw material innovation, she said, would be in developing or finding green alternatives for silicones and microplastics. ‘Authentic, interactive and inspiring’​ Asked what aspects of this year’s Sustainability Zone conference programme at in-Cosmetics Global she was most looking forward to, Olioso said: “To me, the ‘sustainability corner’ is the beating heart of all of the sustainability zone, as suppliers and brands share valuable content to the industry, face to face, making it really authentic, interactive and inspiring.” This year, she said there were “three amazing keynote speakers” – Phil Verey, MD at Provenance talking about sustainability without greenwashing; Alessandra Frongillo, program manager for sector initiatives at Ecovadis talking about the responsible beauty initiative; and Ben Grace, founder of SBTRCT discussing his journey in creating the first award-winning solid skin care brand. Olioso added: “The pandemic made me appreciate the value of face to face events, especially for applying sustainability to beauty products as it is quite a complex topic.” The full Sustainability Zone programme can be found on the in-Cosmetics Global website, with a detailed breakdown on speakers, topics and times across the three-day tradeshow – 28-30 March, 2023.","filter_flag":1}
{"title":"The fragrance of forests - Symrise","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnN5bXJpc2UuY29tL291ci1zdG9yaWVzL3RoZS1mcmFncmFuY2Utb2YtZm9yZXN0cy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnN5bXJpc2UuY29tL291ci1zdG9yaWVzL3RoZS1mcmFncmFuY2Utb2YtZm9yZXN0cy_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vd3d3LnN5bXJpc2UuY29tL291ci1zdG9yaWVzL3RoZS1mcmFncmFuY2Utb2YtZm9yZXN0cy_SAQA","guidislink":false,"published":"Sat, 11 Mar 2023 18:59:05 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=11, tm_hour=18, tm_min=59, tm_sec=5, tm_wday=5, tm_yday=70, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnN5bXJpc2UuY29tL291ci1zdG9yaWVzL3RoZS1mcmFncmFuY2Utb2YtZm9yZXN0cy_SAQA?oc=5\" target=\"_blank\">The fragrance of forests<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Symrise<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The fragrance of forests - Symrise","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnN5bXJpc2UuY29tL291ci1zdG9yaWVzL3RoZS1mcmFncmFuY2Utb2YtZm9yZXN0cy_SAQA?oc=5\" target=\"_blank\">The fragrance of forests<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Symrise<\/font>","source.href":"https:\/\/www.symrise.com","source.title":"Symrise","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"A portion of the trees go to the pulp factory. Greg Clements works closely with around 40 of these factories. He worked in the industry for many years and knows all the processing steps. In his current position, he is mainly involved in optimizing the extraction of crude sulfate turpentine (CST). The viscid, flammable liquid, which has a sulfuric smell, used to be burned as a waste product. Today, Symrise is reusing it. “The paper factories know their business very well,” says Clements. “Together, though, we can optimize processes to get the highest possible yield of CST.” At the end, the product is stored in tanks that Symrise transports back to its factory in Jacksonville using trucks and railroad cars. “Our ­logistics are an unbeatable advantage for the paper factories,” says Greg Clements. “The storage options for CST at the paper mills are very limited. We help the factories manage the supply chain of their byproducts reliably while ­simultaneously securing our raw materials basis.” The expertise needed to find the best scent molecules The multistep chemical process begins at the massive Symrise plant covering roughly 50 hectares. To start, the sulfur and other substances that can be used as fuels are removed from the CST via a strip distillation process, which the company developed. They provide about 50 % of the fuel that Symrise needs to generate steam. Richard Hastings manages the plant together with his team. The experienced Plant Manager has been working at the Jacksonville site for 37 years and knows the distillation and ­extraction systems like the back of his hand. He stands in front of a five-pillared reactor that runs around the clock. Gesturing energetically, he explains how the purified CST is separated in a continuous process into its main components – the terpenes alpha-pinene and beta-pinene. With further processing methods like hydrogenation or pyrolysis, Symrise primarily uses the higher volume alpha-pinene to create fragrant molecules such as dihydromyrcenol, linalool (Symrise is the only manufacturer that produces this from renewable sources), citronellol or geraniol.","filter_flag":1}
{"title":"10 Sustainable British Beauty Brands To Discover Now - Country and Town House","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA","guidislink":false,"published":"Mon, 13 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=72, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5\" target=\"_blank\">10 Sustainable British Beauty Brands To Discover Now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Country and Town House<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"10 Sustainable British Beauty Brands To Discover Now - Country and Town House","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5\" target=\"_blank\">10 Sustainable British Beauty Brands To Discover Now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Country and Town House<\/font>","source.href":"https:\/\/www.countryandtownhouse.com","source.title":"Country and Town House","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"It’s estimated that the global cosmetics industry produces 120 billion units of packaging each year – most of which are not recyclable. It’s also an alarming contributor to the climate crisis (a study showed that 70 percent of CO2 emissions from the beauty industry could be reduced by just using reusable bottles) and has a history of unfair practices that have only been rectified in recent years. Thankfully, there are a number of brands speaking out against harmful practices and setting an example with carbon neutral manufacturing, plastic-free packaging and community-focused social action. Want to know who to have on your radar? These are the sustainable British beauty brands making a difference. The Country & Town House Responsible Buyers’ Guide","filter_flag":1}
{"title":"New insights of the application of water or ethanol-water plant extract rich in active compounds in food - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZudXQuMjAyMy4xMTE4NzYx0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZudXQuMjAyMy4xMTE4NzYx0gEA?oc=5","id":"CBMiPmh0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZudXQuMjAyMy4xMTE4NzYx0gEA","guidislink":false,"published":"Fri, 03 Mar 2023 15:24:24 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=3, tm_hour=15, tm_min=24, tm_sec=24, tm_wday=4, tm_yday=62, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZudXQuMjAyMy4xMTE4NzYx0gEA?oc=5\" target=\"_blank\">New insights of the application of water or ethanol-water plant extract rich in active compounds in food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New insights of the application of water or ethanol-water plant extract rich in active compounds in food - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZudXQuMjAyMy4xMTE4NzYx0gEA?oc=5\" target=\"_blank\">New insights of the application of water or ethanol-water plant extract rich in active compounds in food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Plants are recognized as natural sources of antioxidants (e.g., polyphenols, flavonoids, vitamins, and other active compounds) that can be extracted by green solvents like water, ethanol, or their binary mixtures. Plant extracts are becoming more used as food additives in various food systems due to their antioxidant abilities. Their application in food increases the shelf life of products by preventing undesirable changes in nutritional and sensory properties, such as the formation off-flavors in lipid-rich food. This review summarizes the most recent literature about water or ethanol-water plant extracts used as flavors, colorings, and preservatives to fortify food and beverages. This study is performed with particular attention to describing the benefits of plant extract-fortified products such as meat, vegetable oils, biscuits, pastries, some beverages, yogurt, cheese, and other dairy products. Antioxidant-rich plant extracts can positively affect food safety by partially or fully replacing synthetic antioxidants, which have lately been linked to safety and health issues such as toxicological and carcinogenic consequences. On the other hand, the limitations and challenges of using the extract in food should be considered, like stability, level of purity, compatibility with matrix, price, sensory aspects like distinct taste, and others. In the future, continuous development and a tendency to use these natural extracts as food ingredients are expected, as indicated by the number of published works in this area, particularly in the past decade. 1. Introduction Since ancient times, medicinal plants and herbal teas have been used in everyday human life as traditional medicines due to their healing and therapeutic properties (1, 2). Medicinal plants are the source of many phytochemicals which are secondary metabolites responsible for herbs’ beneficial properties (3). Plant secondary metabolism could be bio-synthetic source of several compounds which are attractive to utilize in the food industry and the pharmaceutical, chemical, cosmetic, and agronomic industries. The fundamental aim of plants is to create secondary metabolites as a defense mechanism against microorganisms, insects, and consumers such as herbivores (4). These secondary metabolites include many biologically active substances, for example, alkaloids, essential oils, flavonoids, bitters, coumarins, tannins, glycosides, and saponins. Figure 1 shows the locations of target phenolic compounds in different parts of a plant. Many studies have discussed biologically active compounds as they have antioxidant, antibacterial, antifungal, anti-inflammatory, and anti-tumor effects (8–10). In recent years, plants and their extracts containing high content of bioactive or aromatic compounds have found use in numerous applications in the food industry as flavors, colorings, antioxidants and antimicrobial agents (preservatives), nutrient enhancers, enzymes, and packaging additives (2, 11). FIGURE 1 Figure 1. Parts of a plant and the active phenolic compounds found in them (5–7). Plants should be appropriately identified, and a health risk assessment should be undertaken before food application (12); for example, the elimination factor for plants could be if they contain heavy metals, mycotoxins, or residues from chemical treatment or fertilization (13, 14). Chemical compounds’ concentration in plants depends on the soil, climate, agricultural practices, irrigation water quality, plant treatment, harvest season, and environmental pollution (10, 13). As a result, to reduce consumer risks, it is important to avoid harvesting plants in areas of high industrial and traffic activities due to the possibility of contamination of heavy metals (14, 15). Moreover, good agricultural practices should be implemented while applying chemical fertilizers or pesticides. Plant material before the extraction process usually requires pre-treatment, which includes washing, drying, enzymatic processes, fermentation, and grinding. Due to the washing treatment, the loading of plant samples with heavy metal contaminants such as aluminum and lead might be slightly reduced (14). Plant material pre-treatment prevents bioactive compounds’ degradation and the development of undesirable microorganisms, allowing the plant’s shelf life to be extended (16). Drying is one of the most popular plant material preservation methods because water is necessary for microorganisms and plant enzymes to function correctly (16, 17). Dehydration inhibits certain metabolic processes, such as enzymatic degradation, that might break down the bioactive compounds and change sensory and nutritional properties (16–18). Choosing the correct drying treatment is important since it might significantly lose heat-labile molecules, volatile compounds, flavonoid components, and attractive color pigments in plants (16, 19–21). High drying temperatures, on the other hand, may inhibit enzymes in plants that break down the bioactive compounds (16). The freeze-drying technique has the potential to stabilize, enrich, and prolong the life of plants containing bioactive temperature-sensitive molecules without destroying their chemical structure (16). According to a few authors, it is more appropriate to use freeze-drying than air drying at room temperature in the dark or in the microwave to maintain the maximum amount of carotenoids and chlorophylls in herbs (3, 22). However, high drying temperatures might inhibit enzymes in plants that can break down the bioactive ingredients (16). Dried plants might be milled into a powder before extraction because increasing the contact surface area between the plant matrix and the solvent might increase the extract’s yield and concentration of bioactive molecules through better segregation (23). On the other hand, the fragmentation method used for homogenizing herbs can reduce the yield of volatile molecules such as essential oils since they are released during the technological process, during which the secretory structure is destroyed (24). For example, the concentration of essential oil in peppermint granules (0.8–2.0 mm) was reduced by around 71% compared to the uncrushed plant (24, 25). Isolation of some bioactive molecules from plant matrices using only solvents during extraction might be challenging due to their bounds with components of cell walls (16, 26). Enzymatic treatment is an effective strategy that might improve the efficiency of extraction target bioactive compounds by better releasing these substances by degrading cell walls and membranes (16, 26). In addition, this pre-treatment offers the possibility of greener chemistry due to the shorter extraction duration, lower solvent usage, and milder conditions (16, 27). Enzyme-assisted extraction can improve phenolic and flavonoid recovery, hence increasing the antioxidant activity of the extracts (28–31). For example, Chew et al. used enzyme pre-treatment of the mulberry leaves with pectinase before ultrasound-assisted water extraction and fortifying cottage cheese with enhanced mulberry extract (28). A proper extraction method is required to provide a higher yield with a considerable concentration of bioactive components. The various structure of bioactive components might complicate the extraction process because of differences in polarity and solubility (32). Furthermore, the extraction method and various processing parameters strongly influence the extract’s yield, composition, and antioxidant activity; consequently, it is necessary to optimize this process (23, 33). In the last decade, attention has been focused on extraction techniques to limit the use of hazardous substances such as toxic solvents for human health and the environment while minimizing energy requirements and using renewable material as part of a green chemistry strategy (34, 35). Moreover, non-toxic and easy-to-handle solvents for plant extraction are preferred in the food industry (23); for example, water is the safest and least expensive green solvent (36). Water is efficient solvent in extracting polar molecules while in the case of less polar compounds, greater efficiency could be achieved by using organic solvents or binary solvents (36–38). For example, bioactive components such as polyphenols might be poorly soluble in water but have better solubility in organic solvents (39). Water might enhance the efficiency of the extraction process by helping the diffusion of extractable components like polyphenols through plant tissues (40, 41). Furthermore, a low-viscosity solvent may be preferred for preparing plant extract due to the possibility of accelerating mass transfer (42). For example, acidified water or organic solvent (e.g., ethanol or methanol) are effectively used to prepare plant extract rich in anthocyanins (43). Tannins are phenolic compounds with high molecular weights that form colloids when dissolved in water (44, 45). Furthermore, the solubility of tannins is variable, and depending on the target molecules, solvents with different polarities like water, ethanol, methanol, and acetone, as well as their aqueous solutions, might be used for extraction (7, 44, 45). Flavonoid glycosides are more water soluble than aglycones; additionally, both groups may be extracted with binary mixtures of water-alcohol and pure alcohols (46, 47). Furthermore, flavonoids’ hydroxyl groups and sugar moieties influence solubility in water (46). In contrast, less polar flavonoids such as flavanones, flavanols, isoflavones, and methylated flavones might be extracted with ethyl acetate, diethyl ether, chloroform, and dichloromethane (47). Alkaloids are often found in plants as salts of organic acids that are water-soluble under acidic circumstances (48, 49). Moreover, solubility in water increases due to the replacement of organic acid in alkaloid salts by inorganic acid salt (49). Binary solvent mixtures (e.g., water and organic solvent) are preferred over their neat counterparts because all bioactive molecules in plant material cannot be extracted using only a single solvent (36). In addition, binary solvent like aqueous acetone is better for the extraction of flavanols with higher molecular weight (50). A proper concentration of aqueous and organic solvents could efficiently extract active compounds (50); for example, ethanol is miscible in water, and the relative polarity of binary ethanol-water solvents (80:20, cl\/L) is 0.710, which is closer to the value for methanol than ethanol (38). Additionally, the mixture of water and alcohol (ethanol) could be more successful solvent mixture than single solvent in the extraction of polyphenols (41, 51). An organic solvent like methanol might effectively extract moderately polar and polar phenolic molecules (e.g., flavonoid glycosides and phenolic acids), especially those with lower molecular weight (42, 52). This hazardous alcohol might be a concern for food safety. The maximum limit for methanol residues in extracted food components and food is 10 mg\/kg; however, the methanol residues should be below 1.5 mg per kg of foodstuff with applied extracts from aromatic plants used as flavorings (23, 53). Solvents used in producing plant extracts might be removed at the end of the processing step (e.g., by evaporation on a rotary evaporator); however, some residual solvents might remain unintentionally (54). Their level is limited due to quality and safety concerns (53, 55); moreover, their maximum limitations are shown in Table 1 below. TABLE 1 Table 1. Properties of solvents arranged according to decreasing polarity (38, 53, 55, 56). The technology extraction factors influencing the composition of water or ethanol-water plant extracts include the solvent (ethanol concentration, mineral composition of water), the extraction time and temperature, the plant-to-solvent ratio, the size and part of plants, the used container, the addition of other ingredients such as acids, sugar or milk, and others (57–60). Acidification of the solvent can enhance the extraction; for example, hydrochloric acid, acetic acid, or other acids might be used (34, 60, 61). Moreover, Lajoie et al. (62) summarized and compared the most relevant approaches to enhance the water solvent potential for extracting of natural products. Different techniques can be used to extract bioactive compounds from the plants and are classified as conventional and nonconventional approaches. These conventional extraction methods are simple, easily available, and low-cost, but their use is limited by the diffusion of solvents into the plant’s cell walls (63). These methods are decoction, leaching, maceration, hydro and steam distillation, percolation, digestion, soxhlet extraction, heat, reflux extraction, and others (63, 64). However, their disadvantages include lower extraction selectivity, a longer time of extraction, and thermal destruction of heat liable chemical compounds at higher temperatures (34, 63). Moreover, these conventional methods might require the use of pure and expensive solvents, which might be toxic. Increasing the temperature enhances the solubility and diffusion coefficient of the phenolic compounds, which speeds up the extraction process (65). However, some compounds may degrade at higher temperatures; for example, rutin begins to degrade at 75°C, and its concentration decreases with increasing temperature until it is no longer quantifiable (90°C) (58, 66). Moreover, the concentration of volatile compounds in the final extract could increase as a function of the temperature, implying that if the water is not hot enough, the aroma from herbs would not be released optimally (67). On the other hand, non-conventional approaches include ultrasound, subcritical and supercritical fluid, microwave, enzyme, pulsed electric fields, instant controlled pressure drop, extrusion, and other assisted extractions (34, 68). These innovative and promising extraction techniques are used to recover plants’ bioactive molecules while reducing extraction time, energy, and solvent consumption to reduce waste production (68). The advantages of supercritical fluid extraction are that it is suitable for heat-sensitive compounds and prevents their oxidation, ecology without toxic solvents, shorter extraction time, and low viscosity and higher diffusion coefficient (69). That method might extract compounds like flavonoids, carotenoids, essential oils, and fatty acids from natural plant materials; moreover, it might employ several permitted extraction solvents; for example, non-polar hydrocarbons such as propane and butane, carbon dioxide, butane, nitrous oxide, ethanol, etc. (54, 69, 70). On the other hand, supercritical fluid extraction is unsuitable for extracting polar compounds (69). Extraction by the pulsed electric field is ideal for a high number of samples for a short extraction time; moreover, this technique facilitates purified extract, minimizes the degradation of the thermolabile compounds, and increases the extraction yield (69, 71). However, process parameters must be carefully monitored since they depend on various factors such as specific energy input, pulse number, field strength, and temperature (69, 71). Ultrasonic-assisted extraction is a process that extracts target molecules from a mixture of solvents by using ultrasound energy. Furthermore, the benefits of this technology include a higher yield with a shorter processing time and a lower quantity of chemicals and energy (69, 71). Polyphenols’ structural variety and wide distribution affects their extraction from the complex plant matrix; for example, insoluble polyphenols and flavonoids are located in the cell wall (72, 73). In contrast, soluble phenolic compounds like anthocyanins are found inside the cell vacuoles (72, 74). The high temperature of the solvent may promote the distribution of cell wall polysaccharides into the solvent and weaken the integrity of the cell wall, allowing phenolic compounds to pass into the infusion easily (75, 76). Their extractability could also be influenced by the chemical properties of phenolic substances, such as their molecular structure, polarity, concentration, number of aromatic rings, and hydroxyl groups. Complete extraction of some polyphenols may not be possible due to the formation of complexes with other metabolites, such as proteins and carbohydrates (77–79). Additionally, the extract’s concentration, purification, and fractionation are important methods for phenolic compounds analysis and the subsequent application of the plant extracts in food and beverages (73). Moreover, it is important to consider that the overall activity of plant extracts may be caused by combinations of constituents with synergistic, additive, or antagonistic effects. For example, high thiamine concentrations (0.1 and 0.8 mg\/100 g) reduced the antioxidant activity (AA) of ethanolic tea extracts (80), or Murakami et al. (81) observed a synergistic effect between some phenolic compounds and α-tocopherol. The current review focuses on using plant extracts to fortify food or beverages, extend their shelf life, control microbiological activity, or increase these products’ sensory and nutritional properties. This study evaluates the potential of aqueous or ethanolic plant extracts rich in bioactive compounds as a natural food additive. In addition, the present paper aims to collect and provide some of the most recent literature on water-ethanol plant extracts and their food applications to present well-arranged data using tables. The application of active plant extracts in oil, beverages, pastry, meat, and dairy products was also studied in detail. 2. Application of plant extract in food products The current trend is a healthy lifestyle and diet; therefore, consumers worldwide demand the development of food with a reduced level of synthetic ingredients like colorings, flavors, stabilizers, preservatives, and other food additives (82, 83). These requirements respond to concerns about the potentially harmful effects of long-term consumption of artificial additives on human health (84). However, only a small percentage of food producers develop products without food additives due to goods’ short shelf life and their susceptibility to microbial contamination. Consequently, there is an effort to find alternative natural food additives with appropriate organoleptic, antioxidant, or antibacterial properties that will extend the shelf life of food products and be attractive to consumers (33, 82, 83, 85). Lipids are the food ingredients most susceptible to oxidation, which limits the shelf life of products or changes their quality and nutritional value. The most prevalent cause of rancidity is lipid autooxidation, a free radical chain reaction. Heat, light, oxidants, ionizing radiation, metalloproteins, transition metals, enzymes, and compounds susceptible to homolytic cleavage might initiate lipid oxidation. Oxidative changes can result in rancidity, change in flavor and odor, color loss, nutritional value, or toxic compounds that can be harmful to consumer health (hydroperoxides, endoperoxides, and epoxides of fatty acids and cholesterol, alkoxy and hydroxy radicals, aldehydes such as malondialdehyde) (86–88). Consumers notice odors formed from molecules such as hexanal, heptanal, and other volatile compounds produced by lipids’ oxidation, and these substances reduce the shelf life of a food product (89). Antioxidants can delay the oxidation of lipids in food, which helps in food preservation by slowing the development of rancidity and color change. Natural antioxidants are a heterogeneous group of compounds with various chemical properties. This category includes phenolic compounds such as flavonoids, and the antioxidant activity (AA) is affected by their chemical structure and interaction with biomembranes. Many compounds have AA and might inhibit oxidation, but only some of them can be used in food. According to some studies, plant extracts can contribute to consumers’ health while they might have a more potent antioxidant capacity than synthetic antioxidants (90, 91). On the other hand, several natural antioxidants showed lower antioxidant activities than their synthetic counterparts, suggesting that they should be applied to food in larger amounts (92). Although the traditional usage of plants supports their safety, and they are generally recognized as safe (GRAS) food additives, many of them have not been studied in scientific research, and their efficacy and safety have not been thoroughly established (93). Assessing their safety and toxicity is important because plants’ extracts are usually concentrated and contain a higher amount of bioactive and toxic compounds. The biological effect of plant extract might be therapeutic, functional, or poisonous and depend on the quantity and quality of the components (94). For example, their application may cause phytotoxicity and allergies in excessive concentrations (85, 94); moreover, some extracted polyphenols in higher doses might contribute to the development and progression of cancer (42). Safety and toxicity studies are important for validating plants’ ongoing use and help establish the dosage of extracts for further application (95, 96). If plant extract (e.g., herbal infusion) already has a significant history of consumption in food in the EU before 15 May 1997, it implies that this extract does not fall within the scope of the Novel Food Regulation (EC) No. 258\/97 and can be considered safe. Also, the type of solvent should be considered because an aqueous extract may be classified entirely differently from a plant extract prepared with other solvents (97). According to López-Rodríguez et al., a total of 18 plant extracts have been approved as novel food or ingredients until 2022 (98). The examples of leaves extract in this group are rosemary extracts (Rosmarinus officinalis L., ethanolic extracts or extracts prepared by supercritical CO 2 extraction) (99), aqueous extracts of Ilex guayusa (98), and a purified extract of green tea [Camellia sinensis (L.)] Kuntze, containing at least of 90% (−)-epigallocatechin-3-gallate (100). Roots are another part of plants that could be used for the preparation of extracts; for example, the powder of three herbal roots (Angelica gigas Nakai, Phlomis umbrosa Turcz., and Cynanchum wilfordii Hemsley) obtained by aqueous extraction, evaporation, and finally, spray drying (101). Moreover, this powder might be used as a food supplement, and its maximum level is 175 mg daily for adults (101). Other roots used to prepare aqueous-ethanolic extract with maltodextrin are Panax notoginseng and Astragalus membranaceus (Fisch.) Bunge; in addition, the maximum level of consumption for adults except pregnant women is 35 mg\/day (102). Furthermore, cranberry extract powder is obtained by ethanolic extraction of concentrated juice from Vaccinium macrocarpon fruit, and the maximum level is 350 mg\/day for adults (103). Quillaia extract (E 999, bark and wood) is probably safe when used in amounts found in food; moreover, an acceptable daily intake of 0–1 mg\/kg body weight per day has been determined. Additionally, the presence of saponins in quillaia extract was responsible for the adverse effects on human health (104). In addition, betanin extracted from beetroot was accepted as food additive E162; this natural colorant provides a red-violet color when applied to food (105). The majority of approved application of beetroot extract has no maximum numerical level for a food additive, and only the necessary amount of extract is utilized (quantum satis) (106). However, the application of colors is forbidden in any food products for infants and young children (106). Green tea is rich in catechins, of which (−)-epigallocatechin-3-gallate (EGCG) is the most relevant and abundant polyphenol (107, 108). However, according to the European Food Safety Authority, green tea extract consumed as a food supplement at higher concentrations of EGCG exceeding 800 mg\/day increases the likelihood of liver damage (108). As a result, food with green tea extract must include less than 800 mg of EGCG, and producers must specify on the label that the total daily dose of 800 mg must not be exceeded (100). However, a safe dose could not be established (107). Because EGCG is a polar molecule soluble in water and ethanol-water mixtures (108), adverse effects related to the consumption of green tea were observed on both aqueous and hydroalcoholic extracts (94). Functional food fortified with plant extracts appear across food categories, as shown in Figure 2. Herbal extracts have the potential to be used in different food products containing fats and oils, including biscuits, fresh meat, meat preparations, cheeses, yogurts, margarine, mayonnaise or salad dressings, and other products (81, 83, 86, 109). FIGURE 2 Figure 2. Application of water or ethanol-water plant extracts in food and beverages. Before food application of extract, it is necessary to consider the type of food matrix to which it will be added because the nature of some natural antioxidants might limit their solubility depending on whether they are hydrophilic or hydrophobic (110). For example, the lipophilic nature of carotenoids might limit their solubility in aqueous-based products (111). In contrast, hydrophilic molecules like phenolic acids cannot be easily incorporated into high-fatty food products such as oils and fats (111, 112). Moreover, adding plant extracts into the food matrix can be challenging since the bioactive compounds are exposed to different processing conditions, affecting their stability (113). For example, phenolic compounds’ molecular size and structural conformation influence their sensitivity during food processing (113). In addition, various degradation mechanisms of bioactive molecules, like oxidation, hydrolysis, condensation, enzymatic deterioration, polymerization, and others, can occur due to the heterogeneous composition of the extract (111, 113). Incorporating plant extracts as a food ingredient could negatively impact the product’s quality due to their distinctive aroma and color (114). Because plant extracts are usually potent antioxidants, rich in phenolic compounds, they are likely to contribute to the bitter taste, astringency, and darkening of manufactured food and beverages (23, 104, 115, 116). Because of changes in the organoleptic properties of food products, consumers may reject food or beverages containing plant antioxidants, especially those with essential oils (92). Furthermore, these volatile essential oils give a strong flavor, and polyphenols may have an unpleasant taste; therefore, encapsulation methods might mask these compounds before they are added to food (92, 118). For example, liposomes, nanoemulsions, nanoparticles, phytosomes, and ethosomes might be used to protect and improve the stability of plant bioactive molecules (111). On the other hand, another potential strategy for overcoming natural extracts limits is investigating the synergistic and additive interactions between antioxidants, which might result in more effective multi-antioxidant systems with less of each component (110, 118). 2.1. Oils Edible vegetable oils are mainly triacylglycerols, composed of various fatty acids, which are highly susceptible to oxidative processes (119). Plant extracts can be considered potential sources of natural antioxidants for stabilizing edible oils since they prevent undesirable changes during storage and frying operations and might extend the oil’s shelf-life. As mentioned above, the hydrophilic character of phenolic acids may limit their potential application as antioxidants in oils; however, modifying their chemical structure by incorporating them into triacylglycerols might enhance their solubility and broaden their use in emulsions (112). Lipid oxidation is one of the most significant issues during the frying and storage processes, which results in the formation of free radicals, the loss of food quality, and it could cause illness (120, 121). According to Soleimani et al. (122), the aqueous leaf extract of Hyssopus officinalis L. and aerial parts extract of Echinacea purpurea L. reduced the oxidation rate of soybean oil exposed to 70°C for 5 days. All samples containing 200 to 1,000 ppm of hyssop extracts were more stable than the control soybean oil when evaluating peroxide and thiobarbituric acid changes, as presented in Table 2. The AA of these samples was comparable to the synthetic antioxidants butylhydroxytoluene (BHT) and butylhydroxyanisole (BHA) at 100 ppm. Both extracts could be appropriate alternatives to synthetic antioxidants, having no additional limits to get optimal effects. Pourashouri et al. (125) found that the concentrated aqueous extracts of wild pistacia, green tea, and rosemary extended the stability of a 10% fish oil-in-water emulsion for a few days. TABLE 2 Table 2. Application of plant extracts in oil. Aqueous extracts from aromatic herbs such as sage, sweet marjoram, and dittany showed a protective ability against lipid oxidation in refined sunflower oil. This ability to slow the oxidation of lipids is probably due to the high level of polyphenols, which might actively eliminate active oxygen and suppress its negative effects (128). Casarotti and Jorge (123) studied the thermal stability of soybean oil containing rosemary extract over 20-h heating at 180°C. The addition of rosemary extract increased the oxidative stability of oil and resulted in a lower production of total polar compounds. Moreover, this extract showed a higher antioxidant potential compared to the synthetic antioxidant tertiary butylhydroquinone (TBHQ). According to Wang et al. (127), the addition of rosemary extracts into omega-3 fatty acid-rich flaxseed oil might positively delay lipid oxidation and the oil’s oxidative stability (92). Phenolic constituents such as carnosol, carnosic acid, and rosmarinic acid were detected in rosemary extract (124, 129). These compounds might affect the oxidative stability of flaxseed oil during storage due to the synergistic interaction of naturally occurring tocopherol with potential pro-oxidant activity (127). In addition, Chammem et al. (124) successfully applied rosemary extract into the oil mixture to inhibit oxidation throughout frying. This extract can slow down oil oxidation throughout its use in frying. Oil treated with extract conserves more unsaturated fatty acids after 30 h of heating, suggesting its resistance against oxidation. A pleasant flavor was detected in oil treated with rosemary extract during frying. Rosemary extract (E392) might be used in various water-free fats and oils. In non-heat-treated vegetable oils with a polyunsaturated fatty acid concentration higher than 15% (w\/w) of the total fatty acid, the maximum allowed limit is 30 mg\/L of the sum of carnosic acid and carnosol (130). This food additive is used commercially in pumpkin (MVDr. Jiří Pantůček - TopVet, China), linseed (Green idea s.r.o., Belgium), avocado (Allnature s.r.o., Czech Republic), milk-thistle (MVDr. Jiří Pantůček - TopVet, Czech Republic), and rice oils (Allnature s.r.o., Czech Republic). Other applications of the food additive E392 are fish and algal oils; frying oils and fats; beef, poultry, sheep, and porcine fats; lard; oils and fats used in the professional production of heat-treated meals (130). Other applications of the food additive E392 are fish and algal oils; frying oils and fats; beef, poultry, sheep, and porcine fats; lard; oils and fats used in the professional production of heat-treated meals. Furthermore, the maximum permitted limit (MPL) for carnosol and carnosic acid in these products is 50 mg\/L (130). Examples of commercial items are fish oil Neuro treska (Nom oils, Czech Republic), algae oil capsules (Kala Health, Netherlands), and professional sunflower oil for frying (Olitalia, Italy). Moreover, rosemary extracts cannot be applicated to virgin, olive, and pomace oils (130). 2.2. Pastries Maintaining the quality of baked goods such as biscuits is important from an economic point of view because they are stored for a longer period before consumption. We can find a few studies dealing with adding plant ethanol-water extracts rich in phenolic compounds to biscuits to increase their shelf life, detailed in Table 3 (132, 133, 140). The natural extracts made from raisins (Vitis vinifera) and drumstick leaves (Moringa oleifera) had a stronger activity than the synthetic antioxidants BHA. Biscuits prepared with 1–2% of these extracts could be stored over six weeks because peroxide and free acids values were lower than in control and BHA-treated samples (131). Caleja et al. (133) found that the addition of synthetic BHA additives or natural extracts gave similar AA to biscuits. TABLE 3 Table 3. Application of plant extracts in pastries. In addition, Kozlowska et al. (136) prepared cookies by adding extracts of hyssop, nettle, or lemon balm and substituting some of the palm fat with walnut oil (cold-pressed). Although including hyssop or lemon balm extracts in the formulation of cookies may increase their quality and appeal to consumers, synthetic antioxidant BHA (0.02%) was still a more efficient inhibitor of lipid oxidation than herbal extracts (136). A few authors have dealt with the use of natural extracts obtained from by-products such as lemon (140) or grape pomace (135, 141) in biscuits. Biscuits enriched with ethanol extract from citrus lemon pomace showed higher antioxidant activity and phenolic content and improved nutraceutical properties than the control sample (140). Plant extracts can be used as additives in bakery products, including muffins, cakes, bread, and snacks (taralli – round breadsticks). The addition of roselle extract to cupcakes enhanced their ash, fiber, ascorbic acid, and total anthocyanins content, and the last one caused the color of the muffins turned pink (132). The addition of Clitoria ternatea extract also changed the final product’s color, increased total phenolic content (TPC) and AA, and at the same time, inhibited lipid peroxidation in the sponge cake. The hardness, adhesiveness, gumminess, and chewiness of the cake increased as the amount of extract in the cake was higher, whereas the cohesiveness, springiness, and resilience decreased (134). Furthermore, Nedamani (142) prepared cakes containing Berberis Vulgaris extracts, lycopene and chlorophyll oleoresins (tomato, spinach) as natural colorants. The panelists considered that colored cakes are more interesting for consumption than non-colored cakes. However, cakes made with Berberis vulgaris extract got the lowest color, taste, and odor scores, while texture and porosity were comparable to other samples. The novel product taralli with olive leaves extract had better nutritional quality, increased TPC, TFC, and AA. The sensory aspect was comparable to the control sample (138). Several studies have looked at adding plant extracts to bread made from flaxseed hull, barley hull (143), green parts of the Tartary buckwheat (144), grape seeds (145) or spearmint (146). Fortified bread with spearmint extract had higher TPC, DDPH radical scavenging activity, and ferrous-ion chelating (FIC) ability than the control bread. The strong taste of spearmint may account for the decrease in sensory scores (146). Extracts may be applied to various types of items containing cereals like fine bakery wares (MPL 200 mg\/kg or 2,000 mg\/kg), fillings of stuffed dry pasta (MPL 250 mg\/kg), noodles (MPL 2,000 mg\/kg), batters (MPL 12,000 mg\/kg), soda bread and rolls (MPL 20,000 mg\/kg) (130). Moreover, rosemary extract may be used in products like whole grain crispbread (Celpo spol. s r.o., Slovakia), spaghetti carbonara (HFC GmbH, Germany), pizza (Dr. Oetker, Germany), buns with chocolate-flavored filling (Tims Foods Ltd., Bulgaria), and cookies with rye flour (Rej s.r.o., Czech Republic). Another application of antioxidant E392 is whole grain biscuits (Pečivárne Lipt. Hrádok s.r.o., Slovakia), which contain extracts from roasted barley, rice, and chicory. In addition, the pretzels (Perfetti Van Melle Czech Republic, s.r.o., Czech Republic) include rosemary extract, barley malt extract, and paprika extract (coloring). Additionaly, beetroot extract (E162) is used in carrot cake cupcakes (Wicked, United Kingdom), burritos (Old El Paso, France), snuggles (Snack Day, Germany), birthday cakes (Fibre One, United Kingdom), and familial biscuits (Mini BN. France). 2.3. Meat Meat and minced meat are highly susceptible to oxidation and microbial contamination due to their high-fat content, unsaturated fatty acids, moisture, texture, and lack of heat treatment (23). During the meat processing and storage process, several changes occur, forming several reactive and toxic compounds. Oxidation of meat products can change the color, aroma, taste, texture, and appearance of the product; hence, sensory qualities are the most critical factors for determining the oxidation level and shelf life of meat (147). The use of plant extracts in meat products has received interest due to their beneficial natural antioxidant and antibacterial properties. Table 4 shows the application of various plant extracts as antioxidants and possible antimicrobial agents that benefit several meat products. TABLE 4 Table 4. Application of plant extracts in meat. The type of meat influences its oxidation stability because red and darker meat contains a higher concentration of heme protein myoglobin (160), which is primarily responsible for raw meat’s red color, and redox reactions on the iron atom cause color changes (86). During meat storage and processing, ferric heme (hemin) might dissociate from the heme-globin complex; consequently, released hemin might be a primary promoter of lipid oxidation and play an essential role in the catalysis of lipid peroxidation (161, 162). Additionally, reactive oxygen species and heme oxygenase might destroy the heme ring and release iron from it (161). Green tea extract can increase the color fastness of fresh meat products (163). The vermilion color of meat is caused by oxymyoglobin, whereas the brown color is caused by metmyoglobin, which is formed by the oxidation of oxymyoglobin (86). Green tea extract contains catechins, which show high AA in chicken and beef (163). The addition of antioxidants delays lipid oxidation, inhibit oxidative transformation, and improve meat quality. Natural antioxidants can contribute significantly to developing functional meat products with higher nutritional and health advantages, extended shelf life, and superior product quality. For example, ethanol extracts from rosemary and thyme (157) and clove concentrate (147) were added to minced meat as natural preservatives. Lyophilized extracts from fenugreek seeds and ginger rhizomes added to the beef patties showed vigorous AA comparable to commercial antioxidants. These lyophilized extracts can inhibit lipid oxidation during cold storage, preventing discoloration and forming a rancid odor and thiobarbituric acid (164). In other studies, they applied plant extracts in meat patties, for example, Betula pendula (145), Moringa oleiferia (156) and Humulus lupulus L. (148). According to Azman et al. (2017), a reduction of lipid oxidation was observed in the meat samples with Betula pendula extract, followed by a lower concentration of metmyoglobin and prolonged color stability of meat. The extract demonstrated the ability to delay the lipids degradation present in the muscle of the meat (156). The incorporation of clove extract in preparing cooked beef patties resulted in a significant decrease in thiobarbituric acid reactive substances (TBARS) value, carbonyl content, and enhancement of the stability of sensory attributes. It was used to hinder protein and lipid oxidation (147). The moringa extract had higher TPC and was more effective than BHT in keeping pre-cooked chilled goat meat patties at a low TBARS level which suggests that lipid peroxidation was slowed (148). Furthermore, hop infusion increased raw patties’ lipid and color stability during refrigerator storage, albeit to a lower extent than sodium ascorbate (reducing agent). Consumers preferred patties with hop infusion over those with hop powder (150). Beef patties treated with perilla extract had higher sensory scores than control samples; also, this meat product may have increased shelf life by inhibiting the growth of Escherichia coli and aerobic bacteria during the storage period (152). In addition to beef, chicken, mutton, and goat meat, herbal extract was also used in fish meat. Surimi fish balls were fortified with perilla extract, which improved the product’s shelf-life. It slowed lipid and protein oxidation during storage at 4°C, reducing TBARS values and protein carbonyl contents (158). Furthermore, plant extracts of grape seeds, pomegranate rind (165), and rosemary (166) were added to the minced fish. These extracts have the potential to be used as a natural antioxidant in raw minced fish tissue to slow oxidative changes and extend frozen storage time (165, 166). Another potential use of plant extracts is in salami, sausages, and other charcuterie products. According to de Carvalho et al. (159), turmeric extract which can substitute the synthetic antioxidant sodium erythorbate (500 ppm), increased the AA of fresh lamb sausages. The addition of 0.5%–1.0% jabuticaba extract, which had a strong antioxidant effect, did not influence the sensory quality of bologna-type sausages and might prevent the decrease of their sensory acceptability during storage for 35 days (153). Furthermore, Baldin et al. (2018) combined mortadella sausage with microencapsulated Jabuticaba water extract (Myrciaria cauliflora) rich in colorful anthocyanins (167). This addition of extract improved taste and texture acceptability; however, color, aroma, and pH value were reduced (167). Latoch and Stasiak reported that adding aqueous nettle extract (600 ppm) decreased TBARS value and increased the color stability and sensory parameters (overall quality, flavor, odor) in sausage (154). Jones et al. (168) used rooibos (Aspalathus linearis) extract to increase the oxidative stability of game droëwors, a dried meat sausage produced from blesbok and springbok meats combined with beef meat to improve fat content. The concentration of rooibos extract 1.0% was effective in slowing down lipid oxidation, and with increasing extract concentration, the lipid oxidation level significantly decreased. Moreover, a mixture of 10% rooibos, 4% potassium lactate, and sodium diacetate considerably reduced the amount of Clostridium perfringens in pig’s trotters at 10°C. Aspalathus linearis has the potential to be a natural preservative because it prevents lipid oxidation, which inhibits the growth of bacteria C. perfringens as well as the outgrowth and germination of their spores (149). Adding herbal extracts might be an alternative to the reduced salt content in meat products; for example, the application of basil extract increased the salty taste of low-sodium hams (116). Another application of plant extract could be as a natural colorant (105, 167); for example, beetroot extract and powder (freeze-dried) might be used as alternatives to carmine in sausage processing. Moreover, this extract addition positively affected the sausage’s overall acceptance, appearance, color, and flavor (105). Only a few studies investigated synergistic effects between plant extracts and essential oils on meat products (169, 170). For example, the combinational effects of aqueous grape seed extract (0.08%, 0.16%) and cinnamon essential oil (0.02%, 0.04%) slowed down lipid oxidation, extended the shelf life, and improved sensory qualities such as color and odor of the cooked chicken sausage (170, 171). Additionally, thymol and carvacrol were the bioactive compounds responsible for the synergistic effect (169). In another study, they prepared pork meatballs and applicated aqueous cranberry and pomegranate extracts (2% w\/v), oregano and thyme essential oils (0.150 μg\/g), either alone or in combination. The combinations of these natural preservatives could replace synthetic antioxidants in a minced pork meatball with equivalent antimicrobial and antioxidant activities (169). Furthermore, the synergistic interaction was observed between organic acids such as malic and citric acid (plant extracts) and thymol, p-cymene, and carvacrol (essential oils) (169). The concentration of extract with antioxidant activity in meat products was restricted in a few studies due to the deterioration of organoleptic qualities, the emergence of off-flavors, and the bitterness of the product (23, 172, 173). This may occur due to the interaction of phenolic compounds with other meat components such as lipids, mineral elements, and proteins in muscles (23, 172, 173). Furthermore, plant extract’s antibacterial effect depends on the amount of bioactive molecules; excessive concentrations of these compounds affect negative organoleptic features, which limit their application in food due to the impact on food acceptability (110, 172). Plant extracts are increasingly being used to substitute nitrites, mostly by utilizing plants such as radish, beetroot, tarragon, celery, lettuce, mint, spinach, basil, and other plants rich in natural nitrites (174). Adding these natural nitrite replacers could help produce meat products with the typical pink color of preserved meat and comparable levels of microbiological safety (175). In the food industry, spice extracts obtained by distillation in the form of essential oils or oleoresins can be applicated. However, their use necessitates precision in dosing and sufficient dispersion (176). In addition, plant extract could be dispersed on a solid carrier, which preserves natural plants’ flavor and taste while allowing for easy usage and high microbiological purity (176). Furthermore, rosemary extract can be used in non-heat and also in heat-treated processed meat like dried sausages (MPL 100 mg\/kg), dehydrated meat (MPL 150 mg\/kg), breakfast sausages (MPL 5,000 mg\/kg), frozen and deep-frozen mollusks and crustaceans (MPL 5,000 mg\/kg), and processed fishery products (130). Rosemary extract (E392) may be used in a variety of meat products, including fried chicken nuggets (Carnj Societa Cooperativa Agricola, Italy), pork spread (Uzeniny Pbram, a.s., Czech Republic), pork sausage csabai (Kaiser Food Kft, Hungary), sausage Pickstick (PICK Szeged, Hungary), sausage Chorizo Artesano (Indústrias Carnicas Navarra, S.A., Spain), sausage Paris (Pick Szeged, Hungary), and turkey sausage (Embutidos Carchelejo, Spain). Extract of beetroot is used as food colorant E162; one of the most popular applications is into sausage; for example, salami Bolzano (Aubel, Belgium), Salami FinBec and garlic salami (Boni, Belgium), Salami (Delifin, France), and original snacks saucisses (Isla Mondial, France). 2.4. Dairy product Enriching dairy products with herbs or spices can help provide functional products with nutritional and healing properties. The main problem with using herbs in cheese production is the possibility of microbial contamination on their surface. Therefore, scientific research is currently focused on developing new methods for the use of natural extracts as preservatives (177). Plant extracts with antioxidant or antibacterial activities have been used in dairy products, for example, to enhance the appearance and overall attractiveness (add color, flavor, and taste) for consumers and improve the shelf life, concentration of antioxidants, and total phenolics of food. Table 5 provides an overview of the current applications of aqueous or ethanolic plant extracts in dairy products. TABLE 5 Table 5. Application of plant extracts in dairy products. Due to their higher moisture content, microbial contamination is more common in soft cheeses than in hard or semi-hard cheeses. Bacterial contamination can occur during technical processing owing to higher handling during manufacture, harmful microorganisms in cheese cultures, or inadequate cooling throughout the production till consumption. The presence of pathogenic microbes and molds may reduce the shelf life of cheese, but they also pose a health concern to consumers. The objective is to minimize these health risks due to the microorganisms with minimal physical, chemical, and organoleptic changes (33, 82). For example, pine needles extract (Cedrus deodara (Roxb.) Loud.) improved lipid oxidative stability by significantly lowering the TBARS and free fatty acid values (179). This cedar extract improved sensory quality while storing low-fat hard and dry cheese “Kalari” and may be commercially exploited as a natural cheese preservative (179). Additionally, fermented cottage cheese with Morus alba had superior nutraceutical properties, and the extract had high antioxidant activity DPPH (28). Adding Inula britannica extract increased the protein and ash contents of cheddar-type cheeses, with concomitant decreases in the total solids, fat content, and pH. The AA decreased with increasing storage time, correlated with the decreasing content of phenolic substances. The decreases could be related to fermentation and maturation, during which phenolic compounds could interact with milk proteins. Furthermore, Inula britannica extract fortification gave a more desirable texture to the cheeses and uplifted their ratings for odor and taste (190, 191). Some cheeses treated with plant extracts showed a higher content of protein, ash, and total polyphenols than the control, as well as decreased pH, fat, and total dry matter values. The addition of the extract probably caused the polyphenols to interact with the milk protein, leading to protein precipitation and cross-linking, and a higher amount of whey was released from the cheese matrix (180, 192, 193). A similar trend of increased protein yield in cheeses treated with extracts was observed after the addition of an aqueous dehydrated green tea extract (194) and ethanol-water extract from grape skin (192). Adding plant extracts rich in phenolics can affect cheese production kinetics, as the change in pH, structure, and source of polyphenols affect the curd’s coagulation and thus the resulting product’s firmness (195, 196). Fermented dairy products, such as yogurt and milk, are a great matrix for adding plant extracts containing bioactive substances and preparing functional food. Herbal extracts increase these dairy products’ bioactive compounds and AA, further improve color, the sensory and nutritional characteristics, and finally improve microbial stability during refrigerator storage (83, 197). The addition of plant extracts had varying degrees of effect on the physicochemical quality of the yogurt. For example, increasing antioxidant properties, total phenolic content, acidity, and viscosity; however, the pH and syneresis of yogurt decreased compared to the control sample (117, 187, 188). According to Amirdivani and Baba (198), aqueous extracts of peppermint, dill, and basil probably enhanced the metabolic activity of yogurt bacteria, which improved milk’s fermentation and led to an increase in the acidity of yogurts. These fortified yogurts were characterized by a high content of bioactive peptides and improved antioxidant activities; additionally, in yogurt with peppermint extract, bacteria had the most increased proteolytic activity throughout fermentation and storage in the fridge (198). The antioxidant activity of yogurt is affected by bacterial fermentation, which results in the release of bioactive peptides (199). According to Hasneen et al. (185), the lowest used concentration of turmeric, marjoram and sage extracts added to skimmed-milk yogurt, 1.0% (w\/w), was the best overall organoleptically evaluated. The yogurt’s protein, fat, and ash contents fortified with the herbal extract showed no variation against control. Fortifying yogurt with 1.0% turmeric extract encouraged the growth of both bacterial yogurt strains (Streptococcus thermophilus, Lactobacillus delbrueckii ssp. bulgaricus). However, marjoram and sage extract slightly reduced their development than the control sample. There was a difference in titratable acidity; marjoram and sage extracts slowed acid growth in yogurt, resulting in higher pH values in the resultant products (185). Additionaly, the addition of rose extracts prolonged the time of preservation of the yogurt at 4°C, and the sensory and qualitative properties were maintained during 14-days refrigerating storage (182). Srivastava et al. (200) prepared yogurts from different kinds of milk by varying the amounts of beetroot and ginger rhizome extracts. They discovered that the antioxidant activity increased with the concentration of the extracts (max 2%). In addition, the type of used milk can influence AA; the highest was detected in goats’ yogurts, followed by cow and buffalo milk yogurts (200). Tang et al. (189) used cinnamon leaf extract as a functional ingredient in stirred yogurt. Cinnamon extract’s bioactivity in yogurt was investigated, and there was a significant reduction in DPPH scavenging activity and ferric-reducing antioxidant power (FRAP) in yogurt. The antioxidant activity in yogurt was preserved from loss by encapsulating the extract (189). Several researches added Hibiscus sabdariffa extract to dairy products since it has various bioactive components and high AA (181), improve the product’s sensory profiles, shelf life, and human health. According to Nuraeni et al. (178) addition of aqueous roselle extract to koumiss had no significant effect on the chemical or microbiological qualities of this fermented goat’s milk. Furthermore, roselle extract was used to prepare fortified goat-milk yogurt with anti-diabetic potency due to increased α-glucosidase inhibitory activity (183). It was also reported that roselle extract could suppress the growth of Escherichia coli and coliform bacteria in vitro and could be used in dairy products as an antibacterial agent and natural food colorant (178, 201). Additionally, roselle extract can be used to replace artificial red colorants in food because it contains water-soluble anthocyanins, which can be used as a natural color additive (202). Moreover, anthocyanins (E163) are approved as a natural colorant by the European Union. However, anthocyanins can be considered as more unstable molecules in the food product than synthetic dyes because their color stability is strongly influenced by various factors such as pH, high temperature, light, oxygen, solvents, enzymes, and other agents (203, 204). In addition, microencapsulation is an effective method for protecting the activity of this group of phenolic compounds (205). According to Rozan et al. (181), combining hibiscus extract with carrot juice resulted in a functional yogurt with improved color and extended shelf life of 21 days. In addition, developed yogurt had increased total phenolic compounds and total carotenoids (181). Rosemary extract (E392) might be used in different dairy products, such as UHT milk, dehydrated milk, flavored fermented milk products, creams, unripened cheese, and processed cheese (206). Commercial items with rosemary extract are cheese (Fabriqué par Fromagerie Neufchâteau, France), halloumi cheese (Dodoni, United Kingdom), cheese (St Môret, France), Apérifrais (Tartare, Switzerland), French Roulé (Chêne d’argent, France), fresh creamy cheese (Rians, United States), whipped Philadelphia (Philadelphia, France), buffalo cheese (Milton G. Waldbaum Company, United States), and creamy gorgonzola dip (Finesse Records, United States). Another food additive is beetroot red (E162), which is used as a coloring in various dairy products; for example, milblu creamy yogurt (Kaufland, Germany), strawberry milk (Dairy Manor, United Kingdom), strawberry yogurt (Yoplait, France), frozen dessert (Ski, France), strawberry yogurt drinks (Nestle, United Kingdom), and raspberry protein snack (Valio, Spain). In addition, fermented milk with the addition of aqueous lemongrass extract (Activia, Danone) is currently available on the market. 2.5. Beverages The fortification of beverages is another use for plant extracts. Pluháčková et al. (2020) analyzed beers that were enriched with five different herbal extracts and were evaluated as potentially benefitial to consumers’ health (207). Table 6 presents the name of plants and herbs, basic information about the preparation of extracts, and concentrations of them applied in beverages. The addition of medicinal plant extracts to beer increased the total content of polyphenols, some phenolic acids, and essential oils. Camphor and thujone were the most abundant essential oils in beer fortified with sage extract, whereas beer with chamomile extract included α-bisabolol, p-cymene, limonene, and farnesene. Even a low concentration of herbal extracts impacted fortified beer’s scent, flavor, and overall perception (207). TABLE 6 Table 6. Application of plant extracts in beverages. Guglielmotti et al. (2020) prepared beers with infusion or atomized extract of olive leaves, which increased the total polyphenol content of the beers. However, high polyphenol concentration might negatively affect beer’s colloidal stability and quality. Nonbiological haze development may arise during storage because of protein-polyphenol interactions (213). Soaking herbs in distillates or wine is a popular procedure across the world, producing a variety of extracts known as herbal liquors and wines (214, 215). Wine is a functional fermented beverage that might be fortified with herbal extracts to attain health benefits. For example, Purkait and Pandey (216) prepared enriched red wine with 10% roselle and 6% peppermint extract which panelists preferred above wine without herbs. In addition, adding dried roselle into this fermented beverage increases its acidity, which may improve microbial spoiling resistance and storability. Furthermore, plant extracts can also be added to fruit wines created with a non-grape juice base. For example, the addition of four extracts (lemongrass, tulsi, ginger, and peppermint) into orange wine has resulted in a new product with improved quality, increased acceptability, and broader applications. These herbal extracts enhance the basic characteristics of citrus wine when used in specific amounts (209). Another health-functional fruit wine was amLa wine with 15 mL of Phyllanthus niruri extract; that beverage recorded the highest overall acceptability due to its perfect combination of taste, fragrance, and appearance (212). The highest concentration of ascorbic acid, tannins, and phenolics was observed in amLa wine with 20 mL of herbal extract; furthermore, this wine had the most increased free radical scavenging activity (212). The health benefits of fruit juices have been related to their high level of antioxidant molecules; hence, several studies suggest that the high content of added antioxidant sources has been linked to the beneficial properties of fruit juices (217). Plant extracts can also be applied to fruit juices to increase and supplement the health benefits of fruits (218, 219). For example, apple juice with mint extract rich in bioactive molecules showed antioxidant activity; moreover, the panelists rated this enriched juice higher in pleasing smell and taste than pure juice (210). Additionally, Mgaya Kilima et al. (208) reported that combining tropical fruit juices with roselle extract has improved the mineral composition, total monomeric anthocyanins, and total phenol content in the blends based on the concentration of extracts added to the final products. On the other hand, vitamin C content in blends was lower than in individual fruit juices, and a similar trend was also described by Fasoyiro et al. (220). Tamer et al. (211) prepared lemonade with linden, ginger, peppermint, or heather extract. The addition of these plant extracts increased the product’s acceptability, the content of phenolics, and the antioxidant activity. Adding herbal extracts with a high antioxidant capacity to lemonades can contribute to the stability of juice against oxidation but also affect its color (217). Natural antioxidants, such as ascorbic acid, might be employed to improve the color fastness of fruit juices and the stability of carotenoids (221, 222). Plant extracts are used in beverages to add fragrance, color, flavor, and frothiness. Consumers might be attracted to the extract’s unique natural flavor, which enhances the taste of a drink. For example, cranberry extract powder was initially applicated in different types of beverages and by a variety of population age categories; however, since 2017, the EFSA has allowed its use only for adults and excluded all children, from infants to adolescents (98, 223). Furthermore, anthocyanins might be used as a natural coloring agent, under the additive-number E163, in acidic beverages such as fruit or aromatized wines, cider, flavored and carbonated soft drinks (224, 225). In addition, this natural coloring additive is available in various forms like E163a—cyanidin (red), E163b—delphinidin (blue), E163c—malvidin (purple), E164d—elargonidin (orange), E164e—peonidin (red-brown), and E165f—petunidin (dark red) (225). Another food additive is an aqueous extract of quillaia (E999), which is used as the foaming agent in non-alcoholic flavored beverages, beers, cider, and perry; in addition, the maximum concentration in these beverages is 200 mg\/L (226). Examples of commercial applications of this food additive are ginger beer (Ceylon Cold Stores PLC, Sri Lanka), root beer (A&W, United States), cream soda (Crush, Canada), and Nitro Pepsi (Pepsi, United States). Furthermore, the peach passion drink (Tim Hortons, Canada) contained quillaia and paprika extracts. Rosemary extract (E392) was used in different beverages such as orangina schweppes (Schweppes, France), non-alcoholic beer (Tourtel, France), protein powder (Orgain, Germany), pomegranate lemonade (Turkey Hill, United States), cocktail mixer (Hella cocktail co, United States), and kombucha (Kevita Inc., United States). Moreover, Life aid drink (LIFEAID Beverage Co., United States) contains seven different extracts obtained from turmeric, rosemary, ginger, oregano, stevia, piperine, and cayenne pepper. The limitation of the use of rosemary extract in beverages are, e.g., table waters and flavored sports drinks (MPL 500 mg\/L); flavored drinks (MPL 700 mg\/L); cider and perry, mead, spirit beverages, fruit wine, aromatized wines, and alcoholic drinks with less than 15% of ethanol (MPL 1,000 mg\/L); chocolate and malt dairy-based drinks, coffee-based drinks, and instant tea (MPL 2,000 mg\/L); whey protein—sports drinks (MPL 4,000 mg\/L); and vegetable protein drinks (MPL 20,000 mg\/kg) (206). Other drinks where plant extracts have been applied are still water with herbal extract (Rajec, Czech Republic), drink with chrysanthemum flower and Pu′er tea leaves extracts (Yeo’s, Malaysia), an energy drink with guarana extract (Big Shock s.r.o., Czech Republic), and a milk tea drink (MineShine, Taiwan), which contains black tea (leaves) and barley extracts. Moreover, alcoholic beverages also contain different plant extracts; for example, sparkling wine with natural lychee extract (Café de Paris, France), white wine with rose macerate (Rybízák s.r.o., Czech Republic), vermouth with extract of aromatic herbs (Martini, Italy), sangria with citrus extract (Dom Josué, France), and cider with lavender extract (Joker Cider s.r.o, Czech Republic). 3. Discussion Consumers’ dietary preferences are changing, and more consumers prefer naturally processed and safe products without synthetic food additives. In addition, plant extracts are becoming more popular in the food industry because of their low-cost, functional characteristics, and in some cases, renewable source of biologically active components (227). Moreover, extracts have a concentrated taste and flavor and a longer shelf life than fresh plants, making them ideal as ingredients for food products. Natural antioxidants found in these extracts have the potential to fortify food, and extend its shelf life, improve nutritional and sensory properties. Herbal extracts could inhibit or slow the oxidation of lipids, but they can also affect the qualitative properties of food products in both positive and negative ways. As a result, only relevant toxicologically tested extracts should be used to develop novel fortified products, followed by sensory analysis. The human senses are used to evaluate product attributes, and consumer perceptions and reactions to product attributes are studied. Some herbal extracts can give a distinctive food taste that may be unacceptable to consumers; hence, sensory quality is one of the important aspects of successful marketing (86, 228). From a commercial perspective, the overall acceptability of a product is often more important than evaluating the enriched product in terms of antimicrobial activity and slowing or inhibiting lipid oxidation. Additionally, the traditional application of natural extract directly on the food surface, such as spraying, pulverization, and dipping, might be replaced by incorporating extract and its active antimicrobial compounds into active packaging material. These novel active packaging could help extend food shelf life and prevent changes in taste caused by excessive amounts of bioactive compounds (11, 156, 229, 230). This allows the packaging film to become a dynamic and interactive element of the preservation procedure of food products (231). As shown in the previous tables, several researchers extracted many beneficial active compounds from food waste, and then they applied extracts to new products (135, 140, 153, 184). There is currently a global trend of utilizing co-product or waste, which arose in a considerable amount during food production, and extracting functional compounds from it can help reduce the environmental burden of waste while also adding value to the developed functional food product (232). According to Lourenç et al. (92), plant extracts that inhibit oxidation should also be non-toxic and suitable for human consumption; furthermore, the application of plant extracts should be effective already at low concentrations, between 0.001 and 0.01%, because organoleptic properties such as flavor, odor, color, and stability of the food matrix will probably not be affected negatively. Finally, the extract’s economic aspect and stability during its processing, storage, and as part of food are also important. The stability of polyphenols is affected by the pH value; for example, an aqueous solution with tea catechins was more stable at a highly acidic pH below 4 than at a slightly acidic higher than pH 6 (233). Furthermore, acid pretreatment may improve anthocyanins’ stability by creating a more favorable extraction environment and inactivating enzymes capable of destroying anthocyanins (234). In an acidic aqueous environment, anthocyanins exist in equilibrium, while their degradation occurs as the pH increases above 6 (233). The supercritical fluid extraction (SFE) approach is utilized on an industrial scale, particularly for essential oil extraction; however, following a potential modification, this technique might be used to extract non-polar compounds (235). SFE is an efficient method that might be used for extracting phenolic molecules and flavonoids (69). Bioactive compounds such as flavonoids, phenolic acids, essential oils, tannins, carotenoids, organosulfur compounds, phytosterols, and tocopherols are used in the food industry in the processing of vegetable oils, meat and seafood products, pastries, dairy products, beverages, etc. (236). Additionally, plant extracts may contain up to thousands of different molecules and determine the constituents responsible for a specific biological effect can be challenging since mixtures’ behavior cannot always be characterized by the presence of only a few identified compounds (237). In addition, herbal extract as a whole or several herbs in complex formulations could show better efficacies than equivalent doses of individual bioactive molecules or single herb (238). It is important to remember that medical herbs and their mixtures can pose a health risk due to non-essential and toxic metals, such as lead, cadmium, aluminum, mercury, or chromium, which can accumulate in plants (239). These toxic metals can be extracted into the infusion during its preparation and can be hazardous to consumers’ health. The maximum values for these metals in food supplements are defined by Commission Regulation (EC) No 629\/2008, as amended, notably lead (3.0 mg·kg−1), cadmium (1.0 mg·kg−1), and mercury (0.10 mg·kg−1) (240). Their overall concentration mostly determines the release of metals into the herb infusion, the metal’s affinity for the herb matrix, the metal’s solubility in solution, and the extractability of the components at high temperatures (77, 241). Some toxic metals, such as arsenic and lead, could be organically bound by biomacromolecules - polyphenols, with which they form ligands, and therefore are not biologically available in plant infusions. As a result, infusions could be less hazardous (241, 242). For example, Arpadjan et al. (242) observed that lead might not enter the infusions made from lead-contaminated plants since it is often weakly soluble in water and has a very low extraction factor. On the other hand, ethyl alcohol as a solvent showed a higher extraction power than water because ethanol could dissociate organic matrices and release bounded lead (243). The techniques used to produce fortified food should be developed to avoid protein denaturation or nutritional loss. Furthermore, it is necessary to choose the appropriate application of plant extracts to food because a good approach can improve the efficiency of the extracts even at a lower dose. For example, lyophilization or extract encapsulation techniques appear acceptable for preparing extract to fortify food. Freeze drying was one of the most popular methods for preserving bioactive compounds in plant extracts used as food ingredients in analyzed studies. A food product fortified with microencapsulated extract may have a better sensory evaluation than a free extract due to masking the aroma and taste of plant material (117, 244). Furthermore, the encapsulation method might prevent compounds from being vulnerable to the digestive process and the AA of the extract from being lost during digestion (189). The extract’s encapsulation can potentially preserve its bioactive properties and increase its shelf life, storage stability, bioavailability, and solubility, as well as reduce hygroscopicity and retention of microstructure (245). However, the size of the prepared particles can affect the acceptability of the novel food product fortified with them, as larger particles can cause a gritty-mouth feeling (246). The stability of polyphenols in extracts is crucial for various food applications because they might be easily influenced by oxygen, temperature, pH, light, enzymes, and other factors (247). Polyphenols are recognized as beneficial phytochemicals for human health; nevertheless, these compounds can interact with proteins, carbohydrates, lipids, and other food matrix components, which might significantly affect the nutritional and nutraceutical potential of fortified products (248–251). For example, tannins might develop tannin–protein complexes, which reduces their antioxidant ability (44, 45). Because of the complexity of polyphenol interactions within the food matrix (252), it is important that each food matrix be assessed individually regarding its interacting phenolic compounds throughout the development of functional food enriched with phenolic-rich plant extract. Interactions of bioactive compounds with other food ingredients could limit their full release during gastrointestinal digestion. Moreover, the polyphenols’ bioavailability is a limiting factor of their efficacy in preventing some diseases because these molecules’ chemical structure and biological activity might be transformed during metabolic processes and interaction with colon microbiota (247, 253). Furthermore, there are countless studies regarding antioxidants of natural origin in the literature; nevertheless, they have not been completely investigated their toxicity and the amount of biologically active compounds reaching the targeted spot in the human body. Future use of plant extracts as antimicrobial or antioxidant agents to preserve food requires that their efficacy as a food additive be proven and regulatory approved. Food fortified with plant extracts might offer health benefits; in that case, further research on in vitro tests (e.g., simultaneous digestion) and animal trials is needed to assess the health advantages to consumers. We can find the use of extracts in botanical ingredients, such as plant extract in food and beverages, is growing worldwide. Currently, the most popular applications of plant extract are mainly non-alcoholic and alcoholic beverages. We can also find confectionery, pastries, and dairy products with botanicals, such as cheese and yogurt. According to KerryDigest’s study, just 11% of European customers believe they completely understand all the benefits of botanicals; consequently, they recommend further education regarding botanical ingredients and how they may enhance human health (254). According to Future Market Insight reports, the global food market is expected to grow from USD 10.9 billion in 2022 to USD 34.5 billion in 2032, exhibiting a compound annual growth rate (CAGR) of 12.2% (255). More specifically, the global market for food botanicals demand is estimated to grow at 3.2% CAGR in these 10 years. The food botanicals market is expected to surpass USD 1.95 billion by the end of 2032. In conclusion, even though the previously mentioned study included just oleoresins, essential oils, and dried herbs from various sources (plants, algae, fungi, or lichens), we anticipate market growth in food and beverages with applied plant extract (256). Moreover, López-Rodríguez et al. (2022) assume that plant-origin extracts will be the most likely examined group in the scientific literature because this type of extracts has been the most approved as novel food in the last 5 years more than algal, fungal, and animal-origin extracts (98). 4. Conclusion In conclusion, the use of plant extracts in the food industry has received significant interest in recent years. Plant extracts consist of functional and sensory properties such as nutraceutical, antioxidant (radical scavenger) and antimicrobial activities, and attractive color and flavor, making them suitable for use as a natural additive for food applications. They are also used in food applications since they are non-toxic, affordable, readily available, and environmentally acceptable. Plant extracts with high AA may be commercialized and applied in various food formulations because they might improve the product’s qualities and make it functional food. Moreover, these extracts might be options for replacing synthetic compounds, which could be potentially harmful to human health. On the other hand, it is important to consider that plant extracts used as food ingredients may present various challenges related to their stability, purity levels, compatibility with food matrix, regulatory limitations, and cost-based aspects (extraction and application should be economical). Author contributions AP: conceptualization, software, writing—original draft preparation, and visualization. JM: writing—review and editing, supervision, project administration, and funding acquisition. All authors contributed to the article and approved the submitted version. Funding This research was supported by the internal grant of Tomas Bata University in Zlin, grant number IGA\/FT\/2023\/003. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 2. Mahunu, GK, Tahir, HE, Osei-Kwarteng, M, Mariod, AA, and Gweyi-Onyango, JP. Chapter 9—food use of whole and extracts of Hibiscus sabdariffa In: AA Mariod, HE Tahir, and GK Mahunu, editors. Roselle (Hibiscus sabdariffa) London, United Kingdom: Academic Press (2021). 123–36. Google Scholar 3. Branisa, J, Jomova, K, Porubska, M, Kollar, V, Simunkova, M, and Valko, M. Effect of drying methods on the content of natural pigments and antioxidant capacity in extracts from medicinal plants: a spectroscopic study. Chem Pap. (2017) 71:1993–2002. doi: 10.1007\/s11696-017-0193-9 CrossRef Full Text | Google Scholar 4. Mithöfer, A, and Maffei, ME. General mechanisms of plant defense and plant toxins In: P Gopalakrishnakone, CR Carlini, and R Ligabue-Braun, editors. Plant toxins. Dordrecht: Springer Netherlands (2017). 3–24. Google Scholar 5. Harborne, JB. Phytochemical methods: a guide to modern techniques of plant analysis. London, United Kingdom: Chapman and Hall (1998). Google Scholar 7. Das, AK, Islam, MN, Faruk, MO, Ashaduzzaman, M, and Dungani, R. Review on tannins: extraction processes, applications and possibilities. S Afr J Bot. (2020) 135:58–70. doi: 10.1016\/j.sajb.2020.08.008 CrossRef Full Text | Google Scholar 8. Compean, KL, and Ynalvez, RA. Antimicrobial activity of plant secondary metabolites: a review. Res J Med Plant. (2014) 8:204–13. doi: 10.3923\/rjmp.2014.204.213 CrossRef Full Text | Google Scholar 9. Santos-Sánchez, F, Salas-Coronado, R, Hernández-Carlos, B, and Villanueva-Cañongo, C. Shikimic acid pathway in biosynthesis of phenolic compounds In: M Soto-Hernández, R García-Mateos, and M Palma-Tenango, editors. Plant physiological aspects of phenolic compounds. London: IntechOpen (2019). Google Scholar 10. Aldhanhani, ARH, Ahmed, ZFR, Tzortzakis, N, and Singh, Z. Maturity stage at harvest influences antioxidant phytochemicals and antibacterial activity of jujube fruit (Ziziphus mauritiana Lamk. And Ziziphus spina-christi L.). Ann Agric Sci. (2022) 67:196–203. doi: 10.1016\/j.aoas.2022.12.003 CrossRef Full Text | Google Scholar 11. Rashmi, HB, and Negi, PS. Chapter 3—chemistry of plant extracts In: SA Mir, A Manickavasagan, and MA Shah, editors. Plant extracts: applications in the food industry. London, United Kingdom: Elsevier Inc (2022). 39–73. Google Scholar 12. Ekor, M. The growing use of herbal medicines: issues relating to adverse reactions and challenges in monitoring safety. Front Pharmacol. (2014) 4:1–10. doi: 10.3389\/fphar.2013.00177 PubMed Abstract | CrossRef Full Text | Google Scholar 13. Caldeirão, L, Sousa, J, Nunes, LCG, Godoy, HT, Fernandes, JO, and Cunha, SC. Herbs and herbal infusions: determination of natural contaminants (mycotoxins and trace elements) and evaluation of their exposure. Food Res Int. (2021) 144:110322. doi: 10.1016\/j.foodres.2021.110322 CrossRef Full Text | Google Scholar 14. Ahmed, ZFR, Kaur, N, and Hassan, FE. Ornamental date palm and Sidr trees: fruit elements composition and concerns regarding consumption. Int J Fruit Sci. (2022) 22:17–34. doi: 10.1080\/15538362.2021.1995570 CrossRef Full Text | Google Scholar 16. Krakowska-Sieprawska, A, Kiełbasa, A, Rafińska, K, Ligor, M, and Buszewski, B. Modern methods of pre-treatment of plant material for the extraction of bioactive compounds. Molecules. (2022) 27:730. doi: 10.3390\/molecules27030730 CrossRef Full Text | Google Scholar 17. Roshanak, S, Rahimmalek, M, and Goli, SAH. Evaluation of seven different drying treatments in respect to total flavonoid, phenolic, vitamin C content, chlorophyll, antioxidant activity and color of green tea (Camellia sinensis or C. assamica) leaves. J Food Sci Technol. (2016) 53:721–9. doi: 10.1007\/s13197-015-2030-x PubMed Abstract | CrossRef Full Text | Google Scholar 18. Kamel, SM, Thabet, HA, and Algadi, EA. Influence of drying process on the functional properties of some plants. Chem Mater Res. (2013) 3:1–9. Google Scholar 19. Kamel, SM. Effect of microwave treatments on some bioactive compounds of parsley (Petroselinum Crispum) and dill (Anethum graveolens) leaves. J Food Process Technol. (2013) 04:1–6. doi: 10.4172\/2157-7110.1000233 CrossRef Full Text | Google Scholar 20. Baranowski, JD. Storage stability of a processed ginger paste. J Food Sci. (1985) 50:932–3. doi: 10.1111\/j.1365-2621.1985.tb12982.x CrossRef Full Text | Google Scholar 21. Pezzutti, A, and Crapiste, GH. Sorptional equilibrium and drying characteristics of garlic. J Food Eng. (1997) 31:113–23. doi: 10.1016\/S0260-8774(96)00021-0 CrossRef Full Text | Google Scholar 22. Komes, D, Belščak-Cvitanović, A, Horžić, D, Marković, K, and Kovačević, GK. Characterisation of pigments and antioxidant properties of three medicinal plants dried under different drying conditions In:. Anonymous food process engineering in a changing world. Athens, Greece: Cosmosware (2011). 6. Google Scholar 23. Awad, AM, Kumar, P, Ismail-Fitry, MR, Jusoh, S, Ab Aziz, MF, and Sazili, AQ. Green extraction of bioactive compounds from plant biomass and their application in meat as natural antioxidant. Antioxidants. (2021) 10:1465. doi: 10.3390\/antiox10091465 CrossRef Full Text | Google Scholar 24. Kowalski, R, Baj, T, Kowalska, G, and Pankiewicz, U. Estimation of potential availability of essential oil in some Brands of Herbal Teas and Herbal Dietary Supplements. PLoS One. (2015) 10:e0130714. doi: 10.1371\/journal.pone.0130714 CrossRef Full Text | Google Scholar 25. Kowalski, R, and Wawrzykowski, J. Essential oils analysis in dried materials and granulates obtained from Thymus vulgaris L., Salvia officinalis L., Mentha piperita L. and Chamomilla recutita L. Flavour Fragr J. (2009) 24:31–5. doi: 10.1002\/ffj.1914 CrossRef Full Text | Google Scholar 26. Rafińska, K, Wrona, O, Krakowska-Sieprawska, A, Walczak-Skierska, J, Kiełbasa, A, Rafiński, Z, et al. Enzyme-assisted extraction of plant material – new functional aspects of the process on an example of Medicago sativa L. Ind Crop Prod. (2022) 187:115424. doi: 10.1016\/j.indcrop.2022.115424 CrossRef Full Text | Google Scholar 27. Nadar, SS, Rao, P, and Rathod, VK. Enzyme assisted extraction of biomolecules as an approach to novel extraction technology: a review. Food Res Int. (2018) 108:309–30. doi: 10.1016\/j.foodres.2018.03.006 CrossRef Full Text | Google Scholar 28. Chew, HC, Tang, PL, Tan, XY, and Tan, HY. Effect of mulberry leaf extract fortification and probiotic fermentation on the bioactivities of cottage cheese. Food Measure. (2021) 16:486–99. doi: 10.1007\/s11694-021-01174-4 CrossRef Full Text | Google Scholar 29. Kapasakalidis, PG, Rastall, RA, and Gordon, MH. Effect of a Cellulase treatment on extraction of antioxidant phenols from black currant (Ribes nigrum L.) pomace. J Agric Food Chem. (2009) 57:4342–51. doi: 10.1021\/jf8029176 PubMed Abstract | CrossRef Full Text | Google Scholar 30. Rakariyatham, K, Liu, X, Liu, Z, Wu, S, Shahidi, F, Zhou, D, et al. Improvement of phenolic contents and antioxidant activities of Longan (Dimocarpus longan) Peel extracts by enzymatic treatment. Waste Biomass Valor. (2020) 11:3987–4002. doi: 10.1007\/s12649-019-00723-9 CrossRef Full Text | Google Scholar 31. Wang, L, Wu, Y, Liu, Y, and Wu, Z. Complex enzyme-assisted extraction releases Antioxidative phenolic compositions from guava leaves. Molecules. (2017) 22:1648. doi: 10.3390\/molecules22101648 CrossRef Full Text | Google Scholar 32. Thoo, Y, Ng, S, Khoo, M, Aida, W, and Ho, C. A binary solvent extraction system for phenolic antioxidants and its application to the estimation of antioxidant capacity in Andrographis paniculata extracts. Int Food Res J. (2013) 20:1103. Google Scholar 33. Taylor, TM. Handbook of natural antimicrobials for food safety and quality. Amsterdam, The Netherlands: Elsevier (2015). Google Scholar 34. Sik, B, Hanczné, EL, Kapcsándi, V, and Ajtony, Z. Conventional and nonconventional extraction techniques for optimal extraction processes of rosmarinic acid from six Lamiaceae plants as determined by HPLC-DAD measurement. J Pharm Biomed Anal. (2020) 184:113173. doi: 10.1016\/j.jpba.2020.113173 CrossRef Full Text | Google Scholar 35. Clarke, CJ, Tu, W, Levers, O, Bröhl, A, and Hallett, JP. Green and sustainable solvents in chemical processes. Chem Rev. (2018) 118:747–800. doi: 10.1021\/acs.chemrev.7b00571 CrossRef Full Text | Google Scholar 36. Lim, KJA, Cabajar, AA, Lobarbio, CFY, Taboada, EB, and Lacks, DJ. Extraction of bioactive compounds from mango (Mangifera indica L. var. Carabao) seed kernel with ethanol–water binary solvent systems. J Food Sci Technol. (2019) 56:2536–44. doi: 10.1007\/s13197-019-03732-7 CrossRef Full Text | Google Scholar 37. Shah, MA, Bosco, SJD, and Mir, SA. Plant extracts as natural antioxidants in meat and meat products. Meat Sci. (2014) 98:21–33. doi: 10.1016\/j.meatsci.2014.03.020 CrossRef Full Text | Google Scholar 38. Reichardt, C. Solvents and solvent effects in organic chemistry. Weinheim, Germany: Wiley-VCH Verlag GmbH & Co. KGaA (2003). 418 p. Google Scholar 39. Giacobbo, A, do Prado, JM, Meneguzzi, A, Bernardes, AM, and de Pinho, MN. Microfiltration for the recovery of polyphenols from winery effluents. Sep Purif Technol. (2015) 143:12–8. doi: 10.1016\/j.seppur.2015.01.019 CrossRef Full Text | Google Scholar 40. Borges, A, José, H, Homem, V, and Simões, M. Comparison of techniques and solvents on the antimicrobial and antioxidant potential of extracts from Acacia dealbata and Olea europaea. Antibiotics. (2020) 9:48. doi: 10.3390\/antibiotics9020048 CrossRef Full Text | Google Scholar 41. Altıok, E, Bayçın, D, Bayraktar, O, and Ülkü, S. Isolation of polyphenols from the extracts of olive leaves (Olea europaea L.) by adsorption on silk fibroin. Sep Purif Technol. (2008) 62:342–8. doi: 10.1016\/j.seppur.2008.01.022 CrossRef Full Text | Google Scholar 42. Brglez Mojzer, E, Knez Hrnčič, M, Škerget, M, Knez, Ž, and Bren, U. Polyphenols: extraction methods, Antioxidative action, bioavailability and Anticarcinogenic effects. Molecules. (2016) 21:901. doi: 10.3390\/molecules21070901 CrossRef Full Text | Google Scholar 43. Dai, J, and Mumper, RJ. Plant Phenolics: extraction, analysis and their antioxidant and anticancer properties. Molecules. (2010) 15:7313–52. doi: 10.3390\/molecules15107313 CrossRef Full Text | Google Scholar 45. Kusuma, SB, Wulandari, S, Nurfitriani, RA, and Awaludin, A. The potential solvent for tannin extraction as a feed additive made of coffee husk (Coffea canephora) using Soxhlet method. IOP Conf Ser Earth Environ Sci. (2022) 980:012024. doi: 10.1088\/1755-1315\/980\/1\/012024 CrossRef Full Text | Google Scholar 46. Strugała, P, Tronina, T, Huszcza, E, and Gabrielska, J. Bioactivity in vitro of quercetin glycoside obtained in Beauveria bassiana culture and its interaction with liposome membranes. Molecules. (2017) 22:1520. doi: 10.3390\/molecules22091520 CrossRef Full Text | Google Scholar 47. Ferreira, O, and Pinho, SP. Solubility of flavonoids in pure solvents. Ind Eng Chem Res. (2012) 51:6586–90. doi: 10.1021\/ie300211e CrossRef Full Text | Google Scholar 48. Heinrich, M, Mah, J, and Amirkia, V. Alkaloids used as medicines: structural Phytochemistry meets biodiversity—an update and forward look. Molecules. (2021) 26:1836. doi: 10.3390\/molecules26071836 CrossRef Full Text | Google Scholar 49. Yubin, J, Miao, Y, Bing, W, and Yao, Z. The extraction, separation and purification of alkaloids in the natural medicine. J Chem Pharm Res. (2014) 6:338–45. Google Scholar 50. Do, QD, Angkawijaya, AE, Tran-Nguyen, PL, Huynh, LH, Soetaredjo, FE, Ismadji, S, et al. Effect of extraction solvent on total phenol content, total flavonoid content, and antioxidant activity of Limnophila aromatica. J Food Drug Anal. (2014) 22:296–302. doi: 10.1016\/j.jfda.2013.11.001 PubMed Abstract | CrossRef Full Text | Google Scholar 51. Petkovska, A, Gjamovski, V, and Stefova, M. Comparison of different extraction solvents for assay of the polyphenol content in the peel and pulp of apple cultivars from Macedonia. Maced J Chem Chem Eng. (2016) 35:29. doi: 10.20450\/mjcce.2016.871 CrossRef Full Text | Google Scholar 52. Babbar, N, Oberoi, HS, Sandhu, SK, and Bhargav, VK. Influence of different solvents in extraction of phenolic compounds from vegetable residues and their evaluation as natural sources of antioxidants. J Food Sci Technol. (2014) 51:2568–75. doi: 10.1007\/s13197-012-0754-4 CrossRef Full Text | Google Scholar 53. EU. Directive 2009\/32\/EC of the European Parliament and of the Council of 23 April 2009 on the approximation of the laws of the member states on extraction solvents used in the production of foodstuffs and food ingredients. Off J Eur Union. (2016) 284:8. Google Scholar 54. EUR-Lex. Safe food processing: common standards for extraction solvents [internet]. Luxembourg: EUR-Lex & Legal Information Unit (2015). Google Scholar 55. Committee for Medicinal Products for Human Use (2022). ICH guideline Q3C (R8) on impurities: guideline for residual solvents, vol. 39. Amsterdam: European Medicines Agency, 10–19. Google Scholar 56. Murov, S. Properties of organic solvents [internet]. Shanghai (China): Miller's Home (2010). Google Scholar 57. Franks, M, Lawrence, P, Abbaspourrad, A, and Dando, R. The influence of water composition on flavor and nutrient extraction in green and black tea. Nutrients. (2019) 11:80. doi: 10.3390\/nu11010080 CrossRef Full Text | Google Scholar 58. da Silveira, TFF, Meinhart, AD, Ballus, CA, and Godoy, HT. The effect of the duration of infusion, temperature, and water volume on the rutin content in the preparation of mate tea beverages: an optimization study. Int Food Res J. (2014) 60:241–5. doi: 10.1016\/j.foodres.2013.09.024 CrossRef Full Text | Google Scholar 59. Sánchez-López, JA, Yener, S, Smrke, S, Märk, TD, Bonn, G, Zimmermann, R, et al. Extraction kinetics of tea aroma compounds as a function brewing temperature, leaf size and water hardness. Flavour Fragr J. (2020) 35:365–75. doi: 10.1002\/ffj.3571 CrossRef Full Text | Google Scholar 60. Kajdžanoska, M, Petreska, J, and Stefova, M. Comparison of different extraction solvent mixtures for characterization of phenolic compounds in strawberries. J Agric Food Chem. (2011) 59:5272–8. doi: 10.1021\/jf2007826 CrossRef Full Text | Google Scholar 61. Petreska Stanoeva, J, Balshikevska, E, Stefova, M, Tusevski, O, and Simic, SG. Comparison of the effect of acids in solvent mixtures for extraction of phenolic compounds from Aronia melanocarpa. Nat Prod Commun. (2020) 15:1934578X2093467. doi: 10.1177\/1934578X20934675 CrossRef Full Text | Google Scholar 62. Lajoie, L, Fabiano-Tixier, A, and Chemat, F. Water as green solvent: methods of Solubilisation and extraction of natural products-past, present and future solutions. Pharmaceuticals. (2022) 15:1507. doi: 10.3390\/ph15121507 PubMed Abstract | CrossRef Full Text | Google Scholar 63. Rasul, MG. Conventional extraction methods use in medicinal plants, their advantages and disadvantages. Int J Basic Sciences App Comput. (2018) 2:10–4. Google Scholar 64. Câmara, JS, Perestrelo, R, Berenguer, CV, Andrade, CFP, Gomes, TM, Olayanju, B, et al. Green extraction techniques as advanced sample preparation approaches in biological, food, and environmental matrices: a review. Molecules. (2022) 27:2953. doi: 10.3390\/molecules27092953 CrossRef Full Text | Google Scholar 65. Cacace, JE, and Mazza, G. Mass transfer process during extraction of phenolic compounds from milled berries. J Food Eng. (2003) 59:379–89. doi: 10.1016\/S0260-8774(02)00497-1 CrossRef Full Text | Google Scholar 66. Zhou, Q, Sun, S, Du, D, Liang, X, and Yang, X. Real time monitor of rutin stability during heating by Fourier transform infrared spectroscopy. Guang Pu Xue Yu Guang Pu Fen Xi. (2000) 20:195–8. Google Scholar 67. Brzoňová, L. Tea [In Czech: Čaj]. Praha: Sdružení českých spotřebitelů, z.ú (2016). Google Scholar 68. Chemat, F, Abert Vian, M, Fabiano-Tixier, A, Nutrizio, M, Reek Jambrak, A, PES, M, et al. A review of sustainable and intensified techniques for extraction of food and natural products. Green Chem. (2020) 22:2325–53. doi: 10.1039\/c9gc03878g CrossRef Full Text | Google Scholar 69. Farooq, S, Mir, SA, Shah, MA, and Manickavasagan, A. “Chapter 2 - Extraction techniques,” in Plant Extracts: Applications in the Food Industry, eds. S.A. Mir, A. Manickavasagan and M. A. Shah London, United Kingdom: Elsevier Inc (2022):23–37. doi: 10.1016\/B978-0-12-822475-5.00005-3 CrossRef Full Text | Google Scholar 70. Uwineza, PA, and Waśkiewicz, A. Recent advances in supercritical fluid extraction of natural bioactive compounds from natural plant materials. Molecules. (2020) 25:3847. doi: 10.3390\/molecules25173847 CrossRef Full Text | Google Scholar 72. Yang, L, Jiang, J, Li, W, Chen, J, Wang, D, and Zhu, L. Optimum extraction process of polyphenols from the bark of Phyllanthus emblica L. based on the response surface methodology. J Sep Sci. (2009) 32:1437–44. doi: 10.1002\/jssc.200800744 CrossRef Full Text | Google Scholar 73. Chiriac, E, Chiţescu, C, Geană, E, Gird, C, Socoteanu, R, and Boscencu, R. Advanced analytical approaches for the analysis of polyphenols in plants matrices—a review. Separations. (2021) 8:65. doi: 10.3390\/separations8050065 CrossRef Full Text | Google Scholar 74. Otegui, MS. Chapter 11 - imaging polyphenolic compounds in plant tissues In: J Dreher Reed, VA Pereira de Freitas, and S Quideau, editors. Recent advances in polyphenol research Volume 7. Chichester, United Kingdom: John Wiley & Sons Ltd (2021). 281–95. Google Scholar 75. Mukherjee, S, Mandal, N, Dey, A, and Mondal, B. An approach towards optimization of the extraction of polyphenolic antioxidants from ginger (Zingiber officinale). J Food Sci Technol. (2014) 51:3301–8. doi: 10.1007\/s13197-012-0848-z PubMed Abstract | CrossRef Full Text | Google Scholar 76. Kubra, IR, and Rao, LJM. Microwave drying of ginger (Zingiber officinale roscoe) and its effects on polyphenolic content and antioxidant activity. Int J Food Sci Technol. (2012) 47:2311–7. doi: 10.1111\/j.1365-2621.2012.03104.x CrossRef Full Text | Google Scholar 77. Theuma, M, and Attard, E. From herbal substance to infusion: the fate of polyphenols and trace elements. J Herb Med. (2020) 21:100347. doi: 10.1016\/j.hermed.2020.100347 CrossRef Full Text | Google Scholar 78. Tanaka, T, Matsuo, Y, and Kouno, I. Chemistry of secondary polyphenols produced during processing of tea and selected foods. Int J Mol Sci. (2010) 11:14–40. doi: 10.3390\/ijms11010014 PubMed Abstract | CrossRef Full Text | Google Scholar 79. Khoddami, A, Wilkes, MA, and Roberts, TH. Techniques for analysis of plant phenolic compounds. Molecules. (2013) 18:2328–75. doi: 10.3390\/molecules18022328 CrossRef Full Text | Google Scholar 80. Piechocka, J, Szymandera-Buszka, K, Kobus-Cisowska, J, Gramza-Michałowska, A, and Jędrusek-Golińska, A. The effect of thiamine concentration on the Antioxidative activity indices in tea extracts. Antioxidants. (2019) 8:555. doi: 10.3390\/antiox8110555 CrossRef Full Text | Google Scholar 81. Murakami, M, Yamaguchi, T, Takamura, H, and Matoba, T. Effects of ascorbic acid and α-tocopherol on antioxidant activity of polyphenolic compounds. J Food Sci. (2003) 68:1622–5. doi: 10.1111\/j.1365-2621.2003.tb12302.x CrossRef Full Text | Google Scholar 82. Gouvea, FS, Rosenthal, A, and Ferreira, EHR. Plant extract and essential oils added as antimicrobials to cheeses: a review. Cienc Rural. (2017) 47:47. doi: 10.1590\/0103-8478cr20160908 CrossRef Full Text | Google Scholar 83. Granato, D, Santos, JS, Salem, RD, Mortazavian, AM, Rocha, RS, and Cruz, AG. Effects of herbal extracts on quality traits of yogurts, cheeses, fermented milks, and ice creams: a technological perspective. Curr Opin Food Sci. (2018) 19:1–7. doi: 10.1016\/j.cofs.2017.11.013 CrossRef Full Text | Google Scholar 84. Dey, S, and Nagababu, BH. Applications of food color and bio-preservatives in the food and its effect on the human health. Food Chem Adv. (2022) 1:100019. doi: 10.1016\/j.focha.2022.100019 CrossRef Full Text | Google Scholar 85. Xylia, P, Chrysargyris, A, Shahwar, D, Ahmed, ZFR, and Tzortzakis, N. Application of rosemary and eucalyptus essential oils on the preservation of cucumber fruit. Horticulturae. (2022) 8:774. doi: 10.3390\/horticulturae8090774 CrossRef Full Text | Google Scholar 86. Namal Senanayake, SPJ. Green tea extract: chemistry, antioxidant properties and food applications – a review. J Funct Foods. (2013) 5:1529–41. doi: 10.1016\/j.jff.2013.08.011 CrossRef Full Text | Google Scholar 88. Herzig, I, and Suchý, P (2019). Harmful and toxic substances in animal feed [In Czech: Škodlivé a toxické látky v krmivech živočišného původu], 1–25. Google Scholar 89. Belitz, H, Grosch, W, and Schieberle, P. Food chemistry. Berlin, Germany: Springer (2009). Google Scholar 90. Zhang, Y, Zhang, F, Thakur, K, Ci, A, Wang, H, Zhang, J, et al. Effect of natural polyphenol on the oxidative stability of pecan oil. Food Chem Toxicol. (2018) 119:489–95. doi: 10.1016\/j.fct.2017.10.001 PubMed Abstract | CrossRef Full Text | Google Scholar 91. Jayawardana, BC, Warnasooriya, VB, Thotawattage, GH, Dharmasena, VAKI, and Liyanage, R. Black and green tea (Camellia sinensis L.) extracts as natural antioxidants in uncured pork sausages. J Food Process Preserv. (2019) 43:1–8. doi: 10.1111\/jfpp.13870 CrossRef Full Text | Google Scholar 92. Lourenço, SC, Moldão-Martins, M, and Alves, VD. Antioxidants of natural plant origins: from sources to food industry applications. Molecules. (2019) 24:4132. doi: 10.3390\/molecules24224132 CrossRef Full Text | Google Scholar 93. Lüde, S, Vecchio, S, Sinno-Tellier, S, Dopter, A, Mustonen, H, Vucinic, S, et al. Adverse effects of plant food supplements and plants consumed as food: results from the poisons Centres-based PlantLIBRA study. Phytother Res. (2016) 30:988–96. doi: 10.1002\/ptr.5604 CrossRef Full Text | Google Scholar 94. Di Lorenzo, C, Ceschi, A, Kupferschmidt, H, Lüde, S, De Souza, NE, Dos Santos, A, et al. Adverse effects of plant food supplements and botanical preparations: a systematic review with critical evaluation of causality. Br J Clin Pharmacol. (2015) 79:578–92. doi: 10.1111\/bcp.12519 PubMed Abstract | CrossRef Full Text | Google Scholar 95. Anwar, F, Saleem, U, Rehman, AU, Ahmad, B, Ismail, T, Mirza, MU, et al. Acute oral, subacute, and developmental toxicity profiling of naphthalene 2-yl, 2-chloro, 5-nitrobenzoate: assessment based on stress response, toxicity, and adverse outcome pathways. Front Pharmacol. (2021) 12:810704. doi: 10.3389\/fphar.2021.810704 CrossRef Full Text | Google Scholar 96. Sponchiado, G, Adam, ML, Silva, C, Silva Soley, B, de Mello-Sampayo, C, Cabrini, D, et al. Quantitative genotoxicity assays for analysis of medicinal plants: a systematic review. J Ethnopharmacol. (2016) 178:289–96. doi: 10.1016\/j.jep.2015.10.026 PubMed Abstract | CrossRef Full Text | Google Scholar 97. European Commission (2016). Human consumption to a significant degree, information and guidance document. Brussels: European Union. Google Scholar 98. López-Rodríguez, R, Domínguez, L, Fernández-Ruiz, V, and Cámara, M. Extracts rich in nutrients as novel food ingredients to be used in food supplements: a proposal classification. Nutrients. (2022) 14:3194. doi: 10.3390\/nu14153194 CrossRef Full Text | Google Scholar 99. European Food Safety Authority. Use of rosemary extracts as a food additive—scientific opinion of the panel on food additives, flavourings, processing aids and materials in contact with food. EFSA J. (2008) 6:1–29. doi: 10.2903\/j.efsa.2008.721 CrossRef Full Text | Google Scholar 100. European Commission. COMMISSION REGULATION (EU) 2022\/2340 of 30 November 2022 amending annex III to regulation (EC) no 1925\/2006 of the European Parliament and of the Council as regards green tea extracts containing (−)-epigallocatechin-3-gallate. Off J Eur Union. (2022) 310:721:7–11. Google Scholar 101. European Commission. COMMISSION IMPLEMENTING REGULATION (EU) 2018\/469 of 21 march 2018 authorising the placing on the market of an extract of three herbal roots (Cynanchum wilfordii Hemsley, Phlomis umbrosa Turcz. And Angelica gigas Nakai) as a novel food under regulation (EU) 2015\/2283 of the European Parliament and of the Council, and amending Commission Implementing regulation (EU) 2017\/2470. Off J Eur Union. (2018) 79:11–15. Google Scholar 102. European Commission. COMMISSION IMPLEMENTING REGULATION (EU) 2020\/1821 of 2 December 2020 authorising the placing on the market of an extract from Panax notoginseng and Astragalus membranaceus as a novel food under regulation (EU) 2015\/2283 of the European Parliament and of the Council and amending Commission Implementing regulation (EU) 2017\/2470. Off J Eur Union. (2020) 406:34–38. Google Scholar 103. European Commission. COMMISSION IMPLEMENTING REGULATION (EU) 2018\/1631 of 30 October 2018 authorising the placing on the market of cranberry extract powder as a novel food under regulation (EU) 2015\/2283 of the European Parliament and of the Council and amending Commission Implementing regulation (EU) 2017\/2470. Off J Eur Union. (2018) 272:17–22. Google Scholar 104. Nguyen, QV, and Chuyen, HV. Processing of herbal tea from Roselle (Hibiscus sabdariffa L.): effects of drying temperature and brewing conditions on Total soluble solid, phenolic content, antioxidant capacity and sensory quality. Beverages. (2020) 6:2. doi: 10.3390\/beverages6010002 CrossRef Full Text | Google Scholar 105. Aykın-Dinçer, E, Güngör, KK, Çağlar, E, and Erbaş, M. The use of beetroot extract and extract powder in sausages as natural food colorant. Int J Food Eng. (2021) 17:75–82. doi: 10.1515\/ijfe-2019-0052 CrossRef Full Text | Google Scholar 106. Aguilar, F, Crebelli, R, Di Domenico, A, Dusemund, B, Frutos, MJ, Galtier, P, et al. Safety of the proposed extension of use of beetroot red (E 162) in foods for special medical purposes in young children. EFSA J. (2016) 14:1–13. doi: 10.2903\/j.efsa.2016.4487 CrossRef Full Text | Google Scholar 109. Shan, B, Cai, YZ, Sun, M, and Corke, H. Antioxidant capacity of 26 spice extracts and characterization of their phenolic constituents. J Agric Food Chem. (2005) 53:7749–59. doi: 10.1021\/jf051513y CrossRef Full Text | Google Scholar 110. Khodaei, N, Houde, M, Bayen, S, and Karboune, S. Exploring the synergistic effects of essential oil and plant extract combinations to extend the shelf life and the sensory acceptance of meat products: multi-antioxidant systems. J Food Sci Technol. (2023) 60:679–91. doi: 10.1007\/s13197-022-05653-4 CrossRef Full Text | Google Scholar 111. Kyriakoudi, A, Spanidi, E, Mourtzinos, I, and Gardikis, K. Innovative delivery systems loaded with plant bioactive ingredients: formulation approaches and applications. Plan Theory. (2021) 10:1238. doi: 10.3390\/plants10061238 CrossRef Full Text | Google Scholar 112. Karam, R, Karboune, S, St-Louis, R, and Kermasha, S. Lipase-catalyzed acidolysis of fish liver oil with dihydroxyphenylacetic acid in organic solvent media. Process Biochem. (2009) 44:1193–9.doi: 10.1016\/j.procbio.2009.06.004 CrossRef Full Text | Google Scholar 113. Nishad, J. Chapter 5—stability of plant extracts In: SA Mir, A Manickavasagan, and MA Shah, editors. Plant extracts: Applications in the food industry. London, United Kingdom: Elsevier Inc (2022). 89–126. Google Scholar 114. Kiokias, S, Varzakas, T, and Oreopoulou, V. In vitro activity of vitamins, flavonoids, and natural phenolic antioxidants against the oxidative deterioration of oil-based systems. Crit Rev Food Sci Nutr. (2008) 48:78–93. doi: 10.1080\/10408390601079975 CrossRef Full Text | Google Scholar 115. Soares, S, Kohl, S, Thalmann, S, Mateus, N, Meyerhof, W, and De Freitas, V. Different phenolic compounds activate distinct human bitter taste receptors. J Agric Food Chem. (2013) 61:1525–33. doi: 10.1021\/jf304198k CrossRef Full Text | Google Scholar 116. Stelmasiak, A, Damaziak, K, and Wierzbicka, A. The impact of low salt level and addition of selected herb extracts on the quality of smoked pork. Anim Sci Pap Rep. (2021) 39:47–60. Google Scholar 117. Moghadam, RM, Ariaii, P, and Ahmady, M. The effect of microencapsulated extract of pennyroyal (Mentha pulegium. L) on the physicochemical, sensory, and viability of probiotic bacteria in yogurt. Food Measure. (2021) 15:2625–36. doi: 10.1007\/s11694-021-00849-2 CrossRef Full Text | Google Scholar 118. Bounimi, S, and Chebli, B. Synergistic antioxidant activity of three essential oils of Lamiacea family from Morocco. Appl J Environ Eng Sci. (2017) 3:195–200. doi: 10.48422\/IMIST.PRSM\/ajees-v3i2.9299 CrossRef Full Text | Google Scholar 119. Viana da Silva, M, Santos, MRC, Alves Silva, IR, Macedo Viana, EB, Dos Anjos, DA, Santos, IA, et al. Synthetic and natural antioxidants used in the oxidative stability of edible oils: an overview. Food Rev Int. (2022) 38:349–72. doi: 10.1080\/87559129.2020.1869775 CrossRef Full Text | Google Scholar 120. Guo, Q, Gao, S, Sun, Y, Gao, Y, Wang, X, and Zhang, Z. Antioxidant efficacy of rosemary ethanol extract in palm oil during frying and accelerated storage. Ind Crop Prod. (2016) 94:82–8. doi: 10.1016\/j.indcrop.2016.08.032 CrossRef Full Text | Google Scholar 121. Taha, E, Abd-Elkarim, N, and Ahmed, Z. Date seed oil as a potential natural additive to improve oxidative stability of edible vegetable oils. Egypt J Food Sci. (2019) 47:105–13. doi: 10.21608\/ejfs.2019.13050.1007 CrossRef Full Text | Google Scholar 122. Soleimani, H, Barzegar, M, Sahari, MA, and Naghdi, BH. An investigation on the antioxidant activities of Hyssopus officinalis L. and Echinacea purpurea L. plant extracts in oil model system. J Med Plants. (2011) 10:61–72. Google Scholar 123. Casarotti, SN, and Jorge, N. Antioxidant activity of rosemary extract in soybean oil under Thermoxidation. J Food Process Preserv. (2014) 38:136–45. doi: 10.1111\/j.1745-4549.2012.00755.x CrossRef Full Text | Google Scholar 124. Chammem, N, Saoudi, S, Sifaoui, I, Sifi, S, de Person, M, Abderraba, M, et al. Improvement of vegetable oils quality in frying conditions by adding rosemary extract. Ind Crop Prod. (2015) 74:592–9. doi: 10.1016\/j.indcrop.2015.05.054 CrossRef Full Text | Google Scholar 125. Pourashouri, P, Shabanpour, B, Zeinab Noori, HA, and Zahiri, S. Antioxidant effects of wild Pistacia (P. atlantica), rosemary (Rosmarinus officinalis L.) and green tea extracts on the lipid oxidation rate of fish oil-in-water emulsions. Turkish J Fish Aquat Sci. (2016) 16:729–737. doi: 10.4194\/1303-2712-v16_3_27 CrossRef Full Text | Google Scholar 126. Baştürk, A, Ceylan, MM, Çavuş, M, Boran, G, and Javidipour, I. Effects of some herbal extracts on oxidative stability of corn oil under accelerated oxidation conditions in comparison with some commonly used antioxidants. Lebensm Wiss Technol. (2018) 89:358–64. doi: 10.1016\/j.lwt.2017.11.005 CrossRef Full Text | Google Scholar 127. Wang, Y, Fu, S, Wang, S, Yang, D, Wu, YS, and Chen, Y. Effects of a natural antioxidant, polyphenol-rich rosemary (Rosmarinus officinalis L.) extract, on lipid stability of plant-derived omega-3 fatty-acid rich oil. Food. Sci Technol. (2018) 89:210–6. doi: 10.1016\/j.lwt.2017.10.055 CrossRef Full Text | Google Scholar 128. Triantaphyllou, K, Blekas, G, and Boskou, D. Antioxidative properties of water extracts obtained from herbs of the species Lamiaceae. Int J Food Sci Nutr. (2001) 52:313–7. doi: 10.1080\/09637480120057512 PubMed Abstract | CrossRef Full Text | Google Scholar 129. de Conto, LC, Porto Oliveira, RS, Pereira Martin, LG, Chang, YK, and Steel, CJ. Effects of the addition of microencapsulated omega-3 and rosemary extract on the technological and sensory quality of white pan bread. Lebensm Wiss Technol. (2012) 45:103–9. doi: 10.1016\/j.lwt.2011.07.027 CrossRef Full Text | Google Scholar 130. Younes, M, Aggett, P, Aguilar, F, Crebelli, R, Dusemund, B, Filipič, M, et al. Refined exposure assessment of extracts of rosemary (E 392) from its use as food additive. EFSA J. (2018) 16:25. doi: 10.2903\/j.efsa.2018.5373 PubMed Abstract | CrossRef Full Text | Google Scholar 131. Reddy, V, Urooj, A, and Kumar, A. Evaluation of antioxidant activity of some plant extracts and their application in biscuits. Food Chem. (2005) 90:317–21. doi: 10.1016\/j.foodchem.2004.05.038 CrossRef Full Text | Google Scholar 132. Abdel-Moemin, AR. Effect of Roselle calyces extract on the chemical and sensory properties of functional cupcakes. Food Sci Human Wellness. (2016) 5:230–7. doi: 10.1016\/j.fshw.2016.07.003 CrossRef Full Text | Google Scholar 133. Caleja, C, Barros, L, Antonio, AL, Oliveira, MBPP, and Ferreira, ICFR. A comparative study between natural and synthetic antioxidants: evaluation of their performance after incorporation into biscuits. Food Chem. (2017) 216:342–6. doi: 10.1016\/j.foodchem.2016.08.075 CrossRef Full Text | Google Scholar 134. Pasukamonset, P, Pumalee, T, Sanguansuk, N, Chumyen, C, Wongvasu, P, Adisakwattana, S, et al. Physicochemical, antioxidant and sensory characteristics of sponge cakes fortified with Clitoria ternatea extract. J Food Sci Technol. (2018) 55:2881–9. doi: 10.1007\/s13197-018-3204-0 CrossRef Full Text | Google Scholar 135. Dordoni, R, Duserm Garrido, G, Marinoni, L, Torri, L, Piochi, M, and Spigno, G. Enrichment of whole wheat cocoa biscuits with encapsulated grape skin extract. Int J Food Sci. (2019) 2019:1–11. doi: 10.1155\/2019\/9161840 PubMed Abstract | CrossRef Full Text | Google Scholar 136. Kozlowska, M, Zbikowska, A, Marciniak-Lukasiak, K, and Kowalska, M. Herbal extracts incorporated into shortbread cookies: impact on color and fat quality of the cookies. Biomol Ther. (2019) 9:858. doi: 10.3390\/biom9120858 CrossRef Full Text | Google Scholar 137. Kozłowska, M, Laudy, AE, Przybył, J, Ziarno, M, and Majewska, E. Chemical composition and antibacterial activity of some medicinal plants from Lamiacea family. Acta Pol Pharm. (2015) 72:757–67. PubMed Abstract | Google Scholar 138. Cedola, A, Palermo, C, Centonze, D, Del Nobile, MA, and Conte, A. Characterization and bio-accessibility evaluation of olive leaf extract-enriched “Taralli”. Foods. (2020) 9:1268. doi: 10.3390\/foods9091268 CrossRef Full Text | Google Scholar 139. Shori, AB, Kee, LA, and Baba, AS. Total phenols, antioxidant activity and sensory evaluation of bread fortified with spearmint. Arab J Sci Eng. (2021) 46:5257–64. doi: 10.1007\/s13369-020-05012-5 CrossRef Full Text | Google Scholar 141. Pasqualone, A, Bianco, AM, Paradiso, VM, Summo, C, Gambacorta, G, and Caponio, F. Physico-chemical, sensory and volatile profiles of biscuits enriched with grape marc extract. Food Res Int. (2014) 65:385–93. doi: 10.1016\/j.foodres.2014.07.014 CrossRef Full Text | Google Scholar 142. Nedamani, AR. The antioxidant activity of lycopene and chlorophyll oleoresin and phenol stability of Berberis vulgaris extracts in cupcake formulation running title: the natural colered cakes. Iran Food Sci Technol Res J. (2021) 17:39–52. doi: 10.22067\/ifstrj.v17i3.76755 CrossRef Full Text | Google Scholar 143. Hao, M, and Beta, T. Development of Chinese steamed bread enriched in bioactive compounds from barley hull and flaxseed hull extracts. Food Chem. (2012) 133:1320–5. doi: 10.1016\/j.foodchem.2012.02.008 CrossRef Full Text | Google Scholar 144. Gawlik-Dziki, U, Dziki, D, Baraniak, B, and Lin, R. The effect of simulated digestion in vitro on bioactivity of wheat bread with Tartary buckwheat flavones addition. Lebensm Wiss Technol. (2009) 42:137–43. doi: 10.1016\/j.lwt.2008.06.009 CrossRef Full Text | Google Scholar 145. Peng, X, Ma, J, Cheng, K, Jiang, Y, Chen, F, and Wang, M. The effects of grape seed extract fortification on the antioxidant activity and quality attributes of bread. Food Chem. (2010) 119:49–53. doi: 10.1016\/j.foodchem.2009.05.083 CrossRef Full Text | Google Scholar 146. Shori, AB, Yong, YS, and Baba, AS. Effects of medicinal plants extract enriched cheese with fish collagen on proteolysis and in vitro angiotensin-I converting enzyme inhibitory activity. J Food Sci Technol. (2022) 159:113218–6. doi: 10.1016\/j.lwt.2022.113218 CrossRef Full Text | Google Scholar 147. Zahid, MA, Choi, JY, Seo, J, Parvin, R, Ko, J, and Yang, H. Effects of clove extract on oxidative stability and sensory attributes in cooked beef patties at refrigerated storage. Meat Sci. (2020) 161:107972. doi: 10.1016\/j.meatsci.2019.107972 PubMed Abstract | CrossRef Full Text | Google Scholar 148. Das, AK, Rajkumar, V, Verma, AK, and Swarup, D. Moringa oleiferia leaves extract: a natural antioxidant for retarding lipid peroxidation in cooked goat meat patties. Int J Food Sci Technol. (2012) 47:585–91. doi: 10.1111\/j.1365-2621.2011.02881.x CrossRef Full Text | Google Scholar 149. Park, HJ, Park, K, and Yoon, KS. Effect of rooibos (Aspalathus linearis) on growth control of Clostridium perfringens and lipid oxidation of ready-to-eat Jokbal (Pig's trotters). J Food Sci. (2014) 79:M2507–15. doi: 10.1111\/1750-3841.12701 PubMed Abstract | CrossRef Full Text | Google Scholar 150. Villalobos-Delgado, LH, Caro, I, Blanco, C, Bodas, R, Andrés, S, Giráldez, FJ, et al. Effect of the addition of hop (infusion or powder) on the oxidative stability of lean lamb patties during storage. Small Rumin Res. (2015) 125:73–80. doi: 10.1016\/j.smallrumres.2015.02.008 CrossRef Full Text | Google Scholar 151. Jin, S, Ha, S, Hur, S, and Choi, J. Effect of various herbal medicine extracts on the Physico-chemical properties of emulsion-type pork sausage. J Food Nutr Res. (2015) 3:290–6. doi: 10.12691\/jfnr-3-5-1 CrossRef Full Text | Google Scholar 152. Lee, CW, Choi, HM, Kim, SY, Lee, JR, Kim, HJ, Jo, C, et al. Influence of Perilla frutescens var. acuta water extract on the shelf life and physicochemical qualities of cooked beef patties. Korean J Food Sci Anim Resour. (2015) 35:389–97. doi: 10.5851\/kosfa.2015.35.3.389 CrossRef Full Text | Google Scholar 153. de Almeida, PL, de Lima, SN, Costa, LL, de Oliveira, CC, Damasceno, KA, dos Santos, BA, et al. Effect of jabuticaba peel extract on lipid oxidation, microbial stability and sensory properties of Bologna-type sausages during refrigerated storage. Meat Sci. (2015) 110:9–14. doi: 10.1016\/j.meatsci.2015.06.012 CrossRef Full Text | Google Scholar 154. Latoch, A, and Stasiak, DM. Effect of water extract of Urtica dioica L. on lipid oxidation and color of cooked pork sausage. J Food Process Preserv. (2017) 41:1–7. doi: 10.1111\/jfpp.12818 CrossRef Full Text | Google Scholar 155. Zhang, H, Wu, J, and Guo, X. Effects of antimicrobial and antioxidant activities of spice extracts on raw chicken meat quality. Food Sci Human Wellness. (2016) 5:39–48. doi: 10.1016\/j.fshw.2015.11.003 CrossRef Full Text | Google Scholar 156. Azman, NAM, Skowyra, M, Muhammad, K, Gallego, MG, and Almajano, MP. Evaluation of the antioxidant activity of Betula pendula leaves extract and its effects on model foods. Pharm Biol. (2017) 55:912–9. doi: 10.1080\/13880209.2017.1282528 CrossRef Full Text | Google Scholar 157. Hęś, M, and Gramza-Michałowska, A. Effect of plant extracts on lipid oxidation and changes in nutritive value of protein in frozen-stored meat products. J Food Process Preserv. (2017) 41:1–9. doi: 10.1111\/jfpp.12989 CrossRef Full Text | Google Scholar 158. Zhao, Y, Kong, H, Zhang, X, Hu, X, and Wang, M. The effect of Perilla (Perilla frutescens) leaf extracts on the quality of surimi fish balls. Food Sci Nutr. (2019) 7:2083–90. doi: 10.1002\/fsn3.1049 CrossRef Full Text | Google Scholar 159. de Carvalho, FAL, Munekata, PES, Lopes de Oliveira, A, Pateiro, M, Domínguez, R, Trindade, MA, et al. Turmeric (Curcuma longa L.) extract on oxidative stability, physicochemical and sensory properties of fresh lamb sausage with fat replacement by tiger nut (Cyperus esculentus L.) oil. Food Res Int. (2020) 136:109487. doi: 10.1016\/j.foodres.2020.109487 CrossRef Full Text | Google Scholar 160. Cunha, LCM, Monteiro, MLG, Lorenzo, JM, Munekata, PES, Muchenje, V, de Carvalho, FAL, et al. Natural antioxidants in processing and storage stability of sheep and goat meat products. Food Res Int. (2018) 111:379–90. doi: 10.1016\/j.foodres.2018.05.041 CrossRef Full Text | Google Scholar 161. Zhang, M, Yan, W, Wang, D, and Xu, W. Effect of myoglobin, hemin, and ferric iron on quality of chicken breast meat. Anim Biosci. (2021) 34:1382–91. doi: 10.5713\/ajas.20.0529 CrossRef Full Text | Google Scholar 162. Grunwald, EW, and Richards, MP. Studies with myoglobin variants indicate that released hemin is the primary promoter of lipid oxidation in washed fish muscle. J Agric Food Chem. (2006) 54:4452–60. doi: 10.1021\/jf0603228 CrossRef Full Text | Google Scholar 163. Mitsumoto, M, O’Grady, MN, Kerry, JP, and Joe, BD. Addition of tea catechins and vitamin C on sensory evaluation, colour and lipid stability during chilled storage in cooked or raw beef and chicken patties. Meat Sci. (2005) 69:773–9. doi: 10.1016\/j.meatsci.2004.11.010 PubMed Abstract | CrossRef Full Text | Google Scholar 164. Mansour, EH, and Khalil, AH. Evaluation of antioxidant activity of some plant extracts and their application to ground beef patties. Food Chem. (2000) 69:135–41. doi: 10.1016\/S0308-8146(99)00234-4 CrossRef Full Text | Google Scholar 165. Özalp Özen, B, and Soyer, A. Effect of plant extracts on lipid and protein oxidation of mackerel (Scomber scombrus) mince during frozen storage. J Food Sci Technol. (2018) 55:120–7. doi: 10.1007\/s13197-017-2847-6 PubMed Abstract | CrossRef Full Text | Google Scholar 166. Serdaroglu, M, and Felekoglu, E. Effects of using rosemary extract and onion juice on oxidative stability of sardine (Sardina pilchardus) mince. J Food Qual. (2005) 28:109–20. doi: 10.1111\/j.1745-4557.2005.00016.x CrossRef Full Text | Google Scholar 167. Baldin, JC, Munekata, PES, Michelin, EC, Polizer, YJ, Silva, PM, Canan, TM, et al. Effect of microencapsulated Jabuticaba (Myrciaria cauliflora) extract on quality and storage stability of mortadella sausage. Food Res Int. (2018) 108:551–7. doi: 10.1016\/j.foodres.2018.03.076 CrossRef Full Text | Google Scholar 168. Jones, M, Hoffman, LC, and Muller, M. Effect of rooibos extract (Aspalathus linearis) on lipid oxidation over time and the sensory analysis of blesbok (Damaliscus pygargus phillipsi) and springbok (Antidorcas marsupialis) droëwors. Meat Sci. (2015) 103:54–60. doi: 10.1016\/j.meatsci.2014.12.012 CrossRef Full Text | Google Scholar 169. Aminzare, M, Tajik, H, Aliakbarlu, J, Hashemi, M, and Raeisi, M. Effect of cinnamon essential oil and grape seed extract as functional-natural additives in the production of cooked sausage-impact on microbiological, physicochemical, lipid oxidation and sensory aspects, and fate of inoculated Clostridium perfringens. J Food Saf. (2018) 38:e12459. doi: 10.1111\/jfs.12459 CrossRef Full Text | Google Scholar 170. Mantzourani, I, Daoutidou, M, Dasenaki, M, Nikolaou, A, Alexopoulos, A, Terpou, A, et al. Plant extract and essential oil application against food-borne pathogens in raw pork meat. Foods. (2022) 11:861. doi: 10.3390\/foods11060861 CrossRef Full Text | Google Scholar 171. Shrikhande, AJ, Race, EJ, Wightman, JD, and Sambueso, RD (2000). Process for extraction, purification and enrichment of polyphenolic substances from whole grapes, grape seeds and grape pomace. United States patent US 6544581B1. Google Scholar 172. Martínez-Graciá, C, González-Bermúdez, CA, Cabellero-Valcárcel, AM, Santaella-Pascual, M, and Frontela-Saseta, C. Use of herbs and spices for food preservation: advantages and limitations. Curr Opin Food Sci. (2015) 6:38–43. doi: 10.1016\/j.cofs.2015.11.011 CrossRef Full Text | Google Scholar 173. Beya, MM, Netzel, ME, Sultanbawa, Y, Smyth, H, and Hoffman, LC. Plant-based phenolic molecules as natural preservatives in comminuted meats: a review. Antioxidants. (2021) 10:263. doi: 10.3390\/antiox10020263 CrossRef Full Text | Google Scholar 174. Bahadoran, Z, Mirmiran, P, Jeddi, S, Azizi, F, Ghasemi, A, and Hadaegh, F. Nitrate and nitrite content of vegetables, fruits, grains, legumes, dairy products, meats and processed meats. J Food Compos Anal. (2016) 51:93–105. doi: 10.1016\/j.jfca.2016.06.006 CrossRef Full Text | Google Scholar 175. Awad, AM, Kumar, P, Ismail-Fitry, MR, Jusoh, S, Ab Aziz, MF, and Sazili, AQ. Overview of plant extracts as natural preservatives in meat. J Food Process Preserv. (2022) 46:1–27. doi: 10.1111\/jfpp.16796 CrossRef Full Text | Google Scholar 176. Bačák, M. Spices and their industrial alternatives [in Czech: Koření a jeho průmyslové alternativy]. Potravinářská revue. (2011) 3:68–9. Google Scholar 177. Fierascu, RC, Ortan, A, Fierascu, IC, and Fierascu, I. In vitro and in vivo evaluation of antioxidant properties of wild-growing plants. A short review. Curr Opin Food Sci. (2018) 24:1–8. doi: 10.1016\/j.cofs.2018.08.006 CrossRef Full Text | Google Scholar 178. Nuraeni, E, Arief, II, and Soenarno, MS. Characteristics of probiotic koumiss from goat milk with addition of roselle extract (hibiscus sabdariffa Linn). J Indones Trop Anim Agric. (2015) 39:117–25. doi: 10.14710\/jitaa.39.2.117-125 CrossRef Full Text | Google Scholar 179. Mahajan, D, Bhat, ZF, and Kumar, S. Pine needles (Cedrus deodara (Roxb.) loud.) extract as a novel preservative in cheese. Food Packag Shelf Life. (2016) 7:20–5. doi: 10.1016\/j.fpsl.2016.01.001 CrossRef Full Text | Google Scholar 180. Lee, NK, Jeewanthi, RKC, Park, EH, and Paik, HD. Short communication: physicochemical and antioxidant properties of Cheddar-type cheese fortified with Inula britannica extract. J Dairy Sci. (2016) 99:83–8. doi: 10.3168\/jds.2015-9935 CrossRef Full Text | Google Scholar 181. Rozan, M, Darwish, AZ, and Bayomy, H. Effect of Roselle extract (Hibiscus sabdariffa) on stability of carotenoids, bioactive compounds and antioxidant activity of yoghurt fortified with carrot juice (Daucus carota L.). World J. Dairy Food Sci. (2017) 12:94–101. doi: 10.5829\/idosi.wjdfs.2017.94.101 CrossRef Full Text | Google Scholar 182. Ai-Musawi, AT, Karm, IFA, and Abu-Almaaly, RA. Effect of rose demascena extracts in prolonging the duration of the preservation of yoghurt. Indian J Public Health Res Dev. (2018) 9:923–65. doi: 10.5958\/0976-5506.2018.01259.7 CrossRef Full Text | Google Scholar 183. Wihansah, RRS, Arief, II, and Batubara, I. Anti-diabetic potency and characteristics of probiotic goat-Milk yogurt supplemented with Roselle extract during cold storage. Trop Anim Sci J. (2018) 41:191–9. doi: 10.5398\/tasj.2018.41.3.191 CrossRef Full Text | Google Scholar 184. El-Messery, TM, El-Said, MM, Shahein, NM, El-Din, HMF, and Farrag, A. Functional yoghurt supplemented with extract Orange Peel encapsulated using Coacervation technique. Pak J Biol Sci. (2019) 22:231–8. doi: 10.3923\/pjbs.2019.231.238 CrossRef Full Text | Google Scholar 185. Hasneen, DF, Zaki, NL, Abbas, MS, Soliman, AS, Ashoush, IS, and Fayed, AE. Comparative evaluation of some herbs and their suitability for skimmed milk yoghurt and cast Kariesh cheese fortification as functional foods. Ann Agric Sci. (2020) 65:6–12. doi: 10.1016\/j.aoas.2020.05.001 CrossRef Full Text | Google Scholar 186. Hong, H, Lim, JM, Kothari, D, Kwon, SH, Kwon, HC, Han, S, et al. Antioxidant properties and diet-related α-glucosidase and lipase inhibitory activities of yogurt supplemented with safflower (Carthamus tinctorius L.) petal extract. Korean J Food Sci Anim Resour. (2021) 41:122–34. doi: 10.5851\/kosfa.2020.e88 PubMed Abstract | CrossRef Full Text | Google Scholar 187. Ahmed, IAM, Alqah, HAS, Saleh, A, Al-Juhaimi, FY, Babiker, EE, Ghafoor, K, et al. Physicochemical quality attributes and antioxidant properties of set-type yogurt fortified with argel (Solenostemma argel Hayne) leaf extract. Lebensm Wiss Technol. (2021) 137:110389. doi: 10.1016\/j.lwt.2020.110389 CrossRef Full Text | Google Scholar 188. Salehi, M, Ghorbani, M, Sadeghi Mahoonk, A, and Khomeiri, M. Physicochemical, antioxidant and sensory properties of yogurt fortified with common purslane (Portulaca oleracea) extract. Food Measure. (2021) 15:4288–96. doi: 10.1007\/s11694-021-00949-z CrossRef Full Text | Google Scholar 189. Tang, PL, Cham, XY, Hou, X, and Deng, J. Potential use of waste cinnamon leaves in stirred yogurt fortification. Food Biosci. (2022) 48:101838. doi: 10.1016\/j.fbio.2022.101838 CrossRef Full Text | Google Scholar 190. Gad, AS, and El-Salam, MHA. The antioxidant properties of skim milk supplemented with rosemary and green tea extracts in response to pasteurisation, homogenisation and the addition of salts. Int J Dairy Technol. (2010) 63:349–55. doi: 10.1111\/j.1471-0307.2010.00585.x CrossRef Full Text | Google Scholar 191. Yoon, HJ, Lee, KA, Lee, JH, Jin, HJ, Kim, HJ, Kim, K, et al. Effect of fermentation by Bacillus subtilis on antioxidant and cytotoxic activities of black rice bran. Int J Food Sci Technol. (2015) 50:612–8. doi: 10.1111\/ijfs.12693 CrossRef Full Text | Google Scholar 192. O’Connell, JE, and Fox, PF. Significance and applications of phenolic compounds in the production and quality of milk and dairy products: a review. Int Dairy J. (2001) 11:103–20. doi: 10.1016\/S0958-6946(01)00033-4 CrossRef Full Text | Google Scholar 194. Giroux, HJ, De Grandpré, G, Fustier, P, Champagne, CP, St-Gelais, D, Lacroix, M, et al. Production and characterization of Cheddar-type cheese enriched with green tea extract. Dairy Sci Technol. (2013) 93:241–54. doi: 10.1007\/s13594-013-0119-4 CrossRef Full Text | Google Scholar 195. Han, J, Britten, M, St-Gelais, D, Champagne, CP, Fustier, P, Salmieri, S, et al. Polyphenolic compounds as functional ingredients in cheese. Food Chem. (2011) 124:1589–94. doi: 10.1016\/j.foodchem.2010.08.021 CrossRef Full Text | Google Scholar 196. Masmoudi, M, Ammar, I, Ghribi, H, and Attia, H. Physicochemical, radical scavenging activity and sensory properties of a soft cheese fortified with Arbutus unedo L. extract. Food Biosci. (2020) 35:100579. doi: 10.1016\/j.fbio.2020.100579 CrossRef Full Text | Google Scholar 197. Ramos, LR, Santos, JS, Daguer, H, Valese, AC, Cruz, AG, and Granato, D. Analytical optimization of a phenolic-rich herbal extract and supplementation in fermented milk containing sweet potato pulp. Food Chem. (2017) 221:950–8. doi: 10.1016\/j.foodchem.2016.11.069 CrossRef Full Text | Google Scholar 198. Amirdivani, S, and Baba, AS. Changes in yogurt fermentation characteristics, and antioxidant potential and in vitro inhibition of angiotensin-1 converting enzyme upon the inclusion of peppermint, dill and basil. Lebensm Wiss Technol. (2011) 44:1458–64. doi: 10.1016\/j.lwt.2011.01.019 CrossRef Full Text | Google Scholar 199. Perna, A, Intaglietta, I, Simonetti, A, and Gambacorta, E. Antioxidant activity of yogurt made from milk characterized by different casein haplotypes and fortified with chestnut and sulla honeys. J Dairy Sci. (2014) 97:6662–70. doi: 10.3168\/jds.2013-7843 CrossRef Full Text | Google Scholar 200. Srivastava, P, Prasad, SGM, Mohd, NA, and Prasad, M. Analysis of antioxidant activity of herbal yoghurt prepared from different milk. Pharma Innov J. (2015) 4:15–20. Google Scholar 201. Abass, AA, Al-Magsoosi, MJN, Kadhim, WA, Mustafa, R, Ibrahim, SA, Aljdaimi, AI, et al. Antimicrobial effect of red Roselle (hibiscus sabdariffa) against different types of oral bacteria. J Med Life. (2022) 15:89–97. doi: 10.25122\/jmL-2021-0184 PubMed Abstract | CrossRef Full Text | Google Scholar 202. Jabeur, I, Pereira, E, Barros, L, Calhelha, RC, Soković, M, Oliveira, MBPP, et al. Hibiscus sabdariffa L. as a source of nutrients, bioactive compounds and colouring agents. Food Res Int. (2017) 100:717–23. doi: 10.1016\/j.foodres.2017.07.073 CrossRef Full Text | Google Scholar 203. Shruthi, VH, Ramachandra, CT, Nidoni, U, Hiregoudar, S, Naik, N, and Kurubar, AR. Roselle (hibiscus sabdariffa L.) as a source of natural colour: a review. Plant Arch. (2016) 16:515–22. Google Scholar 204. Oancea, S. A review of the current knowledge of thermal stability of anthocyanins and approaches to their stabilization to heat. Antioxidants. (2021) 10:1337. doi: 10.3390\/antiox10091337 CrossRef Full Text | Google Scholar 205. Nguyen, Q, Dang, T, Nguyen, T, Nguyen, T, and Nguyen, N. Microencapsulation of roselle (Hibiscus sabdariffa L.) anthocyanins: effects of different carriers on selected physicochemical properties and antioxidant activities of spray-dried and freeze-dried powder. Int J Food Prop. (2022) 25:359–74. doi: 10.1080\/10942912.2022.2044846 CrossRef Full Text | Google Scholar 206. E392. Extracts of rosemary [internet]. Bragança: Centro de Investigação de Montanha (2019). Google Scholar 207. Pluháčková, H, Gregor, T, Boško, R, Běláková, S, Svoboda, Z, and Benešová, K. Fortification of beer with extracts of the selected Czech medicinal herbs and plants. Kvasný průmysl. (2020) 66:314–9. doi: 10.18832\/kp2019.66.314 CrossRef Full Text | Google Scholar 208. Mgaya Kilima, B, Remberg, SF, Chove, BE, and Wicklund, T. Physio-chemical, mineral composition and antioxidant properties of Roselle (Hibiscus sabdariffa L.) extract blended with tropical fruit juices. Afr J Food Agric Nutr Dev. (2014) 14:8963–78. doi: 10.18697\/ajfand.63.13475 CrossRef Full Text | Google Scholar 209. Shiradhonkar, R, Dukare, A, Jawalekar, K, Magar, P, and Jadhav, H. Fortification of wine with herbal extracts: production, evaluation and therapeutic applications of such fortified wines. IOSRJESTFT. (2014) 8:09–14. doi: 10.9790\/2402-08310914 CrossRef Full Text | Google Scholar 210. Ivanišová, E, Frančáková, H, Ritschlová, P, Dráb, Š, Solgajová, M, and Tokár, M. Biological activity of apple juice enriched by herbal extracts. J Microbiol Biotechnol Food Sci. (2015) 4:73. doi: 10.15414\/jmbfs.2015.4.special3.69-73 CrossRef Full Text | Google Scholar 211. Tamer, CE, Yekeler, FZ, Çopur, ÖU, İncedayi, B, and Suna, S. A study of fortification of lemonade with herbal extracts. Cienc Tecnol Aliment. (2017) 37:45–51. doi: 10.1590\/1678-457x.06016 CrossRef Full Text | Google Scholar 212. Sarkar, A, and Singhal, A. Development of health functional wine produced from Emblica officinalis and Phyllanthus niruri and a comparative study of them over commercial wine. Int J Fermented Foods. (2018) 7:119–24. doi: 10.30954\/2321-712X.12.2018.7 CrossRef Full Text | Google Scholar 213. Guglielmotti, M, Passaghe, P, and Buiatti, S. Use of olive (Olea europaea L.) leaves as beer ingredient, and their influence on beer chemical composition and antioxidant activity. J Food Sci. (2020) 85:2278–85. doi: 10.1111\/1750-3841.15318 CrossRef Full Text | Google Scholar 214. Egea, T, Signorini, MA, Bruschi, P, Rivera, D, Obón, C, Alcaraz, F, et al. Spirits and liqueurs in European traditional medicine: their history and ethnobotany in Tuscany and Bologna (Italy). J Ethnopharmacol. (2015) 175:241–55. doi: 10.1016\/j.jep.2015.08.053 CrossRef Full Text | Google Scholar 215. Martínez-Francés, V, Rivera, D, Obon, C, Alcaraz, F, and Ríos, S. Medicinal plants in traditional herbal wines and liquors in the east of Spain and the Balearic Islands. Front Pharmacol. (2021) 12:713414. doi: 10.3389\/fphar.2021.713414 CrossRef Full Text | Google Scholar 216. Purkait, T, and Pandey, S. Development, physicochemical characterization and sensory evaluation of a red wine using Roselle (hibiscus sabdariffa) and peppermint (Mentha Piperita L.) extract. Med Legal Update. (2020) 20:1410–5. doi: 10.37506\/mlu.v20i4.2021 CrossRef Full Text | Google Scholar 217. Sanchez-Bel, P, Romojaro, A, Egea, I, and Pretel, MT. Wild edible plants as potential antioxidant or nutritional supplements for beverages minimally processed. Lebensm Wiss Technol. (2015) 62:830–7. doi: 10.1016\/j.lwt.2014.06.017 CrossRef Full Text | Google Scholar 218. Арпуль, ОВ, Усатюк, ОМ, and Жукова, НВ. The use of plant material for enrichment of fresh juices by biologically active substances. TAPR. (2015) 3:22–5. doi: 10.15587\/2312-8372.2015.44052 CrossRef Full Text | Google Scholar 219. Skąpska, S, Marszałek, K, Woźniak, Ł, Zawada, K, and Wawer, I. Aronia dietary drinks fortified with selected herbal extracts preserved by thermal pasteurization and high pressure carbon dioxide. Lebensm Wiss Technol. (2017) 85:423–6. doi: 10.1016\/j.lwt.2016.11.001 CrossRef Full Text | Google Scholar 220. Fasoyiro, SB, Babalola, SO, and Owosibo, T. Chemical composition and sensory quality of fruit-Flavoured Roselle (Hibiscus sabdariffa) drinks. World J Agric Sci. (2005) 1:161–4. Google Scholar 221. Choi, MH, Kim, GH, and Lee, HS. Effects of ascorbic acid retention on juice color and pigment stability in blood orange (Citrus sinensis) juice during refrigerated storage. Food Res Int. (2002) 35:753–9. doi: 10.1016\/S0963-9969(02)00071-6 CrossRef Full Text | Google Scholar 222. Wibowo, S, Vervoort, L, Tomic, J, Santiago, JS, Lemmens, L, Panozzo, A, et al. Colour and carotenoid changes of pasteurised orange juice during storage. Food Chem. (2015) 171:330–40. doi: 10.1016\/j.foodchem.2014.09.007 CrossRef Full Text | Google Scholar 223. Bresson, J, Burlingame, B, Dean, T, Fairweather-Tait, S, Heinonen, M, Hirsch-Ernst, KI, et al. EFSA panel on die-tetic products, nutrition and allergies. Scientific opinion on the safety of cranberry extract powder as a novel food ingredient pursuant to regulation (EC) no. 258\/97. Off J Eur Union. (2017) 15:e04777. doi: 10.2903\/j.efsa.2017.4777 PubMed Abstract | CrossRef Full Text | Google Scholar 224. Aguilar, F, Crebelli, R, Dusemund, B, Galtier, P, Gott, D, Gundert-Remy, U, et al. Scientific opinion on the re-evaluation of anthocyanins (E 163) as a food additive. EFSA J. (2013) 11:1–51. doi: 10.2903\/j.efsa.2013.3145 CrossRef Full Text | Google Scholar 225. Stichting Food-Info. Anthocyanins and anthocyanidins [internet]. Renkum (Netherland): Food-Info (2021). Google Scholar 226. Younes, M, Aquilina, G, Castle, L, Engel, K, Fowler, P, Frutos Fernandez, MJ, et al. Re-evaluation of Quillaia ex-tract (E 999) as a food additive and safety of the proposed extension of use. EFSA J. (2019) 17:e05622. doi: 10.2903\/j.efsa.2019.5622 PubMed Abstract | CrossRef Full Text | Google Scholar 227. Mourtzinos, I, Prodromidis, P, Grigorakis, S, Makris, DP, Biliaderis, CG, and Moschakis, T. Natural food colorants derived from onion wastes: application in a yoghurt product. Electrophoresis. (2018) 39:1975–83. doi: 10.1002\/elps.201800073 CrossRef Full Text | Google Scholar 228. Sedlacek-Bassani, J, Grassi, TLM, Diniz, JCP, and Ponsano, EHG. Spices as natural additives for beef burger production. Cienc Tecnol Aliment. (2020) 40:817–21. doi: 10.1590\/fst.21019 CrossRef Full Text | Google Scholar 229. Pateiro, M, Domínguez, R, Bermúdez, R, Munekata, PES, Zhang, W, Gagaoua, M, et al. Antioxidant active packaging systems to extend the shelf life of sliced cooked ham. Curr Opin Food Sci. (2019) 1:24–30. doi: 10.1016\/j.crfs.2019.10.002 PubMed Abstract | CrossRef Full Text | Google Scholar 230. Delgado-Adámez, J, Bote, E, Parra-Testal, V, Martín, MJ, and Ramírez, R. Effect of the olive leaf extracts in vitro and in active packaging of sliced Iberian pork loin. Packag Technol Sci. (2016) 29:649–60. doi: 10.1002\/pts.2267 CrossRef Full Text | Google Scholar 231. Dutta, D, and Sit, N. Application of natural extracts as active ingredient in biopolymer based packaging systems. J Food Sci Technol. (2022) 59:1–15. doi: 10.1007\/s13197-022-05474-5 CrossRef Full Text | Google Scholar 232. Pattnaik, M, Pandey, P, Martin, GJO, Mishra, HN, and Ashokkumar, M. Innovative technologies for extraction and microencapsulation of bioactives from plant-based food waste and their applications in functional food development. Foods. (2021) 10:279. doi: 10.3390\/FOODS10020279 CrossRef Full Text | Google Scholar 233. Ananingsih, VK, Sharma, A, and Zhou, W. Green tea catechins during food processing and storage: a review on stability and detection. Food Res Int. (2013) 50:469–79. doi: 10.1016\/j.foodres.2011.03.004 CrossRef Full Text | Google Scholar 234. Constantin, OE, and Istrati, DI. Extraction, quantification and characterization techniques for anthocyanin com-pounds in various food matrices—a review. Horticulturae. (2022) 8:1084. doi: 10.3390\/horticulturae8111084 CrossRef Full Text | Google Scholar 235. Wrona, O, Rafińska, K, Możeński, C, and Buszewski, B. Supercritical fluid extraction of bioactive compounds from plant materials. J AOAC Int. (2017) 100:1624–35. doi: 10.5740\/jaoacint.17-0232 CrossRef Full Text | Google Scholar 236. Shirahigue, LD, and Ceccato-Antonini, SR. Agro-industrial wastes as sources of bioactive compounds for food and fermentation industries. Ciência rural. (2020) 50:50. doi: 10.1590\/0103-8478cr20190857 CrossRef Full Text | Google Scholar 237. Caesar, LK, and Cech, NB. Synergy and antagonism in natural product extracts: when 1 + 1 does not equal 2. Nat Prod Rep. (2019) 36:869–88. doi: 10.1039\/c9np00011a CrossRef Full Text | Google Scholar 238. Zhang, A, Sun, H, and Wang, X. Potentiating therapeutic effects by enhancing synergism based on active constituents from traditional medicine. Phytother Res. (2014) 28:526–33. doi: 10.1002\/ptr.5032 CrossRef Full Text | Google Scholar 239. Juranović Cindrić, I, Zeiner, M, Glamuzina, E, and Stingeder, G. Elemental characterisation of the medical herbs Salvia officinalis L. and Teucrium montanum L. grown in Croatia. Microchem J. (2013) 107:185–9. doi: 10.1016\/j.microc.2012.06.013 CrossRef Full Text | Google Scholar 240. European Commission. Official journal of the European Union: COMMISSION REGULATION (EC) no 629\/2008 of 2 July 2008 amending regulation (EC) no 1881\/2006 setting maximum levels for certain contaminants in foodstuffs. Off J Eur Union. (2008) 51:6–9. Google Scholar 241. Szymczycha-Madeja, A, Welna, M, and Zyrnicki, W. Multi-element analysis, bioavailability and fractionation of herbal tea products. J Braz Chem Soc. (2013) 24:777–87. doi: 10.5935\/0103-5053.20130102 CrossRef Full Text | Google Scholar 242. Arpadjan, S, Çelik, G, Taşkesen, S, and Güçer, Ş. Arsenic, cadmium and lead in medicinal herbs and their fractionation. Food Chem Toxicol. (2008) 46:2871–5. doi: 10.1016\/j.fct.2008.05.027 CrossRef Full Text | Google Scholar 243. Adie, GU, and Adekunle, A. Evaluation of potentially toxic metal contamination of local medicinal plants and extracts sold in Ibadan, Nigeria. Blacksmith Inst. J. Health Pollut. (2017) 7:23–9. doi: 10.5696\/2156-9614-7.14.23 PubMed Abstract | CrossRef Full Text | Google Scholar 244. Domínguez, R, Pateiro, M, Munekata, PES, McClements, DJ, and Lorenzo, JM. Encapsulation of bioactive phytochemicals in plant-based matrices and application as additives in meat and meat products. Molecules. (2021) 26:3984. doi: 10.3390\/molecules26133984 PubMed Abstract | CrossRef Full Text | Google Scholar 246. Lončarević, I, Pajin, B, Petrović, J, Zarić, D, Tumbas Šaponjac, V, Fišteš, A, et al. The physical properties, polyphenol content and sensory characteristics of white chocolate enriched with black tea extract. Hrana u zdravlju i bolesti: znanstveno-stručni časopis za nutricionizam i dijetetiku. (2019) 8:83–8. Google Scholar 247. Cao, H, Saroglu, O, Karadag, A, Diaconeasa, Z, Zoccatelli, G, Conte-Junior, CA, et al. Available technologies on improving the stability of polyphenols in food processing. Food Front. (2021) 2:109–39. doi: 10.1002\/fft2.65 CrossRef Full Text | Google Scholar 248. Jakobek, L. Interactions of polyphenols with carbohydrates, lipids and proteins. Food Chem. (2015) 175:556–67. doi: 10.1016\/j.foodchem.2014.12.013 CrossRef Full Text | Google Scholar 249. Viuda-Martos, M, Lucas-Gonzalez, R, Ballester-Costa, C, Pérez-Álvarez, JA, Muñoz, LA, and Fernández-López, J. Evaluation of protective effect of different dietary fibers on polyphenolic profile stability of maqui berry (Aristotelia chilensis (Molina) Stuntz) during in vitro gastrointestinal digestion. Food Funct. (2018) 9:573–84. doi: 10.1039\/C7FO01671A CrossRef Full Text | Google Scholar 250. Kamiloglu, S, Tomas, M, Ozdal, T, and Capanoglu, E. Effect of food matrix on the content and bioavailability of flavonoids. Trends Food Sci Technol. (2021) 117:15–33. doi: 10.1016\/j.tifs.2020.10.030 CrossRef Full Text | Google Scholar 251. Sęczyk, Ł, Gawlik-Dziki, U, and Świeca, M. Influence of phenolic-food matrix interactions on in vitro bioaccessibility of selected phenolic compounds and nutrients digestibility in fortified white bean paste. Antioxidants. (2021) 10:1825. doi: 10.3390\/antiox10111825 CrossRef Full Text | Google Scholar 252. Vitali Čepo, D, Radić, K, Turčić, P, Anić, D, Komar, B, and Šalov, M. Food (matrix) effects on bioaccessibility and intestinal permeability of major olive antioxidants. Foods. (2020) 9:1831. doi: 10.3390\/foods9121831 CrossRef Full Text | Google Scholar 253. Catalkaya, G, Venema, K, Lucini, L, Rocchetti, G, Delmas, D, Daglia, M, et al. Interaction of dietary polyphenols and gut microbiota: microbial metabolism of polyphenols, influence on the gut microbiota, and implications on host health. Food Front. (2020) 1:109–33. doi: 10.1002\/fft2.25 CrossRef Full Text | Google Scholar 254. Aubanel, M. The global state of botanical ingredients in food and botanical beverages [internet]. Grasse, France: Kerry Group plc (2020). Google Scholar 255. FMI. Plant-based food market outlook (2022–2023) [internet]. Newark: Future Market Insights, Inc (2022). Google Scholar","filter_flag":1}
{"title":"Discover the Top 10 Emission Reduction Technology Trends in 2023 - StartUs Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA","guidislink":false,"published":"Wed, 29 Mar 2023 21:10:01 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=29, tm_hour=21, tm_min=10, tm_sec=1, tm_wday=2, tm_yday=88, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5\" target=\"_blank\">Discover the Top 10 Emission Reduction Technology Trends in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Discover the Top 10 Emission Reduction Technology Trends in 2023 - StartUs Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5\" target=\"_blank\">Discover the Top 10 Emission Reduction Technology Trends in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","source.href":"https:\/\/www.startus-insights.com","source.title":"StartUs Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Climate change continues to dominate the global agenda, making large businesses reduce their carbon emissions and take a more proactive approach to emission management. This has led to a tech-driven approach that reduces the environmental impact of each product or service from the early stages of its development. At the same time, startups and scaleups develop technologies that reduce emission concentrations both at the source and in the atmosphere. These innovative technologies range from carbon offsetting and carbon capture technologies to bio-based solutions and emission monitoring. This data-driven research provides you with the top 10 global emission reduction technology trends in 2023 based on our research on 1680 startups and scaleups. Innovation Map outlines the Top 10 Emission Reduction Technology Trends & 20 Promising Startups For this in-depth research on the Top Emission Reduction Technology Trends & Startups, we analyzed a sample of 1680 global startups & scaleups. This data-driven research provides innovation intelligence that helps you improve strategic decision-making by giving you an overview of emerging technologies in the cleantech industry. In the Emission Reduction Technology Innovation Map, you get a comprehensive overview of the innovation trends & startups that impact your company. These insights are derived by working with our Big Data & Artificial Intelligence-powered StartUs Insights Discovery Platform, covering 3 790 000+ startups & scaleups globally. As the world’s largest resource for data on emerging companies, the SaaS platform enables you to identify relevant technologies and industry trends quickly & exhaustively. Tree Map reveals the Impact of the Top 10 Emission Reduction Technology Trends Based on the Emission Reduction Technology Innovation Map, the Tree Map below illustrates the impact of the Top 10 Emission Reduction Technology Trends in 2023. Startups and scaleups are developing solutions that utilize artificial intelligence (AI), big data, and the internet of things (IoT). Such solutions monitor and analyze emission data and offer insights into abatement strategies. Advances in electrification, green hydrogen, and bio-based fuels and polymers aid the transition from fossil fuel-based energy sources to low or zero-carbon alternatives. Further, startups develop carbon capture, utilization, and storage (CCUS) technologies as well as waste valorization solutions. They reduce the emission concentrations both in the atmosphere and at the source. Additionally, energy-efficient integrations reduce the use of energy, improving emission reduction. Top 10 Emission Reduction Technology Trends in 2023 Global Startup Heat Map covers 1680 Emission Reduction Technology Startups & Scaleups The Global Startup Heat Map below highlights the global distribution of the 1680 exemplary startups & scaleups that we analyzed for this research. Created through the StartUs Insights Discovery Platform, the Heat Map reveals high startup activity in the UK and the US, followed by the rest of Western Europe. Below, you get to meet 20 out of these 1680 promising startups & scaleups as well as the solutions they develop. These emission reduction technology startups are hand-picked based on criteria such as founding year, location, funding raised, & more. Depending on your specific needs, your top picks might look entirely different. Interested to explore all 1600+ emission reduction technology startups? Book Demo Top 10 Emission Reduction Technology Trends 1. Carbon Offsetting Carbon offsetting allows net-positive emitters to neutralize their greenhouse gas (GHG) emissions by trading negative carbon credits. The purchase of offset tokens facilitates the funding of initiatives that reduce carbon emissions, such as reforestation projects. Carbon-negative projects include technologies that capture GHG at industrial sites, improve soil management, and leverage energy-efficient integrations. This allows individuals, organizations, and governments to compensate for their polluting activities and mitigate them through the use of carbon credits. Further, cloud and blockchain-based bookkeeping improves the transparency of carbon credit records and makes them fully traceable. By offsetting emissions, individuals and organizations support projects that reduce or remove emissions from the atmosphere, mitigating the impact of climate change. Abatable simplifies Carbon Intelligence & Procurement UK-based startup Abatable offers a carbon intelligence and procurement platform. It aids the purchase of high-quality offsets for hard-to-abate emissions and maximizes the social impact of climate contributions. The platform provides insights into carbon projects and project developers by evaluating the fundamental factors contributing to the quality of carbon credits. Abatable continuously monitors every project to mitigate risks stemming from infrastructure, systems, and policies, ensuring the committed quality of carbon credits for organizations. Tanso offers Automated Carbon Accounting German startup Tanso automates carbon accounting and offers analytical solutions for effective emission reduction. The startup’s software simplifies data collection and emissions calculation through process automation, Excel\/CSV uploads, application programming interface (API), and a single-source-of-truth approach. Tanso’s single-source-of-truth approach and automated processes provide organizations with their carbon footprint and set clear reduction goals. This allows the planning of decarbonization initiatives, like carbon offsetting and benchmarking, against science-based target standards. 2. Artificial Intelligence AI allows organizations to collect and derive insights from massive amounts of data and identify patterns that humans fail or take time to recognize. Deeper insights into carbon emissions provide organizations with higher agility to adopt processes that cut down GHG emissions. This accelerates sustainable transformation and reduces expenses in a period of lower cash flow. AI-powered solutions also analyze the environmental impact of emissions and provide forecasts on storms, wildfires, and droughts, which enables better mitigation plans. Finally, AI aids the optimization of technologies related to carbon capture and renewable energy that improves efficiency and reduces emissions. AI Shading ensures Low Building Carbon Footprint AI Shading is a Canadian smart and green technology startup developing economical solutions that allow commercial buildings to achieve emission reduction targets. The startup’s solution also accomplishes this by regulating indoor temperatures through smart indoor shades, sensors, mobile apps, and energy management platforms. AI Shading equips building managers with energy-saving reports to better analyze energy usage and track emission reduction goals. GAIA provides Automated Emission Tracking Dutch startup GAIA leverages AI to simplify and automate GHG emissions reduction for businesses. The startup’s solution measures and tracks emissions by analyzing the data from the input of choice – manual, linked, or integrated. The AI algorithm utilizes the raw data to extrapolate measurements and approximate any missing data. This way, GAIA’s solution pinpoints main emission sources as well as customizes optimization roadmaps and emission reduction priorities. 3. Electrification Electrification aids in emission reduction by replacing traditional fossil fuel-powered energy sources with clean, electric energy sources such as wind and solar power. This emission reduction technology trend finds application in multiple industries such as transportation, building, manufacturing, mining, and more. Besides the lower carbon intensity of clean electricity, energy efficiency is a key benefit of electrification as electric equipment is more efficient than its fossil-powered alternatives. Additionally, electrification enables demand flexibility to provide a cost-effective mechanism to share the available energy. Thus, the widespread adoption of electrification across various industries significantly reduces global emissions. Zevx accelerates Fleet Electrification US-based startup Zevx develops battery electric power systems and data intelligence for e-mobility applications. The startup’s powertrains and power system products accelerate the electrification of commercial fleet assets. Zevx’s data intelligence services further improve operational efficiency and enhance the control framework for power usage. The solution, in this way, provides an integrated platform that allows fleet owners to decarbonize all operational components. Leaf Energy allows Seamless Energy Transition US-based startup Leaf Energy offers electrification solutions like electric vehicles (EVs) and charging stations. The startup’s technology provides high-speed charging through its proprietary terminal designs that are compatible with existing grid networks. Leaf Energy also provides a platform that enables real-time environmental tracking, which allows businesses to measure progress at every step of the energy transition. 4. Green Hydrogen Hydrogen fuel produced through the use of renewable energy in the electrolysis process emits no greenhouse gases and generates only water as a byproduct. The high calorific value and chemical properties of hydrogen offer utility across various industries, including transportation, heating, and industrial processes. In the transportation sector, green hydrogen fuel cells power vehicles, reducing emissions. It also serves as a key ingredient in the production of low-carbon chemicals and fuels, further decreasing emissions in these industries. As a clean energy source, green hydrogen reduces emissions and combats the effects of climate change. Azolla generates Fuel-cell Spec Green Hydrogen Canadian startup Azolla offers green hydrogen solutions for the power and transportation industries. The startup’s Biodrome technology utilizes a blend of bio-methanol and de-ionized water to generate fuel-cell spec hydrogen. The catalytic reformation of Azolla’s bio-methanol\/water blend produces low-carbon hydrogen production on-site. This enables the use of methanol as a hydrogen carrier, which is easier to transport, store, and handle than high-pressure hydrogen or ammonia. Faraday Fuels offers Solid Oxide Electrolyzers US-based cleantech startup Faraday Fuels develops a scalable, high-throughput solid oxide technology to make green hydrogen. The startup’s solid oxide electrolyzers feature tubular design and proprietary electrodes to ensure efficient and low-cost production of clean hydrogen. This hydrogen serves as fuel to facilitate deep decarbonization of emission-intensive industries like steel, chemical, and aviation. 5. Carbon Capture, Utilization, & Storage CCUS technologies capture carbon dioxide emissions and use them to make things or permanently store them thousands of feet below the surface. Startups utilize a range of technologies, some using membranes and others using solvents, to capture CO2. The captured carbon dioxide is then concentrated either chemically or in biological processes, which further serves as a feedstock or is simply stored underground. By preventing the CO2 from industrial operations from reaching the atmosphere, CCUS stabilizes CO2 levels. This provides carbon-neutral feedstock alternatives to industries like oil and gas, aviation, construction, and chemical. CO2 storage solutions, on the other hand, facilitate the use of depleted oil or gas fields or saline formations. Algiecel advances Algal-based Carbon Capture UK-based startup Algiecel develops modular photobioreactors that convert CO2 emissions and LED light into microalgae biomass and oxygen. The startup’s compact mobile microalgae photobioreactors and downstream units fit into standard shipping containers. This enables the transformation of industrial CO2 emissions into biomass rich in food-grade omega-3, proteins, vitamins, and carotenoids. The carbon capture solution in this way allows industrial plants to reduce their carbon emissions and enable a new revenue stream. Aqualung achieves Absorbant-free Carbon Capture Norwegian startup Aqualung develops an absorbent-free and highly compact membrane separation technology for carbon capture. The startup’s system utilizes less energy than conventional membranes by eliminating the regeneration energy associated with absorbents. It also avoids toxic additives or absorbents to lower operational risks and maintenance costs. Aqualung’s modular technology enables the deployment of carbon capture systems even for environments with low CO2 concentrations. 6. Energy-Efficient Integrations Industrial excess energy is a largely untapped resource, for which there is potential for reuse as well as benefits industries and society. The utilization of excess energy in the form of heat, power, and fuel provides a way to reduce the use of primary energy. This contributes to the mitigation of CO2 emissions. The most common recovery solutions reuse discarded heat in secondary processes on site or use it to preheat incoming water and combustion air. Other power recovery solutions include the reclamation of pressure energy from processes operating at elevated pressures using even small pressure differences to produce electricity through pressure recovery turbines. In addition to solutions that recover wasted energy, innovations in materials and processes avoid energy wastage and cut down on the associated emissions. Sapphire Technologies simplifies Excess Pressure Energy Recovery US-based startup Sapphire Technologies creates energy recovery systems that harness the power of expanding gas to produce reliable and clean electricity. The startup’s FreeSpin In-line Turboexpander Generator specifically converts energy wasted in pressure reduction processes into electric power without interrupting operations. Sapphire Technologies’ solution caters to hydrogen and natural gas industrial applications. It maximizes efficiencies, improves productivity, reduces carbon emissions, offsets electrical costs, and achieves financial returns. HT Materials Science facilitates Efficient Heat Transfer Irish startup HT Material Science offers smart heat transfer fluids for commercial and industrial heating and cooling systems. The startup’s patented nanofluid additive, Maxwell, is a drop-in solution that enhances the heat transfer of a base refrigerant, improving the efficiency of HVAC systems. This reduces energy consumption and facilitates a proportional reduction in carbon emissions. The higher heat transfer rate enables the adoption of smaller, less costly, and more efficient equipment that further adds to operational sustainability. 7. Big Data Big data allows businesses to identify areas of excessive energy consumption and carbon emissions, providing valuable information for efficient energy use energy and actions to curb emissions. Such solutions collate information from emission sensors and smart energy devices dotted across cities and facilities as well as historical operational data. Energy utilization data analysis allows businesses to identify patterns in energy use and improve energy efficiency. Big data solutions also aid supply chain optimization by analyzing transportation routes, inventory levels, and delivery times, reducing the distance traveled by goods and the resulting carbon footprint. Finally, by analyzing data on energy production and consumption, companies identify the best times to use renewable energy. This allows them to reduce reliance on non-renewable sources and, in turn, decrease their carbon footprint. Grid Matrix aids Transport Emission Reduction US-based startup Grid Matrix offers software that leverages existing traffic infrastructure to reduce congestion, emissions, and accidents. The startup’s cloud-based platform combines data from existing sensors and online sources to employ big data and analytics. It then provides real-time insights based on the collected data, facilitating the optimization of mobility services. This accelerates the transportation goals of cities and allows them to transition into safer, greener, and more efficient places to live and work. Consequently, this results in the elimination of congestion and greenhouse gas emissions. CarbonSense simplifies Carbon Footprint Management Chinese startup CarbonSense makes a software solution that allows businesses to achieve carbon neutrality. The startup’s green management system collects energy data from smart meters, water meters, gas sensors, temperature sensors, and equipment PLC as well as analyzes them through big data algorithms. The resultant insights include visualization of energy consumption, multi-dimensional energy consumption analysis, equipment efficiency analysis, and early warnings on equipment abnormalities. These insights enable intelligence decisions that minimize energy consumption and accelerate the adoption of renewable sources. 8. Waste Valorization Waste valorization converts waste materials into useful products, upcycling end-of-life products and reducing carbon emissions. By diverting waste from landfills, it reduces methane emissions, which is a potent greenhouse gas that contributes significantly to climate change. Waste valorization also generates low-carbon energy in the form of biogas or biochar, which replaces fossil fuels and reduces GHG emissions associated with energy production. Recycling waste materials into new products further reduce the need for new materials and lower greenhouse gas emissions. Lastly, some waste valorization processes capture and utilize carbon dioxide emissions, mitigating their environmental impacts and advancing a circular carbon economy. Alimentary advances Domestic Waste Valorization New Zealand-based startup Alimentary designs and builds an integrated waste treatment plant (IWTP) that accepts all forms of organic waste. The startup’s patented waste treatment process combines biomimicry and anaerobic co-digestion, which is configurable to the local waste sources, to reduce waste disposal costs. It reduces all atmospheric greenhouse gas emissions related to household waste and wastewater treatment processes. In addition, the high-value biogas byproduct offsets costs by generating revenue. Pyro-degrade facilitates Plastic Waste to Fuel Conversion Kenyan startup Pyro-degrade develops a pyrolysis technology that converts plastic waste into fuel. Pyro-diesel is the startup’s fuel that serves as an environmentally friendly diesel substitute, which is free of sulfur and has a low carbon footprint. Moreover, the startup’s process is self-sufficient, enabling it to run off the grid with the fuel it produces. This technology avoids the open burning of plastic waste and provides a low-carbon diesel substitute for agricultural and other domestic applications. 9. Bio-based Fuels & Polymers Bio-based solutions enable emission reduction by providing sustainable alternative energy sources and materials. Biofuels, such as bioethanol and biodiesel, are made from renewable plant-based materials and reduce the need for fossil fuels, resulting in fewer emissions. Biopolymers, such as biodegradable plastics, are sourced from natural fibers and resins that replace traditional petroleum-based plastics. Additionally, the production of biofuels and biopolymers often utilizes waste materials and by-products, reducing waste and emissions associated with waste management. By providing sustainable alternative energy sources and materials, biofuels, and biopolymers help to reduce emissions and contribute to a more sustainable future. SeaH4 produces Carbon-Neutral Fuels South African cleantech startup SeaH4 offers solutions that enable the profitable production of sustainable biodiesel and liquefied natural gas (LNG) from algae. The startup utilizes base technologies involving land-based algae farming, biogas production, gas processing, and gas-to-liquid conversion. SeeH4’s system is fully circular, minimizing operational expenditure and increasing yield. The final fuel product enables the CO2-neutral operation of combustion engines, accelerating the transition away from fossil fuels. Dionymer offers Petrochemical Plastic Alternatives French startup Dionymer develops material technology that upcycles industrial organic waste. The startup’s proprietary fermentation technology incorporates a biomimetic process that transforms organic waste into biodegradable polymer material polyhydroxyalkanoates (PHA). These polymer materials serve as low-carbon alternatives for petrochemical plastics. In addition to reducing carbon emissions, the technology provides a recovery path for bio-waste across industries like agriculture and pharmaceuticals. 10. Emission Monitoring Emission monitoring and management reduce emissions by enabling organizations to accurately measure and track their emissions and identify opportunities for reduction. Monitoring systems detect emissions from various sources and provide real-time data on emissions levels. Management systems then analyze and interpret this data, allowing organizations to identify improvement areas and implement emission reduction strategies. By regularly monitoring and managing emissions, organizations ensure their emissions are within legal limits, reduce their environmental impact, and improve their sustainability. Moreover, organizations now leverage a comprehensive and systematic approach to emission reduction, monitoring, and management. This helps them to achieve emission reduction goals and ensure carbon-neutral operations. GAIT delivers Greenhouse Gas Measurement Singaporean startup GAIT offers climate tech solutions that facilitate the deployment of GHG measurement systems. The startup’s technology combines machine learning, flux sensors, and spatial data to deliver real-time measurements of greenhouse gas emissions. Additionally, it accesses historical flux data to provide more accurate models that measure the effectiveness of climate action projects. The solution also provides recommendations on actions required to further reduce emissions and achieve the set air quality targets. Blue Sky advances Fugitive Methane Emission Detection Blue Sky is a US-based startup that develops an infrared optical sensor technology for the continuous detection and measurement of fugitive methane emissions. NIRview is the startup’s emission monitoring solution that employs a spectroscopy-based approach to automatically scan a user-defined grid and provide a detailed 2D concentration map. The solution in this way offers oilfields a cost-effective detection technology that pinpoints the location of leaks, facilitating quick repairs and substantially reducing emissions. Discover all Emission Reduction Technology Trends, Technologies & Startups Advances in emissions reduction technologies continue to advance as the demand for a net zero existence becomes critical. Carbon offsetting serves as a crucial method in ensuring the financial sustainability of carbon reduction projects and initiatives. Innovations in emission monitoring and reporting through the integration of technologies, like blockchain and IoT, ensure transparency across supply chains. This facilitates close monitoring of emission reduction efforts and allows businesses to properly channel resources for achieving emission goals. The Emission Reduction Technology Trends & Startups outlined in this report only scratch the surface of trends that we identified during our data-driven innovation & startup scouting process. Identifying new opportunities & emerging technologies to implement into your business goes a long way in gaining a competitive advantage.","filter_flag":1}
{"title":"Top 10 Best Agricultural Chemicals Companies In USA In 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWFncmljdWx0dXJhbC1jaGVtaWNhbHMtY29tcGFuaWVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWFncmljdWx0dXJhbC1jaGVtaWNhbHMtY29tcGFuaWVzL9IBAA?oc=5","id":"CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWFncmljdWx0dXJhbC1jaGVtaWNhbHMtY29tcGFuaWVzL9IBAA","guidislink":false,"published":"Tue, 28 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=87, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWFncmljdWx0dXJhbC1jaGVtaWNhbHMtY29tcGFuaWVzL9IBAA?oc=5\" target=\"_blank\">Top 10 Best Agricultural Chemicals Companies In USA In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Agricultural Chemicals Companies In USA In 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWFncmljdWx0dXJhbC1jaGVtaWNhbHMtY29tcGFuaWVzL9IBAA?oc=5\" target=\"_blank\">Top 10 Best Agricultural Chemicals Companies In USA In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"INTRODUCTION Agricultural chemicals companies are an important part of the agricultural industry in the United States, providing a range of products that help farmers increase crop yields and manage pests. In 2023, many agricultural chemical companies will continue to develop new products designed to keep up with changing needs in farming. One company leading the way in 2023 is Monsanto, which provides herbicides, insecticides, fungicides, and other crop protection products. The company has also developed genetically-modified seeds for corn, cotton, and soybeans, allowing farmers to produce more crops with fewer resources. Another leader in the industry is BASF, which recently acquired Bayer CropScience and has developed its line of herbicides, insecticides, and fungicides. Other major players include Syngenta, Nufarm, Arysta LifeScience, FMC Corporation, and Dow AgroSciences. Each company offers a range of products to meet the unique needs of farmers, from herbicides and insecticides to seed treatments and crop nutrition products. Furthermore, many of these companies have invested in research and development to create technologies that can help farmers increase their productivity and optimize their use of inputs. The agricultural chemical industry has been growing steadily over the past decade and is expected to continue to grow in 2023. This growth is due to the increasing demand for improved crop production and management methods, as well as the need to protect crops from pests and diseases. As the world’s population continues to grow, so too will the demand for agricultural chemicals companies, making them an essential part of modern agriculture. IMPORTANCE Agricultural chemicals companies in the USA will be of great importance in 2023. With an ever-growing population and increasing global demand for food, agricultural chemicals are going to become increasingly necessary tools in boosting crop yields and productivity, while also protecting crops from pests and diseases. Additionally, technological advances in this field have allowed for the development of biopesticides, organic fertilizers, and other products which are safer and more sustainable than traditional chemical options. These innovations have created huge opportunities for companies operating in the industry. To capitalize on these opportunities, agricultural chemical suppliers must focus on R&D to continue developing innovative solutions for their customers. They should also invest in marketing and building brand awareness to ensure that their products reach the widest possible audience. Finally, working with farmers to build relationships and understand their needs is also essential for success. By doing all of these things, agricultural chemical companies in the USA should remain competitive and profitable in 2023. Here are the top 10 best agricultural chemicals companies in the USA in 2023 Bayer Crop Science – Bayer Crop Science is an international company based out of Germany, specializing in the development and production of crop protection products, seeds, biotechnology, and plant breeding. Founded in 1863, Bayer is one of the oldest chemical companies in the world and has grown to be a leader in crop science research and technology. Bayer’s core competency lies in developing robust and sustainable products that help growers improve their yields and the quality of the product by protecting their crops from pests, diseases, and weeds. Their products include herbicides, fungicides, insecticides, seed treatments, and biological control agents, as well as digital agriculture technologies and services. In addition to traditional crop protection, Bayer also develops novel biotechnology solutions such as gene editing, enabling farmers to grow higher-yielding and more resilient crops. Bayer is committed to delivering innovation to global agriculture while ensuring the safety and sustainability of their products and minimizing the environmental impact of their activities. To achieve this, Bayer works closely with local governments, universities, and research institutes around the world to maximize the impact of their research and development efforts. The company also focuses on providing educational and training opportunities for its employees and customers, as well as investing in corporate social responsibility initiatives that promote sustainable development, education, and human rights. Bayer’s commitment to excellence, innovation, and sustainability makes it one of the leading players in the crop science industry and a trusted partner for growers around the globe. Syngenta – Syngenta is an agribusiness that produces and markets crop protection products, seeds, and related services for farmers around the world. Founded in 2000, Syngenta is headquartered in Basel, Switzerland, and employs more than 28,000 people in over 90 countries. It has operations in North America, Europe, Asia, South America, and Africa. Syngenta develops and markets herbicides, insecticides, fungicides, plant growth regulators, biological control agents, and other products to help protect crops, increase yields and improve quality. In addition, Syngenta develops and markets a wide range of seed varieties, including corn, soybeans, wheat, cotton, and vegetables. The company also provides services such as agronomic advice and access to digital farming technologies. Syngenta is committed to sustainable agriculture and uses its expertise and resources to support growers and consumers worldwide. Its research focuses on improving crop health, minimizing environmental impact, and maximizing yield and quality. By working with smallholder farmers and developing country governments, Syngenta strives to ensure healthy and abundant food supplies while protecting the environment. Corteva Agriscience – Corteva Agriscience is a leading global agriculture company that offers innovative and sustainable solutions to farmers around the world. The company provides products and services in seed, crop protection, digital farming, and more. Corteva Agriscience was formed in 2019 when DowDuPont spun off its agricultural division as an independent organization. It is now the world’s largest pure-play agriculture company, with over 20,000 employees in more than 90 countries. Corteva Agriscience has a focus on delivering innovative and sustainable solutions to farmers. This includes integrated pest management systems, precision agriculture technologies, high-value crops, and new business models. Its research and development investments are dedicated to helping farmers maximize their yields while protecting soil health, water quality, and energy efficiency. The company also has a broad portfolio of products and services, including crop protection, seed genetics, digital agriculture, and customer service. It is involved in every aspect of the food production chain, from research and development to marketing and distribution. Corteva Agriscience also works closely with local communities to ensure their interests and safety are protected. Corteva Agriscience is constantly seeking out new ways to improve the sustainability of farmers and the environment. The company’s commitment to sustainability, long-term growth, and innovation makes it a leader in the agriscience industry. Corteva Agriscience is committed to providing quality products and services to farmers, so they can produce more with less and ultimately help feed a growing population. BASF – BASF is a German chemical company founded in 1865 and headquartered in Ludwigshafen, Germany. It is the largest chemical producer in the world and has operations in over 80 countries. BASF produces a variety of chemicals, fuel additives, plastics, construction materials, and other products. The company’s portfolio includes basic chemicals such as oxygen, nitrogen, and hydrochloric acid; specialty chemicals such as plastics, solvents, and catalysts; and performance chemicals like surfactants and emulsifiers. Its agricultural division offers crop protection products, plant nutrition solutions, and seeds. BASF also provides services to the oil and gas industry in areas such as exploration, production, and refining. With a focus on sustainability, BASF works to reduce its environmental footprint by reducing emissions and waste and investing in renewable energy sources. The company is committed to innovations that advance the use of chemistry for a sustainable future. FMC Corporation – FMC Corporation is a global company specializing in the production of agricultural, industrial, and specialty chemicals. Founded in 1883, FMC currently employs approximately 5,000 people across its business units and operates in more than 70 countries around the world. The company’s products are used in a variety of industries, such as crop protection, animal health and nutrition, pharmaceuticals, food processing, surface imaging, and automotive care. FMC produces a broad range of products for the agriculture industry, ranging from insecticides and herbicides to soil conditioners and fertilizers. For industrial markets, the company manufactures lubricants, plant extracts, plastics, surfactants, and minerals. Additionally, FMC has a specialty chemical business that specializes in products for the paint and coatings, metalworking, and textiles industries. All of FMC’s products are designed to help farmers, businesses, and consumers make the most out of their land and resources. FMC is continually looking for new ways to develop innovative solutions that will help customers reduce their environmental impact while improving yields. They are committed to sustainable business practices, such as green chemistry, renewable energy, and corporate social responsibility. FMC strives to be a leader in helping customers meet their goals and make the world a better place for everyone. Nufarm – Nufarm is a multinational agrochemical company headquartered in Australia. The company produces and supplies crop protection products, from herbicides to insecticides, fungicides, and other agricultural chemicals. It was founded by chemist William John Derham in 1899 and has since grown to become one of the leading providers of crop protection solutions across the globe. Nufarm’s products are sold in over 100 countries, with a presence in North America, Europe, Asia, Africa, and Australasia. Nufarm provides farmers with a range of innovative crop protection solutions designed to help them get the most out of their crops. Nufarm also offers a wide selection of fertilizers, seeds, plant growth materials, and biostimulants to provide complete crop protection and nutrition. In addition, Nufarm produces a range of specialty products such as mycorrhizal fungi and microbial biofertilizers. Nufarm takes pride in its commitment to sustainability and environmental protection. The company works closely with farmers to ensure that they use only the best products to protect their crops while also maintaining the highest standards of safety and environmental stewardship. Nufarm has invested significantly in research and development to develop more effective and efficient crop protection solutions. Nufarm is an industry leader in terms of innovation, technology, and efficiency. Its products are developed using cutting-edge technologies that enable it to create products that are more effective, safer, and more sustainable. As a result, Nufarm can offer farmers better results, greater yields, and improved profitability. In summary, Nufarm is a global leader in the production and supply of crop protection products. By providing innovative solutions and investing in research and development, Nufarm can offer farmers the best products and solutions for their crops. Nufarm also takes great pride in its commitment to sustainability, safety, and environmental protection. Marrone Bio Innovations – Marrone Bio Innovations Inc. (MBI) is a leading global provider of sustainable pest management and plant health solutions. The company develops, markets, and distributes a portfolio of highly effective and environmentally responsible products for agriculture, turf\/ornamental, and water-use applications. MBI’s focus on eco-friendly product development helps reduce the need for conventional chemical pesticides and fertilizers. MBI’s three main product lines include proprietary microbial biopesticides, plant activators, and nutrition. The biopesticides are based on naturally occurring microbes that have been specifically selected to control specific pests, such as aphids, fungus gnats, whiteflies, and other common insect and disease pests. Plant-activator products contain beneficial soil organisms that enhance the uptake of nutrients and promote healthier, more vigorous plants. Nutritionals provide essential macronutrients in concentrated forms, such as nitrogen, phosphorus, and potassium. All of MBI’s products are designed to help farmers improve crop yields while reducing environmental impact. MBI also has an extensive research and development program, which enables them to stay ahead of the curve in sustainable agricultural solutions. The company has developed several patented technologies, such as its Exosect platform, which combines traditional biopesticide formulations with advanced delivery systems. Exosect delivers long-lasting protection against targeted pests, allowing growers to reduce their dependence on synthetic chemicals. MBI also contributes to the larger cause of sustainability by working with land grant universities and other research institutions to develop new technologies and best practices. The company also partners with government agencies and industry groups to ensure that its products meet stringent safety standards. Through its commitment to innovation and sustainability, MBI is helping to shape the future of agriculture and the environment. Their products help farmers, landscapers, and gardeners protect their crops and landscapes without relying on harmful synthetic chemicals. Adama Agricultural Solutions – Adama Agricultural Solutions Company is a leading provider of innovative digital solutions for the farming industry. Adama’s suite of products and services enables farmers to optimize their crop production and management, while also maximizing their environmental sustainability goals. Adama’s cloud-based platform provides farmers with access to data analytics, predictive modeling, and automated technologies to help them make informed decisions about their crops. Adama also offers a range of consulting and support services to help farmers maximize their yields. Adama’s goal is to make agriculture more efficient, productive, and profitable by improving access to up-to-date information, advanced technology, and expert advice. The company uses a combination of sensors, satellite images, and artificial intelligence to analyze soil conditions and weather patterns to optimize crop growth and management. Adama also offers guidance on water management, pest control, and other agricultural practices. Adama has become a leader in digital agriculture with its suite of integrated software and hardware solutions. The company’s products are designed to help farmers increase efficiency and profitability while reducing costs and mitigating risks associated with farming. Adama’s products are used in over 150 countries and have been recognized for their impact on improving food security and agricultural productivity. Adama’s innovative solutions have enabled farmers to increase yields, reduce input costs, and improve resource management. The company’s commitment to sustainability and innovation has led to partnerships with government organizations, NGOs, and research institutions around the world. Adama’s team of experts is dedicated to helping farmers achieve their long-term agricultural objectives. Agrolux – AgroLux is a leading global agricultural engineering and technology company based in Sao Paulo, Brazil. Founded in 2015, the company develops innovative, sustainable solutions for the agricultural industry by combining the latest technologies with traditional farming practices. AgroLux’s products include fully automated hydroponic greenhouses that are powered by solar energy, computer vision-powered irrigation systems, plant optimization systems that use deep learning algorithms to maximize crop yields, climate control systems that use data analysis to predict weather patterns, and autonomous drones for crop monitoring. Agrolux also offers a suite of software tools, such as its Farm Management System (FMS), which helps farmers track and manage their entire operations in one place. Additionally, Agrolux has developed an artificial intelligence-based predictive analytics tool to help farmers increase productivity, reduce costs, and maximize yields. The company’s services range from farm planning, soil analysis, and field mapping, to precision farming and data collection. The company also provides consulting and training services to ensure customers get the most out of their investments. Agrolux is dedicated to helping farmers around the world become more productive and profitable by providing them with access to cutting-edge agricultural technologies and data-driven insights. By staying on the cutting edge of the agricultural industry and leveraging data-driven insights, Agrolux is revolutionizing the way the world farms. Wilbur-Ellis Company – Wilbur-Ellis Company is a leading international marketer and distributor of agricultural products, animal feed, and specialty chemicals and ingredients. Founded in 1921, the company has grown to become an important player in the global agricultural industry, with more than 4,000 employees in 25 countries. The company specializes in providing customized solutions for farmers, ranchers, and food processors. Their range of products includes fertilizers and crop protection products, livestock feed and nutrition, seed and grain processing and marketing, animal health and nutrition, crop production inputs, and specialty chemicals and ingredients. Wilbur-Ellis also offers consulting services, such as agronomic advice, financial analysis, and risk management advice. Additionally, the company provides support for sustainable farming practices, including precision agriculture, conservation tillage systems, and integrated pest management. Through its strong commitment to innovation, quality, and customer service, Wilbur-Ellis continues to be an important partner in the success of the global agricultural industry. CONCLUSION In 2023, agricultural chemicals companies in the USA are expected to continue to experience growth and expansion. The market is becoming increasingly competitive, which is driving innovation and product development. Companies are focusing on developing sustainable and safe chemical solutions that are effective and cost-efficient for farmers. They are also leveraging new technologies such as precision agriculture to improve production efficiency and reduce input costs. As a result, these companies are likely to remain profitable in the long term.","filter_flag":1}
