{"title":"The Winds of Change are Blowing in the Renewables Market - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmJjZy5jb20vYWx1bW5pL3Nwb3RsaWdodC90aGUtd2luZHMtb2YtY2hhbmdlLWFyZS1ibG93aW5nLWluLXRoZS1yZW5ld2FibGVzLW1hcmtldNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmJjZy5jb20vYWx1bW5pL3Nwb3RsaWdodC90aGUtd2luZHMtb2YtY2hhbmdlLWFyZS1ibG93aW5nLWluLXRoZS1yZW5ld2FibGVzLW1hcmtldNIBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3LmJjZy5jb20vYWx1bW5pL3Nwb3RsaWdodC90aGUtd2luZHMtb2YtY2hhbmdlLWFyZS1ibG93aW5nLWluLXRoZS1yZW5ld2FibGVzLW1hcmtldNIBAA","guidislink":false,"published":"Sun, 14 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=134, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmJjZy5jb20vYWx1bW5pL3Nwb3RsaWdodC90aGUtd2luZHMtb2YtY2hhbmdlLWFyZS1ibG93aW5nLWluLXRoZS1yZW5ld2FibGVzLW1hcmtldNIBAA?oc=5\" target=\"_blank\">The Winds of Change are Blowing in the Renewables Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Winds of Change are Blowing in the Renewables Market - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmJjZy5jb20vYWx1bW5pL3Nwb3RsaWdodC90aGUtd2luZHMtb2YtY2hhbmdlLWFyZS1ibG93aW5nLWluLXRoZS1yZW5ld2FibGVzLW1hcmtldNIBAA?oc=5\" target=\"_blank\">The Winds of Change are Blowing in the Renewables Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Transition\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"What types of new technologies is RWE using to provide better solutions for the efficient use of energy sources globally? What are you most hopeful for regarding the future of RWE? Our main investment focus is on offshore wind and onshore wind, PV, batteries, and green hydrogen. All of these are still technologies with further innovation and optimization potential. But of course we also invest a lot—not just money but also intellectual property—into many of the underlying technologies. As an example, we have leading-edge capabilities in understanding the wind resource, how it translates into energy yield, and how that can be optimized. This involves topics such as complex fluid dynamics modelling. One of the more exciting frontiers is to make floating offshore wind, which can be deployed in deep waters, technically mature and economically viable. Once we have done that—and I am convinced it is only a matter of time—floating will expand the applicability of offshore wind to many new geographies, such as California, where the wind resource is great but the water is deep. The exciting future of RWE is to be one of the leading providers of climate-neutral, sustainable energy to our society. Any advice you can give to those looking to take the same road in the climate and sustainability space? What do you wish you had known before starting this journey? You cannot know everything in advance. It is about staying flexible and being willing to learn and adapt. After university, with my degree in geophysics, I started to work in oil and gas exploration and production—one of the things you do as a geophysicist. It was a great experience with a great company, and taught me a lot. But at some point, I wanted to broaden and give myself more options for the future—not be limited to oil and gas. At that point, BCG, and a career in strategy consulting, was a fantastic opportunity. And it ultimately helped me to find my way into renewable energy, which at that point I realized was where I wanted to build my career. In any case, a career in sustainable technologies is a great choice. It is so dynamic, full of opportunities and development possibilities. And it is rewarding in terms of purpose and motivation. Are there any experiences or lessons you took with you from your time at BCG that continue to influence how you operate and lead your team today? Definitely many. I always refer to it as my “MBA on the job.” It was great fun to be thrown into my first project assignment—on a matter I knew absolutely nothing about! It taught me that it isn’t always about what you know, but about how you approach things and how you think about them, applying some basic business sense. I have always perceived BCG as one of the most modern organizations, always staying leading edge in how to manage in today’s world—working in a global setup, in virtual teams, adapting to new realities. That is what I also try to do in my role.","filter_flag":1}
{"title":"Banpu NEXT forays into Asia-Pacific market for battery energy storage system, spearheaded by Durapower to capture ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmFucHUtbmV4dC1mb3JheXMtaW50by1hc2lhLXBhY2lmaWMtbWFya2V0LWZvci1iYXR0ZXJ5LWVuZXJneS1zdG9yYWdlLXN5c3RlbS1zcGVhcmhlYWRlZC1ieS1kdXJhcG93ZXItdG8tY2FwdHVyZS1ncm93aW5nLWRlbWFuZHMtYWNyb3NzLXJlZ2lvbi0zMDE4MjUyOTMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmFucHUtbmV4dC1mb3JheXMtaW50by1hc2lhLXBhY2lmaWMtbWFya2V0LWZvci1iYXR0ZXJ5LWVuZXJneS1zdG9yYWdlLXN5c3RlbS1zcGVhcmhlYWRlZC1ieS1kdXJhcG93ZXItdG8tY2FwdHVyZS1ncm93aW5nLWRlbWFuZHMtYWNyb3NzLXJlZ2lvbi0zMDE4MjUyOTMuaHRtbNIBAA?oc=5","id":"CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmFucHUtbmV4dC1mb3JheXMtaW50by1hc2lhLXBhY2lmaWMtbWFya2V0LWZvci1iYXR0ZXJ5LWVuZXJneS1zdG9yYWdlLXN5c3RlbS1zcGVhcmhlYWRlZC1ieS1kdXJhcG93ZXItdG8tY2FwdHVyZS1ncm93aW5nLWRlbWFuZHMtYWNyb3NzLXJlZ2lvbi0zMDE4MjUyOTMuaHRtbNIBAA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmFucHUtbmV4dC1mb3JheXMtaW50by1hc2lhLXBhY2lmaWMtbWFya2V0LWZvci1iYXR0ZXJ5LWVuZXJneS1zdG9yYWdlLXN5c3RlbS1zcGVhcmhlYWRlZC1ieS1kdXJhcG93ZXItdG8tY2FwdHVyZS1ncm93aW5nLWRlbWFuZHMtYWNyb3NzLXJlZ2lvbi0zMDE4MjUyOTMuaHRtbNIBAA?oc=5\" target=\"_blank\">Banpu NEXT forays into Asia-Pacific market for battery energy storage system, spearheaded by Durapower to capture ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Banpu NEXT forays into Asia-Pacific market for battery energy storage system, spearheaded by Durapower to capture ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvYmFucHUtbmV4dC1mb3JheXMtaW50by1hc2lhLXBhY2lmaWMtbWFya2V0LWZvci1iYXR0ZXJ5LWVuZXJneS1zdG9yYWdlLXN5c3RlbS1zcGVhcmhlYWRlZC1ieS1kdXJhcG93ZXItdG8tY2FwdHVyZS1ncm93aW5nLWRlbWFuZHMtYWNyb3NzLXJlZ2lvbi0zMDE4MjUyOTMuaHRtbNIBAA?oc=5\" target=\"_blank\">Banpu NEXT forays into Asia-Pacific market for battery energy storage system, spearheaded by Durapower to capture ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Transition\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"SINGAPORE, May 16, 2023 \/PRNewswire\/ -- Banpu NEXT, a leading smart energy solutions provider in Asia-Pacific, is making its full foray into its battery business as the company joins forces with its subsidiary Durapower Holdings Pte Ltd (\"Durapower\" and together with its subsidiaries, Durapower Group), a global leader in performance lithium-ion battery storage solutions, to become a vertically-integrated player in the battery business and build up its capabilities to offer a wider range of products and services, while also expanding its customer base across the Asia-Pacific region. Leveraging on the company experience with Battery Energy Storage System (\"BESS\") deployments in Singapore, Malaysia and Thailand, Durapower partnered Banpu NEXT to achieve a new milestone with a successful first rollout of the BESS installed at the Solar Hybrid Power Plant for self-consumption at an Indonesian mining site. Banpu NEXT is now set to introduce BESS to other business operations of Banpu Group and offer this solution to enterprise customers to support the growing market demands and drive sustainable growth of the company's battery business. Solar Hybrid Power Plant for self-consumption at an Indonesian mining site where Durapower's Battery Energy Storage System (BESS) was successfully rolled out Image: Banpu NEXT View PDF View PDF Durapower's BESS, a high-performance, liquid-cooled, lithium-ion based containerised BESS, was established at Banpu NEXT's Solar Hybrid Power Plant for self-consumption at an Indonesian mining site to meet operational demands. The systems are backed by stringent safety performance with multi-tier safeguards, and International Electrotechnical Commission (\"IEC\") and United Nations Economic Commission for Europe Regulation (\"UN ECE\") certified cells and modules. A BESS integrated in a solar hybrid system is an effective opportunity for commercial and industrial operators to meet emission reduction and decarbonization targets. The BESS is the culmination of customisation expertise from Durapower's extensive electric vehicle and ESS experience, and regionalised supply chain access to help our customers meet their rigorous operational targets while optimising budgets and timelines. Over the years, Banpu NEXT and Durapower have jointly expanded multiple aspects of their energy storage business. For example, lithium-ion batteries have been sourced from Durapower for solutions and energy services provided by Banpu NEXT, including MuvMi e-Tuk Tuk for Ride Sharing, electric cars for mobility sharing and e-Ferry services. To support inroads into the ESS market, the two companies also increased battery production capacity at their China manufacturing plant and established a new battery assembly plant in Thailand. Earlier this year, Banpu NEXT also increased its existing shareholding in Durapower to 65.10%, turning its status into Durapower's parent company. Mr. Sinon Vongkusolkit, Chief Executive Officer of Banpu NEXT, said \"With our commitment to become the Net-Zero Energy Provider for all enterprises, we continue to strengthen our business ecosystem in alignment with Banpu Group's 'Greener & Smarter' strategy. The increase in shareholding in Durapower, our subsidiary, will boost our competitiveness in the battery value chain, providing high power battery solutions for electric vehicles (\"EV\") and energy storage systems (\"ESS\") with internationally recognized standards to our customers. Recently, we installed a 1 MWh Durapower BESS at our Bunyut Solar PV Hybrid power plant for self-consumption at an Indonesian mining site to transition towards more renewable sources to decarbonize the mine site operations for ITMG (Banpu Group's subsidiary). We are pursuing opportunities to integrate Durapower's battery technology into our Smart Energy Solutions offering, such as EV fleets, smart microgrids, and battery farms. Furthermore, we will continue to scale up our Energy Storage business and offer closed-loop end-to-end battery solutions to our customers across the region.\" Mr. Sinon concluded. Mr. Kelvin Lim, Group Chief Executive Officer of Durapower, said \"Our expertise in the development of battery materials, design and manufacturing of battery systems as well as lithium-ion battery technologies will propel business expansion with Banpu NEXT. With a strong focus and attention on sustainable energy transition, we are extending our proven products and service offerings to commercial and industrial operators of renewable energy power plants across the Asia-Pacific region to help them meet their emission reduction and decarbonization targets. Durapower's BESS, designed with strong an engineering focus to achieve high power and high energy performance, has maintained a perfect safety track record over the past decade.\" To find out more about Durapower's battery energy storage solutions and related technologies, please visit Durapower's Booth MC21, Hall 3 at Future Mobility Asia 2023 which takes place from 17 to 19 May 2023 at the Queen Sirikit National Convention Center in Bangkok. #BanpuNEXT #TotalSmartEnergySolutions #EnergyStorageBusiness About Banpu NEXT Banpu NEXT Co., Ltd., a subsidiary of Banpu PCL., is a leading smart energy solutions provider in Asia-Pacific. The company supports the transition to Net-Zero society. The five core businesses group of Banpu NEXT are Renewable Power, Energy Storage, Energy Trading, e-Mobility, and Smart City & Energy Management. With all these five businesses, the company boasts the capability to offer \"Total Smart Energy Solutions\". Banpu NEXT is positioned as the long-term partner who combines technology and digital platform with its energy expertise to provide the best tailor-made solutions, empowering organizations to tap into infinite of clean energy, accelerate smart business transformation, while building up sustainable growth along with contribution to betterment for end-users' life and society at large. For the Durapower shares, Banpu NEXT has invested approximately 65.10% shares. For more information, visit www.banpunext.co.th , www.facebook.com\/banpunext , or www.linkedin.com\/company\/banpu-next-company-limited\/ About Durapower Group (www.durapowergroup.com) Headquartered in Singapore, Durapower offers closed-loop, end-to-end energy storage solutions for the electric mobility and renewable energy applications including on and off-road Electric, Hybrid and Plug-in Hybrid Electric Vehicles, electric marine vessel and stationary energy storage solutions. Since 2009, Durapower has been a leading innovator of Lithium-Ion cell technology, focusing on the research and development of battery materials, battery cell manufacturing and system integration. With a global presence spanning 24 countries and 49 cities, including European Countries, China, India and Southeast Asia. Durapower Group strives to make scalable, sustainable batteries that support the circular economy, empowering lives and transforming the future towards a carbon neutral economy. SOURCE Durapower Group","filter_flag":1}
