{"title":"Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ... - Yahoo Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5","id":"CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5\" target=\"_blank\">Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ... - Yahoo Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb25vcy1yZXBvcnRzLXByb2dyZXNzLW1hZGUtYWdhaW5zdC0xNDAwMDAwMDkuaHRtbNIBAA?oc=5\" target=\"_blank\">Sonos Reports Progress Made Against Climate Action Plan, Showcases Commitment to Product Longevity and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","source.href":"https:\/\/finance.yahoo.com","source.title":"Yahoo Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Product longevity\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The company released its 2023 Listen Better Report, detailing actions to build a more sustainable future alongside progress on Social Impact and Diversity, Equity and Inclusion SANTA BARBARA, Calif., November 30, 2023--(BUSINESS WIRE)--Today, Sonos (NASDAQ: SONO) released its annual Listen Better Report, offering a comprehensive overview of the company’s Environmental, Social, and Governance (ESG) efforts. Included in the Report are actions made against Sonos’ Climate Action Plan, introduced in 2021, which serves as a framework to drive the company to carbon neutrality by 2030 and net zero by 2040. \"We aim to build products and experiences that bring joy to people, and to do it in a responsible way. Our Listen Better Report outlines how we’re bringing thoughtful innovation to everything we do in pursuit of helping the world listen better,\" said Patrick Spence, Sonos CEO. \"This year, we expanded our portfolio by unveiling three products that tie together immersive sound and sustainable design.\" Creating responsibly-designed products Building sustainability into product hardware and software is central to Sonos’ efforts to respond to climate change. In 2023, Sonos released three new products that deliver on its commitment to provide innovative sound and superior functionality – while doing so responsibly. Sonos Era 100 and Sonos Era 300 are two all-in-one speakers, featuring stereo sound and spatial audio, respectively. Sonos Move 2 is a premium portable speaker. Sonos Era 100 and Sonos Era 300’s idle power consumption was reduced to under 2 watts, marking Sonos’ first plug-in speakers to reach this milestone. The design of the Sonos Era product line facilitates easy in-region repair, reducing transportation emissions and keeping products and component materials in use longer. Sonos achieved its FY23 circular materials goal by including post consumer recycled (PCR) plastic in all three of its new products, with Sonos Era 100 and Sonos Era 300 utilizing approximately 40% recycled plastic. All Sonos products are wrapped in sustainable packaging, providing superior protection and a premium unboxing experience. Sonos was recognized for its responsible packaging efforts, earning The Dieline’s Best in Show award for the Sonos Ray and Sub Mini speakers. The packaging team continues to innovate by utilizing Forest Stewardship Council certified paper, recyclable plant-based fibers, and new recycled clip mechanisms. \"We are proud of the progress we’ve made against our Climate Action Plan, which is showcased by our newest products,\" said Deji Olukotun, Sonos Director of Global Affairs and Sustainability. \"We aim to improve each step of our sustainability journey, and our report celebrates the innovative work happening broadly across the company, from product design, to DEI, to supporting the emerging field of ecoacoustics to protect biodiversity.\" Story continues In line with its Climate Action Plan, Sonos shared its Scope 1, 2, and 3 greenhouse gas emissions with the Carbon Disclosure Project (CDP) for the first time, marking a new level of climate transparency. Sonos also reaffirmed its commitment to the Responsible Business Alliance, an industry group that advocates for fair labor practices. Sonos continued its emphasis on privacy, as demonstrated by Sonos Voice Control, which lets you play music and control your system with hands-free ease and unmatched privacy. Sonos Voice Control processes spoken commands and understands requests entirely on the speaker. No audio or transcript is sent to the cloud, stored, listened to, read, or labeled by anyone — so all the conversations in a user’s home remain in the home. Advancing philanthropic efforts and diversity, equity and inclusion This year, Sonos’ social impact program supported over a dozen nonprofits around the world to drive positive impact. Sonos launched a signature partnership with Rainforest Connection, an ecoacoustics nonprofit operating in 35 countries that uses sound and Artificial Intelligence to promote biodiversity and conservation efforts. Sonos support has enabled the Rainforest Connection to record 85,742,731 minutes of nature sounds and to identify 1,442 unique species of wildlife. This acoustic mapping is essential for providing data to preserve these critical habitats. In November, Sonos strengthened its dedication to environmental preservation by joining 1% for the Planet, committing to donate 1% of annual Certified Refurbished sales to support high-impact environmental organizations. Sonos remains committed to giving back to underserved communities by supporting STEAM learning and education for youth from Title I schools, mentorship and music lessons, and effective humanitarian relief worldwide. Continuing its efforts towards Diversity, Equity, & Inclusion (DEI), Sonos’ dedicated DEI team works across the company and tracks progress. In FY23, targeted recruitment attracted more diverse candidates, resulting in a 28.5% increase in historically underrepresented applicants compared to FY22. Our DEI principles guided many of our actions in 2023. We invested in inclusive recruitment and retention, increased transparency with our staff, and incorporated feedback from Employee Resource Groups and other key stakeholders. Sonos achieved a high score of 100 for LGBTQIA+ equity and workplace friendliness in the Human Rights Campaign Corporate Equality Index for the second year in a row. To read the full Sonos 2023 Listen Better Report, please visit sustainability.sonos.com. About Sonos Sonos (Nasdaq: SONO) is the world’s leading sound experience company. As the inventor of multi-room wireless home audio, Sonos innovation helps the world listen better by giving people access to the content they love and allowing them to control it however and wherever they choose. Known for delivering an unparalleled sound experience, thoughtful design aesthetic, simplicity of use, and an open platform, Sonos makes the breadth of audio content available to anyone. Sonos is headquartered in Santa Barbara, California. Learn more at www.sonos.com. View source version on businesswire.com: https:\/\/www.businesswire.com\/news\/home\/20231130201439\/en\/ Contacts Investor Contact James Baglanis IR@sonos.com Press Contact Erin Pategas PR@sonos.com","filter_flag":1}
