{"title":"Innodisk expands edge AI applications and intelligent solution at Computex 2024 with new brand strategy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0b496e4f5aa6521946090bcc40&url=https%3a%2f%2fwww.digitimes.com%2fnews%2fa20240604PR202%2fcomputex-2024-innodisk.html%26chid%3d9&c=2499911945597279748&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0b496e4f5aa6521946090bcc40&url=https%3a%2f%2fwww.digitimes.com%2fnews%2fa20240604PR202%2fcomputex-2024-innodisk.html%26chid%3d9&c=2499911945597279748&mkt=en-us","summary":"Innodisk, a leading global AI solution provider, is showcasing its comprehensive new products at Computex ... The \"iCAP Air\" air quality management solution addresses ESG requirements by combining ...","published":"Mon, 03 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=3, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=155, tm_isdst=0)","news_source":"Digi Times","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Innodisk expands edge AI applications and intelligent solution at Computex 2024 with new brand strategy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Innodisk, a leading global AI solution provider, is showcasing its comprehensive new products at Computex ... The \"iCAP Air\" air quality management solution addresses ESG requirements by combining ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Air Quality Management\" \"new products\"&format=rss","text":"Innodisk expands edge AI applications and intelligent solution at Computex 2024 with new brand strategy Innodisk, a leading global AI solution provider, is showcasing its comprehensive new products at Computex 2024 with a focus on edge AI. Key highlights include the industry's pioneering CXL 2.0 memory expansion, E3.S SSD, and innovative MIPI over Type-C camera technology for machine vision. Live demonstrations of smart manufacturing PPE recognition and intelligent people tracking will emphasize Innodisk's custom edge AI capabilities. This event also unveils Innodisk's new brand vision, \"Architect Intelligence,\" bringing out its commitment to building intelligent solutions with global partners. Expanding Industrial Product Lines to Meet AI and Edge Serve Standards Reliable and high-performance memory and storage are essential for AI and edge computing, particularly as edge servers evolve and demand high data throughput and resilience in extreme environments. At Computex, Innodisk will unveil its first industrial-grade CXL 2.0 memory expansion, which is aligned with advanced industry standards and offers high scalability. The showcase will feature award-winning E1.S Gen4 SSD series, alongside wide-temperature SSDs tailored for edge servers, such as the E1.S\/E3.S, available in various form factors. The range also includes 16TB high-capacity SSDs designed to meet the evolving storage needs. Further, Innodisk's recent focus on embedded camera modules for AI machine vision development is crucial for advancing edge AI applications. Debuting at Computex, the innovative \"MIPI over Type-C\" camera technology converts signal through exclusive adapter board design and enhances platform compatibility, significantly extending the length of MIPI camera cables. This unlocks applications in areas such as autonomous mobile robots (AMR) and shared mobility. Innodisk will also display a full range of camera module products for USB and MIPI interfaces. Innodisk is showcasing the exclusive MIPI over Type-C technology at Computex 2024 AI in Action: Smart Cities and Industrial Applications Beyond industrial modules, Innodisk integrates AI computing technologies with software, hardware, and third-party technologies to create various edge AI solutions. At Computex, Innodisk will introduce \"InnoTracking,\" a smart people-tracking solution capable of accurately identifying and tracking specific individuals across multiple cameras and timeframes, enhancing public safety in cities, financial institutions, entertainment venues, and retail spaces. Under the simultaneous trends of ESG and industrial automation, worker safety in hazardous environments becomes a crucial focus for enterprises. Innodisk's PPE recognition solution uses an FPGA platform to process real-time images from four cameras simultaneously, ensuring workers maintain adherence to safety protocols. In case of violations, the system promptly notifies supervisors with detailed information to initiate appropriate responses. The \"iCAP Air\" air quality management solution addresses ESG requirements by combining patented air quality detection technology with sensors, edge servers, cloud management interfaces, and IoT ventilation controllers. This solution is suitable for smart factories and healthcare facilities, enabling real-time intelligent decision-making. \"Architect Intelligence\" – Innodisk's Brand Strategy for the AI Era With nearly two decades in the industry, Innodisk has elevated its brand and become a global leader in product technology. The new \"Architect Intelligence\" concept aligns with Innodisk's edge AI strategy, emphasizing the practical implementation of AI at the industrial edge. Under this concept, Innodisk integrates various product lines into nine intelligent series, each represented by diverse colors, symbolizing the limitless potential of AI applications and Innodisk's innovative spirit. Furthermore, these colored blocks represent the flexibility of solutions and collaborative effort to architect AI solutions with customers. See the future of edge AI in actions! Visit Innodisk at Booth J0110, Hall 1, 1F, Nangang Exhibition Center from June 4 to June 7 to explore more.","filter_flag":1}
{"title":"Innodisk unveils edge AI applications and intelligent solution at Computex 2024 with new brand strategy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0b496e4f5aa6521946090bcc40&url=https%3a%2f%2fwww.digitimes.com%2fnews%2fa20240529PR203.html%26chid%3d9&c=18300050525521249256&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0b496e4f5aa6521946090bcc40&url=https%3a%2f%2fwww.digitimes.com%2fnews%2fa20240529PR203.html%26chid%3d9&c=18300050525521249256&mkt=en-us","summary":"Innodisk, a leading global AI solution provider, will showcase its comprehensive new products at Computex ... The \"iCAP Air\" air quality management solution addresses ESG requirements by combining ...","published":"Tue, 28 May 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=28, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=149, tm_isdst=0)","news_source":"Digi Times","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Innodisk unveils edge AI applications and intelligent solution at Computex 2024 with new brand strategy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Innodisk, a leading global AI solution provider, will showcase its comprehensive new products at Computex ... The \"iCAP Air\" air quality management solution addresses ESG requirements by combining ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Air Quality Management\" \"new products\"&format=rss","text":"Innodisk unveils edge AI applications and intelligent solution at Computex 2024 with new brand strategy Innodisk, a leading global AI solution provider, will showcase its comprehensive new products at Computex 2024 with a focus on edge AI. Key highlights include the industry's pioneering CXL 2.0 memory expansion, E3.S SSD, and innovative MIPI over Type-C technology for machine vision. Live demonstrations of smart manufacturing PPE recognition and intelligent people tracking will emphasize Innodisk's custom edge AI capabilities. At the event, Innodisk will also unveil its new brand vision, \"Architect Intelligence,\" bringing out its commitment to building intelligent solutions with global partners. Expanding Industrial Product Lines to Meet AI and Edge Serve Standards Reliable and high-performance memory and storage are essential for AI and edge computing, particularly as edge servers evolve and demand high data throughput and resilience in extreme environments. At Computex, Innodisk will unveil its first industrial-grade CXL 2.0 memory expansion, which is aligned with advanced industry standards and offers high scalability. The showcase will further feature the award-winning E1.S Gen4 SSD series alongside wide-temperature SSDs tailored for edge servers, such as the E1.S\/E3.S, available in various form factors. The range also includes 16TB high-capacity SSDs designed to meet evolving storage needs. Further, Innodisk's recent focus on embedded camera modules for AI machine vision development is also crucial for advancing edge AI applications. Debuting at Computex, the innovative \"MIPI over Type-C\" camera technology converts signal through exclusive adapter board design and enhances platform compatibility, significantly extending the length of MIPI camera cables. This unlocks applications in areas such as autonomous mobile robots (AMR) and shared mobility. Innodisk will also display a full range of camera module products for USB and MIPI interfaces. AI in Action: Smart Cities and Industrial Applications Beyond industrial modules, Innodisk integrates AI computing technologies with software, hardware, and third-party technologies to create various edge AI solutions. At Computex, Innodisk will introduce \"InnoTracking,\" a smart people-tracking solution capable of accurately identifying and tracking specific individuals across multiple cameras and timeframes, enhancing public safety in cities, financial institutions, entertainment venues, and retail spaces. Under the simultaneous trends of ESG and industrial automation, worker safety in hazardous environments becomes a crucial focus for enterprises. Innodisk's PPE recognition solution uses an FPGA platform to process real-time images from four cameras simultaneously, ensuring workers maintain adherence to safety protocols. In case of violations, the system promptly notifies supervisors with detailed information to initiate appropriate responses. The \"iCAP Air\" air quality management solution addresses ESG requirements by combining patented air quality detection technology with sensors, edge servers, cloud management interfaces, and IoT ventilation controllers. This solution is suitable for smart factories and healthcare facilities, enabling real-time intelligent decision-making. \"Architect Intelligence\" – Innodisk's Brand Strategy for the AI Era With nearly two decades in the industry, Innodisk has elevated its brand and become a global leader in product technology. The new \"Architect Intelligence\" concept aligns with Innodisk's edge AI strategy, emphasizing the practical implementation of AI at the industrial edge. Under this concept, Innodisk integrates various product lines into nine intelligent series, each represented by diverse colors, symbolizing the limitless potential of AI applications and Innodisk's innovative spirit. Furthermore, these colored blocks represent the flexibility of solutions and collaborative effort to architect AI solutions with customers. See the future of edge AI in actions! Visit Innodisk at Booth J0110, Hall 1, 1F, Nangang Exhibition Center from June 4th to 7th to explore more.","filter_flag":1}
