{"title":"The Belt and Road Initiative: A Key Pillar of the Global Community of Shared Future - China Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vZ2xvYmFsLmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzEwLzExL1dTNjUyNWRlMmJhMzEwOTA2ODJhNWU3ZDAxLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vZ2xvYmFsLmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzEwLzExL1dTNjUyNWRlMmJhMzEwOTA2ODJhNWU3ZDAxLmh0bWzSAQA?oc=5","id":"CBMiTGh0dHBzOi8vZ2xvYmFsLmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzEwLzExL1dTNjUyNWRlMmJhMzEwOTA2ODJhNWU3ZDAxLmh0bWzSAQA","guidislink":false,"published":"Wed, 11 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=284, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vZ2xvYmFsLmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzEwLzExL1dTNjUyNWRlMmJhMzEwOTA2ODJhNWU3ZDAxLmh0bWzSAQA?oc=5\" target=\"_blank\">The Belt and Road Initiative: A Key Pillar of the Global Community of Shared Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">China Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Belt and Road Initiative: A Key Pillar of the Global Community of Shared Future - China Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vZ2xvYmFsLmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzEwLzExL1dTNjUyNWRlMmJhMzEwOTA2ODJhNWU3ZDAxLmh0bWzSAQA?oc=5\" target=\"_blank\">The Belt and Road Initiative: A Key Pillar of the Global Community of Shared Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">China Daily<\/font>","source.href":"https:\/\/global.chinadaily.com.cn","source.title":"China Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Production\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"China Daily | Updated: 2023-10-11 07:28 The State Council Information Office of the People's Republic of China October 2023 Contents Preamble I. Proposed by China but Belonging to the Whole World II. Paving the Way Towards Shared Development and Prosperity III. Promoting All-Round Connectivity in Multiple Fields IV. Injecting Positive Energy into World Peace and Development V. Pursuing Steady and Sustained Progress in High-Quality BRI Cooperation Conclusion Preamble Over two millennia ago, inspired by a sincere wish for friendship, our ancestors travelled across grasslands and deserts to create a land Silk Road connecting Asia, Europe and Africa, leading the world into an era of extensive cultural exchanges. More than 1,000 years ago, our ancestors set sail and braved the waves to open a maritime Silk Road linking the East and the West, beginning a new phase of closer communication among peoples. Spanning thousands of miles and years, the ancient silk routes were not only routes for trade but also roads for cultural exchanges. They made a great contribution to human progress. In the 1980s, the United Nations and some countries began to envisage the Eurasian Land Bridge, the Silk Road Initiative, and other plans, reflecting a common wish to engage in communication and cooperation. In March 2013, President Xi Jinping proposed the vision of a global community of shared future; in September and October that year, he raised the initiatives of joining with others to build a Silk Road Economic Belt and a 21st Century Maritime Silk Road (Belt and Road Initiative, or BRI). The Belt and Road Initiative is a creative development that takes on and carries forward the spirit of the ancient silk routes — two of the great achievements in human history and civilization. It enriches the ancient spirit with the zeitgeist and culture of the new era, and provides a platform for building a global community of shared future. Since its launch 10 years ago, thanks to the combined efforts of all parties, cooperation under the BRI framework has expanded beyond the borders of China to become an international effort. It has evolved from ideas into actions, from a vision into reality, and from a general framework into concrete projects. It has been welcomed by the international community both as a public good and a cooperation platform, and has achieved solid results. Over the past decade, BRI cooperation has delivered real gains to participating countries. It has contributed to the sound development of economic globalization and helped to resolve global development challenges and improve the global governance system. It has also opened up a new path for all humanity to realize modernization, and ensured that the efforts of building a global community of shared future are delivering real results. The Chinese government is publishing this white paper to present the achievements of the BRI during the past 10 years. It will give the international community a better understanding of the value of the initiative, facilitate high-quality cooperation under it, and ultimately deliver benefits to more countries and peoples. I. Proposed by China but Belonging to the Whole World The world today is going through profound change on a scale unseen in a century. Problems and challenges continue to threaten the progress of human civilization. In response to a changing global situation and the expectations of the international community, and with the future and overall interests of humanity in mind, China proposed the Belt and Road Initiative (BRI). Committed to the Silk Road spirit, a great heritage of human civilization, the BRI connects the past, the present, and the future. This initiative was launched by China, but it belongs to the world and benefits the whole of humanity. 1. Rooted in history, the BRI carries forward the Silk Road spirit At around 140 BC during China's Han Dynasty, Zhang Qian, a royal emissary, made a journey to the West from Chang'an (present-day Xi'an in Shaanxi Province), opening an overland route linking the East and the West. Centuries later, in the years of the Tang, Song and Yuan dynasties, silk routes boomed both over land and at sea, facilitating trade between the East and the West. In the early 15th century, Zheng He, the famous Chinese navigator of the Ming Dynasty, made seven voyages to the Western Seas, which boosted trade along the maritime silk routes. For thousands of years the ancient silk routes served as major arteries of interaction, spanning the valleys of the Nile, the Tigris and Euphrates, the Indus and Ganges, and the Yellow and Yangtze rivers. They connected the birthplaces of the Egyptian, Babylonian, Indian and Chinese civilizations, the lands of the believers of Buddhism, Christianity and Islam, and the homes of peoples of different nationalities and races. These routes increased connectivity among countries on the Eurasian continent, facilitated exchanges and mutual learning between Eastern and Western civilizations, boosted regional development and prosperity, and shaped the Silk Road spirit characterized by peace and cooperation, openness and inclusiveness, mutual learning and mutual benefit. Symbolizing communication and cooperation between the East and the West, the millennia-old silk routes demonstrated that by upholding solidarity and mutual trust, equality and mutual benefit, inclusiveness and mutual learning, and win-win cooperation, countries of different ethnic groups, beliefs and cultural backgrounds could share peace and achieve development together. The Silk Road spirit is consistent with the ideal of \"all states joining together in harmony and peace\" long upheld by the Chinese nation, with the Chinese people's principles of amity, good neighborliness and \"helping others to succeed while seeking our own success\", and with the call of the times for peace, development and win-win cooperation. The Communist Party of China is a major political party with a global vision, and China is a major country pursuing peaceful development. The BRI, which carries forward the Silk Road spirit in the new era, evokes the pleasant memories of the past and has fired many countries' enthusiasm for connectivity. The BRI pays respect to history and tries to recreate the bustling scenes of untiring envoys and businessmen over land and countless ships calling at ports along the ancient silk routes. It is also navigating a way to the future by drawing wisdom and strength from the ancient silk routes and the Silk Road spirit. Enlightened by history, we will continue to move forward and integrate the Chinese Dream with the world's dreams, in order to realize the aspiration of all peoples for exchanges between civilizations, peace and tranquility, common development, and better lives. 2. In response to reality, the BRI resolves problems in development Development holds the master key to solving all problems. Economic globalization has given strong momentum to the world economy. Over 500 years ago, after the ancient silk routes had been interrupted for more than a half century, the Age of Discovery arrived, fundamentally changing the course of human society. Since the advent of modern times, technological revolutions and development of the productive forces have made economic globalization a surging historical trend. In particular, since the 1990s, the rapid advance of economic globalization has greatly facilitated trade, investment, flows of people, and technological progress, making an important contribution to the progress of human society. However, the economic globalization dominated by a few countries has not contributed to the common development that delivers benefits to all. Instead, it has widened the wealth gap between rich and poor, between developed and developing countries, and within developed countries. Many developing countries have benefited little from economic globalization and even lost their capacity for independent development, making it hard for them to access the track of modernization. Certain countries have practiced unilateralism, protectionism and hegemonism, hampering economic globalization and threatening a global economic recession. It is imperative to address such global problems as sluggish economic growth, shortcomings in economic governance, and imbalanced economic development. It is no longer acceptable that only a few countries dominate world economic development, control economic rules, and enjoy development fruits. The BRI targets development not only for China but for the world at large. Economic globalization remains an irreversible trend. It is unthinkable for countries to return to a state of seclusion or isolation. However, economic globalization must undergo adjustments in both form and substance. It should be made more open, inclusive, balanced and beneficial to all. China has not only benefited from economic globalization but also contributed to it. As an active participant in economic globalization, China has achieved rapid economic growth through positive interactions with the rest of the world and explored a unique path towards modernization, expanding the options for other developing countries to achieve modernization. China's rapid economic growth and steady progress in reform and opening up has provided a strong driving force for global economic stability and growth as well as an open world economy. China has been a firm advocate and defender of economic globalization. The BRI dovetails with the UN 2030 Agenda for Sustainable Development in concept, measures and goals. A major step taken by China, the BRI aims to promote higher-quality development through higher-standard opening up, and share China's development opportunities with the rest of the world. The BRI is also a Chinese solution to global development issues, which aims to advance modernization in participating countries in tandem, make economic globalization more dynamic, inclusive and sustainable, and ensure that more of the fruits will be shared more equitably by people across the world. 3. Oriented towards the future, the BRI creates a better world Today, the world is moving ever closer towards greater multipolarity, economic globalization, and cultural diversity, and becoming increasingly information-orientated in the process. Countries are more frequently connected and closely interdependent than at any time in the past. It is increasingly clear that humanity is a community of shared future in which everyone's interests are inseparably entwined. However, a growing deficit in peace, development, security and governance, together with interwinding conventional and non-conventional security issues such as regional conflicts, arms races, food security, terrorism, cyber-attacks, climate change, energy crises, major infectious diseases, and artificial intelligence problems, poses a grave threat to the beautiful planet on which all humans live. In the face of emerging global difficulties and challenges, human society needs new ideas, new concepts, and a more just, equitable, balanced, resilient and effective global governance system. What kind of world to build and which way to take to create a brighter future are issues that have a bearing on every country and every person. We must respond to the challenges presented by the times and make the right historic choice. As a major developing country that meets its responsibilities, China keeps in mind the future and the common interests of humanity. China has therefore proposed building a global community of shared future, with the goal of creating an open, inclusive, clean and beautiful world that enjoys lasting peace, universal security and common prosperity, charting a bright future for human development. The ultimate goal of the BRI is to help build a global community of shared future. As an important public good for improving global governance, the initiative provides a platform for turning the vision into reality. The BRI involves countries in different regions, at different development stages, and with different cultures. It transcends differences in ideologies and social systems. It enables different countries to share opportunities, realize common development and prosperity, and build a community of shared interests, responsibility and destiny characterized by mutual political trust, economic integration and cultural inclusiveness. As a practical means of building a global community of shared future, the BRI has created new understanding and inspired the imagination of the world, and contributed new ideas and new approaches to international exchanges. It will produce a fairer and more equitable global governance system, and take humanity to a better future. II. Paving the Way Towards Shared Development and Prosperity The BRI is in alignment with the concept of a global community of shared future. It promotes and puts into action ideas that are relevant to the present era, the world, development, security, openness, cooperation, civilization, and governance. It provides not only a conceptual framework but also a practical roadmap for all nations to achieve shared development and prosperity. 1. Principles: extensive consultation, joint contribution, and shared benefits The BRI is founded on the principles of extensive consultation, joint contribution, and shared benefits. It advocates win-win cooperation in pursuit of the greater good and shared interests. It emphasizes that all countries are equal participants, contributors and beneficiaries, and encourages economic integration, interconnected development, and the sharing of achievements. The principle of extensive consultation signifies that the BRI is not a solo endeavor by China, but a collaborative effort involving all stakeholders. This principle promotes and activates authentic multilateralism, encouraging collective decision-making while fully respecting the varying levels of development, economic structures, legal systems, and cultural traditions of different nations. It emphasizes equal participation, effective communication, collective wisdom, freedom from any political or economic preconditions, and voluntary engagement to foster maximum consensus. Irrespective of size, strength and wealth, all countries participate on an equal footing and can provide opinions and proposals in bilateral and multilateral cooperation. Under this principle, economies at different stages of development will reinforce bilateral or multilateral communication, jointly identify and establish innovative cooperation mechanisms, and provide a platform for dialogue, cooperation and participation in global governance. The principle of joint contribution highlights that the BRI is not one of China's international aid programs or geopolitical tool, but a collaborative effort for shared development. It aims to align with existing regional mechanisms rather than becoming their substitute and leverage complementary strengths. This principle emphasizes the participation of all parties involved, substantial coordination with the development strategies of relevant countries and regions, and the identification and utilization of their respective development potential and comparative strengths. The objective is to collectively create new opportunities, driving forces, and development space while achieving complementary and interactive growth by capitalizing on each party's strengths and capabilities. To promote extensive participation, this principle encourages countries and businesses to engage through various forms such as bilateral cooperation, third-party market cooperation and multilateral cooperation, thereby creating synergy for development. This principle values market forces and promotes market-oriented operations to further the interests and meet the expectations of all parties involved. In this context, businesses play a central role as the main actors, while the government's responsibility lies in building platforms, establishing mechanisms, and providing policy guidance. China's key role in BRI cooperation stems from its economic size, market scale, experience in infrastructure construction, capacity to produce low-cost, high-quality, high-performance equipment, and comprehensive strengths in industry, capital, technology, talent and management. The principle of shared benefits underscores the importance of win-win cooperation. It aims to identify common interests and grounds for cooperation, meet the development needs of all parties, and address the real concerns of the people. This principle emphasizes sharing development opportunities and outcomes among all participating countries, ensuring that none of them is left behind. Most participants are developing countries, all seeking to leverage collective strengths to address challenges such as inadequate infrastructure, lagging industrial development, limited industrialization, insufficient capital and technology, and a shortage of skilled workers, to promote their own economic and social development. Under the BRI framework, China pursues the greater good and shared interests, with the former taking precedence, by providing assistance to partner countries within its capabilities and genuinely supporting other developing countries to accelerate development. Simultaneously, through BRI cooperation, China aims to foster all-round opening up by building connections with other countries over land and sea while creating synergy between its eastern and western regions. It seeks to build a more advanced open economy and create a double development dynamic with the domestic economy as the mainstay and the domestic economy and international engagement providing mutual reinforcement. 2. Concepts: open, green and clean cooperation The BRI is committed to open, green and clean cooperation towards inclusive and sustainable development. It has zero tolerance for corruption and promotes steady and high-quality growth. The BRI is a public road open to all, not a private path owned by any single party. It is free from geopolitical calculations. It does not aim to create an exclusive club, nor does it target at any party. It does not form cliques based on specific ideological standards. It has no intention of establishing military alliances. Countries from Eurasia, Africa, the Americas, and Oceania are all welcome to participate in the initiative, regardless of their political system, historical background, culture, development stage, ideology, or religious beliefs, as long as they seek common development. All participants uphold principles of openness and inclusiveness, while firmly opposing protectionism, unilateralism and hegemonism, and working together to create an all-round, three-dimensional landscape of interconnectivity. The goals are to develop a new model of cooperation based on win-win outcomes, shared responsibility, and collective participation, build a global network of partnerships, and nurture a harmonious coexistence for humanity. The BRI embraces the global trend of green and low-carbon development, emphasizes respecting and protecting nature and following its laws, and respects the right of all parties to pursue sustainable and eco-friendly growth. Based on a shared commitment to eco-environmental considerations, the parties involved have carried out policy dialogues, and shared ideas and achievements in green development. Through closer cooperation in areas such as green infrastructure, renewable energy, eco-friendly transport, and sustainable finance, all parties work together to broaden consensus and take concrete steps towards green development. The ultimate goal is to establish a resource-efficient, eco-conscious and low-carbon Silk Road, thereby making a significant contribution to protecting the eco-environment, achieving peak carbon and neutrality goals and addressing climate change. Leveraging its expertise in renewable energy, energy conservation, environmental protection and clean production, and employing Chinese technology, products and experience, China actively promotes BRI cooperation in green development. Clean governance is considered an intrinsic and necessary condition for the steady and sustained development of the BRI, with a commitment to transparency in cooperation. All participants joined to combat corruption, strengthening their legal systems and mechanisms, harmonizing their laws and regulations, and fostering international cooperation. Furthermore, all participants stand united against all forms of corruption and other international criminal activities, and work consistently to combat commercial bribery. This ensures that financial resources and projects are managed with integrity and efficiency, leading to greater outcomes and making BRI cooperation an example of clean governance. In April 2019, together with relevant countries, international organizations, and representatives from the business and academic communities, China launched the Beijing Initiative for the Clean Silk Road. This initiative calls for a clean Silk Road characterized by extensive consultation, joint contribution, and shared benefits. Chinese companies expanding globally are committed to compliance and lawful operations, adhering to the laws of both China and the host countries and to international norms. They have particularly heightened their capacity to mitigate overseas operational risks, strengthening project supervision and management to ensure the delivery of clean, cost-efficient and high-quality projects. State-owned enterprises (SOEs) directly under the central government have released 868 guidelines of compliance in key areas, and defined 5,000-plus job compliance responsibilities; SOEs and financial institutions directly under the central government and their branches have formulated and updated more than 15,000 rules for managing overseas operations. In November 2020, more than 60 Chinese enterprises engaged in extensive BRI cooperation joined in launching the Integrity and Compliance Initiative for BRI Enterprises. 3. Objectives: high standards, sustainability, and better lives The BRI aims at high standards, sustainability, and better lives by raising cooperation standard, investment effectiveness, supply quality, and development resilience, delivering real and substantive results for all participants. The BRI introduces universally accepted rules and standards to guide business practices in project tendering, procurement, development and operation. It promotes high-standard cooperation and construction in various sectors. It advocates establishing free trade zones in alignment with international rules and standards, and implementing policies to promote trade and investment liberalization and facilitation to a higher level. This will ensure safe, smooth and orderly flows of people, goods, funds and data, and enable greater interconnectivity and deeper exchanges and cooperation. The approach emphasizes world-class standards, practicality, and cost-effectiveness. Pilot projects precede wider implementation, and participating countries are encouraged to adopt rules and the path adapted to their national conditions. China has established a high-level leadership organization and issued policy documents to consistently improve BRI design and implementation. In alignment with the UN 2030 Agenda for Sustainable Development, the BRI promotes coordinated economic, social, and eco-environmental development. Its aims are to address the root causes and obstacles that hinder development and boost the self-driven development of participating countries. It strives to achieve lasting, inclusive and sustainable economic growth, integrating sustainable development principles into project selection, implementation and management. Following international practices and debt sustainability principles, it is working to create a long-term, stable, sustainable and risk-controlled investment and financing system with innovative models and diverse channels in order to establish a stable, transparent and high-quality funding guarantee system that ensures commercial and fiscal sustainability. No participating country has fallen into a debt crisis as a result of BRI cooperation. The BRI takes a people-centered approach, with the focus on poverty eradication, job creation, and improvement of people's wellbeing to ensure that the benefits of cooperation reach all individuals. Deeper cooperation is encouraged in areas such as public health, poverty reduction, disaster mitigation, green development, science and technology, education, culture, arts, and health care. Closer exchanges are promoted among political parties, social organizations, think tanks, youth, women, and sub-national communities. These efforts aim to create projects that are grounded in the needs of the people, increasing their sense of gain and fulfillment. China actively promotes small-scale yet impactful projects through foreign aid, benefiting people's lives. From Asia to Africa, Latin America to the South Pacific, the construction of roads, railways, schools, hospitals and agricultural facilities contributes to poverty reduction and improves the people's wellbeing in participating countries. 4. Vision: a path to global wellbeing An initiative towards progress, cooperation and inclusiveness, the BRI pursues development, promotes win-win outcomes, and inspires hope. It aims to deepen understanding and trust, strengthen comprehensive exchanges, and ultimately achieve common development and shared prosperity. A path to peace. Peace is a prerequisite for development, while development serves as the foundation for peace. The BRI goes beyond the law of the jungle and the hegemonic order based on power struggles. It rejects zero-sum thinking and discards the Cold War mentality of ideological rivalry and geopolitical competition. Instead, it paves the way for peaceful development, and aims to offer a fundamental approach to lasting peace and universal security. Under the BRI, nations respect each other's sovereignty, dignity, territorial integrity, development path, social system, core interests, and major concerns. As the initiator of the BRI, China passionately campaigns for the establishment of a new model of international relations characterized by mutual respect, equity, justice, and win-win cooperation. It is committed to building partnerships based on dialogue rather than confrontation, and friendship rather than alliance, and to fostering a new vision of common, comprehensive, cooperative and sustainable security. These efforts help to create a peaceful and stable development environment. A path to prosperity. The BRI is committed to building a prosperous future that diverges from the exploitative colonialism of the past, avoids coercive and one-sided transactions, rejects the center-periphery model of dependency, and refuses to displace crisis onto others or exploit neighbors for self-interest. Instead, it aims to achieve win-win outcomes and shared development and prosperity. Under the BRI, all parties will prioritize development as the common goal, leveraging their respective resources and potential advantages, igniting their own growth engines, growing their capacity for independent development, and collectively creating more opportunities and space for development. This collaborative effort aims to foster new centers and impetus for global economic growth, drive inclusive growth, and bring global development into a balanced, coordinated and inclusive new stage. A path to openness. The BRI represents an open and inclusive collaborative process that transcends national borders, ideological differences, developmental disparities, social system variations, and geopolitical conflicts. It is not aimed at designing a new international system, but rather supplementing and improving the existing mechanisms. All parties involved uphold the core values and fundamental principles of the multilateral trading system. Together, participants will establish an open and cooperative platform, safeguard and promote an open global economy, create an environment conducive to open development, construct a fair, equitable and transparent system of international trade and investment rules, and advance cooperation based on win-win outcomes, shared responsibility and collective participation. The BRI facilitates the orderly flow of production factors, the efficient allocation of resources, deep integration of markets, and liberalization and facilitation of trade and investment, and ensures the stable performance and smooth operation of global industrial and supply chains. It aims to build an economic globalization that is open, inclusive, balanced, and beneficial to all. A path to innovation. Innovation serves as a critical driving force for progress. The BRI is dedicated to innovation-led development, harnessing the opportunities presented by digital, internet-based and smart development. It explores new business forms, technologies and models, seeking out fresh sources of growth and innovative development pathways to propel transformative advancements for all involved. Participants collaborate to connect digital infrastructure, build the Digital Silk Road, strengthen innovative cooperation in cutting-edge fields, and promote the deep integration of science, technology, industry and finance. These efforts aim to optimize the environment for innovation, gather innovative resources, foster a regional ecosystem of collaborative innovation, and bridge the digital divide, injecting strong momentum into common development. A path to social progress. The BRI champions equality, mutual learning, dialogue, and inclusiveness among civilizations. It upholds the shared values of peace, development, equity, justice, democracy and freedom. It transcends barriers between cultures through exchanges, resolves conflicts through mutual understanding, and rejects superiority while promoting coexistence. It encourages civilizations to appreciate their differences, seek common ground, and learn from one another. Parties involved will establish multitiered mechanisms for people-to-people cooperation, create more platforms and channels, and facilitate exchanges across various fields. These efforts aim to reinforce mutual understanding, respect and trust among nations, broaden consensus on ideas and values, and achieve new human progress. Chinese instructor Jiang Liping (right) and apprentice Horace Owiti walk past a train carriage on the Mombasa-Nairobi Railway in Nairobi, Kenya, in May. The 592-kilometer railway is hailed as a result of the Belt and Road Initiative and a route of friendship and win-win cooperation. WANG GUANSEN\/XINHUA III. Promoting All-Round Connectivity in Multiple Fields To promote greater connectivity through BRI cooperation, we have continued to facilitate policy coordination, infrastructure connectivity, unimpeded trade, financial integration, and closer people-to-people ties, by orienting towards \"hard connectivity\" in infrastructure, bolstering \"soft connectivity\" through harmonized rules and standards, and strengthening people-to-people bonds. As its scope expands, the BRI has become the world's largest platform for international cooperation, with the broadest coverage. 1. Extensive and in-depth policy coordination Policy coordination underpins BRI cooperation. China has worked with participating countries and international organizations to establish a multilevel policy coordination and communication mechanism for aligning development strategies, technological and economic policies, and administration rules and standards. Under this mechanism, plans and measures for regional cooperation have been formulated through joint efforts to facilitate and speed up cooperation, making the BRI an important collaborative framework for international exchanges. Strategy and policy coordination is expanding in scope. At the global level, the 193 UN member states unanimously agreed to incorporate the Belt and Road Initiative in the UN resolution passed at the 71st United Nations General Assembly in November 2016. In March 2017, the United Nations Security Council adopted Resolution 2344, calling for stronger regional economic cooperation through the BRI, among other initiatives. The United Nations Development Programme and the World Health Organization (WHO) have signed BRI cooperation agreements with China. At the World Trade Organization (WTO), China's efforts have facilitated the conclusion of the negotiations on the text of the Investment Facilitation for Development Agreement, with a view to establishing a coordinated and unified investment management system covering more than 110 countries and regions to encourage BRI cooperation on investment. At regional and multilateral levels, the BRI has supported regional integration and global development by aligning with plans such as the UN 2030 Agenda for Sustainable Development, the Master Plan on ASEAN Connectivity 2025, the ASEAN Outlook on the Indo-Pacific, the African Union's Agenda 2063, and the European Union's Strategy on Connecting Europe and Asia. At the bilateral level, the BRI has succeeded in coordinating with a wide range of strategies and initiatives, including Russia's Eurasian Economic Union framework, Kazakhstan's Bright Road economic policy, Turkmenistan's strategy of reviving the Silk Road, Mongolia's Steppe Road plan, Indonesia's Global Marine Fulcrum initiative, the Philippines' Build Better More program, Vietnam's Two Corridors and One Economic Circle plan, South Africa's Economic Reconstruction and Recovery Plan, Egypt's Suez Canal Corridor Project, and Saudi Arabia's Vision 2030. By June 2023, China had signed more than 200 BRI cooperation agreements with more than 150 countries and 30 international organizations across five continents, yielding a number of signature projects and small-scale yet impactful projects. A long-term mechanism for policy coordination is largely in place. Multilevel channels for regular communication among different parties have been opened up on different platforms. This has been made possible through top-down driven diplomatic efforts led by heads of state, with support from intergovernmental strategic communication and local and interdepartmental policy coordination, and with cooperation projects carried out by enterprises and social organizations. China has hosted the Belt and Road Forum for International Cooperation twice, providing an important platform for participating countries and international organizations to expand exchanges, increase mutual trust, and strengthen ties. The first forum in 2017 welcomed heads of state and government from 29 countries, and more than 1,600 representatives from 140-plus countries and 80-plus international organizations, yielding a total of 279 deliverables in five categories. At the second forum held in 2019, 40 leaders, including heads of state and government from 38 countries, the UN secretary-general and the International Monetary Fund's managing director, attended the Leaders' Roundtable. More than 6,000 representatives participated, from over 150 countries and 92 international organizations, yielding 283 deliverables in 6 categories. Multilateral cooperation is driving forward. Under the BRI framework, Chinese and foreign partners have launched 20-plus multilateral dialogue and cooperation mechanisms in professional domains such as railways, ports, energy, finance, taxation, environmental protection, disaster prevention and relief, think tanks, and the media, attracting a growing number of participants. BRI participating countries have also expanded practical cooperation through major multilateral platforms such as China-ASEAN (10+1) Cooperation, Forum on China-Africa Cooperation, China-Arab States Cooperation Forum, Forum of China and the Community of Latin American and Caribbean States, China-Pacific Island Countries Economic Development and Cooperation Forum, China-Central and Eastern European Countries Cooperation, World Economic Forum, Boao Forum for Asia, and CPC and World Political Parties Summit. Rules and standards are being coordinated. Cooperation on standardization has advanced to new levels. As of June 2023, China had signed 107 documents with standardization bodies in 65 countries such as Pakistan, Russia, Greece, Ethiopia, and Costa Rica and also with regional and international organizations, in areas covering civil aviation, climate change, agri-food, building materials, electric vehicles, oil and gas pipelines, logistics, small hydropower stations, oceanography, and surveying and mapping. The Standard Information Platform Contributed by the Belt and Road Countries provides overviews of standards information in 149 partner countries, and full-text search services for standards catalogues regarding 59 countries and 6 regional and international standardization organizations, serving as a bridge for participating countries. Chinese standards in foreign language versions have been supplied in larger quantities. Nearly 1,400 national standards and more than 1,000 industry standards have been published in foreign languages. In May 2022, the Asian-African Legal Consultative Organization opened a regional arbitration center in Hong Kong, providing solutions for multilateral disputes in BRI cooperation. China has continued to strengthen cross-border accounting and auditing regulatory cooperation with 22 countries and regions including Russia, Malaysia and Singapore, providing institutional guarantees for expanding cross-border investment and financing channels. 2. Growing connectivity of infrastructure The BRI prioritizes connectivity of infrastructure. Based on a framework comprising \"six corridors, six routes, and multiple countries and ports\", a multitiered and multidimensional infrastructure network is taking shape. Basic connectivity over land, maritime, air and cyberspace is in place, laying solid foundations for deeper cooperation in trade and industrial capacity, and strengthening cultural and people-to-people exchanges. The construction of economic corridors and international routes is making substantial progress. Participating countries have pressed forward with the creation of international arterial routes, building an infrastructure network that connects subregions in Asia as well as the continents of Asia, Europe and Africa. Major projects along the China-Pakistan Economic Corridor are under way. The Peshawar-Karachi Motorway (Sukkur-Multan section), the Karakoram Highway Phase II(Havelian-Thakot section), and the Lahore Orange Line Metro are all open to traffic. Coal-fired power plants such as Sahiwal, Port Qasim, Thar, and Hub are operating safely and steadily; the Mehra DC transmission project is operational; and the Kalot Hydropower Station is connected to the power grid. Rashakai Special Economic Zone has reached the stage of comprehensive development. Along the New Eurasian Land Bridge, the Belgrade-Novi Sad section of the Hungary-Serbia Railway in Serbia became operational in March 2022, and track-laying has started on the Budapest-Kelebija section in Hungary. The Peljesac Bridge in Croatia has celebrated its first anniversary of opening to traffic. The Western Europe-Western China Highway has been completed. The Smokovac-Matesevo section of the Bar-Boljare Highway in Montenegro has been completed and is open to traffic. Along the China-Indochina Peninsula Economic Corridor, the China-Laos Railway has been completed and is providing sound service, and its role as a golden transport channel is becoming increasingly prominent. The Jakarta-Bandung High-speed Railway, the flagship project of BRI cooperation between China and Indonesia, has achieved an operational speed of 350 km per hour. The contract for the China-Thailand Railway Phase I (Bangkok-Nakhon Ratchasima section) was signed online, and 11 sections of the construction project have started, including one that has been completed. Along the China-Mongolia-Russia Economic Corridor, the Heihe-Blagoveshchensk Highway Bridge and the Tongjiang-Nizhneleninskoye Railway Bridge, connecting China and Russia, have opened to traffic. The China-Russia eastern natural gas pipeline is fully operational. China, Russia and Mongolia have officially launched a feasibility study on the upgrading and development of the central-route railway of the China-Mongolia-Russia Economic Corridor. Along the China-Central Asia-West Asia Economic Corridor, the China-Kyrgyzstan-Uzbekistan Highway is in full operation. The China-Central Asia Gas Pipeline is fully operational. The grain and oil rail transport lines between North Kazakhstan and China are operating in conjunction with the China-Europe Railway Express. Along the Bangladesh-China-India-Myanmar Economic Corridor, the China-Myanmar Crude Oil and Gas Pipeline has been completed and entered service. The feasibility study on the Muse-Mandalay section of the China-Myanmar Railway has been completed, and the feasibility study on the Mandalay-Kyaukphyu section has been launched. Construction projects in Bangladesh, including the Bangladesh-China Friendship Bridge and the Dohazari-Cox's Bazar rail route, have made good progress. Panel 1 Mombasa-Nairobi Railway promotes Kenya's economic and social development The Mombasa-Nairobi Standard Gauge Railway in Kenya connects Mombasa, the largest port in East Africa, and Nairobi, the capital of Kenya. It extends further northwest to Suswa. The line is 592 kilometers long. It utilizes Chinese standards, technology, equipment, and project management. It is an important success story in BRI cooperation between China and Kenya, and is hailed as a route of friendship, of win-win cooperation, of development and prosperity, and of eco-environmental protection. The Mombasa-Nairobi Railway is the largest infrastructure project undertaken in Kenya since independence. Since it opened in 2017, the railway has had a positive impact on Kenya's economic and social development and the people's wellbeing; it has also significantly reduced the logistics costs of products from the inland regions of East Africa exported through the Mombasa Port. As of August 31, 2023, the railway is operating an average of 6 passenger trains per day; a total of 11 million passengers have been carried, and the average occupancy rate is above 95 percent; an average of 17 freight trains operate daily, and a total of 28 million tonnes of goods have been transported. According to Kenyan government estimates, the railway has added 2 percent to Kenya's economic growth. In the construction and operation of the Mombasa-Nairobi Railway, Chinese enterprises have supported technology transfer and provided training to local employees. During the construction period, more than 30,000 local employees received orientation training, and every year a number of young Kenyans were selected to participate in training and academic education in China. Since the opening of the railway, Chinese companies have adopted tailored training methods for different people, professions and posts, and have trained 1,152 professionals for Kenya. In Africa, railways such as the Mombasa-Nairobi Railway and the Addis Ababa-Djibouti Railway are now operational and have become important drivers of in-depth development not only in East Africa but across the entire continent. Maritime connectivity is steadily improving. Cooperation is expanding in shipping among the ports of participating countries, and the efficiency of cargo transportation has seen notable increase. The annual cargo throughput of the Port of Piraeus in Greece has increased to above 5 million twenty-foot equivalent units (TEUs), making it the fourth largest TEU port in Europe and a leading TEU port in the Mediterranean. The Gwadar Port in Pakistan has seen major progress and is marching towards the goal of becoming a logistics center and industrial base. Preliminary work is currently under way on the Kyaukphyu Deep-sea Port project in Myanmar, including geological exploration and environmental and social assessment. The annual throughput of bulk cargo at Hambantota Port in Sri Lanka has increased to 1.21 million tonnes. The Vado Gateway terminal has become the first semi-automatic terminal operating in Italy. The Lekki Deep-sea Port in Nigeria has been completed and entered service, becoming a major modern deep-water port in Central and Western Africa. The Silk Road Maritime network has continued to expand. By the end of June 2023, it had reached 117 ports in 43 countries, and more than 300 well-known Chinese and international shipping companies, port enterprises and think tanks, among other bodies, have joined the Silk Road Maritime association. A marine environment forecast and support system that focuses on areas along the Maritime Silk Road offers services to more than 100 cities in participating countries. The Air Silk Road has made notable progress. The aviation route network between participating countries is expanding rapidly, and the level of air connectivity is steadily improving. China has signed bilateral air transport agreements with 104 BRI partner countries and opened direct flights with 57 partner countries to facilitate cross-border transport. Chinese enterprises are active participants in civil aviation infrastructure cooperation with partner countries including Pakistan, Nepal and Togo, helping to develop the local civil aviation industry. A BRI cooperation platform proposed by the Civil Aviation Administration of China was established in August 2020, improving mechanisms and platforms of civil aviation exchanges and cooperation among participating countries. During the Covid-19 pandemic, a direct line of the Air Silk Road linking Zhengzhou in Henan Province and Luxemburg did not suspend its air or freighting services, and transported a large amount of supplies. It served as an air lifeline between China and Europe, and contributed to keeping international industrial and supply chains stable. International inter-modality transport channels continue to enjoy stable development. These channels include the China-Europe Railway Express, the China-Europe Land-Sea Express Line, the New International Land-Sea Trade Corridor, and the Lianyungang-Khorgos New Eurasian Land-Sea Expressway. The China-Europe Railway Express has now reached more than 200 cities in 25 European countries, comprising 86 routes passing through the main regions of the Eurasian hinterland at a speed of 120 km per hour. Its logistics distribution network covers the entire Eurasian continent. By the end of June 2023, the cumulative volume of the China-Europe Railway Express had exceeded 74,000 trips, transporting nearly 7 million TEUs and over 50,000 types of goods in 53 categories such as automobiles, mechanical equipment, and electronic products, to a total value of more than US$300 billion. The China-Europe Land-Sea Express Line has emerged from scratch to become the third trade channel between China and Europe, after traditional sea routes and the China-Europe Railway Express. In 2022, more than 180,000 TEUs were transported through this line, with rail trips exceeding 2,600. The routes of rail-sea freight trains of the New International Land-sea Trade Corridor cover 18 provinces and equivalent administrative units, in central and western China, transporting goods to 300-plus ports in more than 100 countries. 3. Unimpeded, convenient and efficient trade Facilitating trade and investment is a major task in building the Belt and Road. The participating countries have worked hard to promote trade and investment liberalization and facilitation, remove investment and trade barriers, and improve the business environment within the region and in all related countries. Efforts have been made to build free trade zones, broaden trading areas, improve trade structure, expand areas of mutual investment and industrial cooperation, establish a more balanced, equal and sustainable trading system, and develop mutually beneficial economic and trade relations, so as to make the \"pie\" of cooperation bigger. Trade and investment are expanding steadily. From 2013 to 2022, the cumulative value of imports and exports between China and BRI partner countries reached US$19.1 trillion, with an average annual growth rate of 6.4 percent. The cumulative two-way investment between China and partner countries reached US$380 billion, including US$240 billion from China. The value of newly signed construction contracts with partner countries reached US$2 trillion, and the actual turnover of Chinese contractors reached US$1.3 trillion. In 2022, the value of imports and exports between China and partner countries reached nearly US$2.9 trillion, accounting for 45.4 percent of China's total foreign trade over the same period, representing an increase of 6.2 percentage points compared with 2013; the total value of imports and exports of Chinese private enterprises to partner countries exceeded US$1.5 trillion, accounting for 53.7 percent of the trade between China and these countries over the same period. Trade and investment liberalization and facilitation is improving. BRI participating countries continue to uphold multilateralism and free trade, working hard to create a sound institutional environment for closer economic and trade relations. Positive progress has been made in the alignment of working systems, coordination of technical standards, mutual recognition of inspection results, and online verification of electronic certificates. By the end of August 2023, more than 80 countries and international organizations had subscribed to the Initiative on Promoting Unimpeded Trade Cooperation Along the Belt and Road, proposed by China. China had signed 21 free trade agreements with 28 countries and regions. On January 1, 2022, the Regional Comprehensive Economic Partnership (RCEP) agreement entered into force, creating the world's largest free trade zone in terms of population size and trade volume. The RCEP and the BRI overlap and complement each other in terms of participating countries and regions, as well as areas and contents of cooperation, forming a new dynamic of economic and trade cooperation in Asia. China also works actively towards joining the Comprehensive and Progressive Agreement for Trans-Pacific Partnership and the Digital Economy Partnership Agreement. China has signed bilateral investment agreements with 135 countries and regions, and conventions for the avoidance of double taxation (including arrangements and agreements) with 112 countries and regions. It has achieved Authorized Economic Operator mutual recognition with 35 partner countries, and has signed third-party market cooperation documents with 14 countries. China has established a \"single-window\" cooperation mechanism with Singapore, Pakistan, Mongolia, Iran and other partner countries, and signed cooperation documents on customs inspection and quarantine, effectively improving the efficiency of customs clearance at border ports. Trade and investment platforms are playing a growing role. China International Import Expo (CIIE) is the world's first import-themed national-level expo and has been held for the past five years. It has resulted in a cumulative intended turnover of nearly US$350 billion, and about 2,000 launches of new products. With diverse participants from many countries and regions, the CIIE has become a global platform for international procurement, investment promotion, cultural exchanges, and open cooperation. The influence of key exhibitions continues to expand; these include China Import and Export Fair (Canton Fair), China International Fair for Trade in Services, China International Fair for Investment and Trade, China International Consumer Products Expo, Global Digital Trade Expo, China-Africa Economic and Trade Expo, China-Arab States Expo, China-Russia Expo, China-CEEC Expo & International Consumer Goods Fair, China-ASEAN Expo, and China-Eurasia Expo. All of these have provided a strong boost to trade and investment cooperation among participating countries. The Hong Kong SAR has held the Belt and Road Summit eight times, and the Macao SAR has held the International Infrastructure Investment and Construction Forum 14 times, which have played an important role in advancing economic, trade and investment cooperation along the Belt and Road. Industrial cooperation is deepening. BRI participating countries have worked hard to foster a paradigm of cooperation based on coordinated development, mutual benefit, and win-win outcomes, which has given a strong boost to upgrading industrial structures and optimizing industrial chains in the countries involved. The participating countries have jointly promoted cooperation on industrial capacity, expanded cooperation in traditional industries including steel, non-ferrous metals, building materials, automobiles, engineering machinery, resources and energy, and agriculture, explored cooperation in emerging industries such as the digital economy, new energy vehicles, nuclear energy and technology, and 5G, and carried out tri-party and multiparty market cooperation, thus advancing mutual complementarity and providing mutual benefits to all parties. By the end of June 2023, China had signed agreements on industrial capacity cooperation with more than 40 countries. China Mining Conference& Exhibition and China-ASEAN Mining Cooperation Forum& Exhibition serve as important platforms for participating countries to conduct mining capacity cooperation. The Shanghai Cooperation Organization (SCO) Demonstration Base for Agricultural Technology Exchange and Training has supported advances in agricultural science and technology under the BRI, and promoted economic and trade cooperation in agriculture among participating countries. Jointly constructed by China and Pakistan, the K2 and K3 units of the Karachi Nuclear Power Plant have been completed and are in operation, utilizing China's Hualong One nuclear technology. The Ulba Fuel Assembly Plant, a successful joint venture between China and Kazakhstan, is now operational. The China-ASEAN Forum on Peaceful Uses of Nuclear Technology has served as a bridge to establish connectivity, enabling BRI participating countries to cooperate on nuclear technology and promote growth and people's wellbeing. More than 70 overseas industrial parks have been built by Chinese enterprises together with governments and enterprises in partner countries. The China-Malaysia and China-Indonesia \"Two Countries, Twin Parks\" projects, the China-Belarus Great Stone Industrial Park, the China-UAE Industrial Capacity Cooperation Demonstration Zone, and the China-Egypt TEDA Suez Economic and Trade Cooperation Zone are making steady progress. 4. Diverse dynamics of financial integration Financial integration is an important pillar of BRI cooperation. Participating countries and relevant institutions have carried out multiple forms of financial cooperation, created new models, expanded the channels, diversified the parties involved, and improved the mechanisms for investment and financing. They have promoted policy-based finance, development finance, commercial finance, and cooperative finance to support BRI cooperation, and worked to build a long-term, stable and sustainable investment and financing system that keeps risk under control. The financial cooperation mechanisms are maturing. China Development Bank (CDB) has promoted the establishment of multilateral financial cooperation mechanisms such as China-Central and Eastern Europe Interbank Consortium, the China-Arab Countries Interbank Association, China-ASEAN Interbank Association, the ASEAN Plus Three Interbank Cooperation mechanism, China-Africa Interbank Association, and the Association of China-LAC Development Financial Institutions. The Industrial and Commercial Bank of China (ICBC) has promoted the Belt and Road Interbank Regular Cooperation (BRBR) mechanism. As of the end of June 2023, a total of 13 Chinese-funded banks had established 145 first-tier offices and branches in 50 BRI partner countries; some 17.7 million businesses in 131 partner countries had opened UnionPay services, and 74 partner countries had opened UnionPay mobile payment services. The Belt and Road Innovation and Development Center, the Research Center for Belt and Road Financial and Economic Development, and the China-IMF Capacity Development Center have been established. China has signed bilateral currency swap agreements with 20 partner countries and established renminbi (RMB) clearing arrangements in 17 partner countries. The number of participants, business volume, and influence of the RMB cross-border payment system have gradually increased, effectively facilitating trade and investment. Financial regulation cooperation and exchanges have continued to move forward. China Banking and Insurance Regulatory Commission (now National Administration of Financial Regulation), China Securities Regulatory Commission (CSRC), and regulatory agencies from multiple other countries have signed memorandums of understanding (MoUs) for regulatory cooperation, facilitating the establishment of regional regulatory coordination mechanisms, promoting efficient allocation of funds, strengthening risk control, and creating sound investment conditions for various financial institutions and investment entities. The channels and platforms for investment and financing are constantly expanding. China has funded the establishment of the Silk Road Fund (SRF) and established the Asian Infrastructure Investment Bank (AIIB) with other participating countries. The SRF specifically serves BRI cooperation. By the end of June 2023, the fund had signed agreements on 75 projects with committed investment of about US$22 billion; the number of AIIB members had reached 106, and the bank had approved 227 projects with a total investment of US$43.6 billion. The projects involve transport, energy, public health and other fields, providing investment and financing support for infrastructure connectivity and sustainable economic and social development. China has actively participated in various existing financing arrangements. It has signed memorandums of cooperation with international financial institutions such as the World Bank and the Asian Development Bank, worked with international financial institutions to establish a multilateral development financing cooperation center, strengthened third-party market cooperation in investment and financing with the European Bank for Reconstruction and Development, and carried out joint financing with the International Finance Corporation, the African Development Bank and others. These moves have effectively mobilized market capital. China has initiated the establishment of international economic cooperation funds such as the China-Eurasian Economic Cooperation Fund, the China-LAC Cooperation Fund, the China-Central and Eastern Europe Investment Cooperation Fund, the China-ASEAN Investment Cooperation Fund, the China-LAC Industrial Cooperation Investment Fund, and the China-Africa Fund for Industrial Cooperation. These have effectively expanded investment and financing channels for partner countries. The CDB and the Export-Import Bank of China (China Eximbank) have each set up special loans for the BRI to pool resources to increase financing support for BRI cooperation. By the end of 2022, the CDB has provided direct high-quality financial services for more than 1,300 BRI projects, playing a leading role in guiding development finance, and pooling all kinds of domestic and foreign funds for BRI cooperation. The balance of loans of China Eximbank for BRI projects reached RMB2.2 trillion, covering 130-plus participating countries and driving more than US$400 billion of investment and more than US$2 trillion of trade. China Export& Credit Insurance Corporation has fully applied export credit insurance and actively provided comprehensive guarantees for building the Belt and Road. Innovative investment and financing methods are steadily being explored. Various models such as funds and bonds have been developed, and BRI financial cooperation is improving. China's securities industry has set up a number of BRI-themed funds and indexes. In December 2015, the CSRC officially launched a pilot project for overseas institutions to issue RMB-denominated bonds (panda bonds) in China's exchange-traded bond market. By the end of June 2023, overseas issuers in total had issued 99 panda bonds in China's exchange-traded bond market, with a total value of RMB152.54 billion; 46 BRI-themed bonds had been issued, with a total value of RMB52.72 billion. Green finance is steadily developing. In May 2019, the ICBC issued the first green BRBR bond that conformed to both international and domestic green bond standards. By the end of 2022, more than 40 large global institutions had signed the Green Investment Principles for the Belt and Road. In June 2023, China Eximbank issued financial bonds for promoting international cooperation in building the Belt and Road and supporting infrastructure construction of partner countries. China's domestic stock and futures exchanges have steadily promoted practical cooperation in equity, products, technology and other fields with the exchanges in partner countries, and actively supported the development of exchanges participating in or holding shares in BRI projects, such as the Astana International Exchange in Kazakhstan, the Pakistan Stock Exchange, and the Dhaka Stock Exchange in Bangladesh. Debt sustainability has continued to improve. Based on the principle of equal participation and benefit and risk sharing, China and 28 countries approved the Guiding Principles on Financing the Development of the Belt and Road, encouraging the governments, financial institutions and enterprises of participating countries to attach importance to debt sustainability and improve their debt management capability. Drawing on the debt sustainability framework of low-income countries endorsed by the International Monetary Fund and the World Bank, China has developed tools based on the actual conditions of participating countries, and issued the Debt Sustainability Framework for Participating Countries of the Belt and Road Initiative. All parties are encouraged to use it on a voluntary basis. To avoid causing debt risk and financial burden to the countries where BRI projects are located, China has prioritized economic and social benefits and provided loans for project construction based on local needs and conditions. The key areas of investment are infrastructure projects designed to increase connectivity, and projects for public wellbeing urgently needed in participating countries. These have brought effective investment, increased high-quality assets, and boosted development momentum. Many think tank experts and international institutions have pointed out that almost all the BRI projects are initiated by the host countries with the goals of growing their economies and improving their people's lives. In the process, the logic of economics has taken precedence over geopolitics. 5. Solid foundations for people-to-people ties People-to-people ties are the social foundations of BRI cooperation. The participating countries have passed on and carried forward the spirit of friendly cooperation of the ancient Silk Road, cooperated on exchanges in culture, tourism, education, think tank and the media, and promoted mutual learning among civilizations and cultural integration and innovation. A model of people-to-people exchanges characterized by dynamic interactions and diversity has underpinned public support for furthering the initiative. Cooperation on culture and tourism is rich and colorful. By the end of June 2023, China had signed cultural and tourism cooperation documents with 144 BRI partner countries. China has created cooperation platforms together with participating countries, including the Silk Road International League of Theaters, the Silk Road International Museum Alliance, the Network of Silk Road Arts Festivals, the Silk Road International Library Alliance, and the Silk Road International Alliance of Art Museums and Galleries. These platforms have a total of 562 members, including 326 cultural institutions from 72 partner countries. China is steadily expanding international cultural exchanges. China has launched the Cultural Silk Road program, and organized signature events such as the Happy Chinese New Year celebrations, the Nihao China tourism promotions, and the Silk Road: Artists' Rendezvous art exhibition. It has worked with Brunei, Cambodia, Greece, Italy, Malaysia, Russia and ASEAN to co-host cultural and tourism activities at designated years. China and BRI partner countries have hosted events in a reciprocal manner, ranging from cultural relics exhibitions, film festivals, arts festivals, book fairs and music festivals, and jointly translated and promoted each other's publishing, radio, film and television programs. They have also implemented the BRI-themed theater arts creation and promotion project, the Belt and Road International Art Project, and the Belt and Road good-neighborliness cultural project, and worked to protect Asian cultural heritage. China has established 46 China cultural centers in 44 countries, of which 32 are partner countries. China has established 20 tourism offices in 18 countries, eight of which are in partner countries. Educational exchanges and cooperation are extensive and profound. China has released the Education Action Plan for the Belt and Road Initiative to promote international education exchanges and cooperation. By the end of June 2023, China had signed agreements with 45 participating countries on the mutual recognition of higher education degrees. China has set up the Silk Road Program under the Chinese Government Scholarship scheme. Some of China's provinces and Hong Kong and Macao SARs, as well as universities and research institutions have also set up scholarships for students from BRI partner countries. Chinese universities and colleges have opened 313 Confucius Institutes and 315 Confucius Classrooms in 132 partner countries. The \"Chinese Bridge\" Summer Camp has invited nearly 50,000 young people from more than 100 partner countries to come to China for academic visits, and supported 100,000 Chinese language enthusiasts from 143 partner countries to learn Chinese and experience Chinese culture online. Chinese universities and colleges have worked with more than 20 counterparts in partner countries from Asia, Africa and Europe to build a number of Luban Workshops — a professional training program dedicated to the sharing of expertise by China's vocational education institutions. China and UNESCO have jointly held the International Youth Forum on Creativity and Heritage Along the Silk Roads and relevant activities in seven consecutive years, and established the Silk Roads Youth Research Grant which has funded 24 youth research projects. The Atomic Energy Scholarship of China has funded the education of nearly 200 Master's and Doctoral students in the field of peaceful use of nuclear energy for 26 BRI partner countries. Participating countries have capitalized on the demonstration and driving role of the University Alliance and the Alliance of International Science Organizations (ANSO) under the BRI framework, and expanded international exchanges and cooperation in talent training and scientific research. Media and think tank cooperation has yielded fruitful results. BRI participating countries have held the Media Cooperation Forum on Belt and Road six times, and established the Belt and Road Media Community. The China-Arab States Forum on Radio and Television Cooperation, the Forum on China-Africa Media Cooperation, the China-Cambodia Radio and Television Annual Regular Cooperation Conference, the ASEAN-China Media Cooperation Forum, the Lancang-Mekong Audiovisual Week, and other bilateral and multilateral cooperation mechanisms have been set up. International organizations such as the Asia-Pacific Broadcasting Union and the Arab States Broadcasting Union have become active and important platforms for building consensus among participating countries. Media outlets in China and partner countries have jointly established the Belt and Road News Network, which launched the Silk Road Global News Awards. By the end of June 2023, the network's members had increased to 233 media outlets in 107 countries. Think tank exchanges have become more frequent. The Advisory Council of the Belt and Road Forum for International Cooperation was established in 2018. The Silk Road Think Tank Association has recruited 122 partners in Asia, Africa, Europe, and Latin America. Sixteen Chinese and foreign think tanks have established the Belt and Road Studies Network. People-to-people exchanges are constantly expanding. Non-governmental organizations (NGOs) continue to strengthen cooperation with the goals of benefiting the people, improving their lives, and connecting their hearts. At the people-to-people ties sub-forum of the Second Belt and Road Forum for International Cooperation, Chinese and foreign NGOs, including China NGO Network for International Exchanges, combined to launch the Silk Road Community Building Initiative, encouraging Chinese and foreign NGOs to establish nearly 600 cooperative partnership pairings and carry out more than 300 cooperation projects for improving people's lives. Of these, some brand projects have achieved a wide impact, including the Shenzhen-Lancang-Mekong Cooperation to benefit the people in the Lancang-Mekong region with Shenzhen's advanced products and technology, the Panda Pack Project to provide primary school students with learning supplies, and the Brightness Journey program to provide free cataract surgery to those in need. Cities from 60-plus BRI partner countries have formed more than 1,000 pairs of friendly cities with their Chinese counterparts. A total of 352 NGOs from 72 countries and regions have formed a Silk Road NGO Cooperation Network, carrying out over 500 projects and various other activities, and becoming an important platform for exchanges and cooperation between NGOs in participating countries. 6. Steady progress in new areas Leveraging their respective strengths, participating countries have continued to expand BRI cooperation into new fields and created innovative cooperation models, achieving great progress in building a healthy, green, innovative and digital Silk Road and further broadening the space for international cooperation. Notable achievements have been made in health cooperation. To establish closer partnerships in health cooperation, participating countries are working hard to build a Health Silk Road and a global community of health for all. By the end of June 2023, China had signed an MoU with the WHO on health cooperation in BRI partner countries, inked health cooperation agreements with more than 160 countries and international organizations, and initiated or participated in nine international and regional health cooperation mechanisms, including China-Africa Health Cooperation, China-Arab States Health Cooperation, and China-ASEAN Health Cooperation. Relying on mechanisms and platforms such as the Belt & Road Health Professionals Development Alliance, the Belt & Road Hospital Cooperation Alliance, the Belt& Road Health Policy Research Network, and the China-ASEAN Human Resources Training Program of Health Silk Road (2020-2022), China has helped BRI partner countries to train tens of thousands of professionals in health management, public health and medical research. It has also dispatched medical teams to 58 partner countries, and provided free treatment for nearly 10,000 cataract patients in more than 30 partner countries through the Brightness Journey program. In addition, China has sent several rounds of medical aid to island states of the South Pacific, and carried out international medical cooperation with neighboring countries, including countries of the Greater Mekong Subregion, Central Asian countries, and Mongolia. After the outbreak of Covid-19, China provided assistance to more than 120 BRI partner countries to combat the pandemic, and sent 38 expert medical teams to 34 countries. It started the Initiative for Belt and Road Partnership on Covid-19 Vaccines Cooperation together with 31 countries, delivered more than 2 billion doses of vaccines to partner countries, and conducted joint vaccine production with more than 20 countries, improving vaccine affordability and accessibility in developing countries. In addition, China has signed documents on traditional medicine cooperation with 14 BRI partner countries; eight partner countries have taken measures to support the development of traditional Chinese medicine (TCM) within the framework of their respective legal systems; 30 overseas TCM centers have been built; and 100-plus TCM drugs have been registered and marketed in partner countries. Remarkable progress has been achieved in green and low-carbon development. China is working together with partner countries and international organizations to build a cooperation mechanism for green and low-carbon development under the BRI framework, promote green development, and address climate change. China has issued documents such as the Guidance on Promoting Green Belt and Road and the Guidelines on Jointly Promoting Green Development of the Belt and Road, and set itself the ambitious goal of forming a basic framework of green development through BRI cooperation by 2030. China has also signed an MoU with the United Nations Environment Programme on building a green Belt and Road for 2017-2022, reached environmental cooperation agreements with more than 30 countries and international organizations, launched the Initiative for Belt and Road Partnership on Green Development together with 31 countries, formed the Belt and Road Initiative International Green Development Coalition with more than 150 partners from 40-plus countries, and established the Belt and Road Energy Partnership with 32 countries. China has pledged to stop building new coal-fired power stations overseas, and to actively build green finance platforms and international cooperation mechanisms. It stands ready to cooperate with partner countries on research into biodiversity conservation, safeguarding the eco-environmental security of the Maritime Silk Road, building the Belt and Road Big Data Service Platform on Ecological and Environmental Protection and the Belt and Road Environmental Technology Exchange and Transfer Center, and implementing the Green Silk Road Envoys Program. China is actively promoting the Belt and Road South-South Cooperation Initiative on Climate Change. It has signed 47 South-South MoUs on climate change with 39 partner countries, built low-carbon demonstration zones with Laos, Cambodia, and Seychelles, carried out more than 70 climate change mitigation and adaptation projects with 30-plus developing countries, and trained more than 3,000 environment management personnel and experts from more than 120 countries. In May 2023, China Eximbank, together with a dozen financial institutions including China Development Bank, and China Export& Credit Insurance Corporation, released the Initiative for Supporting Belt and Road Energy Transition with Green Finance, calling on all parties involved to strengthen support for green and low-carbon energy transition in BRI participating countries. Cooperation in scientific and technological innovation is gathering speed. BRI participating countries are strengthening cooperation on innovation, facilitating technology transfer and knowledge sharing, optimizing the innovation-enabling environment, and pooling innovation resources. They are also building up their capacity for scientific and technological innovation through cooperation in major projects and talent training. In October 2016, China released the Special Plan on Advancing Belt and Road Cooperation in Scientific and Technological Innovation. In May 2017, the Action Plan on Belt and Road Cooperation in Scientific and Technological Innovation was implemented, to increase the capacity for innovation in BRI participating countries through pragmatic measures such as joint research, technology transfer, exchanges in science, technology and culture, and cooperation between high-tech industrial parks. By the end of June 2023, China had signed intergovernmental agreements on scientific and technological cooperation with more than 80 BRI partner countries, and 58 members had joined the ANSO. Since 2013, China has hosted more than 10,000 young scientists from partner countries in carrying out short-term research and exchanges in China, and trained more than 16,000 technicians and management professionals for partner countries; China has established nine cross-border technology transfer platforms targeting ASEAN, South Asia, Arab states, Africa, Latin America, and other regions; China has assisted 22 African countries to build 23 agricultural technology demonstration centers, and set up 50-plus BRI joint laboratories in areas such as agriculture, new energy, and health. China has signed an agreement with the World Intellectual Property Organization (WIPO) on strengthening BRI cooperation on intellectual property and additional agreements on subsequent revision and prolongation of the said agreement. China and the WIPO have jointly hosted twice the High-level Conference on Intellectual Property for Countries Along the Belt and Road, and released a joint initiative and a joint statement on strengthening cooperation on intellectual property. To date, China has established intellectual property cooperation relationships with more than 50 partner countries and international organizations, whose goal is to create an innovation and business environment in which the value of knowledge is duly respected. Digital silk road cooperation presents numerous highlights. BRI participating countries have joined to create an open, fair, equitable and non-discriminatory environment for digital development by strengthening facilitation of and cooperation on rules and standards and promoting regional policy coordination. By the end of 2022, China had signed MoUs on building the Digital Silk Road with 17 countries, MoUs on e-commerce cooperation with 30 countries, and MoUs on closer investment cooperation in the digital economy with 18 countries and regions. It has proposed and worked to launch the Global Initiative on Data Security, the Belt and Road Digital Economy International Cooperation Initiative, the initiative for building the ASEAN-China Partnership on Digital Economy Cooperation, the China-League of Arab States Cooperation Initiative on Data Security, the China+ Central Asia Data Security Cooperation Initiative, and the BRICS Digital Economy Partnership Framework, among others. It also took lead in formulating the Framework of Standards on Cross-border E-commerce. China is active in strengthening digital infrastructure connectivity and is stepping up work on digital corridors. Several international submarine cables have made positive progress, and 130 cross-border terrestrial cable systems have been built. China has built many 5G base stations, data centers, cloud computing centers and smart cities, and promoted digital upgrading and transformation of traditional infrastructure such as ports, railways, highways, energy networks and water conservancy facilities. A number of key projects such as the China-ASEAN Information Harbor, and the digital platform of China-Europe Railway Express and the China-Arab Online Silk Road is making good progress, and the DBAR Big Earth Data Platform has realized multilingual data sharing. Panel 2 Silk Road E-commerce expands new channels for economic and trade cooperation Thriving new business models of international trade, represented by cross-border e-commerce and overseas warehouses, are providing better services and more choice to global consumers, and promoting global trade innovations. Silk Road E-commerce is an important means by which China can capitalize on its strengths in e-commerce technology application, model innovation and market size, expand economic and trade cooperation, and share the opportunities of digital development with BRI participants. By the end of September 2023, China had established bilateral mechanisms of e-commerce cooperation with 30 countries on five continents; multilateral mechanisms had been built under the China-CEEC and China-Central Asia frameworks. Activities such as the Silk Road E-commerce Platform of the Brand and Quality Online Shopping Festival and the Quality African Products Online Shopping Festival have yielded substantial results, and virtual country pavilions help partner countries to export their high-quality specialty products to the Chinese market. The innovative Cloud Classroom program has provided livestreamed training sessions for more than 80 participating countries to reinforce their digital literacy. Through consistently enriching the content and elevating the level of cooperation, Silk Road E-commerce has become a new platform for bilateral and multilateral economic and trade cooperation and a new strength in high-quality BRI cooperation. The construction of the Belt and Road Initiative Space Information Corridor has been a resounding success. China has built teleports connecting South Asia, Africa, Europe, and the Americas. The data from remote sensing satellites under the China-Brazil Earth Resources Satellite (CBERS) program is widely used in multiple countries and fields. The BeiDou navigation satellite system (BDS-3) provides comprehensive services for China-Europe Railway Express, and in maritime transport and other fields. China and a number of BRI partner countries and regions have combined to develop and launch communication or remote sensing satellites, and constructed satellite ground stations and other space infrastructure. Through the Regional Centre for Space Science and Technology Education in Asia and the Pacific (China) affiliated to the United Nations, China has trained a large number of space professionals for partner countries. Together with other countries and regions, China has built the China-GCC Joint Center for Lunar and Deep Space Exploration, the China-UAE Space Debris Joint Monitoring Center, the Lancang-Mekong Cooperation Center for Earth Observation Data, the China-ASEAN Satellite Remote Sensing Application Center, and the China-Africa Cooperation Center on Satellite Remote Sensing Application. The CNSA-GEO platform, the Belt and Road Analysis and Early Warning Platform for Typical Meteorological Disasters, and the Natural Resources Satellite Remote Sensing Cloud Service Platform now serve many partner countries. IV. Injecting Positive Energy into World Peace and Development Over the past decade, BRI cooperation has witnessed remarkable results. It has opened up new space for world economic growth, built a new platform for international trade and investment, reinforced the development capacity of relevant countries and improved people's lives, sought ways to improve the global governance system, and brought greater certainty and stability to a world fraught with turbulence and change. The BRI has boosted China's development and benefited the rest of the world. 1. Bringing tangible benefits to participating countries Development is an eternal theme for humanity. The BRI has focused on the fundamental issue of development, addressing the weaker links and bottlenecks that hinder development, building new engines for economic development, and creating a new development environment and space for participating countries. This has strengthened their confidence and their capacity for development, and improved their people's lives. The initiative has contributed to addressing global development imbalance and advancing modernization in all countries. Boosting development in participating countries. Over the last 10 years, the BRI has addressed the major bottlenecks restricting connectivity and economic growth in most of the developing countries. A large number of infrastructure projects have been built, with significant progress for participating countries in the construction of railways, highways, pipelines, shipping, energy, communications and other basic public service facilities. This has improved local living and working conditions and the development environment, and boosted their capacity for independent economic development. Some engineering projects with a long construction cycle are like seeds sown in a field, gradually generating comprehensive benefits for the long term. Connectivity in infrastructure has effectively reduced the cost for countries to participate in international trade, increased their access to the global economy, and stimulated the potential and impetus for their development. Research by the Asian Development Bank shows that lowering a landlocked country's trade costs by 10 percent through improvement in infrastructure could increase its exports by 20 percent. Industrial capacity cooperation has promoted industrialization, digitization, informatization, and the structural upgrading of industries in participating countries. It has helped them to form competitive industrial systems and expand the breadth and depth of their participation in the international division of labor and cooperation, creating more opportunities and greater space for development. China has actively conducted international cooperation in emergency management. It has sent rescue teams to Nepal, Mozambique, Türkiye and other countries to carry out humanitarian operations following earthquakes and floods, and provided emergency supplies and technical support to Tonga and Madagascar, among other countries. Building poverty reduction capacity in participating countries. Developing countries still face the challenge of problems related to food. China has taken an active part in global food and agriculture governance. It has released the Vision and Action on Jointly Promoting Agricultural Cooperation Along the Belt and Road with partner countries, and signed more than 100 agricultural and fishery cooperation documents with almost 90 partner countries and international organizations. Its trade in agricultural products with BRI partners has reached US$139.4 billion. China has sent more than 2,000 agricultural experts and technicians to over 70 countries and regions, and introduced more than 1,500 agricultural technologies such as Juncao and hybrid rice to many of these countries. It has helped with rural poverty reduction in Asia, Africa, the South Pacific, Latin America, and the Caribbean, developing modern agriculture and helping to increase farmers' incomes. Boosting employment is an important element of poverty reduction. In the process of BRI cooperation, China has helped to construct industrial parks with participating countries and provided guidance for Chinese enterprises to create jobs for local residents through high-level industrial cooperation. The jobs provided to locals have helped to lift their families out of poverty. A McKinsey survey revealed that Chinese firms in Africa recruited 89 percent of their employees locally, contributing to local employment in an effective way. The World Bank has estimated that by 2030, BRI-related investments could lift 7.6 million out of extreme poverty and 32 million out of moderate poverty. Panel 3 Juncao poverty alleviation wins worldwide acclaim China's Juncao technology makes comprehensive and efficient utilization of three major agricultural resources — light, heat and water. It makes circular production based on plants, animals, and fungi possible, combines economic, social and environmental benefits, and supports food, energy, and eco-environmental security. Juncao technology was first launched as an official assistance project in 2001, in Papua New Guinea. Over the last two decades, China has hosted more than 270 international training courses on Juncao technology, for more than 10,000 trainees from 106 countries. It has also established Juncao technology demonstration centers or bases in 13 countries in Asia, Africa, Latin America, and the South Pacific region. Today, Juncao technology is being applied in more than 100 countries, creating hundreds of thousands of green jobs for local youth and women. A former cabinet minister of Papua New Guinea named his daughter Juncao. The people of Lesotho have produced folk songs in praise of Juncao which are still popular today. In 2017, Juncao technology was listed as a key project of the China-UN Peace and Development Fund, contributing more Chinese know-how to the cause of international poverty reduction. Delivering notable results in projects that improve people's lives. Chinese firms have repaired and maintained bridges to make it easier for local residents to travel. They have drilled wells to meet local villagers' needs for drinking water. They have installed street lamps for pedestrians to see clearly on their way home at night. Many such seemingly small projects have solved urgent problems for local people and improved their daily lives. They have brought tangible benefits to the people of participating countries, and increased their sense of gain, fulfillment and security. Over the last 10 years, Chinese firms have launched more than 300 poverty alleviation, health care and rehabilitation, and Happy Home projects in participating countries. They have helped with the construction of the headquarters of Africa Centres for Disease Control and Prevention and the China-Pakistan Fraternity Emergency Care Center in Gwadar, Pakistan. They have also helped Cameroon, Ethiopia, Djibouti and other countries to provide clean drinking water for the local people. Panel 4 The Sweet Spring Project improves people's wellbeing in the Lancang-Mekong Region In January 2020, China launched the Lancang-Mekong Sweet Spring Project, a project demonstrating rural water supply safety technology in the Lancang-Mekong region. Water supply facilities were built in rural areas of Cambodia, Laos, and Myanmar, markedly improving local water supply capacity and safety. Through this project, China has helped to improve the lives of local people and played an active role in helping the Lancang-Mekong region to access clean water and sanitation, one of the United Nations 2030 Sustainable Development Goals. As of December 2022, 62 demonstration sites had been built in the project area, ensuring safe drinking water for more than 7,000 local people. China had also trained over 400 personnel from the region in rural water supply management and project management. The Silk Road Community Building Initiative has promoted projects in more than 20 areas, including poverty alleviation and disaster relief, humanitarian assistance, environmental protection, and women's exchanges and cooperation. Related activities have had an extensive impact. 2. Adding vitality to economic globalization Against a rising tide of de-globalization, the BRI is committed to global connectivity and interconnected development. It has further opened up the main arteries of economic globalization, facilitated the flow of information, capital, technology, product, industry and people, and promoted closer and broader international cooperation. By expanding economic globalization and distributing its benefits fairly, the BRI aims to promote global development that is balanced, coordinated, inclusive and shared by all, and that brings win-win cooperation and common prosperity. Boosting the momentum for global development. The BRI has connected the vibrant East Asia economic circle at one end, the developed European economic circle at the other, and the countries in between with huge potential for economic development, and fostered closer economic cooperation with African and Latin American countries. It has formed a new global development dynamic in which the Eurasian continent is fully connected with the Pacific, Indian and Atlantic oceans, and the land is integrated with the sea. It has expanded the scope and coverage of the international division of labor in a broader economic and geographical space, and enlarged the global market, which ultimately promoted new global economic growth. At the same time, through infrastructure connectivity, the BRI has proved a catalyst to international investment and boosted global interest in and enthusiasm for investment in infrastructure, which provides economic growth and rapid development in participating countries. These efforts have effectively addressed the shortage of international public goods and provided sustained impetus for world economic growth. Encouraging deeper regional economic cooperation. In strengthening infrastructure connectivity, the BRI promotes connectivity between countries in many directions and various fields. The BRI turns dots into lines and lines into fields, gradually amplifying the radiation effect of development. It encourages countries to coordinate economic policies, systems and mechanisms, and innovate cooperation models, conduct broader, deeper and closer regional cooperation, and jointly create an open, inclusive and balanced regional economic cooperation architecture that benefits all. It has facilitated a freer and more orderly flow of economic factors, more efficient allocation of resources, and deeper integration of markets, and upgraded economic and trade connectivity and vitality between countries and regions, and the overall position of participating countries in global industry chains, supply chains, and value chains. Participating countries have made full use of their own factor endowments to integrate, coordinate, and upgrade their industry chains, promote industrial complementarity, and improve the efficiency of division of labor. They have broken down trade barriers and market monopolies, unleashed internal and cross-border consumption potential, and expanded the scale of regional markets. Through technology transfer and cooperation in industrial cooperation, they have established technology interaction and interdependence, strengthened capacity for innovation, and promoted leapfrog development. Promoting global trade. The BRI supports the liberalization and facilitation of trade and investment by building transport and information infrastructure in a planned and progressive manner. It has eliminated internal, transnational, and inter-regional transport bottlenecks and barriers to trade and investment cooperation, made cross-border logistics and foreign trade easier and more convenient, and increased the efficiency of domestic and international cooperation. It has built up an all-round, multi-level and complex network of unimpeded trade, creating a new dynamic and greatly facilitating global trade. At the same time, the BRI has made participating countries more attractive to quality global capital, and contributed to rising direct cross-border investment in these countries. In 2022, cross-border direct investment inflows in Southeast Asia accounted for 17.2 percent of the global total, 9 percentage points higher than in 2013. The inflow of FDI into Kazakhstan grew by a historical high of 83 percent year on year. World Bank study-\"Belt and Road Economics: Opportunities and Risks of Transport Corridors\" — estimates that prior to the BRI, the six corridor economies undertrade with each other and the rest of the world by 30 percent on average and they fall short of their absorptive potential of FDI by 70 percent. Transport infrastructure projects under the BRI would reduce trade costs for the world by 1.8 percent, and reduce trade costs along the China-Central Asia-West Asia economic corridor by 10 percent. This has greatly facilitated global trade and boosted economic growth. The study projects that trade growth would range between 2.8 and 9.7 percent for corridor economies and between 1.7 and 6.2 percent worldwide, and global real income is expected to increase by 0.7 to 2.9 percent. Maintaining the stability of global supply chains. An efficient and interconnected international transport corridor established under the BRI framework plays an important role in maintaining the stability and smooth flow of global supply chains. During the Covid-19 outbreak, ports and logistics companies canceled or reduced services for shipping and freight transport, which had dealt a hard blow to those global supply chains which were highly dependent on shipping. Panel 5 China-Laos Railway turns land-locked Laos into a land-linked country The China-Laos Railway is an electrified railway directly connecting Kunming City of China with Vientiane City of Laos. It is the first transnational railway built under the BRI, funded mainly by Chinese investment, operated jointly by the two sides, and connected directly with China's railway network. The 1,035-km-long railway officially opened for business on December 3, 2021. On April 13, 2023, the China-Laos Railway started cross-border passenger services, with bullet trains running directly in both directions between Kunming and Vientiane. As an important part of the central section of the pan-Asia railway network, the China-Laos Railway has helped Laos to realize its long-cherished dream of becoming a land-linked country from a landlocked one. It has promoted transport, investment, logistics and tourism, and injected new impetus into the economic development of Laos and areas along the line. By August 31, 2023, the railway had recorded a total of 20.79 million passenger trips and carried 25.22 million tonnes of cargo. It has become a safe and efficient international passageway connecting Laos with its neighboring countries and regions and generating mutual benefits. The China-Laos Railway is a project that wins the heart of the people and an example of clean management. The leaders of China and Laos reached an important agreement on making the China-Laos Railway a clean project. The discipline inspection and supervision departments of the two countries established a government-level supervision and coordination mechanism, and the enterprises involved in construction had taken incorruptibility as a top priority from project design and deployment through to implementation and review. Effective systems were in place to enforce this principle throughout construction, and new methods of cooperation to fight corruption were tested. Through the efforts of both parties, the China-Laos Railway has become a road of friendship, integrity and happiness. According to a World Bank study — \"From Landlocked to Land-Linked: Unlocking the Potential of Lao-China Rail Connectivity\" — the China-Laos Railway could raise Laos' aggregate income by up to 21 percent over the long term. The transit trade through Laos along the line is estimated to reach 3.9 million tonnes per year by 2030, which would include a shift of an estimated 1.5 million tonnes of trade from maritime transport to the railway. As a key output of BRI cooperation, the China-Europe Railway Express effectively sustained rail connectivity on the Eurasian continent, boosted sea-rail, road-rail, air-rail, and other forms of multi-modal transport, and opened up a new transport corridor for the Eurasian continental supply chain. Together with the innovations in customs clearance such as the Customs-Train Operators Partnership for Secure and Expedited Clearance of CR Express Carried Goods (C-TOP), Rapid Customs Clearance for rail service, China made an important contribution to stabilizing the global economy. Several well-known international logistics associations have stated publicly that the China-Europe Railway Express has provided the world with a reliable logistics solution that can effectively alleviate tensions in the global supply chain and strengthen international logistics. 3. Providing new solutions for improving global governance The deficit in global governance presents a severe challenge to the whole world. The BRI supports genuine multilateralism, and cherishes shared growth through consultation and collaboration in global governance. It advocates dialogue rather than confrontation, removing walls rather than erecting walls, integration rather than decoupling, and inclusiveness rather than exclusion. This is a new paradigm for state-to-state relations that shapes the international order towards greater justice and equality. Gaining more recognition for the concept of global governance. The BRI's core principles of \"extensive consultation, joint contribution, and shared benefits\" have appeared in important documents from international organizations and mechanisms, including the UN and the Forum on China-Africa Cooperation. The vision of a global community of shared future has developed deep roots. A number of bilateral communities have been built between China and other countries, including Laos and Pakistan. Steady progress has been made in building multilateral communities, including those between China and Africa, the Arab States, Latin America, ASEAN, Central Asia and Pacific Island countries. Practical results have been achieved in building communities in functional areas, including cyber space, maritime cooperation, and health for all. According to the China's National Image Global Survey released by the Academy of Contemporary China and World Studies in 2020, the BRI is the Chinese proposal with the highest level of acceptance overseas, with more than 70 percent of respondents recognizing the positive impact of the BRI on individuals, states and global governance. European think tank Bruegel released a paper titled \"Global Trends in Countries' Perceptions of the Belt and Road Initiative\" in April 2023, which noted that the BRI is generally positively received in the world, and Central Asia and sub-Saharan Africa, in particular, exhibit strongly positive sentiment towards the BRI. Improving multilateral governance mechanisms. The BRI upholds the principles of mutual respect and equality, openness, inclusiveness, and win-win results. It enshrines multilateralism by securing international fairness and justice, and protecting the rights and interests of developing countries. The BRI helps improve the existing multilateral governance mechanisms by firmly upholding the authority and status of the UN, and striving to consolidate and strengthen the stature and effectiveness of global multilateral governance platforms such as the WTO. It actively promotes new multilateral governance mechanisms such as the Asian Infrastructure Investment Bank, and works with participating parties to promote governance mechanisms in emerging areas such as the deep sea, polar regions, outer space, internet and artificial intelligence. The BRI has strengthened the position and role of developing countries and emerging economies in the world market system, and increased their discourse power in regional and global economic governance. As a result, the aspirations and concerns of developing countries are increasingly included in the global agenda — a significant improvement in global governance. Innovating and optimizing global governance rules. Taking into account the differences in the level of economic development, factor endowments, and cultural and religious traditions of relevant parties, the BRI has not preset any rules and standards, nor does it draw ideological lines. Instead, it formulates new rules to solve new problems through full consultation and in-depth exchanges, based on the wishes and needs of the parties involved. BRI participating countries seek synergy in their strategies, plans, mechanisms, projects, and rules and standards, which helps to optimize the rules for BRI cooperation, and supports the transition from opening up based on the flow of goods and factors of production to opening up based on rules and related institutions. Some rules and standards with strong potential for universal application have been formulated in this process, which has effectively filled in gaps in the global governance system in these areas. 4. Garnering strength for the progress of human civilization Exchanges and mutual learning among civilizations drive human progress and global peace and development. In contrast to those who persist with black and white thinking, concoct such concepts as the \"clash of civilizations\" and \"superiority of Western civilization\", and provoke large-scale ideological confrontation, the BRI advocates equality, mutual learning, dialogue, and inclusiveness among civilizations, and promotes the shared values of humanity. It has charted a path of exchanges and mutual learning among civilizations for all to prosper individually and collectively, in order to achieve closer ties among peoples and link up the cultures and hearts of all countries. Improving the mechanisms for people-to-people exchanges. People-to-people exchanges cover a wide range of areas, including politics, culture, the arts, sports, and education. The global influence of various multilateral and bilateral political party exchange mechanisms has increased with the creation of mechanisms such as the CPC and World Political Parties Summit, and the CPC in Dialogue with World Political Parties High-level Meeting. The leading role of high-level inter-party exchanges garners consensus and strengths for stronger people-to-people ties. Various BRI cooperation mechanisms have emerged, including the Silk Road Think Tank Association, the Belt and Road Initiative Tax Administration Cooperation Mechanism, the ANSO, the Belt and Road Health Professionals Development Alliance, the Silk Road International League of Theaters, and the Silk Road International Museum Alliance. The emergence of such mechanisms has facilitated people-to-people exchanges in diverse forms, promoting mutual understanding, mutual respect, and mutual appreciation among the peoples of all countries. China, Kyrgyzstan, Iran and other Central and West Asian countries jointly launched the Alliance for Cultural Heritage in Asia — the first international cooperation mechanism regarding Asian cultural heritage — to protect cultural heritage, the tangible carriers of civilization. The projects under the framework of the alliance, for example the protection and restoration of Uzbekistan's ancient city of Khiva, have been highly commended by UNESCO. Creating quality brand projects and activities. Several projects and activities have become popular and attracted widespread public participation. Examples include the Silk Road (Dunhuang) International Cultural Expo, the Belt and Road\/Great Wall International Folk Culture and Arts Festival, the Silk Road International Arts Festival, the Maritime Silk Road International Arts Festival, the Belt and Road Youth Story, and the Tea Road Cultural Tourism Expo. Cultural and people-to-people exchange programs have won wide acclaim, including the Silk Road Community Building Initiative, the Kit of Love of medical supplies, Luban Workshops of technical vocational training, the Happy Spring well-drilling project, the Brightness Journey program of free cataract surgeries, the Panda Pack Project of school supplies, the Amity Torch Program of educational assistance, the Belt and Road Tour of Acupuncture-Moxibustion promoting traditional Chinese medicine therapies, and the Confucius Classroom of cultural exchanges. As these goodwill activities, quality brands, and signature projects continue to emerge, they have become an important means through which all parties can join to strengthen people-to-people ties. This reinforces the sense of identity and belonging of the peoples of all BRI participating countries. Galvanizing the power of youth. The future of the BRI belongs to the youth. Over the last 10 years, young people in participating countries have engaged proactively in people-to-people exchanges and programs that create a better life. The younger generation has galvanized the tremendous power of youth for strengthening people-to-people bonds and realizing common development. Panel 6 Luban Workshops Lu Ban was an ancient Chinese woodcraft master and inventor. The Luban Workshop, an international exchanges platform for vocational education named after the master, has become a well-known Chinese initiative for introducing Chinese vocational education internationally. Luban Workshops are mainly opened in ASEAN, SCO and African countries. The workshops offer a combination of academic education and vocational training, and share the approach, technology, and standards of Chinese vocational education. The project has built training centers, provided advanced teaching equipment, and sent Chinese teachers and technicians to help train technical personnel for participating countries. Since the first Luban Workshop opened in Thailand in 2016, Chinese universities and colleges have established dozens of Luban Workshops with more than 20 participating countries in Asia, Africa, and Europe, which offer courses in more than 70 directions, including industrial robots, new energy, and the Internet of Things. The workshops have trained tens of thousands of technical personnel for participating countries, helping more young people to find work. Though small in scale, the workshops respond to people's desire for a better life, and facilitate the realization of the dream of common development. The Chinese Youth Global Partnership has received a positive response from all over the world. More than 100 national youth organizations and international organizations have established ties and cooperative relations with China. Sixteen events of the Belt and Road Youth Story have attracted more than 1,500 young people from participating countries. Focusing on poverty alleviation and reduction, climate change, and pandemic response cooperation, participants shared with the audience their stories and experience in promoting social development and their own development, which vividly demonstrated the right way to view the world from the perspective of appreciation, mutual learning, and sharing. Other successful activities have also taken place, including the Silk Road Incubator Youth Entrepreneurship Program and the China-Central and Eastern Europe International Forum for Young Innovators, which have become important platforms for the youth of participating countries to strengthen friendly exchanges and cooperation. V. Pursuing Steady and Sustained Progress in High-Quality BRI Cooperation Experience over the past 10 years has proved that BRI cooperation responds to the call of the times and benefits the peoples in participating countries. It thus enjoys popular support. It is a path for all participating countries to achieve modernization and a path of hope leading to a bright future. It is resilient and vigorous, and offers broad prospects. Currently, the world is in a period of turbulence and transformation. Rivalry and competition between major countries is escalating; the geopolitical situation remains tense; global economic recovery is yet to appear over the horizon; cold-war and zero-sum mentalities are resurgent; unilateralism, protectionism and hegemonism are proliferating; populism is making a noticeable resurgence. A new round of technological revolution and industrial transformation has given rise to ever fiercer competition; the deficit in peace, development, security and governance is growing; foreseeable and unforeseeable risks are rising rapidly around the globe. All of this presents unprecedented challenges to humanity. Certain countries overstretch the concept of national security and seek \"decoupling\" in the name of \"derisking\"; they trample international economic and trade order and market rules, and endanger the security and stability of international industrial supply chains; they also impede international humanistic and technological exchanges and cooperation. Their actions raise obstacles to the long-term development of humanity. In a world full of uncertainties and instabilities, all countries should urgently bridge differences through dialogue, oppose rifts with unity, and promote development through cooperation. Against this backdrop, the BRI becomes more meaningful and is an initiative to be welcomed. In the long term, the trends towards multipolarity and economic globalization, the trend of our times towards peace, development, cooperation and win-win outcomes, and the desire of the people of all countries for a better life will remain unchanged. So will the momentum behind the rise of developing countries as a whole and the status and responsibilities of China as the largest developing country in the world. The BRI faces some difficulties and challenges; however, its future is promising, as long as all countries can manage threats, address challenges, and advance cooperation by considering both their own long-term interests and the overall interests of humanity. As a large and developing country that meets its responsibilities, China will continue to promote the BRI as its overarching plan and its top-level design for opening up and win-win international cooperation. It will open up on a larger scale, across more areas, and in greater depth. It will steadily expand institutional opening up with regard to rules, regulations, management and standards, and establish new mechanisms for a more open economy. It will achieve high-quality new development through opening up, and provide new opportunities for the world with that development. China is ready to increase its resource input in global cooperation and do its best to support and help other developing countries to progress faster. It will work to achieve a greater say for emerging economies and developing countries in global governance, and contribute to the common development of all countries. China sincerely welcomes more countries and international organizations to join in cooperation under the BRI, and will support any initiative that can genuinely help developing countries build infrastructure and achieve shared progress, thereby promoting global connectivity and sustainable development. All countries involved in high-quality BRI cooperation are equal participants, contributors and beneficiaries. China is willing to work with all other parties to strengthen confidence, maintain resolve, and advance BRI cooperation in the spirit of extensive consultation, joint contribution and shared benefits. China hopes that all parties can consolidate the foundations, expand the reach, and optimize the projects of cooperation. Working together, all can create new opportunities, seek new drivers, create new space, and share new fruits of development. All can form closer partnerships in health, connectivity, green development, opening up, inclusiveness, innovation and clean government, and all can thereby participate in fruitful BRI cooperation and provide new and powerful impetus for building a global community of shared future. Conclusion The Belt and Road Initiative has given new life to a history of cultural exchanges that dates back more than two millennia, and has inspired more than 150 countries with the zeal to realize new dreams. In the 10 years that have passed since its launch, cooperation under the BRI framework has brought remarkable and profound change to the world and become a major milestone in the history of humanity. The BRI is a long-term, transnational and systematic global project of the 21st century. It has succeeded in taking its first step on a long journey. Continuing from this new starting point, the BRI will demonstrate greater creativity and vitality, become more open and inclusive, and generate new opportunities for both China and the rest of the world. In the future, the BRI will find itself confronted by new difficulties. But as long as all parties involved combine their forces, work together and persevere, we will be able to overcome these problems and raise our extensive consultation, joint contribution, and shared benefits to new heights. Cooperation will thrive, and the BRI can look forward to an even brighter future. China stands ready to work with other countries to pursue closer and more fruitful cooperation under the BRI framework, implement the Global Development Initiative, the Global Security Initiative and the Global Civilization Initiative, and build an open, inclusive, clean and beautiful world that enjoys lasting peace, universal security and common prosperity. Our goals are to pass on the torch of peace from generation to generation, sustain development, ensure that civilizations flourish, and build a global community of shared future.","filter_flag":1}
