{"title":"Clorox Wins 2023 EPA Award for Advancing Green Chemistry - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2xvcm94LXdpbnMtMjAyMy1lcGEtYXdhcmQtZm9yLWFkdmFuY2luZy1ncmVlbi1jaGVtaXN0cnktMzAxOTY0OTU4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2xvcm94LXdpbnMtMjAyMy1lcGEtYXdhcmQtZm9yLWFkdmFuY2luZy1ncmVlbi1jaGVtaXN0cnktMzAxOTY0OTU4Lmh0bWzSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2xvcm94LXdpbnMtMjAyMy1lcGEtYXdhcmQtZm9yLWFkdmFuY2luZy1ncmVlbi1jaGVtaXN0cnktMzAxOTY0OTU4Lmh0bWzSAQA","guidislink":false,"published":"Mon, 23 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=296, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2xvcm94LXdpbnMtMjAyMy1lcGEtYXdhcmQtZm9yLWFkdmFuY2luZy1ncmVlbi1jaGVtaXN0cnktMzAxOTY0OTU4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Clorox Wins 2023 EPA Award for Advancing Green Chemistry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Clorox Wins 2023 EPA Award for Advancing Green Chemistry - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY2xvcm94LXdpbnMtMjAyMy1lcGEtYXdhcmQtZm9yLWFkdmFuY2luZy1ncmVlbi1jaGVtaXN0cnktMzAxOTY0OTU4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Clorox Wins 2023 EPA Award for Advancing Green Chemistry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"OAKLAND, Calif., Oct. 23, 2023 \/PRNewswire\/ -- The Clorox Company (NYSE: CLX) was named a winner of the Environmental Protection Agency's (EPA) 2023 Green Chemistry Awards for its efforts to design products that reduce the generation and use of hazardous substances. The company was distinctly recognized in the \"Designing Greener Chemicals\" category for its development and launch of Clorox EcoClean™ Disinfecting Cleaner, which is made with a plant-based active ingredient that kills 99.9% of illness-causing germs in two minutes or less when used as directed. The Clorox Company was named a winner of the EPA's 2023 Green Chemistry Challenge Award. Post this The Clorox Company wins EPA 2023 Green Chemistry Challenge Award Ingredient advocacy is a critical element of Clorox's environmental, social, and governance goals, which are embedded in the company's corporate IGNITE strategy. The Clorox EcoClean™ product line, sold via the Clorox Professional business unit, includes All-Purpose Cleaner and Glass Cleaner in addition to Disinfecting Cleaner. Clorox EcoClean™ helps the company deliver on its promise to enhance the sustainability of its products via the use of plant-based ingredient alternatives, and to reduce virgin plastic in its supply chain by using a minimum of 25% post-recycled plastic in packaging. \"We all share a responsibility to help prevent pollution by advancing green innovation and the design of eco-friendly chemicals and materials,\" said Michelle Claudnic, senior director, Research and Development for Clorox Professional. \"We are honored to be awarded the EPA Green Chemistry Challenge Award as we continue delivering on our commitment to environmental sustainability and responsible business practices. Clorox Professional is proud to offer a new choice for cleaning professionals seeking eco-conscious cleaners and disinfectants to keep facilities clean and healthy.\" This recognition builds upon Clorox's longstanding product stewardship efforts, including becoming the first major consumer packaged goods company to voluntarily disclose ingredients in U.S. retail and professional cleaning, disinfecting and laundry products over a decade ago. Clorox was also recently named an EPA 2023 Safer Choice Partner of the Year for its outstanding achievement in the manufacturing of products with ingredients that are safer for families, pets, workplaces, communities, and the environment. About The Clorox Company The Clorox Company (NYSE: CLX) champions people to be well and thrive every single day. Its trusted brands, which include Brita®, Burt's Bees®, Clorox®, Fresh Step®, Glad®, Hidden Valley®, Kingsford®, Liquid-Plumr®, Pine-Sol® and Natural Vitality®, can be found in about nine of 10 U.S. homes and internationally with brands such as Ayudin®, Clorinda®, Chux® and Poett®. Headquartered in Oakland, California, since 1913, Clorox was one of the first U.S. companies to integrate ESG into its business reporting. Visit thecloroxcompany.com to learn more. About EPA's Green Chemistry Challenge Awards Since the inception of the awards more than a quarter century ago, EPA and the American Chemical Society, which co-sponsor the awards, have received more than 1,800 nominations and presented awards to 133 technologies that decrease hazardous chemicals and resources, reduce costs, protect public health, and spur economic growth. Winning technologies are responsible for annually reducing the use or generation of hundreds of millions of pounds of hazardous chemicals, saving billions of gallons of water, and eliminating billions of pounds of carbon dioxide equivalents. CLX-C SOURCE The Clorox Company","filter_flag":1}
{"title":"Innovations from Cosmetic 360's 2023 edition - BW Confidential","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmJ3Y29uZmlkZW50aWFsLmNvbS9pbm5vdmF0aW9ucy1mcm9tLWNvc21ldGljLTM2MHMtMjAyMy1lZGl0aW9uL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmJ3Y29uZmlkZW50aWFsLmNvbS9pbm5vdmF0aW9ucy1mcm9tLWNvc21ldGljLTM2MHMtMjAyMy1lZGl0aW9uL9IBAA?oc=5","id":"CBMiS2h0dHBzOi8vd3d3LmJ3Y29uZmlkZW50aWFsLmNvbS9pbm5vdmF0aW9ucy1mcm9tLWNvc21ldGljLTM2MHMtMjAyMy1lZGl0aW9uL9IBAA","guidislink":false,"published":"Sun, 29 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=302, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmJ3Y29uZmlkZW50aWFsLmNvbS9pbm5vdmF0aW9ucy1mcm9tLWNvc21ldGljLTM2MHMtMjAyMy1lZGl0aW9uL9IBAA?oc=5\" target=\"_blank\">Innovations from Cosmetic 360's 2023 edition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BW Confidential<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Innovations from Cosmetic 360's 2023 edition - BW Confidential","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmJ3Y29uZmlkZW50aWFsLmNvbS9pbm5vdmF0aW9ucy1mcm9tLWNvc21ldGljLTM2MHMtMjAyMy1lZGl0aW9uL9IBAA?oc=5\" target=\"_blank\">Innovations from Cosmetic 360's 2023 edition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BW Confidential<\/font>","source.href":"https:\/\/www.bwconfidential.com","source.title":"BW Confidential","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"BW Confidential reports on the innovations presented at the ninth edition of trade show Cosmetic 360, which took place in Paris from October 18 to 19 CleanTech was the theme at this year’s Cosmetic 360 event, the show dedicated to innovation in the beauty industry and organized by French industry cluster Cosmetic Valley. There were a large number of new products, brands and services presented around the Clean Tech theme. They included eco-conceived brands, with a focus on compostable packaging, zero waste, plastic-free packs, solid products and waterless items, as well as locally sourced ingredients, non-petrochemical-based ingredients and those that take biodiversity into consideration. Also on show, were companies focused on decarbonization, green chemistry, clean energy, as well as transparency in the supply chain. At the opening press conference of the event, Cosmetic Valley announced the creation of an office, or “embassy,” in Shanghai, China, to support companies’ export business and boost the attractiveness of France. Cosmetic Valley says the new initiative aims to promote exchanges between French players in different markets and support SMEs that do not yet have a local presence. The initiative’s aim is to forge links with local players and strengthen what Cosmetic Valley calls France’s “soft power” on the international stage. The office will be launched in early 2024. In the medium term, Cosmetic Valley plans to establish more “embassies” in other markets, such as the US. This year’s show welcomed more than 5,000 unique visitors and 250 exhibitors. Innovations seen in show Beauty tech company Perfect Corp presented its AI skin diagnosis tool, which provides users a score for 14 skin concerns, as well as product recommendations and routines. The company also presented its skin type detection tool, which diagnoses the user’s skin type. While the skin diagnosis tool uses a photo of the user, the skin type detection tool can be used live. Perfect Corp’s AI Skin Diagnostic tool (left) and Skin Type Detection tool (right) French industrial group Anjac Health & Beauty showcased its airflow technology under its Sicaf brand. The technology creates whipped textures that are propellant free. The Sicaf skincare range features five textures: A cleansing cream, two face balms, a whipped face cream and a perfumed whipped face cream. The company has also developed a range of solid products, including a deodorant, mask, serum, cream, perfume and sunscreen sticks with SPF. The company says that solid products have clean formulas. Anjac Health & Beauty’s innovations Italian tech company Antares Vision Group presented its anti-diversion traceability solution, which is a platform that claims to ensure full traceability across the supply chain, mitigating the financial impact of product diversion. The platform provides a unique QR code for each product and end-to-end tracking and monitoring of distribution. The company adds that the QR code ensures authenticity of the product. The QR code is featured on each box of products and is connected to a distribution map as well as tracking and tracing information, allowing a brand to control the supply chain. When a customer scans the QR code, it presents the journey of the product and its destination; it does not capture any personal information and the data is owned by the brand. Materials company Avery Dennison showcased its digital ID solution for connected products, traceability and consumer engagement. The company has collaborated with French sustainable fragrance brand Bastille, whereby each of the brand’s products has a unique QR code which shows its location and date. The QR code connects to Atma.io, the company’s own product lab, for brands or retailers. The product lab shows the carbon footprint for each part of the product’s journey to the consumer, how many times a product has been scanned, the top-scanned products and in which countries the product has been scanned. This real-time visibility enables brands or retailers to observe stock accuracy and thereby reduce waste. Consumers will only see what the brand or retailer wants to show. For Bastille, the technology provides transparency and traceability about its products’ ingredients, which it believes will encourage sales. Centric Software presented its Product Lifecycle Management (PLM) solution, a centralized data platform that manages the complete lifecycle of cosmetics and personal-care products, from ideas to retail. It enables companies to streamline product development, ensure regulatory compliance, share accurate data instantly and improve collaboration among teams and with suppliers. Organic cosmetics company Diva Flora showcased its unisex beauty products, soap and solid shampoo made with hemp. The company’s formulation and sourcing take place locally in Nouvelle Aquitaine to reduce its carbon footprint. It uses degradable and compostable plant-based packaging with laser labelling and a traditional wax seal. The packaging is also re-usable and stackable. Diva Flora has designed an application based on blockchain technology. A QR code on the product will inform consumers of a product’s journey, including its sourcing with a presentation of the growers; the logistical means used; distribution channels; application advice; as well as the methods and means of recovering and returning the containers. Finally, the company uses a logistics approach that favors transport with a low carbon footprint (rail, carpooling and cargo bike). Diva Flora has partnered with French railway system, SNCF, to transport its products by high-speed train. The company’s target audience is luxury hotels and consumers. Cosmetic 360 Award winners The Cosmetic 360 Award winners and jury The Cosmetic 360 show held its annual Award ceremony, which selected innovations from the show’s 250 exhibitors in six categories, as well as a Jury’s Favorite Award for the best CleanTech innovation. The Awards were judged by a jury of 14 journalists, including BW Confidential Editor in Chief Oonagh Phillips. The winners were: Special Jury’s Favorite Award on the Cleantech theme: INTACT REGENERATIVE, which produces pea-based ethanol for fragrances and cosmetics Raw Materials Award: BIOWEG, which focuses on functional ingredients obtained by the fermentation of cellulose to replace solid microplastics and acrylic polymers Formulation Award: TECHNATURE, which presented a heating and cleansing treatment in a solid stick form that transforms into milky emulsion upon rinsing Testing & Analysis Award: SGS proderm, which showed a new skin imaging technique to evaluate the impact of anti-aging products on collagen Packaging & Packing Award: DWS ENGRAVING, Laser Color engraving on leather Brands & Retail Award: Diva Flora, a French skincare brand based on hemp derivatives, with a focus on eco-design. Manufacturing Process & Services: SFE Process, which presented carbo-distillation for essential oils","filter_flag":1}
{"title":"Coffee biorefinery opened in Denmark to upcycle coffee grounds - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMC8wOS9jb2ZmZWUtYmlvcmVmaW5lcnktb3BlbmVkLWluLWRlbm1hcmstdG8tdXBjeWNsZS1jb2ZmZWUtZ3JvdW5kc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMC8wOS9jb2ZmZWUtYmlvcmVmaW5lcnktb3BlbmVkLWluLWRlbm1hcmstdG8tdXBjeWNsZS1jb2ZmZWUtZ3JvdW5kc9IBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMC8wOS9jb2ZmZWUtYmlvcmVmaW5lcnktb3BlbmVkLWluLWRlbm1hcmstdG8tdXBjeWNsZS1jb2ZmZWUtZ3JvdW5kc9IBAA","guidislink":false,"published":"Mon, 09 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=282, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMC8wOS9jb2ZmZWUtYmlvcmVmaW5lcnktb3BlbmVkLWluLWRlbm1hcmstdG8tdXBjeWNsZS1jb2ZmZWUtZ3JvdW5kc9IBAA?oc=5\" target=\"_blank\">Coffee biorefinery opened in Denmark to upcycle coffee grounds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Coffee biorefinery opened in Denmark to upcycle coffee grounds - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMC8wOS9jb2ZmZWUtYmlvcmVmaW5lcnktb3BlbmVkLWluLWRlbm1hcmstdG8tdXBjeWNsZS1jb2ZmZWUtZ3JvdW5kc9IBAA?oc=5\" target=\"_blank\">Coffee biorefinery opened in Denmark to upcycle coffee grounds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"When we brew ourselves a cup of coffee, according to Kaffe Bueno, we utilise a mere 1% of the nutrients found in the coffee’s biomass. When we throw away the coffee grounds, the nutrition rots away, depriving us of beneficial fats, proteins, antioxidants and other nutrients, and releasing carbon dioxide and methane while it’s at it. Kaffe Bueno, with its new biorefinery in Rødovre, aims to stop this from happening, turning the wasted coffee grounds into food and cosmetic products for consumption and thereby preventing emissions. The biorefinery, which has €2.5 million backing from the European Innovation Council, can upcycle 500 tons of coffee grounds each year. “Some of the food ingredients in our portfolio include prebiotic fibre (soluble and insoluble), antioxidants, clean-label caramel colours, structured fats\/emulsifiers, and an encapsulation agent for bioactives and probiotics​,” Juan Pablo Medina, Kaffe Bueno’s CEO and Co-Founder, told FoodNavigator. Reducing emissions ​ As well as creating products, the biorefinery also works to prevent the emissions that would have come from the coffee grounds had they not been upcycled. One of the greenhouse gasses coffee grounds usually emits is methane, which is 25 times more potent than CO2. “We prevent this from happening​,” Medina told us, “In this biorefinery, by using green chemistry and biotechnology we transform this by-product into different inputs\/ingredients for personal care, human and animal nutrition and agriculture​.” The biorefinery is also able to keep emissions low in other ways. “The beauty of our solution is that not only do we reduce the emissions associated with coffee disposal but most importantly the ones associated with the ingredients we are replacing in our customer's formulations. ​ “Due to the fact that we don’t have any additional land (usually farming represents the biggest CO2 emissions in the value chain) plus the innovative and sustainable nature of our biorefinery processes, our ingredients have at least 80% less emissions than current than current alternatives​.” Expansion​ The biorefinery, which opened in Denmark on 29 September, has the potential to expand up to 1,500 tons per year of production. This is not the culmination of Kaffe Bueno’s efforts, but only the beginning. “Our focus right now is on delivering products from newly opened biorefinery, nonetheless, thanks to the availability of spent coffee all around the world, we are currently also talking to different potential partners in Germany, Netherlands, US and South America to potentially establish the next biorefinery there​,” Medina told us. “This commercial biorefinery will have a capacity of at least 15,000 tons. The decision on this location will depend on different factors and will be decided next year​.”","filter_flag":1}
{"title":"CPHI Barcelona 2023 - Event preview - European Pharmaceutical Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmV1cm9wZWFucGhhcm1hY2V1dGljYWxyZXZpZXcuY29tL2FydGljbGUvMTg3MTg5L2NwaGktYmFyY2Vsb25hLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmV1cm9wZWFucGhhcm1hY2V1dGljYWxyZXZpZXcuY29tL2FydGljbGUvMTg3MTg5L2NwaGktYmFyY2Vsb25hLTIwMjMv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vd3d3LmV1cm9wZWFucGhhcm1hY2V1dGljYWxyZXZpZXcuY29tL2FydGljbGUvMTg3MTg5L2NwaGktYmFyY2Vsb25hLTIwMjMv0gEA","guidislink":false,"published":"Mon, 02 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=275, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmV1cm9wZWFucGhhcm1hY2V1dGljYWxyZXZpZXcuY29tL2FydGljbGUvMTg3MTg5L2NwaGktYmFyY2Vsb25hLTIwMjMv0gEA?oc=5\" target=\"_blank\">CPHI Barcelona 2023 - Event preview<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Pharmaceutical Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CPHI Barcelona 2023 - Event preview - European Pharmaceutical Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmV1cm9wZWFucGhhcm1hY2V1dGljYWxyZXZpZXcuY29tL2FydGljbGUvMTg3MTg5L2NwaGktYmFyY2Vsb25hLTIwMjMv0gEA?oc=5\" target=\"_blank\">CPHI Barcelona 2023 - Event preview<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Pharmaceutical Review<\/font>","source.href":"https:\/\/www.europeanpharmaceuticalreview.com","source.title":"European Pharmaceutical Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"CPHI Barcelona 2023 – Event preview 7 SHARES Posted: 2 October 2023 | CPhI | CPHI Barcelona takes place in October 2023, covering a wide range of topics from next generation biomanufacturing and formulation to sustainability. CPHI Barcelona, the renowned global pharma event, is set to take centre stage from 24 to 26 October 2023 at Fira Barcelona Gran Via, Spain. Building on its legacy of excellence, this year’s event promises to unite suppliers, innovators, and pharma professionals in an exceptional setting, combining the best of in-person and online experiences. CPHI creates connections and inspires partnerships across the global pharma community. READ THE PREVIEW HERE Uniting the global supply chain CPHI Barcelona serves as a vital platform for unrivalled networks and access to the global supply chain. It provides unparalleled opportunities to source valuable partnerships, secure contracts, and stay ahead in a rapidly evolving industry. Whether you’re seeking to forge relationships with thought leaders, trailblazers, or innovators, this event has it all. A unique blend of in-person and online experiences: CPHI Barcelona presents a unique opportunity to learn, procure, and connect with events that inspire innovation and drive change. By seamlessly blending the benefits of both digital and in-person formats, attendees develop relationships all year round. The Event Planner is a web and app tool that allows you to plan your time at the event in advance, making your time at CPHI Barcelona more effective. Attendees can plan meetings, bookmark interesting exhibitions and products, and receive personalised recommendations from AI regarding products, exhibitions and relevant content sessions. The app also contains all event essentials in one place, including your event badge and personal schedule. This maximises your efficiency and enjoyment while reducing event stress. Not only is the Event Planner useful for pre‑event planning, it can also be used during and after the event. You can navigate through the event using the interactive floor plan to find the exhibits that you bookmarked ahead of time, while receiving notifications about your schedule to track meetings and sessions. Once the event is finished, you can export the contact information of the connections you made for easy follow-up calls. So, dive into the immersive event platform before the in-person event, engage with the vibrant CPHI Barcelona community, and plan your experience early. Then, at Fira Barcelona, navigate the event effortlessly through intuitive zones, attend pre-scheduled 1:1 meetings, connect with exhibitors on-the-fly, and explore seminars while sourcing new suppliers. What’s new for 2023? This year, CPHI Barcelona introduces The Start‑Up Market, a dedicated space in Hall 3 of Fira Barcelona, where start-ups, innovators, and small enterprises from the industry can exhibit their exciting new products and solutions. The Start-Up Market is the space to visit to discover new innovations and connect with companies at the cutting edge of the pharma industry. Eligible companies classified as start-ups and active in the pharma, biopharma, digital, or medical device sectors can exhibit. The market space offers various benefits, including promotion as a show feature, access to start-up mentors, and a dedicated start-up networking lounge. Commitment to sustainability and social responsibility CPHI Barcelona is committed to organising an environmentally and socially responsible event. Efforts are being made to reduce the environmental impact, including sustainable transportation and shuttle services, the use of 100 percent renewable energy, and implementing initiatives to minimise single-use exhibitor stands. The event aims to support local businesses, empower communities, inspire sustainable development by celebrating initiatives through The Sustainability Award, and amplifying diverse voices through forums and events. Silvia Forroova, Director of partnerships & sustainability, Informa Markets, commented: “We are very excited to be back in Barcelona, one of Europe’s premier biotech and pharma manufacturing hubs. This year, the event will return to its former size and is designed to inspire innovation and drive change in the pharma industry. In the post-pandemic era, it’s exciting to see so many new products in clinical development and companies looking to widen and diversify their networks. There has never been a better time to attend CPHI. At the heart of pharma, we provide the vital connections that will underpin growth in pharma manufacturing in the next few years. Alongside this, we are committed to accelerating our progress in sustainability. Sustainability is embedded throughout CPHI, from our Better Stands programme to reduce waste, through to our conference content, where we are bringing industry leaders together to inspire and create conversation through a number of sessions dedicated to various aspects of sustainability.” Awarding Excellence The CPHI Pharma Awards will mark its 20th anniversary with a grand ceremony on 24 October 2023. This special edition will introduce three new categories, acknowledging the remarkable wave of innovation that has engulfed the industry. These categories will honour advancements in methodologies, sustainability efforts, and philanthropic initiatives. CPHI Pharma Awards 2023 Categories 1. Accelerating Innovation 2. API Development & Innovation 3. Finished Formulation 4. Manufacturing Excellence 5. Drug Delivery & Device Innovation 6. Packaging & Machinery 7. Supply Chain Excellence 8. Sustainability 9. Regulatory and Compliance 10. CEO of the Year 11. Start-Up Initiative 12. At the Heart of Pharma Conference agenda highlights CPHI Barcelona 2023 will feature an extensive conference agenda covering a wide range of topics, including next-gen biomanufacturing, partnering for success, formulating the future, future therapies, manufacturing 4.0, patient‑centric development, creating a circular economy, quality management fundamentals, and hiring for diversity. These sessions will provide valuable insights and help shape the future of the industry. The power of CPHI Barcelona extends beyond the event dates. With the event platform and CPHI Online, you can access on-demand conference content, stay connected with the CPHI community throughout the year, and fuel the growth of your business. Day 1 Tuesday 24 October Day One at CPHI Barcelona focuses on the themes Next-Gen Biomanufacturing, Formulating the Future, Partnering for Success, and Creating a Circular Economy. Sheila Ann Mikhail, co-founder and former CEO of Asklepios BioPharmaceutical, Inc sets the scene for the biomanufacturing landscape with a keynote address. The day also features two panels: Strategies for Commercialising Cell and Gene Therapies and Looking to the Future – What’s Next for the Generic Drugs Market. The first panel will consist of three speakers: Anders Wallstron, Xbrane Biopharma AB; Unmesh Lal, Frost & Sullivan; and Magnus Blomberg, AstraZeneca. It will cover topics such as manufacturing challenges for autologous cell therapies and cell therapy roadmaps to address challenges and drive speed-to-market. The second panel will be presented by Camille Dumont, Lonza Capsules and Health Ingredients, Juan Colberg, Pfizer, and Sven Stegemann, Leibniz JointLab. It will tackle the issue of shortages utilising fresh formulation approaches and driving quality improvements through process control optimisation. Following the panel, there will be sessions on the themes Partnering for Success and Creating a Circular Economy. Vinay Saluja, Novartis, will give a keynote and provide a detailed appraisal on CDMO landscape. A second speaker will provide insights on Sustainability in Pharma. Day 2 Wednesday 25 October The themes introduced on Day Two of CPHI Barcelona are Future Therapies, Manufacturing 4.0, Patient Centric Development, and Quality Management Fundamentals. Aser Alonso, Vice President engineering & transformation, GE Healthcare, starts us off with a keynote address for drug manufacturing. There will be a groundbreaking panel in the afternoon delving into the growing role of artificial intelligence (AI) as a technology to transform manufacturing efficiency, which is another topic generating much industry excitement. Entitled Loading Potential: Artificial Intelligence for Pharma Manufacturing, four speakers will cover the implications of AI for improving batch manufacturing processes, defining the role of chatbots, and even potential improvements in patient engagement. This panel will include speakers Andrew Kewson of Basilea Pharmaceutica, Guglielmo Iozzia from Merck, Sean Daughtry of Vertex Pharmaceuticals and Aurelio Arias from IQVIA. Samantha Parker, Chief Patient Access Officer, Innoskel, will pick up the second half of the day with a keynote address on Patient Centric Landscape, while Elisabeth Stampa, President, Medicines for Europe, gives a keynote address on Quality Management Fundamentals. The evening will conclude with a panel on Industry 4.0 – Setting the New Standard for Manufacturing Quality, with speakers Lawrence De Belder, Pharmatech Associates Inc., Isamir Martinez, ACS Green Chemistry Institute, Danita Broyles, Harmony Biosciences, and Sanjay Sharma from Dr Reddy’s. The panel will cover how to make data actionable to improve decision-making and real-world automation, identifying the right Enterprise Resource Planning system for supply chains and manufacturing processes, and establishing measurable KPIs. Day 3 Thursday 26 October There will be a Sustainability workshop in the morning of Day three. Conference sessions will explore manufacturing challenges and solutions for novel modalities. Adam Brown, Associate Professor of Biopharmaceutical Engineering at University of Sheffield will present new approaches for designing bioproduction systems that are fit for the manufacture of complex, engineered next-generation products and João Henrique Santos, Downstream Processing Scientist at Polpharma Biologics will explore optimisation of bispecific antibodies downstream processing.","filter_flag":1}
{"title":"Top pharma companies 2023: A satisfactory year - PharmaLive","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnBoYXJtYWxpdmUuY29tL3RvcC1waGFybWEtY29tcGFuaWVzLTIwMjMtYS1zYXRpc2ZhY3RvcnkteWVhci_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnBoYXJtYWxpdmUuY29tL3RvcC1waGFybWEtY29tcGFuaWVzLTIwMjMtYS1zYXRpc2ZhY3RvcnkteWVhci_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LnBoYXJtYWxpdmUuY29tL3RvcC1waGFybWEtY29tcGFuaWVzLTIwMjMtYS1zYXRpc2ZhY3RvcnkteWVhci_SAQA","guidislink":false,"published":"Tue, 10 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=283, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnBoYXJtYWxpdmUuY29tL3RvcC1waGFybWEtY29tcGFuaWVzLTIwMjMtYS1zYXRpc2ZhY3RvcnkteWVhci_SAQA?oc=5\" target=\"_blank\">Top pharma companies 2023: A satisfactory year<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PharmaLive<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top pharma companies 2023: A satisfactory year - PharmaLive","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnBoYXJtYWxpdmUuY29tL3RvcC1waGFybWEtY29tcGFuaWVzLTIwMjMtYS1zYXRpc2ZhY3RvcnkteWVhci_SAQA?oc=5\" target=\"_blank\">Top pharma companies 2023: A satisfactory year<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PharmaLive<\/font>","source.href":"https:\/\/www.pharmalive.com","source.title":"PharmaLive","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"As the COVID-19 pandemic continues to recede, the top pharma companies intensified their focus into areas such as cancer and metabolic diseases to build up their pipelines, and their growth prospects, for the future. By Christiane Truelove • [email protected] For many of the top pharmaceutical companies featured in this issue, the receding of the pandemic and a new normal meant seeking out new innovations beyond COVID-19. As many companies are dealing with expirations of patents for their top-selling products, they are feverishly stoking their pipelines to produce the next “big thing.” They also have their eye on the challenges to pricing posed by the Inflation Reduction Act in the United States, as well as climate change and its impact on human health. Acquisitions & collaborations To expand development in other therapeutic areas, the top companies are continuing to engage in new partnerships, as well as acquisitions. Even as the success of its semaglutide-based products – Ozempic, Rybelsus, and Wegovy – continues to surge, Med Ad News Company of the Year Novo Nordisk is looking ahead to figure out new ways to advance its leadership position in the diabetes and obesity care space. In August, Novo Nordisk announced that it would be acquiring Inversago Pharma for up to $1.08 billion. Inversago Pharma is a private, Montreal-based developer of CB1 receptor-based therapies for the potential treatment of obesity, diabetes, and complications associated with metabolic disorders The acquisition includes Inversago’s lead development asset, INV-202, an oral CB1 inverse agonist. INV-202 is designed to preferentially block the receptor protein CB1, which plays an important role in metabolism and appetite regulation, in peripheral tissues such as adipose tissues, the gastrointestinal tract, the kidneys, liver, pancreas, muscles, and lungs. Amgen ended 2022 with the announcement of its intent to buy Horizon Therapeutics for $27.8 billion. “Amgen’s decades of leadership in inflammation and nephrology, combined with our global presence and world-class biologics capabilities, will enable us to reach many more patients with first-in-class medicines like Tepezza, Krystexxa, and Uplizna,” said Chairman and CEO Robert A. Bradway of the deal at the time. “Additionally, the potential new medicines in Horizon’s pipeline strongly complement our own R&D portfolio. The acquisition of Horizon will drive growth in Amgen’s revenue and non-GAAP EPS and is expected to be accretive from 2024.” Amgen experienced serious pushback from the U.S. government over the deal, but reached a settlement with the FTC on September 1 whereby Amgen is prohibited from bundling one of its products with Horizon’s Tepezza (for thyroid eye disease) or Krystexxa (for chronic refractory gout). Among the several requirements in the consent order, should Amgen want to acquire pre-commercial products that have completed FDA clinical trials for treating either TED or chronic refractory gout, the company will have to receive FTC approval through 2032. Amgen and Horizon expect the acquisition to close in the early fourth quarter of this year. Pfizer completed four acquisitions last year – Arena Pharmaceuticals, Biohaven Pharmaceuticals, Global Blood Therapeutics, and ReViral – which CEO Albert Bourla states have further strengthened both the pipeline and the company’s current portfolio of innovative offerings. In March of this year, Pfizer revealed plans to acquire Seagen Inc., through a definitive merger agreement, for $43 billion. “Together, Pfizer and Seagen seek to accelerate the next generation of cancer breakthroughs and bring new solutions to patients by combining the power of Seagen’s antibody-drug conjugate (ADC) technology with the scale and strength of Pfizer’s capabilities and expertise,” Pfizer CEO Albert Bourla says. “Oncology continues to be the largest growth driver in global medicine, and this acquisition will enhance Pfizer’s position in this important space and contribute meaningfully to the achievement of Pfizer’s near- and long-term financial goals.” Seagen expects to generate approximately $2.2 billion of revenue in 2023, representing 12 percent year-over-year growth, from its four in-line medicines, royalties and collaboration and license agreements, according to executives. “When combining the expected strong growth trajectories for these medicines with candidates that could emerge from Seagen’s pipeline, subject to clinical trial and regulatory success, Pfizer believes Seagen could contribute more than $10 billion in risk-adjusted revenues in 2030, with potential significant growth beyond 2030.” In August, Eli Lilly announced the successful completion of its acquisition of Versanis Bio. The acquisition expands Lilly’s portfolio to include Versanis’ lead asset, bimagrumab, which is currently being assessed in a Phase IIb study alone and in combination with semaglutide in overweight adults or those living with obesity. Under the terms of the agreement, Versanis shareholders could receive up to $1.925 billion in cash, inclusive of the upfront payment and subsequent payments upon achievement of certain development and sales milestones. That same month, Lilly completed its acquisition of Sigilon Therapeutics Inc. The acquisition allows Lilly to continue researching and developing encapsulated cell therapies, including SIG-002, for the treatment of type 1 diabetes. The company also announced the successful completion of its acquisition of DICE Therapeutics Inc. This acquisition expands Lilly’s immunology portfolio to include DICE’s novel oral therapeutic candidates, including oral IL-17 inhibitors currently in clinical development, to treat chronic diseases in immunology. In March, Sanofi completed its acquisition of Provention Bio Inc. The acquisition adds Tzield (teplizumab-mzwv), an innovative, fully owned, first-in-class therapy in type 1 diabetes to Sanofi’s core asset portfolio in General Medicines. “This strategic fit for Sanofi lies at the intersection of our growth in immune-mediated diseases and disease-modifying therapies in areas of high unmet need,” says Olivier Charmeil, executive VP, General Medicines. In February, Takeda completed the acquisition of all shares of Nimbus Lakshmi Inc. from Nimbus Therapeutics LLC. Following the completion of this transaction, Takeda acquired TAK-279, formerly known at Nimbus as NDI-034858. According to company leaders, with a Phase III study in psoriasis expected to start in 2023, TAK-279 has the potential to demonstrate best-in-class efficacy, safety, and convenience in psoriasis as well as multiple other immune-mediated diseases, including inflammatory bowel disease, psoriatic arthritis, and systemic lupus erythematosus. In June GSK completed the acquisition of Bellus Health. The deal enhances the company’s respiratory portfolio, adding camlipixant, a P2X3 antagonist currently in Phase III development for the first-line treatment of adult patients with refractory chronic cough. GSK expects that the future launch of camlipixant will generate “significant” sales through 2031. GSK and SCYNEXIS announced an exclusive license agreement for the first-in-class antifungal Brexafemme (ibrexafungerp tablets), an FDA-approved treatment for vulvovaginal candidiasis (VVC) and for reduction in the incidence of recurrent VVC (RVVC). As part of the agreement, GSK has rights to commercialize the drug for VVC and RVVC while continuing to develop ibrexafungerp. “The challenge of antimicrobial resistance includes increasing rates of multi-drug resistant fungal infections,” said GSK Chief Commercial Officer Luke Miels. “Brexafemme is a novel, approved antifungal medicine with a broad spectrum of activity against existing and emerging resistant strains of fungi. In addition, the transaction consolidates GSK’s synergistic portfolio of innovative late-stage antibiotics.” VVC is estimated to affect up to 75 percent of women at least once, with 40–45 percent of them experiencing two or more episodes, according to the CDC. GSK states that Brexafemme also complements GSK’s gepotidacin. In January, Merck & Co. announced the successful completion of the cash tender offer for all of the outstanding shares of common stock of Imago BioSciences Inc., at a purchase price of $36 per share in cash, an approximate total equity value of $1.35 billion. Imago is a clinical-stage biopharmaceutical company developing new medicines for the treatment of myeloproliferative neoplasms and other bone marrow diseases. Imago’s lead candidate bomedemstat (IMG-7289), an investigational orally available lysine-specific demethylase 1 (LSD1) inhibitor, is being evaluated in multiple Phase II clinical trials for the treatment of essential thrombocythemia, myelofibrosis, and polycythemia vera, in addition to other indications. In June, Merck completed its acquisition of Prometheus Biosciences Inc. Prometheus’ leading clinical candidate, PRA-023, which will be known as MK-7240, is a humanized monoclonal antibody directed to tumor necrosis factor (TNF)-like ligand 1A, a target associated with both intestinal inflammation and fibrosis. It is being developed for the treatment of immune-mediated diseases, including ulcerative colitis, Crohn’s disease (CD), and other autoimmune conditions. In December 2022, Prometheus announced positive results for MK-7240 from ARTEMIS-UC, a Phase II, placebo-controlled study evaluating safety and efficacy in patients with moderate-to-severely active UC and APOLLO-CD, and a Phase IIA, open-label study evaluating safety and efficacy in patients with moderate-to-severe CD. Under the terms of the acquisition agreement, Merck acquired all outstanding shares of Prometheus for $200 per share in cash for a total equity value of about $10.8 billion. For AbbVie, the loss of exclusivity in the United States for Humira, the best-selling drug in the world, has the company looking not only to its autoimmune products Skyrizi and Rinvoq but also to several collaborations. With Anima Biotech, AbbVie intends to discover and develop mRNA biology modulators for three targets across oncology and immunology. With Immunome Inc., AbbVie is engaged in a worldwide collaboration and option agreement directed to the discovery of up to 10 novel antibody-target pairs arising from three specified tumor types using Immunome’s Discovery Engine. With Capsida Biotherapeutics Inc., AbbVie expanded a strategic collaboration to develop genetic medicines for eye diseases with high unmet need. And with Calibr, the company expanded a strategic collaboration to advance several innovative preclinical and early-stage clinical assets across AbbVie’s core therapeutic growth areas including immunology, oncology, neuroscience, and other areas of interest. In January, Boehringer Ingelheim and 3T Biosciences entered into a strategic collaboration and licensing agreement to discover and develop next-generation cancer therapies to address high unmet patient needs. According to company leaders, the partnership will bring together 3T Biosciences’ best-in-class 3T-TRACE (T-Cell Receptor Antigen and Cross-Reactivity Engine) discovery platform with Boehringer Ingelheim’s two-pronged research strategy combining cancer cell-directed and immune cell-targeting compounds, further strengthening the company’s pipeline. To further boost its rare disease portfolio, AstraZeneca acquired LogicBio Therapeutics Inc., a pioneering genomic medicine company. LogicBio has developed technology platforms for the delivery and insertion of genes to address genetic diseases, as well as a platform designed to improve viral vector manufacturing processes. These platforms, coupled with LogicBio’s highly experienced team and Alexion’s advancements with AstraZeneca, will drive future scientific possibilities and next-generation medicines to treat rare genetic diseases. In January, Kite Pharma Inc., a Gilead Company, and Arcellx Inc. announced the closing of the companies’ previously announced global strategic collaboration to co-develop and co-commercialize Arcellx’s lead late-stage product candidate, CART-ddBCMA, for the treatment of patients with relapsed or refractory multiple myeloma. Currently being investigated in a Phase II pivotal trial, CART-ddBCMA is Arcellx’s T-cell therapy utilizing the company’s novel synthetic binder, the D-Domain. Kite and Arcellx will jointly advance and commercialize the CART-ddBCMA asset in the United States, and Kite will commercialize the product outside the United States. In February, Kite announced the completion of the previously announced transaction to acquire Tmunity Therapeutics, a clinical-stage, private biotech company focused on next-generation CAR T-therapies and technologies. According to company leaders, the acquisition of Tmunity complements Kite’s existing in-house cell therapy research capabilities by adding additional pipeline assets, platform capabilities, and a strategic research and licensing agreement with the University of Pennsylvania. It will provide Kite with access to pre-clinical and clinical programs, including an “armored” CAR T technology platform, which potentially could be applied to a variety of CAR T’s to enhance anti-tumor activity, as well as rapid manufacturing processes. In addition, as part of the acquisition, the Tmunity founders, who remain in their roles at Penn, will also provide consulting services to Kite as senior scientific advisors. In May, Gilead announced the acquisition of all outstanding shares of XinThera, a privately held biotech company in San Diego. According to executives, the acquisition complements Gilead’s existing clinical development priorities by adding additional pipeline assets for well-validated targets in oncology and inflammation. Through the acquisition, Gilead gained rights to a portfolio of small molecule inhibitors targeting PARP1 for oncology and MK2 for inflammatory diseases that could enter clinical trials later this year. Both programs have the potential to address multiple indications, offering broad development opportunities alone and in combination with Gilead’s portfolio. In mid-September Novartis held its Extraordinary General Meeting where its shareholders approved the proposed 100 percent spin-off of Sandoz, the company’s generics and biosimilars business. The spin-off will occur on October 4, and will be implemented through the distribution of a dividend-in-kind of Sandoz shares to Novartis shareholders, and of Sandoz American Depositary Receipts (ADRs) to Novartis ADR holders, each of whom will receive one Sandoz Share for every five Novartis Shares and one Sandoz ADR for every five Novartis ADRs. Novartis expects that the spin-off will be tax neutral for Swiss tax and U.S. federal income tax purposes. Sandoz will be listed on the SIX Swiss Exchange, with an American Depositary Receipt (ADR) program in the United States. The ADRs will not be listed on a U.S. national securities exchange. In March Roche and Eli Lilly announced a collaboration involving the development of Roche’s Elecsys Amyloid Plasma Panel (EAPP), a blood test that intends to diagnose Alzheimer’s disease earlier. The EAPP measures phosphorylated Tau (pTau) 181 protein assay and apolipoprotein (APOE) E4 assay in human blood plasma. Elevated pTau 181 can indicate early stages of Alzheimer’s disease; the presence of APOE4 indicates the most common genetic risk factor of the disease. The result of the panel is supposed to be used with additional clinical information to guide further confirmatory testing with amyloid positron emission tomography or cerebrospinal fluid testing. The EAPP is not yet approved, but it has demonstrated clinical performance and is undergoing investigation to ensure clinical validation. New leaders 2022 and the first half of 2023 had several announcements of significant leadership shifts among the top pharma companies. Last year Joaquin Duato took the helm as CEO of Johnson & Johnson . Outgoing CEO Alex Gorsky had remained on board as executive chairman until stepping down in November 2022. The board of directors elected Duato as chairman, and he assumed this role in January 2023. “Joaquin’s appointment to the additional role of Chairman reflects his tremendous 30-year track record at Johnson & Johnson, as well as the board’s thoughtful and engaged approach to succession planning,” said Anne Mulcahy, independent lead director. “During Joaquin’s career with the Company, the board has witnessed firsthand his ability to effectively lead, collaborate, and create value for all our stakeholders. We have the utmost confidence that he will continue to be an excellent steward of the business and look forward to working closely with him in this next chapter.” Another notable leadership appointment was that of John Reed, M.D., Ph.D., to J&J’s executive committee as executive VP of pharmaceuticals, R&D. Reed brings 35 years of experience in biomedical research leadership, having previously served as executive vice president, global head of research and development at Sanofi. In April, BMS announced that Giovanni Caforio, M.D., chairman of the board and CEO, would retire as CEO, effective November 1, 2023. Christopher Boerner, Ph.D., executive VP, chief commercialization officer, was named executive VP, chief operating officer, effective immediately, and will succeed Caforio as CEO on November 1, 2023. The board also intends to appoint Boerner as a member after the annual meeting of shareholders. Adam Lenkowsky, senior VP, head of major markets, succeeded Boerner as executive VP, chief commercialization officer. After November 1, 2023, Caforio will continue to serve as executive chairman for a transition period to be determined by the board. Theodore R. Samuels will continue to serve as lead independent director. In July 2023, Pfizer made changes to its executive leadership team to further advance its pipeline, with an emphasis on oncology. Chris Boshoff, M.D., Ph.D., joined as chief oncology research and development officer and executive VP, reporting to Bourla. Leif Johansson, who stepped down from AstraZeneca’s board in April after 10 years as a director, is not the only major departure from the company. In anticipation of another retirement in 2024 – that of Mene Pangalos, executive VP, BioPharmaceuticals R&D – the company announced in July the appointment of Sharon Barr as his successor. Barr will be responsible for discovery through to late-stage development across Cardiovascular, Renal & Metabolism, and Respiratory & Immunology. She reports to CEO Pascal Soriot and became a member of AstraZeneca’s senior executive team in August. Barr was senior VP, head of research and product development of Alexion, AstraZeneca’s rare disease group, since 2013. In this role she has been responsible for drug discovery, process development, and clinical supply as well as clinical biomarkers and bioanalytical discovery, rare disease diagnostics, and bioinformatics supporting Alexion’s rare disease pipeline from target discovery through post-marketing. According to Soriot, Barr brings “outstanding experience essential to the advancement of our leading BioPharmaceuticals pipeline and a track record of driving productivity, innovation, and delivery of medicines for patients. This experience, coupled with her leadership style and passion for developing people, places her perfectly to take over the reins from Mene and help us to write the next chapter of success.” At Roche in March, Thomas Schinecker, Ph.D. took the reins from Severin Schwan as CEO of Roche Group. Under his direction, the company announced a strengthened R&D strategy, focused on “R&D Excellence.” The company currently ranks itself second in the number of pipeline assets in Phase I to Phase III studies as well as in new molecular entities with first-in-class potential amidst peers. However, according to Schinecker, Roche previously moved therapeutics to Phase III too quickly, resulting in a higher rate of Phase III failures more recently. The company decided to reallocate resources to research & development and has shifted its approach to R&D with a goal of driving efficacy and efficiency A high-level leadership change at Novartis was the resignation of Chief Commercial Officer Marie-France Tschudin, also president of the company’s Innovative Medicines International business. After nearly seven years in a commercial leadership position, Tschudin announced she would be leaving the company and also be stepping down from the company’s executive committee. On September 6, Novartis announced the appointment of AbbVie exec Patrick Horber, M.D., to the position of President, International. Opposition to the IRA The Inflation Reduction Act was passed by Congress and signed into law by President Joe Biden in August 2022. It directs new federal spending toward reducing carbon emissions, lowering healthcare costs, funding the Internal Revenue Service, and improving taxpayer compliance. And it’s the provisions to reduce healthcare costs – chiefly by giving the Centers for Medicare and Medicaid Services (CMS) the ability to directly negotiate some drug prices – that have raised industry ire. Through this provision, CMS can enter into price negotiations with drug manufacturers for certain high-cost, single-source Medicare Part B or Part D drugs. CMS will select the 10 and 15 highest-ranked Part D drugs for rolling out negotiated prices in 2026 and 2027, respectively. In August, CMS unveiled the list of 10 drugs up for the first price negotiations under the IRA, including best-sellers from J&J, Merck, Novartis, and BMS. Three of J&J’s medicines – Xarelto, Imbruvica, and Stelara – have been selected for price negotiation. CMS will publish the agreed-upon negotiated prices for the drugs by September 1, 2024, and the prices will go into effect on January 1, 2026. In July J&J announced that it filed a lawsuit against CMS to block the drug price negotiations. “The IRA [Inflation Reduction Act] breaks the agreement at the heart of the patent and regulatory laws: when companies invest and succeed at developing innovative new treatments, they are awarded time-limited and constitutionally protected rights in their innovation,” Johnson & Johnson said in a company statement. “With the implementation of the IRA, the government is forcing Janssen to provide its innovative, patented medicines on pricing terms that by law must be significantly below market prices. This would upend the current self-sustaining cycle of pharmaceutical innovation that provides patients with access to pioneering treatments, and directly impacts the creation of generic medicines that account for 90 percent of prescriptions filled in the U.S. If manufacturers do not ‘agree’ to the government-dictated terms of the IRA, they face massive penalties up to 1900 percent of a selected drug’s daily sales or are forced to withdraw all of their products from both Medicare and Medicaid—potentially depriving nearly 40 percent of U.S. patients of needed medicines.” In addition to J&J’s drugs, Bristol Myers Squibb’s Eliquis, Merck & Co.’s Januvia, Novartis’ Entresto, Eli Lilly’s Jardiance, AstraZeneca’s Farxiga, Novo Nordisk’s Fiasp, and Amgen’s Enbrel made the list. Five companies, including J&J, and two organizations (the U.S. Chamber of Commerce and PhRMA, the industry trade organization) have filed suits against the federal government to halt the drug price program. The other companies with lawsuits are Merck, BMS, Novartis, and Astellas Pharma. These lawsuits argue, among other things, that the drug price negotiations will not provide a genuine opportunity to negotiate, and the excise taxes operate as a coercive penalty. According to a statement from PhRMA, “The statute includes no requirement for checks and balances through public feedback and cuts off administrative and judicial review, violating the Constitution’s separation of power and due process clauses. Additionally, the statute includes an extreme excise ‘tax’ to force manufacturer compliance with the government mandated price that is disproportionate to the purported offense making it an excessive fine prohibited by the Eighth Amendment. Taken together, these claims clearly demonstrate the price setting provisions should be declared unconstitutional.” Efforts to address climate change In July, UN Secretary-General António Guterres announced that “short of a mini-Ice Age” in coming days, the month would likely “shatter [heat] records across the board.” According to the U.N. chief, “Climate change is here. It is terrifying. And it is just the beginning.” He warned of “children swept away by monsoon rains, families running from the flames [and] workers collapsing in scorching heat.” Guterres stated that “the era of global warming has ended” and “the era of global boiling has arrived.” Many of the top pharma companies have been engaged in initiatives to reduce their carbon output, and continue to advance their environmental strategies. “Since 2015 and COP21, where Sanofi was the first and only pharmaceutical company discussing climate change and its impact on human health, we have been making strides to reduce the emissions of our supply chain and minimize the impact our products have on the environment,” says CEO Paul Hudson. “As we build our road to carbon neutrality by 2030, we also want to help address the broader impacts of climate change on the health of populations by teaming up with all stakeholders. By working with governments, health professionals, patient groups, regulators we can accelerate the decarbonization of healthcare systems, and by expanding our investments in the development of adaptation solutions for climate vulnerable communities. All our company commitments are rooted in concrete, transparent actions and driven by the greater sense of responsibility of playing our part in the global adaptation and fight against climate change.” In line with its objective to reach carbon neutrality by 2030, Sanofi is advancing a holistic, company-wide ambition to minimize the environmental impact of its products and activities, across its value chain, while strengthening resilience to environmental changes. To support its strategy, Sanofi plans to invest more than €450 million through 2030. These investments notably support company programs on energy efficiency and decarbonization of energy supplies, as well as resource circularity – reduce, reuse, recycle, and recover – and reduction of natural resource extraction for water, for instance. Sanofi executives say by the end of 2022, greenhouse gas emissions had decreased 29 percent compared to 2019 in Scopes 1 & 2 and by 7 percent in Scope 3. In addition, the company has taken an end-to-end approach to reduce the environmental footprint of its products. For example, by 2027, the use of plastic in blister packs for all vaccines will be eliminated. “Today, the company is at 33 percent,” managers state. “Also, 62 percent of electricity supplied on corporate sites is renewable with a target of 100 percent by 2030. Sanofi’s latest state-of-the-art facilities, such as its EVolutive Facilities of Neuville-sur-Saône in southern France and in Singapore, both set to open in 2025, are carbon-neutral by design, with zero landfilling and 100 percent of the waste recycled or recovered.” According to Josep Catllà, head of corporate affairs, “Sustainability is at the core of Sanofi’s long-term strategy, and it is ingrained in our mindset and behaviors in everything we do. Whether it’s about accelerating our environmental commitments, improving access to healthcare for vulnerable populations, or building a diverse, equitable and inclusive workplace, we’re driven by the ambition to make a sustainable positive impact for our people, our communities and society overall. This is why we are taking the initiative to help communities around the world to work towards the decarbonization of healthcare systems, which today account for more carbon emissions than air transport. By working with local governments and healthcare actors to significantly reduce those emissions, and by continuing our essential work in delivering first- and best-in-class medicines and vaccines, we double our impact to make our planet healthier.” The company has conducted several pilot programs on how its most innovative products can contribute to reducing emissions along the care pathway. “The programs, evaluating medicines and vaccines for RSV, atopic dermatitis, and flu, show that prevention, reduced hospitalizations, decreased outpatient visits, and fewer patient consultations have a positive impact on CO2 emissions while improving patients’ health outcome,” executives say. “Additionally, a pilot program on the benefits of utilizing telemedicine for patients with atopic dermatitis showed reduced CO2 emission attributed to less frequent healthcare professionals’ visits while also improving patient comfort and outcomes. Sanofi will continue to implement pilot programs to advance data and understanding of the co- benefits of best-in-class therapies that can improve health outcomes while reducing greenhouse gas emissions. Outside of its scientific and financial achievements in 2022, AstraZeneca accomplished several goals in its environmental strategy, Ambition Zero Carbon. According to Soriot, by the end of December 2022, the company had achieved a 59 percent reduction in its Scope 1 and 2 greenhouse gas emissions compared to its 2015 baseline. “Our efforts include a partnership with Honeywell to develop a next-generation respiratory inhaler, which will have a near-zero global warming potential,” Soriot says. According to Pablo Panella, senior VP, Global Respiratory & Immunology, while pMDIs contribute less than 0.1 percent of global GHG emissions, “we nonetheless believe it is critical to significantly reduce this burden. In fact, at AstraZeneca, work to reduce the carbon footprint of our pMDIs is already under way and represents an important step towards achieving our Ambition Zero Carbon goal.” AstraZeneca’s next-generation respiratory inhalers will use a propellant with near-zero global warming potential, similar to that of dry powder inhalers, that is also non-persistent (breaks down easily in the environment), and non-bio accumulative (does not build up within living organisms). “The twin crises of climate change and biodiversity loss are damaging the planet and harming human health,” Soriot says. “Through AZ Forest, we are working with local communities and ecological experts to deliver reforestation at scale, as well as support biodiversity and sustain livelihoods. We are taking a science-based approach, and AZ Forest will remove around 30 million tons of carbon dioxide from the atmosphere over about 30 years.” GSK, which is planning to move to new global headquarters in London in 2023, is targeting for the location to achieve a BREEAM Outstanding rating (the highest accreditation available), with a focus on energy consumption, health and wellbeing, and lower CO2 through procurement and construction, helping the company to reach its goal to have a net zero impact on the climate by 2030. The company’s environmental goals are 100 percent renewable electricity by 2025 (Scope 2); 80 percent reduction in carbon emissions and investment in nature-based solutions for the remaining 20 percent of its footprint by 2030 (all scopes); and net zero emissions across its full value chain by 2045 (all scopes). “We have mapped our carbon footprint across our value chain to ensure we have a clear understanding of where to focus our efforts, which informs our pathway to net zero,” executives say. GSK is aiming to reduce emissions across areas such as purchased goods and services (from the goods and services that GSK buys from other companies), its direct operations (Scope 1 and 2 emissions from running its labs, factories, and commercial offices), and logistics (Scope 3 emissions from delivering medicines and vaccines across the globe). Measures taken include the Sustainable Procurement Programme, which drives targeted supplier engagement and setting sustainability standards; onsite production through wind turbines and solar panels, together with buying green electricity; maximizing transition from air freight to sea freight; and investing in an R&D program to reduce greenhouse gas emissions from its metered dose inhalers, by reformulating an alternative gas that could reduce the climate impact by up to 90 percent. In June Johnson & Johnson released its “Health for Humanity Report” and the “We All Belong: 2022 Diversity, Equity and Inclusion (DEI) Impact Review.” One of the goals of the report was to drive home the fact that the company takes its environmental, social, and governance strategy seriously and to also highlight its progress in advancing sustainable social, environmental, and economic change. Last year, for the fifth year in a row, J&J received an A-list rating from non-profit CDP (Carbon Disclosure Project), which is considered the “gold standard” for environmental reporting. Johnson & Johnson also made a $14.6 billion R&D investment across its businesses and integrated capabilities related to how it operates. Back in 2021, Boehringer Ingelheim announced its MORE GREEN strategy. The company plans to become carbon neutral in its operations by 2030; further reduce the water footprint, particularly at sites affected by water scarcity, as well as protecting clean water in the communities in which the company operates; and utilize aspects of circularity to reduce overall operational waste to landfill, as well as applying eco-design and green chemistry concepts to all new products. Novo Nordisk has a goal of reducing its greenhouse gas emissions by 2025. In 2021, carbon emissions from its product distribution totaled 71,000 tons with air freight accounting for 80 percent. “To help us move towards a net-zero carbon footprint, we explored the possibility of entering into agreements with producers of sustainable aviation fuel,” stated Katrine DiBona, corporate VP, Global Public Affairs and Sustainability. “We identified a start-up, SkyNRG, that was open to partnering with us, and late in the year, we were able to reach a long-term agreement making us among the first companies to pursue a direct-to-source strategy for sustainable aviation fuel. Having a dedicated team of specialists that we were able to call upon was an important part of the success. Our approach of using a pool of specialists has allowed us to build a solid foundation to tackle challenges like these with cross-category capabilities.”","filter_flag":1}
