{"title":"The Emergence of Smart Load Panels | ProBuilder - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VtZXJnZW5jZS1zbWFydC1sb2FkLXBhbmVsc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VtZXJnZW5jZS1zbWFydC1sb2FkLXBhbmVsc9IBAA?oc=5","id":"CBMiNmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VtZXJnZW5jZS1zbWFydC1sb2FkLXBhbmVsc9IBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VtZXJnZW5jZS1zbWFydC1sb2FkLXBhbmVsc9IBAA?oc=5\" target=\"_blank\">The Emergence of Smart Load Panels | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Emergence of Smart Load Panels | ProBuilder - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VtZXJnZW5jZS1zbWFydC1sb2FkLXBhbmVsc9IBAA?oc=5\" target=\"_blank\">The Emergence of Smart Load Panels | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Among a widening range of sustainable design choices, alongside the installation of induction cooktops and EV chargers for electric vehicles, the transition to a clean energy future is becoming increasingly reliant on whole-home electrification. At the core of a home’s power system is its electrical panel, which distributes a home’s electricity to the various circuits that power lights, outlets, appliances, and other devices throughout the house. According to some of the industry’s leading building products manufacturers (BPMs), the traditional electric panel, while undeniably effective at distributing power in the home, isn’t as sustainable as it could be. To solve that problem, companies like SPAN, Leviton, and Schneider Electric have recently rolled out what they believe to be a game changing solution: smart panels. The Technology Behind the Smart Panel Unlike traditional panels, smart panels can intelligently distribute power among various devices to ensure that the panel's capacity is never exceeded. Smart panels, like Leviton’s Whole Home Energy Monitor, are equipped with integrated or add-on software controls that provide the homeowner with additional information and capabilities beyond a traditional electrical panel. “The Whole Home Energy Monitor enables features such as turning 2nd Gen Smart Circuit Breakers on\/off from anywhere, scheduling breaker activity to benefit from reduced energy rate periods and automating the shedding of nonessential loads,” says Justin Berghoff, senior director of business development & product management for Leviton. “All these activities are conveniently available from a single source—the My Leviton app.” The Whole Home Energy Monitor allows for direct monitoring of alternative energy sources such as solar, battery storage, and generators, providing homeowners with insights into their energy consumption and ways to reduce their energy output. The Whole Home Energy Monitor offers precise user controls that go way beyond the capabilities of a traditional electrical panel. Image: Leviton SPAN’s smart panel uses off-the-shelf breakers and installs just like a traditional load panel. According to Karen Gough, SPAN's Vice President of Sales, it relies on “a combination of electromechanical current sensors in the panel and cloud-based software that allows for seamless home energy management from anywhere using the SPAN Home App for iOS and Android.” Using the company’s PowerUp technology, SPAN’s panel tracks energy usage at the circuit level and automatically adjusts energy levels in the home, allowing builders to build all-electric homes without increasing service size. “During a hot day when the air conditioner is running, SPAN may give priority to the kitchen refrigerator and other essential circuits over an electric car charging circuit,” says Gough. “This means that the car charging speed may be throttled to maintain normal performance throughout the rest of the home.” SPAN's smart panel uses electromechanical current sensors and cloud-based software to provide homeowners with the most up-to-date info about their energy consumption. Image: SPAN Similarly, Schneider Electric recently announced the launch of Schneider Home, an energy management solution that allows homeowners to connect to and control Schneider Pulse, a 200a smart electrical panel designed for retrofits and new-construction. The panel also works in tandem with Schneider’s home battery backup, a high-power solar inverter, an EV charger, and connected electric sockets and light switches. The entire system can be accessed remotely through the Schneider Home mobile app. Putting the Panel Into Practice At least as it relates to Leviton, SPAN, and Schneider Electric’s technologies, smart panels aren’t just for new homes. Smart load panels can be added to a new or existing home’s electrical system. Leviton's all-plug-on breaker design allows homeowners to replace standard circuit breakers with 2nd Gen Smart Circuit Breakers. In addition, basic and smart circuit breakers can be used interchangeably in the Leviton Load Center. Schneider Home is a modular, flexible solution that includes new Square D Control Relays designed to snap directly onto the Square D QO Plug-on Neutral load centers, while the Schneider Energy Monitor can be added directly into the panel via a branch circuit at the same time. “This solution allows builders nationwide to add smart panel functionality to new and existing electrical systems without the cost or disruption of a total smart panel replacement,” says Ben St. James, Schneider’s Residential Systems Offer Manager. “Commissioning for both devices can be done by the installer quickly, allowing the homeowner to monitor and control their energy use conveniently through the Schneider Home mobile app.” Schneider Home allows users to track their energy usage through the Schneider Home app. Image: Schneider Electric Better for Homeowners, Better for the Environment By allowing homeowners to visualize, control, and fine-tune their energy output, Leviton’s Whole Home Energy Monitor and the Schneider Home system aren’t just reducing utility costs, but they’re also minimizing real estate’s total carbon footprint, which accounted for 36% of global emissions in 2020. “On the surface level, load centers are basic protection devices that have seen little to no innovation in decades,” Berghoff says. “The My Leviton app provides a unique opportunity to visualize and make adjustments to homeowners’ top-consuming breakers, like scheduling water heaters, hot tubs or pool pumps when away from the residence or to adjust an individual load like a single smart outlet or smart switch. Unifying with the electric vehicle charger further reduces consumer demand on fossil fuels.” Not only do smart panels reportedly reduce each individual household’s carbon footprint, but according to Gough, they can also “help improve grid stability by automatically adjusting household energy consumption to avoid overloading the grid.” Consolidated energy systems powered by smart panels provide homeowners with the ability to completely customize the electricity their homes generate and consume. As a modular solution, Schneider home’s energy package allows users to pick and choose the necessary tools for their homes, providing a level of flexibility that St. James says will make smart panel benefits accessible for a greater number of homeowners. “Builders are looking for solutions that allow homebuyers to live more sustainably and save money on their electric bills,” he says. “Many new products come to market with that goal; however, they can come with a significant cost or may only be available in some areas. As a modular solution, Schneider Home can also be customized to meet specific needs, eliminating unnecessary parts and reducing costs further. This helps builders serve millions of homeowners with smart energy solutions.” Impact on the Industry Not only do smart panels create an opportunity for homeowners to make their existing homes more energy efficient, but Berghoff and St. James hope that new technology from Leviton and Schneider Electric, and really all smart panels, serves as a baseline for homes of the future. Step one, according to Berghoff, is addressing the current outdated housing stock that contributes to high global carbon emissions: “The new dawn of electrification is here, today. And we have an immense housing stock today that needs to be addressed via retrofits, beyond just new home developments.” From there, St. James says it’s up to home builders to use cleaner energy solutions in new-construction projects to make smart homes not just an increasingly viable opportunity, but a standard for all homebuyers: “We are looking to the builder community to lead the way by incorporating these solutions into their projects to deliver greener home options. We expect the market to respond positively because we know that sustainability is a focus for homebuyers and they are looking for homes that already come with those solutions.”","filter_flag":1}
{"title":"'Does gas power have a role to play as the Island transitions to a net-zero emissions future?' - Jersey Evening Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL2plcnNleWV2ZW5pbmdwb3N0LmNvbS92b2ljZXMvMjAyMy8xMC8yMC9kb2VzLWdhcy1wb3dlci1oYXZlLWEtcm9sZS10by1wbGF5LWFzLXRoZS1pc2xhbmQtdHJhbnNpdGlvbnMtdG8tYS1uZXQtemVyby1lbWlzc2lvbnMtZnV0dXJlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL2plcnNleWV2ZW5pbmdwb3N0LmNvbS92b2ljZXMvMjAyMy8xMC8yMC9kb2VzLWdhcy1wb3dlci1oYXZlLWEtcm9sZS10by1wbGF5LWFzLXRoZS1pc2xhbmQtdHJhbnNpdGlvbnMtdG8tYS1uZXQtemVyby1lbWlzc2lvbnMtZnV0dXJlL9IBAA?oc=5","id":"CBMijAFodHRwczovL2plcnNleWV2ZW5pbmdwb3N0LmNvbS92b2ljZXMvMjAyMy8xMC8yMC9kb2VzLWdhcy1wb3dlci1oYXZlLWEtcm9sZS10by1wbGF5LWFzLXRoZS1pc2xhbmQtdHJhbnNpdGlvbnMtdG8tYS1uZXQtemVyby1lbWlzc2lvbnMtZnV0dXJlL9IBAA","guidislink":false,"published":"Fri, 20 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=293, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL2plcnNleWV2ZW5pbmdwb3N0LmNvbS92b2ljZXMvMjAyMy8xMC8yMC9kb2VzLWdhcy1wb3dlci1oYXZlLWEtcm9sZS10by1wbGF5LWFzLXRoZS1pc2xhbmQtdHJhbnNpdGlvbnMtdG8tYS1uZXQtemVyby1lbWlzc2lvbnMtZnV0dXJlL9IBAA?oc=5\" target=\"_blank\">'Does gas power have a role to play as the Island transitions to a net-zero emissions future?'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jersey Evening Post<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"'Does gas power have a role to play as the Island transitions to a net-zero emissions future?' - Jersey Evening Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL2plcnNleWV2ZW5pbmdwb3N0LmNvbS92b2ljZXMvMjAyMy8xMC8yMC9kb2VzLWdhcy1wb3dlci1oYXZlLWEtcm9sZS10by1wbGF5LWFzLXRoZS1pc2xhbmQtdHJhbnNpdGlvbnMtdG8tYS1uZXQtemVyby1lbWlzc2lvbnMtZnV0dXJlL9IBAA?oc=5\" target=\"_blank\">'Does gas power have a role to play as the Island transitions to a net-zero emissions future?'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jersey Evening Post<\/font>","source.href":"https:\/\/jerseyeveningpost.com","source.title":"Jersey Evening Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"By Richard Digard A CALL earlier this month by Reform Jersey leader Deputy Sam Mézec for Island Energy – the gas utility company – to be taken into public ownership, following the near week-long outage affecting around 4,000 homes and businesses, raises an important CI issue: what’s the point of propane? Or, if you prefer, does gas have a future? It’s an elephant-in-the-room question that receives very little air time, with attention focused on net-zero and a dash for renewables, but could really, as Deputy Mézec highlights, be centre stage of any energy debate. Calls for nationalising private businesses are quaintly old fashioned these days and I guess even Jersey Gas\/Islands Energy Group’s best friend would be cautious about recommending it as long-term investment, because this is clearly a utility under pressure. Doubts raised by the supposed gas explosion in St Helier last December, the reputational damage caused by the total closure of the supply this month and the switch away from fossil fuels inevitably accelerate the rush for other energy sources. My interest in this started when the States of Guernsey began publishing power-use statistics some years ago and the drift away from the stuff became apparent. There had been a spike in use a while back because, I think I’m correct in recalling, the then gas company offered free boilers to property developers creating new units. Smart move. It locked tenants\/owners into long-term-supply contracts and – crucially – helped to defray the massive fixed cost of the gas production and distribution network. And it’s this that Deputy Mézec seems to have in mind with his calls for nationalisation. In Guernsey, for example, the latest statistical digest shows that, in 2022, 56.8 GWh of gas were consumed in the island, which was 16% less than in 2021 and 24% less than five years earlier – a massive 40% decline in that period and one that is not sustainable. Islands Energy Group knows all this, of course, which is why it is in a massive transformation process. As it says: ‘We’ve made being a role model for net-zero a strategic business objective which is steering changes in how we operate and what services and products we offer.’ Two things here. The first is to stay in business despite currently being at the forefront of the carbon emitters. The second is that the group represents a rich history of energy provision in Jersey, Guernsey and the Isle of Man. For instance, gas first lit the streets of St Peter Port in 1830 and a year later in St Helier. Large crowds gathered in King Street to watch the dazzling effects as shops and other establishments were lit up for the very first time, while the Isle of Man experienced the same in 1836. These were all separate companies back then, but used the same process – roasting coking coal to drive off the so-called town gas which was collected in huge gasometers (which some of you will remember) before it was piped to customers. As a result of technology, the supply now used in these islands is liquefied petroleum gas, derived from oil. Cleaner, certainly, but still fossil-fuel based. And therein lies the problem – can a gas company ever be seen as green? IEG chief sustainability officer Alex Herschel says they need to reduce the company’s operational carbon footprint while increasing support for local environmental initiatives at the same time as diversifying into new products and exploring alternative energy sources such as green hydrogen. Jo Cox, the group’s chief executive, puts it this way: ‘We’re committed to achieving net-zero, but this won’t happen overnight. Gas will continue to have a place in the energy mix as it is vital for the success of our islands’ energy transition – and we plan to be a big part of the net-zero future so we can continue to provide energy for every generation.’ So, yes. After supplying fossil fuel gas for the best part of 200 years, it can apparently make that leap. It certainly intends to try. It’s ambitious and a couple of things are at play here. Most of us see the move to reduce CO2 emissions as a switch to electricity. As indeed does Deputy Mézec. Challenged on this on Twitter, now known as X, he said: ‘Agreed. But a private company will never be an effective partner in that transition. If we start reducing their customer base, they could eventually just go bust, leaving homes and businesses without their supply.’ So, he says: ‘We should nationalise with the aim to transition them out.’ Not my favourite course of action at all – but it could happen by default if there was ever a real possibility of the company going under. Would the Crown Dependencies really leave an estimated 40,000 customers hanging without heat, hot water or cooking power and no immediate alternative? Especially after Jersey’s recent experiences and damage to the hospitality sector. The other aspect, however, which I hadn’t considered until browsing IEG’s website, is whether gas can help wean us off our dependence on oil. According to a recent paper from Policy Centre Jersey, of the total energy consumed in the Island, 58% is provided by oil, 38% by electricity and 3% by gas. It will, I assume, be broadly similar in Guernsey. Like thousands of others in the island, I use oil, but an old, poorly insulated cottage and inadequate electrical supply in the road mean a heat pump isn’t a practical green alternative to our energy needs now we need to replace the boiler – no matter how keen we are to reduce our carbon footprint. Can a truly net-zero gas company (if such a thing exists) help reduce the islands’ dependence on oil over an acceptable timeframe until alternatives develop? IEG certainly thinks so (as its vision states) via ‘a modern approach under a future-focused lens to meet the needs of every generation, now and in the future’. Let hope it’s right. Otherwise the Jersey taxpayer might be funding Deputy Mézec’s nationalisation aspirations simply to keep the last remaining customers warm and fed.","filter_flag":1}
{"title":"Mama maker sets out expansion plans - Bangkok Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS9idXNpbmVzcy9nZW5lcmFsLzI2NjM5NDQvbWFtYS1tYWtlci1zZXRzLW91dC1leHBhbnNpb24tcGxhbnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS9idXNpbmVzcy9nZW5lcmFsLzI2NjM5NDQvbWFtYS1tYWtlci1zZXRzLW91dC1leHBhbnNpb24tcGxhbnPSAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS9idXNpbmVzcy9nZW5lcmFsLzI2NjM5NDQvbWFtYS1tYWtlci1zZXRzLW91dC1leHBhbnNpb24tcGxhbnPSAQA","guidislink":false,"published":"Sat, 14 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=287, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS9idXNpbmVzcy9nZW5lcmFsLzI2NjM5NDQvbWFtYS1tYWtlci1zZXRzLW91dC1leHBhbnNpb24tcGxhbnPSAQA?oc=5\" target=\"_blank\">Mama maker sets out expansion plans<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bangkok Post<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mama maker sets out expansion plans - Bangkok Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS9idXNpbmVzcy9nZW5lcmFsLzI2NjM5NDQvbWFtYS1tYWtlci1zZXRzLW91dC1leHBhbnNpb24tcGxhbnPSAQA?oc=5\" target=\"_blank\">Mama maker sets out expansion plans<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bangkok Post<\/font>","source.href":"https:\/\/www.bangkokpost.com","source.title":"Bangkok Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Thai President Foods to invest over 2 billion baht in three years to raise production capacity Mr Pun says this is the biggest investment the company has made in two decades. Thai President Foods Plc, the manufacturer of Mama instant noodles, plans to invest more than 2 billion baht over a three-year period to expand its production capacity in response to anticipated future growth, both domestically and abroad. Of the total budget, 1.6 billion baht is slated for acquiring and installing eight machines, while 400-500 million baht is for the purchase of land and construction of a new factory, said general manager Pun Paniangvait. The new factory will either be built on a 50-60 rai plot of land located near the Mekong River in Nong Khai or Mukdahan, or within the Eastern Economic Corridor (EEC) in Chon Buri or Rayong. Construction of the new facility is set to commence in 2025, with operations scheduled to begin in 2026. On completion, the new factory will have a production capacity of 600,000 packs per day, representing a 30% increase from the current output. This additional production capability will support the company's anticipated growth in both domestic and international markets. \"This is the biggest investment the firm has made in two decades,\" Mr Pun said, adding the company is allocating an extra 200 million baht to install new machinery at its Rayong factory in the coming year. There are eight Mama noodle factories at present. Four are located in Chon Buri, Rayong, Lamphun and Ratchaburi. These factories have a combined production capacity of 180 million packs and 36 million cups per month. \"We fully endorse the government's proposed minimum wage increase. Labour costs account for roughly 10% of our overall operational expenses. A 10% hike in labour costs would translate to just a 1% impact on our overall operations and we have implemented strategies to leverage the minimum wage increase,\" Mr Pun said. The company is also bolstering its production efficiency by building a new smart instant noodle factory, introducing more automated machinery at its facilities in Rayong and Lamphun, and increasing the utilisation of alternative energy sources in the production process. The company is also committed to upgrading existing machinery, as well as introducing newer, more efficient, and faster production equipment across various factories. Currently, the company exports its instant noodle products to 68 countries. According to Mr Pun, the company is also set to enhance its global market presence, with the aim of increasing international sales from the current level of 30% to a range of 40-50%. This expansion will be achieved by introducing new products to existing markets and launching existing products in new markets. \"There is a vast potential in international markets, which are larger than the domestic market. The Chinese market is of particular interest because of the growing trend among Chinese consumers to purchase more Thai food products as souvenirs,\" he said. Potential markets for expansion include Europe and America, with emerging markets such as India and Africa also on the radar. The company has already taken steps towards the African market by partnering with a local instant noodle manufacturer in Kenya to transfer its technology, ultimately paving the way for the introduction of Mama instant noodles during a later phase. As for the future direction of the business, the company aims to continuously develop new products in response to market demands and evolving consumer lifestyles that are constantly changing. Thai President aims for a 4% rise in sales to 23-25 billion baht in 2023, with even more substantial growth projected at 5-7% next year.","filter_flag":1}
