{"title":"S&P; Global (SPGI) Q3 2023 Earnings Call Transcript - The Motley Fool","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2wuY29tL2Vhcm5pbmdzL2NhbGwtdHJhbnNjcmlwdHMvMjAyMy8xMS8wMi9zcC1nbG9iYWwtc3BnaS1xMy0yMDIzLWVhcm5pbmdzLWNhbGwtdHJhbnNjcmlwdC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2wuY29tL2Vhcm5pbmdzL2NhbGwtdHJhbnNjcmlwdHMvMjAyMy8xMS8wMi9zcC1nbG9iYWwtc3BnaS1xMy0yMDIzLWVhcm5pbmdzLWNhbGwtdHJhbnNjcmlwdC_SAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3LmZvb2wuY29tL2Vhcm5pbmdzL2NhbGwtdHJhbnNjcmlwdHMvMjAyMy8xMS8wMi9zcC1nbG9iYWwtc3BnaS1xMy0yMDIzLWVhcm5pbmdzLWNhbGwtdHJhbnNjcmlwdC_SAQA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2wuY29tL2Vhcm5pbmdzL2NhbGwtdHJhbnNjcmlwdHMvMjAyMy8xMS8wMi9zcC1nbG9iYWwtc3BnaS1xMy0yMDIzLWVhcm5pbmdzLWNhbGwtdHJhbnNjcmlwdC_SAQA?oc=5\" target=\"_blank\">S&amp;P Global (SPGI) Q3 2023 Earnings Call Transcript<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"S&P; Global (SPGI) Q3 2023 Earnings Call Transcript - The Motley Fool","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2wuY29tL2Vhcm5pbmdzL2NhbGwtdHJhbnNjcmlwdHMvMjAyMy8xMS8wMi9zcC1nbG9iYWwtc3BnaS1xMy0yMDIzLWVhcm5pbmdzLWNhbGwtdHJhbnNjcmlwdC_SAQA?oc=5\" target=\"_blank\">S&amp;P Global (SPGI) Q3 2023 Earnings Call Transcript<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool<\/font>","source.href":"https:\/\/www.fool.com","source.title":"The Motley Fool","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Transition Strategies\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"SPGI earnings call for the period ending September 30, 2023. S&P Global (SPGI 0.86%) Q3 2023 Earnings Call , 8:30 a.m. ET Contents: Prepared Remarks Questions and Answers Call Participants Prepared Remarks: Operator Good morning, and welcome to S&P Global's third quarter 2023 earnings conference call. I'd like to inform you that this call is being recorded for broadcast. All participants are in a listen-only mode. We will open the conference to questions and answers after the presentation and instruction will follow at that time. To access the webcast and slides, go to investor.spglobal.com. [Operator instructions] I would now like to introduce Mr. Mark Grant, senior vice president of investor relations for S&P Global. Sir, you may begin. Mark Grant -- Senior Vice President, Investor Relations Good morning, and thank you for joining today's S&P Global third quarter 2023 earnings call. Presenting on today's call are Doug Peterson, president and chief executive officer; and Ewout Steenbergen, executive vice president and chief financial officer. For the Q&A portion of today's call, we will also be joined by Martina Cheung, president of S&P Global Ratings. We issued a press release with our results earlier today. In addition, we have posted a supplemental slide deck with additional information on our results and guidance. If you need a copy of the release and financial schedules or the supplemental deck, they can be downloaded at investor.spglobal.com. The matters discussed in today's conference call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including projections, estimates and descriptions of future events. Any such statements are based on current expectations and current economic conditions and are subject to risks and uncertainties that may cause actual results to differ materially from results anticipated in these forward-looking statements. 10 stocks we like better than S&P Global When our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.* They just revealed what they believe are the ten best stocks for investors to buy right now... and S&P Global wasn't one of them! That's right -- they think these 10 stocks are even better buys. See the 10 stocks *Stock Advisor returns as of October 30, 2023 Additional information concerning these risks and uncertainties can be found in our Forms 10-K and 10-Q filed with the U.S. Securities and Exchange Commission. In today's earnings release and during the conference call, we're providing non-GAAP adjusted financial information. This information is provided to enable investors to make meaningful comparisons of the company's operating performance between periods and to view the company's business from the same perspective as management. The earnings release contains financial measures calculated in accordance with GAAP that corresponds to the non-GAAP measures we're providing. And the earnings release and the supplemental deck contain reconciliations of such GAAP and non-GAAP measures. I would also like to call your attention to certain European regulations. Any investor who has or expects to obtain ownership of 5% or more of S&P Global should contact investor relations to better understand the potential impact of this legislation on the investor and the company. We're aware that we have some media representatives with us on the call. However, this call is intended for investors, and we would ask that questions from the media be directed to our Media Relations team, whose contact information can be found in the release. At this time, I would like to turn the call over to Doug Peterson. Doug? Doug Peterson -- President and Chief Executive Officer Thank you, Mark. As we look at this quarter's highlights, I want to remind you that the financial metrics we'll be discussing today refer to non-GAAP adjusted metrics unless explicitly noted otherwise. We're pleased to report 11% revenue growth in the third quarter, excluding the impact of Engineering Solutions. We saw acceleration in revenue growth in every division this quarter. As we discussed last quarter, we took decisive action to protect margins in the second and third quarters last year. And while lapping that impact contributed to our expense growth this quarter, we're pleased to see margins expand approximately 100 basis points despite that headwind. Adjusted EPS increased 10% year over year, and we're raising our adjusted EPS guidance by approximately $0.10 at the midpoint to reflect the better-than-expected results through the third quarter. Strong financial results like these come as a result of continued innovation and execution, and we're excited about the rapid pace of product launches coming from S&P Global this quarter. We'll be discussing a few of them on the call, but I encourage you to look through the releases available in our online press center to get a better sense of the sheer volume of new products and features we've introduced this quarter. We've seen acceleration in each of the strategic growth areas we've been reporting since our investor day. We also saw our Vitality Index reached 12% of total revenue in the quarter as new products continue to generate value for both customers and shareholders. We also made progress on our AI initiatives, which I'll touch on briefly today, but we plan to provide a more holistic update on our progress next quarter. We continue to align our goals and operations against the five strategic pillars we introduced at investor day. I'm thrilled with what our team was able to deliver for our customers this quarter. As we lean into our customer conversations and continue to provide innovative solutions to the problems that most need solving, our customers are increasingly viewing S&P Global as a trusted strategic partner. In the third quarter, sales cycles were consistent with the longer cycle we've seen in the last few quarters, though we're encouraged that these conversations with customers are often leading to larger deals. In times of market volatility, uncertainty or change, the global markets has learned to count on S&P Global for differentiated data, powerful workflow tools, important insights and unrivaled benchmarks. We're seeing confirmation of our strategic emphasis on private markets, as well as sustainability and energy transition as revenue growth accelerated meaningfully in both those areas this quarter. As we continue to engage with customers, we hear clear indications of long-term optimism despite the near-term uncertainty and volatility in the markets. Our conversations with financial institutions, corporates and others generally revolve around interest rates in the short term with everyone interested in identifying peak interest rates. Large maturity walls along with other factors contribute to our optimism about the multiyear growth trajectory for S&P Global. Related to Ratings, global billed issuance saw a very strong third quarter with 21% growth year over year. With credit spreads tightening through the third quarter, issuers were more comfortable coming to the market, though refinancing activity continues to drive the majority of issuance. We also saw better-than-expected activity in bank loans particularly around amend and extend transactions, which we expect to continue in the fourth quarter, though perhaps not to the same extent. We also saw our relative position CLOs improve again in the third quarter, marking a continuation of the trend we've seen all year. Vitality revenue is another area of accelerating growth for S&P Global this quarter. Our Vitality revenue metric consists of revenue derived from new or enhanced products. These innovative products contributed 12% of revenue in the third quarter and grew a combined 22% year over year, a significant acceleration from the 14% growth last quarter. You'll notice that the largest contributors to our Vitality revenue are unchanged from last quarter. While products can and will move out of the Vitality Index over time as they mature, it's encouraging to see growth from these products remain steady and resilient. We're also encouraged by the early signs of growth and traction among many of the smaller products that will likely scale to be the top contributors in the coming quarters and years, including the trends we see in private markets for more transparency in valuation and benchmark products. I'd like to turn to some of those new product launches now. We're seeing strong cross-divisional collaboration driving new ideas with much of that innovation now turning to generally available products. In the third quarter, we introduced multiple data sets from our Mobility division to our Market Intelligence Marketplace, making crucial vehicle forecast and registration data available via both Xpressfeed and Snowflake. We also launched a new single unified platform that marks the product integration of both Platts and IHS Connect. The new platform is called Platts Connect and allows customers access to a comprehensive range of products, benchmarks, data and insights from one easy-to-use interface on desktop and mobile. These two products, Mobility and Marketplace and Platts Connect, also highlight two of our early opportunities to integrate new AI capabilities. In the coming months and quarters, we'll be introducing intelligent search and other AI-powered functionality that we're currently developing and testing within Marketplace and Platts Connect. We'll have more details on that as we get closer to launching those new features. We also introduced Entity Insights in the third quarter, which brings data from Sustainable1 to our network and regulatory solutions to power KYC third-party risk management and vendor management within a single workflow tool, leveraging data for 27 million global entities. I also want to provide an update on our development of ChatIQ. As we've shared with you, ChatIQ is a generative AI product developed jointly between Kensho and our Market Intelligence team. During the third quarter, we had a new beta release that we continue to test internally, but this is a step function improvement over our last internal release. Given our strategic focus, I wanted to provide a bit more detail on the acceleration of our sustainability and energy transition products as we expected in the third quarter. Customer needs have evolved away from ESG scores and moved toward climate and energy transition. We believe we are uniquely visioned to win in this market. When we talk to customers, we hear clear trends. Customers don't just need a set of opaque scores. They're building internal sustainability frameworks, and they need high-quality raw data. With Trucost, we have what we believe to be the most robust and comprehensive climate data set in the world. We also offer detailed sustainability data on 17,000 companies, including approximately 3,500 that provide robust granular data through our corporate sustainability assessment survey. Companies are seeking to operationalize the risk management around climate, and we have the largest set of real asset level data available with emissions data and climate hazards mapped to 1.6 million physical assets. We also hear consistently from customers that they need help with energy transition, including developing and executing a viable energy transition strategy. We have solutions that cater to customers in different industries, including our automotive value chain carbon accounting solution and the power evaluator solution for energy transition strategies within the crucial power utility sector. We see this customer need across all industries. So this quarter, we also launched the Sustainability Starter Pack. This is a comprehensive solution to help companies start from scratch or from wherever they may be as they develop sustainability strategies. We help them assess materiality, measure greenhouse gas emissions and develop the reports necessary to comply with disclosure requirements and stakeholder demands. Customers need help generating things like a TCFD report and measuring things like greenhouse gas emissions. They need help benchmarking their own progress against peers, and they need help managing the transition to renewable energy sources. We're confident that S&P Global is unparalleled in its ability to provide both the breadth and the depth of offerings necessary to adequately cover all these areas. We're continually increasing the data that we make available through Xpressfeed, and we're pleased to be adding data sets around net zero commitments and biodiversity before year-end. Clearly, we're meeting customers at their point of need, and that's showing up in our results. Trucost revenue growth accelerated to 55% year over year. Energy transition continues to grow nearly 40%. And our total sustainability and energy transition revenue growth accelerated to 36% year over year in the third quarter. While we're very encouraged by these results, we will not rest on our laurels. We remain committed to accelerating product leadership in this vital area and look forward to many new exciting products to come in future quarters and years. Of course, our commitment to innovation and customer value also powers our ability to generate value for our shareholders. This is an incredible quarter of accelerating growth. We also continue to demonstrate discipline around expenses as margin expansion in the third quarter helped keep trailing 12-month margins relatively flat year over year. Trailing 12-month margins improved sequentially from the second quarter, and we expect margins for the full year to expand more than 100 basis points based on the midpoint of our guidance as Ewout will explain in more detail. The economic factors facing the company are largely unchanged as we look to the final few months of 2023. Secular trends continue to serve as strong tailwinds for the company, while cyclical trends can impact different parts of the business in different ways. Despite increased geopolitical uncertainty and evolving regulatory landscape around things like sustainability and continued uncertainty around the timing of the capital markets recovery, S&P Global remains committed to delivering value in all market conditions. Turning to the conditions of the debt markets. We're tightening the range of our expectations for billed issuance as we now expect growth of 5% to 7% compared to our prior expectations of 4% to 8%. As we've discussed previously, we introduced the billed issuance reporting metric this year, as well as a full year forecast to provide context for the issuance assumptions embedded in our Ratings revenue guidance. Billed issuance remains the issuance metric most tightly correlated with our transaction revenue in Ratings. Our latest forecast from the Ratings Research Group now calls for positive market issuance growth for the full year, up from last quarter's expectation for a full year decline. As a reminder, market issuance can differ materially from billed issuance with divergence this year driven by declines in unrated debt and sovereign in international public finance, which don't impact billed issuance. And now I'd like to turn the call over to Ewout Steenbergen to go through more details around our financial results and outlook. Ewout? Ewout Steenbergen -- Executive Vice President, Chief Financial Officer Thank you, Doug. As a reminder, the financial metrics that we will be discussing today refer to non-GAAP adjusted metrics unless explicitly noted otherwise. This was an exciting quarter for S&P Global as we saw growth accelerate across all five of our divisions, and revenue and margins both outperformed our internal expectations. Adjusted earnings per share increased 10% year over year. While reported revenue grew 8%, this actually understates the accomplishments of the team during the third quarter because excluding Engineering Solutions and the small tuck-ins done earlier this year, revenue growth was an impressive 11%. We also expanded adjusted margins by 100 basis points and reduced our fully diluted share count by 4% year over year. As you saw in the press release earlier this morning, we plan to continue share count reduction with the launch of an incremental $1.3 billion accelerated share repurchase program in the coming weeks. Revenue in the quarter was driven by growth across all divisions, led by outperformance in our Ratings division, which benefited from elevated issuance activity in the high-yield and bank loan markets. While the environment remains unpredictable for the debt markets, we saw stronger issuance volume throughout the third quarter than we expected, particularly in September. Adjusted expenses were up 6% year over year, while the adjusted operating income increased 10%. Acceleration is further demonstrated by our strategic growth initiatives. Sustainability and energy transition revenue grew 36% to $78 million in the quarter, driven by strong demand in climate and physical risk products and our energy transition products. As Doug highlighted earlier, we're fulfilling our customer needs for raw data and reporting capabilities around sustainability and energy transition, and this is evident by the third quarter growth. This acceleration reconfirms our continued optimism around the long-term potential of this important part of our growth. Moving to Private Market Solutions. We saw revenue increase by 18% year over year to $109 million, driven by strong growth in Market Intelligence private market software solutions, including iLEVEL and a return to strong growth in Ratings private market revenue as bond issuance and private credit estimate activity both improved in the quarter. We're also encouraged by the demand we're seeing in our private market valuation and benchmark offerings. Vitality revenue, which is the revenue generated by innovation through new or enhanced products from across the organization, was $369 million in the third quarter, representing a 22% increase compared to prior year. Importantly, Vitality revenue represented 12% of our total revenue in the quarter, making it the third consecutive quarter of improvement in our Vitality Index score. Now, turning to synergies. In the third quarter of 2023, we recognized $149 million of expense savings due to cost synergies, and our annualized run rate exiting the quarter was $588 million. We expect to complete our cost synergy program by year-end with a run rate of approximately $600 million. We continue to make progress on our revenue synergies as well with $25 million in synergies achieved in the third quarter and an annualized run rate of $112 million. Turning to expense growth. We are pleased to see that our efforts to optimize our portfolio and deliver cost synergies offset most of the year over year expense growth in the third quarter. Our total expenses increased less than 6% year over year, though we continue to see some inflationary pressure on compensation expense. Due to the decisive expense actions we took last year, the reset of incentive compensation this year continues to contribute meaningfully to expense growth, though we do not expect any further headwinds from this going forward. We are confident that we continue to strike the appropriate balance between disciplined expense management and investing in our business as evidenced by the volume of new products coming to the market this year and our expectation to deliver more than 100 basis points of adjusted margin expansion for the full year at the midpoint of our guidance range. Now, let's turn to the division results. Market Intelligence revenue increased 8%, driven by strong growth in Data & Advisory Solutions and Enterprise Solutions. Desktop grew 5% in the third quarter, driven by strong subscription growth as ACV growth continued to outpace revenue growth, partially offset by modest softness in onetime sales. Renewal rates continue to remain strong in the mid- to high 90s range. Data & Advisory Solutions and Enterprise Solutions each grew by 9% in the quarter, benefiting from double-digit growth in subscription-based offerings. Credit & Risk Solutions continues to see strong new sales for RatingsXpress and RatingsDirect products, as well as continued double-digit growth in credit analytics. Adjusted expenses increased 9% year over year, primarily due to compensation expense. Operating profit increased 6%, and the operating margin decreased 60 basis points to 33.3%. On a trailing 12-month basis, margins improved 140 basis points. As we progress through the fourth quarter, we expect continued acceleration in revenue growth as we move into the most favorable comparison quarter for the year. Furthermore, we see the business continuing to benefit from the launch of new products and monetization of cross-sell referrals as part of the division's overall revenue synergy program. As a result, we are tightening our full year guidance for revenue growth by 100 basis points to a range of 6.5% to 7.5% while reaffirming our full year margin outlook. Now, turning to Ratings. In the third quarter, we saw continued improvements in issuance activity, particularly due to refinancing in the bank loan and high-yield markets. Revenue increased 20% year over year, well above our internal expectations. However, growth was helped by a $19 million cumulative catch-up for customers' self-reported commercial paper issuance in nontransaction revenue, which primarily benefited structured finance. Excluding this impact, Ratings would have grown approximately 17% in the third quarter. Transaction revenue grew 34% in the third quarter, driven primarily by growth in bank loan and high-yield issuance. Nontransaction revenue increased 13%, primarily due to an increase in annual fees, which includes the catch-up revenue I mentioned previously, as well as growth in Ratings Evaluation Service activity and at CRISIL. Excluding the impact of the catch-up revenue, nontransaction revenue would have grown approximately 8%. Adjusted expenses increased 18%, primarily due to the write-down of incentive compensation expense in the year-ago period. This resulted in a 22% increase in operating profit and a 70 basis points increase in operating margin to 56.6%. On a trailing 12-month basis, margins are still impacted by the relatively low margins in the fourth quarter of last year. As Doug mentioned, we're tightening our billed issuance growth assumption for 2023 to 5% to 7%. This reflects the outperformance we saw in the third quarter, but also reflects our slightly lower expectation for investment-grade issuance in the fourth quarter relative to our prior forecast. While we expect continued growth in nontransaction, we still see headwinds in issuer credit ratings revenue as fewer new issuers come to the market. As a result, we are increasing Ratings revenue guidance range by 100 basis points, now expecting growth of 6% to 8% for the full year and reiterating our margin guidance. And now turning to Commodity Insights. Revenue growth increased 11% following a second consecutive quarter of double-digit growth in both Price Assessments and Energy & Resources Data & Insights. Upstream data and insights increased approximately 2% year over year, benefiting from better-than-expected demand for both content and software, as well as slightly improved retention rates. The business line continues to prioritize growth in its subscription base. Price Assessments and Energy & Resources Data & Insights grew 12% and 10%, respectively. Growth was driven by continued strength in our benchmark data and insights products. We also continue to see strong commercial momentum in our subscription offerings for both business lines. Advisory & Transactional Services revenue grew 33%, driven by strong trading volumes across all sectors in Global Trading Services and strong performance in advisory revenue in the quarter. The business line continues to benefit from market-driven volumes, but we're also seeing positive results in key areas of strategic investment, including energy transition. Adjusted expenses increased 6%. Operating profit for Commodity Insights increased 17%, and the operating margin improved 260 basis points to 48.4%. Trailing 12-month margins improved 240 basis points. We continue to see Commodity Insights benefit from strong secular trends around energy transition and sustainability and demand for benchmarks, data and insights. Following this quarter's strong performance, we are raising the low end and tightening Commodity Insights overall revenue guidance range, now expecting growth of 8.5% to 9.5% for the full year. There's no change to our margin guidance. In our Mobility division, revenue increased 10% year over year. The team continues to execute well with the third consecutive quarter of double-digit growth in the dealer segment and continued growth in new business in the manufacturing and financials and other segments. Dealer revenue increased 30% year over year, driven by the continued benefit of price realization within the last year and new store growth, particularly in CARFAX for Life and used car subscription products, as well as the addition of Market Scan. Manufacturing grew 4% year over year, driven by elevated recall activity and continued strength in marketing solutions. Financials and other increased 9% as the business line continues to see healthy underwriting volumes and a favorable pricing environment similar to last quarter. Adjusted expenses increased 10%, driven primarily by increased incentive compensation expense, but also due to the inorganic contribution to expenses from the Market Scan acquisition. This resulted in a 10% increase in adjusted operating profit and 20 basis points of operating margin contraction year over year. Trailing 12-month margins have contracted 100 basis points. We expect continued strong growth in used car subscription products as we progress through the fourth quarter. We also expect Mobility to continue to benefit from dealerships and OEMs increasing their incentive spend on new vehicles as affordability is hampered by rising rates. As a result, we are narrowing our guidance for revenue growth to a range of 9% to 10% for the full year. There is no change to our margin guidance. Now, turning to S&P Dow Jones Indices. Revenue increased 6%, primarily due to gains in exchange-traded derivative volumes and asset-linked fees. We're very pleased to see asset-linked fees return to positive revenue growth in the third quarter. Revenues were up 4% year over year, driven by higher ETF AUM, which benefits from both market depreciation and net inflows but was partially offset by mix shift into lower-priced products, continuing the pattern from last quarter. Exchange-traded derivative volume increased 18%, primarily driven by an approximately 20% increase in S&P 500 Index options volume. Data & Custom Subscriptions increased 2% year over year, driven by continued strength in end-of-day contract growth. During the quarter, expenses increased 9% year over year, with the majority of the increase driven by the write-down of incentive compensation in the year-ago period. Operating profit in Indices increased 5%, and the operating margin decreased 90 basis points to 69.4%. Trailing 12-month margins have contracted 80 basis points. There's no change to our revenue outlook for Indices. However, as a result of the continued cost discipline and outperformance year-to-date, we're increasing our margin guidance for the division to a range of 68% to 69% for the full year. Now, let's move to the latest views from our economists, who are forecasting global GDP growth of 3.1% in 2023. While outlooks vary somewhat by region, our economists are forecasting a period of subdued global growth fueled by higher-for-longer rates with a soft landing base case assumption as we move through the first half of next year. We continue to expect inflation to remain above the target rates of central banks and energy commodity prices such as crude oil to remain above the historical averages as well. For the full year, we assume Brent crude will average approximately $84 per barrel, slightly higher than our last estimate as we expect Brent grew to average $88 in the fourth quarter. Now, let's turn to our guidance. This slide represents our GAAP guidance for headline metrics. Adjusted guidance for the company reflects the results through the third quarter, as well as our most recent views on the macroeconomic environment and market conditions. We're narrowing our expectations for total revenue growth to a range of 4.5% to 5.5% for the full year to reflect the changes discussed earlier on our divisional revenue outlook. Furthermore, we are maintaining our operating profit margin guidance of 45.5% to 46.5% with the expectation that we will achieve full year margins close to the midpoint of the range. We have provided the granular guidance on corporate and allocated expense, deal-related amortization, interest expense and tax rate in the supplemental deck posted to our IR site. This includes a 50 basis point reduction in our adjusted effective tax rate to a range of 20.5% to 21.5%. As a result of this quarter's strong performance and our expectations for the remainder of the year, we're increasing and tightening our full year adjusted diluted EPS guidance to a range of $12.50 to $12.60. The final slides in this deck illustrate our revenue and margin guidance by division, reflecting the drivers that I mentioned previously. In conclusion, our business has demonstrated exceptional growth across divisions this quarter, while we continue to manage expenses prudently. Furthermore, I'm pleased with the progress being made across our cost synergy initiatives and growth across revenue synergies as we see more and more new products coming to the market that would have been impossible without the merger. The teams have done a truly excellent job executing on our key strategic initiatives while still driving profitable growth across all divisions this quarter, and we look forward to delivering a strong finish to 2023. And with that, I would like to invite Martina Cheung, president of S&P Global Ratings and executive lead for Sustainable1, to join us. And we'll turn the call back over to Mark for your questions. Mark Grant -- Senior Vice President, Investor Relations Thank you, Ewout. [Operator instructions] Operator, we will now take our first question. Questions & Answers: Operator Thank you. Our first question comes from Ashish Sabadra with RBC Capital Markets. Your line is open. Ashish Sabadra -- RBC Capital Markets -- Analyst Thanks for taking my question. Really strong billed issuance momentum in September of 35%. There was a comment around IGB potentially weak in the fourth quarter. But just wondering if you can comment on the strength that you saw in high-yield and bank loans in the third quarter for the rest of the year? And also, if you can talk about any initial color on the refi wall and share pipeline for '24. Martina Cheung -- President, S&P Global Ratings Thanks very much for the question. It's Martina here. Yes, very pleased with Q3 overall. As you have seen, our billed issuance was up 21% and a very, very strong September. In high yields, we were very pleased to see it was about 150% growth in issuance overall year over year in the quarter, and high yields year-to-date is up about 50% rated issuance in the market. We see strong refi activity there in Q3 and looking to see more of that as we go forward, certainly into next year. It's -- Q3 marked, I think, a notable point in terms of issuers willing to come back and tap the market for high yields. And then, on bank loans, as we said before, we didn't have heroic assumptions on bank loan volumes for this year. Overall, while we saw an increase in Q3 year over year, we're still down year over year, year-to-date in bank loan issuance. There, we saw a lot of refinancing. Interestingly, a very strong trend this year that we saw in Q3 and are monitoring closely going forward is a lot of amend to extend activity -- or amend and extend activity rather in the bank loan space. And that's been a boost in that area from an issuance standpoint. For '24, obviously, we're not commenting yet for '24. We'll certainly give more on that in February. But the factors that we're watching closely, refinancing walls are very healthy. Our last midyear report on refinancing showed the five-year total's up about 11%. And between now and '26, we see about $8 trillion in refinancing. So that's something that we watch closely, and that's a very robust growth in that area. But we also are looking at usual factors, the macroeconomic factors, certainly heightened geopolitical uncertainty. M&A has not been great this year. As we've seen, it's been down by quite a bit this year. So we're looking to see that come back in next year as well. And just the other point that I would make on -- as we're looking ahead in the next several quarters is that CP balances or commercial paper balances are quite high. So that could lead to some issuance if we see corporates transitioning from CP to fixed income. And we've commented in the past that we continue to see corporate cash balances at pre-pandemic levels, which we think will continue to boost the need for issuance as well. Operator Thank you. Our next question comes from Manav Patnaik with Barclays. Your line is open. Manav Patnaik -- Barclays -- Analyst Thank you. Good morning. I just wanted to focus on the MI margins, if I could. I mean, I understand trailing 12 months, it's up. But just the low 30s, how should we think about that going forward? And I would think that the synergies, the combination that there should be a lot of upside there, but perhaps just a lower relative growth and maybe it's an investment area. But just any thoughts on cost control and margin improvement there going forward would be helpful. Ewout Steenbergen -- Executive Vice President, Chief Financial Officer A couple of comments on this. First, if we look back at last year, we took very decisive actions in terms of pulling back expenses when the market turns more south in the second and the third quarter in several areas, among which also incentive compensation. So we have some difficult comps for this year. Having said that, No. 2, point No. 2, we acknowledge that MI can do better with margins. And we're seeing several opportunities to expand margins as we have also guidance for the full year and implicitly for the fourth quarter. So that brings me to my third point is that we expect margins actually to improve significantly beginning with the next quarter due to the easier compare but also due to several management actions that we are putting in place, including tight management of headcount and other expenses, while we still continue to invest in growth and other strategic initiatives. Doug Peterson -- President and Chief Executive Officer Thanks, Manav. Operator Thank you. Our next question comes from Toni Kaplan with Morgan Stanley. Your line is open. Toni Kaplan -- Morgan Stanley -- Analyst Thanks very much. This one's for Martina. Your billed issuance was markedly ahead of our industry data during the quarter. And so, I was hoping you could discuss if you've seen any notable share gains in particular Ratings categories this year? And just any color around share gains. Martina Cheung -- President, S&P Global Ratings Thanks, Toni, for the question. I give a couple of comments on this. Certainly, we would look at the differences between market issuance and billed issuance. And I think Doug and Ewout cover that routinely in terms of how to assess our performance specifically. For us, the billed issuance data in Q3 was strong for a number of reasons. Firstly, it's a bit of a mix question. So high yield, more bank loans, less frequent issuer compared year over year, which is just a function of when the high-yield and leverage loan issuers tap the market. I would also say we're extremely pleased with the progress and momentum that we have in a number of asset classes. When we talked to you last year at investor day, we said we were making investments in structured finance. We were making investments in infrastructure. We had acquired Shades of Green and making investment in SPO. And we've seen really robust performance in all of those areas, which we had tagged and very, very pleased to see those results. Doug Peterson -- President and Chief Executive Officer Thanks, Toni. Operator Thank you. Our next question comes from Faiza Alwy with Deutsche Bank. Your line is open. Faiza Alwy -- Deutsche Bank -- Analyst Yes. Hi. Thank you. Good morning. Ewout, I wanted to follow up on your comments around expenses. Can you help us think through expenses in the fourth quarter? And more importantly, as we look ahead to 2024, some of the -- now that you're at the end of the road in terms of synergies, how should we think about expenses in 2024 just generally across the business? Ewout Steenbergen -- Executive Vice President, Chief Financial Officer Yes, of course. First of all, I would like to comment that if we think about expenses, we have a very volatile comp in 2022. So it has moved around a lot in the quarters last year due to the good reason that we put back very hard, and we're very on top of expense management when we had the difficult markets last year. This year, actually, our trends are far more stable. So year over year, there is a lot of noise, but I think this year actually from a pattern perspective looks much better. I think if you look at corrected expenses actually and if you take out Engineering Solutions, we are having expense growth that is below revenue growth. So we're seeing nice healthy margin expense -- margin expansion if you correct for those same items, particularly for Engineering Solutions. We're very happy to see how expenses and margins have developed in Commodity Insights. You have seen some very nice margin expansion there, as well as if we think about incentive compensation swing year over year, if you would correct for that, actually we're looking at quite modest expense growth in Ratings, Mobility and Indices as well. For the full year, we are expecting for this full year 2023 expense growth in the low single-digit level. So implicitly, if you then would look at the fourth quarter, expenses should be down in a low single-digit level in order to get to that overall guidance range. Doug Peterson -- President and Chief Executive Officer Thanks, Faiza. Operator Thank you. Our next question comes from Alex Kramm with UBS. Your line is open. Alex Kramm -- UBS -- Analyst Yes. Good morning. Just coming back to the Market Intelligence discussion from earlier. It's a question that I've asked a couple of times since you've done this deal. But part of our thesis on the IHS Markit acquisition was that that's a business on the market financial side that had been cobbled together by a lot of acquisitions over many, many, many years. And I think we're kind of hoping that you get in there with your S&P Global viewpoint and say like what businesses make sense or do not and maybe make this a leaner and meaner machine. So just wondering to what degree that's an effort that you guys are focused on right now? And maybe anything that you've seen where you echo that that there may be some things to do and the business could still look a little bit different in the future or if you're very happy with the business portfolio today? Doug Peterson -- President and Chief Executive Officer Alex, this is Doug, and thank you for the question. And let me just take a step back to -- for one second to a higher level about the integration and the merger overall. We're thrilled with the progress, and you've seen that today with some of the new product launches that we described, which are bringing together information, data research from across the portfolio. And within Market Intelligence, we have the same kind of integration going on. As you know, we always looked at the integration of the integration. We realized that IHS Markit had done a lot of acquisitions. They've grown a lot of products. And one of the opportunities is to continue to consolidate those and put those together. And we see a lot of progress there. This is something you should hold us to and watch us how we're going to continue to bring together the areas. As you know, within Market Intelligence, we've got a lot of opportunities to attack new markets. As an example, corporates, financial services at IHS Markit truly was focused on financial services. A lot of their products are very attractive to corporates. We're finding a lot of opportunities as you'll hear us talk about and you know related to sustainability and private markets. So we look at this opportunity to continue to consolidate the businesses internally, which is going to bring upside from an expense point of view. And we're also going to be investing for growth, especially in areas like sustainability, private markets and then expanding areas like our reference pricing, which can be used in so many different ways. But your thesis is right. We're going to continue to consolidate, and we will also look very carefully at the overall portfolio. Operator Thank you. Our next question comes from Andrew Steinerman with J.P. Morgan. Your line is open. Andrew Steinerman -- JPMorgan Chase and Company -- Analyst Hey, Ewout, it's Andrew. Could you just tell us how M&A revenues in dollars contributed to MI, Mobility, Ratings and overall in the third quarter? Ewout Steenbergen -- Executive Vice President, Chief Financial Officer Of course, Andrew, and I had expected you to ask about organic constant currency revenue. So let me first give that number. That was 10.4% for the quarter. Specifically for Market Intelligence, seven; for Ratings, 18.5; Mobility 8.2; Commodities, 10.9; and Indices, 5.8. In terms of adjustments with respect to acquisitions, there was $3.8 million of correction for Market Intelligence, given the acquisitions we have done there. And for Mobility, $5.6 million. And then, there was a correction for Engineering Solutions from last year of $96 million. So if you combine that with the FX impact, which you can find in the supplemental deck, you would come to that organic constant currency growth of 10.4. And as you and I are very much in agreement, that is a very healthy basis to look at the real performance of the divisions. Doug Peterson -- President and Chief Executive Officer Thanks, Andrew. Operator Thank you. Our next question comes from Jeff Silber with BMO Capital Markets. Your line is open. Jeff Silber -- BMO Capital Markets -- Analyst Thanks so much. So your investor day was a little less than a year ago, and I'm just curious, can you just compare how you felt about some of the businesses then compared to how you feel about them now? Anything better or worse compared to that time period? Doug Peterson -- President and Chief Executive Officer Jeff, this is Doug. Well, let me take a step back again. And if you recall, we had our investor day. It was one year ago almost. It's on December 1, 2022. At that time, we laid out our new vision Powering Global Markets and the five pillars that we use to manage the business, as well as allocate capital. At that time, we put in place longer-term '25, '26 targets for revenue growth and for margins. We're well on track for all of those. And we also laid out at the time some really interesting and for us, ambitious targets for new products and new services. And we also feel really confident about what we're seeing. We feel like we targeted and have identified the most important secular trends and market trends and that we're growing in that direction. There's excellent reception for that. So one year in, almost one year into those targets, we're very confident about achieving them, and we're really excited about our prospects. Thanks, Jeff. Operator Thank you. Our next question comes from Scott Wurtzel with Wolfe Research. Your line is open. Scott Wurtzel -- Wolfe Research -- Analyst Hey. Good morning, guys. Just one for Martina. I would love to hear just your thoughts a little bit more on some of the performance in Ratings in the context of the private credit market. And then, maybe also some of your thoughts on where you think the private credit market is heading relative to public debt markets and how the company can further play in that space. Martina Cheung -- President, S&P Global Ratings Scott, thanks so much for the question. Just reflecting the prior question as well when we did the IR Day, I said that two points. One is that the private markets were not going away in the sense that they were going to continue to grow. And the second is that we saw that as an opportunity. And both things have played out as expected this year. We're very pleased with our overall performance from a Ratings standpoint in the private markets. It comes in the form of a couple of areas, so increased demand for fund ratings. There's been a real healthy pipeline, lot of dialogue with the sponsors and fund managers. We've also seen quite a bit of demand on the structured credit front, which we had highlighted as a key trend that we thought we would see, and that has certainly played out this year. And as we see the overall AUM and allocation to the asset class increase, we're very well positioned. We're out in the market with credit estimates, portfolio assessments, etc., with our Ratings team and then having really, really great dialogue with the market participants. So very pleased from a Ratings standpoint. Doug Peterson -- President and Chief Executive Officer Thanks, Scott and welcome to the call. Operator Thank you. Our next question comes from Andrew Nicholas with William Blair. Your line is open. Andrew Nicholas -- William Blair and Company -- Analyst Hi. Good morning. Thanks for taking my question. A lot of really good color on new product development. Vitality Index is ticking higher. Growth there is good. I'm just curious and I don't know if this is one that you can quantify, but just how much of that is a result of investments in product development on the gen AI side? Or is that something that can create kind of a new leg of accelerated growth as you continue to kind of harvest your investments there? Ewout Steenbergen -- Executive Vice President, Chief Financial Officer Thank you, Andrew. And we are very happy that you are recognizing the level of innovation, the level of entrepreneurship, the level [Inaudible] company. We're very happy and pleased around that. If you think about the background of this, this is coming from, first of all, the merger. The merger gives us a lot of benefit in combining products, features, data sets, platform, capabilities. And that is really driving a part of it. Second part of it is really the investments we're making, strategic growth initiatives. And we're really pleased with what we're seeing in sustainability, energy transition, private markets and several other areas that fall out of that but are also very entrepreneurial. You see growth in areas in Indices like thematics, factor-based. We launched something that is called more the credit fix. We have car listings in Mobility and many other areas. So generally, investments in growth initiatives are really starting to pay off. And that is ultimately then also showing up in the Vitality Index, which is something that is maybe unique as a metric. And we're, as far as we know, the only company in our industry publishing this, but it is a clear indication of innovation that we would like to publish. With respect to AI and gen AI, it's powering many of the products that we are having, but it is more embedded. I wouldn't say the new really gen AI features that it is really in the number so far because most of those products are still under development. And we will get back to you once we are really at a production-grade level kind of offering that we can bring to our customers. So I think it's a little bit too early for the impact of gen AI, but more to come on that over the next few quarters. Doug Peterson -- President and Chief Executive Officer Thanks, Andrew. Operator Thank you. Our next question comes from George Tong with Goldman Sachs. Your line is open. George Tong -- Goldman Sachs -- Analyst Hi. Thanks. Good morning. You narrowed the guidance for revenue growth in Market Intelligence with the midpoint unchanged at 7%. Does that suggest stabilizing trends in your sustainability and energy transition business? And how are broader client budget and spending trends in the segment performing? Ewout Steenbergen -- Executive Vice President, Chief Financial Officer Generally, George, this is coming from multiple drivers within Market Intelligence, not only from sustainability and energy transition. So first of all, the core business is strong. We see healthy growth. We see a good sales momentum. We see that the ACV book is really growing a little bit faster than actually the revenue we are reporting, for example, in Desktop. And as you know, ACV is an early indicator of future revenues. So we're really, really pleased by that. Also, the revenue synergies are becoming more meaningful at this moment. So that really helps to contribute growth. The capital markets volumes are stabilizing. We don't see a lot of pickup of M&A yet. But last year, it was really a headwind, and that headwind is going away. And then, also the comps become more easy, for example, from an FX perspective. And then, you're right, sustainability and several other factors drive here the growth as well. So we are actually really positive about the outlook for Market Intelligence growth in the fourth quarter and implicitly what you're seeing in our guidance range is that we would expect further acceleration of the growth of the top line of Market Intelligence in the next quarter. Doug Peterson -- President and Chief Executive Officer Thanks, George. Operator Thank you. Our next question comes from Craig Huber with Huber Research Partners. Your line is open. Craig Huber -- Huber Research Partners -- Analyst Yes. Hi, there. Could you just update us, please, on where you're sitting at right now for the synergies for IHS, both the cost and the revenue synergy, what that run rate is now at year-end and where you aspire to be versus your original expectations? Ewout Steenbergen -- Executive Vice President, Chief Financial Officer If you think about the cost synergies, we have raised those twice over the last period, as you know. So the $600 million is the target that we're aiming for. We're almost done. We are effectively done. There are a few more projects that will be finalized at year-end. That is just purely timing of some of those projects, and then we will be able to declare that we hit the $600 million. And then, we won't talk about cost synergies anymore from that point onwards because cost synergies are also related to operational integration. And we are more or less running the company now as a fully combined company. We're not talking about one part versus the other part anymore. So it's good to close off cost synergies and really think about the company as one company going forward. That doesn't mean that we will stop with efficiency and productivity programs. Obviously, we have a track record to always look for new opportunities, and we will get back to you at that point in time with new updates. From a revenue synergy perspective, we actually like the progress that we have made during the third quarter. It's quite a big step to $112 million of run rate. We're getting now close to one third of the overall target. We have always said that is a five-year trajectory to get to $350 million, more a focus in the first part on cross-sell. Most of what you see now reported as revenue synergies is coming from cross-sell. But we have these new products that are being launched, and those new products will help with the next phase of revenue synergy delivery. So we feel we're right on track. We're really on the right path to deliver on the $350 million. So we feel very good about it. Doug Peterson -- President and Chief Executive Officer Thanks, Craig. Operator Thank you. Our next question comes from Seth Weber with Wells Fargo. Your line is open. Seth Weber -- Wells Fargo Securities -- Analyst Hi. Thanks. Good morning. I just wanted to ask about the reacceleration in the sustainability and energy transition business. Last quarter, you talked about some uncertainty with the regulatory landscape and political climate, etc. I mean, can you just frame -- the numbers seem to be back on track here. Has anything really changed? Or is it just more adoption of new products or customers just getting more used to the new normal? Or maybe just any perspective on that? Martina Cheung -- President, S&P Global Ratings Seth, it's Martina. I can take that question. Yes, very pleased with the Q3 results. We saw about 55% growth in Trucost and about 37% in CI. But the growth was actually across all divisions. So we saw inflows into the core climate and sustainability indices, for example, in S&P Dow Jones and really strong demand for the Mobility energy transition products, as well as the FPOs in Ratings. So really great progress and momentum across the board. Look, I think the key thing here and we've been saying this for quite some time, firstly, the long-term drivers and the needs in this business have not changed, notwithstanding some of the, call it, the minor slowdowns that we may have seen in the past year for various different reasons. Customers, corporations still need to look at operational risk in their supply chains. They still need to report against their net zero transition plans. If they're exposed in any way to Europe, they have to report against some pretty complicated regulations there, for example. We still have banks who are looking at finance emissions and looking to deploy capital into sustainability. And we have asset owners and asset managers who are obviously either looking for alpha or looking to allocate to the asset class. And so, fundamentals haven't changed. We believe we have the best, most comprehensive and deep offerings in this area across all of our businesses. Commodity Insights is a leader in energy transition analytics and advisory, for example. But one of the other things that I would say is -- and this is just what's so exciting to me around sustainability with the merger, we are launching products now bringing together some of the most unique and fantastic IP across the division. So the real asset data that we have launched brings together data from Mobility, Commodity Insights, Market Intelligence and Sustainable1. And it's going to be a real powerhouse in that area going forward as we see more and more needs for much more specific emissions transition, biodiversity and nature data at the real asset level. So that's just one example. Super excited going forward and very pleased with Q3. Thanks for the question. Doug Peterson -- President and Chief Executive Officer Thanks, Seth. Operator Thank you. Our next question comes from Owen Lau with Oppenheimer. Your line is open. Owen Lau -- Oppenheimer and Company -- Analyst Good morning and thank you for taking my question. Could you please add more color on the strength in private market and also iLEVEL? Where is the demand coming from? I mean, did you take shares from your competitor or your product can automate a process and replace in wholesale? Doug Peterson -- President and Chief Executive Officer Owen, this is Doug. Let me take that. Let me start by taking a step back and talking about what we're seeing is this really interesting and very rapid transformation of the private markets. If you go back 25, 30 years ago, private markets was just private equity. It was LBOs. It's private equity. But over the last 25 years and it's accelerating the last three or four is many, many different asset classes, many different strategies on the asset side. And on the investor side, you also see a whole diversification of the types of investors that have gone into private markets and private credit, which started obviously with pension funds and insurance companies, endowments and add to that now private wealth individuals even. So you see a completely different need for data and analytics across those areas. And as an example, this -- a lot of this is brand-new volume. It's not necessarily you're taking market share from anybody. You're finding new applications to bring to the market to provide the information both to the GPs and the LPs, but also to now even investors at a different level, the private market investors and individual investors. So we see that the kinds of tools that we're bringing, for instance, the iLEVEL software, which you mentioned, this provides a data service. It provides transparency to the market. It gives you more frequent information about the portfolio than you might see from what was coming directly from the GPs themselves. We also have products which we believe are going to be applied in the future from our DVA area, which includes information about pricing. It brings a whole new level of transparency and timeliness to being able to provide pricing and information about the portfolios. We know that investors, especially from some of those sophisticated institutional investors, they want to look across their portfolios and have mark-to-market, look at concentrations. They want to look at limits. They want to manage their portfolios in a way that they need much more granular data in the area. So we think this is going to be one of our most interesting highest growth areas. And so, you asked where it's coming from. It's new demand. It's new opportunities, and it's ways we can bring together multiple products in our portfolio to meet the needs and the solutions of both sides of the equation, the investors and the asset managers. Thanks for the question, Owen. Operator Thank you. Our next question comes from Russell Quelch with Redburn Atlantic. Your line is open. Russell Quelch -- Redburn -- Analyst Hi, guys. I wanted to focus on the Indices business, please. We've seen some interesting new product launches from you in the last quarter. And I'm wondering if you can give us some more detail on the pipe of new products in this area, mainly kind of what areas should we expect you to the focused growth? Are we thinking climate indices, derivatives, fixed income or where you've had some good product launches in the last quarter, but what more is there to come? I was also hoping you could explain how mix impacts revenue growth in this business, particularly in respect to asset class, please? Doug Peterson -- President and Chief Executive Officer Russell, let me start, and then I'll hand it over to Ewout to talk a little bit about the expenses and what we're seeing on the financial side. But right now, there's also a lot of changes going on in the asset management industry. I just talked about what's happening with the private market side. But at the same time, industries like traditional asset management, we see the shift from active to passive, and what that plays to is one of our strengths. And you asked about the type of products which are coming out. Our one set is related to sustainability. There's a whole type of new interest going on. And maybe a few years ago, that was more of ESG. Now, it's tending more toward climate and energy transition. We see it with, for instance, our own across divisional index, which is related to battery metals. We also see a lot of interest in the climate -- Paris Accord climate transition indices. So there's a whole set of indices that we've been launching, in particular for European investors and with European asset managers related to climate. We also see a set of indices which are across or multi-asset class industries, which allows us to take advantage of what we have from S&P Global from our Index business, traditional S&P 500 and other equity indices. You bring that along with the credit and fixed income indices that came with IHS Markit, that's a whole new asset class for us is to be able to provide a multi-asset class with the credit aspect to it, credit volatility. There's another set of products which are related to exchange-traded derivatives. They're not direct indices, but there's a lot more interest in risk management and hedging and trading strategies. And with our core foundation and our relationships with CBOE and CME, we're able to develop a whole new set of ETDs. And we've seen strong growth in that area as well. So across the board, it's climate. It's multi-asset class. It's factors. It's a whole set of different types of indices on the fixed income side. And then, it's also exchange-traded derivatives and new approaches to products, which we've already been developing there. But let me hand it over to Ewout to give a little bit more color on the numbers. Ewout Steenbergen -- Executive Vice President, Chief Financial Officer Russell, specifically your question about mix and mix shift, we are very pleased to see that the AUM fees are up again this quarter and that the AUM levels and the AUM fees are again correlated in the same direction. But a couple of more detailed comments I want to make there is first, as we have said many times, please keep in mind that if you look at AUM fees, there are also other categories going into the mix. It's not only ETFs. There's also mutual funds. There are insurance funds. There are OTC volumes, and all of them grew a little bit less than the average AUM levels of ETFs. So that is one part why you will see always a little bit of a discrepancy between AUM levels for ETFs and the fees. Secondly, the trends that we talked to you about last quarter of the mix shift is continuing. What we are seeing is that the market is a bit risk off that there is a move from more specialty ETFs to more flagship ETFs. Our flagship ETFs are taking in a lot of flows, very positive flows we had this quarter. But those funds are more lower level of basis point fees. We think this is a current market trend situation that will refer us again at some point in time when the market will be more risk on and there's more interest in the specialty ETFs. But this is a mix shift trend that we're still seeing continuing also in the third quarter. Doug Peterson -- President and Chief Executive Officer Thank you, Russell. Operator Thank you. Our next question comes from Shlomo Rosenbaum with Stifel Nicolaus. Your line is open. Adam Parrington -- Stifel Financial Corp. -- Analyst Hi. This is Adam Parrington on for Shlomo. September issuance trends were strong. Do you see that as a start of an improving trend or more indicative of companies rushing to get financing ahead of further rate increases, given the sharp rate movements we saw in September? Martina Cheung -- President, S&P Global Ratings Yes. Thanks for the question. Yes, look, September was higher than we expected for sure. And we do believe that some of that was essentially pulled forward from Q4. Having said that, I think there's a number of additional factors here that are important to think about Q4 and onwards. And some of those are some that I had referenced earlier. Do we, for example -- will we see some issuers actually pull forward from '24 in Q4 of this year, something we're tracking. And as I mentioned earlier, we're also looking at the amend and extend activity in the bank loan space, which was very strong in Q3, as well as some of the refinancing in bank loans as well. So a lot of factors. The sort of net new factor there, of course, as well is the geopolitical overhang that we have to continue to watch. So overall, we take a prudent look for Q4 and the usual factors that we watch going into next year, we have a handle on all of those as well. One other point that I would just add, and this is something that I think is important since it's a good indicator longer term is the flow of funds into fixed income funds. Q3, for example, into high yield and leveraged loan funds was a net positive. So that's a good thing, good indicator. Through the first half of the year, we saw the inflows back into fixed income funds overall against the huge net outflow from last year. So these are things that we have to continue to watch go into Q4 and into next year. Thanks for the question. Doug Peterson -- President and Chief Executive Officer Thanks, Adam. Operator Thank you. Our next question comes from Jeff Meuler with Baird. Your line is open. Jeff Meuler -- Robert W. Baird and Company -- Analyst Thank you. There was a comment about an improving relative position in CLOs. Martina, how much of that was just about retaining capacity through -- in headcount through a challenging market versus what else are you doing? And are there any kind of like IHS synergy benefits? And then, just quickly, Ewout, if you can address what drove the lower tax rate? And if there's any sort of like structural carryforward benefit from whatever is driving it beyond '23? Martina Cheung -- President, S&P Global Ratings Jeff, thanks so much for the question. Actually, we saw an improvement across a number of the sub-asset classes in structured finance overall. And we're just, frankly, very, very pleased. Certainly, a lot of this is related to additional investments in capacity. And what I have been saying and will continue to say it's not just about capacity. It's about the strength and the expertise and the talent. And that is really incredibly important in these asset classes. The overall asset class is also experiencing some growth in part driven by the private credit issuers. And we've made sure that we have been on the street talking to everybody we need to talk to, making sure that all of the issuers are aware of the talent and the capacity that we have and we continue to remain highly relevant in this space. I would say just very pleased with the execution from the team so far this year in this area. Thanks for the question. Ewout Steenbergen -- Executive Vice President, Chief Financial Officer And Jeff, to the second part of your question, our effective tax rate is lower in the quarter, primarily due to some new guidance came out during this quarter with respect to the way how to apply foreign tax credits would help impact our medium-term outlook with respect to the tax rate. Doug Peterson -- President and Chief Executive Officer Thanks, Jeff. Operator Thank you. We will now take our final question from Heather Balsky from Bank of America. You may ask your question. Heather Balsky -- Bank of America Merrill Lynch -- Analyst Hi. Good morning. Thanks for taking my question. I actually wanted to ask a question about the Commodity Insights business. And if you can just talk about the drivers that you expect to, I guess, help you maintain your current level of growth? And just help put in perspective how much commodity prices do or do not impact the growth in that business. Doug Peterson -- President and Chief Executive Officer Thanks, Heather. This is Doug. Well, first of all, when we look at this industry, it's being driven by incredible amount of transformation. We talked earlier in a different context about energy transition. And you take what are the traditional oil, gas commodity products, which we have a very strong position in both from price benchmarks, as well as news research and analytics. And we announced that we have just launched this Platts Connect, which is a platform where we take the two services from what had been Platts and would have been ENR from IHS Markit and put them together in a single platform. That means that we can continue to serve all of the traditional markets in a way with a very high-quality platform with -- it's easy to use, it's easy to search on. We'll be enhancing it with AI tools over time. And so, that's just the beginning of where we already see the traditional markets growing. And we're able to serve them better and faster in ways that are much more compelling all the time. And that into that that there's a mix of new commodities, new energy sources. There's areas like the metals, which are used for energy transition, that we already have a position in that we're getting stronger all the time. And then, you have the energy transition products related to things like carbon intensity, carbon markets, how we look at the transportation related to that, the infrastructure that's related to that. And then, on top of that, there's an incredible amount of synergies across all of S&P Global with S1, for example, with new data sets, which are being added to the Marketplace and Market Intelligence, new data sets, which can be added to Cap IQ Pro. So we look at this as a business that is in the right place at a time when the markets need transparency. They need comparability. They need high-quality data, and they need it delivered in a way that's easy for them to use. And they can build it into their workflow. So we're really, really very pleased with our progress, and this is a business that we're going to continue to invest in. So thank you very much, Heather. And let me just give a couple of closing remarks. I want to, first of all, thank everyone for joining the call today and your excellent questions, as always. I'm really proud, as you can hear, about the progress we've made with the merger with IHS Markit and all of the integration that's taking place. And now we're able to talk more and more about the revenue side and the product launches. And you saw them this quarter with Platts Connect and into the insights, and there's a lot more to come. And this is combining the best across both businesses to create the new S&P Global. I also want to thank Martina for providing her perspective today, and thank you for joining us. And as always, I want to thank our people for a great quarter. Their excitement and passion continue to inspire me personally and want to thank all of them for what they do. So again, thank you for joining the call today, and have a great day. Thank you very much. Operator That concludes this morning's call. A PDF version of the presenter slides is available for downloading from investor.spglobal.com. Replays of the entire call will be available in about two hours. The webcast with audio and slides will be maintained on S&P Global's website for one year. The audio-only telephone replay will be maintained for one month.[Operator signoff] Duration: 0 minutes Call participants: Mark Grant -- Senior Vice President, Investor Relations Doug Peterson -- President and Chief Executive Officer Ewout Steenbergen -- Executive Vice President, Chief Financial Officer Ashish Sabadra -- RBC Capital Markets -- Analyst Martina Cheung -- President, S&P Global Ratings Manav Patnaik -- Barclays -- Analyst Toni Kaplan -- Morgan Stanley -- Analyst Faiza Alwy -- Deutsche Bank -- Analyst Alex Kramm -- UBS -- Analyst Andrew Steinerman -- JPMorgan Chase and Company -- Analyst Jeff Silber -- BMO Capital Markets -- Analyst Scott Wurtzel -- Wolfe Research -- Analyst Andrew Nicholas -- William Blair and Company -- Analyst George Tong -- Goldman Sachs -- Analyst Craig Huber -- Huber Research Partners -- Analyst Seth Weber -- Wells Fargo Securities -- Analyst Owen Lau -- Oppenheimer and Company -- Analyst Russell Quelch -- Redburn -- Analyst Adam Parrington -- Stifel Financial Corp. -- Analyst Jeff Meuler -- Robert W. Baird and Company -- Analyst Heather Balsky -- Bank of America Merrill Lynch -- Analyst More SPGI analysis All earnings call transcripts","filter_flag":1}
