{"title":"Spatio-temporal divergence and influencing factors of agritourism integration development in Xinjiang, China ... - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00NjgwNi010gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00NjgwNi010gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00NjgwNi010gEA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00NjgwNi010gEA?oc=5\" target=\"_blank\">Spatio-temporal divergence and influencing factors of agritourism integration development in Xinjiang, China ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Spatio-temporal divergence and influencing factors of agritourism integration development in Xinjiang, China ... - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00NjgwNi010gEA?oc=5\" target=\"_blank\">Spatio-temporal divergence and influencing factors of agritourism integration development in Xinjiang, China ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Optimization\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Model construction To further explore which factors affect the degree of coupled coordination of agritourism integration in Xinjiang, we draw on existing research results and construct an econometric model. Considering the dynamic nature of coupling coordination, that is, the prior period coupling coordination affects that of the current period, a dynamic panel model is selected for empirical analysis: $${\\text{Y}}_{{{\\text{it}}}} = {\\upalpha }_{0} + {\\upalpha }_{1} {\\text{Y}}_{{{\\text{it}} - 1}} + {\\upalpha }_{2} {\\text{se}}_{{{\\text{it}}}} + {\\upalpha }_{3} {\\text{ca}}_{{{\\text{it}}}} + {\\upalpha }_{4} {\\text{gov}}_{{{\\text{it}}}} + {\\upalpha }_{5} {\\text{con}}_{{{\\text{it}}}} + {\\upalpha }_{6} {\\text{in}}_{{{\\text{it}}}} + {\\upalpha }_{7} {\\text{ma}}_{{{\\text{it}}}} + {\\upbeta }_{{\\text{i}}} + {\\upvarepsilon }_{{{\\text{it}}}}$$ (7) where i denotes each region (i = 1, 2, 3,…, 14) and t represents time (t = 2009, 2010, 2011,…, 2018). α is the coefficient matrix, \\({\\beta }_{i}\\) denotes the fixed effect coefficient. The \\({Y}_{it}\\) explanatory variable represents the degree of coupled coordination between agriculture and tourism in Xinjiang, and and the explanatory variables \\({se}_{it}\\),\\({ca}_{it}\\), \\({gov}_{it}\\), \\({con}_{it}\\), \\({in}_{it}\\), and \\({ma}_{it}\\) represent service capacity, human capital, government support, residents’ consumption level, industrial base, and market supply, respectively. The inclusion of one-period lagged terms of the explanatory variables in the above model produces biased and inconsistent fixed or random effects estimates for ordinary panels when conducting regressions. Therefore, we choose the generalized method of moments (GMM) estimation model to consider the combined effect of current and past on the coupling coordination degree, and avoid the problem of endogeneity as well as weak instrumental variables. Description of variables Given the availability of data and previous results, the one-period lagged Xinjiang agriculture-tourism coupling coordination (L.coor) is chosen as the explanatory variable, while the explanatory variables are set as service capacity (se), human capital (ca), government support (gov), residents’ consumption level (con), industrial base (in) and market supply (ma). Service capacity (se). Experience and participation are important factors in determining the success of integrated agri-tourism development. With the rapid development of technology, a convenient and smooth transportation and logistics environment are crucial to the satisfaction of tourists’ sense of experience. Service capacity, represented by transportation, warehousing, and postal services has a non-negligible impact on the degree of coordination of agri-tourism integration. We draw on previous research35 to measure the service capacity of a region regarding transport, storage, and postal services. Human capital (ca). Higher human capital can drive labor productivity and directly contribute to sustained economic growth. To push the integration of rural industries, the key lies in talents, and the cultivation of talents is the foundation for the integration and revitalization of rural industries36. Thus, we add human capital, an important factor affecting coupling coordination, as an explanatory variable. We adopt the number of students enrolled in ordinary higher education institutions (HEIs) as the proxy variable for human capital, mainly because such students are an important component of the labor market, and their number reflects the level of education in the region. Government support (gov). A good policy environment for the coordinated development of agri-tourism integration has a non-negligible safeguarding role. By giving policy preferences and incentives for agri-tourism integration projects and improving infrastructure at the grassroots level, the government’s financial support can be brought into play. Thus, we add policy support as an explanatory variable and integrate related studies37 to select general public budget expenditure as a proxy variable for policy support. Residents’ consumption level (con). Residents’ consumption level is a key factor affecting the development of agri-tourism integration. In general, as residents’ discretionary income rises, so does the demand for service-oriented levels of travel and other services. Simultaneously, the main service objects of agricultural-tourism integration are the residents who live in the hustle and bustle of the city for a long time, Therefore, as a representative of residents’ consumption level, the changes in urban residents’ income will inevitably have a considerable impact on the integration of agriculture and tourism. We refer to Yang et al. who adopt urban residents’ disposable income as a representative indicator to characterize residents’ consumption level38. Industrial base (in). Industrial base capability determines the overall quality, comprehensive strength, and core competitiveness of industries in a country and region39. We use the value-added of the tertiary sector to measure the industrial base, or whether the development of the tertiary sector can influence the degree of agri-tourism integration and coordination. Market supply (ma). Market supply refers to the total quantity of a good or service available to consumers within a given market at a given time. In the tourism economy, the supply situation of the market affects the operation and development of the entire tourism market40. Therefore, we select the amount of fixed asset investment as a proxy variable for market supply. All variables are summarized in Table 4. Table 4 Variables and their interpretation. Full size table Regression results We use an econometric model to test the coupling coordination degree of agriculture and tourism and the interrelationships of service capacity, human capital, government support, residents’ consumption level, industrial base, and market supply in various cities and towns in Xinjiang from 2009 to 2018, and use the econometric software Stata14 to carry out the regression (see Table 5). Table 5 Results of differential GMM estimation. Full size table To obtain robust test results, we gradually add six explanatory variables ((se), (ca), (gov), (con), (in), (ma)) to gradually test the influence of each factor on the degree of coupling coordination, and conduct the overall effect test. From Table 5, the impact coefficient of service capacity on the degree of coupling coordination is significantly negative, indicating that the lagging development of Xinjiang’s transportation, storage, and postal industries constrains the improvement of coupling coordination. The possible reason for this is that although the transportation, storage and postal industry in Xinjiang is growing rapidly, the growth in output value lags behind the tertiary industry, which does not have a significant effect on the promotion of the tourism industry, and also weakens the impact on agritourism integration, displaying a negative correlation. The coefficient of the effect of human capital on the degree of coupling coordination is significantly positive, which indicates that human capital has a strong positive contribution to the improvement of such degree. HE influences the economy through mediating variables such as science, technology, talent, and skills, and also contributes to agritourism integration in other ways such as consumption contribution and support for entrepreneurship. In other words, with the increase in the number of students enrolled in colleges and universities, the level of agricultural-tourism coupling coordination will continue to rise. The effect of government support on coupling coordination is negative and insignificant. For Xinjiang, which is located in the western region, with limited financial resources, the government prefers to spend funds on areas with quick results and high returns. It is a relatively slow and continuous process for rural areas to rely on agricultural resources to develop tourism and to adjust and optimize the rural industrial structure; thus, despite the improvement of the fiscal expenditure inhibiting the development of agricultural-tourism integration, a negative impact remains. Residents' consumption level is tested for significance at the 10% level, and this statistic indicates that urban residents' disposable income has a positive effect on the coupling and coordination of agriculture and tourism in Xinjiang.In fact, only when the disposable income of individuals increases, can it lead to consumption and the pursuit of higher-level demand. Alternatively, boosting disposable income to achieve high levels of demand will undoubtedly lead to the embedding of agriculture in tourism initiatives, which will in turn promote a high level of agritourism integration. The influence coefficient of industrial base on the coupling coordination degree is significantly negative, indicating that the value-added of tertiary industry does not contribute significantly to the coupling coordination degree. Although the growth rate of the tertiary industry has been increasing, the development gap between regions and states is large, which restricts the development of the overall tertiary industry, thus inhibiting the influence of the industrial base on the coupled and coordinated development of agricultural and tourism integration. In other words, whether it is necessary to coordinate the ratio of primary, secondary, and tertiary industries in each state should be considered when formulating regional economic strategies. Market supply is negatively correlated with coupling coordination degree. This is because the current fixed asset investment in Xinjiang is still in capital-intensive industries, infrastructure construction and other fields that have obvious driving effects on GDP. Moreover, the development of the service industry will not significantly enhance its efficiency, but will have a squeezing effect, which also leads to a negative performance of the effect of market supply on the degree of coupling coordination.","filter_flag":1}
