{"title":"10 Energy-Efficient Products for a More Sustainable Home - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tLzEwLWVuZXJneS1lZmZpY2llbnQtcHJvZHVjdHMtbW9yZS1zdXN0YWluYWJsZS1ob21l0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tLzEwLWVuZXJneS1lZmZpY2llbnQtcHJvZHVjdHMtbW9yZS1zdXN0YWluYWJsZS1ob21l0gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tLzEwLWVuZXJneS1lZmZpY2llbnQtcHJvZHVjdHMtbW9yZS1zdXN0YWluYWJsZS1ob21l0gEA","guidislink":false,"published":"Thu, 21 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tLzEwLWVuZXJneS1lZmZpY2llbnQtcHJvZHVjdHMtbW9yZS1zdXN0YWluYWJsZS1ob21l0gEA?oc=5\" target=\"_blank\">10 Energy-Efficient Products for a More Sustainable Home<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"10 Energy-Efficient Products for a More Sustainable Home - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tLzEwLWVuZXJneS1lZmZpY2llbnQtcHJvZHVjdHMtbW9yZS1zdXN0YWluYWJsZS1ob21l0gEA?oc=5\" target=\"_blank\">10 Energy-Efficient Products for a More Sustainable Home<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Not only can energy-efficient home products save homeowners extra cash each month by lowering utility bills, but according to a 2022 report from the American Council for an Energy-Efficient Economy, they can also improve a home's resale value. As energy efficiency becomes a higher priority among today's homeowners, the U.S. Department of Energy’s Home Energy Score (HES), which assesses the energy efficiency of a home based on its structure and heating, cooling, and hot-water systems, has a greater influence on home sale prices across the country. When combined, the following products won't just boost a home's overall energy efficiency, they can also provide long-term cost savings for homeowners. RELATED High-Performance Insulated Glass From Alside ClimaTech PriME by Alside high-performance insulated glass packages meet Energy Star’s Most Efficient criteria for all four U.S. climate zones, enabling homeowners to lower their utility bills while potentially qualifying for valuable tax credits. Alside’s newest insulated glass packages are now offered on Mezzo and Fairfield 80 Series windows, the company says. Leviton Whole-Home Energy Monitor The Whole Home Energy Monitor and 2nd Gen Smart Circuit Breakers with Remote Control from Leviton deliver a streamlined smart home and energy management experience by unifying control, scheduling, and personalization of Leviton Smart Circuit Breakers, Decora Smart Wi-Fi Lighting, and Evr-Green Electric Vehicle Chargers in a single interface. The Whole Home Energy Monitor allows homeowners to control 2nd Gen Smart Circuit Breakers, schedule breaker activity to reduce energy rate periods, and automate the shedding of nonessential loads remotely via the My Leviton app. Atlas Roofing Insulated Weather Resistive Barrier for Walls Atlas Roofing’s EnergyShield Continuous Wall Insulation provides energy savings paired with a weather-resistive barrier (WRB). EnergyShield is made with polyisocyanurate insulation, which meets International Building Code requirements as an approved WRB in the place of No. 15 asphalt felt. By providing an uninterrupted thermal barrier over an entire wall, EnergyShield is effective for thermal, air, moisture, and vapor control. Smart Home Integration From Airzone Control HVAC provider Airzone Control recently announced new API (application programming interface) integration with Crestron that allows Crestron Home OS and Airzone-controlled devices to connect without the need for custom programming, additional wiring, or a WAN connection. The combined systems give homeowners the ability to configure HVAC control for an entire home, discrete zones, or individual rooms to closely manage energy output. RELATED: Durable and Efficient HVAC Products Somfy Wireless Solar Panel Somfy’s wireless Li-ion Solar Panel is a new charging solution compatible with the manufacturer’s range of WireFree motors, making it easier and more energy efficient to automate interior shading solutions, the company says. The Li-ion Solar Panel uses a long-lasting lithium-ion battery for enhanced performance and energy savings. HIgh-Efficiency Condensing Water Heater by Rheem The high-efficiency water heaters in Rheem’s RTGH Condensing Series feature a high turn-down ratio (TDR) to achieve tighter control over temperature output, even during lower demand. The units also include a quick-hang bracket system, making one-person installation easier. The RTGH Series includes a digital display for diagnostic information, as well as built-in EcoNet Wi-Fi for real-time service alerts and remote control via Rheem’s mobile app. Though smaller and lighter than previous models, this series uses up to 34% less energy than a standard residential 50-gallon tank water heater, according to Rheem. Eaton Smart Home App Brightlayer Home, a new mobile platform from Eaton, is designed to help homeowners install, monitor, and manage infrastructure networks remotely. The app provides power management capabilities across smart breakers, Wi-Fi smart devices, and EV charging to help homeowners reduce their home energy costs. Users can easily view power use for connected appliances and can control connected devices from anywhere. Setup is simplified with a step-by-step guide in the Brightlayer Home app. Whole-House Fans by Solatube Engineered Performance Series (EPS) Whole House Fans from Solatube bring in fresh air and can reduce interior temperatures by up to 30 degrees while offering quiet performance using the company’s HushMount 2 technology. The Comfort Control Remote offers seven variable-speed options, and Soft Start technology helps save electricity and extend motor life by mitigating the energy surge typical of conventional fans. An R6 damper door prevents air leaks and helps maintain energy efficiency. Heat Pump Water Heater From LG LG’s Inverter Heat Pump Water Heater uses an inverter compressor for quiet operation (42 dBA) and features the company’s Turbo Mode heating technology, which can provide up to 20% more hot water. The water heater’s dual inverter compressor achieves a uniform energy factor (UEF) of 3.75, which is higher than current Energy Star certification requirements (UEF 3.3), according to the company. The unit is compatible with the LG ThinQ app for remote monitoring and control. Uponor Radiant Heat Panels for Floors Xpress Trak Radiant Heat Panels from Uponor can be installed under most floor coverings, with no insulation needed, the company says. The single-panel system has lightweight XPS foam at its core, with laminated aluminum around the entire surface for exceptional heat-transfer capability. Panels have a compressive strength of 49 psi to eliminate floor deflection, and an R-value of 3.13 that allows energy use to heat the space rather than charging and storing energy in the panel.","filter_flag":1}
{"title":"Sulzer to offer exclusive preview of new products at WEFTEC 2023 - Water Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy53YXRlcnRlY2hvbmxpbmUuY29tL2luZHVzdHJ5L2FydGljbGUvMTQyOTkxODgvc3VsemVyLXN1bHplci10by1vZmZlci1leGNsdXNpdmUtcHJldmlldy1vZi1uZXctcHJvZHVjdHMtYXQtd2VmdGVjLTIwMjPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy53YXRlcnRlY2hvbmxpbmUuY29tL2luZHVzdHJ5L2FydGljbGUvMTQyOTkxODgvc3VsemVyLXN1bHplci10by1vZmZlci1leGNsdXNpdmUtcHJldmlldy1vZi1uZXctcHJvZHVjdHMtYXQtd2VmdGVjLTIwMjPSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy53YXRlcnRlY2hvbmxpbmUuY29tL2luZHVzdHJ5L2FydGljbGUvMTQyOTkxODgvc3VsemVyLXN1bHplci10by1vZmZlci1leGNsdXNpdmUtcHJldmlldy1vZi1uZXctcHJvZHVjdHMtYXQtd2VmdGVjLTIwMjPSAQA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy53YXRlcnRlY2hvbmxpbmUuY29tL2luZHVzdHJ5L2FydGljbGUvMTQyOTkxODgvc3VsemVyLXN1bHplci10by1vZmZlci1leGNsdXNpdmUtcHJldmlldy1vZi1uZXctcHJvZHVjdHMtYXQtd2VmdGVjLTIwMjPSAQA?oc=5\" target=\"_blank\">Sulzer to offer exclusive preview of new products at WEFTEC 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Water Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sulzer to offer exclusive preview of new products at WEFTEC 2023 - Water Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy53YXRlcnRlY2hvbmxpbmUuY29tL2luZHVzdHJ5L2FydGljbGUvMTQyOTkxODgvc3VsemVyLXN1bHplci10by1vZmZlci1leGNsdXNpdmUtcHJldmlldy1vZi1uZXctcHJvZHVjdHMtYXQtd2VmdGVjLTIwMjPSAQA?oc=5\" target=\"_blank\">Sulzer to offer exclusive preview of new products at WEFTEC 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Water Technology<\/font>","source.href":"https:\/\/www.watertechonline.com","source.title":"Water Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"This year’s WEFTEC technical exhibition and conference will see Sulzer presenting several innovations in pumping, equipment control, filtration and aeration technology for the water and wastewater sectors. Exhibiting at booth 3625 in the South Hall of McCormick Place in Chicago, Sulzer’s water experts will be available from Oct. 2-4 to discuss new advancements in energy efficiency, reliability and sustainability. The WEFTEC conference draws professionals from around the world, showcasing the latest developments for clean and wastewater applications. Sulzer has a comprehensive range of products that can improve process performance, reliability and efficiency, cutting energy usage and driving sustainability. At the event, Sulzer will highlight its exceptionally efficient XFP submersible pumps for wastewater pumping stations, as well as exclusively previewing new technologies specifically for the industry. Build America, Buy American (BABA) requirements are expected to be a prominent talking-point at the conference. Here Sulzer will showcase its broad range of BABA compliant solutions, demonstrating its commitment to the US market. Presenting its innovations for aeration applications, Sulzer will have a live demonstration of the magnetic bearings used in the HST™ turbo blower. These offer excellent durability and efficiency, reducing running costs and minimizing downtime for operators. Visitors will also have the opportunity to see the reliable and versatile vertical pumps from Johnston Pump, a Sulzer brand, and appreciate the benefits these assets bring to water transport applications. While on the Sulzer booth, take the chance to talk with filtration and screening experts from Nordic Water, a Sulzer brand. The brand will be showcasing the new SuperCloth disc filter, which delivers exceptional performance in floc removal and the reduction of phosphorous content in water. The company’s wide range of innovative and energy efficient filtration solutions for removing particles from water include perforated screens, sand filters and fiber disc filters. Combined with its tertiary treatment systems, Nordic Water provides proven technologies for water purification. Opposite the Sulzer stand will be JWC Environmental, another Sulzer brand, which will be exhibiting several products from its range of grinders, drum filters and other headworks assets. Delivering real solutions for real industry problems, JWC will highlight solids reduction, separation and removal systems on Booth 3631.","filter_flag":1}
{"title":"Seven sustainability advances for business efficiency | ABB - ABB","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA3MjQ4L3NldmVuLXN1c3RhaW5hYmlsaXR5LWFkdmFuY2VzLWZvci1idXNpbmVzcy1lZmZpY2llbmN50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA3MjQ4L3NldmVuLXN1c3RhaW5hYmlsaXR5LWFkdmFuY2VzLWZvci1idXNpbmVzcy1lZmZpY2llbmN50gEA?oc=5","id":"CBMiXGh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA3MjQ4L3NldmVuLXN1c3RhaW5hYmlsaXR5LWFkdmFuY2VzLWZvci1idXNpbmVzcy1lZmZpY2llbmN50gEA","guidislink":false,"published":"Fri, 15 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=258, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA3MjQ4L3NldmVuLXN1c3RhaW5hYmlsaXR5LWFkdmFuY2VzLWZvci1idXNpbmVzcy1lZmZpY2llbmN50gEA?oc=5\" target=\"_blank\">Seven sustainability advances for business efficiency | ABB<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABB<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Seven sustainability advances for business efficiency | ABB - ABB","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTA3MjQ4L3NldmVuLXN1c3RhaW5hYmlsaXR5LWFkdmFuY2VzLWZvci1idXNpbmVzcy1lZmZpY2llbmN50gEA?oc=5\" target=\"_blank\">Seven sustainability advances for business efficiency | ABB<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABB<\/font>","source.href":"https:\/\/new.abb.com","source.title":"ABB","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"By Ian Richardson, Building Solutions Technical Specialist within ABB Australia's Electrification business. With buildings forming the majority of an urban environment’s contribution to greenhouse gas emissions, a prime contribution that ABB is making is in the field of smart building technology enabling leading building efficiency. Our team often remarks at the progress made in even the last five years. We’ve moved from simple integrations, such as people managing thermostats, doorbells or lights from their mobile phones, to buildings that adapt to user needs through artificial intelligence. Our global ABB business continues to be a digital pioneer, having launched more than a thousand new products during these last five years alone. Every day, we bring to life a range of sustainability contributions through smarter buildings that are helping businesses reshape their operations to drive greater energy efficiency. Here are seven core examples of this in action. Prioritising a network approach We take a holistic approach to smart buildings in everything we do, and that means going beyond the direct building experience to consider the wider ecosystem, or network. For example, we’re looking at solutions for energy storage so that solar power can be used to improve load management and compensate the demand for powering electric vehicles. Our view is that environmental improvements such as electric vehicles, over internal combustion engine vehicles, can contribute to better energy management when considered as part of a whole, bi-directional system Delivering integrated systems Key wins of smart building technology include leveraging automation that ensures energy is applied only where it is needed, cross-sharing data so that energy can be shared across multiple parts of a whole system, and using artificial intelligence so that buildings can learn and adapt to user needs. Smart technology is also making it possible to automate aspects of managing energy consumption and its costs, with the ability to reduce costs by up to 50%. Driving standardisation and interoperability ABB was proudly the driver for KNX standardisation in Australia as just one of many manufacturers to benefit. Standardisation and interoperability are vital to any company’s ability to truly deliver on the promise of smart building technology because they are the bedrock of multi-function and multi-device integration. We actively promote greater interoperability between providers, manufacturers and ourselves. As users increase, so will technologies capable of delivering enhanced user experiences. However, they must be based on a shared language across the industry if they are to improve efficiency…efficiently. Positioning businesses for smart monitoring We are excited to see the results achieved by our latest range of digital energy and asset management solutions for commercial and industrial buildings. They have helped organisation’s achieve energy and operating cost savings of up to 30% by avoiding downtime, improving predictions of electrical installation issues and scheduling proactive maintenance interventions. The foundation of these is monitoring solutions that are helping building managers understand energy use, drive greater energy efficiency, and even achieve time, cost and quality savings and improvements through areas such as predictive maintenance – with the flexibility of remote management. These solutions are available today and include those that suit small to medium-sized businesses as much as major corporations. They create systems where electrical installers, building owners, and facilities and energy managers can collect, collate and visualise data for one building or multiple buildings to improve decisions and actions. Importantly, we have designed products such as energy meters, network analysers, circuit breakers and more so that customers can scale functionality up or down to suit their needs. Enabling improvements for existing buildings A centrepiece of our smart building approach has been to accommodate opportunities for existing buildings where possible. We will simply not achieve the gains we need globally if only new buildings benefit. Fortunately, in response, we are seeing a growing demand in the retrofit arena for more intelligent building solutions. We are successfully helping clients revamp and digitise buildings without the need to replace components, including the use of our plug-and-play modules and wireless solutions. Even if a building can only adopt a few integrated components, energy efficiency improvements can be found. Supporting affordability and simplicity While there are truly ground-breaking possibilities at the premium end of smart building technology, simple, affordable and intuitive solutions are vital. We are committed to growing our portfolio of these technologies to expand the number of building owners and managers benefiting from improved efficiency. Our ABB-free@home® solution is a perfect example, offering home owners smart building technology at an accessible entry price. Empowering industry education Our team is critically aware of the need to support shifts in workforce skills. For example, installers can play a major role in advocating for sophisticated technology when they understand how easy it can be to install and leverage. We’re actively upgrading our training to better educate installers on the essentials of smart home and building technology. This includes our network of specialist engineers globally who run on-the-ground classroom training, supported by new online training tools, like our new online training course on energy management. We also recently launched our Connect Partner Hub so that professionals can share best practice and keep the smart building technology conversation going. Bringing these together, the ABB ‘toolbox’ of solutions, whether they relate to power, safety, e-mobility, smart buildings or more, is designed to leverage these sustainability advances so that businesses can gain greater outcomes environmentally, socially and economically. In smart buildings alone, innovation is a major priority and we are taking a long-term position. We want to help clients and end users realise safer, smarter and more sustainable buildings, businesses and lifestyles.","filter_flag":1}
{"title":"Exergyn sets new boundaries in solid-state refrigerant technology - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZXhlcmd5bi1zZXRzLW5ldy1ib3VuZGFyaWVzLWluLXNvbGlkLXN0YXRlLXJlZnJpZ2VyYW50LXRlY2hub2xvZ3ktMzAxOTIyMDIxLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZXhlcmd5bi1zZXRzLW5ldy1ib3VuZGFyaWVzLWluLXNvbGlkLXN0YXRlLXJlZnJpZ2VyYW50LXRlY2hub2xvZ3ktMzAxOTIyMDIxLmh0bWzSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZXhlcmd5bi1zZXRzLW5ldy1ib3VuZGFyaWVzLWluLXNvbGlkLXN0YXRlLXJlZnJpZ2VyYW50LXRlY2hub2xvZ3ktMzAxOTIyMDIxLmh0bWzSAQA","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZXhlcmd5bi1zZXRzLW5ldy1ib3VuZGFyaWVzLWluLXNvbGlkLXN0YXRlLXJlZnJpZ2VyYW50LXRlY2hub2xvZ3ktMzAxOTIyMDIxLmh0bWzSAQA?oc=5\" target=\"_blank\">Exergyn sets new boundaries in solid-state refrigerant technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Exergyn sets new boundaries in solid-state refrigerant technology - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZXhlcmd5bi1zZXRzLW5ldy1ib3VuZGFyaWVzLWluLXNvbGlkLXN0YXRlLXJlZnJpZ2VyYW50LXRlY2hub2xvZ3ktMzAxOTIyMDIxLmh0bWzSAQA?oc=5\" target=\"_blank\">Exergyn sets new boundaries in solid-state refrigerant technology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Supported by Mercuria and Lacerta, the Company is Pioneering Solid-State Cooling with Shape Memory Alloys DUBLIN, Sept. 8, 2023 \/PRNewswire\/ -- With global surface temperatures soaring past highs not seen for millennia, the need for climate-friendly cooling has never been greater. Increasingly frequent events directly linked to climate change are drawing attention to the damaging effects of traditional refrigerant gases in heating, cooling, air conditioning, and refrigeration products. Exergyn, a leading technology firm, is on track to mitigate these issues by deploying its unique solid-state cooling technology based on shape memory alloys (SMAs). Exergyn solid-state refrigerant technology Backed by Mercuria, one of the world's largest integrated energy and commodities groups, and Lacerta, a fund investing in companies dedicated to solving key issues related to the transition, Exergyn's SMA solid state cores are zero Global Warming Potential (GWP), non-toxic, non-flammable, cannot leak, and open up new possibilities for leaps forward in energy efficiency and clean cooling. A sustainable product for a circular economy, the cores are so durable they can outlast the equipment in which they are used and be reused in new equipment. \"We are now producing SMA material with performance factors beyond anything that has been achieved before in the SMA domain,\" said Exergyn co-founder and CEO Dr. Kevin O'Toole. A typical coefficient of performance (COP) for shape memory alloys, which measures useful heat output relative to mechanical work input, usually falls within the high single digits in steady state operation. However, Exergyn has created a material with an impressive COP of 20-25 (with the potential to exceed 30 in specific conditions), all while maintaining material stability across a temperature range as high as 60°C for a single blend. This major advancement brings Exergyn one big step closer in bringing SMA as a viable alternative to replace hydrofluorocarbon (HFC} refrigerants, which are amongst the world's most potent greenhouse gases, thousands of times more powerful in warming the planet than carbon dioxide. Exergyn's latest prototypes are undergoing testing in the lab as its team continues to iterate next-generation advances, seeking to shrink its footprint further and open additional markets for exploration, encompassing many heating, ventilation, air conditioning, and refrigeration (HVACR) product categories and other industrial sectors that would benefit from solid-state cooling technologies. \"As such, we are gaining significant interest from end users and manufacturers across a wide range of markets, both where traditional heating and cooling technologies will be rendered obsolete, but also in entirely new domains,\" O'Toole said. CLIMATE-FRIENDLY COOLING Air conditioning and refrigeration underpin modern life – sheltering homes and businesses from the summer heat and preventing food and medicines from spoiling in the sun. A generation ago, air conditioning and refrigeration manufacturers invested in innovation to replace the chlorofluorocarbon (CFC) refrigerants destroying the stratospheric ozone layer that shields the earth from harmful ultraviolet radiation. Now the ozone layer is on a path to recovery, and air conditioning and refrigeration manufacturers are investing yet again in innovation – this time to replace hydrofluorocarbon (HFC) refrigerants. REFRIGERANT REGULATION The Kigali Amendment to the Montreal Protocol, adopted in 2016, kickstarted the race to replace HFCs by requiring increasingly stringent domestic laws and regulations around the world to restrict both the upstream supply and downstream use of HFCs with high Global Warming Potentials (GWPs). Replacing HFCs can avoid up to 0.5 C of projected warming by 2100, according to a 2009 study in the Proceedings of the National Academies of Sciences. By 2025, most HFCs will be prohibited in new air conditioners and refrigerators in Europe, the United States, and other developed markets. By 2030, the supply of new HFCs will be a fraction of what it is today. By the mid-2030s, high GWP HFCs will all be gone from developed countries, with developing countries following soon after. But many of today's substitute refrigerants, although lower in GWP, are toxic and flammable and, as such, raise serious health and safety risks. They also leak from equipment and must be recovered at end-of-life, imposing costly maintenance burdens on home and business owners. And they create technical barriers for manufacturers seeking to improve the energy efficiency of their equipment, which saves customers money and protects the climate by reducing energy use. \"Exergyn's solid state refrigerant technology is the kind of breakthrough the Kigali Amendment was intended to create,\" O'Toole said. \"We can help mitigate the causes of climate change by replacing HFCs and many less-than-ideal substitutes, and we can help protect people from the ravages of a rapidly warming world.\" TECHNOLOGY TRANSITIONS Exergyn's technology is outside the scope of the fast-growing web of laws and regulations facing manufacturers rushing to provide climate-friendly cooling solutions for a rapidly warming world. As more and more governments clamp down on HFC production and use and as existing substitutes prove unwieldy and risk-provoking further regulation on health and safety grounds, Exergyn is ready to represent the future of air conditioning and refrigeration. \"We were pleased to host a delegation of senior government officials and leading climate scientists from the Climate and Clean Air Coalition (CCAC) in March 2023 at our facility in Dublin to show them what saving the climate looks like up close,\" O'Toole said. \"We're now headed to the Montreal Protocol meetings in October in Nairobi, Kenya, to respond to the growing interest among regulators and technical experts in how Exergyn's solid-state refrigerant technology can accelerate the implementation of the Kigali Amendment and the global transition from HFCs it is driving.\" About Exergyn Exergyn has built a team of 45 engineers, researchers, and commercial analysts in three countries and remains the only significant commercial entity dedicated to elastocalorics. With niche expertise and an expansive patent and know-how portfolio, Exergyn is uniquely positioned to lead the development and commercialization of next generation heating and cooling products. About Mercuria Energy Group Established in 2004, Mercuria is one of the world's most significant independent energy and commodity groups, revolutionizing the commodity value chain through technology, expertise, and low-carbon solutions. The company has firmly positioned itself as a leader in the energy transition, with over 50 percent of its new investments directed towards renewables and transitional energy. Mercuria has made substantial contributions to projects such as renewable power, energy storage, grid optimization, critical transition minerals recycling, and environmental products, showcasing its dedication to a sustainable future. About Lacerta Founded in 2018, Lacerta Partners invests in both public and private markets, with a focus on identifying companies and technologies that have the potential to disrupt and revolutionize existing industries, processes and supply chains. The Fund has deployed considerable capital into companies that are solving key issues related to the transition to a more sustainable future, from improving copper recovery from waste material to manufacturing high performance materials and plastics from natural sources. It strives to work closely with management teams to drive value for all stakeholders. SOURCE Mercuria Energy","filter_flag":1}
{"title":"Editors' choice: Top 6 products at Husker Harvest Days - Farm Progress","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vaHVza2VyLWhhcnZlc3QtZGF5cy9lZGl0b3JzLWNob2ljZS10b3AtNi1wcm9kdWN0cy1hdC1odXNrZXItaGFydmVzdC1kYXlzLdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vaHVza2VyLWhhcnZlc3QtZGF5cy9lZGl0b3JzLWNob2ljZS10b3AtNi1wcm9kdWN0cy1hdC1odXNrZXItaGFydmVzdC1kYXlzLdIBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vaHVza2VyLWhhcnZlc3QtZGF5cy9lZGl0b3JzLWNob2ljZS10b3AtNi1wcm9kdWN0cy1hdC1odXNrZXItaGFydmVzdC1kYXlzLdIBAA","guidislink":false,"published":"Tue, 19 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=262, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vaHVza2VyLWhhcnZlc3QtZGF5cy9lZGl0b3JzLWNob2ljZS10b3AtNi1wcm9kdWN0cy1hdC1odXNrZXItaGFydmVzdC1kYXlzLdIBAA?oc=5\" target=\"_blank\">Editors' choice: Top 6 products at Husker Harvest Days<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Farm Progress<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Editors' choice: Top 6 products at Husker Harvest Days - Farm Progress","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vaHVza2VyLWhhcnZlc3QtZGF5cy9lZGl0b3JzLWNob2ljZS10b3AtNi1wcm9kdWN0cy1hdC1odXNrZXItaGFydmVzdC1kYXlzLdIBAA?oc=5\" target=\"_blank\">Editors' choice: Top 6 products at Husker Harvest Days<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Farm Progress<\/font>","source.href":"https:\/\/www.farmprogress.com","source.title":"Farm Progress","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Husker Harvest Days may be over, but the new products and technology at the show will be shaping the agriculture industry for years to come. This year, five Farm Progress editors scoured the show site looking for the best innovation: Nebraska Farmer editor Curt Arens and staff writer Elizabeth Hodges, Dakota Farmer editor Sarah McNaughton, Kansas Farmer editor Jennifer Latzke and Missouri Ruralist editor Mindy Ward. They also receive a little help from retired Nebraska Farmer editor Don McCabe. This group spent time visiting with more than 500 exhibitors about their latest offerings for farmers and ranchers. Related: Hear directly from the editors about these products. Over the next year, you will see each new product they collected featured online and in the pages of Farm Progress publications. The Husker Harvest Days New Products crew wanted to share with you a few of their favorite items from this year’s show: BATTERY BOOST: Homeland Surveillance and Electronics brought out a drone with a unique hydrocooling battery system, which allows for shorter downtime in the field. (Photos by Mindy Ward) Drone defies the odds Hodges’ favorite was a bit of an oxymoron at the show. We have been told our whole lives to never mix water and electronics, but at Homeland Surveillance and Electronics, they defy this simple principle with their hydrocooling battery system. Overheating batteries is a challenge in the drone industry because of the demand for quick charge times. But with this system, the batteries can cool and recharge in time for the next battery to be swapped out. But there are even more impressive features from the XAG P100 PRO drone. From refilling the sprayer basin to swapping out batteries, there is a 90-second time lapse. This 13.2-gallon capacity drone flies at an impressive 30 mph. With this high-speed ability, this drone is the largest capacity drone on the market, allowing it to cover more than 70 acres per hour. This HSE drone is taking precision agriculture to the next level and is showing a glimpse of the future of the role of drones in agriculture. For more, visit hse-uav.com. IRRIGATION INGENUITY: Sensys+ from Eco-Drip Irrigation is for those with drip irrigation wanting an economical solution to monitoring. Affordable irrigation telemetry Arens was drawn to irrigation tech at this year’s show, and boy, did he find a number of new products. He says if you are into drip irrigation and looking for a compact, affordable monitoring system with some limited control options, the multipurpose Sensys+ from Eco-Drip Irrigation is the perfect solution for you. With a rich instruction set, Sensys+ can measure most hydrological, meteorological, industrial and environmental sensors, concentrating on data. It makes that data, which is logged over a period, available over varied networks. Sensys+ performs automated on-site or remote decision-making, and parameters for pressure and other crucial measurements for drip irrigators can be set so you get alerts on your mobile device when something needs your attention. The system is set up easily with PC software and USB connectivity, and it offers an affordable way to monitor your system. The cost of these units can vary according to system requirements. To learn more, contact Eco-Drip Irrigation at 806-853-9500 or visit eco-drip.com. CHAINLESS BALER: Both in the Husker Harvest Days hay demonstrations and on the showgrounds, farmers huddled around the Hustler Equipment Chainless LX105 bale processor. Make round bale feeding easy McNaughton is quite frankly tired of opening the gates to place hay bales. So, when she stumbled on the Hustler Equipment Chainless LX105 bale processor, she knew it was a top pick at the show. This bale processor offers versatility and durability. With the ability to be mounted on a skid steer, front loader or 3-point hitch, you can feed bales into small pens or over gates with ease. That means no more getting in and out to open gates! The chainless system minimizes the wear and tear on the machine, making for long-lasting use. Contact your local Hustler Equipment dealer, check out their website at hustlerequipment.com or call 507-208-5404 for pricing information. FIRE PREVENTION TECH: Farmers don’t often realize their baler bearings are running hot, but they can. TempSense from Vermeer is an in-cab tool that monitors 19 pinch points on a baler for overheating. Stop bale fires before they start A round baler fire not only affects your equipment, but also potentially your crop. But what if you could prevent one? Ward found an early-warning system from the folks at Vermeer. TempSense allows farmers to view bearing temperatures, which often increase because of contamination in a bearing, from the comfort of the cab, on the go. Sensors placed on the baler communicate via Bluetooth to the hub, which then sends a signal back to the system in the cab. A touch-screen display allows you to toggle from the main screen complete with baler information, to the detailed outline of the baler itself. Temperature is monitored at 19 points on the baler. Using a color-coded system, the second screen displays alert levels at each point. Blue means the baler is cool and has no problems. A yellow indicator light means you should inspect when they come to a stop, while a red light means there is a need for immediate attention, and you should shut down the machine. TempSense is only available on the ZR5-12000 self-propelled baler, but Vermeer representatives say it is technology that may be headed to other balers in the future. For more on TempSense visit vermeer.com or call the company at 800-370-3659. NEW ROUND NOZZLE: It doesn’t look like any other irrigation nozzle on the market, but the Idem Ball Sprinkler Head lived up to its namesake and literally turned some heads at Husker Harvest Days. Not your dad’s nozzle Latzke came across a new type of irrigation nozzle. Idem Irrigation, Gering, Neb., offers farmers a new way to pivot-irrigate, with the Idem Ball Sprinkler Head. This unique approach to nozzles is in the shape of a ball, with a different combination of holes that can be adjusted depending on your soil type and your watering needs. It’s ideal for low-water irrigation situations, where farmers need to do more with less, and retrofits to any brand of sprinkler. And, because the water doesn’t stand stagnant in the ball, there is less chance of collecting hard water deposits. The company touts a 7.92% increase in yield with nearly 90% in cost savings. For more information, visit idemirrigation.com, or call 888-869-IDEM. HEAT WATER FOR LESS: Jug Waterers has a new automatic watering system for livestock that can be heated for less than $10 per year. Clean water for horses Many stockmen know the hassle of cleaning old feed, hay and algae out of automatic waterers. McNaughton found Jug Waterers has solved this problem while increasing longevity and energy efficiency with their waterer lineup. The durable rotomolded polyurethane construction makes for tough construction, while the open bowl design and unique draw tube water system keeps animals hydrated with no learning curve. The two-hole model costs less than $10 a year to heat (even in the Northern Plains), with the copper tubing in the system bringing warmer water in the winter and cooler water in the summer. Available in one-, two-, and four-hole models, there is a Jug Waterer for every place on your operation. Find out pricing and information at jugwaterers.com.","filter_flag":1}
{"title":"Navien announces first HVAC product during virtual launch event - Supply House Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1MjYtbmF2aWVuLWFubm91bmNlcy1maXJzdC1odmFjLXByb2R1Y3QtZHVyaW5nLXZpcnR1YWwtbGF1bmNoLWV2ZW500gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1MjYtbmF2aWVuLWFubm91bmNlcy1maXJzdC1odmFjLXByb2R1Y3QtZHVyaW5nLXZpcnR1YWwtbGF1bmNoLWV2ZW500gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1MjYtbmF2aWVuLWFubm91bmNlcy1maXJzdC1odmFjLXByb2R1Y3QtZHVyaW5nLXZpcnR1YWwtbGF1bmNoLWV2ZW500gEA","guidislink":false,"published":"Tue, 26 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=269, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1MjYtbmF2aWVuLWFubm91bmNlcy1maXJzdC1odmFjLXByb2R1Y3QtZHVyaW5nLXZpcnR1YWwtbGF1bmNoLWV2ZW500gEA?oc=5\" target=\"_blank\">Navien announces first HVAC product during virtual launch event<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply House Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Navien announces first HVAC product during virtual launch event - Supply House Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1MjYtbmF2aWVuLWFubm91bmNlcy1maXJzdC1odmFjLXByb2R1Y3QtZHVyaW5nLXZpcnR1YWwtbGF1bmNoLWV2ZW500gEA?oc=5\" target=\"_blank\">Navien announces first HVAC product during virtual launch event<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply House Times<\/font>","source.href":"https:\/\/www.supplyht.com","source.title":"Supply House Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Navien announced three new innovations, including their first HVAC product, during a virtual launch event on September 26. NPF Hydro-furnace Central to the launch event was Navien’s announcement of the NPF Hydro-furnace, their introduction into the HVAC market. Available in Upflow and Horizontal configurations, the NPF comes in two sizes of 60,000 BTU\/h and 100,000 BTU\/h that both boast 97.0% AFUE and meet the stringent requirements of SCAQMD rule 1111 for Ultra-Low NOx performance. The NPF uses Navien’s industry-proven dual stainless steel heat exchangers to heat water in an isolated compartment out of the airstream which provides sound-reduction and energy efficiency. The heated water is circulated through a hydronic coil which transfers the heat into the airstream for the ultimate in quiet forced-air heating comfort. The sealed combustion design allows the NPF to deliver comfortable heat without significantly impacting humidity levels at one of the quietest sound levels of any furnace on the market. The NPF features industry leading variable capacity that can modulate down to 15% for an unparalleled level of comfort that allows the unit to meet year-round heating needs. An EZNav unit-mounted interface with built-in setup wizard provides easy, intuitive steps for startup, configuration, and diagnostics. Installers can set supply air temperature and airflow directly from the front panel, and the service wizard will walk contractors through component verification to aid in troubleshooting. Each NPF unit is compatible with most one- and two-staged thermostats and can be matched with any AC or heat pump system providing their own dedicated airflow selections and ramping profiles. NHW-A A new addition to Navien’s tankless water heater portfolio, the company announced the NHW-A non-condensing tankless water heater, which features the patented ComfortFlow recirculation pump and buffer tank originally introduced in the NPE-A condensing tankless water heater in 2012. ComfortFlow helps eliminate the “cold water sandwich” effect and resolves the issue of low flow rates found in other tankless water heaters. ComfortFlow also reduces the wait time for hot water by allowing internal or external recirculation without the need for external parts or controls. Users can program recirculation timing for either always-on, a set weekly schedule using the remote controller, or use the intelligent setting that learns the user’s hot water patterns and automatically adjusts the recirculation schedule to match. Like the NPN, Navien’s first non-condensing product, the NHW-A utilizes the proprietary NaviTech stainless steel heat exchanger and burner for extreme durability and low NOx emissions. NHB-H condensing boiler The NHB-H condensing boiler was announced as an update to the widely popular NHB. The NHB-H keeps much of the high-quality features of the NHB such as industry leading turndown ratios up to 15 to 1, high-efficiency of 95.0% AFUE, field convertibility from natural gas to liquid propane, four sizing options of 55,000 BTU\/h, 80,000 BTU\/h, 110,000 BTU\/h and 150,000 BTU\/h, and the ability to common vent and cascade the NHB-110H and NHB-150H models. New advancements to the NHB-H include the addition of the Vent Installation Detector (VID) for enhanced safety; an advanced front panel controller with an intuitive multi-line LCD display and command dial for quick setup and easy access to data, diagnostics and troubleshooting; built-in controls to run a boiler pump, 3 zone pumps or 3 zone valves; and the availability of a new stainless steel primary manifold kit, which simplifies near boiler piping, reducing installation time and materials. In addition to product launches, Navien reported on improvements to their NavienRewards contractor rewards program and updates to the Navien products and services app. NavienRewards now offers an updated user interface with more ways to earn and redeem points for the program. The products and services app now features service videos for registered installers and servicers, and push notifications can be enabled by all users for alerts on new products, promotions and more. Navien will start shipping the NHW-A the first week of October 2023, NHB-H early in January 2024, the NPF Upflow the first week of November 2023, and the NPF Horizontal in January 2024.","filter_flag":1}
{"title":"Concrete Strategies for Enterprises to Hit Supply Chain Sustainability Goals - Supply and Demand Chain Executive","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5zZGNleGVjLmNvbS9zdXN0YWluYWJpbGl0eS9jYXJib24tZm9vdHByaW50L2FydGljbGUvMjI4NzA4NDMvZmVyby1sYWJzLWNvbmNyZXRlLXN0cmF0ZWdpZXMtZm9yLWVudGVycHJpc2VzLXRvLWhpdC1zdXBwbHktY2hhaW4tc3VzdGFpbmFiaWxpdHktZ29hbHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5zZGNleGVjLmNvbS9zdXN0YWluYWJpbGl0eS9jYXJib24tZm9vdHByaW50L2FydGljbGUvMjI4NzA4NDMvZmVyby1sYWJzLWNvbmNyZXRlLXN0cmF0ZWdpZXMtZm9yLWVudGVycHJpc2VzLXRvLWhpdC1zdXBwbHktY2hhaW4tc3VzdGFpbmFiaWxpdHktZ29hbHPSAQA?oc=5","id":"CBMinwFodHRwczovL3d3dy5zZGNleGVjLmNvbS9zdXN0YWluYWJpbGl0eS9jYXJib24tZm9vdHByaW50L2FydGljbGUvMjI4NzA4NDMvZmVyby1sYWJzLWNvbmNyZXRlLXN0cmF0ZWdpZXMtZm9yLWVudGVycHJpc2VzLXRvLWhpdC1zdXBwbHktY2hhaW4tc3VzdGFpbmFiaWxpdHktZ29hbHPSAQA","guidislink":false,"published":"Sun, 03 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=246, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5zZGNleGVjLmNvbS9zdXN0YWluYWJpbGl0eS9jYXJib24tZm9vdHByaW50L2FydGljbGUvMjI4NzA4NDMvZmVyby1sYWJzLWNvbmNyZXRlLXN0cmF0ZWdpZXMtZm9yLWVudGVycHJpc2VzLXRvLWhpdC1zdXBwbHktY2hhaW4tc3VzdGFpbmFiaWxpdHktZ29hbHPSAQA?oc=5\" target=\"_blank\">Concrete Strategies for Enterprises to Hit Supply Chain Sustainability Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply and Demand Chain Executive<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Concrete Strategies for Enterprises to Hit Supply Chain Sustainability Goals - Supply and Demand Chain Executive","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3d3dy5zZGNleGVjLmNvbS9zdXN0YWluYWJpbGl0eS9jYXJib24tZm9vdHByaW50L2FydGljbGUvMjI4NzA4NDMvZmVyby1sYWJzLWNvbmNyZXRlLXN0cmF0ZWdpZXMtZm9yLWVudGVycHJpc2VzLXRvLWhpdC1zdXBwbHktY2hhaW4tc3VzdGFpbmFiaWxpdHktZ29hbHPSAQA?oc=5\" target=\"_blank\">Concrete Strategies for Enterprises to Hit Supply Chain Sustainability Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply and Demand Chain Executive<\/font>","source.href":"https:\/\/www.sdcexec.com","source.title":"Supply and Demand Chain Executive","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Today's enterprises face more pressure than ever to improve supply chain sustainability. Capital markets are requiring new sustainability-related disclosures, and news stories about the topic often make their way to the front page of media outlets, a sign that climate impact is no longer a topic companies can afford to overlook. For example, Amazon recently announced it will ask its supply chain to report emissions starting in 2024, the latest in a stream of enterprises to deepen its focus on supply chain sustainability that also includes CPG multinational Colgate and DiGiorno. Investing in supply chain sustainability offers many significant benefits for enterprises beyond emissions reduction, including cost savings and risk and reputation mitigation. By making sustainability improvements such as reducing waste and improving energy efficiency, companies can lower operational expenses and enhance their bottom line. When enterprises approach the topic of sustainability, they often do so from a high-level perspective, looking at overall traceability and transparency as well as third-party suppliers. However, in order to make true sustainability improvements, companies must focus on every aspect of the supply chain. Here are some technology strategies that companies can consider to improve sustainability across the whole supply chain, from sourcing and procurement to last-mile logistics: Sourcing and procurement stage: Increase transparency with sensors. Several new technologies can improve sustainability during the sourcing stage of the supply chain, facilitating transparency and enabling enterprises to make sustainable sourcing decisions. For example, increasing the number of internet-connected sensors and devices can trace raw materials and products back to their source, ensuring responsible sourcing. They can also verify the origin of renewable energy certificates and ensure accurate reporting of renewable energy usage in the supply chain. Production stage: Optimize energy consumption with AI. Artificial intelligence or machine learning (ML) software can analyze real-time data from sensors and machines to optimize energy consumption during the production process. By identifying inefficiencies and recommending adjustments, AI helps reduce energy waste, leading to a more sustainable production operation. These sustainable supply chain practices can lead to cost savings in the long run: by improving energy efficiency, companies can save money in addition to energy resources, which is highly relevant and useful as enterprises confront today's challenging landscape of raw material shortages and supply chain snags. Distribution stage: Optimize routes with advanced logistics. Route planning software powered by AI and data analytics can figure out the most efficient delivery routes, thus minimizing transportation distance, fuel consumption, and emissions. This results in a more sustainable distribution process where less energy is wasted on logistics. In addition, companies can leverage data analytics to monitor distribution operations. By tracking key performance indicators (KPIs) related to efficiency and environmental impact, companies can identify areas for improvement and optimize their distribution processes. Reverse logistics stage: Think about circularity. Companies should design products with the circular economy in mind, considering how even when products are tossed out by the end user, they can be reused. When it comes to companies producing industrial products such as chemicals, they can work with materials that are considered waste. Software can help with this process of material recovery, helping engineers figure out how to implement processes to recover more valuable materials from products that were previously considered waste. By using repurposed materials in the manufacturing of new products, enterprises can reduce the need for virgin materials and mined components. Supply chain sustainability is an incredibly crucial aspect of modern business operations. It is an all-encompassing approach to managing the entire supply chain network in a way that meets the needs of the present without compromising the ability of future generations to meet their own needs. It involves not only ensuring the availability of resources, but also promoting the responsible use of these resources, which in turn, can help to reduce waste and pollution. By implementing sustainable supply chain practices, businesses can not only contribute to a healthier environment but also ensure the longevity of their operations while maintaining stakeholder trust and satisfaction over the long term. This, in turn, can lead to better brand reputation, increased customer loyalty and ultimately, greater financial success. Moreover, a sustainable supply chain strategy fosters long-term business success by creating a competitive advantage for companies that prioritize emissions reduction. Consumers are increasingly demanding environmentally responsible products and are willing to pay more for them, making sustainability a key factor in purchasing decisions. By implementing sustainable practices throughout the supply chain, companies can differentiate themselves from their competitors and attract more customers. In order to achieve supply chain sustainability, companies must adopt a holistic approach that considers all aspects of the supply chain, from sourcing raw materials to delivering the final product. This requires collaboration with suppliers, customers, and other stakeholders to ensure that sustainability is integrated into every aspect of the supply chain. By doing so, companies can ensure that they are well-positioned to thrive in an increasingly environmentally conscious and socially responsible world.","filter_flag":1}
{"title":"New products – October 2023 - Ag Proud","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmFncHJvdWQuY29tL2FydGljbGVzLzU4MjU4LW5ldy1wcm9kdWN0cy1vY3RvYmVyLTIwMjPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmFncHJvdWQuY29tL2FydGljbGVzLzU4MjU4LW5ldy1wcm9kdWN0cy1vY3RvYmVyLTIwMjPSAQA?oc=5","id":"CBMiQGh0dHBzOi8vd3d3LmFncHJvdWQuY29tL2FydGljbGVzLzU4MjU4LW5ldy1wcm9kdWN0cy1vY3RvYmVyLTIwMjPSAQA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmFncHJvdWQuY29tL2FydGljbGVzLzU4MjU4LW5ldy1wcm9kdWN0cy1vY3RvYmVyLTIwMjPSAQA?oc=5\" target=\"_blank\">New products – October 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ag Proud<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New products – October 2023 - Ag Proud","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmFncHJvdWQuY29tL2FydGljbGVzLzU4MjU4LW5ldy1wcm9kdWN0cy1vY3RvYmVyLTIwMjPSAQA?oc=5\" target=\"_blank\">New products – October 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ag Proud<\/font>","source.href":"https:\/\/www.agproud.com","source.title":"Ag Proud","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Photo courtesy of Staheli West. Introducing the all-new DewPoint 632 Over the past few years, Staheli West has dedicated themselves to developing a new cutting-edge DewPoint model for the large square bale market. The DewPoint 632 has new features designed for longer run times, greater efficiency, easier service and maintenance, and it is easier to operate with its new interface and operating system. The DewPoint 632 with its advanced features and new technology marks a new era of efficiency, control and quality for farmers and hay producers. Lynn Jaynes Emeritus Editor Lynn Jaynes retired as an editor in 2023. Powered by the tractor's electrical and hydraulic system, the DewPoint 632 utilizes a diesel oil burner and boiler system, resulting in the production of high-quality steam. This steam is then channeled through hoses into custom manifolds mounted on the baler, where it is injected into the dry crop material during baling. The DewPoint 632 boasts a new in-cab display that offers enhanced visibility. Featuring a new design, the interface includes a convenient steam on\/off button, a large twist knob for effortless steam adjustment and steam ratio preset options tailored for different baling conditions. Operating the DewPoint 632 is now simpler and more intuitive than ever. The DewPoint 632 incorporates an entirely new operating system that streamlines functionality. Eliminating the need for generators and high-voltage components, the system now relies on the tractor hydraulic system to power the burner fan motor and feedwater pump and the 12-volt electrical system of the tractor to power the machine’s sensors and electrical components. With an expanded water capacity of 200 gallons, the DewPoint 632 offers approximately 20% longer run times compared to previous models. This extended operation time reduces downtime and increases baling efficiency. The DewPoint 632 introduces an innovative design that simplifies maintenance and servicing. Toolless access to regular maintenance components reduces downtime, resulting in increased operational hours and reduced maintenance costs. Photo courtesy of New Holland. All-electric utility tractor from New Holland For 2024, New Holland Agriculture is introducing the first all-electric utility tractor with autonomous features: the T4 Electric Power. This cutting-edge tractor opens a new class in the market, the Utility Electric, focused on offering solutions for more efficient field operations. Advertisement T4 Electric Power is an ideal solution for lower horsepower field operations, it is suitable for multiple applications, such as mixed farm, hay and forage, dairy, livestock, municipality, greenhouse and specialty crops (vegetable and orchard). Equipped with a state-of-the-art lithium-ion battery pack, the T4 Electric Power delivers gradual power and continuous torque achieved at the lowest speeds. Under the hood of the T4 Electric Power lies a state-of-the-art battery system partnered with a fully electrified drivetrain that’s proven to deliver relentless power and productivity. Featuring a 110-kWh maximum energy storage capacity in a 400-volt nominal high-voltage circuit, it provides 74 HP (55 kW) rated power and 65 HP (48 kW) power takeoff (PTO) power. It offers four-wheel drive, a proven 12x12 transmission, a clutch-less electronic power shuttle reverser and all the regular power outputs of a traditional diesel utility. This includes rear electro-hydraulic PTO, drawbar, multiple rear remotes, midmount valves and a robust, and complete, 725LU mechanical self-leveling front loader with third function and 84-inch bucket included. The tractor can be recharged by multiple energy sources such as regular grids, solar panels, biodigesters and wind power in both alternate current (AC) and direct current (DC). Operating in DC, it takes just one hour to reach 100% power when using commercially available fast-charging systems. Equipped with common 110-volt and 220-volt outlets used in workshops and farmyard electrical installations, the tractor can serve as a power source for electric power tools such as welding, drilling and cutting machines. Photo courtesy of Kubota. Kubota introduces fourth-generation M7 ag tractors Kubota Tractor Corporation announced a new generation for the M7 Series. The new M7-4 Series features the same horsepower segments as before, ranging from 128 to 168 in engine horsepower, with three new models, the M7-134, M7-154 and M7-174. Customers can optimize the tractor for their specific needs with all models available in Deluxe, Premium and Premium KVT, offering benefits for any farm application. The M7-4 Series models all feature a new LM2606 front loader that pushes the envelope to achieve a new level of power and efficiency in front loader performance. This new front loader provides an increased lifting height of up to 167 inches and a lift capacity of 5,776 pounds at the bucket pivot pin. The loader control lever is conveniently located to enable quick, smooth and intuitive control of front loader operations. On Deluxe models, the new mechanical multifunction joystick simplifies front loader operations with ergonomically designed shift buttons, eliminating the need to frequently switch grip between the joystick, steering wheel and shift lever. Improved design of fuel and diesel exhaust fluid (DEF) tanks allows the steps into the cabin to become integrated with the tanks, while letting the operator work longer between refueling stops. Once inside the spacious cabin, an automatic HVAC system ensures a temperature-right workspace even after long hours of operation, whether in summer or winter, which comes standard on the Premium and KVT models and is optional on the Deluxe model. Additionally, the choice of mechanical or air suspension and the standard air-ride-equipped seat reduces discomfort and bumps along the way. Photo courtesy of Great Plains. Great Plains adds Implement Command Max-Chisel Great Plains has expanded the family of Implement Command-compatible products to include the ever-popular Max-Chisel. The Max-Chisel is an aggressive soil management tool that is designed to achieve complete soil fracture, even at shallower depths. In the fall, the Max-Chisel works to remove ruts, limit erosion and capture moisture through vertical tillage. In the spring, the Max-Chisel prepares the soil for a single pass with a seedbed preparation tool, like the VT1100 Turbo-Max. For added control and convenience, the Max-Chisel is now offered with the optional Implement Command System (ICS), allowing producers to set, adjust and monitor the implement from the tractor cab. With Implement Command, several tillage functions can be easily controlled with a simple push of a button. Producers can control the Max-Chisel’s tillage depth and finisher pressure for customized results. On the 17- and 19-shank models, producers can use on-screen controls to easily dial in the amount of wing down pressure desired for their field conditions. Implement Command is ISOBUS-compatible and works with the tractor’s existing virtual terminal, so no additional monitors are needed. For tractors equipped with multiple displays, dual VT compatibility lets producers easily transfer implement controls to the next available VT on the bus. Two opposing rows of exclusive concave turbo-wave blades with patented “samurai” edges aggressively remove root balls while mixing and incorporating residue – pinning it to the ground to accelerate decomposition. Producers can select their desired finish with a choice of attachments: chopper reels for a vertically tilled profile or combine with a MaxLift roller for a smooth, uniform finish. All Max-Chisel models feature hydraulically adjustable disc gang depth control and toggle-trip shanks to till up to 12 inches deep. The Max-Chisel’s blades are virtually maintenance-free with a six-lip interlocking seal on each bearing to keep grease in and contaminants like dirt and debris out.","filter_flag":1}
{"title":"Lessons from Energy Crisis Due to the War in Ukraine | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbGVzc29ucy1mcm9tLWVuZXJneS1jcmlzaXMtZHVlLXRvLXdhci1pbi11a3JhaW5l0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbGVzc29ucy1mcm9tLWVuZXJneS1jcmlzaXMtZHVlLXRvLXdhci1pbi11a3JhaW5l0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbGVzc29ucy1mcm9tLWVuZXJneS1jcmlzaXMtZHVlLXRvLXdhci1pbi11a3JhaW5l0gEA","guidislink":false,"published":"Fri, 01 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=244, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbGVzc29ucy1mcm9tLWVuZXJneS1jcmlzaXMtZHVlLXRvLXdhci1pbi11a3JhaW5l0gEA?oc=5\" target=\"_blank\">Lessons from Energy Crisis Due to the War in Ukraine | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lessons from Energy Crisis Due to the War in Ukraine | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbGVzc29ucy1mcm9tLWVuZXJneS1jcmlzaXMtZHVlLXRvLXdhci1pbi11a3JhaW5l0gEA?oc=5\" target=\"_blank\">Lessons from Energy Crisis Due to the War in Ukraine | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"As much of the world recovers from blistering heat waves, and with an unpredictable winter approaching, the stability of energy systems is top of mind in many nations. It’s instructive, therefore, to revisit how the European Union managed to remain resilient through the first year of the war in Ukraine. In the fall of 2022, Russia shut most of its gas pipelines to Europe over the EU’s support for Ukraine. With gas storage levels low and options for quickly replacing one of its most important energy sources far from clear, EU countries braced for energy rationing, skyrocketing electricity and fuel prices, and a likely recession. EU’s bold policy combined conservation, massive investment to diversify energy sources, and a willingness to temporarily veer from decades of energy strategy. Yet EU countries emerged from the winter of 2022–2023 with natural gas storage levels at their highest level in years, fuel prices back down to preinvasion levels,1 1 Gas prices have, as of mid-August 2023, jumped again on the potential for strikes at Australian LNG export facilities. A strike could put 10% of global LNG supplies at risk. Notes: 1 Gas prices have, as of mid-August 2023, jumped again on the potential for strikes at Australian LNG export facilities. A strike could put 10% of global LNG supplies at risk. and an economic hit that was lighter than anticipated. Credit a bold policy response that combined conservation, massive investment to diversify energy sources, close collaboration with allies, and a willingness to temporarily veer from decades of energy strategy to tackle the crisis at hand. The energy crisis had a high human toll, however. And the EU’s ultimate success came at an enormous cost for nations in other regions that struggled to cope with energy scarcity and soaring fuel energy prices. The green transition slowed in many nations as energy reliability and affordability took precedence over the climate. The crisis also underscored the fact that energy will play a major geopolitical role. Given that further energy disruptions are likely to occur, policymakers, energy producers, and consumers should therefore learn from the key lessons of the past year’s global energy crisis. Lesson 1: Invest in Resilience Early On The EU proved that energy security can be bought in an emergency—if you have the financial resources. But the cost and the negative second-order effects on other countries were much higher than they should have been had the region’s governments had a more resilient energy system in the first place. To cope with the loss of 140 billion cubic meters of Russian natural gas, the governments of EU countries spent more than $800 billion on energy-related measures, a sharp increase over the previous year. They spent more than ten times as much in 2022 as in 2021 to increase stockpiles of natural gas from Norway and other suppliers. The EU also spent massively to acquire LNG on spot markets. Lacking the capacity to process imported LNG and transport the gas to pipelines, the lower house of Germany’s Bundestag approved spending of more than $10 billion to charter five floating storage regassification units (FSRUs)—three times more than the program’s initial budget. The EU’s actions, however, disrupted the global LNG market by creating a mismatch between supply and demand. Skyrocketing LNG prices imposed severe hardships on nations that lacked the EU’s vast financial resources. Several low-income and lower-middle income countries were forced to return to temporarily cheaper—yet more carbon-intensive—fossil fuels, such as coal, setting back international efforts to mitigate global warming. For example, Pakistan, which experienced blackouts and an economic crisis in 2022 due to the natural gas shortage and unaffordable LNG, plans to quadruple its coal-fired power generation capacity. Stresses on the LNG market also caused diesel-fueled power generation to rise by 17% as nations sought cheaper and more secure energy sources. The crisis had a devastating human component for those who could not afford the rising prices, including within EU itself. The Economist estimates that higher energy prices claimed the lives of at least 68,000 Europeans.2 2 The Economist study included the EU-27 countries (minus EU members Cyprus and Malta) as well as Great Britain, Norway, and Switzerland. It did not examine non-EU European countries such as Moldova and Ukraine. Notes: 2 The Economist study included the EU-27 countries (minus EU members Cyprus and Malta) as well as Great Britain, Norway, and Switzerland. It did not examine non-EU European countries such as Moldova and Ukraine. Lesson 2: Keep Energy Policy and Strategy Agile Germany’s response to the energy crisis demonstrates the immense value of flexibility in energy policy and strategy. Germany realized that the rapid pivot to LNG would likely be a short-term solution. So it largely avoided locking itself into long-term LNG contracts. And instead of building permanent LNG gasification terminals that would likely operate for decades, Germany opted for leasing FSRUs that could move to other locations as its needs change. What’s more, fast action and collaboration between utility companies, government authorities, and politicians enabled Germany to bring its first FSRU in Wilhelmshaven online in a record 10 months. Normally, it takes Germany four years to complete a major energy project, with much of that time allocated to planning, permitting, testing, and certification. Germany fast-tracked these processes in response to the crisis. Germany also exhibited flexibility by backtracking on two decades of energy policy. This was first done by announcing it will restart 27 idle coal-fired power plants by March 2024. France, Austria, Italy, and the Netherlands have also announced plans to restart idle coal power plants, even as coal-fired generation continues to decline in Europe in the face of rapidly rising renewable capacity. The Biden administration in the US also exhibited flexibility. It came into office aiming to slow production of natural gas and oil to address climate change. In response to the war, it switched gears and pushed hard to expand US liquid natural gas (LNG) exports to key trade partners. In both the EU and the US, these were difficult decisions made to address an extraordinary crisis. Implementing such measures inevitably comes at an environmental cost. The crisis response illustrated the often-hard tradeoffs that governments make between energy security and sustainability. It also underscores the importance of avoiding or managing such tradeoffs in the future. Lesson 3: Diversity Is the Key to Energy Security The energy crisis that followed Russia’s invasion of Ukraine exposed the dangers of overreliance on any single energy supplier or source. By maintaining a diverse energy mix, including renewables, natural gas, and nuclear, countries can have the flexibility and resilience needed to mitigate the risks of supply disruptions caused by geopolitical tensions, natural disasters, and other unanticipated events. The EU eased its dependence on Russian natural gas, for example, by increasing its imports of LNG from Qatar by around one-quarter and more than doubling its imports from the US, a strategic geopolitical ally. Several Asian and European countries reduced their reliance on gas by taking the short-term measure of boosting their use of oil for power generation by around half between from the third quarter of 2022 through the first quarter of 2023, the first such increase in 20 years. Oil-fired power generation is a last-resort fuel because it is inefficient, often expensive, and significantly more polluting. This increased pollution harms the efforts to reduce both CO 2 emissions as well as particulate emissions. A more diverse energy mix would also enable countries that now rely heavily on coal to mitigate the risk of major disruptions due to increasingly severe winter storms in some regions that can freeze coal and make it hard to ship. Lesson 4: Resilience Measures Should Be Future Proofed Investments in a wide variety of energy sources can also help ensure countries are prepared both for future disruptions and the longer-term transition to low-carbon fuels. The US is promoting such investments through several ambitious initiatives. Among the Inflation Reduction Act’s provisions are $369 billion in spending and tax credits over 10 years for energy security and climate change programs, including clean hydrogen, zero-emission nuclear power, and carbon capture and storage. The US CHIPS and Science Act offers billions of dollars in subsidies for critical technologies such as semiconductors, which are important for such digital solutions as smart grids and integrating renewable energy into power grids. The EU also plans to invest aggressively in its energy future. The EU’s proposed Net Zero Industry Act aims to scale up manufacturing of clean-energy technologies. Other proposed legislation seeks to secure a diverse, affordable, and sustainable supply of critical raw materials needed for clean-energy solutions. The European Commission’s Green Deal Industrial Plan for the Net-Zero Age includes proposed measures to accelerate the decarbonization of industry and improve global competitiveness in green technologies. Among other things, it will streamline regulation of everything from lithium-ion batteries and solar installations to carbon capture systems. Companies can also future proof their existing energy infrastructure. SoCalGas, the largest US natural gas distributor, plans to make its gas pipelines and storage facilities usable in the future for hydrogen and renewable natural gas. The Netherlands is also repurposing a natural gas pipeline to carry hydrogen. Lesson 5: Reduce Demand and Increase Efficiency The International Energy Agency calls energy efficiency the first fuel of a sustainable global energy system. Higher natural gas and electricity prices over the past year in Europe and other regions caused both “bad efficiency” and “good efficiency.” Bad efficiency reduces growth and, in some cases, jeopardizes public health as low-income households cut needed energy use because of unaffordability. Good efficiency reduces energy demand without slowing economic growth and harming human health. Examples include using higher efficiency boilers and electrifying end uses that currently are fossil fuel powered. Good efficiency has a greater chance of creating a durable reduction in demand, enabling countries to achieve climate goals faster and freeing up funds that can be deployed elsewhere. Japan illustrates the benefits of protracted efforts to improve energy efficiency. Japan lacks sufficient natural energy resources. Yet it has remained an industrial powerhouse through efficient energy usage supported by years of smart government and company policies. Examples include strict uses of air conditioning in buildings, a push to increase the efficiencies of vehicles, and a greater use of public transport, particularly in and around Tokyo. Since the invasion of Ukraine, global primary energy intensity—a measure of how much energy is used to produce a unit GDP—improved by almost 2%, approaching the highest point in nearly a decade. Applying the Lessons Learned The implications of these five lessons for energy policymakers, producers, and consumers should inform future action. Steps for Energy Policymakers. Energy policymakers should identify energy disruption risks, their potential impact on costs, and investments needed to mitigate such risks. Recognize that only being reactive will be far costlier in the end and could have serious second-order effects. Consider conducting simulations to model these impacts under different scenarios. Remain agile by preparing to quickly shift gears when existing policies are no longer appropriate in a new environment. Rather than merely erecting new investment hurdles, collaborate more closely with producers on projects needed to improve energy security and be willing to speed up approvals. Design incentives that encourage consumers to adopt energy-efficient practices and producers to switch fuels and develop storage facilities that can be used for different types of fuels. Policymakers should reduce subsidies for electricity generated from fossil fuels, which can distort price signals and slow the green transition. Strengthen energy security by reducing dependence on a single supplier, diversifying energy sources, and establishing policies that will withstand temporary shifts in the political winds. Develop contingency plans to manage supply disruptions and protect energy infrastructure. Policymakers must also work to keep the green transition on track despite signals that public support for climate change action may be at risk. In the US, for example, the percentage of adults who say global climate change is a threat to the country dropped from 58% in 2019 to 54% in 2022, according to the Pew Research Center, though support is still higher than in the early 2010s. Government climate policies are also under pressure in European nations as the Netherlands, where farmers have resisted new limits on greenhouse-gas emissions. Policymakers should remain unambiguous on the need for mitigating climate change and continually engage different stakeholders in the energy future so that long-term benefits of the green transition are well understood. Steps for Energy Producers. Energy producers should diversify their energy portfolios to include a variety of fuels from geographically dispersed sources, while remaining committed to reducing carbon intensity over time. Ensure that energy can be shipped to end-users over multiple routes, in case one or more face disruption. Make sure there is enough extra capacity to increase energy production and flows if suddenly needed. Maintain contracts and trading relationships across different time horizons to minimize risk and maximize flexibility. Recognize that price volatility will complicate the transition to renewables. Use periods of high energy prices to become more resilient by making strategic investments and improving risk management through financial hedging, maintaining backup capacity, and significantly increasing storage. Enhance value to shareholders to maintain their support, and work with policymakers to improve energy infrastructure. As low-carbon infrastructure is built out, maintain the flexibility to shift to high-carbon fuels if needed. And evaluate existing fossil-fuel infrastructure to see if it can be repurposed for low-carbon fuels, such as hydrogen. Putting in place a comprehensive and flexible energy resilience strategy can help mitigate both the risks and costs of the next great disruption. Steps for Energy Consumers. Energy consumers should plan for potential supply disruptions and price volatility. Foster a “demand response” operating mode, adjusting usage as prices reach high and low extremes. Seek geographic flexibility so that production lines can be moved to other regions or to contractors in case of energy-supply disruptions. Where possible, have onsite backup energy options, such as generators and solar panels, on site. Consumers should also continuously improve energy efficiency. Identify areas to curtail energy use and prepare to reduce or halt nonessential services during high-volatility situations. Over the short term, carbon intensity may need to increase to prevent systems from collapsing. But individuals and businesses should continue to decarbonize and promote domestic low-carbon energy to reduce dependence on imported energy. There’s much to learn from the EU’s initial policy and strategic response to one of its most serious disruptions to energy supply in more than half a century. But the experience also illustrated the potentially grave consequences—for the EU and beyond—of not being adequately prepared for a major emergency. Putting in place a comprehensive and flexible energy resilience strategy can help mitigate both the risks and costs of the next great disruption.","filter_flag":1}
{"title":"German startup 42watt raises funds to expand advisory for solar, heat pumps, energy efficiency - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8wOS8yOS9nZXJtYW4tc3RhcnR1cC00MndhdHQtcmFpc2VzLWZ1bmRzLXRvLWV4cGFuZC1hZHZpc29yeS1mb3Itc29sYXItaGVhdC1wdW1wcy1hbmQtZW5lcmd5LWVmZmljaWVuY3kv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8wOS8yOS9nZXJtYW4tc3RhcnR1cC00MndhdHQtcmFpc2VzLWZ1bmRzLXRvLWV4cGFuZC1hZHZpc29yeS1mb3Itc29sYXItaGVhdC1wdW1wcy1hbmQtZW5lcmd5LWVmZmljaWVuY3kv0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8wOS8yOS9nZXJtYW4tc3RhcnR1cC00MndhdHQtcmFpc2VzLWZ1bmRzLXRvLWV4cGFuZC1hZHZpc29yeS1mb3Itc29sYXItaGVhdC1wdW1wcy1hbmQtZW5lcmd5LWVmZmljaWVuY3kv0gEA","guidislink":false,"published":"Fri, 29 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=272, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8wOS8yOS9nZXJtYW4tc3RhcnR1cC00MndhdHQtcmFpc2VzLWZ1bmRzLXRvLWV4cGFuZC1hZHZpc29yeS1mb3Itc29sYXItaGVhdC1wdW1wcy1hbmQtZW5lcmd5LWVmZmljaWVuY3kv0gEA?oc=5\" target=\"_blank\">German startup 42watt raises funds to expand advisory for solar, heat pumps, energy efficiency<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"German startup 42watt raises funds to expand advisory for solar, heat pumps, energy efficiency - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8wOS8yOS9nZXJtYW4tc3RhcnR1cC00MndhdHQtcmFpc2VzLWZ1bmRzLXRvLWV4cGFuZC1hZHZpc29yeS1mb3Itc29sYXItaGVhdC1wdW1wcy1hbmQtZW5lcmd5LWVmZmljaWVuY3kv0gEA?oc=5\" target=\"_blank\">German startup 42watt raises funds to expand advisory for solar, heat pumps, energy efficiency<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Enovato GmbH, a Munich-based company operating the online energy retrofitting platform 42watt, has raised an undisclosed sum in a seed financing round led by Lithuania-based investor Contrarian Ventures. The company said it will use the funds to expand the business and its services that support homeowners with retrofitting advice. Existing investors include social impact investor, BonVenture, real estate-oriented Proptech1, and private investors, such as Felix Jahn, founder of McMakler, and Christoph Behn, founder of impact-oriented business angel club Better Ventures. The 42watt technology platform has an algorithm that uses ten data points, such as electricity consumption, or year of construction, to drive the modeling and information modules. “The algorithm, developed in collaboration with the Technical University of Munich, provides information on the right measures, investment and subsidy amounts, energy cost savings, return on investment and payback period,” Marcus Dietmann, co-founder of 42watt, told pv magazine. Measures and investments related to items like solar PV, heat pumps, new windows, or better insulation are some of the things that the company offers. Furthermore, there are savings calculators, and guidance on grants at the local, regional, and federal level. Popular content “The data points are used to create a 3D model of the house to simulate energy potentials, such as heating load and PV coverage. In addition, other information such as transmission heat losses (U-values) are calculated over the age of the building,” said Dietmann. In the future, 42watt plans to offer specialized energy advice modules. “Energy retrofitting a building must become as easy as subscribing to Netflix,” said the company's CEO, Jörg Überla. “That’s why our services will help millions of homeowners on their way to a carbon-neutral home and help Germany achieve its climate goals.” The name 42watt refers to the goal of reducing energy consumption of existing buildings to less than 42 kWh per year and m2 on average to meet Germany’s climate targets in the building sector by 2045.","filter_flag":1}
{"title":"Why Pay Attention to HVAC Faults? Energy Efficiency, for One Thing - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3doeS1wYXktYXR0ZW50aW9uLWh2YWMtc3lzdGVtLWZhdWx0c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3doeS1wYXktYXR0ZW50aW9uLWh2YWMtc3lzdGVtLWZhdWx0c9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3doeS1wYXktYXR0ZW50aW9uLWh2YWMtc3lzdGVtLWZhdWx0c9IBAA","guidislink":false,"published":"Sun, 10 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=253, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3doeS1wYXktYXR0ZW50aW9uLWh2YWMtc3lzdGVtLWZhdWx0c9IBAA?oc=5\" target=\"_blank\">Why Pay Attention to HVAC Faults? Energy Efficiency, for One Thing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Pay Attention to HVAC Faults? Energy Efficiency, for One Thing - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3doeS1wYXktYXR0ZW50aW9uLWh2YWMtc3lzdGVtLWZhdWx0c9IBAA?oc=5\" target=\"_blank\">Why Pay Attention to HVAC Faults? Energy Efficiency, for One Thing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Heat pumps are all the rage right now, and for good reason: highly efficient units may use two to three times less energy than conventional furnaces or air conditioners do. But while the efficiency of heating, ventilation, and air conditioning (HVAC) equipment has improved across the board, improper installation or commissioning can result in HVAC system faults that compromise HVAC performance and reduce energy efficiency. In addition, HVAC systems are often oversized, leading to more frequent cycling and higher energy bills. HVAC faults also sometimes arise after installation, such as a line getting a kink in it, or there being too much refrigerant, or not enough. Whatever the case, these HVAC “faults” usually go undetected, even though they can severely compromise the energy efficiency of a home’s HVAC system. HVAC System Fault Detection: Why It Matters “For decades, our cars have been telling us when faults occur,” Eric Werling, program director of the U.S. Department of Energy's (DOE) Building America program, points out. “Shouldn’t we have fault-detection technology in our home HVAC systems, too?” Recognizing that, Building America is working on research into fault detection in HVAC systems now, Werling says. Too often, installers don’t take the time to ensure HVAC systems are working optimally, and homeowners don’t receive feedback that lets them know there’s a problem with their HVAC system, says Tom Downey, chief technical officer at Proctor Engineering Group, an energy-efficiency engineering company. “Many installers just confirm that [the HVAC system] is blowing cold air and it’s quiet,” Downey says. Homeowners may not even be aware that they’re paying more than they should for heating and cooling. “They see a reduction in utility costs because they’ve installed a more efficient system,” he says, “but it’s not the reduction it should have been.” However, there’s another reason why homeowners should care about improperly commissioned HVAC equipment, says professor David Yuill in the Department of Architectural Engineering & Construction at the University of Nebraska–Lincoln. “The most serious thing about HVAC faults, from a homeowner’s perspective, is that they reduce the life of equipment,” he says. When the compressor runs hot, for example, the oil that protects and lubricates its moving parts doesn’t work as well, causing those parts to wear prematurely. RELATED Yuill says most faults go undetected and that we don’t fully understand which faults are most likely to occur. His doctoral thesis, which focused on HVAC fault detection and diagnostics, showed that many existing tools are ineffective. There’s a lot at stake: According to the Energy Information Administration, space heating and cooling accounts for more than 35% of all residential primary energy consumption. And previous Building America lab experiments show that faults can increase space conditioning energy use by up to 30% over the lifetime of the system. Building America is supporting several research projects to investigate the prevalence and severity of HVAC installation faults and to test the efficacy of diagnostic tools. This research is critical for addressing knowledge gaps and should help the DOE and the HVAC industry better direct resources. How to Detect Problems in HVAC Systems In 2019, Building America selected two teams to investigate the prevalence and detection of HVAC faults across several climate zones. The goal, according to Yuill, was to find out exactly how big of a problem HVAC faults are, so Building America could determine the resources it should put toward fault detection, specifically, “Do we put those resources toward increasing the energy efficiency of equipment, or into making systems that are robust against faults, or into programs that address faults?” Yuill asks. “Until we have the results from these projects, we’re just guessing.” In addition to compromising HVAC system performance and energy efficiency, HVAC faults also reduce the life of equipment. | Photo: courtesy Proctor Engineering Group A team from the University of Nebraska–Lincoln, headed by Yuill, is focused on developing reliable, noninvasive field methods for finding HVAC faults. “We searched the world for methods, shortlisted them, and tried them out in the lab while we imposed faults on the units,” Yuill says. “What we found is that some faults really don’t have effective methods for detecting them.” During those months when COVID prevented Yuill’s team from visiting homes in the field, they focused on refining existing methods and developing new ones. His team also developed and patented an HVAC fault monitor, called the NUBox, which detects issues such as leaking refrigerant and tracks the power use of air conditioning units, which can help to determine whether units are sized correctly. Because these monitors were so expensive, Yuill and his students built them in his lab; over time, they have been able to refine the monitors and cut the cost by half. Last summer, the team began field testing in more than 120 houses in Omaha, Neb., and San Antonio. So far, testing has revealed quite a few HVAC systems with significant faults. For example, about 40% of systems had a deviation in refrigerant charge. Field tests will continue through 2024, expanding to other regions across the U.S., and the team has also deployed some prototype NUBox monitors to collect long-term data. What About HVAC Faults in Cooling-Dominated Climates? Research Into HVAC Faults in Cooling-Dominated Climates Meanwhile, researchers at the Florida Solar Energy Center (FSEC) have teamed up with Proctor Engineering Group on field and lab studies to better understand the prevalence and severity of HVAC faults in cooling-dominated climates. “Refrigerant-type installation faults are common and a big issue,” says Eric Martin, program director in the Buildings Research Division at FSEC. Proctor Engineering Group is coordinating the field study and has recruited 85 homes across the Southwest and Southeast that received a new air conditioner or heat pump within the last 12 months. The sample includes a control group of homes that had their central cooling systems replaced through a utility quality assurance program. Space heating and cooling accounts for more than 35% of all residential primary energy consumption, according to the Energy Information Administration. And previous Building America lab experiments show that faults can increase space conditioning energy use by up to 30% over the lifetime of the system. The researchers are performing a suite of tests on these systems, including measuring refrigerant charge, static pressure, duct leakage, blower fan airflow, and condenser and blower fan watt draw. “We’re assessing the quality of installation,” Downey says, “and looking at installation faults for the equipment itself—improper airflow assignment, for example, but also duct leakage—along with design-type faults, such as improper sizing.” Proctor’s team began collecting field data last year and expects to finish this summer. FSEC is coordinating the lab studies and is measuring the performance of heat pumps installed in two lab homes on the FSEC campus. The homes are built side-by-side. In one, the installation is as close to perfect as possible; in the other home, the team is imposing various combinations of refrigerant charge and duct leakage faults in an effort to quantify the impact of various faults and the resulting increase in energy cost. The team is collecting short-term data over a range of outdoor temperatures for each fault to extrapolate the seasonal impact, Martin says. This data will add to the body of knowledge and help researchers understand how much extra energy use is at stake. The data from all of these projects will be synthesized with Building America’s larger data set on HVAC faults, which dates back to the 1990s. It will also help guide installation practices and further research. Six Common HVAC Faults Two Automated Fault-Detection and Diagnostics Tools for HVAC Systems Another Building America project, which is headed by Southface Institute, a sustainable building nonprofit, is investigating the efficacy of two newer automated fault-detection and diagnostic (AFDD) tools: MeasureQuick and Sensi Predict smart HVAC. MeasureQuick This free app is designed to work with Bluetooth-enabled contractor HVAC apps and tools, such as probes that measure temperature and line pressure. The app, which can be used with new or existing systems, can live-stream detailed snapshots of system performance and help technicians diagnose existing faults and confirm proper installation. “MeasureQuick helps contractors fine-tune out-of-the-box factory settings like fan speed so the unit is running at peak performance,” says Southface Institute technical principal Bryant Hains. Sensi Predict Smart HVAC Sensi Predict is an AFDD tool developed by Emerson Electric that’s designed to monitor systems that are already up and running. Sensors take continuous measurements on metrics such as supply and return air temperature, condenser voltage and current, and liquid\/suction line temperature. Contractors access the data over Wi-Fi. “Sensi Predict functions like a check-engine light for HVAC,” Hains says. It provides the homeowner with high-level alerts, while the HVAC contractor receives more detailed information about the suspected problem. A combination of computerized diagnostic technology and HVAC technician training can reduce the incidence of HVAC faults. | Photo: courtesy Proctor Engineering Group The Southface team has recruited HVAC contractors all over the country to use these tools and will analyze the data gathered to quantify how much energy they are saving. The team is analyzing a year’s worth of data, evaluating new installations and comparing performance before and after tune-ups. RELATED “We are finding consistent demonstrable performance improvement when the tools are used correctly, but we’re also realizing the importance of and need for proper technician training with these new technologies to realize their full potential,” says Hugh Magande, technical principal at Southface Institute. Another aspect of the project will use interviews and surveys with contractors to learn if the tools are helping HVAC technicians be more productive and efficient, and how their homeowner customers are responding to the tools. Tools such as MeasureQuick and Sensi Predict represent a new business model and have the potential to bring the HVAC industry into the 21st century, Werling says. “Rather than a trade service agreement, where the tech comes to the house every season to change filters and tune the system, the tech only comes if Sensi Predict sends an alert that something isn’t right.” The intuitive MeasureQuick interface alerts technicians to potential faults and their possible causes, and also links to educational material on various topics. | Image: courtesy MeasureQuick Better Tools for HVAC Fault Detection In 2022, three national laboratories co-published a study investigating technological and market barriers to HVAC fault detection. HVAC fault detection and diagnostic tools have been on the market for some time, but they’re not widely deployed, says Jon Winkler, senior engineer at the National Renewable Energy Laboratory (NREL) and lead author of the study. For one, there’s no standardized set of tests or metrics for evaluating how good AFDD tools are at detecting HVAC faults. “It’s hard for utilities to incentivize their use when there’s no way to say how effective [the tools] are at identifying faults,” Winkler says. “No one really knows how much energy they’re saving.” Cost is another barrier. Often, AFDD technology for HVAC systems is an add-on cost, and most homeowners aren’t willing to pay for it for existing HVAC systems. Finally, though one benefit of AFDD tools for HVAC is that contractors don’t have to visit homes as often, HVAC technicians don’t necessarily see that as an advantage. “They like to show up at the house twice a year and have that relationship with homeowners,” Winkler points out. “We are finding consistent demonstrable performance improvement when the tools are used correctly, but we’re also realizing the importance of and need for proper technician training with these new technologies to realize their full potential.” —Hugh Magande, technical principal, Southface Institute Despite the barriers, shortcomings, and information gaps, Winkler believes smart diagnostic tools likely do improve HVAC installation, and he supports efforts to deploy them more widely. He’s also working on an algorithm that uses a home’s thermostat to help detect faults; a solution that could help bring affordable fault detection for HVAC to more customers. Downey says AFDD tools are useful to a point, assuming they’ve been validated and they complement, not replace, HVAC technician knowledge. In his view, if the goal is truly better HVAC performance—and, as a consequence, energy savings—contractors must receive better training. “What we’re finding in our programs is that it’s important for technicians to have that feedback mechanism to make sure stuff is done correctly,” Downey says. He cites the quality installation programs of utilities, which give contractors feedback; in addition, the utility physically inspects and tests HVAC units to make sure they were installed and commissioned correctly. Unfortunately, such programs capture just a small percentage of installations. Barriers to Adoption of Automated Fault-Detection and Diagnostic Tools Chart: courtesy DOE Office of Energy Efficiency & Renewable Energy HVAC Tools, Training, and Tech Support to Boost HVAC Performance In 1997, Proctor Engineering Group developed a system called CheckMe!, which combines diagnostics, verification, and quality assurance with an HVAC technician training program. “We recruit contractors and train them with extensive classroom and field training to make sure they understand how to install systems correctly,” Downey says. “They go out and install the system, collect data on performance, and report the data to our call center. We confirm that the system is operating the way it’s supposed to.” Technicians receive immediate feedback from a CheckMe! operator, enabling them to correct any problems with the HVAC system before they leave the jobsite. To use CheckMe!, technicians must attend a full-day, hands-on training, and they have to go back and correct any issues detected during on-site inspections following the installation. Meanwhile, Building America continues to support multifaceted research and demonstration of new technologies and approaches to improving installed performance of HVAC systems in American homes. “We believe advanced HVAC fault detection and diagnostics will lead, over time, to business-friendly solutions that will significantly improve HVAC system reliability and substantially reduce energy costs for millions of households,” Building America’s Werling says. Juliet Grable writes about the built environment, energy, climate change, species conservation, and environmental restoration. She lives in southern Oregon.","filter_flag":1}
{"title":"Westlake Royal Roofing Solutions Rolls Out New 'Cool-Roof' Colors - Roofing Contractor","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJvb2Zpbmdjb250cmFjdG9yLmNvbS9hcnRpY2xlcy85ODcwNC13ZXN0bGFrZS1yb3lhbC1yb29maW5nLXNvbHV0aW9ucy1yb2xscy1vdXQtbmV3LWNvb2wtcm9vZi1jb2xvcnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJvb2Zpbmdjb250cmFjdG9yLmNvbS9hcnRpY2xlcy85ODcwNC13ZXN0bGFrZS1yb3lhbC1yb29maW5nLXNvbHV0aW9ucy1yb2xscy1vdXQtbmV3LWNvb2wtcm9vZi1jb2xvcnPSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LnJvb2Zpbmdjb250cmFjdG9yLmNvbS9hcnRpY2xlcy85ODcwNC13ZXN0bGFrZS1yb3lhbC1yb29maW5nLXNvbHV0aW9ucy1yb2xscy1vdXQtbmV3LWNvb2wtcm9vZi1jb2xvcnPSAQA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJvb2Zpbmdjb250cmFjdG9yLmNvbS9hcnRpY2xlcy85ODcwNC13ZXN0bGFrZS1yb3lhbC1yb29maW5nLXNvbHV0aW9ucy1yb2xscy1vdXQtbmV3LWNvb2wtcm9vZi1jb2xvcnPSAQA?oc=5\" target=\"_blank\">Westlake Royal Roofing Solutions Rolls Out New 'Cool-Roof' Colors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Roofing Contractor<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Westlake Royal Roofing Solutions Rolls Out New 'Cool-Roof' Colors - Roofing Contractor","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJvb2Zpbmdjb250cmFjdG9yLmNvbS9hcnRpY2xlcy85ODcwNC13ZXN0bGFrZS1yb3lhbC1yb29maW5nLXNvbHV0aW9ucy1yb2xscy1vdXQtbmV3LWNvb2wtcm9vZi1jb2xvcnPSAQA?oc=5\" target=\"_blank\">Westlake Royal Roofing Solutions Rolls Out New 'Cool-Roof' Colors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Roofing Contractor<\/font>","source.href":"https:\/\/www.roofingcontractor.com","source.title":"Roofing Contractor","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Westlake Royal Roofing Solutions, a leader roofing systems and components, announced the launch of two all-new Unified Steel Stone Coated Roofing colors that the Cool Roof Rating Council has rated, including “Harborwood” and “Stirling Gray,” in both PINE-CREST Shake and PACIFIC tile profiles. “These new colors expand our Cool Roof Color Collection, a range of cool-rated colors that help homes stay cooler in summer,” says Eric Miller, vice president of Sales for Westlake Royal Roofing Solutions. “These solutions also enhance the home’s curb appeal and provide homeowners with greater indoor comfort.” In a September 13 news release, Westlake Royal said the new Unified Steel CRRC-rated colors are stone-coated steel roofing options that provide high solar reflectivity and high thermal emittance when solar energy hits the roof surface, detracting sunlight and radiating heat off the roof surface. “Their Solar Reflective Index is higher, which means they effectively reduce the amount of heat absorbed by the roof and transferred down into the structure below,” adds Steve Booz, vice president of Marketing and Product Management. “Not only are energy bills meaningfully lowered with use of these products, but the roof’s lifespan is [extended].” The company said both Harborwood and Stirling Grey exceed California Energy Code Title 24, Part 6 Cool Roof Requirements; with a Solar Reflective Index, or SRI, greater than 20, they also meet L.A. County’s more stringent SRI requirements. Unified Steel Stone Coated Roofing is a lightweight option, weighing just 1.5 pounds per square foot and the material benefits from the structural strength of steel. Westlake says Unified Steel provides enhanced energy efficiency performance when paired with Above Sheathing Ventilation. All Unified Steel products are also ‘Very Severe Hail’ rated, offer a Class A Fire Rating (when used with designated accompanying underlay materials), and are ‘Hurricane Performance’ Rated with Miami-Dade County HVHZ Approval, the most stringent hurricane resistance standard in the country. “Because of its performance attributes and lighter weight, Unified Steel is a popular choice for retrofits and new construction alike,” Booz said. The newest colors join Westlake Royal Roofing Solutions’ wide range of cool roof color options for Concrete, Clay and Composite. They are offered in various profiles and hues to complement different architectural styles and preferences. In addition to Unified Steel Stone Coated Roofing options, cool roof colors are offered in the company’s Newpoint Concrete Roof Tile, US Tile Clay Roofing Products and DaVinci Roofscapes. The Cool Roof-rated Colors may also be paired with the Westlake Royal Cool Roof System, further enhancing the roof’s overall energy efficiency. For more information, visit westlakeroyalbuildingproducts.com.","filter_flag":1}
{"title":"Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5","id":"CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA","guidislink":false,"published":"Fri, 29 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=272, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Schneider Home , a first-of-its-kind home energy management solution being premiered to electrical contractor audience , a first-of-its-kind home energy management solution being premiered to electrical contractor audience EcoStruxure Microgrid Flex, SourcePacT isolation switches, and VisiPact safety switches among new products being launched New offerings support changing needs of electrical contractors and installers at the forefront of the new energy landscape PHILADELPHIA, Sept. 29, 2023 \/PRNewswire\/ -- Schneider Electric, the leader in the digital transformation of energy management and automation, today announced a broad portfolio of product innovations at the NECA 2023 Convention & Trade Show taking place September 29 through October 2 in Philadelphia, PA. Designed to accelerate the new energy landscape, these innovations will support electrical contractors and installers who play a vital role at the forefront of energy efficiency, safety, and sustainability for residential, commercial and industrial customers. Schneider Home, a first-of-its-kind integrated home energy management solution that makes homes more efficient and resilient, will be premiered to industry professionals at the event. Schneider Home provides energy independence for homeowners – automating energy production, storage, measurement, and control – all from a single, easy-to-use app. This award-winning, comprehensive solution includes a smart electrical panel, a home battery for clean energy storage, a high-power solar inverter, an electric vehicle (EV) charger, and connected electric sockets and light switches, all connected to intelligently orchestrate home energy. In contrast to existing solutions, requiring separate apps and disjointed hardware, Schneider Home eliminates that complexity, allowing homeowners to easily manage energy usage and reduce costs. \"As we move rapidly into the new energy landscape, electrical contractors and installers are at the forefront of energy efficiency, safety and sustainability guiding their industrial, commercial, and residential customers through an increasingly electric world,\" said Peyton Pratt, Vice President, Power Systems, Schneider Electric. \"We are responding to their changing needs by providing innovative technology, training, and services to grow their businesses, and we're excited to share those solutions at the NECA show.\" Schneider Electric: Innovation on display Schneider Electric also announced additional new product innovations, including: VisiPact Safety Switch – This new heavy duty safety switch takes all the trusted features, such as the switching mechanism and adds new, standard features, such as a viewing window, hook stick handle, QR code for quick access to information, touch safe barriers, and more. – This new heavy duty safety switch takes all the trusted features, such as the switching mechanism and adds new, standard features, such as a viewing window, hook stick handle, QR code for quick access to information, touch safe barriers, and more. SourcePacT Isolation Switch – The Industry's first purpose-built solution that automatically isolates an electrical system from an external utility, enabling local inverter-based sources to provide standby-power in resilience applications. – The Industry's first purpose-built solution that automatically isolates an electrical system from an external utility, enabling local inverter-based sources to provide standby-power in resilience applications. EcoStruxure Microgrid Flex – This industry-first fuses microgrid controls, electrical distribution, software, and Schneider Electric's Energy Control Center and all-in-one Battery Energy Storage System (BESS) to simplify traditional microgrid configuration for faster and simpler implementation. – This industry-first fuses microgrid controls, electrical distribution, software, and Schneider Electric's Energy Control Center and all-in-one Battery Energy Storage System (BESS) to simplify traditional microgrid configuration for faster and simpler implementation. QO Smart Panel Solution – A modular, flexible solution that provides 'smart' panel functionality quickly, easily, and inexpensively by adding Square D Control Relays and a Schneider Energy Monitor to new or existing Square D Plug-on Neutral panels. – A modular, flexible solution that provides 'smart' panel functionality quickly, easily, and inexpensively by adding Square D Control Relays and a Schneider Energy Monitor to new or existing Square D Plug-on Neutral panels. EcoConsult Electrical Digital Twin Service – This service digitizes paper single-line diagrams (SLDs) to easily operate and maintain the electrical systems, and helps you comply with new NFPA 70B mandates. These products will be displayed at the 2023 NECA Convention in Schneider Electric's Booth #2000. To learn more, please visit http:\/\/www.se.com\/us. About Schneider Electric Schneider's purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On. Our mission is to be your digital partner for Sustainability and Efficiency. We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries. We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values. www.se.com Discover Life Is On | Follow us on: Twitter | Facebook | LinkedIn | YouTube | Instagram | Blog Discover the newest perspectives shaping sustainability, electricity 4.0, and next generation automation on Schneider Electric Insights. SOURCE Schneider Electric","filter_flag":1}
{"title":"Worcester Bosch launches new series of high-flow monobloc heat pumps - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE0L3dvcmNlc3Rlci1ib3NjaC1sYXVuY2hlcy1oaWdoLWZsb3ctbW9ub2Jsb2MtaGVhdC1wdW1wLXNlcmllcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE0L3dvcmNlc3Rlci1ib3NjaC1sYXVuY2hlcy1oaWdoLWZsb3ctbW9ub2Jsb2MtaGVhdC1wdW1wLXNlcmllcy_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE0L3dvcmNlc3Rlci1ib3NjaC1sYXVuY2hlcy1oaWdoLWZsb3ctbW9ub2Jsb2MtaGVhdC1wdW1wLXNlcmllcy_SAQA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE0L3dvcmNlc3Rlci1ib3NjaC1sYXVuY2hlcy1oaWdoLWZsb3ctbW9ub2Jsb2MtaGVhdC1wdW1wLXNlcmllcy_SAQA?oc=5\" target=\"_blank\">Worcester Bosch launches new series of high-flow monobloc heat pumps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Worcester Bosch launches new series of high-flow monobloc heat pumps - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE0L3dvcmNlc3Rlci1ib3NjaC1sYXVuY2hlcy1oaWdoLWZsb3ctbW9ub2Jsb2MtaGVhdC1wdW1wLXNlcmllcy_SAQA?oc=5\" target=\"_blank\">Worcester Bosch launches new series of high-flow monobloc heat pumps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Worchester Bosch has unveiled a new line of residential heat pumps. The UK heating products manufacturer said the new heat pumps can be used in small outdoor spaces, as well as new and existing buildings. They can also be cascaded up to six units and their sound levels are as low as 53 dB. The new heat pumps are available in different versions, with output ranging from 4 kW to 30 kW. The smallest device measures 717 mm x 1,295 mm x 400 mm. It reportedly has a heat output of 3 kW in colder climate conditions and 6 kW in lower-temperature applications and warmer climate conditions. The seasonal space heating energy efficiency is 102% for colder climates and 255% for lower temperature applications and warmer climates. The largest device measures 1,577 mm x 1,120 mm x 400 mm. Its heat output is 30 kW in colder and warmer climate conditions. The seasonal space heating energy efficiency is 100% for colder climates and 212% for lower temperature applications and warmer climates. Popular content All versions come with a seven-year product warranty. “The Compress 2000AWF is a high flow temperature heat pump, making it a suitable solution for new build properties and renovations,” the company said. “One of the main benefits of the Compress 2000AWF is that it is fully customizable with simple and intuitive controls, meaning users can take full control of their home comfort levels while reducing their carbon footprint.” ","filter_flag":1}
{"title":"Hitachi Sustainability Solutions and Services Offer a Logical Approach to Decarbonization - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpdGFjaGktc3VzdGFpbmFiaWxpdHktc29sdXRpb25zLWFuZC1zZXJ2aWNlcy1vZmZlci1hLWxvZ2ljYWwtYXBwcm9hY2gtdG8tZGVjYXJib25pemF0aW9uLTMwMTkzODQ2OS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpdGFjaGktc3VzdGFpbmFiaWxpdHktc29sdXRpb25zLWFuZC1zZXJ2aWNlcy1vZmZlci1hLWxvZ2ljYWwtYXBwcm9hY2gtdG8tZGVjYXJib25pemF0aW9uLTMwMTkzODQ2OS5odG1s0gEA?oc=5","id":"CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpdGFjaGktc3VzdGFpbmFiaWxpdHktc29sdXRpb25zLWFuZC1zZXJ2aWNlcy1vZmZlci1hLWxvZ2ljYWwtYXBwcm9hY2gtdG8tZGVjYXJib25pemF0aW9uLTMwMTkzODQ2OS5odG1s0gEA","guidislink":false,"published":"Tue, 26 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=269, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpdGFjaGktc3VzdGFpbmFiaWxpdHktc29sdXRpb25zLWFuZC1zZXJ2aWNlcy1vZmZlci1hLWxvZ2ljYWwtYXBwcm9hY2gtdG8tZGVjYXJib25pemF0aW9uLTMwMTkzODQ2OS5odG1s0gEA?oc=5\" target=\"_blank\">Hitachi Sustainability Solutions and Services Offer a Logical Approach to Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hitachi Sustainability Solutions and Services Offer a Logical Approach to Decarbonization - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpdGFjaGktc3VzdGFpbmFiaWxpdHktc29sdXRpb25zLWFuZC1zZXJ2aWNlcy1vZmZlci1hLWxvZ2ljYWwtYXBwcm9hY2gtdG8tZGVjYXJib25pemF0aW9uLTMwMTkzODQ2OS5odG1s0gEA?oc=5\" target=\"_blank\">Hitachi Sustainability Solutions and Services Offer a Logical Approach to Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Combining digital and industrial data, Hitachi Vantara helps customers intelligently assess IT systems and OT processes for a more energy-efficient future. SANTA CLARA, Calif., Sept. 26, 2023 \/PRNewswire\/ -- Hitachi Vantara, the modern infrastructure, data management and digital solutions subsidiary of Hitachi Ltd. (TSE: 6501), announced new Sustainability Solutions and Services to aid organizations in achieving critical environmental and decarbonization goals. Leveraging expertise in industrial domains, green transformation, energy, and mobility, Hitachi Vantara's new offerings enable organizations to adopt sustainable business practices that pave the way to a greener future. See How Hitachi Sustainability Services Can Help Your Organization: https:\/\/www.hitachivantara.com\/en-us\/solutions\/sustainability\/solutions-for-sustainability.html Hitachi Sustainability Solutions and Services are uniquely designed to better understand and reduce the carbon footprint from physical and digital operations. The comprehensive collection of services and solutions focuses on four key areas crucial for decarbonization: Green IT : Gain a holistic understanding of your IT footprint through insights to decarbonize IT assets and operations, including application and asset energy efficiency, power supply and equipment, scope 3 cloud emissions, energy efficient IT architecture — including Hitachi Vantara's eco-friendly storage portfolio* — and data stewardship. : Gain a holistic understanding of your IT footprint through insights to decarbonize IT assets and operations, including application and asset energy efficiency, power supply and equipment, scope 3 cloud emissions, energy efficient IT architecture — including Hitachi Vantara's eco-friendly storage portfolio* — and data stewardship. Manufacturing: Understand energy consumption and carbon emissions across manufacturing processes and value chains to realize business growth through lower carbon intensity and resource efficiency. Understand energy consumption and carbon emissions across manufacturing processes and value chains to realize business growth through lower carbon intensity and resource efficiency. Facilities: Create an optimized system built for your needs by incorporating sensors, advanced analytics, and control systems to achieve greater energy efficiencies and cost savings. Create an optimized system built for your needs by incorporating sensors, advanced analytics, and control systems to achieve greater energy efficiencies and cost savings. Data and Analytics: Co-create solutions for greater impact on social and environmental issues that matter the most to you and your stakeholders through Hitachi's extensive expertise in IoT, advanced analytics, digital twin, and AI technologies. \"Decarbonation is no longer reserved for the most environmentally conscious as industries face increasing regulation and requirements to limit carbon contributions,\" said Bjoern Stengel, IDC's global sustainability research lead. \"This new approach by Hitachi Vantara gives customers the tools to make informed decisions about its process and create solutions that will truly impact the bottom line — both in sustainability and monetarily.\" Measurable is Actionable: Innovation and Environmental Stewardship Through Data Leveraging the collective experience and cutting-edge technologies of the wider Hitachi group, the new Sustainability Solutions and Services portfolio empowers customers to define and implement a realistic, measurable roadmap towards achieving carbon neutrality targets. Insights from precision dashboards can now easily identify carbon 'hot spots' and prioritize areas to realize environmental goals and business ambitions. To better understand specific needs before embarking on a carbon reduction plan, Hitachi Sustainability Solutions and Services help customers define a quantifiable path forward, augmented with tailored digital solutions to streamline and transform your organization, empowering you to contribute to a more sustainable future. \"The agriculture industry is facing increasingly strict requirements to reduce the overheads of water usage, improve environmental outcomes, and ensure we maintain compliance with regulatory requirements,\" said Wayne Parr, director at Golden Grove Nursery, the dominant supplier of citrus nursery trees to the Queensland, Australia citrus industry. \"Golden Grove produces between 200,000 — 250,000 citrus nursery trees per year, supplying up to 70% of Queensland's citrus growers and commercial orchards. Using the power of data and Hitachi Sustainability Solutions and Services to improve our irrigation management processes, we're now able to intelligently monitor the irrigation systems daily and understand exactly when to water so we can identify and adjust for the months ahead.\" With Hitachi Sustainability Solutions and Services, you can confidently traverse your sustainability journey. Creating strategic plans and defining measured steps to drive real change, we enable you to transform your organization, reduce your environmental impact, and contribute to a better, more sustainable future. ADDITIONAL RESOURCES Connect With Hitachi Vantara About Hitachi Vantara Hitachi Vantara, a wholly-owned subsidiary of Hitachi Ltd., delivers the intelligent data platforms, infrastructure systems, and digital expertise that supports more than 80% of the Fortune 100. To learn how Hitachi Vantara turns businesses from data-rich to data-driven through agile digital processes, products, and experiences, visit hitachivantara.com. About Hitachi, Ltd. Hitachi drives Social Innovation Business, creating a sustainable society through the use of data and technology. We solve customers' and society's challenges with Lumada solutions leveraging IT, OT (Operational Technology) and products. Hitachi operates under the business structure of \"Digital Systems & Services\" - supporting our customers' digital transformation; \"Green Energy & Mobility\" - contributing to a decarbonized society through energy and railway systems, and \"Connective Industries\" - connecting products through digital technology to provide solutions in various industries. Driven by Digital, Green, and Innovation, we aim for growth through co-creation with our customers. The company's consolidated revenues for fiscal year 2022 (ended March 31, 2023) totaled 10,881.1 billion yen, with 696 consolidated subsidiaries and approximately 320,000 employees worldwide. For more information on Hitachi, please visit the company's website at https:\/\/www.hitachi.com. HITACHI is a trademark or registered trademark of Hitachi, Ltd. All other trademarks, service marks, and company names are properties of their respective owners. SOURCE Hitachi Vantara Corporation","filter_flag":1}
{"title":"Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA","guidislink":false,"published":"Tue, 05 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=248, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5\" target=\"_blank\">Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BhcmlzLXJob25lLWVuZXJneS10by1zaG93Y2FzZS1ncmVlbi1lbmVyZ3ktc3RvcmFnZS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MTc1MTguaHRtbNIBAA?oc=5\" target=\"_blank\">Paris Rhône Energy to Showcase Green Energy Storage Solutions at RE+ 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"When we venture towards a greener future, it's significant to highlight the promising role of Paris Rhône Energy. Paris Rhône Energy is a leading energy technology company that provides advanced power grid software solutions, backup and prime power systems for home and industrial applications, solar + battery storage solutions, virtual power plant platforms, and engine- and battery-powered tools and equipment. We are committed to sustainable, cleaner energy products poised to revolutionize the 21st-century electrical grid. As a leading provider of reliable energy products, we have driven productive transformations in power conservation. With the adoption of eco-friendly technologies, we empower individuals to pave the way toward a more sustainable life. Understanding Home Battery Storage Let's dive into the concept of energy storage systems in the following: 1. What Are Home Battery Storage Systems? Home battery storage systems are energy reservoirs designed to store surplus electricity generated by renewable sources such as solar energy. These innovative solutions allow homeowners to leverage surplus power during demand or emergencies. The primary purpose of storage batteries is to provide users optimal control over energy consumption and liberate them from traditional sources. Home battery storage systems enhance energy independence and promote sustainability. 2. How Home Battery Storage System Works with Renewable Energy Sources? The home battery solutions use renewable sources to build a dynamic energy ecosystem. Sometimes solar panels or wind turbines produce more power than the immediate demand. Instead of wasting the additional energy, the excess power is diverted to the batteries. This storage system efficiently upholds the surplus energy using advanced technologies like lithium-ion batteries. When renewables are not actively producing energy, these storage solutions are activated. They release the stored energy into the home electrical grid and meet your power requirements. 3. Advantages of Home Battery Storage for Homeowners & Environment Home battery storage offers a multitude of benefits for homeowners and the environment, making it a compelling choice for users. For example: 1) Energy Storage systems allow homeowners to power their homes with excess electricity during peak demand times. It enhances their energy independence, making them self-reliant. 2) This cutting-edge technology also offers financial benefits to homeowners. By tailoring the stored energy during peak hours, you can avoid high electricity rates and embrace cost savings. 3) An efficient backup source during power outages, blackouts, or emergencies. 4) As the storage battery systems encourage using clean energy, they help mitigate greenhouse emissions and create a more sustainable future. 5) The battery storage systems integrate eco-friendly technologies that contribute to lightening the impact of climate change and protecting our environment. 6) It also helps in stabilizing the electrical grid. The batteries manage the impact on the power grid and handle the variations in renewable electricity output. During peak consumption, the stored energy is deployed to alleviate the strain on the main electricity grid. Paris Rhône Energy Is Going to Attend RE+ 2023 RE+ 2023 is one of the largest solar shows that sets opportunities to present the latest advancements in renewable energy technologies. The event brings together a broad alliance of industry peers to share their sustainable energy solutions and expertise. As a leading manufacturer in the energy sector, we are going to attend this excellent platform. RE+ 2023 will allow Paris Rhône Energy to showcase its innovative technology to foster sustainability on a global scale. 1. Exhibitor Information Paris Rhône Energy is all geared up to participate in the upcoming event at the Sands Expo convention center, 201 Sands Ave, Las Vegas, NV, from 11th-14th Sept. The exhibition is held by Solar Energy Industries Association and Solar Energy Power Association. We will be on Sands level 2 and booth number 5140. Don't forget to visit us and unlock the new tools in the renewable sector. 2. Exhibitor Products All-in-one ESS At the event, we will present our innovative range of eco-conscious products. We are excited to exhibit our All-in-one energy storage system: HESS-PEX-SERIES. The other details are in the following. EV Charger Our EV charging solutions align with our commitment to eco-friendliness. By offering a cleaner solution for charging electric vehicles, we contribute towards reducing greenhouse emissions. Battery Storage System Our all-in-one home energy storage system allows homeowners to store surplus renewable power and optimize energy consumption. Balcony Battery We are excited to display our balcony battery which is creatively designed for SOC. Its space-saving design, DIY installation, and high power make it an ideal choice for homeowners. BYD Blade Battery Storage BYD blade battery storage integrates an intelligent management system. Its ultra-thin and sleek design makes it an easy-to-operate solar battery for home use. Being energy efficient, it contributes toward the conservation of renewable power. Paris Rhône Energy's All-in-One ESS Ready to invest in reliable energy storage systems? Look no further than all-in-one ESS from Paris Rhône Energy. We offer an all-in-one home energy storage system to enhance your energy independence. Our all-in-one home energy storage system has the following advantages: 10-year long warranty Expandable capacity of 10.24kwh-76.8kwh Energy efficiency and reduced carbon footprint Fast recharging in 1.5 hours Smart monitoring control Moreover, we will launch our new product, HESS-PEX-SERIES, at the exhibition, bringing you a brand new experience. Please look forward to it! Commitment to Energy Efficiency and Conservation All the products in our All-in-One ESS series prioritize energy efficiency. Optimizing your energy usage helps to maximize the utilization of stored energy. We have adopted intelligent technologies to minimize energy loss and contribute to energy conservation. This translates to significantly minimized power wastage, rendering it an optimal choice for both residential and industrial consumers. Conclusion In short, sustainable home battery solutions pledges a greener future. If you're looking to invest in energy-efficient products, connect with Paris Rhône Energy. We have been a portable power station supplier since 1915. Our sustainable practices have fostered clean energy adoption and made a positive impact on the environment. If you also attach great importance to these aspects, then come to our booth for detailed information! For more information, please visit https:\/\/www.energyparisrhone.com Find Paris Rhône Energy: Facebook: https:\/\/www.facebook.com\/ParisRhoneEnergy Instagram: https:\/\/www.instagram.com\/ ParisRhoneEnergy Twitter: https:\/\/twitter.com\/ParisRhoneEnergy Linkedin: https:\/\/www.linkedin.com\/company\/87128055\/ YouTube: https:\/\/www.youtube.com\/@ParisRhone_Energy\/featured SOURCE Paris Rhône Energy","filter_flag":1}
{"title":"Decarbonizing Chemicals Part Two: The Credit Risks And Mitigants - S&P Global","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vZXNnL2luc2lnaHRzL2ZlYXR1cmVkL3NwZWNpYWwtZWRpdG9yaWFsL2RlY2FyYm9uaXppbmctY2hlbWljYWxzLXBhcnQtdHdvLXRoZS1jcmVkaXQtcmlza3MtYW5kLW1pdGlnYW50c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vZXNnL2luc2lnaHRzL2ZlYXR1cmVkL3NwZWNpYWwtZWRpdG9yaWFsL2RlY2FyYm9uaXppbmctY2hlbWljYWxzLXBhcnQtdHdvLXRoZS1jcmVkaXQtcmlza3MtYW5kLW1pdGlnYW50c9IBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vZXNnL2luc2lnaHRzL2ZlYXR1cmVkL3NwZWNpYWwtZWRpdG9yaWFsL2RlY2FyYm9uaXppbmctY2hlbWljYWxzLXBhcnQtdHdvLXRoZS1jcmVkaXQtcmlza3MtYW5kLW1pdGlnYW50c9IBAA","guidislink":false,"published":"Tue, 05 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=248, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vZXNnL2luc2lnaHRzL2ZlYXR1cmVkL3NwZWNpYWwtZWRpdG9yaWFsL2RlY2FyYm9uaXppbmctY2hlbWljYWxzLXBhcnQtdHdvLXRoZS1jcmVkaXQtcmlza3MtYW5kLW1pdGlnYW50c9IBAA?oc=5\" target=\"_blank\">Decarbonizing Chemicals Part Two: The Credit Risks And Mitigants<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">S&amp;P Global<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Decarbonizing Chemicals Part Two: The Credit Risks And Mitigants - S&P Global","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vZXNnL2luc2lnaHRzL2ZlYXR1cmVkL3NwZWNpYWwtZWRpdG9yaWFsL2RlY2FyYm9uaXppbmctY2hlbWljYWxzLXBhcnQtdHdvLXRoZS1jcmVkaXQtcmlza3MtYW5kLW1pdGlnYW50c9IBAA?oc=5\" target=\"_blank\">Decarbonizing Chemicals Part Two: The Credit Risks And Mitigants<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">S&amp;P Global<\/font>","source.href":"https:\/\/www.spglobal.com","source.title":"S&P Global","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Authors Paul J. Kurias | S&P Global Ratings, Ratings Analytical Director Pierre Georges | S&P Global Ratings, Analytical Team Manager, Credit Analysis Gaetan Michel | S&P Global Ratings, Associate Director Terry Ellis | S&P Global Ratings, Global Climate Transition Specialist Contributors Michelle Kogan | S&P Global Ratings, Credit Program Analyst Lai Ly | S&P Global Ratings, Global Head of Sustainability Research Editor Judy Dillon | S&P Global Ratings, Editorial Manager Designer Joe Carrick-Varty | S&P Global Ratings, Digital Content Producer This second part of our research into decarbonizing chemicals explores the challenges companies are facing on the path to net-zero. We look to identify the credit risks that could arise from these challenges, the possible mitigants available to companies, and the potential influence on their credit quality. We focus on the US and Europe, where about 80% of our rated chemical companies are based, where regulatory frameworks are better defined, and where consumer pressure to decarbonize is more keenly felt. This research complements \"Decarbonizing Chemicals Part One: Sectorwide Challenges Will Intensify Beyond 2030,\" published Sept. 5, 2023, in which we look at companies' operational strategies, solutions for reducing greenhouse gas emissions, and how regulatory frameworks could influence cost structures and capital spending. We examined over 100 rated chemical companies with a primary focus on the highest greenhouse-gas-emitting chemicals, including base chemicals such as ammonia and petrochemicals. These represent the majority of the sectors' emissions and are emissions-intensive to produce. Choices Chemical Companies Make Will Shape Credit Risk A key factor, among many, influencing the level of credit risk companies face is the choices they make with regard to decarbonization solutions. Chemical companies have an array of components or technologies from which to forge a bespoke decarbonization route or solution. A company could possibly choose multiple decarbonization solutions, one for each manufacturing location. We illustrate, in chart 1 below, our views of the risks associated with the key decarbonization technologies that are most widely discussed (and presented in part one of our research; see table 2 in part one for a summary). Each technology in the chart below is itself an umbrella term that covers several subcomponents. With the exception of energy efficiency, we think all decarbonization technologies shown in the chart have high to moderate risks associated with their implementation. However, because they are viewed as being highly effective in their contribution to decarbonization, we believe they carry low risk related to their effectiveness. Energy efficiency, which refers to a variety of energy-saving measures but not the substitution of high-carbon raw materials and energy sources with low-carbon materials and sources, is easier to implement and therefore important. However, we believe energy efficiency will be, relatively speaking, a low contributor to decarbonization and therefore less effective. What Are Decarbonization-Related Credit Risks, And How Could They Impact Credit Quality? Based on our analysis of rated chemical companies, we identify nine top credit risks related to decarbonizing chemicals (see chart 2). These risks cover technology risk, cost and financial risks, and disruptions to markets. How these risks manifest, and which are most important for any given company, will depend on the decarbonization strategy they choose to deploy. The time frames in which these risks could materialize also differ, and we categorize them as short, medium and long term. Below, we discuss each of the identified risks and why they could be relevant. Uncertainty about decarbonization solutions In our view, the absence of consensus on a clearly demonstrated decarbonization solution raises risks that companies might make suboptimal choices that slow their progress or raise their decarbonization costs. Industry players including credible external entities such as the US Department of Energy (DOE), the International Energy Agency (IEA), and the International Renewable Energy Agency (IRENA) appear to have different ideas on the best way to decarbonize. Most published opinions and net-zero scenarios modeled on chemical decarbonization include several common decarbonization technologies, a combination of which forms a decarbonization solution. But opinions differ on the level of contribution these technologies might provide (chart 1). For example, several rated companies have published decarbonization goals and plans — including LyondellBasell Industries NV, Yara International ASA, and Nutrien Ltd. — in high-emitting subsectors such as petrochemicals and fertilizers. But we find that no company has published a detailed definitive plan with specific components to achieve net-zero across manufacturing locations and products. We believe this is because companies are still evaluating various solutions and their options. This uncertainty reflects the sector's complexity, the largely untested nature of some decarbonization technologies, and the early stage of the process. The diversity of opinions also reflects that policy and regulatory frameworks are still evolving. Manufacturing disruptions We think that decarbonization toward net-zero targets could disrupt manufacturing over the longer term. Decarbonization will likely entail plant-specific changes to chemical manufacturing for companies that prioritize net-zero targets over the coming two to three decades. Large and complex ammonia and petrochemical plants, optimized over decades to run continuously at high utilization rates with minimum disruptions, may be hardest hit. Another disruptive force could be a move away from fossil feedstocks and fuels after nearly a century of their use. All of these changes could also increase plant downtimes and at least temporarily reduce operating efficiency. Changes could include: Retrofitting existing plants or constructing new ones to accommodate new or unconventional feedstock, without impacting product characteristics. This could also require reconfiguring the entire supply chain. Introducing new methods, fuels or energy sources to generate the high levels of heat required in many chemical manufacturing processes. Introducing processes and infrastructure to capture, process, transport and\/or store carbon. Rise in operating costs Changes to fuels or feedstock or to carbon-capture methods will add to operating costs. Power and electricity costs could rise if electricity providers decide to pass on any increased decarbonization costs to chemical companies. It remains to be seen if producers' profit margins will decline or if they find they can pass costs on to consumers without hurting demand. The recent energy crisis in Europe and resulting power and gas price hikes suggest that some increases can be passed on but maybe not all. We think chemical companies with more favorable cost and market positions should be better placed to navigate this risk. Large capital outlays The capital deployed in decarbonizing will likely be unprecedented. However, if spent prudently in a phased manner over nearly three decades, the sector-level outlay should be manageable. In the US, for example, we estimate decarbonization capital investments will likely exceed the $200 billion (source: the American Chemistry Council) invested in the sector over the past decade or so following the availability of shale gas. The US chemical sector, which spent $33 billion in total capital in 2022, managed that decadelong $200 billion outlay without meaningful credit consequences. At this point, we do not forecast a capital investment amount. Chemical companies have not yet decided on the components for decarbonization, and the costs and availability of related technology also remain uncertain. For example, extrapolating currently expensive equipment such as electrolyzers — critical in the production of hydrogen — over the next three decades results in unreasonably high capital cost estimates. It is plausible to suggest that electrolyzers will become cheaper as mass production begins; the IEA assumes a 65% decline through 2050. However, estimating future pricing requires another layer of assumptions. When exactly will demand increase, and by how much, remains unknown. This uncertainty creates more room for forecasting errors. But we can learn something by looking at capital outlays in some of the sector’s early movers. Dow Chemicals has announced that it expects to spend $1 billion annually on decarbonization. BASF expects to spend up to €4 billion (about US$4.3 billion at current rates) through 2030. These amounts are within the companies’ recent annual capital spending ranges. Large fertilizer producers have made similar announcements with no suggestion of onerous burdens on cash flows. At this early stage there are some very high, and varied, third-party estimates for sectoral capital spending that in part reflect the uncertainties around decarbonization-related capital spending (table 1). Regulatory risk and demand loss Companies may need to thread a needle in terms of their pace of decarbonization. Moving too slowly risks running afoul of regulations and evolving consumer preferences, but moving too quickly could expose companies to largely untested technology, processes and inputs. Not keeping up with regulatory timelines could mean potential penalties for companies, including taxes in some jurisdictions, and costs related to buying carbon credits or offsets. Changing consumer preferences may be harder to preempt. Companies face the prospect of demand-side decarbonization if chemical customers decarbonize their own operations by shunning chemicals from high greenhouse gas emitters. The recycling of plastics is an example. A meaningful increase in plastics recycling would lower the ethylene life-cycle emissions of plastics users (for example beverage companies and consumer nondurables). But recycling could reduce demand for virgin polymers, hurting some chemical companies. This reduced demand could exacerbate risks created by periodic capacity buildups in petrochemicals. Technological challenges Current technology allows some companies to decarbonize, but only up to a point. For example, the US DOE believes that about 21% of decarbonization will be achieved by unconventional new technologies not actively in current use (see chart 3). The industry will need technology that is still in the research and development stage. Even among the technologies that are advanced or developed, not all are fully available yet for widespread commercial adoption. This creates uncertainty around costs, and the feasibility of decarbonization. Resource constraints Some of the most important components of decarbonization, including carbon capture use and storage (CCUS) and hydrogen solutions, need an infrastructure network. Key requirements include specialized dedicated pipelines to transport carbon dioxide, available sites to sequester carbon underground, and infrastructure to store and transport hydrogen. Chemical companies by themselves may be unable to build this infrastructure and so may depend on partnering with external agencies. We also anticipate that specialized labor, equipment, contractors, land for pipelines and other uses such as biomass, and geological areas suitable for sequestration will be among the variables in short supply as the chemical industry competes with other sectors to implement decarbonization solutions. The cost and availability of funding for decarbonization projects could become a constraint, especially beyond highly rated players with strong balance sheets. While we will continue to monitor this potential risk, it has not yet been factored into our current credit ratings due to the uncertainties about the timing and quantum of funding needs. There is a precedent of sorts for such constraints. The US chemicals sector invested about $200 billion over a decade or so following the widespread availability of shale gas. Projects faced delays and rising costs caused by issues including shortages of engineering, procurement and construction contractors; specialized professionals such as welders; and materials such as steel. Decarbonization is a much larger endeavor and therefore likely to face even greater constraints. Dependence on external sources Most chemical companies cannot directly control their Scope 2 and downstream Scope 3 emissions. The chemicals sector depends heavily on external electricity suppliers as the largest consumer among all the industrials. Although we expect electric grids in the US and Europe to continue to decarbonize, the chemicals sector does not control the timing of this decarbonization. In our view, synchronizing the chemicals sector’s own plans with those of electricity providers will be important. For example, the use of hydrogen as fuel without the decarbonization of the grid will actually increase emissions from the chemicals sector. It is only when the chemicals sector uses hydrogen produced by low-carbon electricity that hydrogen becomes an effective component of chemicals decarbonization. The sector also depends on a swath of diverse customers and has little control over how its products are used. The chemicals sector sells into many different industries; in most instances its products are not sold directly to end-use consumers but instead to other industrial sectors. Developing relationships with energy, fuel and feedstock providers, and with the post-sale value chain, will become key to chemical companies' decarbonization. Changes to competitive position Competitive advantages from the US’ access to conventional low-cost hydrocarbon feedstock and fuel might fade as their usage diminishes. If this happens, replacing cheaper energy and fuel sources (for example, natural gas and natural gas liquids) with potentially costlier low-carbon alternatives could weaken a key competitive factor for the US chemicals industry. US producers will then have to find a way to produce low carbon fuels or decarbonize in other ways that retain their cost-competitiveness. We will monitor projects such as The Dow Chemical Co.’s announced net-zero project in Alberta to track the effectiveness of this and other early large-scale attempts to decarbonize while retaining competitive advantages. For Now, Mitigants Should Keep Credit Risks Manageable While we see potential risks for chemical companies, in our view the sector's credit risks are currently manageable under existing regulatory policies. New environmental policies and regulations are giving companies time to plan, evaluate options and grapple with the risks that will peak mostly over the longer term. We also think decarbonization creates opportunities for new products, applications and markets for some chemical companies. Below, we identify key mitigants that we think manage the potential risks, at least to 2030. Given the familiarity of some chemical companies with certain decarbonization technologies and solutions (such as hydrogen), we think chemical companies might be relatively better placed to implement some mitigants compared to sectors less familiar with these solutions. Five key mitigants are likely to keep credit risks manageable for chemical companies More time to prepare for changes The sector faces some medium-term changes, but we believe the more meaningful changes will be needed beyond 2030 because regulations push out the most onerous decarbonization requirements beyond that year. We base this view on current information and the current policies and regulations that are in place (as we discuss in part one of our research). This gives companies time to evaluate options and determine their decarbonization strategies. Lessons learned from pilot plants Knowledge gained from experimentation could reduce manufacturing disruptions and technology-related risks. For example, many ammonia producers, such as CF Industries Holdings Inc., have announced pilot projects for green ammonia, and some petrochemical companies are trying alternative fuel or heating methods for experimental ethylene crackers. New markets and applications for chemicals Ammonia appears on course to play an important new role as a carrier of hydrogen, opening up new applications for this chemical that is currently mainly used as fertilizer. Chemical companies such as Air Products And Chemicals Inc., Air Liquide S.A., and Linde PLC are already among the largest industrial hydrogen producers. These and other chemical companies that produce hydrogen are likely to benefit from hydrogen's future role. Similar new opportunities, applications and markets will arise for other chemicals from industrial decarbonizing. The ability to pass costs on to customers Chemicals tend to form a very small percentage of consumer-facing end products such as cars, textiles, food and beverage, pharmaceuticals and electronics, among others. A rise in chemical prices would therefore have a limited effect on ultimate consumer prices. In our view, this should support the sector’s ability to pass on cost increases, although companies' market positions will ultimately determine the success of such efforts. Fertilizers have the additional advantage of being key to improving farm yields. Most rated ammonia and petrochemical companies tend to be among the larger players with likely better cost structures and greater pricing power than smaller players. All of this results in our view that most rated ammonia and petrochemical companies with favorable market positions should be able to pass on at least some decarbonization-related costs to customers. One way they could do so is by charging a premium for a low-carbon substitute to an existing high-carbon product. This would be similar to current price premiums for recycled plastics over virgin plastic. Collaborations cutting back risks and costs Chemical companies can enter into collaborations with oil companies for the storage of carbon while sharing decarbonization incentives or subsidies with their partners. We think innovative financing and operating structures could be created to share operating costs for hydrogen hubs, carbon pipelines and similar infrastructure. Such structures could involve joint ventures or collaborations among chemical companies in a geographic region or between chemical companies and infrastructure providers. For example, natural gas providers could team up with ammonia producers to share costs (and incentives) for CCUS projects. The chemical sector could mitigate the cost and technological risks of certain solutions better than some other sectors It may be easier for the chemical sector to adapt to some decarbonization technologies and solutions. Some chemical processes lend themselves to decarbonization relatively easily, which may help contain risks for the sector or even present new opportunities, especially compared to other sectors: Some chemical production processes might be especially suitable for electrification. This could reduce technological challenges with the electrification of some chemical processes. The sector consumes more heat energy than other forms of industrial production. Unlike some other sectors, such as cement or steel, a large proportion of chemical process heat is at low temperatures (see chart 6). Nearly 60% of heat energy is for chemical processes that require less than 150 degrees C, making these processes especially suitable for electrification. Higher temperatures can also be electrified but present greater challenges because commercially available technologies are relatively few. The chemical sector’s familiarity with hydrogen should help partly offset risks related to its use. The sector is already the largest producer and consumer of hydrogen, accounting for over half the global demand for hydrogen (see chart 7). The sector mainly uses hydrogen as feedstock or part of the chemical process in ammonia and methanol production. This creates at least two avenues for decarbonization: the use of decarbonized hydrogen as feedstock, reducing carbon emissions at the highest greenhouse gas emitting plants in the sector, and the broader use of decarbonized hydrogen as energy\/fuel. The sector's familiarity with hydrogen might explain why chemical companies are the among first movers in projects for low-carbon hydrogen. How Decarbonization Could Impact Credit Quality We believe the sector will manage decarbonization credit risks at least until 2030 in the current policy and regulatory landscape. As illustrated in chart 2, we expect the potential influence of chemical decarbonization-related credit-risk drivers will arise or become more pronounced from 2030, which is when decarbonization goals and requirements become more onerous, based on current policies and regulations. Supportive decarbonization policies, including those that lower the cost of decarbonization investment and infrastructure, will help companies manage their risks. Risk mitigants also play an important role in tamping down some risks. We factor climate transition risks — including decarbonization risks based on current information, policies and regulations — into our chemical industry risk scores (see \"Methodology: Industry Risk,\" published Nov. 19, 2013). These remain unchanged at '2' (low risk) for specialty chemicals and '4' (moderately high risk) for commodity chemicals. We will continue to weigh these evolving risks against each company's specific abilities to manage them. Much depends on the choices individual companies make, including selecting from a slew of possible paths to decarbonization. We believe decarbonization-related credit risks are more likely to impact credit quality at lower-rated companies. Decarbonization will likely weigh more on the credit ratios of those that are lower rated. These companies typically have little flexibility in their current capital structures for disruption, cost increases or extra capital outlays. This low flexibility, which we generally reflect in our ratings, might make it harder to access resources such as personnel or funding or to form risk-mitigating partnerships or collaborations. However, many lower-rated companies are relatively low emitters compared to their large bulk commodity counterparts, which could at least partially mitigate risks. To date, we have not taken any rating actions based on our view of decarbonization risks, given our view that the sector's credit risks are currently manageable under existing regulatory policies (see \"Why Climate Risks Are Changing So Few Corporate Ratings,\" published April 12, 2023, on RatingsDirect). Regulatory Frameworks Could Influence Credit Quality We believe two variables in particular will shape how decarbonization risks impact company-level credit quality. The first is companies' absolute greenhouse gas emissions and intensities. The second is the regulatory frameworks under which companies and their assets operate. This latter variable notably includes potential differences in policy priorities and goals and their implementation among various policymakers globally. A supportive regulatory framework could have double-edged effects We believe a supportive regulatory framework could mitigate some decarbonization credit risks; conversely, a less supportive framework might somewhat exacerbate risks. Other things being equal, we believe high emitters in particular will find decarbonization challenges less onerous for their operations in regions with a supportive framework versus emitters in a stringent or punitive framework. For example, under a supportive regulatory framework such as the US Inflation Reduction Act in its current form, high emitters could benefit from tax relief or similar benefits for their decarbonization investments, in our view. This could effectively lower the cost of company decarbonization projects such as CCUS or green hydrogen, helping manage a key risk. Companies could also benefit from lower costs for regional or national infrastructure projects such as pipelines or sequestration sites. Such incentives could spur technology, or research and development investments, essential to lowering costs and increasing the efficacy of decarbonization solutions. Other approaches like a carbon border adjustment mechanism (CBAM), which imposes a penalty on imports produced with a high carbon footprint in jurisdictions whose regulations are not similar to the importing regions' regulations, could protect domestic industry from overseas competition — but that same carbon tax may hurt competitive positions on exports. Divergence in regulatory approaches between the U.S. and Europe With the caveat that regulations will change and evolve, our preliminary view is that the subsidies available to chemical companies in the current US regulatory frameworks benefit US-based chemical producers relative to their European counterparts. Specifically, the US framework, including the Inflation Reduction Act, creates investment incentives via tax relief and other measures for investments in decarbonization. These provisions could lower chemical decarbonization capital and operating costs and encourage technology investments and infrastructure projects in the US relative to Europe. Legislation in Europe, including the European Climate Law and its supporting legislation (such as Fit for 55, which aims for a 55% reduction in greenhouse gas emissions by 2030 compared to 1990) seems to be adopting a different approach. The approach envisages support in different forms, including the development of infrastructure, but with a lower level of outright subsidies than in the US. The EU framework could impose costs on domestic producers but does have supportive elements including mechanisms, such as the CBAM, that could protect regional industry from imports that do not incur comparable additional costs of complying with domestic regulations that are similar to EU regulations. Looking ahead While we see potential risks for chemical companies, in our view the sector's credit risks are currently manageable under existing regulatory policies. Chemical companies that operate and sell their products across global markets will face current and potential future differences in policy priorities, goals and implementation between jurisdictions. Challenges arising from these differences are amplified by the wide disparity in products, processes and supply chains, which also makes regulations difficult to standardize.","filter_flag":1}
{"title":"Gul Ahmed ramps up commitment to sustainabilty - Home Textiles Today","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmhvbWV0ZXh0aWxlc3RvZGF5LmNvbS9tYW51ZmFjdHVyaW5nL2d1bC1haG1lZC1yYW1wcy11cC1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmhvbWV0ZXh0aWxlc3RvZGF5LmNvbS9tYW51ZmFjdHVyaW5nL2d1bC1haG1lZC1yYW1wcy11cC1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsdHkv0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LmhvbWV0ZXh0aWxlc3RvZGF5LmNvbS9tYW51ZmFjdHVyaW5nL2d1bC1haG1lZC1yYW1wcy11cC1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsdHkv0gEA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmhvbWV0ZXh0aWxlc3RvZGF5LmNvbS9tYW51ZmFjdHVyaW5nL2d1bC1haG1lZC1yYW1wcy11cC1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsdHkv0gEA?oc=5\" target=\"_blank\">Gul Ahmed ramps up commitment to sustainabilty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Home Textiles Today<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Gul Ahmed ramps up commitment to sustainabilty - Home Textiles Today","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmhvbWV0ZXh0aWxlc3RvZGF5LmNvbS9tYW51ZmFjdHVyaW5nL2d1bC1haG1lZC1yYW1wcy11cC1jb21taXRtZW50LXRvLXN1c3RhaW5hYmlsdHkv0gEA?oc=5\" target=\"_blank\">Gul Ahmed ramps up commitment to sustainabilty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Home Textiles Today<\/font>","source.href":"https:\/\/www.hometextilestoday.com","source.title":"Home Textiles Today","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"New York – Gul Ahmed, the largest vertical mill in Pakistan and one of the largest vertical mills in the world, will be expanding upon its aggressive sustainability efforts at the New York Home Fashions Market. The company is showcasing its sustainability initiatives, which stretch back more than two decades, making it one of the first home textiles companies in the world to focus on this key fundamental. At market it will highlight its new eco-friendly packaging options, which offer more fabric and sustainable choices and eliminate much of the plastic commonly used for home textiles product packages. “At Gul Ahmed, we have always viewed sustainability as a crucial component of our business operations,” said Zaki Bashir, CEO of the global supplier. “We firmly believe that the economic growth of our company should not come at the cost of the environment.” Gul Ahmed now sources the majority of all its cotton, polyester and other fibers from sustainable sources, and is working to increase the circularity and recycling of water within its operations. “Looking forward, we have committed to achieving Net Zero Emission and Zero Liquid Discharge,” Bashir said. “In the coming years we plan to fulfill a significant level of our energy requirement from renewable sources while improving energy efficiency throughout all our products.” Industry veteran Ahmed Fraz, who joined Gul Ahmed in January to head up its North American operations, said the company “hopes that our efforts towards sustainability will inspire others to adopt sustainable practices, and we remain committed in our sustainability journey and ensuring maximum value to our stakeholders while preserving the planet for the generations to come.” The company’s New York showroom is located at 267 Fifth Avenue, 2nd floor.","filter_flag":1}
{"title":"Best Buy SWOT Analysis (2024) - Business Model Analyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2Jlc3QtYnV5LXN3b3QtYW5hbHlzaXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2Jlc3QtYnV5LXN3b3QtYW5hbHlzaXMv0gEA?oc=5","id":"CBMiOGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2Jlc3QtYnV5LXN3b3QtYW5hbHlzaXMv0gEA","guidislink":false,"published":"Fri, 01 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=244, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2Jlc3QtYnV5LXN3b3QtYW5hbHlzaXMv0gEA?oc=5\" target=\"_blank\">Best Buy SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best Buy SWOT Analysis (2024) - Business Model Analyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2Jlc3QtYnV5LXN3b3QtYW5hbHlzaXMv0gEA?oc=5\" target=\"_blank\">Best Buy SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","source.href":"https:\/\/businessmodelanalyst.com","source.title":"Business Model Analyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Best Buy is an American multinational consumer electronics retailer headquartered in Richfield, Minnesota. It was founded by Richard M. Schulze and James Wheeler, who opened an audio specialty store called Sound of Music in 1966. In 1983, the company rebranded under its current name, emphasizing consumer electronics. Best Buy has over 1,000 stores in the United States, Canada, and Mexico. The company sells various consumer electronics, including televisions, computers, smartphones, appliances, and home theater systems, as well as offers various services, such as Geek Squad technical support, financing, and in-home installation. Best Buy has been a successful company, with over $46 billion in revenue in 2022. However, the company has also faced some challenges, such as the rise of online retailers and the decline of brick-and-mortar stores. Recently, it has changed its business model to adapt to the changing retail landscape — Best Buy has invested in its online presence, expanded its product offerings, and opened smaller, more convenient stores. They have also focused on providing a better in-store experience for customers, with features such as interactive product demos and knowledgeable sales associates. That being said, the company has remained a significant player in the consumer electronics industry, with a strong brand reputation, offering various products and services that appeal to a wide range of customers. Best Buy is well-positioned for continued growth in the years to come. Below, there is a detailed Best Buy SWOT Analysis to better understand its strengths, weaknesses, opportunities, and threats in the global market. Best Buy Strengths With its evolving retail model and smaller, convenient stores, Best Buy offers various products and services. Below, there are some of its strengths: Strong Brand Recognition Best Buy’s brand recognition is a significant advantage over smaller competitors. 93% of consumers in the United States know the Best Buy brand, which is very high brand awareness. The brand is associated with trust, expertise, and value, as evident in the company’s high customer satisfaction ratings. It also has strong online and offline channels, which is vital in today’s retail environment. Additionally, Best Buy’s brand constantly evolves as the company looks for new ways to engage with customers and build brand loyalty, making it easier to attract new customers. When consumers are familiar with a brand, they are more likely to trust and do business with it. Sustainability initiatives The company has several initiatives in place to reduce its environmental impact, including reducing energy consumption, reducing waste, using sustainable materials, and supporting renewable energy. It has implemented many energy-efficiency measures in its stores, such as LED lighting and motion sensors, which have helped the company to reduce its energy consumption by 18% since 2010. Furthermore, Best Buy uses sustainable materials in its products, such as recycled plastics and cardboard, in its packaging. These sustainability initiatives help improve its reputation and attract customers concerned about the environment. In addition, Best Buy also supports some other CSR initiatives, making it so well-respected. Strategic acquisitions Best Buy’s strategic acquisitions have been a key part of the company’s growth strategy. The company has acquired several businesses in recent years, including Magnolia Hi-Fi, Pacific Sales Kitchen and Bath Centers, and Great Call, which have helped Best Buy expand its product offerings into new categories, reach new customers, and compete more effectively with online retailers. These acquisitions have been focused on expanding its product offerings into new categories. For example, in addition to Great Call, the company has also acquired Magnolia Hi-Fi, a retailer of high-end audio and video products, and Pacific Sales Kitchen and Bath Centers, a retailer of high-end kitchen and bath appliances. These acquisitions have helped Best Buy reach new customers interested in these products. Reliable Customer Service Best Buy’s customer service is known for being helpful, knowledgeable, and friendly, which is evident in the company’s high customer satisfaction ratings. Its customer service is available through a variety of channels, including in-store, online, and over the phone, making it easy for customers to get the help they need, no matter how they prefer to shop. Best Buy’s Geek Squad is a team of highly trained technicians who can provide technical support for customers’ electronics and help with everything from setting up a new device to fixing a broken one. For example, in 2019, Best Buy was ranked #1 in customer satisfaction for electronics retailers by J.D. Power, which is a testament to Best Buy’s commitment to providing excellent customer service. Product Variety Another strength of Best Buy is its product variety. The company offers a wide range of products, from TVs and laptops to refrigerators and washing machines, giving customers a one-stop shop for all their electronics and appliance needs. Its product variety is constantly expanding, so customers can be sure to find the latest and greatest technology. For example, in the electronics category, Best Buy offers a wide range of TVs, laptops, smartphones, tablets, and cameras. In the appliances category, it provides a wide range of refrigerators, washers, dryers, dishwashers, and ovens. This wide range of products makes it easy for customers to find what they need and compare prices and find the best deal. Effective Omnichannel The brand’s effective omnichannel presence allows customers to shop seamlessly across all channels, in-store, online, or on the phone. For example, customers can browse products on Best Buy’s website and pick them up in-store. They can chat with a sales associate online or over the phone and have the product shipped to their home. This seamless integration of channels makes it easy for customers to find the products they want, no matter how they prefer to shop. Best Buy’s omnichannel presence is also supported by its mobile app, which allows customers to browse products, check inventory, and make purchases, allowing the company to reach a wider audience and provide customers with a more convenient shopping experience. Cost Management Strategies Best Buy has a number of cost management strategies in place to keep its prices competitive, including negotiating with suppliers, controlling inventory, and using efficient supply chain management practices. By negotiating with suppliers, Best Buy can secure lower prices on the products it sells, helping the company to keep its prices competitive, which in turn helps the company to attract and retain customers. By controlling inventory, Best Buy avoids overstocking products, which can lead to unnecessary costs, enabling the company to save money. This efficient supply chain management practice ensures that products are delivered to stores promptly and cost-effectively. Global Presence Best Buy has a global presence, with stores in several countries around the world, giving the company access to new markets and customers. For example, it has stores in Canada, Mexico, China, and the United Kingdom, allowing Best Buy to reach a wider audience and grow its business. In addition to its physical stores, the company also has an online presence that will enable customers to shop from anywhere in the world. This online presence has helped Best Buy to reach even more customers and to expand its reach into new markets. Overall, this global presence is a key part of the company’s success. Active social media presence With over 20 million followers on Facebook, Twitter, and Instagram, Best Buy uses social media to connect with customers, promote its products, and provide customer service. Its social media team is known for engaging content and willingness to interact with customers. The company often posts videos, photos, and articles about technology trends. It also runs contests and giveaways to engage with customers. This active social media presence has helped the company to connect with a broader audience and to build brand loyalty, making it a valuable asset for the company. Best Buy Weaknesses Best Buy is a leading electronics retailer, but it faces some challenges, including competition from online retailers, declining sales of traditional electronics, high debt levels, and a lack of innovation. Below, there are more details: High debt levels Best Buy’s high debt levels are a major weakness. The company has a debt-to-equity ratio of over 2. This means that for every $2 of assets that Best Buy owns, it owes $1 in debt, making it difficult for Best Buy to weather an economic downturn. If sales decline, the company may have trouble making its debt payments. This could lead to bankruptcy. In addition, Best Buy’s high debt levels make it difficult for the company to invest in new growth opportunities. The company is paying a lot of interest payments, leaving less money available for investing in new products, stores, and marketing. This could make it difficult for Best Buy to compete with other retailers investing more in growth. Declining sales of traditional electronics The company’s sales of traditional electronics, such as TVs and laptops, have declined in recent years due to the rise of smartphones and tablets. Smartphones and tablets have become the primary devices for watching videos, browsing the internet, and playing games, leading to declining demand for traditional electronics. If Best Buy wants to remain competitive in the future, it will need to find ways to adapt to the changing consumer landscape. The company will need to focus on selling the latest and greatest smartphones and tablets, and it will need to invest in its online sales channels. High Prices Best Buy’s prices are often higher than those of online retailers, making it difficult for the company to compete. There are a few reasons why Best Buy’s prices are often higher than those of online retailers. First, Best Buy has to pay for running physical stores, such as rent, utilities, and employee salaries. Online retailers don’t have these costs so they can offer lower prices. Second, Best Buy often offers more services than online retailers. For example, Best Buy offers in-store pickup, free shipping, and extended warranties, which add to the cost of the product but can also be valuable to customers. As such, the company needs to make its products more affordable. Outdated stores Many of Best Buy’s stores are outdated and need remodeling, creating a negative impression for customers. For example, some of Best Buy’s stores have dated décor and may not have the latest and best electronics, making the customers feel like Best Buy is not a modern retailer. Also, outdated stores can be challenging to navigate. Customers may have trouble finding the products they are looking for, and they may not be able to get help from employees. This can lead to a frustrating shopping experience. Therefore, the company has been remodeling some of its stores and planning to do more in the future. Stiff Competition Best Buy faces stiff competition from online retailers such as Amazon and Newegg. These retailers offer a more comprehensive selection of products and lower prices than Best Buy, leading to a decline in Best Buy’s sales in recent years. There are a few reasons why online retailers can offer lower prices. First, online retailers don’t have the exact overhead costs as brick-and-mortar stores. They don’t have to pay for rent, utilities, or employees. Second, online retailers can sell products in bulk, which gives them more negotiating power with suppliers. As such, the company has been expanding its online sales channels, and it is working to lower its prices. Best Buy Opportunities One major opportunity Best Buy can leverage is to expand into new markets to reach more customers and increase sales. Below, there are more details: Invest in new technologies Best Buy could invest in new technologies, such as artificial intelligence (AI) or virtual reality (VR). This would allow the company to provide new and innovative products and services to its customers. For example, AI could be used to personalize the shopping experience for customers by analyzing customer purchase history and browsing behavior to recommend products likely to interest each customer. It could also be used to answer customer questions, troubleshoot problems, and provide support, creating a more personalized and engaging shopping experience for its customers. VR could be used to create immersive product demonstrations that allow customers to experience products before they buy them. Entering new product categories The company could enter new product categories, such as home appliances or smart home devices, allowing it to reach new customers and grow its sales. For example, Best Buy could partner with appliance manufacturers to offer a wider range of products or create its line of smart home devices. By entering new product categories, Best Buy could diversify its business and become a one-stop shop for all electronics and home appliances. Also, it could partner with other companies to offer a broader range of products or create its line of products. For example, Best Buy could partner with appliance manufacturers to offer a wider range of refrigerators, ovens, and washing machines. Improving its supply chain Another opportunity the company can leverage is to improve its supply chain to ensure that it has the products that customers want when they want them. This would help the company to reduce stockouts and improve customer satisfaction. For example, Best Buy could use data analytics to track customer purchase history and demand patterns. This information could then be used to optimize inventory levels and ensure that the right products are in the right stores at the right time. By doing this, Best Buy could reduce stockouts, improve customer satisfaction, and save money, helping the company to remain competitive in the retail industry. Focusing on operational efficiency Also, the brand needs to focus on operational efficiency to reduce costs and improve profitability by streamlining processes, reducing waste, and optimizing inventory levels. For example, it could review its supply chain to identify areas where costs can be reduced. The company could also implement new technologies to automate tasks and improve efficiency. It could also view its business processes to identify areas where they can be simplified or made more efficient. Best Buy could optimize its inventory levels to ensure it has the right amount of products in the right places at the right time, involving data analytics to track demand patterns and adjust inventory levels accordingly. Investing in marketing and advertising The brand can invest in marketing and advertising to reach more customers and promote its products and services, which could be done through traditional channels, such as TV and print advertising, or digital channels, such as social media and search engine marketing. For example, it could create a new advertising campaign that targets millennials or Gen Z consumers. The company could also use social media to connect with customers and promote its products and services. Additionally, Best Buy could use search engine marketing to ensure its website appears high in search results for relevant keywords. Best Buy Threats Best Buy faces threats, including competition from online retailers, changing consumer preferences, and an economic downturn. Here are more details: Counterfeit Products Best Buy faces a severe threat from counterfeit products. Counterfeit electronics products are often of poor quality. They can be difficult to distinguish from genuine products, which can also be sold at a fraction of the price of genuine products, hurting Best Buy’s reputation and sales. In addition, counterfeit products can pose a safety hazard to consumers. To address this threat, the company has implemented several measures, including educating employees about counterfeit products, using anti-counterfeiting technology, and working with law enforcement. By taking these measures, Best Buy is working to protect its customers and its reputation from the threat of counterfeit products. Disruption from New Technologies New technologies, such as artificial intelligence and virtual reality, could disrupt the electronics retail industry. These technologies could make it easier for consumers to shop for electronics online and create new ways for consumers to interact with electronics. If Best Buy cannot adapt to these new technologies, it could lose market share to other, more innovative retailers. However, the company is taking steps to adapt. For example, it has invested in artificial intelligence and virtual reality technologies. It is also working to create a more omnichannel experience for its customers to shop online, in-store, or through a combination of both channels. Labor Shortages Best Buy faces labor shortages, making it challenging to find qualified employees in its stores. This could hurt the company’s customer service and ability to meet demand. For example, if Best Buy does not have enough employees, it may have to close stores or reduce hours, leading to longer wait times for customers and decreased sales. To address this challenge, Best Buy offers higher wages and more benefits to attract and retain employees. It also invests in training programs to help employees develop their skills to succeed. Technology obsolescence Technology products become obsolete quickly, which means that Best Buy has to refresh its inventory constantly. This can be a challenge, as it requires the company to invest in new products and dispose of old ones. For example, a new smartphone model may be released every year. The company has to decide whether to keep selling the older model or discontinue it. If Best Buy keeps selling the older model, it may not be able to compete with other retailers that are selling the newer model. However, if it discontinues the older model, it may lose customers unwilling to buy the newer model. To address this challenge, Best Buy is keeping a close eye on the latest trends in technology, helping it determine which products will likely become obsolete quickly and which will likely have a longer lifespan. Conclusion Best Buy is a well-established retailer with a strong brand reputation. The company has been in business for over 40 years and has over 1,000 stores in the United States and Canada. It is known for its wide selection of products, competitive prices, and excellent customer service. In recent years, Best Buy has faced increasing competition from online retailers such as Amazon. However, the company has responded by investing in its online presence and expanding its product offerings. Best Buy also focuses on providing a more personalized shopping experience for its customers. The company is a well-positioned retailer with a bright future. It has a strong brand reputation, a wide selection of products, and competitive prices. It is also focused on providing a personalized shopping experience for its customers, which should help the company continue to grow in the years to come.","filter_flag":1}
{"title":"Cisco Unveils Next-Generation Environmental Sustainability Strategy - CXOToday.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA","guidislink":false,"published":"Fri, 22 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=265, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5\" target=\"_blank\">Cisco Unveils Next-Generation Environmental Sustainability Strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cisco Unveils Next-Generation Environmental Sustainability Strategy - CXOToday.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5\" target=\"_blank\">Cisco Unveils Next-Generation Environmental Sustainability Strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","source.href":"https:\/\/cxotoday.com","source.title":"CXOToday.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Cisco is changing how it operates its business, engages with suppliers, and helps customers and communities. The strategy focuses on the transition to clean energy, evolving the business to circular, and investing in resilient ecosystems. Cisco is already making strides with technology solutions that enable energy efficiency and circular economy. Cisco, a global leader in technology and networking solutions, has announced the launch of “The Plan for Possible,” an ambitious and comprehensive environmental sustainability strategy that aims to build a regenerative future. This year is on track to being the hottest year on record. There is a critical need to limit the temperature rise to no more than 1.5C to avoid catastrophic changes to the climate, and we are currently at 1.1C. The world needs a sustainable future: one in which we can phase out our reliance on fossil fuels, address a century’s worth of pollution, provide economic opportunity to communities around the world, and align our activities with the physical boundaries of our Earth. The progress we make in this decade will be critical for future generations. Acknowledging these pressing issues, Cisco is going beyond the “doing no harm” approach and building a holistic strategy to environmental sustainability. The “plan for possible” includes how the company operates its business, how it engages with suppliers, and how it helps customers and communities reduce their environmental impacts and adapt to a changing world “The world is connected, but we’re suffering from new forms of disconnection: from each other and our health, and from the health of the planet. Fortunately, technology can help us rethink operating and business models in ways that are digital and low carbon, but also improve individual wellbeing and create opportunities for communities” said Mary de Wysocki, Chief Sustainability Officer at Cisco. “With Cisco technology, we are helping power the world with affordable clean energy through digitizing smart grids and smart buildings, we are designing out waste by re-building products from used ones, and we are using the Internet of Things (IoT) to protect the world’s biodiversity.” Priority 1: Transition to clean energy To power the world with renewables, the grid requires updated digital infrastructure to connect diverse, decentralized sources of clean energy. But even as the world electrifies, there is a need to simultaneously reduce the amount of energy used by a connected economy. As a part of this priority, Cisco has set a goal to reach Net Zero across its value chain by 2040, which includes both its suppliers and our customers’ use of energy. The company is tackling this with leading energy efficiency innovation, connecting clean energy and digitizing the grid​ and collaborating with customers, partners, and suppliers to accelerate the energy transition. With connectivity at the heart of digitalization, Cisco is in a unique position to equip businesses with technology solutions that help them achieve their sustainability goals. This includes the Silicon One chip, Cisco’s networking device for AI processing which reduces energy consumption while increasing bandwidth, and Universal Power Over Ethernet (PoE) to optimize energy use for smart buildings. Cisco also is helping its supply chain set GHG reduction targets. * Priority 2: Evolve the business to circular Cisco aims to transform its business to extend the useful life of its products and provide ongoing services. It aims to do so by adopting and scaling its business models to extend the product value and reduce environmental impacts​, investing in technology incubation to be at pace with environmental science​ and championing a digital, nature-positive value chain. The company is on track to achieving its goal of incorporating circular design principles into 100 percent of new products and packaging by 2025. Also, it launched several programs that enable circularity in its value chain: The Cisco Takeback and Reuse Program, which lets customers return hardware that has reached end-of-use, at no cost. Green Pay, a circular IT payment solution, that eliminates upfront hardware acquisition costs, offers predictable payments for 5 years, and an incentive of 5 percent. As part of this program, Cisco recovers products free of charge so these can be reused or recycled. Remanufacturing devices through Cisco Refresh to give them a new life for our business and planet. Priority 3: Invest in resilient ecosystems Recognizing the importance of resilient ecosystems and investing in regenerative solutions, Cisco sets its third priority on enabling communities to adapt to climate realities, cultivating talent for the regenerative economy, and deploying technology to protect and restore ecosystems. In 2021, Cisco Foundation committed $100 million investment over ten years in climate solutions that already draw down the carbon in the atmosphere and help regenerate depleted ecosystems. All of Cisco’s strategic priorities are underpinned by strong governance, embedding sustainability into its operations with the intent to maintain alignment with scientific advancements. “Sustainability is a top priority for the government, with India pledging a climate pact to become net zero by 2070. As a trusted technology partner to businesses across the country, we are committed to innovate with our customers’ sustainability goals in mind, and help businesses make choices with an eye towards a more sustainable digital future,” said Daisy Chittilapilly, President, Cisco India & SAARC. * Cisco has the goal that 80% of Cisco component, manufacturing, and logistics suppliers by spend have a public, absolute GHG emissions reduction target by FY25. We are at 78% as of FY22.","filter_flag":1}
{"title":"Emergence of Trends in North America Doors and Windows Market: Antimicrobial Protection and Energy Efficiency ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xMi8yNzQxODE0LzI4MTI0L2VuL0VtZXJnZW5jZS1vZi1UcmVuZHMtaW4tTm9ydGgtQW1lcmljYS1Eb29ycy1hbmQtV2luZG93cy1NYXJrZXQtQW50aW1pY3JvYmlhbC1Qcm90ZWN0aW9uLWFuZC1FbmVyZ3ktRWZmaWNpZW5jeS1Qcm9wZWwtR3Jvd3RoLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xMi8yNzQxODE0LzI4MTI0L2VuL0VtZXJnZW5jZS1vZi1UcmVuZHMtaW4tTm9ydGgtQW1lcmljYS1Eb29ycy1hbmQtV2luZG93cy1NYXJrZXQtQW50aW1pY3JvYmlhbC1Qcm90ZWN0aW9uLWFuZC1FbmVyZ3ktRWZmaWNpZW5jeS1Qcm9wZWwtR3Jvd3RoLmh0bWzSAQA?oc=5","id":"CBMiyQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xMi8yNzQxODE0LzI4MTI0L2VuL0VtZXJnZW5jZS1vZi1UcmVuZHMtaW4tTm9ydGgtQW1lcmljYS1Eb29ycy1hbmQtV2luZG93cy1NYXJrZXQtQW50aW1pY3JvYmlhbC1Qcm90ZWN0aW9uLWFuZC1FbmVyZ3ktRWZmaWNpZW5jeS1Qcm9wZWwtR3Jvd3RoLmh0bWzSAQA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xMi8yNzQxODE0LzI4MTI0L2VuL0VtZXJnZW5jZS1vZi1UcmVuZHMtaW4tTm9ydGgtQW1lcmljYS1Eb29ycy1hbmQtV2luZG93cy1NYXJrZXQtQW50aW1pY3JvYmlhbC1Qcm90ZWN0aW9uLWFuZC1FbmVyZ3ktRWZmaWNpZW5jeS1Qcm9wZWwtR3Jvd3RoLmh0bWzSAQA?oc=5\" target=\"_blank\">Emergence of Trends in North America Doors and Windows Market: Antimicrobial Protection and Energy Efficiency ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Emergence of Trends in North America Doors and Windows Market: Antimicrobial Protection and Energy Efficiency ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xMi8yNzQxODE0LzI4MTI0L2VuL0VtZXJnZW5jZS1vZi1UcmVuZHMtaW4tTm9ydGgtQW1lcmljYS1Eb29ycy1hbmQtV2luZG93cy1NYXJrZXQtQW50aW1pY3JvYmlhbC1Qcm90ZWN0aW9uLWFuZC1FbmVyZ3ktRWZmaWNpZW5jeS1Qcm9wZWwtR3Jvd3RoLmh0bWzSAQA?oc=5\" target=\"_blank\">Emergence of Trends in North America Doors and Windows Market: Antimicrobial Protection and Energy Efficiency ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Dublin, Sept. 12, 2023 (GLOBE NEWSWIRE) -- The \"Doors and Windows Market in North America - Industry Outlook & Forecast 2023-2028\" report has been added to ResearchAndMarkets.com's offering. The North America doors and windows market is projected to expand from $65 billion in 2023 to $84.96 billion in 2028, showcasing a Compound Annual Growth Rate (CAGR) of 4.56% during the period from 2022 to 2028. Market Trends & Drivers Antimicrobial Protection: The integration of antimicrobial films on doors and windows to prevent the growth of germs and bacteria is gaining traction. Amid the COVID-19 pandemic, the demand for antimicrobial films on doors and windows has surged, particularly in the healthcare sector. This trend enhances safety by reducing viral transmission through surfaces. Focus on Energy Efficiency: Governments in the region are incentivizing energy-efficient building practices. Initiatives and regulations promoting the adoption of energy-efficient doors and windows are contributing to market growth. Quality doors and windows not only improve insulation but also enhance air quality and reduce exposure to extreme weather conditions. Industry Restraints Raw Material Costs: The fluctuating prices of raw materials, such as plastic, timber, and aluminum, contribute significantly to manufacturing expenses. The volatility of raw material costs poses a challenge to profit margins for market vendors, especially with the increasing cost of labor and competition from international manufacturers. Segmentation Insights Insights by Product Doors (End-user, Type, Material, Installation, Operation) Windows (End-user, Type, Material, Installation, Operation) Insights by End-User Residential (Doors, Windows) Non-Residential (Doors, Windows) Insights by Type Exterior (Doors, Windows) Interior (Doors, Windows) Insights by Material Metal (Doors, Windows) Plastic (Doors, Windows) Wood (Doors, Windows) Glass (Doors, Windows) Composite (Doors, Windows) Other (Doors, Windows) Insights by Installation Replacement (Doors, Windows) New Construction (Doors, Windows) Insights by Operation Manual (Doors, Windows) Automatic (Doors, Windows) Competitive Landscape Prominent Players: JELD-WEN Anderson Windows & Doors Pella Cornerstone Building Brands Other Notable Vendors: Crystal Windows Masco Corporation Optimum Window All Seasons Window & Door EXTECH Bear Wood Windows Protective Structures St. Cloud Window Fyre-Tech Harbor All Glass & Mirror ASSA ABLOY dormakaba Group VELUX Alside Harvey Building Products MI Windows and Doors Woodgrain Champion Windows KP Building Products (Farley) Hurd Windows & Doors Kohltech ProVia Quaker Window Products Simpson Door Key Questions Addressed What is the projected size of the North America doors and windows market? What growth rate is expected for the North America doors and windows market? What trends are driving growth in the North America doors and windows market? Who are the key players in the North America doors and windows market? What is the estimated shipments number by 2028 in the North America doors and windows market? Which country holds the largest market share in the North America doors and windows market? Market Dynamics Market Opportunities & Trends Integration of Photovoltaics in Fenestration Growth in US Home Improvement Industry Use of Switchable\/Smart Glass Increase in Use of Antimicrobial Films Market Growth Enablers Rising Demand for Single Homes Rising Focus on Energy-Efficient Buildings Increasing Innovation in Doors & Windows Rising Commercial & Infrastructural Investments Market Restraints Political Disturbance on Supply of Raw Materials Emergence of Market Softening Due to Fragmentation Key Attributes: Report Attribute Details No. of Pages 249 Forecast Period 2023 - 2028 Estimated Market Value (USD) in 2023 $65 Billion Forecasted Market Value (USD) by 2028 $84.96 Billion Compound Annual Growth Rate 4.5% Regions Covered North America For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/huo20t About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"Cannes Yachting Festival: Ferretti Group reveals 2023-2025 product strategy - Boat International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmJvYXRpbnRlcm5hdGlvbmFsLmNvbS9ib2F0LXByby9uZXdzL2Nhbm5lcy15YWNodGluZy1mZXN0aXZhbC1mZXJyZXR0aS1ncm91cC1wcm9kdWN0LXN0cmF0ZWd50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmJvYXRpbnRlcm5hdGlvbmFsLmNvbS9ib2F0LXByby9uZXdzL2Nhbm5lcy15YWNodGluZy1mZXN0aXZhbC1mZXJyZXR0aS1ncm91cC1wcm9kdWN0LXN0cmF0ZWd50gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LmJvYXRpbnRlcm5hdGlvbmFsLmNvbS9ib2F0LXByby9uZXdzL2Nhbm5lcy15YWNodGluZy1mZXN0aXZhbC1mZXJyZXR0aS1ncm91cC1wcm9kdWN0LXN0cmF0ZWd50gEA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmJvYXRpbnRlcm5hdGlvbmFsLmNvbS9ib2F0LXByby9uZXdzL2Nhbm5lcy15YWNodGluZy1mZXN0aXZhbC1mZXJyZXR0aS1ncm91cC1wcm9kdWN0LXN0cmF0ZWd50gEA?oc=5\" target=\"_blank\">Cannes Yachting Festival: Ferretti Group reveals 2023-2025 product strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Boat International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cannes Yachting Festival: Ferretti Group reveals 2023-2025 product strategy - Boat International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmJvYXRpbnRlcm5hdGlvbmFsLmNvbS9ib2F0LXByby9uZXdzL2Nhbm5lcy15YWNodGluZy1mZXN0aXZhbC1mZXJyZXR0aS1ncm91cC1wcm9kdWN0LXN0cmF0ZWd50gEA?oc=5\" target=\"_blank\">Cannes Yachting Festival: Ferretti Group reveals 2023-2025 product strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Boat International<\/font>","source.href":"https:\/\/www.boatinternational.com","source.title":"Boat International","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Ferretti Group has announced plans to release more than 20 new products between 2023 and 2025, after having successfully launched 25 new models in the previous three-year period. The Italian shipyard used the occasion of the Cannes Yachting Festival to supply further insight into its future product stategy, which is set to focus more heavily on yachts of a larger size range to align with current market trends. The company also reiterated its commitment to researching more sustainable materials, as well as improvements in energy efficiency and onboard fuel consumption.","filter_flag":1}
{"title":"Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum - 日経BP","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5\" target=\"_blank\">Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum - 日経BP","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvc2RnZi82MC_SAQA?oc=5\" target=\"_blank\">Azbil Aims to Provide Comfort-Enhanced Work Environments with Energy Savings | NIKKEI ESG Management Forum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","source.href":"https:\/\/project.nikkeibp.co.jp","source.title":"日経BP","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Energy efficiency in office buildings and factories is vital for countering global warming. In addition to reducing negative impact on the environment, companies must also endeavor to improve productivity, safety, and their workplace atmosphere. The continued development of measurement and control technology is essential for maximizing effective energy use, ensuring that it is possible to achieve both economic growth and the SDGs. Designing Comfort-Oriented Offices to Boost Productivity Augmented reality (AR) visualization of air volume flow from air conditioning vents to create spaces where each individual can feel comfortable (Fujisawa Technology Center new laboratory building) A next-generation air conditioning system is being demonstrated at a café-style workspace at the Azbil Corporation's Fujisawa Technology Center, located in Fujisawa, Kanagawa Prefecture, near Tokyo. One example of the new system's capabilities is that anyone feeling hot can simply use a smartphone app to adjust the airflow from the ceiling vent directed toward them. The lighting has a subtle blue tint in cool zones and orange in warm areas, making it easy to find a comfortable spot. Instead of uniform room temperature control, Azbil aims to create spaces where each person feels comfortable and where active communication flourishes. As a major manufacturer of monitoring and control equipment, the azbil Group operates across a range of fields, including building air conditioning, factory production systems, as well as gas and water utility meters. Since its founding in 1906, the Group has played a pivotal role in industrial modernization through total automation, following its ideal of \"liberating people from drudgery.\" In recent years its customers expect measures to conserve the environment, workplace and workstyle improvements, and advanced production methods. In response, Azbil has redefined its role as a provider of \"human-centered automation.\" In today's climate, business growth requires active adoption of the United Nations Sustainable Development Goals (SDGs), specifically through contributing to creating individual satisfaction and corporate growth. Valve maintenance is essential for stable plant operation. Azbil uses advanced digital technology to further improve valve diagnostic services. Improving productivity and workspace quality while holding energy usage to a reasonable level is easily said, but achieving the ideal balance is no trivial matter. In a large building there might be upward of 100,000 monitoring points, covering elements such as temperature, humidity, and atmospheric pressure. Azbil constantly keeps track of some 4,000 buildings across Japan. The accumulation of big data resulting from this work is analyzed and used in the development of new ideas and methods for saving energy and adding value. One example of this is keeping a constant eye on the enormous valves used at chemical plants through the use of cloud computing services to optimize assessments of ongoing real-time situations to know exactly when maintenance, replacement, and other work is needed. The Group is also working to upgrade its sensor functions while improving analysis capabilities through the use of artificial intelligence. Closely knit connections with its customers' workplaces are another direct link in contributing to the SDGs. Azbil can help clients combat global warming at each step along the way, from setting targets to providing, operating, and maintaining equipment. In 2021, Azbil helped its customers cut carbon dioxide emissions by a total of 2.94 million tons, roughly 160 times the Group's own emissions. The Group plans to extend reductions to 3.4 million tons by 2030, while also ensuring that all its products are designed to be recyclable. Reducing carbon dioxide emissions is an urgent matter that must be tackled across the entirety of the supply chain. For this reason, B2B companies are increasingly important for achieving a sustainable Earth.","filter_flag":1}
{"title":"Key Players Alfa Laval, GEA Group, Kelvion, and SWEP Drive Plate Heat Exchanger Market Competition - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xOC8yNzQ0NjUxLzI4MTI0L2VuL0tleS1QbGF5ZXJzLUFsZmEtTGF2YWwtR0VBLUdyb3VwLUtlbHZpb24tYW5kLVNXRVAtRHJpdmUtUGxhdGUtSGVhdC1FeGNoYW5nZXItTWFya2V0LUNvbXBldGl0aW9uLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xOC8yNzQ0NjUxLzI4MTI0L2VuL0tleS1QbGF5ZXJzLUFsZmEtTGF2YWwtR0VBLUdyb3VwLUtlbHZpb24tYW5kLVNXRVAtRHJpdmUtUGxhdGUtSGVhdC1FeGNoYW5nZXItTWFya2V0LUNvbXBldGl0aW9uLmh0bWzSAQA?oc=5","id":"CBMiqwFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xOC8yNzQ0NjUxLzI4MTI0L2VuL0tleS1QbGF5ZXJzLUFsZmEtTGF2YWwtR0VBLUdyb3VwLUtlbHZpb24tYW5kLVNXRVAtRHJpdmUtUGxhdGUtSGVhdC1FeGNoYW5nZXItTWFya2V0LUNvbXBldGl0aW9uLmh0bWzSAQA","guidislink":false,"published":"Mon, 18 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=261, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xOC8yNzQ0NjUxLzI4MTI0L2VuL0tleS1QbGF5ZXJzLUFsZmEtTGF2YWwtR0VBLUdyb3VwLUtlbHZpb24tYW5kLVNXRVAtRHJpdmUtUGxhdGUtSGVhdC1FeGNoYW5nZXItTWFya2V0LUNvbXBldGl0aW9uLmh0bWzSAQA?oc=5\" target=\"_blank\">Key Players Alfa Laval, GEA Group, Kelvion, and SWEP Drive Plate Heat Exchanger Market Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Key Players Alfa Laval, GEA Group, Kelvion, and SWEP Drive Plate Heat Exchanger Market Competition - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xOC8yNzQ0NjUxLzI4MTI0L2VuL0tleS1QbGF5ZXJzLUFsZmEtTGF2YWwtR0VBLUdyb3VwLUtlbHZpb24tYW5kLVNXRVAtRHJpdmUtUGxhdGUtSGVhdC1FeGNoYW5nZXItTWFya2V0LUNvbXBldGl0aW9uLmh0bWzSAQA?oc=5\" target=\"_blank\">Key Players Alfa Laval, GEA Group, Kelvion, and SWEP Drive Plate Heat Exchanger Market Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Dublin, Sept. 18, 2023 (GLOBE NEWSWIRE) -- The \"Global Plate Heat Exchanger Market Size, Share, Growth Analysis, By Type, By Application - Industry Forecast 2023-2030\" report has been added to ResearchAndMarkets.com's offering. The global Plate Heat Exchanger (PHE) market is on a trajectory of robust growth, with an estimated value of $3.26 billion in 2022 and projected to reach $4.89 billion by 2030. This growth is characterized by a Compound Annual Growth Rate (CAGR) of 5.2% during the forecast period of 2023-2030. Plate Heat Exchangers are specialized devices designed to transfer heat efficiently between two fluids using thin plates with corrugated surfaces. These plates enable the flow of fluids through separate channels without direct contact, making them ideal for various industries such as HVAC, refrigeration, chemical processing, food and beverage processing, and power generation. Plate Heat Exchangers are known for their compact size, efficient heat transfer, and ease of maintenance, with different types available, including gasketed, brazed, and welded designs. Gasketed plate heat exchangers are the most common type, while brazed and welded ones are known for their ability to withstand higher pressures and temperatures. Driving Forces The global Plate Heat Exchanger market is witnessing steady growth driven by several key factors. The demand for energy-efficient solutions, coupled with stringent environmental regulations, is propelling the adoption of Plate Heat Exchangers. The Asia Pacific region, led by countries like China and India, is at the forefront of this growth due to increasing industrialization and the need for energy-efficient solutions. However, the market faces challenges such as intense competition, pricing pressures, and regulatory requirements. Segmental Analysis The market is segmented based on type, application, and region. Gasketed plate heat exchangers dominate the market, thanks to their reliability and efficiency, especially in HVAC, refrigeration, and chemical processing applications. Brazed plate heat exchangers are the fastest-growing segment, known for their resistance to high pressures and temperatures, making them suitable for power generation and industrial processes. Analysis by Application HVAC remains the largest application segment, emphasizing energy efficiency and sustainability. Meanwhile, the food and beverage segment is poised to be the fastest-growing application, driven by pasteurization, sterilization, and cooling processes. Regional Insights The Asia Pacific is currently the dominant and fastest-growing market, particularly in countries like China and India, where energy-efficient solutions are in high demand. In North America, the market thrives due to a well-established industrial base, advanced technology, and a focus on energy efficiency and environmental regulations. Europe, too, shows significant potential, driven by renewable energy adoption. Market Dynamics Market Drivers Technological advancements are a major driving force in the market. Manufacturers are leveraging technologies like computer-aided design (CAD) and computational fluid dynamics (CFD) to optimize plate heat exchangers for improved efficiency and durability. New materials, such as titanium alloys, enhance durability and corrosion resistance. Automation technology streamlines manufacturing processes, reducing costs. The Internet of Things (IoT) enables remote monitoring and control, optimizing performance. The HVAC industry's growing demand for energy-efficient solutions is another driver. Plate heat exchangers contribute significantly by reducing energy consumption in heating and cooling applications. Sustainable building practices further boost demand. Market Restraints Maintenance and cleaning requirements pose challenges, as neglecting these tasks can lead to reduced efficiency, higher energy consumption, and equipment failure. The frequency and extent of maintenance depend on various factors, adding to end-user costs. Competitive Landscape The market is highly competitive, with established companies competing based on innovation, quality, and pricing. Key players include Alfa Laval, GEA Group, Kelvion, and SWEP, among others. Recent Developments In August 2021, Alfa Laval launched the Alfa Laval Compabloc+, a compact heat exchanger for district heating and cooling applications, designed for high efficiency and low operating costs. In July 2021, GEA Group received a €7 million order for plate heat exchangers from a Chinese chemical company for a new chemical plant. In June 2021, Kelvion acquired Sabroe Unidade Para Trocadores De Calor, strengthening its presence in the Brazilian market. In May 2021, SWEP introduced the B649, a new range of heat exchangers for refrigeration applications, known for high efficiency and low refrigerant charge. Key Trends The growing adoption of renewable energy sources, including solar, wind, and geothermal energy, drives the market. Plate heat exchangers are essential in facilitating heat transfer from these sources for electricity generation. As sustainability gains attention, plate heat exchangers play a crucial role in renewable energy systems. Market Analysis The global Plate Heat Exchanger market is poised for significant growth, driven by the adoption of energy-efficient solutions and renewable energy sources. The Asia Pacific leads the charge, with North America and Europe also showing promise. Technological advancements, especially in materials and automation, fuel this growth. However, maintenance and cleaning requirements remain a challenge. A selection of companies mentioned in this report includes Alfa Laval AB Danfoss A\/S GEA Group AG Xylem Inc. Kelvion Holdings GmbH SPX Flow, Inc. Hisaka Works, Ltd. SWEP International AB Tranter, Inc. Barriquand Technologies Thermiques Kaori Heat Treatment Co., Ltd. Funke Warmeaustauscher Apparatebau GmbH API Heat Transfer Inc. Accessen Group Co., Ltd. Mueller Industries, Inc. Sondex A\/S THT Heat Transfer Technology, Inc. Fischer Maschinen und Apparatebau GmbH LHE Co., Ltd. Al-Rushaid Group For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/mt2znu About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"MoComp® traction products: Partnering for mutual success. | Siemens Mobility - Railway Gazette","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5yYWlsd2F5Z2F6ZXR0ZS5jb20vcmdpLWNvbXBhbmllcy9zaWVtZW5zLW1vYmlsaXR5L21vY29tcC10cmFjdGlvbi1wcm9kdWN0cy1wYXJ0bmVyaW5nLWZvci1tdXR1YWwtc3VjY2Vzcy82NDkwOC5zdXBwbGllcmFydGljbGXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5yYWlsd2F5Z2F6ZXR0ZS5jb20vcmdpLWNvbXBhbmllcy9zaWVtZW5zLW1vYmlsaXR5L21vY29tcC10cmFjdGlvbi1wcm9kdWN0cy1wYXJ0bmVyaW5nLWZvci1tdXR1YWwtc3VjY2Vzcy82NDkwOC5zdXBwbGllcmFydGljbGXSAQA?oc=5","id":"CBMiigFodHRwczovL3d3dy5yYWlsd2F5Z2F6ZXR0ZS5jb20vcmdpLWNvbXBhbmllcy9zaWVtZW5zLW1vYmlsaXR5L21vY29tcC10cmFjdGlvbi1wcm9kdWN0cy1wYXJ0bmVyaW5nLWZvci1tdXR1YWwtc3VjY2Vzcy82NDkwOC5zdXBwbGllcmFydGljbGXSAQA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5yYWlsd2F5Z2F6ZXR0ZS5jb20vcmdpLWNvbXBhbmllcy9zaWVtZW5zLW1vYmlsaXR5L21vY29tcC10cmFjdGlvbi1wcm9kdWN0cy1wYXJ0bmVyaW5nLWZvci1tdXR1YWwtc3VjY2Vzcy82NDkwOC5zdXBwbGllcmFydGljbGXSAQA?oc=5\" target=\"_blank\">MoComp® traction products: Partnering for mutual success. | Siemens Mobility<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Railway Gazette<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"MoComp® traction products: Partnering for mutual success. | Siemens Mobility - Railway Gazette","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5yYWlsd2F5Z2F6ZXR0ZS5jb20vcmdpLWNvbXBhbmllcy9zaWVtZW5zLW1vYmlsaXR5L21vY29tcC10cmFjdGlvbi1wcm9kdWN0cy1wYXJ0bmVyaW5nLWZvci1tdXR1YWwtc3VjY2Vzcy82NDkwOC5zdXBwbGllcmFydGljbGXSAQA?oc=5\" target=\"_blank\">MoComp® traction products: Partnering for mutual success. | Siemens Mobility<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Railway Gazette<\/font>","source.href":"https:\/\/www.railwaygazette.com","source.title":"Railway Gazette","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Dr. Dmitry Kuznetsov is the Head of Account Management for Railway Components at Siemens Mobility. He’s a fourth-generation railroad professional who’s worked for Siemens Mobility in various functions since 2012. We asked him about the specifics of the rail components business and what role MoComp plays in these markets. Dmitry, what are four good reasons to choose MoComp rail components that you’d like to highlight for your customers ? From my point of view, it’s very straightforward: The obvious reason is our ability to develop rail components from the system-wide perspective of a vehicle manufacturer. Moreover, we also focus on the long-term relationships with customers as partners, we have a broad range of innovative products – and, as a fourth one, – the quality, which is a given. How important is it to have an extensive product range? The main innovations in rail vehicles today are in one way or another related to rail components. The broader the portfolio, the more ways we can help our customers succeed based on the innovative proposals from auxiliary or traction converters, motors, gear units, brake systems, bogies and pantographs for rail vehicles of all types. These components working together at the system level create new playfields with more opportunities and expand horizons further. We call such offerings “engineered components,” and they allow us to provide increased energy efficiency, better weight management, system integration, and increased reliability to our customers. This is my favorite topic. Partnership is a big word. What does it mean to you? I consider partnerships with our customers to be key part of our daily operations, whether it is tailored, individual manufacturing or platform and standard components. Our philosophy is to focus on long-lasting win-win relationships with customers – only so one can deliver reliably for many years in the rather small railway market, where a lot of the stakeholders have known each other for decades. We collaborate with our partners in a tailored-to-the-task approach that’s separated from our in-house vehicle business. The foundation of this successful approach is our agile Account Management organization, which has its own system engineering and offer management teams dedicated solely to the component business. So customer-specific modifications aren’t a problem? Over the course of our 140-year history of delivering rail components, we’ve learned very well that there’s no one-size-fits-all product. That’s why we conduct our development alongside our customers based on our strong portfolio of modular building-blocks. We call this approach “engineered components through co-creation.” It’s always feasible to create products that optimally match the project and vehicle-specific requirements thanks to all the degrees of freedom in our modular portfolio – and the closer our proximity to the customer, the shorter the iteration steps to this goal. As I mentioned above, this is what I like in our job the most: It’s not a “commodity business” approach but rather it’s rooted in our interactions and dialogue with our partners. In times of limited resources and capabilities on the market, this also helps us minimize risks for our customers. As a global player, you also ensure a close proximity to your local customers. What does that look like? Our motto is “As close as possible.” Close to the customer as well as their market, so that we’re familiar with what really counts in their business, and we can help them achieve efficiency along with all the technology. Partners also value speed – from support to delivery – from a local partner. This may include local production to achieve optimal compliance with the local content requirements that may exist for that vehicle. Fortunately, our offerings are already derived from nine different production sites worldwide, which are complemented by our local competence centers and worldwide service organization. Our customers benefit from this broad footprint both in their “local for local” and “for-global” business, which makes our established portfolio available worldwide. Based on our existing portfolio and project experience, we help our partners open new markets where our technology is already known. This often offers a shared Unique Sales Proposition to the vehicles’ end customers. Does rail component innovation come easy to MoComp? It’s clear that groundbreaking innovations like air-free brakes don’t just fall from the sky. In this example, the development took ten years, and we’re proud to see that Wiener Linien’s X-Wagen is already in passenger operation using these brakes. And the benefits are substantial: Trains become operational and fit for service faster, they’re lighter, and they have a highly simplified compressed-air system on board thanks to brake-by-wire. This means that they save resources and the associated human effort. On the other hand, think about the new silicon-carbide semiconductors. The first applications already demonstrate a new degree of freedom for optimizing the energy efficiency of traction systems, including an increase in energy efficiency in both the inverter itself and in the entire traction system. In a typical regional multi-unit train, this means more than 10 percent increase in efficiency versus a state-of-the-art conventional system! Add to this the fact that the converters may be used to optimize other parameters: for instance, traction motors in motion can be made 10 dB(A) quieter (half the noise to the human ear). As you can see, innovations aren’t just exciting, they also need to be economically efficient and suit the application! And my last question for today: What about your vision for MoComp? Where do you see MoComp in a few years? The team and I are working hard on realizing our shared vision: to make MoComp the number one choice for partners who are looking for reliable traction products and solutions. Since our introduction of the brand and portfolio, the most important benchmark has been reached: gaining the trust of our partners who are rolling stock producers. We hear feedback that makes us deeply proud of the solutions we deliver. And this makes me believe that there’s nothing impossible for a highly engaged team! MoComp’s fields of innovation Air-free brake system in operation on the first line! Permanent-magnet synchronous machines Traction motors with increased rotational speed and optimized gear units Auxiliary and traction converters that use the latest silicon-carbide technology Lightweight bogies Digitalization and monitoring of components – incl. our bogie diagnostics-highlight Highly efficient traction and vehicle control www.siemens.com\/mocomp","filter_flag":1}
{"title":"Hot spot: How Scotland is expanding its heat pump industry - Investment Monitor","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmludmVzdG1lbnRtb25pdG9yLmFpL3Nwb25zb3JlZC9ob3ctc2NvdGxhbmQtaXMtZXhwYW5kaW5nLWl0cy1oZWF0LXB1bXAtaW5kdXN0cnkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmludmVzdG1lbnRtb25pdG9yLmFpL3Nwb25zb3JlZC9ob3ctc2NvdGxhbmQtaXMtZXhwYW5kaW5nLWl0cy1oZWF0LXB1bXAtaW5kdXN0cnkv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3LmludmVzdG1lbnRtb25pdG9yLmFpL3Nwb25zb3JlZC9ob3ctc2NvdGxhbmQtaXMtZXhwYW5kaW5nLWl0cy1oZWF0LXB1bXAtaW5kdXN0cnkv0gEA","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmludmVzdG1lbnRtb25pdG9yLmFpL3Nwb25zb3JlZC9ob3ctc2NvdGxhbmQtaXMtZXhwYW5kaW5nLWl0cy1oZWF0LXB1bXAtaW5kdXN0cnkv0gEA?oc=5\" target=\"_blank\">Hot spot: How Scotland is expanding its heat pump industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investment Monitor<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hot spot: How Scotland is expanding its heat pump industry - Investment Monitor","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmludmVzdG1lbnRtb25pdG9yLmFpL3Nwb25zb3JlZC9ob3ctc2NvdGxhbmQtaXMtZXhwYW5kaW5nLWl0cy1oZWF0LXB1bXAtaW5kdXN0cnkv0gEA?oc=5\" target=\"_blank\">Hot spot: How Scotland is expanding its heat pump industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investment Monitor<\/font>","source.href":"https:\/\/www.investmentmonitor.ai","source.title":"Investment Monitor","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Heat pumps manufactured in Scotland could make a significant contribution to British targets. Credit: MAXSHOT.PL via Shutterstock. With time of the essence for the energy transition, heat pumps are viewed as a viable solution to decarbonise energy use and reduce bills for households and businesses. While there are many promising clean energy solutions in development, it could take several years for the technologies to mature sufficiently and scale up to the necessary levels. Heat pumps are already a proven technology and could be installed in the right location within a matter of days. Current heat pumps on the market can reach 300% to 400% efficiency, meaning they’re producing three to four times as much energy in the form of heat as they’re using in electricity. In contrast, the best-performing A-rated gas-fired boilers available have efficiency scores of around 90% or higher. However, the key for heat pumps, or any heating system, is to use as little energy as possible while optimising the efficiency of buildings, all to reduce carbon emissions and better protect consumers against the fluctuations of international commodity prices. Heat pumps and the energy transition With one of the main objections to net zero targets being the scale of the changes required to decarbonise the economy, the heat pump industry is an example where small changes can make a big difference. For example, the chassis on Mitsubishi Electric’s original heat pump was taken from one of its air-conditioning units, with many of the same components shared between the designs. “People think heat pumps are new. But in every office block, there’s a heat pump. It’s just doing your air-conditioning and heating,” says Russell Dean, residential product group director at Mitsubishi Electric UK. “All we’ve done is use that technology to move that heat from outside into water and into a heating system. It’s exactly the same principle. All we’re doing is moving energy around. We have a wealth of experience in that.” This year marked three decades since the opening of the Mitsubishi Electric Air Conditioning Systems Europe Ltd (M-ACE) facility in Livingston, West Lothian, which has a workforce of almost 1,900. As a sign of the changing market, Mitsubishi Electric’s production used to be split between 80% for air-conditioning units and 20% for heat pumps. However, these proportions have recently swapped with Mitsubishi Electric now dedicating the majority of its production capacity to heat pumps. “We didn’t have to do anything radical to do that,” explains Rodney Ayre, senior department manager at M-ACE. “We were already skilled in making products that supported the transfer of heat.” Mitsubishi Electric has been a long-term supporter of selling products close to where they are manufactured. With demand for heat pumps surging in Scotland, the company is in a strong position to serve the growing market. “We have always had a policy as a company to build it where you sell it,” says Ayre. “Even though we’re now outside Europe, we continue to support the European market with over 76% of all products manufactured here [heading there]. Mitsubishi Electric has additional sites across Europe to support that large, growing market.” Reducing embodied carbon in heat pumps Selling products closer to where they are manufactured also reduces carbon emissions from transportation and removes the need to ship products to the other side of the world. “Having that supply chain closer to where you are reduces that embodied carbon,” adds Dean. Then there are the greater efficiencies available from heat pumps as the technology evolves. Launching in Britain in December, Mitsubishi Electric’s R290 air-source heat pump uses propane as a refrigerant – a natural substance. “The propane that we use in heat pumps again has an incredible impact on reducing embodied carbon. But it also has improved performance,” says Dean. “So, you’re now into the realms of a high-temperature heat pump that can very much compete with a gas boiler in the amount of heat it provides. “That doesn’t mean that we will use it as a direct replacement for a gas boiler, because we still want to use as little energy as possible. Our systems will be fighting to lower that flow temperature as much as possible to keep the efficiency. But when we need hot water and we need it quick, then we can certainly provide it at 75°C into the tank.” Mitsubishi Electric’s new Ecodan R290 model is an air-source heat pump that uses propane as its refrigerant. Credit: Mitsubishi Electric Group. Government support for energy efficiency The UK Government is heavily backing the roll-out of heat pumps, having announced a target to install 600,000 heat pumps a year by 2028. With an estimated 55,000 heat pumps installed in the UK in 2021, there is some way to go before reaching this target within the next five years. Yet in Scotland, sales have grown by 95% in two years with the air-source heat pump market worth an estimated £70m in 2022, according to figures from the MSC Database. To date, 16.5% of all UK air-source heat pumps have been installed in Scotland. Further market growth is projected for 2023. There is a real drive in Scotland to provide a significant share of the UK’s target within the set timeframe, having set its own ambition to install 200,000 heat pumps a year before the end of this decade. There are already more than 365 companies involved in Scotland’s clean heat value chain. The Scottish Government has allocated £1.8bn of public funding to decarbonise heat and improve energy efficiency in buildings across the country, with plans to boost this amount significantly from private investment. Mitsubishi Electric cites the importance of state and industry support as key factors in the success of the growing heat pumps market in Scotland. “There’s a long heritage and commitment here and there’s a great deal of support,” adds Ayre. “It’s not just Scotland, it’s also the whole of the UK. There’s a significant relationship with the governments in trying to make sure that we form part of the solution in the Future Homes Standard and targets towards net zero.” With Scotland set to ban the sale of new gas-fired boilers as soon as 2024 in new-build properties, a year earlier than England, it has focused attention on developing low-carbon heating solutions sooner rather than later. “We’re starting to see the momentum picking up as the regulations start to kick in. The markets are definitely responding to the signals. There are lots of innovations happening. New products are being developed, and new companies coming into the market as well,” says Doreen Reid, specialist in low-carbon energy at Scottish Enterprise. The clean heat supply chain Scottish Enterprise is focused on developing a robust and sustainable supply chain for clean heat within the country, with domestic firms working alongside international operators. In addition, Scotland is implementing local heat energy efficiency strategies, identifying the areas where properties are in greatest need of retrofitting with energy efficiency measures. “If we hit the targets, then it will make us one of the leading countries in terms of heat pump manufacturing and installation across Europe,” adds Reid. One crucial scheme is Home Energy Scotland, which offers a combination of grants and loans to support heat pump purchases and energy efficiency improvements. This is especially important for buildings without proper insulation, where heat pumps will not operate anywhere near as effectively. “Thanks to supporting measures promoting heat pumps and energy efficient measures and grants, demand is rapidly increasing. An example of this support is the 0% VAT on energy efficient measures, including heat pumps,” says Barbara Monterrubio, managing analyst of energy at GlobalData. Workers at Mitsubishi Air Conditioning Systems Europe in Livingston, Scotland, are manufacturing heat pumps to meet increasing demand. Credit: Scottish Enterprise. Solving future challenges for heat pumps in Scotland While the heat pump industry is making strong progress in Scotland, there remain a number of challenges that must be overcome. One of the most pressing issues is the skills required to accommodate the vast roll-out of heat pumps. But there are plans to address this from talent in Scotland. Mitsubishi Electric is busy training the next generation of heat pump engineers and installers for servicing, alongside reskilling experienced personnel – with the scalable capacity to increase this through flexible training models. Scotland also benefits from 18 colleges running specialist training courses dedicated to equipping the future workforce with the skills that they need for energy efficiency and low-carbon heat projects. To boost workforce skills further, a certified Mobile Heat Pump Training Centre is routinely driven to 24 locations around Scotland, comprising colleges and low-carbon heat training facilities, to benefit installers living nearby. Another challenge is ensuring that every part of the heat pumps supply chain keeps moving and growing at the same pace. “We have the technologies now to achieve net zero. What we require is collaboration,” adds Dean. It is safe to say that there is no single technology that will enable net zero, with no like-for-like replacement for fossil fuels available. However, combining a range of green and low-carbon solutions will enable the energy transition. Heat pumps used as part of a broad energy mix alongside other technologies – such as solar panels, wind power, greater insulation, low-carbon hydrogen, heat networks, and battery storage – are what will ultimately deliver the decarbonisation of heat. Scotland is already fostering these vital collaborations to grow its heat pumps industry and make a significant contribution to the country’s ambitions to reach net zero by 2045 – five years ahead of most other countries. The development of a national heat hub will also increase the focus on creating net zero solutions. “Establishing a heat hub will really put Scotland on the map in terms of this industry,” says Reid. To find out more about how Scotland is developing its clean heat industry, download the document below.","filter_flag":1}
{"title":"British Gas releases second UK net zero homes index - Centrica","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA","guidislink":false,"published":"Thu, 21 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5\" target=\"_blank\">British Gas releases second UK net zero homes index<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Centrica<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"British Gas releases second UK net zero homes index - Centrica","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmNlbnRyaWNhLmNvbS9tZWRpYS1jZW50cmUvbmV3cy8yMDIzL2JyaXRpc2gtZ2FzLXJlbGVhc2VzLXNlY29uZC11ay1uZXQtemVyby1ob21lcy1pbmRleC_SAQA?oc=5\" target=\"_blank\">British Gas releases second UK net zero homes index<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Centrica<\/font>","source.href":"https:\/\/www.centrica.com","source.title":"Centrica","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"More than three quarters (78%) are willing to make changes in the home to achieve Net Zero Climate change is now seen as the fifth most important issue facing the country For Summer 2023 the British Gas Net Zero Homes Index, which measures confidence in Net Zero being achieved, drops slightly from 57.5 to 56.5 Over the next two years, almost half (47%) of homeowners said they were willing to install improved insulation to tackle climate change with 28% willing to install a heat pump One in three (30%) parents say their child knows more about climate change than they do British Gas is training its workforce to deliver its range of Net Zero products across the UK and supports calls for a greater investment in green skills You can explore the Net Zero Homes Index in-depth here British Gas has today released their second Net Zero Homes Index tracking how UK families feel about the journey to Net Zero and their readiness to make home and lifestyle changes. The Index reveals that when it comes to Net Zero, there continues to be widespread awareness but a limited understanding of the 2050 Net Zero target. When Net Zero was explained, 71% of the public agreed that it was the right thing to do. On average, people believe that the UK will reach Net Zero closer to 2075 rather than 2050 and, over one in five (22%) respondents were so pessimistic that they thought it would never be achieved. In this year’s research, the cost-of-living crisis and high energy prices have meant confidence has dropped slightly from 57.5 to 56.5 on a scale from 0 to 100. Most significantly, climate change is now seen as the fifth most important issue facing the country as it moves down from fourth last year. Despite this, over half (57%) of respondents say that climate change is one of the most pressing issues of our time. The development of onshore wind, which has previously faced pockets of local opposition as well as a government ban on development, remains in line with last year’s results. The research found that respondents were overwhelmingly receptive to the development with 79% supporting building more onshore wind, with just 7% saying they were opposed. Over four in five (88%) respondents supported building more solar power, 83% supported more offshore wind and, new nuclear remained the most controversial option, with only 48% supporting it. Making changes in the home Following on from last year, the public are more committed to tackling climate change, with 78% of respondents willing to make changes in their home. In fact, over the next two years, almost half (47%) of homeowners said they were willing to install improved insulation with over two fifths (41%) willing to add solar panels to their roof and 28% willing to install an electric vehicle ‘fast charge’ point. This year, the Index revealed over one in four homeowners (28%) would be willing to install a heat pump. Attitudes to heat pumps vary substantially by age with 48% aged 18-24 willing to install a heat pump compared to just 15% of those aged 65 and over.","filter_flag":1}
{"title":"Embrace the new NCC 7-Star energy efficiency standards with Bradford Insulation - Architecture and Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2JyYWRmb3JkL25ldy1uY2MtNy1zdGFyLWVuZXJneS1lZmZpY2llbmN5LXN0YW5kYXJkc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2JyYWRmb3JkL25ldy1uY2MtNy1zdGFyLWVuZXJneS1lZmZpY2llbmN5LXN0YW5kYXJkc9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2JyYWRmb3JkL25ldy1uY2MtNy1zdGFyLWVuZXJneS1lZmZpY2llbmN5LXN0YW5kYXJkc9IBAA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2JyYWRmb3JkL25ldy1uY2MtNy1zdGFyLWVuZXJneS1lZmZpY2llbmN5LXN0YW5kYXJkc9IBAA?oc=5\" target=\"_blank\">Embrace the new NCC 7-Star energy efficiency standards with Bradford Insulation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Embrace the new NCC 7-Star energy efficiency standards with Bradford Insulation - Architecture and Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2JyYWRmb3JkL25ldy1uY2MtNy1zdGFyLWVuZXJneS1lZmZpY2llbmN5LXN0YW5kYXJkc9IBAA?oc=5\" target=\"_blank\">Embrace the new NCC 7-Star energy efficiency standards with Bradford Insulation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","source.href":"https:\/\/www.architectureanddesign.com.au","source.title":"Architecture and Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Australia's construction industry is rapidly evolving towards sustainable energy efficient homes, with notable changes in the National Construction Code (NCC) 2022 energy efficiency provisions for new homes to take effect (with various State transition periods) from October 1, 2023. The introduction of the NCC 7-Star rating will rely heavily upon the insulation sector, yet achieving this rating need not completely change the way we build. Insulation for the roof, walls and floor, is a cornerstone of energy-efficient building design. Proper insulation not only reduces energy consumption for heating and cooling, but also ensures a more comfortable and healthy living environment. It can also significantly contribute to noise reduction, leading to more peaceful and quiet interiors. Given Australia's diverse climatic zones, insulation has to work both ways – keeping homes cool in the scorching summer months and warm during the chilly winters. A well-insulated home reduces reliance on air conditioning and heating systems, cutting energy consumption and greenhouse gas emissions. The new NCC 7-Star rating is a significant step forward in promoting more energy-efficient and durable systems with a longer-term net zero goal design and construction practices in Australia. This standard primarily affects the residential sector, pushing the building trade to adopt new approaches and techniques to achieve higher energy efficiency levels. In addressing the forthcoming introduction of the NCC 7-Star rating, Kathy Hocker, General Manager of Marketing & Customer Operations from Bradford Insulation, said, “We are at a pivotal point in the industry. The advent of this new rating is set to bring about a significant change in insulation installation and usage across Australian residences. We foresee a boost in demand for sophisticated insulation materials to meet the increased energy efficiency standards. However, before we go through this transformation, there are a number of factors that builders, specifiers and architects should understand, and which homeowners of new builds should also be across.” Under the previous regulations, the minimum required rating was 6-Stars. With the new NCC 7-Star rating, buildings will need to have even higher insulation, glazing, sealing, design or layout and passive solar design to meet the higher standards. This update represents an 18-25% improvement for homeowners on the base energy efficiency requirements as compared to the older NCC 6-Star rating[1]. As builders and architects will need to adapt and incorporate different design or layouts and material selections that help to comply with these standards, the following are practical tips and strategies designed to help industry professionals in effectively explaining these changes to their clients, enabling them to make well-informed decisions about their insulation choices. 1. Don't ignore R-values: An R-value is a measure of thermal resistance; a higher R-value is likely the most cost-effective choice for achieving energy efficiency in any design. Regardless of the climate zone, building orientation, or construction type, prioritising a higher R-value insulation should be a fundamental part of a building plan and recommendation to homeowners. 2. Look for quality products: Quality is key in insulation products for effectiveness and longevity. Bradford Gold and Bradford Gold High Performance Insulation are designed for Australia's unique climate and have been independently tested for performance under various conditions. It’s certified to Australian standards, meeting or exceeding compliance guidelines for thermal performance. Bradford products are also accredited for fire safety, environmental sustainability, and health considerations. 3. Don't overlook acoustic insulation: Alongside thermal insulation, consider the benefits of acoustic insulation to help reduce noise transmission between rooms and from external sources. Some insulation materials such as Bradford SoundScreen provide both thermal and acoustic benefits. 4. Install properly: Even the best insulation won't perform well if not installed correctly. It's essential that insulation fits snugly between studs, joists, and beams without gaps or compression so it retains its design thickness. Installation in accordance with the NCC and Australian Standards is always recommended. 5. Seal it up: A well-insulated home isn't just about the insulation itself; it's also about preventing air leaks and minimising hot and cold draughts blowing through the home. Builders should ensure gaps around windows, doors, and other areas prone to air leaks are properly sealed. 6. Don't forget condensation control: While sealing a home for energy efficiency is important, so too is ensuring sufficient moisture control and ventilation to reduce the risk of condensation, mould growth, and poor air quality. Vapour permeable wall wrap and ventilation solutions should be considered as part of the overall design. 7. Understand the full cost: The cost of insulation isn't just about the price of the product. It also includes installation costs and the ongoing savings in energy costs that the insulation will provide over its lifetime. Optimising insulation is more cost-effective compared to enhancing other more expensive building components, as it provides an overall Star rating gain for less than the cost of other building elements. As Australia continues to move towards a more sustainable future, it's likely that energy efficiency standards will continue to rise. The new NCC 7-Star rating not only demonstrates a commitment to energy efficiency stewardship but also presents a wealth of opportunities for better practices in building design and construction. The insulation industry in Australia is stepping forward to a 7-Star rating and, with it, the future of sustainable living. [1] Shoot for the stars: Top tips to improve your home’s energy efficiency | Climate Council","filter_flag":1}
{"title":"Danfoss India lines up $60 million capex plan - The Times of India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvaHlkZXJhYmFkL2RhbmZvc3MtaW5kaWEtbGluZXMtdXAtNjAtbWlsbGlvbi1jYXBleC1wbGFuL2FydGljbGVzaG93LzEwMzcwMjM3My5jbXPSAX1odHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2h5ZGVyYWJhZC9kYW5mb3NzLWluZGlhLWxpbmVzLXVwLTYwLW1pbGxpb24tY2FwZXgtcGxhbi9hbXBfYXJ0aWNsZXNob3cvMTAzNzAyMzczLmNtcw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvaHlkZXJhYmFkL2RhbmZvc3MtaW5kaWEtbGluZXMtdXAtNjAtbWlsbGlvbi1jYXBleC1wbGFuL2FydGljbGVzaG93LzEwMzcwMjM3My5jbXPSAX1odHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2h5ZGVyYWJhZC9kYW5mb3NzLWluZGlhLWxpbmVzLXVwLTYwLW1pbGxpb24tY2FwZXgtcGxhbi9hbXBfYXJ0aWNsZXNob3cvMTAzNzAyMzczLmNtcw?oc=5","id":"CBMieWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvaHlkZXJhYmFkL2RhbmZvc3MtaW5kaWEtbGluZXMtdXAtNjAtbWlsbGlvbi1jYXBleC1wbGFuL2FydGljbGVzaG93LzEwMzcwMjM3My5jbXPSAX1odHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2h5ZGVyYWJhZC9kYW5mb3NzLWluZGlhLWxpbmVzLXVwLTYwLW1pbGxpb24tY2FwZXgtcGxhbi9hbXBfYXJ0aWNsZXNob3cvMTAzNzAyMzczLmNtcw","guidislink":false,"published":"Sat, 16 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=259, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvaHlkZXJhYmFkL2RhbmZvc3MtaW5kaWEtbGluZXMtdXAtNjAtbWlsbGlvbi1jYXBleC1wbGFuL2FydGljbGVzaG93LzEwMzcwMjM3My5jbXPSAX1odHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2h5ZGVyYWJhZC9kYW5mb3NzLWluZGlhLWxpbmVzLXVwLTYwLW1pbGxpb24tY2FwZXgtcGxhbi9hbXBfYXJ0aWNsZXNob3cvMTAzNzAyMzczLmNtcw?oc=5\" target=\"_blank\">Danfoss India lines up $60 million capex plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Danfoss India lines up $60 million capex plan - The Times of India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvaHlkZXJhYmFkL2RhbmZvc3MtaW5kaWEtbGluZXMtdXAtNjAtbWlsbGlvbi1jYXBleC1wbGFuL2FydGljbGVzaG93LzEwMzcwMjM3My5jbXPSAX1odHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2h5ZGVyYWJhZC9kYW5mb3NzLWluZGlhLWxpbmVzLXVwLTYwLW1pbGxpb24tY2FwZXgtcGxhbi9hbXBfYXJ0aWNsZXNob3cvMTAzNzAyMzczLmNtcw?oc=5\" target=\"_blank\">Danfoss India lines up $60 million capex plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","source.href":"https:\/\/timesofindia.indiatimes.com","source.title":"The Times of India","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"We also published the following articles recently CIL lines up 24k cr capex for projects on transportation Coal India Limited (CIL) has announced plans to invest around Rs 24,750 crore in eco-friendly coal transportation projects. The 61 First Mile Connectivity (FMC) projects will have a total capacity of 763.5 million tonnes per annum and will be completed in three phases. FMC involves using mechanized piped conveyors to transport coal from production points to handling plants. CIL aims to improve the quality of life for those living near coalfield areas through environmentally friendly transportation. Plans afoot to expand hospital, add facilities The Satellite Hospital in Jaipur is seeking funds, staff, and new building construction for its development. The hospital has plenty of unused land and currently offers services such as eye surgeries and general surgeries. The administration plans to expand the hospital into a 150-bed facility. The hospital currently receives funding from the Rajasthan Medicare Relief Society for sanitation and cleanliness. The number of monthly OPD registrations has doubled in the past few months, indicating increased patient expectations. SVP India launches Chennai chapter Social Venture Partners India (SVP India) has launched its chapter in Chennai, recruiting 25 partners interested in the social sector. The chapter will be led by Piyush Bhandari, a chartered accountant and managing partner of IMC Group. SVP India is a pan-India philanthropy organization with seven chapters and 61 NGO investees. It focuses on initiatives in youth and education, disability, livelihood, women empowerment, sustainable environment, and agriculture. Hyderabad: Danish global energy efficiency solutions provider Danfoss, which is eyeing revenues of Rs 5,000 crore by 2025 in India, has drawn up plans to invest $50-60 million in capex to make new products in India, a top official of the company said.Danfoss India, which has six manufacturing facilities in locations such as Pune, Chennai, Mumbai, Vadodara and Bangalore, plans to expand its manufacturing in sites such as Chennai where it has a 50-acre parcel of land vacant, Danfoss India president Ravichandran Purushothaman told TOI here.","filter_flag":1}
{"title":"New home energy management “ecosystem” lands, backed by solar heavyweight - One Step Off The Grid","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5","id":"CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5\" target=\"_blank\">New home energy management “ecosystem” lands, backed by solar heavyweight<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">One Step Off The Grid<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New home energy management “ecosystem” lands, backed by solar heavyweight - One Step Off The Grid","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5\" target=\"_blank\">New home energy management “ecosystem” lands, backed by solar heavyweight<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">One Step Off The Grid<\/font>","source.href":"https:\/\/onestepoffthegrid.com.au","source.title":"One Step Off The Grid","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"A new home energy management “ecosystem” has been launched in Australia, promising to optimise solar and battery savings by monitoring and automating the use of household appliances, including scheduled electric vehicle charging. Nasdaq listed Maxeon Solar, a spin-off from SunPower in the US, says its SunPower One suite of products and services is now available through authorised dealers and installers in Australia, where it will be showcased at the upcoming All-Energy Australian event in October (see below for more details). SunPower One, an offering which Maxeon has developed in collaboration with Samsung Electronics, is one of a number of home energy management systems being brought to market as solar companies evolve into experts in the electrification of everything. Maxeon says the suite of products includes its residential solar panels, the new SunPower Reserve storage system, the upcoming SunPower Drive EV charging solution and a range of other energy services – coordinated through an app. “The SunPower One app goes beyond just monitoring the output of a homeowner’s solar panels, and proactively offers users energy insights that show in detail the devices that are consuming electricity in the home, highlighting opportunities to better utilise PV production, battery capacity, and EV charging scheduling to enhance financial savings,” the company says. The website says the app can send users notifications on how to make simple but effective changes to energy use and to how much solar energy is consumed or stored. “For example, this might come through on your phone: ‘Turn your AC down by 1° to save 6% more energy today’.” it says. “Moving beyond panels is not just about introducing new products but leveraging our technological prowess to accelerate the adoption of clean energy,” said Maxeon chief product officer, Ralf Elias, in a statement. “Our investments in improving the digital experience of our customers, combining industry-leading easy-to-install hardware with innovative services, and expanding the solution with integrations like Samsung SmartThings all help to solve pain points for consumers and installers.” Australian customers will get the latest about the SunPower One Home Energy Experience at Maxeon’s booth, VV131, during All Energy Australia, this October 25-26.","filter_flag":1}
{"title":"22 September 2023 - Calling all businesses and entrepreneurs in East Devon - Prosper is here to help! - East Devon - East Devon District Council","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWFzdGRldm9uLmdvdi51ay9uZXdzLzIwMjMvMDkvY2FsbGluZy1hbGwtYnVzaW5lc3Nlcy1hbmQtZW50cmVwcmVuZXVycy1pbi1lYXN0LWRldm9uLXByb3NwZXItaXMtaGVyZS10by1oZWxwL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWFzdGRldm9uLmdvdi51ay9uZXdzLzIwMjMvMDkvY2FsbGluZy1hbGwtYnVzaW5lc3Nlcy1hbmQtZW50cmVwcmVuZXVycy1pbi1lYXN0LWRldm9uLXByb3NwZXItaXMtaGVyZS10by1oZWxwL9IBAA?oc=5","id":"CBMidWh0dHBzOi8vZWFzdGRldm9uLmdvdi51ay9uZXdzLzIwMjMvMDkvY2FsbGluZy1hbGwtYnVzaW5lc3Nlcy1hbmQtZW50cmVwcmVuZXVycy1pbi1lYXN0LWRldm9uLXByb3NwZXItaXMtaGVyZS10by1oZWxwL9IBAA","guidislink":false,"published":"Fri, 22 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=265, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWFzdGRldm9uLmdvdi51ay9uZXdzLzIwMjMvMDkvY2FsbGluZy1hbGwtYnVzaW5lc3Nlcy1hbmQtZW50cmVwcmVuZXVycy1pbi1lYXN0LWRldm9uLXByb3NwZXItaXMtaGVyZS10by1oZWxwL9IBAA?oc=5\" target=\"_blank\">22 September 2023 - Calling all businesses and entrepreneurs in East Devon - Prosper is here to help! - East Devon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">East Devon District Council<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"22 September 2023 - Calling all businesses and entrepreneurs in East Devon - Prosper is here to help! - East Devon - East Devon District Council","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vZWFzdGRldm9uLmdvdi51ay9uZXdzLzIwMjMvMDkvY2FsbGluZy1hbGwtYnVzaW5lc3Nlcy1hbmQtZW50cmVwcmVuZXVycy1pbi1lYXN0LWRldm9uLXByb3NwZXItaXMtaGVyZS10by1oZWxwL9IBAA?oc=5\" target=\"_blank\">22 September 2023 - Calling all businesses and entrepreneurs in East Devon - Prosper is here to help! - East Devon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">East Devon District Council<\/font>","source.href":"https:\/\/eastdevon.gov.uk","source.title":"East Devon District Council","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Prosper is a new, free, business support programme aimed at helping businesses and entrepreneurs to achieve their business development ambitions. Specialised support offered through Prosper is designed to help businesses and entrepreneurs in East Devon, Exeter and Mid Devon to improve productivity, reach net zero goals, move into new markets, develop new products and more. The programme, funded by East Devon, Mid Devon and Exeter City councils through the UK Shared Prosperity Fund, will provide a mixture of online support and in-person one-to-one sessions or workshops offering: support with running a business, help to improve energy efficiency and become more environmentally sustainable, support to start a new business and, support for businesses looking to take on additional staff. Devon County Council is project managing the programme on behalf of East Devon, Mid Devon and Exeter, with business support provided by Business Information Point and Cosmic, both of whom have a wealth of experience and local knowledge. Councillor Rufus Gilbert, Devon County Council Cabinet Member for Economic Recovery and Skills, said:","filter_flag":1}
{"title":"2023 Master Builder Awards Sustainability Award: D L E Construction Limited - FMB News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZtYi5vcmcudWsvcmVzb3VyY2UvMjAyMy1tYXN0ZXItYnVpbGRlci1hd2FyZHMtc3VzdGFpbmFiaWxpdHktYXdhcmQtZC1sLWUtY29uc3RydWN0aW9uLWxpbWl0ZWQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZtYi5vcmcudWsvcmVzb3VyY2UvMjAyMy1tYXN0ZXItYnVpbGRlci1hd2FyZHMtc3VzdGFpbmFiaWxpdHktYXdhcmQtZC1sLWUtY29uc3RydWN0aW9uLWxpbWl0ZWQuaHRtbNIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LmZtYi5vcmcudWsvcmVzb3VyY2UvMjAyMy1tYXN0ZXItYnVpbGRlci1hd2FyZHMtc3VzdGFpbmFiaWxpdHktYXdhcmQtZC1sLWUtY29uc3RydWN0aW9uLWxpbWl0ZWQuaHRtbNIBAA","guidislink":false,"published":"Fri, 22 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=265, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZtYi5vcmcudWsvcmVzb3VyY2UvMjAyMy1tYXN0ZXItYnVpbGRlci1hd2FyZHMtc3VzdGFpbmFiaWxpdHktYXdhcmQtZC1sLWUtY29uc3RydWN0aW9uLWxpbWl0ZWQuaHRtbNIBAA?oc=5\" target=\"_blank\">2023 Master Builder Awards Sustainability Award: D L E Construction Limited<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FMB News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2023 Master Builder Awards Sustainability Award: D L E Construction Limited - FMB News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmZtYi5vcmcudWsvcmVzb3VyY2UvMjAyMy1tYXN0ZXItYnVpbGRlci1hd2FyZHMtc3VzdGFpbmFiaWxpdHktYXdhcmQtZC1sLWUtY29uc3RydWN0aW9uLWxpbWl0ZWQuaHRtbNIBAA?oc=5\" target=\"_blank\">2023 Master Builder Awards Sustainability Award: D L E Construction Limited<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FMB News<\/font>","source.href":"https:\/\/www.fmb.org.uk","source.title":"FMB News","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"2023 Master Builder Awards, Sustainability Award winner National winner: D L E Construction Limited DLE Construction Limited took on a challenging brief to build this sustainable family home, whilst ensuring minimal impact on the surrounding environment. 2023 Master Builder Awards, Sustainability Award National Winner, D L E Construction Limited The team created a modern, fully open plan living area designed to capture natural light, utilising the southfacing aspect of the plot. They also incorporated the latest green technologies, including a ground-source heat pump, solar panels, a heat-recovery system, underfloor heating, a rainwater harvesting system, triple-glazed Velfac windows and extensive insulation. 2023 Master Builder Awards, Sustainability Award National Winner, D L E Construction Limited Their client was thrilled with their new home, stating ‘We set out with a vision of a highly energy efficient home for our family in a green belt location. From the moment we received planning, DLE was involved and very helpful with getting the project started. The DLE team worked very well together and managed to foresee and accomplish things we worried would be impossible during the COVID lockdown. They created exactly what we wanted to a high standard and found creative solutions to what we wanted to achieve.’ The national judges praised this entry as 'an outstanding example of how builders can meet a very high spec brief for high quality environmental standards under extremely difficult conditions, right in the middle of COVID.' Describing the ‘comprehensive eco story’ that this project became, they praised the teamwork and focus employed to keep the build on-track, and recognised the high standards achieved in terms of energy efficiency and craftmanship. Reflecting on the array of energy efficiency measures implemented throughout the property, they cited the finished result as a ‘fine example for others to follow’.","filter_flag":1}
{"title":"iQOO 12 series may sport 2K display, tipster claims - gizmochina","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3Lmdpem1vY2hpbmEuY29tLzIwMjMvMDkvMjgvaXFvby0xMi1zZXJpZXMtMmstZGlzcGxheS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3Lmdpem1vY2hpbmEuY29tLzIwMjMvMDkvMjgvaXFvby0xMi1zZXJpZXMtMmstZGlzcGxheS_SAQA?oc=5","id":"CBMiQGh0dHBzOi8vd3d3Lmdpem1vY2hpbmEuY29tLzIwMjMvMDkvMjgvaXFvby0xMi1zZXJpZXMtMmstZGlzcGxheS_SAQA","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3Lmdpem1vY2hpbmEuY29tLzIwMjMvMDkvMjgvaXFvby0xMi1zZXJpZXMtMmstZGlzcGxheS_SAQA?oc=5\" target=\"_blank\">iQOO 12 series may sport 2K display, tipster claims<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">gizmochina<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"iQOO 12 series may sport 2K display, tipster claims - gizmochina","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3Lmdpem1vY2hpbmEuY29tLzIwMjMvMDkvMjgvaXFvby0xMi1zZXJpZXMtMmstZGlzcGxheS_SAQA?oc=5\" target=\"_blank\">iQOO 12 series may sport 2K display, tipster claims<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">gizmochina<\/font>","source.href":"https:\/\/www.gizmochina.com","source.title":"gizmochina","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Vivo is reportedly set to start its “enlargement strategy” in October, with a slew of new products on the horizon, including the new Origin OS 4 system, Vivo X100 series, Vivo X Fold 3, and iQOO 12 series. Notably, a tipster on Weibo has revealed some information about the iQOO 12 series. According to the leaker, the iQOO 12 series will be equipped with a 2K screen, with eye protection features specifically designed for e-sports users. The phone is likely to support a 144Hz refresh rate and an in-display fingerprint sensor. The iQOO 12 series is also rumored to feature 200W charging which would certainly come in handy for gamers. As for the processor, the iQOO 12 series is expected to be powered by the new Snapdragon 8 Gen 3 flagship mobile platform, which will offer significant improvements in CPU and GPU performance. It will be coupled with LPDDR 5X and UFS 4.0 memory, as well as a large-area VC liquid cooling system to keep thermals under control. Additionally, there are reports that the iQOO 12 series is being tested with the V3 chip, Vivo’s third-generation self-developed chip. The V3 chip is a 6nm process chip that uses a multi-concurrent ISP architecture and a second-generation FIT interconnection system. It is said to offer a 20% improvement in image processing time and a 30% improvement in energy efficiency compared to the previous generation. Jia Jingdong, vice president of Vivo, previously revealed that the Vivo X100 series and iQOO 12 series will launch after the Asian Games. As a result, the iQOO 12 series might launch sometime in late October or in the first week of November. Related: (Via)","filter_flag":1}
{"title":"Stelrad launches Electric Series - a new range of electric radiators - Installer Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3Lmluc3RhbGxlcm9ubGluZS5jby51ay9zdGVscmFkLWxhdW5jaGVzLWVsZWN0cmljLXNlcmllcy1hLW5ldy1yYW5nZS1vZi1lbGVjdHJpYy1yYWRpYXRvcnMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3Lmluc3RhbGxlcm9ubGluZS5jby51ay9zdGVscmFkLWxhdW5jaGVzLWVsZWN0cmljLXNlcmllcy1hLW5ldy1yYW5nZS1vZi1lbGVjdHJpYy1yYWRpYXRvcnMv0gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3Lmluc3RhbGxlcm9ubGluZS5jby51ay9zdGVscmFkLWxhdW5jaGVzLWVsZWN0cmljLXNlcmllcy1hLW5ldy1yYW5nZS1vZi1lbGVjdHJpYy1yYWRpYXRvcnMv0gEA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3Lmluc3RhbGxlcm9ubGluZS5jby51ay9zdGVscmFkLWxhdW5jaGVzLWVsZWN0cmljLXNlcmllcy1hLW5ldy1yYW5nZS1vZi1lbGVjdHJpYy1yYWRpYXRvcnMv0gEA?oc=5\" target=\"_blank\">Stelrad launches Electric Series - a new range of electric radiators<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Installer Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Stelrad launches Electric Series - a new range of electric radiators - Installer Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3Lmluc3RhbGxlcm9ubGluZS5jby51ay9zdGVscmFkLWxhdW5jaGVzLWVsZWN0cmljLXNlcmllcy1hLW5ldy1yYW5nZS1vZi1lbGVjdHJpYy1yYWRpYXRvcnMv0gEA?oc=5\" target=\"_blank\">Stelrad launches Electric Series - a new range of electric radiators<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Installer Online<\/font>","source.href":"https:\/\/www.installeronline.co.uk","source.title":"Installer Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Stelrad has launched of a range of electric radiators – its Electric Series. It’s the first time the Stelrad brand has ventured into the electric marketplace, and it brings with it the quality and brand values associated with its radiator products since it began manufacturing in 1936. The range includes a dozen or so different models with a number of sizes of each model available, with standard radiators for any room along with a selection of towel rails specifically targeted at bathrooms and en-suites. As well as offering effective, functional heating in the home, the radiators in the Electric Series are aesthetically appealing and provide attractive options for the décor in the home and come with a five-year warranty on the heating parts and a two-year warranty on the electric components. The new range includes a number of exciting new products – like the Stelrad Electric Column design – a rounded vertical tube column radiator available in three sizes in both white or anthracite grey. There’s the Stelrad Electric Agata and the Agata E-Flow – a straight, flat tube towel rail design, featuring five banks of three tubes with spaces between each bank, available in three sizes in both white and anthracite grey. It combines modern design with functional heating and energy saving features. The E-Flow towel rails in the range feature a fan heater at the base of the towel rail and include manual controls for individual use of the towel rail or the fan heater, or both together as a 3 in 1 unit. On the aluminium front, there’s the Stelrad Electric Alu Simple Dry and Simple Fluid – available in three sizes in either white or anthracite grey. The matching colour digital thermostat is included with each model along with its remote control. It’s a sassy design for any style room – that looks at home in any surroundings. There’s the Stelrad Electric Cloud – a fashionable, smooth fronted, curved faced steel radiator comes in four models, in white and anthracite that offers a chic heating option for any room in the house. Exceptional warmth and remarkable energy efficiency wrapped up in a single solution. And the Stelrad Electric Cobalto and Cobalto E-Flow – a trendsetting flat tube towel rail combines captivating good looks with exceptional heating efficiency and offers a sensational solution for heating in the home. An answer to those selection headaches when seeking a modish addition to the home’s décor, the Cobalto is simply stunning. As with the Agata the Cobalto E-Flow towel rails feature a fan heater at the base of the towel rail and include manual controls for individual use of the towel rail or the fan heater, or both together as a 3 in 1 unit. Not to be overlooked there is the Stelrad Electric Fantasia a mirage of a tubular towel rail – available in white or anthracite to match or contrast with colour schemes and designs in the home – offers the kind of clarification demanded by designers looking to unravel the complexities of style and opulence. The Stelrad Electric Series provides a range of exciting new options where direct electric heating is the chosen option for a home. Head for the Stelrad website at www.stelrad.com for further details.","filter_flag":1}
{"title":"Sharp Consumer Brand Growing In OZ, New 5 in 1 Microwave With Air Fryer Coming – channelnews - ChannelNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmNoYW5uZWxuZXdzLmNvbS5hdS9zaGFycC1jb25zdW1lci1icmFuZC1ncm93aW5nLWluLW96LW5ldy01LWluLTEtbWljcm93YXZlLXdpdGgtYWlyLWZyeWVyLWNvbWluZy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmNoYW5uZWxuZXdzLmNvbS5hdS9zaGFycC1jb25zdW1lci1icmFuZC1ncm93aW5nLWluLW96LW5ldy01LWluLTEtbWljcm93YXZlLXdpdGgtYWlyLWZyeWVyLWNvbWluZy_SAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmNoYW5uZWxuZXdzLmNvbS5hdS9zaGFycC1jb25zdW1lci1icmFuZC1ncm93aW5nLWluLW96LW5ldy01LWluLTEtbWljcm93YXZlLXdpdGgtYWlyLWZyeWVyLWNvbWluZy_SAQA","guidislink":false,"published":"Sun, 03 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=246, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmNoYW5uZWxuZXdzLmNvbS5hdS9zaGFycC1jb25zdW1lci1icmFuZC1ncm93aW5nLWluLW96LW5ldy01LWluLTEtbWljcm93YXZlLXdpdGgtYWlyLWZyeWVyLWNvbWluZy_SAQA?oc=5\" target=\"_blank\">Sharp Consumer Brand Growing In OZ, New 5 in 1 Microwave With Air Fryer Coming – channelnews<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChannelNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sharp Consumer Brand Growing In OZ, New 5 in 1 Microwave With Air Fryer Coming – channelnews - ChannelNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmNoYW5uZWxuZXdzLmNvbS5hdS9zaGFycC1jb25zdW1lci1icmFuZC1ncm93aW5nLWluLW96LW5ldy01LWluLTEtbWljcm93YXZlLXdpdGgtYWlyLWZyeWVyLWNvbWluZy_SAQA?oc=5\" target=\"_blank\">Sharp Consumer Brand Growing In OZ, New 5 in 1 Microwave With Air Fryer Coming – channelnews<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ChannelNews<\/font>","source.href":"https:\/\/www.channelnews.com.au","source.title":"ChannelNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Three years after taking over the Sharp consumer business, Sydney based distributor Tempo, is witnessing double digit growth with management now confident that the launch of a five in one microwave with a new air fryer built in along with additional new models from the Japanese Company, will further add to that growth. Also coming are new flatbed models, with the new five in one model able to be built into a custom kitchen with the launch of a new trim kit. All up there will be six models launched into the Sharp range of appliances claims General Manager of the brand Nigel Dent. Speaking at the IFA 2023 trade show in Berlin ,Dent said that the business is currently looking at what other Sharp products can be launched in Australia. He said “We are having a lot of success with the brand. Initially we had to reset where the brand sat in the market while analyzing consumer sentiment towards the brand”. “We can’t see growth stopping with this brand as it’s a well-known brand and we are now adding a lot more functionality and value for both retailers and consumers who buy our products”. “We bought a flatbed model out recently, and now we have a 32-litre model with convection, microwave and airfry capability” he said. “This model is going to deliver a lot more kitchen space for users by eliminating the need for multiple appliances”. “We are also expanding our flatbed range as earlier models are proving extremely popular and are selling through at retailers. We are also delivering next generation cooking products for retailers who are witnessing good ASP growth”. When asked what was fueling growth and demand for appliances he said, “The consumer is better educated today when it comes to food, they want less clutter and easy to use functionality, which is what we are delivering with the new Sharp range”? All six new Sharp models come with new inverter technology, with 11 different power levels, ensuring precise and consistent cooking results. “The Sharp inverter technology developed in Japan, not only enhances cooking performance but also contributes to energy efficiency, making these microwaves a sustainable choice for households” claims Matt Pierce Product Manager at Tempo. The standout new models are the R321CAFST and R321CAFBS which feature five-in-one functionality, Microwave, Bake, Roast, Grill and Airfry. The inclusion of Airfry functionality that Temp claims reimagines kitchen spaces by eliminating the need for multiple small domestic appliances. Airfry technology allows users to enjoy crispy and healthy meals without the hassle of cluttering their countertops. This advancement underscores the commitment from Tempo to distribute innovative small domestic appliances. “Our dedication to technological innovation and design excellence is evident in each of these products. Sharp is innovating in Microwave like no other brand; whether it’s the convenience of Airfry Microwave, Australia’s largest Flatbed lineup, or large capacity Microwave we have a model to suit every Australian home. Currently Tempo management are looking at what they do with their Hoover brand. “This is a very popular and above all well-known brand and we see a lot of opportunity for the brand. However, have to get the positioning right for the products we are evaluating”.","filter_flag":1}
