{"title":"Air pollution control market size to grow by USD 40.55 billion between 2022 and 2027; Driven by the rapid rise in ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Fpci1wb2xsdXRpb24tY29udHJvbC1tYXJrZXQtc2l6ZS10by1ncm93LWJ5LXVzZC00MC01NS1iaWxsaW9uLWJldHdlZW4tMjAyMi1hbmQtMjAyNy1kcml2ZW4tYnktdGhlLXJhcGlkLXJpc2UtaW4taW5kdXN0cmlhbC1kZXZlbG9wbWVudC0tLXRlY2huYXZpby0zMDE3NTkyMTAuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Fpci1wb2xsdXRpb24tY29udHJvbC1tYXJrZXQtc2l6ZS10by1ncm93LWJ5LXVzZC00MC01NS1iaWxsaW9uLWJldHdlZW4tMjAyMi1hbmQtMjAyNy1kcml2ZW4tYnktdGhlLXJhcGlkLXJpc2UtaW4taW5kdXN0cmlhbC1kZXZlbG9wbWVudC0tLXRlY2huYXZpby0zMDE3NTkyMTAuaHRtbNIBAA?oc=5","id":"CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Fpci1wb2xsdXRpb24tY29udHJvbC1tYXJrZXQtc2l6ZS10by1ncm93LWJ5LXVzZC00MC01NS1iaWxsaW9uLWJldHdlZW4tMjAyMi1hbmQtMjAyNy1kcml2ZW4tYnktdGhlLXJhcGlkLXJpc2UtaW4taW5kdXN0cmlhbC1kZXZlbG9wbWVudC0tLXRlY2huYXZpby0zMDE3NTkyMTAuaHRtbNIBAA","guidislink":false,"published":"Wed, 01 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=60, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Fpci1wb2xsdXRpb24tY29udHJvbC1tYXJrZXQtc2l6ZS10by1ncm93LWJ5LXVzZC00MC01NS1iaWxsaW9uLWJldHdlZW4tMjAyMi1hbmQtMjAyNy1kcml2ZW4tYnktdGhlLXJhcGlkLXJpc2UtaW4taW5kdXN0cmlhbC1kZXZlbG9wbWVudC0tLXRlY2huYXZpby0zMDE3NTkyMTAuaHRtbNIBAA?oc=5\" target=\"_blank\">Air pollution control market size to grow by USD 40.55 billion between 2022 and 2027; Driven by the rapid rise in ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Air pollution control market size to grow by USD 40.55 billion between 2022 and 2027; Driven by the rapid rise in ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiywFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Fpci1wb2xsdXRpb24tY29udHJvbC1tYXJrZXQtc2l6ZS10by1ncm93LWJ5LXVzZC00MC01NS1iaWxsaW9uLWJldHdlZW4tMjAyMi1hbmQtMjAyNy1kcml2ZW4tYnktdGhlLXJhcGlkLXJpc2UtaW4taW5kdXN0cmlhbC1kZXZlbG9wbWVudC0tLXRlY2huYXZpby0zMDE3NTkyMTAuaHRtbNIBAA?oc=5\" target=\"_blank\">Air pollution control market size to grow by USD 40.55 billion between 2022 and 2027; Driven by the rapid rise in ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"NEW YORK, March 1, 2023 \/PRNewswire\/ -- According to Technavio, the global air pollution control market size is estimated to grow by USD 40.55 billion from 2022 to 2027, accelerating at a CAGR of 7.25% during the forecast period. COVID-19 had the most negative impact on the global automotive industry in recent years, resulting in a steep fall in demand and a large-scale disruption of the supply chain. It has exerted intense pressure on an already-stressed global automotive market. Yet, there are high predictions that few countries are bringing manufacturing facilities and production back on track, indicating that the supply side is on a restoration line. For more insights on the historic (2017 to 2021) and forecast market size (2023 to 2027) Request a Sample Report Technavio has announced its latest market research report titled Global Air Pollution Control Market 2023-2027 What`s New for 2023? Special coverage on the Russia - Ukraine war; global inflation; recovery analysis from COVID-19; supply chain disruptions, global trade tensions; and risk of recession - war; global inflation; recovery analysis from COVID-19; supply chain disruptions, global trade tensions; and risk of recession Global competitiveness and key competitor positions Market presence across multiple geographical footprints - Strong\/Active\/Niche\/Trivial Global Air Pollution Control Market – Market Dynamics Key factors driving market growth The market is driven by the rapid rise in industrial development. The growth of the industrial sector worldwide has significantly increased the consumption of fossil fuels. The rapid rise in industrial activities is resulting in an increase in the emission of greenhouse gases. To counter this, countries are introducing stringent emission control regulations, which is driving the growth of the air pollution control market. Leading trends influencing the market The flourishing FGD gypsum market is one of the key trends fueling growth. The use of FGD gypsum products is increasing across end-user applications such as agriculture, construction, mining, and water treatment. For example, in the agriculture sector, FGD gypsum is applied to the soil to provide essential nutrients such as sulfur and calcium to plants. In the construction industry, FGD gypsum products such as plaster and card gypsum are used for interior work and partitioning walls. The growth in these end-user industries is increasing the demand for FGD gypsum. This will positively boost the need for FGD systems, which, in turn, will drive the growth of the market. Major challenges hindering market growth The cessation of funding by the World Bank for E&P activities will challenge the growth of the market. The oil and gas sector is one of the key contributors to greenhouse gases such as CO2. Hence, the World Bank has been reducing its investments in this sector. The World Bank intends to encourage the use of clean and low-carbon fuels over fossil fuels for generating power. Such initiatives are adversely impacting the operations of the chemicals and petrochemicals industry, which is reducing the demand for air pollution control. For more information on market dynamics, historic (2017 to 2021), and forecast market size (2023 to 2027) - Find some insights from a sample report. Global Air Pollution Control Market - Segmentation Assessment Segment Overview Technavio has segmented the market based on end-user (power, industries, and others), product (scrubbers, catalyst converters, and others), and geography (APAC, North America, Europe, Middle East and Africa, and South America). The market growth in the power segment will be significant over the forecast period. Coal-fired and gas-fired power generation accounts for a significant share of GHG emissions. This is one of the major factors driving the demand for air pollution control in the power industry. Geography Overview By geography, the global air pollution control market is segmented into APAC, North America, Europe, Middle East and Africa, and South America. The report provides actionable insights and estimates the contribution of all regions to the growth of the global air pollution control market. APAC will account for 44% of the market growth during the forecast period. The increasing adoption of mechanization in industries such as agriculture, mining, wood processing, and excavation in emerging economies is driving the growth of the regional market. Get a glance at the market contribution of various segments including country and region wise, historic (2017 to 2021), and forecast market size (2023 to 2027) Download a Sample Report Why Buy? Add credibility to strategy Analyzes competitor's offerings Get a holistic view of the market Grow your profit margin with Technavio – Buy the Report! What are the key data covered in this Air Pollution Control Market report? CAGR of the market during the forecast period Detailed information on factors that will drive the growth of the Air Pollution Control Market between 2023 and 2027 Precise estimation of the size of the Air Pollution Control Market size and its contribution to the market in focus on the parent market Accurate predictions about upcoming trends and changes in consumer behavior Growth of the Air Pollution Control Market industry across APAC, North America , Europe , Middle East and Africa , and South America , , and , and A thorough analysis of the market's competitive landscape and detailed information about vendors Comprehensive analysis of factors that will challenge the growth of Air Pollution Control Market vendors Gain instant access to 17,000+ market research reports. Technavio's SUBSCRIPTION platform Related Reports: The environmental disinfection robot market is estimated to grow at a CAGR of 30.88% between 2022 and 2027. The size of the market is forecast to increase by USD 531.72 million . The changes in cleaning protocols to prevent HAIs (Healthcare-Associated Infections) are notably driving the market growth, although factors such as criticism regarding false advertising claims may impede the market growth. is estimated to grow at a CAGR of 30.88% between 2022 and 2027. The size of the market is forecast to increase by . The changes in cleaning protocols to prevent HAIs (Healthcare-Associated Infections) are notably driving the market growth, although factors such as criticism regarding false advertising claims may impede the market growth. The industrial high-efficiency particulate air (HEPA) filters market is estimated to grow at a CAGR of 5.5% between 2022 and 2027. The size of the market is forecast to increase by USD 619.05 million . The growth of distributed power generation base is notably driving the market growth, although factors such as slow growth in nuclear power generation may impede the market growth. Air Pollution Control Market Scope Report Coverage Details Base year 2022 Historic period 2017-2021 Forecast period 2023-2027 Growth momentum & CAGR Accelerate at a CAGR of 7.25% Market growth 2023-2027 USD 40.55 billion Market structure Fragmented YoY growth 2022-2023 (%) 6.22 Regional analysis APAC, North America, Europe, Middle East and Africa, and South America Performing market contribution APAC at 44% Key countries US, China, South Korea, Germany, Canada, Mexico, Italy,Spain, Japan, Australia, and South Korea Competitive landscape Leading Vendors, Market Positioning of Vendors, Competitive Strategies, and Industry Risks Key companies profiled Airex Industries Inc., American Air Filter Co. Inc., Andritz AG, Babcock and Wilcox Enterprises Inc., Camfil AB, Donaldson Co. Inc., Doosan Lentjes GmbH, DuPont de Nemours Inc., FLSmidth AS, Fujian Longking Co. Ltd., GEA Group AG, General Electric Co., Hamon S.A., John Wood Group PLC, Mitsubishi Heavy Industries Ltd., Parker Hannifin Corp., PAS Solutions BV, PBG S.A., Sumitomo Heavy Industries, Ltd., and Thermax Ltd Market dynamics Parent market analysis, market growth inducers and obstacles, fast-growing and slow-growing segment analysis, COVID-19 impact and recovery analysis and future consumer dynamics, and market condition analysis for forecast period. Customization purview If our report has not included the data that you are looking for, you can reach out to our analysts and get segments customized. Table of contents: 1 Executive Summary 1.1 Market overview Exhibit 01: Executive Summary – Chart on Market Overview Exhibit 02: Executive Summary – Data Table on Market Overview Exhibit 03: Executive Summary – Chart on Global Market Characteristics Exhibit 04: Executive Summary – Chart on Market by Geography Exhibit 05: Executive Summary – Chart on Market Segmentation by End-user Exhibit 06: Executive Summary – Chart on Market Segmentation by Product Exhibit 07: Executive Summary – Chart on Incremental Growth Exhibit 08: Executive Summary – Data Table on Incremental Growth Exhibit 09: Executive Summary – Chart on Vendor Market Positioning 2 Market Landscape 2.1 Market ecosystem Exhibit 10: Parent market Exhibit 11: Market Characteristics 3 Market Sizing 3.1 Market definition Exhibit 12: Offerings of vendors included in the market definition 3.2 Market segment analysis Exhibit 13: Market segments 3.3 Market size 2022 3.4 Market outlook: Forecast for 2022-2027 Exhibit 14: Chart on Global - Market size and forecast 2022-2027 ($ billion) Exhibit 15: Data Table on Global - Market size and forecast 2022-2027 ($ billion) Exhibit 16: Chart on Global Market: Year-over-year growth 2022-2027 (%) Exhibit 17: Data Table on Global Market: Year-over-year growth 2022-2027 (%) 4 Five Forces Analysis 4.1 Five forces summary Exhibit 18: Five forces analysis - Comparison between 2022 and 2027 4.2 Bargaining power of buyers Exhibit 19: Chart on Bargaining power of buyers – Impact of key factors 2022 and 2027 4.3 Bargaining power of suppliers Exhibit 20: Bargaining power of suppliers – Impact of key factors in 2022 and 2027 4.4 Threat of new entrants Exhibit 21: Threat of new entrants – Impact of key factors in 2022 and 2027 4.5 Threat of substitutes Exhibit 22: Threat of substitutes – Impact of key factors in 2022 and 2027 4.6 Threat of rivalry Exhibit 23: Threat of rivalry – Impact of key factors in 2022 and 2027 4.7 Market condition Exhibit 24: Chart on Market condition - Five forces 2022 and 2027 5 Market Segmentation by End-user 5.1 Market segments Exhibit 25: Chart on End-user - Market share 2022-2027 (%) Exhibit 26: Data Table on End-user - Market share 2022-2027 (%) 5.2 Comparison by End-user Exhibit 27: Chart on Comparison by End-user Exhibit 28: Data Table on Comparison by End-user 5.3 Power - Market size and forecast 2022-2027 Exhibit 29: Chart on Power - Market size and forecast 2022-2027 ($ billion) Exhibit 30: Data Table on Power - Market size and forecast 2022-2027 ($ billion) Exhibit 31: Chart on Power - Year-over-year growth 2022-2027 (%) Exhibit 32: Data Table on Power - Year-over-year growth 2022-2027 (%) 5.4 Industries - Market size and forecast 2022-2027 Exhibit 33: Chart on Industries - Market size and forecast 2022-2027 ($ billion) Exhibit 34: Data Table on Industries - Market size and forecast 2022-2027 ($ billion) Exhibit 35: Chart on Industries - Year-over-year growth 2022-2027 (%) Exhibit 36: Data Table on Industries - Year-over-year growth 2022-2027 (%) 5.5 Others - Market size and forecast 2022-2027 Exhibit 37: Chart on Others - Market size and forecast 2022-2027 ($ billion) Exhibit 38: Data Table on Others - Market size and forecast 2022-2027 ($ billion) Exhibit 39: Chart on Others - Year-over-year growth 2022-2027 (%) Exhibit 40: Data Table on Others - Year-over-year growth 2022-2027 (%) 5.6 Market opportunity by End-user Exhibit 41: Market opportunity by End-user ($ billion) 6 Market Segmentation by Product 6.1 Market segments Exhibit 42: Chart on Product - Market share 2022-2027 (%) Exhibit 43: Data Table on Product - Market share 2022-2027 (%) 6.2 Comparison by Product Exhibit 44: Chart on Comparison by Product Exhibit 45: Data Table on Comparison by Product 6.3 Scrubbers - Market size and forecast 2022-2027 Exhibit 46: Chart on Scrubbers - Market size and forecast 2022-2027 ($ billion) Exhibit 47: Data Table on Scrubbers - Market size and forecast 2022-2027 ($ billion) Exhibit 48: Chart on Scrubbers - Year-over-year growth 2022-2027 (%) Exhibit 49: Data Table on Scrubbers - Year-over-year growth 2022-2027 (%) 6.4 Catalyst converters - Market size and forecast 2022-2027 Exhibit 50: Chart on Catalyst converters - Market size and forecast 2022-2027 ($ billion) Exhibit 51: Data Table on Catalyst converters - Market size and forecast 2022-2027 ($ billion) Exhibit 52: Chart on Catalyst converters - Year-over-year growth 2022-2027 (%) Exhibit 53: Data Table on Catalyst converters - Year-over-year growth 2022-2027 (%) 6.5 Others - Market size and forecast 2022-2027 Exhibit 54: Chart on Others - Market size and forecast 2022-2027 ($ billion) Exhibit 55: Data Table on Others - Market size and forecast 2022-2027 ($ billion) Exhibit 56: Chart on Others - Year-over-year growth 2022-2027 (%) Exhibit 57: Data Table on Others - Year-over-year growth 2022-2027 (%) 6.6 Market opportunity by Product Exhibit 58: Market opportunity by Product ($ billion) 7 Customer Landscape 7.1 Customer landscape overview Exhibit 59: Analysis of price sensitivity, lifecycle, customer purchase basket, adoption rates, and purchase criteria 8 Geographic Landscape 8.1 Geographic segmentation Exhibit 60: Chart on Market share by geography 2022-2027 (%) Exhibit 61: Data Table on Market share by geography 2022-2027 (%) 8.2 Geographic comparison Exhibit 62: Chart on Geographic comparison Exhibit 63: Data Table on Geographic comparison 8.3 APAC - Market size and forecast 2022-2027 Exhibit 64: Chart on APAC - Market size and forecast 2022-2027 ($ billion) Exhibit 65: Data Table on APAC - Market size and forecast 2022-2027 ($ billion) Exhibit 66: Chart on APAC - Year-over-year growth 2022-2027 (%) Exhibit 67: Data Table on APAC - Year-over-year growth 2022-2027 (%) 8.4 North America - Market size and forecast 2022-2027 - Market size and forecast 2022-2027 Exhibit 68: Chart on North America - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 69: Data Table on North America - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 70: Chart on North America - Year-over-year growth 2022-2027 (%) - Year-over-year growth 2022-2027 (%) Exhibit 71: Data Table on North America - Year-over-year growth 2022-2027 (%) 8.5 Europe - Market size and forecast 2022-2027 - Market size and forecast 2022-2027 Exhibit 72: Chart on Europe - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 73: Data Table on Europe - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 74: Chart on Europe - Year-over-year growth 2022-2027 (%) - Year-over-year growth 2022-2027 (%) Exhibit 75: Data Table on Europe - Year-over-year growth 2022-2027 (%) 8.6 Middle East and Africa - Market size and forecast 2022-2027 and - Market size and forecast 2022-2027 Exhibit 76: Chart on Middle East and Africa - Market size and forecast 2022-2027 ($ billion) and - Market size and forecast 2022-2027 ($ billion) Exhibit 77: Data Table on Middle East and Africa - Market size and forecast 2022-2027 ($ billion) and - Market size and forecast 2022-2027 ($ billion) Exhibit 78: Chart on Middle East and Africa - Year-over-year growth 2022-2027 (%) and - Year-over-year growth 2022-2027 (%) Exhibit 79: Data Table on Middle East and Africa - Year-over-year growth 2022-2027 (%) 8.7 South America - Market size and forecast 2022-2027 - Market size and forecast 2022-2027 Exhibit 80: Chart on South America - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 81: Data Table on South America - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 82: Chart on South America - Year-over-year growth 2022-2027 (%) - Year-over-year growth 2022-2027 (%) Exhibit 83: Data Table on South America - Year-over-year growth 2022-2027 (%) 8.8 China - Market size and forecast 2022-2027 - Market size and forecast 2022-2027 Exhibit 84: Chart on China - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 85: Data Table on China - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 86: Chart on China - Year-over-year growth 2022-2027 (%) - Year-over-year growth 2022-2027 (%) Exhibit 87: Data Table on China - Year-over-year growth 2022-2027 (%) 8.9 US - Market size and forecast 2022-2027 Exhibit 88: Chart on US - Market size and forecast 2022-2027 ($ billion) Exhibit 89: Data Table on US - Market size and forecast 2022-2027 ($ billion) Exhibit 90: Chart on US - Year-over-year growth 2022-2027 (%) Exhibit 91: Data Table on US - Year-over-year growth 2022-2027 (%) 8.10 Germany - Market size and forecast 2022-2027 - Market size and forecast 2022-2027 Exhibit 92: Chart on Germany - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 93: Data Table on Germany - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 94: Chart on Germany - Year-over-year growth 2022-2027 (%) - Year-over-year growth 2022-2027 (%) Exhibit 95: Data Table on Germany - Year-over-year growth 2022-2027 (%) 8.11 South Korea - Market size and forecast 2022-2027 - Market size and forecast 2022-2027 Exhibit 96: Chart on South Korea - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 97: Data Table on South Korea - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 98: Chart on South Korea - Year-over-year growth 2022-2027 (%) - Year-over-year growth 2022-2027 (%) Exhibit 99: Data Table on South Korea - Year-over-year growth 2022-2027 (%) 8.12 Japan - Market size and forecast 2022-2027 - Market size and forecast 2022-2027 Exhibit 100: Chart on Japan - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 101: Data Table on Japan - Market size and forecast 2022-2027 ($ billion) - Market size and forecast 2022-2027 ($ billion) Exhibit 102: Chart on Japan - Year-over-year growth 2022-2027 (%) - Year-over-year growth 2022-2027 (%) Exhibit 103: Data Table on Japan - Year-over-year growth 2022-2027 (%) 8.13 Market opportunity by geography Exhibit 104: Market opportunity by geography ($ billion) 9 Drivers, Challenges, and Trends 9.1 Market drivers 9.2 Market challenges 9.3 Impact of drivers and challenges Exhibit 105: Impact of drivers and challenges in 2022 and 2027 9.4 Market trends 10 Vendor Landscape 10.1 Overview 10.2 Vendor landscape Exhibit 106: Overview on Criticality of inputs and Factors of differentiation 10.3 Landscape disruption Exhibit 107: Overview on factors of disruption 10.4 Industry risks Exhibit 108: Impact of key risks on business 11 Vendor Analysis 11.1 Vendors covered Exhibit 109: Vendors covered 11.2 Market positioning of vendors Exhibit 110: Matrix on vendor position and classification 11.3 Airex Industries Inc. Exhibit 111: Airex Industries Inc. - Overview Exhibit 112: Airex Industries Inc. - Product \/ Service Exhibit 113: Airex Industries Inc. - Key offerings 11.4 American Air Filter Co. Inc. Exhibit 114: American Air Filter Co. Inc. - Overview Exhibit 115: American Air Filter Co. Inc. - Product \/ Service Exhibit 116: American Air Filter Co. Inc. - Key offerings 11.5 Andritz AG Exhibit 117: Andritz AG - Overview Exhibit 118: Andritz AG - Business segments Exhibit 119: Andritz AG - Key offerings Exhibit 120: Andritz AG - Segment focus 11.6 Babcock and Wilcox Enterprises Inc. Exhibit 121: Babcock and Wilcox Enterprises Inc. - Overview Exhibit 122: Babcock and Wilcox Enterprises Inc. - Business segments Exhibit 123: Babcock and Wilcox Enterprises Inc. - Key news Exhibit 124: Babcock and Wilcox Enterprises Inc. - Key offerings Exhibit 125: Babcock and Wilcox Enterprises Inc. - Segment focus 11.7 Camfil AB Exhibit 126: Camfil AB - Overview Exhibit 127: Camfil AB - Product \/ Service Exhibit 128: Camfil AB - Key offerings 11.8 Donaldson Co. Inc. Exhibit 129: Donaldson Co. Inc. - Overview Exhibit 130: Donaldson Co. Inc. - Business segments Exhibit 131: Donaldson Co. Inc. - Key news Exhibit 132: Donaldson Co. Inc. - Key offerings Exhibit 133: Donaldson Co. Inc. - Segment focus 11.9 Doosan Lentjes GmbH Exhibit 134: Doosan Lentjes GmbH - Overview Exhibit 135: Doosan Lentjes GmbH - Product \/ Service Exhibit 136: Doosan Lentjes GmbH - Key news Exhibit 137: Doosan Lentjes GmbH - Key offerings 11.10 DuPont de Nemours Inc. Exhibit 138: DuPont de Nemours Inc. - Overview Exhibit 139: DuPont de Nemours Inc. - Business segments Exhibit 140: DuPont de Nemours Inc. - Key offerings Exhibit 141: DuPont de Nemours Inc. - Segment focus 11.11 FLSmidth AS Exhibit 142: FLSmidth AS - Overview Exhibit 143: FLSmidth AS - Business segments Exhibit 144: FLSmidth AS - Key news Exhibit 145: FLSmidth AS - Key offerings Exhibit 146: FLSmidth AS - Segment focus 11.12 Fujian Longking Co. Ltd. Exhibit 147: Fujian Longking Co. Ltd. - Overview Exhibit 148: Fujian Longking Co. Ltd. - Product \/ Service Exhibit 149: Fujian Longking Co. Ltd. - Key offerings 11.13 General Electric Co. Exhibit 150: General Electric Co. - Overview Exhibit 151: General Electric Co. - Business segments Exhibit 152: General Electric Co. - Key news Exhibit 153: General Electric Co. - Key offerings Exhibit 154: General Electric Co. - Segment focus 11.14 Mitsubishi Heavy Industries Ltd. Exhibit 155: Mitsubishi Heavy Industries Ltd. - Overview Exhibit 156: Mitsubishi Heavy Industries Ltd. - Business segments Exhibit 157: Mitsubishi Heavy Industries Ltd. - Key news Exhibit 158: Mitsubishi Heavy Industries Ltd. - Key offerings Exhibit 159: Mitsubishi Heavy Industries Ltd. - Segment focus 11.15 PBG S.A. Exhibit 160: PBG S.A. - Overview Exhibit 161: PBG S.A. - Product \/ Service Exhibit 162: PBG S.A. - Key offerings 11.16 Sumitomo Heavy Industries, Ltd. Exhibit 163: Sumitomo Heavy Industries, Ltd. - Overview Exhibit 164: Sumitomo Heavy Industries, Ltd. - Product \/ Service Exhibit 165: Sumitomo Heavy Industries, Ltd. - Key offerings 11.17 Thermax Ltd Exhibit 166: Thermax Ltd - Overview Exhibit 167: Thermax Ltd - Business segments Exhibit 168: Thermax Ltd - Key news Exhibit 169: Thermax Ltd - Key offerings Exhibit 170: Thermax Ltd - Segment focus 12 Appendix 12.1 Scope of the report 12.2 Inclusions and exclusions checklist Exhibit 171: Inclusions checklist Exhibit 172: Exclusions checklist 12.3 Currency conversion rates for US$ Exhibit 173: Currency conversion rates for US$ 12.4 Research methodology Exhibit 174: Research methodology Exhibit 175: Validation techniques employed for market sizing Exhibit 176: Information sources 12.5 List of abbreviations Exhibit 177: List of abbreviations About Us Technavio is a leading global technology research and advisory company. Their research and analysis focuses on emerging market trends and provides actionable insights to help businesses identify market opportunities and develop effective strategies to optimize their market positions. With over 500 specialized analysts, Technavio's report library consists of more than 17,000 reports and counting, covering 800 technologies, spanning across 50 countries. Their client base consists of enterprises of all sizes, including more than 100 Fortune 500 companies. This growing client base relies on Technavio's comprehensive coverage, extensive research, and actionable market insights to identify opportunities in existing and potential markets and assess their competitive positions within changing market scenarios. Contact Technavio Research Jesse Maida Media & Marketing Executive US: +1 844 364 1100 UK: +44 203 893 3200 Email: [email protected] Website: www.technavio.com\/ SOURCE Technavio","filter_flag":1}
{"title":"Exploring consumers' environmental ethical preferences in the context of unmanned aerial vehicle utilization for plant ... - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy0zMDU1Ny000gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy0zMDU1Ny000gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy0zMDU1Ny000gEA","guidislink":false,"published":"Mon, 06 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=65, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy0zMDU1Ny000gEA?oc=5\" target=\"_blank\">Exploring consumers' environmental ethical preferences in the context of unmanned aerial vehicle utilization for plant ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Exploring consumers' environmental ethical preferences in the context of unmanned aerial vehicle utilization for plant ... - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy0zMDU1Ny000gEA?oc=5\" target=\"_blank\">Exploring consumers' environmental ethical preferences in the context of unmanned aerial vehicle utilization for plant ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Based on environmental consumption ethics17 and PSR theory45, this paper has constructed a research model describing the impacts of food-, production-, and ecological-safety pressures on perceived benefits and obstacles and the consequent acceptance of UAVs by consumers. Meanwhile, PSR theory has often been applied in the field of environmental economics to reveal the interactions between humans and the environment. Lay beliefs have been used to moderate the effects of perceived benefits and obstacles on consumer acceptance. Hence, based on the theoretical model analysis framework (Fig. 2), the hypothesis that consumers will accept UAV-dependent agricultural products is proposed. Figure 2 PSR research model. Full size image Impact of food-safety pressure on perceived benefits and obstacles Food safety closely relates to consumer health. The world has substantially solved the problem of hidden hunger since food safety problems caused by pesticide residue and excessive heavy metals have attracted increasing attention46,47,48. In addition, excessive concentrations and quantities of traditional manual pesticide spraying were common, and uneven local areas of large-scale mechanical spraying were evident with highly toxic pesticides. These practices have all caused additional serious issues, including inefficient pesticide use and soil and water pollution, undermining sustainable development. Meanwhile, the rapid popularization of the internet and “we-media” (The term “we-media” refers to information posted online by the general public without verification) has enabled the constant transmission of this information to consumers, which encourages consumers to buy products with green, organic, and pollution-free safety certificates49. In this context, interest in new agricultural technologies that are clean, efficient, and accurate (e.g., UAVs) has increased significantly. UAVs can release natural enemies of pests or spray insecticides accurately50, allow for quantitative spraying to help agricultural products meet green production standards51, reduce physical damage to crops and soil52, and reduce consumer concerns about diseases caused by pesticide residues53. Given these positive effects that can enhance consumer confidence in food safety, the authors of this paper believe that consumers have a positive attitude toward agricultural products protected by UAVs. Thus, we state the following hypotheses: H1a. Food-safety pressure has a positive impact on the perceived benefits consumers associate with accepting UAV-dependent agricultural products. H1b. Food-safety pressure has a negative impact on the perceived obstacles consumers associate with accepting UAV-dependent agricultural products. Impact of production-safety pressure on perceived benefits and obstacles Production safety relates to worker health and improved crop yields and productivity. As a labor-intensive industry, traditional agriculture relies heavily on physical labor, which poses various threats to the health of farm workers. For example, the artificial transplantation of rice seedlings during rice planting often causes falls and injuries, and the long-term exposure of the lower limbs to mud can cause various diseases54. In addition, restricted by education level and cognitive ability, farm workers ignore or fail to understand pesticide operation instructions, threatening their health and potentially causing poisoning or death55,56. The root causes of this phenomenon are the lack of effective control and the improper behavior resulting from the limited capacity of bounded-rationality actors. With the progress of technology, intelligent, accurate, and efficient production tools can effectively restrain the inappropriate behaviors of bounded-rationality actors. These tools not only free workers from physical labor but also reduce harm to workers by enabling more precise and less dangerous pesticide spraying operations. Furthermore, studies have shown that UAVs can improve the technical efficiency of agricultural production, and precision pesticide spraying can improve crop yields57. Moreover, consumers pay attention to not only the appearance, taste, and nutrition of agricultural products but also the labor process and health of workers at the production end. This represents a desire for enhanced levels of social welfare and the protection of worker health, which inclines consumers to pay higher prices for agricultural products manufactured according to higher moral standards58. Based on this ethical thinking, this paper proposes the following hypotheses: H2a. Production-safety pressure has a positive impact on the perceived benefits consumers associate with accepting UAV-dependent agricultural products. H2b. Production-safety pressure has a negative impact on the perceived obstacles consumers associate with accepting UAV-dependent agricultural products. Impact of ecological-safety pressure on perceived benefits and obstacles Ecological safety closely relates to environmental ethics and sustainable development goals per global consensus, with the fundamental goal of protecting the planet and ensuring human well-being59. The essential purpose of environmental ethics is to improve the ecological environment and reduce the pressures associated with ecological insecurity. When linking supply and marketing, the environmental ethics, moral obligation, and green attitude of consumers combine to generate a consumption ethics that pushes consumer behavior toward greener consumption and the support of green production60,61. At the agricultural production end, the irrational use of pesticides and other chemical agents contributes to soil and water pollution, resource waste, and reduced biodiversity. At the consumption end, consumers are also affected by soil and water pollution, including the negative impacts of species reductions and extinctions. Intelligent, accurate, and efficient production tools, such as UAVs, can effectively control soil and water pollution during pesticide application, improving water-use efficiency and reducing disturbances to biodiversity. This can weaken the negative impacts of agricultural production on the ecological environment and improve the overall performance of agricultural production in terms of sustainable development. Therefore, UAVs in agriculture can positively impact the ecosystem and respond to the urgent consumer desire to improve the environments surrounding agricultural production areas. Accordingly, this paper proposes the following hypotheses: H3a. Ecological-safety pressure has a positive impact on the perceived benefits consumers associate with accepting UAV-dependent agricultural products. H3b. Ecological-safety pressure has a negative impact on the perceived obstacles consumers associate with accepting UAV-dependent agricultural products. Influence of perceived benefits and obstacles on acceptance behavior A strong positive relationship exists between perceived benefits and acceptance, and a strong negative relationship occurs between perceived obstacles and acceptance62,63,64. Perceived benefits represent the overall evaluation of consumer perceptions of the quality and contribution of products65 and strongly influence those who want to purchase a given product66. Perceived benefits are also considered a significant factor for predicting individual behavior67, with higher perceived values associated with higher levels of satisfaction and loyalty and a greater willingness to accept new products68. Therefore, perceived benefits––as an essential mediating factor––link product characteristics with the behavioral responses of consumers, helping to reveal the specific mechanism of these relationships69. Meanwhile, in the context of this research, perceived obstacles contribute to consumer tendencies to resist new technologies and associated products. For example, consumers may consider a given new technology to be pseudoscience or infeasible for implementation because of some imperfection70. Therefore, consumer recognition or acceptance of the value of UAV-dependent agriculture is reflected in their subjective evaluation of the related agricultural products. When such products meet consumer needs and conform to their ethical norms and other relevant values, they are more likely to be accepted. In contrast, when consumers perceive this acceptance as risky, they tend not to accept UAV-dependent agricultural products. Accordingly, this paper proposes the following hypotheses: H4a. Perceived benefits have a positive impact on the consumer acceptance of UAV-dependent agricultural products. H4b. Perceived benefits have a negative impact on the consumer acceptance of UAV-dependent agricultural products. Influence of lay beliefs on acceptance behavior Lay beliefs refer to the judgment and choices of people without professional knowledge71. The most significant difference between experts and ordinary consumers is that experts can understand product attributes that non-experts cannot understand72. However, experts comprise a minority of consumers, and most consumers are non-experts. Therefore, most consumers make purchase decisions according to incomplete information based on product labels or mobile phone searches73. Although this decision-making process lacks a scientific basis, it is rational for ordinary consumers. Using UAVs in the agricultural production context remains novel in China, and everyday consumers have a minimal understanding of the technology. Therefore, this paper considers whether lay beliefs moderate the influence of perceived benefits and barriers on adoption by proposing the following hypotheses: H5a. Lay beliefs significantly moderate the impact of perceived benefits on consumer acceptance of UAV-protected agricultural products. H5b. Lay beliefs significantly moderate the impact of perceived obstacles on consumer acceptance of UAV-protected agricultural products.","filter_flag":1}
{"title":"Discover the Top 10 Emission Reduction Technology Trends in 2023 - StartUs Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA","guidislink":false,"published":"Wed, 29 Mar 2023 21:10:01 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=29, tm_hour=21, tm_min=10, tm_sec=1, tm_wday=2, tm_yday=88, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5\" target=\"_blank\">Discover the Top 10 Emission Reduction Technology Trends in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Discover the Top 10 Emission Reduction Technology Trends in 2023 - StartUs Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5\" target=\"_blank\">Discover the Top 10 Emission Reduction Technology Trends in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","source.href":"https:\/\/www.startus-insights.com","source.title":"StartUs Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Climate change continues to dominate the global agenda, making large businesses reduce their carbon emissions and take a more proactive approach to emission management. This has led to a tech-driven approach that reduces the environmental impact of each product or service from the early stages of its development. At the same time, startups and scaleups develop technologies that reduce emission concentrations both at the source and in the atmosphere. These innovative technologies range from carbon offsetting and carbon capture technologies to bio-based solutions and emission monitoring. This data-driven research provides you with the top 10 global emission reduction technology trends in 2023 based on our research on 1680 startups and scaleups. Innovation Map outlines the Top 10 Emission Reduction Technology Trends & 20 Promising Startups For this in-depth research on the Top Emission Reduction Technology Trends & Startups, we analyzed a sample of 1680 global startups & scaleups. This data-driven research provides innovation intelligence that helps you improve strategic decision-making by giving you an overview of emerging technologies in the cleantech industry. In the Emission Reduction Technology Innovation Map, you get a comprehensive overview of the innovation trends & startups that impact your company. These insights are derived by working with our Big Data & Artificial Intelligence-powered StartUs Insights Discovery Platform, covering 3 790 000+ startups & scaleups globally. As the world’s largest resource for data on emerging companies, the SaaS platform enables you to identify relevant technologies and industry trends quickly & exhaustively. Tree Map reveals the Impact of the Top 10 Emission Reduction Technology Trends Based on the Emission Reduction Technology Innovation Map, the Tree Map below illustrates the impact of the Top 10 Emission Reduction Technology Trends in 2023. Startups and scaleups are developing solutions that utilize artificial intelligence (AI), big data, and the internet of things (IoT). Such solutions monitor and analyze emission data and offer insights into abatement strategies. Advances in electrification, green hydrogen, and bio-based fuels and polymers aid the transition from fossil fuel-based energy sources to low or zero-carbon alternatives. Further, startups develop carbon capture, utilization, and storage (CCUS) technologies as well as waste valorization solutions. They reduce the emission concentrations both in the atmosphere and at the source. Additionally, energy-efficient integrations reduce the use of energy, improving emission reduction. Top 10 Emission Reduction Technology Trends in 2023 Global Startup Heat Map covers 1680 Emission Reduction Technology Startups & Scaleups The Global Startup Heat Map below highlights the global distribution of the 1680 exemplary startups & scaleups that we analyzed for this research. Created through the StartUs Insights Discovery Platform, the Heat Map reveals high startup activity in the UK and the US, followed by the rest of Western Europe. Below, you get to meet 20 out of these 1680 promising startups & scaleups as well as the solutions they develop. These emission reduction technology startups are hand-picked based on criteria such as founding year, location, funding raised, & more. Depending on your specific needs, your top picks might look entirely different. Interested to explore all 1600+ emission reduction technology startups? Book Demo Top 10 Emission Reduction Technology Trends 1. Carbon Offsetting Carbon offsetting allows net-positive emitters to neutralize their greenhouse gas (GHG) emissions by trading negative carbon credits. The purchase of offset tokens facilitates the funding of initiatives that reduce carbon emissions, such as reforestation projects. Carbon-negative projects include technologies that capture GHG at industrial sites, improve soil management, and leverage energy-efficient integrations. This allows individuals, organizations, and governments to compensate for their polluting activities and mitigate them through the use of carbon credits. Further, cloud and blockchain-based bookkeeping improves the transparency of carbon credit records and makes them fully traceable. By offsetting emissions, individuals and organizations support projects that reduce or remove emissions from the atmosphere, mitigating the impact of climate change. Abatable simplifies Carbon Intelligence & Procurement UK-based startup Abatable offers a carbon intelligence and procurement platform. It aids the purchase of high-quality offsets for hard-to-abate emissions and maximizes the social impact of climate contributions. The platform provides insights into carbon projects and project developers by evaluating the fundamental factors contributing to the quality of carbon credits. Abatable continuously monitors every project to mitigate risks stemming from infrastructure, systems, and policies, ensuring the committed quality of carbon credits for organizations. Tanso offers Automated Carbon Accounting German startup Tanso automates carbon accounting and offers analytical solutions for effective emission reduction. The startup’s software simplifies data collection and emissions calculation through process automation, Excel\/CSV uploads, application programming interface (API), and a single-source-of-truth approach. Tanso’s single-source-of-truth approach and automated processes provide organizations with their carbon footprint and set clear reduction goals. This allows the planning of decarbonization initiatives, like carbon offsetting and benchmarking, against science-based target standards. 2. Artificial Intelligence AI allows organizations to collect and derive insights from massive amounts of data and identify patterns that humans fail or take time to recognize. Deeper insights into carbon emissions provide organizations with higher agility to adopt processes that cut down GHG emissions. This accelerates sustainable transformation and reduces expenses in a period of lower cash flow. AI-powered solutions also analyze the environmental impact of emissions and provide forecasts on storms, wildfires, and droughts, which enables better mitigation plans. Finally, AI aids the optimization of technologies related to carbon capture and renewable energy that improves efficiency and reduces emissions. AI Shading ensures Low Building Carbon Footprint AI Shading is a Canadian smart and green technology startup developing economical solutions that allow commercial buildings to achieve emission reduction targets. The startup’s solution also accomplishes this by regulating indoor temperatures through smart indoor shades, sensors, mobile apps, and energy management platforms. AI Shading equips building managers with energy-saving reports to better analyze energy usage and track emission reduction goals. GAIA provides Automated Emission Tracking Dutch startup GAIA leverages AI to simplify and automate GHG emissions reduction for businesses. The startup’s solution measures and tracks emissions by analyzing the data from the input of choice – manual, linked, or integrated. The AI algorithm utilizes the raw data to extrapolate measurements and approximate any missing data. This way, GAIA’s solution pinpoints main emission sources as well as customizes optimization roadmaps and emission reduction priorities. 3. Electrification Electrification aids in emission reduction by replacing traditional fossil fuel-powered energy sources with clean, electric energy sources such as wind and solar power. This emission reduction technology trend finds application in multiple industries such as transportation, building, manufacturing, mining, and more. Besides the lower carbon intensity of clean electricity, energy efficiency is a key benefit of electrification as electric equipment is more efficient than its fossil-powered alternatives. Additionally, electrification enables demand flexibility to provide a cost-effective mechanism to share the available energy. Thus, the widespread adoption of electrification across various industries significantly reduces global emissions. Zevx accelerates Fleet Electrification US-based startup Zevx develops battery electric power systems and data intelligence for e-mobility applications. The startup’s powertrains and power system products accelerate the electrification of commercial fleet assets. Zevx’s data intelligence services further improve operational efficiency and enhance the control framework for power usage. The solution, in this way, provides an integrated platform that allows fleet owners to decarbonize all operational components. Leaf Energy allows Seamless Energy Transition US-based startup Leaf Energy offers electrification solutions like electric vehicles (EVs) and charging stations. The startup’s technology provides high-speed charging through its proprietary terminal designs that are compatible with existing grid networks. Leaf Energy also provides a platform that enables real-time environmental tracking, which allows businesses to measure progress at every step of the energy transition. 4. Green Hydrogen Hydrogen fuel produced through the use of renewable energy in the electrolysis process emits no greenhouse gases and generates only water as a byproduct. The high calorific value and chemical properties of hydrogen offer utility across various industries, including transportation, heating, and industrial processes. In the transportation sector, green hydrogen fuel cells power vehicles, reducing emissions. It also serves as a key ingredient in the production of low-carbon chemicals and fuels, further decreasing emissions in these industries. As a clean energy source, green hydrogen reduces emissions and combats the effects of climate change. Azolla generates Fuel-cell Spec Green Hydrogen Canadian startup Azolla offers green hydrogen solutions for the power and transportation industries. The startup’s Biodrome technology utilizes a blend of bio-methanol and de-ionized water to generate fuel-cell spec hydrogen. The catalytic reformation of Azolla’s bio-methanol\/water blend produces low-carbon hydrogen production on-site. This enables the use of methanol as a hydrogen carrier, which is easier to transport, store, and handle than high-pressure hydrogen or ammonia. Faraday Fuels offers Solid Oxide Electrolyzers US-based cleantech startup Faraday Fuels develops a scalable, high-throughput solid oxide technology to make green hydrogen. The startup’s solid oxide electrolyzers feature tubular design and proprietary electrodes to ensure efficient and low-cost production of clean hydrogen. This hydrogen serves as fuel to facilitate deep decarbonization of emission-intensive industries like steel, chemical, and aviation. 5. Carbon Capture, Utilization, & Storage CCUS technologies capture carbon dioxide emissions and use them to make things or permanently store them thousands of feet below the surface. Startups utilize a range of technologies, some using membranes and others using solvents, to capture CO2. The captured carbon dioxide is then concentrated either chemically or in biological processes, which further serves as a feedstock or is simply stored underground. By preventing the CO2 from industrial operations from reaching the atmosphere, CCUS stabilizes CO2 levels. This provides carbon-neutral feedstock alternatives to industries like oil and gas, aviation, construction, and chemical. CO2 storage solutions, on the other hand, facilitate the use of depleted oil or gas fields or saline formations. Algiecel advances Algal-based Carbon Capture UK-based startup Algiecel develops modular photobioreactors that convert CO2 emissions and LED light into microalgae biomass and oxygen. The startup’s compact mobile microalgae photobioreactors and downstream units fit into standard shipping containers. This enables the transformation of industrial CO2 emissions into biomass rich in food-grade omega-3, proteins, vitamins, and carotenoids. The carbon capture solution in this way allows industrial plants to reduce their carbon emissions and enable a new revenue stream. Aqualung achieves Absorbant-free Carbon Capture Norwegian startup Aqualung develops an absorbent-free and highly compact membrane separation technology for carbon capture. The startup’s system utilizes less energy than conventional membranes by eliminating the regeneration energy associated with absorbents. It also avoids toxic additives or absorbents to lower operational risks and maintenance costs. Aqualung’s modular technology enables the deployment of carbon capture systems even for environments with low CO2 concentrations. 6. Energy-Efficient Integrations Industrial excess energy is a largely untapped resource, for which there is potential for reuse as well as benefits industries and society. The utilization of excess energy in the form of heat, power, and fuel provides a way to reduce the use of primary energy. This contributes to the mitigation of CO2 emissions. The most common recovery solutions reuse discarded heat in secondary processes on site or use it to preheat incoming water and combustion air. Other power recovery solutions include the reclamation of pressure energy from processes operating at elevated pressures using even small pressure differences to produce electricity through pressure recovery turbines. In addition to solutions that recover wasted energy, innovations in materials and processes avoid energy wastage and cut down on the associated emissions. Sapphire Technologies simplifies Excess Pressure Energy Recovery US-based startup Sapphire Technologies creates energy recovery systems that harness the power of expanding gas to produce reliable and clean electricity. The startup’s FreeSpin In-line Turboexpander Generator specifically converts energy wasted in pressure reduction processes into electric power without interrupting operations. Sapphire Technologies’ solution caters to hydrogen and natural gas industrial applications. It maximizes efficiencies, improves productivity, reduces carbon emissions, offsets electrical costs, and achieves financial returns. HT Materials Science facilitates Efficient Heat Transfer Irish startup HT Material Science offers smart heat transfer fluids for commercial and industrial heating and cooling systems. The startup’s patented nanofluid additive, Maxwell, is a drop-in solution that enhances the heat transfer of a base refrigerant, improving the efficiency of HVAC systems. This reduces energy consumption and facilitates a proportional reduction in carbon emissions. The higher heat transfer rate enables the adoption of smaller, less costly, and more efficient equipment that further adds to operational sustainability. 7. Big Data Big data allows businesses to identify areas of excessive energy consumption and carbon emissions, providing valuable information for efficient energy use energy and actions to curb emissions. Such solutions collate information from emission sensors and smart energy devices dotted across cities and facilities as well as historical operational data. Energy utilization data analysis allows businesses to identify patterns in energy use and improve energy efficiency. Big data solutions also aid supply chain optimization by analyzing transportation routes, inventory levels, and delivery times, reducing the distance traveled by goods and the resulting carbon footprint. Finally, by analyzing data on energy production and consumption, companies identify the best times to use renewable energy. This allows them to reduce reliance on non-renewable sources and, in turn, decrease their carbon footprint. Grid Matrix aids Transport Emission Reduction US-based startup Grid Matrix offers software that leverages existing traffic infrastructure to reduce congestion, emissions, and accidents. The startup’s cloud-based platform combines data from existing sensors and online sources to employ big data and analytics. It then provides real-time insights based on the collected data, facilitating the optimization of mobility services. This accelerates the transportation goals of cities and allows them to transition into safer, greener, and more efficient places to live and work. Consequently, this results in the elimination of congestion and greenhouse gas emissions. CarbonSense simplifies Carbon Footprint Management Chinese startup CarbonSense makes a software solution that allows businesses to achieve carbon neutrality. The startup’s green management system collects energy data from smart meters, water meters, gas sensors, temperature sensors, and equipment PLC as well as analyzes them through big data algorithms. The resultant insights include visualization of energy consumption, multi-dimensional energy consumption analysis, equipment efficiency analysis, and early warnings on equipment abnormalities. These insights enable intelligence decisions that minimize energy consumption and accelerate the adoption of renewable sources. 8. Waste Valorization Waste valorization converts waste materials into useful products, upcycling end-of-life products and reducing carbon emissions. By diverting waste from landfills, it reduces methane emissions, which is a potent greenhouse gas that contributes significantly to climate change. Waste valorization also generates low-carbon energy in the form of biogas or biochar, which replaces fossil fuels and reduces GHG emissions associated with energy production. Recycling waste materials into new products further reduce the need for new materials and lower greenhouse gas emissions. Lastly, some waste valorization processes capture and utilize carbon dioxide emissions, mitigating their environmental impacts and advancing a circular carbon economy. Alimentary advances Domestic Waste Valorization New Zealand-based startup Alimentary designs and builds an integrated waste treatment plant (IWTP) that accepts all forms of organic waste. The startup’s patented waste treatment process combines biomimicry and anaerobic co-digestion, which is configurable to the local waste sources, to reduce waste disposal costs. It reduces all atmospheric greenhouse gas emissions related to household waste and wastewater treatment processes. In addition, the high-value biogas byproduct offsets costs by generating revenue. Pyro-degrade facilitates Plastic Waste to Fuel Conversion Kenyan startup Pyro-degrade develops a pyrolysis technology that converts plastic waste into fuel. Pyro-diesel is the startup’s fuel that serves as an environmentally friendly diesel substitute, which is free of sulfur and has a low carbon footprint. Moreover, the startup’s process is self-sufficient, enabling it to run off the grid with the fuel it produces. This technology avoids the open burning of plastic waste and provides a low-carbon diesel substitute for agricultural and other domestic applications. 9. Bio-based Fuels & Polymers Bio-based solutions enable emission reduction by providing sustainable alternative energy sources and materials. Biofuels, such as bioethanol and biodiesel, are made from renewable plant-based materials and reduce the need for fossil fuels, resulting in fewer emissions. Biopolymers, such as biodegradable plastics, are sourced from natural fibers and resins that replace traditional petroleum-based plastics. Additionally, the production of biofuels and biopolymers often utilizes waste materials and by-products, reducing waste and emissions associated with waste management. By providing sustainable alternative energy sources and materials, biofuels, and biopolymers help to reduce emissions and contribute to a more sustainable future. SeaH4 produces Carbon-Neutral Fuels South African cleantech startup SeaH4 offers solutions that enable the profitable production of sustainable biodiesel and liquefied natural gas (LNG) from algae. The startup utilizes base technologies involving land-based algae farming, biogas production, gas processing, and gas-to-liquid conversion. SeeH4’s system is fully circular, minimizing operational expenditure and increasing yield. The final fuel product enables the CO2-neutral operation of combustion engines, accelerating the transition away from fossil fuels. Dionymer offers Petrochemical Plastic Alternatives French startup Dionymer develops material technology that upcycles industrial organic waste. The startup’s proprietary fermentation technology incorporates a biomimetic process that transforms organic waste into biodegradable polymer material polyhydroxyalkanoates (PHA). These polymer materials serve as low-carbon alternatives for petrochemical plastics. In addition to reducing carbon emissions, the technology provides a recovery path for bio-waste across industries like agriculture and pharmaceuticals. 10. Emission Monitoring Emission monitoring and management reduce emissions by enabling organizations to accurately measure and track their emissions and identify opportunities for reduction. Monitoring systems detect emissions from various sources and provide real-time data on emissions levels. Management systems then analyze and interpret this data, allowing organizations to identify improvement areas and implement emission reduction strategies. By regularly monitoring and managing emissions, organizations ensure their emissions are within legal limits, reduce their environmental impact, and improve their sustainability. Moreover, organizations now leverage a comprehensive and systematic approach to emission reduction, monitoring, and management. This helps them to achieve emission reduction goals and ensure carbon-neutral operations. GAIT delivers Greenhouse Gas Measurement Singaporean startup GAIT offers climate tech solutions that facilitate the deployment of GHG measurement systems. The startup’s technology combines machine learning, flux sensors, and spatial data to deliver real-time measurements of greenhouse gas emissions. Additionally, it accesses historical flux data to provide more accurate models that measure the effectiveness of climate action projects. The solution also provides recommendations on actions required to further reduce emissions and achieve the set air quality targets. Blue Sky advances Fugitive Methane Emission Detection Blue Sky is a US-based startup that develops an infrared optical sensor technology for the continuous detection and measurement of fugitive methane emissions. NIRview is the startup’s emission monitoring solution that employs a spectroscopy-based approach to automatically scan a user-defined grid and provide a detailed 2D concentration map. The solution in this way offers oilfields a cost-effective detection technology that pinpoints the location of leaks, facilitating quick repairs and substantially reducing emissions. Discover all Emission Reduction Technology Trends, Technologies & Startups Advances in emissions reduction technologies continue to advance as the demand for a net zero existence becomes critical. Carbon offsetting serves as a crucial method in ensuring the financial sustainability of carbon reduction projects and initiatives. Innovations in emission monitoring and reporting through the integration of technologies, like blockchain and IoT, ensure transparency across supply chains. This facilitates close monitoring of emission reduction efforts and allows businesses to properly channel resources for achieving emission goals. The Emission Reduction Technology Trends & Startups outlined in this report only scratch the surface of trends that we identified during our data-driven innovation & startup scouting process. Identifying new opportunities & emerging technologies to implement into your business goes a long way in gaining a competitive advantage.","filter_flag":1}
{"title":"The impact of high-tech industrial agglomeration on China's green innovation efficiency: A spatial econometric analysis - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE2NzkxONIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE2NzkxONIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE2NzkxONIBAA","guidislink":false,"published":"Mon, 20 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=79, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE2NzkxONIBAA?oc=5\" target=\"_blank\">The impact of high-tech industrial agglomeration on China's green innovation efficiency: A spatial econometric analysis<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The impact of high-tech industrial agglomeration on China's green innovation efficiency: A spatial econometric analysis - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTE2NzkxONIBAA?oc=5\" target=\"_blank\">The impact of high-tech industrial agglomeration on China's green innovation efficiency: A spatial econometric analysis<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Eco-efficiency is an important factor in assessing the quality of development, and high-tech industries are crucial for countries to forge green innovation paths. However, few studies have examined whether and how high-tech industrial agglomeration affects green innovation efficiency. To fill this gap, we measure the degree of high-tech industrial agglomeration and the level of specialized and diversified agglomeration using the location entropy index and agglomeration factor, and calculate green innovation efficiency using the super-SBM model with undesirable outputs. Based on Chinese provincial panel data from 2006 to 2020, a dynamic spatial Durbin model was constructed to explore the impact of high-tech industrial agglomeration and different agglomeration patterns on green innovation efficiency. Our study found that high-tech industrial agglomeration is a significant contributor to green innovation efficiency. There is an inverted U-shaped relationship between specialized agglomeration and green innovation efficiency, and diversified agglomeration contributes to green innovation efficiency. Given the regionally uneven nature of China’s economic development, there is some variation in the impact effects within different economic regions. We demonstrated the leading role of scientific high-tech industrial agglomeration patterns and appropriate levels of agglomeration in green innovation, providing theoretical guidance for the formulation of China’s high-quality development policies. 1 Introduction After more than 40 years of rapid development, China’s economic progress has generated a series of environmental problems along with considerable achievements. As China’s economy shifts from high growth to a new stage of high-quality development, resource shortages, environmental constraints, and economic downturns are becoming increasingly prominent (Wu et al., 2020; Liu and Zhang, 2021). The Global Status Report on Energy and CO 2 shows that China’s greenhouse gas emissions have continued to rise over the last 3 years and the country remains the world’s largest emitter of greenhouse gases. In the context of China’s new development path, eco-efficiency is an important factor of consideration in evaluating the quality of development (Campos et al., 2021; Qiu and Li, 2021; Wu et al., 2022). The 14th Five-Year Plan emphasizes the implementation of sustainable development strategies and promotes the comprehensive green transformation of economic and social development (Chen and Huo, 2022; Chen and Wang, 2022; Ren and Wu, 2022). Rationalizing the relationship between economic and social development and the ecological environment and striving for stronger environmental leadership in the international stage is essential for achieving China’s high-quality sustainable economic development. As a new form of innovation that can drive rapid economic growth while avoiding negative externalities to the ecological environment, green innovation is becoming a common innovation path followed by countries around the world in the pursuit of sustainable development (Boons and Ludeke-Freund, 2013; Chen et al., 2017; Semenenko et al., 2022). Green innovation efficiency is a key indicator for measuring green innovation capabilities that not only evaluates factor utilization in the innovation process based on the traditional innovation efficiency perspective, but also introduces an undesirable output dimension, considering science and technology innovation, resource conservation, and environmental protection in an integrated manner, and presents a refinement of traditional measures of innovation efficiency (Liang et al., 2018; Luo and Zhang, 2021). High-tech industries are knowledge- and technology-intensive, resource-saving, and environment-friendly green industries, and are an important support for countries’ forging green innovation paths (Gu et al., 2020; Zhu and Li, 2021). Based on resource sharing and knowledge spillover effects, high-tech industries tend to cluster spatially, forming high-tech development zones (Wang et al., 2021; Xu D. et al., 2022). Theoretically, moderate agglomeration of high-tech industries can produce scale, knowledge spillover, and innovation interaction effects, with an impact on green innovation efficiency (Liu et al., 2022a; Wang et al., 2022). Does China’s high-tech industrial agglomeration have an impact on green innovation efficiency? Does this effect show heterogeneity depending on the mode of agglomeration? These are urgent issues to be addressed in the context of high-quality development. Based on the traditional concept of innovation, scholars have incorporated ecological elements such as resources and environmental pollution into the innovation system, introducing the concepts of green innovation, eco-innovation, environmental innovation, and sustainable innovation (Rennings, 2000; Dyck and Silvestre, 2018; Li et al., 2022), consistently emphasizing the need for innovative activities to advance sustainable development. Research on green innovation efficiency has focused on two main areas. The first is the evaluation of green innovation efficiency and analysis of its spatial and temporal evolution. Data envelopment analysis is widely used because it does not require assumptions about the relationships between variables and has obvious advantages in measuring the efficiency of decision units with multiple inputs and outputs (Chen et al., 2013; Wang et al., 2017; Garau, 2022). Evolutionary studies based on the time dimension generally have suggested that China’s regional green innovation efficiency demonstrates a fluctuating upward trend (He et al., 2021; Zhang M. F. et al., 2022). From a spatial perspective, spatial differences in green innovation efficiency have been found in China, using a stepwise distribution among eastern, central, and western regions (Du et al., 2019; Shen et al., 2022). Secondly, the factors influencing green innovation efficiency were explored. Scholars have focused on the impact of environmental regulation, industrial structure, market pull, education investment, technology transfer, and foreign direct investment on green innovation efficiency (Li et al., 2018; Zeng J. Y. et al., 2021; Dong et al., 2022). Previous studies have confirmed that industrial agglomerations have innovation spillover effects (Li X. et al., 2021). Depending on the type of industry, industrial agglomerations are differentiated into specialized and diversified agglomerations, and their impact on innovation and the environment varies according to the structure of the agglomeration (Ding et al., 2022; Xu Y. et al., 2022). Industrial agglomeration patterns can only exert greater agglomeration effects and positive spatial spillovers if they are adapted to urban development conditions (Chen et al., 2008). Academics have conducted fruitful research on green innovation efficiency, which provides a better theoretical basis and methodological insights for this paper. China’s economy is at a critical stage of transition from high-rate growth to high-quality development, and high-tech industries are advancing by leaps and bounds. Unfortunately, the literature that qualitatively studies the mechanism of the role of high-tech industrial agglomeration on green innovation efficiency and empirically tests its impact effect is relatively rare, and the depth of research needs to be expanded. Scholars have mainly focused on the impact of economic phenomena generated by industrial agglomeration on green innovation, and few studies have explored the relationship between industrial agglomeration and green innovation efficiency based on the perspective of agglomeration pattern and agglomeration intensity. In view of this, the main contribution of this paper is to integrate high-tech industrial agglomeration and green innovation efficiency into the same analytical framework. Based on the analysis of the mechanism of high-tech industrial agglomeration on green innovation efficiency, the impact paths of specialized agglomeration and diversified agglomeration on green innovation efficiency are explored. In addition, based on Chinese provincial panel data from 2006 to 2020, we construct a dynamic spatial Durbin model (SDM) to investigate the effects of high-tech industrial agglomeration and different agglomeration patterns on green innovation efficiency and regional differentiation characteristics. Our study aims to provide a scientific basis for promoting the clustering of high-tech industries in accordance with local conditions, giving full play to the clustering effect to enhance green innovation efficiency and promote high-quality regional economic development. The rest of this article is structured as follows. The theoretical underpinnings and study hypotheses are presented in Section 2. The data and techniques are described in Section 3. The empirical findings are described and discussed in Section 4. Conclusion and policy implications are presented in Section 5. 2 Theoretical foundation and hypotheses 2.1 The effect of high-tech industrial agglomeration on green innovation efficiency Under the premise of certain factor inputs, green innovation efficiency involves two basic elements, including the desirable output efficiency of resource inputs and the undesirable output reduction efficiency (Song and Zhang, 2020). The scale and technology effects of high-tech industrial agglomeration are the primary factors affecting these two aspects of efficiency (Fallah et al., 2014). Desirable and undesirable outputs often arise simultaneously and together determine the efficiency of green innovation. The relationship between desirable and undesirable output is assumed to be y = f(x), where y is the desirable output and x is the undesirable output. Figure 1 presents a mechanism map of the impact of high-tech industrial agglomeration on green innovation efficiency. In Figure 1, O 0 denotes the origin of desirable and undesirable output, and O 1 denotes the impact of high-tech industrial agglomeration, which can be divided into scale and technology effects. Arrows pointing to the corresponding variables increase and decrease the effects. Y 0 = f 0 (x), y 1 = f 1 (x), and y 2 = f 2 (x) correspond to low, medium, and high levels of green innovation efficiency, respectively. According to the law of diminishing marginal output and sustainable development theory, desirable output rises along with undesirable output, but the growth trend slows down (Lee and Johnson, 2014). The rationale for this is that a production approach that increases desirable output by expanding undesirable output is unsustainable and inevitably leads to diminishing desirable output. FIGURE 1 FIGURE 1. Mechanism of high-tech industry agglomeration on green innovation efficiency. In the early stages of high-tech industrial agglomeration, agglomeration is at a low level of green innovation efficiency, corresponding to the curve represented by y 0 = f 0 (x) in Figure 1, with a point A(x 0 , y 0 ) on the curve. With the clustering of high-tech enterprises in a region, technology and scale effects are generated. The technology effect is a manifestation of the competitive and cooperative relationships between enterprises, wherein enterprises continuously conduct innovation activities to improve market competitiveness and internal technology levels, while leveraging knowledge spillover to achieve mutual learning and common progress, which elevates the agglomeration’s overall technology level. As a result, under a certain undesirable output, the desirable output is increased (i.e., from point A to point B), and green innovation efficiency is raised from a low to a medium level. The scale effect is primarily related to enterprises’ common access to public social resources in the agglomeration area, which improves efficiency in the use of public resources per unit of desirable output and reduces undesirable output, thus improving green innovation efficiency (i.e., moving from point A to point C to the left). Under combined technology and scale effects, based on the principle of vector addition, point A will move to point D [i.e., jump from curve y 0 = f 0 (x) to curve y 2 = f 2 (x)], achieving green innovation efficiency. Notably, some scholars have argued that as agglomeration grows in size, congestion effects will arise within agglomerations (Liu C. Y. et al., 2020; Zandiatashbar and Hamidi, 2021). However, we assert that high-tech industries react differently. High-tech industries are typically knowledge-intensive and technological innovation is their main feature. The rapid renewal of high-tech products constantly generates new demand, weakening the limitations of market capacity (Zuo et al., 2019). In addition, as local governments attach considerable importance to the development of high-tech industries, social resources are in sufficient supply, effectively reducing the potential congestion effect (Ostergaard and Park, 2015). Based on the theoretical analysis, we propose the first hypothesis. Hypothesis 1:. High-tech industrial agglomeration has a catalytic effect on green innovation efficiency. 2.2 The impact of different industrial agglomeration modes on green innovation efficiency Specialized agglomeration in high-tech industries leverages the high degree of technological similarity among firms in an industry and the ease of improving the efficiency of matching firms with research and development (R&D) personnel to establish a shared market for factors, reduce the cost of learning, exchange green technology and innovation knowledge among firms, and promote green technology innovation (Mendonca, 2009). Clusters form a complete industrial chain through specialized division of labour, providing enterprises with abundant green innovation resources, which is conducive to optimizing the allocation of green innovation resources, reducing R&D and transaction costs of green innovation, and increasing economies of scale (Shuen et al., 2014). However, as the degree of specialization increases, its contribution to green innovation efficiency gradually decreases, and excessive specialization may even inhibit the improvement of green innovation efficiency. Specialized clusters can lead to increased competition among firms, and firms in a cluster tend to form a single structural pool of knowledge and labour (Li X. H. et al., 2021). This limits the innovation spillover from the agglomeration to the exchange of information and technology within the industry, which could form a closed system with industry spatial boundaries, leading to path dependence and technology locking in the industrial structure within the agglomeration, which is not conducive to R&D and innovation activities (Zhang W. X. et al., 2022). Too much specialization can lead to traffic congestion, resource shortages, and higher production costs, inhibiting green innovation efficiency. It is possible that different degrees of specialization may have different effects on green innovation efficiency. In this regard, we propose a second hypothesis. Hypothesis 2:. There is a non-linear relationship between the specialized agglomeration of high-tech industries and green innovation efficiency.Diversified agglomeration is an organizational model based on spatial clustering of firms with different product orientations. Unlike specialized agglomeration, the agglomeration of high-tech firms across industries makes labour market externalities more significant (Zhang et al., 2021). The clustering of workers with different professional skills in a region can create a diverse labour pool (Ozcan and Islam, 2014), and the clustering of different types of high-tech enterprises in the same area can facilitate inter-industry knowledge exchange and complementarity, and generate new knowledge, establishing a diverse knowledge pool (Pei et al., 2021). Diversified labour and knowledge pools not only avoid the homogeneity of green innovation technologies and management systems and increase firms’ differentiation and innovation of green products, but also help to stimulate firms’ green technological innovation (Lechner and Leyronas, 2012; Simonen et al., 2015), increasing green innovation efficiency. In addition, diversified agglomeration facilitates convenient provision of intermediate goods between firms, satisfies firms’ diversified demand for inputs, and reduces transport and transaction costs, establishing the conditions for resource conservation and lower undesirable output. This leads us to our third hypothesis. Hypothesis 3:. Diversified agglomeration of high-tech industries has a catalytic effect on green innovation efficiency. 3 Model construction and variable description 3.1 Model construction Based on theoretical analysis, we explore the impact of high-tech industrial agglomeration and different spatial agglomeration patterns on green innovation efficiency. We introduce spatial interactions into the panel regression model, combining a spatial lag model with a spatial error model to form a more general SDM (Zhao et al., 2020). Since green innovation efficiency incorporates undesirable outputs reflecting environmental pollution, which are characterized by wide reach and mobility, a one-period lag in green innovation efficiency is included in the model to reduce potential systemic bias. The SDM is constructed as follows: G I E i t = τ G I E i , t − 1 + ρ W G I E i t + β 1 H I A i t + β 2 X i t + θ 1 W H I A i t + θ 2 W X i t + μ i + ξ t + ε i t ( 1 ) G I E i t = τ G I E i , t − 1 + ρ W G I E i t + β 1 ⁡ ln ⁡ S A i t + β 2 X i t + θ 1 W ⁡ ln ⁡ S A i t + θ 2 W X i t + μ i + ξ t + ε i t ( 2 ) G I E i t = τ G I E i , t − 1 + ρ W G I E i t + β 1 ⁡ ln ⁡ D A i t + β 2 X i t + θ 1 W ⁡ ln ⁡ D A i t + θ 2 W X i t + μ i + ξ t + ε i t ( 3 ) where subscripts i and t denote province and year, respectively. W is the spatial weight matrix, GIE it denotes green innovation efficiency, GIE i,t−1 is the time lag term, and WGIE it is the spatial lag term. HIA it denotes high-tech industrial agglomeration, SA it denotes specialized agglomeration, and DA it denotes diversified agglomeration. X it denotes control variables. μ i , ξ t , and ε it are spatial fixed effects, time fixed effects, and random error terms, respectively. Spatial weight matrices that reflect the way in which geographic elements influence one another are critical to spatial measurement models (Liu and Liu, 2019). To fully consider the reality of geographic attributes, an inverse geographic distance matrix is constructed to reflect geospatial relationships between provinces. Interprovince distance data is measured using ArcGIS software’s distance function, and vector-based map data is obtained from the standard map of the Ministry of Natural Resources of China (GS(2019)1719). The weight matrix uses the following formula: W i j = 1 d i j , i f i ≠ j 0 , i f i = j ( 4 ) where d ij denotes the distance between province i and province j. To retain the main features of the spatial weight matrix as much as possible and avoid the loss of economic interpretation of the weight matrix due to distance decay, the maximum characteristic roots of the matrix are used for normalization. Before estimating the spatial econometric model, it is necessary to determine whether the variables are spatially dependent. We use Moran’s Index (Moran’s I) to perform a spatial autocorrelation test to analyze the distribution characteristics of the variables in geographic space. The formula is calculated as follows: M o r a n ′ s I = ∑ i = 1 n ∑ j = 1 n W i j x i − x ¯ x j − x ¯ s 2 ∑ i = 1 n ∑ j = 1 n W i j ( 5 ) where s 2 = 1 n ∑ i = 1 n x i − x ¯ 2 and x ¯ = 1 n ∑ i = 1 n x i . x i and x j denote observations in provinces i and j, respectively, n is the total number of provinces, and W ij is the spatial weight value between province i and province j. 3.2 Variable description and data source 3.2.1 Explained variable We measure green innovation efficiency using a super-slacks-based measure model that includes undesirable outputs. The model expressions are as follows: min ρ S E = 1 − 1 m ∑ i = 1 m s i − \/ x i k 1 + 1 s 1 + s 2 ∑ r = 1 s 1 s r + \/ y r k + ∑ t = 1 s 2 s t z − \/ z t k s . t . ∑ j = 1 , j ≠ k n x i j γ j − s i − ≤ x i k ∑ j = 1 , j ≠ k n y r j γ j + s r + ≥ y r k ∑ j = 1 , j ≠ k n z r j γ j + s t z − ≤ z r k γ , s − , s + , s z − ≥ 0 i = 1,2 , ⋯ , q ; j = 1,2 , ⋯ , n j ≠ k ( 6 ) where ρ S E is the efficiency value, x is the input variable, and y and z are the desirable and undesirable output variables, respectively. m denotes the number of input indicators; s 1 and s 2 denote the number of desirable and undesirable output indicators, respectively; k denotes the production period; and I, r, and t denote the decision units for inputs, desirable outputs, and undesirable outputs, respectively. s − , s + , and s z − are the slack variables for inputs, desirable outputs, and undesirable outputs, respectively. γ is the weight vector. Larger ρ S E values indicate higher efficiency. If ρ S E = 1, the decision unit is efficient; if ρ S E < 1, the decision unit is relatively inefficient (i.e., there is a loss of efficiency). Based on the comprehensive consideration of the existing measurement indicators, data availability, and the connotation of green innovation (Li Z. et al., 2021; Zeng W. P. et al., 2021; Zhao et al., 2021), R&D personnel input, R&D capital input, and energy input are selected as input factors, the number of green patent applications and new product sales revenue are desirable outputs, and the environmental pollution index represents undesirable outputs (Table 1). Particularly, R&D capital investment is evaluated using the perpetual inventory approach and monitored using R&D capital stock. Internal expenditure on R&D capital is chosen as the initial indicator for estimation, and deflations are corrected using the R&D price index (0.45 fixed asset investment price index plus 0.55 industrial producer ex-factory price index), with 2006 as the base period (Lv et al., 2021). Energy inputs are measured using total energy consumption converted to standard coal. Green patents are based on the IPC Green List published by the World Intellectual Property Organization, and seven green technology areas are selected to reflect green innovation, including alternative energy, transportation, energy efficiency and emissions reduction, waste treatment, agroforestry, administrative regulation and design, and nuclear power generation. The environmental pollution index is obtained using the entropy method to measure industrial wastewater, industrial waste gas, and industrial solid waste emissions. TABLE 1 TABLE 1. Input–output indicator system of energy eco-efficiency. 3.2.2 Explanatory variable According to the classification criteria of the China High Technology Statistical Yearbook (2021), the high-tech industry includes six manufacturing industries, including information chemicals, medical equipment and instrumentation, pharmaceutical, electronics and communications equipment, computer and office equipment, and aerospace equipment and machinery. The degree of industrial agglomeration is measured using location entropy, Herfindahl–Hirschman, and, EG indices and other methods. In comparison, location entropy can eliminate the scale differences between regions and truly reflect industries’ spatial distribution (Dong et al., 2020). We use the location entropy index to measure the level of high-tech industrial agglomeration, which is calculated using the following formula: H I A = e i r \/ ∑ i e i r \/ ∑ i e i r \/ ∑ i ∑ r e i r ( 7 ) where e ir denotes the number of people employed in province i’s industry r. High-tech industrial agglomeration primarily impacts green innovation efficiency through technology externalities. The main debate regarding technology externalities is whether specialized or diversified agglomeration is more conducive to knowledge and technology spillovers. Referencing Duranton and Puga (2001), the agglomeration factor is used to measure the level of specialized agglomeration (SA) and diversified agglomeration (DA) in high-tech industries. The equations are as follows: S A = max j C i j , t \/ C i , t ( 8 ) D A = 1 \/ ∑ j C i j , t − C j , t ( 9 ) where C ij,t denotes the ratio of the number of employees in industry j in the high-tech industry in province i to the number of employees in the high-tech industry in that province in period t. C i,t denotes the ratio of the number of employees in the high-tech industry in province i to the number of employees in the high-tech industry nationwide in period t. C j,t denotes the ratio of the number of employees in industry j in the high-tech industry to the number of employees in the high-tech industry nationwide in period t. 3.2.3 Control variables Environmental regulation has positive compensating and negative offsetting effects on green innovation (Zhang et al., 2020). Environmental regulation intensity (ER) is measured by the amount of investment in industrial pollution control as a proportion of total industrial output. Policy support can compensate for some high R&D expenditure and risks associated with green innovation activities for firms; however, government funding may also have a crowding-out effect on firms (Liu et al., 2022b; Li et al., 2023). Government support (GS) is measured using the proportion of fiscal science and technology expenditure in fiscal expenditure (Liu Y. et al., 2020). The level of economic development (ED) provides the material basis for scientific research, technological innovation, and environmental governance and is reflected in the logarithm of the regional real GDP per capita for the base period 2006. Technology markets are where knowledge products are traded and are key to realizing the value of technological innovation (Kaartemo and Nystrom, 2021), and the logarithm of technology market turnover is used to reflect technology market maturity (MM). Foreign direct investment (FDI) is an important channel for capturing technology spillovers and the entry point for the pollution sanctuary hypothesis (Luo et al., 2021). The ratio of actual FDI to regional GDP is used to measure the level of foreign investment (FI). 3.2.4 Data source Given the availability of data, we select 30 provinces in China (excluding Tibet, Hong Kong, Macao, and Taiwan) from 2006 to 2020 as the study sample. Based on each provincial administrative region’s distribution of natural resources and economic and social development, China is divided into eastern, central, and western economic regions. The distribution map of China’s provinces is presented in Figure 2. Indicators that construct explained variables were obtained from the EPS data platform, China Energy Statistics Yearbook and China Environment Statistics Yearbook; indicators that construct explanatory variables were obtained from the China Science and Technology Statistical Yearbook and the China High-tech Statistical Yearbook; and the control variables were obtained from the EPS data platform and the China Urban Statistical Yearbook. Descriptive statistics for the variables are shown in Table 2. FIGURE 2 FIGURE 2. Distribution map of provinces in China. TABLE 2 TABLE 2. Variable descriptive statistics. 4 Results and analysis 4.1 Evaluation of green innovation efficiency and high-tech industrial agglomeration 4.1.1 Green innovation efficiency in China The MaxDEA 7 Ultra software is used to measure the green innovation efficiency of 30 Chinese provinces from 2006 to 2020. The results of the average green innovation efficiency based on the three major economic regions of China are presented in Figure 3. FIGURE 3 FIGURE 3. The development of green innovation efficiency. Overall, the green innovation efficiency of the country showed a steady growth trend during the study period, and the green innovation efficiency of the economic regions had about the same growth trend as the country. In terms of different regions, due to its geographical location and first-mover advantage in economic development, the eastern region was significantly more efficient in green innovation than the central and western regions. In recent years, high-end manufacturing industries have shifted to the center, and the central economic zone has gradually become rich in human resources. With the knowledge spillover and technology diffusion effects of green innovation, the growth rate of green innovation efficiency in the central region has accelerated. The western economic region is vast and rich in mineral resources, and the efficiency of green innovation has improved under China’s Western Development strategy, but a large gap with the eastern and central regions remains. In the future, improvement in the human environment and infrastructure for green development in the west is essential, actively introducing talent, technology, and capital to facilitate the region’s capability to absorb and transform the green innovation spillover from eastern and central China. 4.1.2 High-tech industrial agglomeration in China The uneven character of China’s economic development determines the regional unevenness of industrial agglomeration. Table 3 presents the level of development of high-tech industrial agglomeration and different agglomeration patterns in China. In terms of the level of development of high-tech industrial agglomeration, the degree of high-tech industrial agglomeration has increased significantly, both nationally and in the three economic regions. Industrial concentration is highest in the east, and there is a decreasing gradient distribution from the east to the centre and west. The reason is that the eastern economic region has a unique geographical location and economic policy advantages that are conducive to the rapid agglomeration and development of high-tech enterprises. TABLE 3 TABLE 3. The development of high-tech industrial, specialized, and diversified agglomerations. The analysis of the changes in the development of specialized agglomeration in Table 3 shows that the degree of specialized agglomeration in the national high-tech industry is steadily rising. The central economic region initially developed more slowly, but since 2010, its specialized agglomeration has been ahead of the country, even outpacing the development of the east. As the economic development of the western region has lagged behind other regions, its degree of specialized agglomeration has also lagged relatively behind. The eastern economic region is relatively developed and initially relied on policy and location advantages to absorb technology spillovers from overseas markets and promote the specialized agglomeration of high-tech industries. With the expansion of China’s opening to the outside world, some high-tech enterprises have begun moving to the central and western regions of the country, leading to an increase in specialized concentration. Due to its geographical advantages and good industrial base, the specialization of high-tech industries in central China has developed rapidly. The level of diversified agglomerations in Table 3 shows a decreasing trend from east to centre and west. As an important base for China’s innovative industries, the eastern economic region is rich in talent and capital, and has a high degree of diversification in high-tech industries. On the basis of the original industries, the central region has taken over some of the high-tech enterprises transferred from the east, and the degree of diversification has increased. Overall, the degree of diversified agglomeration of China’s high-tech industries shows a slow downward trend, with an evident lack of momentum in diversification. 4.2 Spatial autocorrelation test Based on the standardized inverse geographical distance weight matrix, Moran’s I is used to test the spatial autocorrelation of green innovation efficiency and high-tech industrial agglomeration (Table 4). The test results show that the variables all have significant spatial autocorrelation. The Moran’s I for green innovation efficiency ranged from 0.1 to 0.3, the Moran’s I for high-tech industrial agglomeration ranged from 0.2 to 0.3, and Moran’s I for specialized and diversified agglomeration ranged from 0.1 to 0.2, all significant at the 5% level. This shows a significant positive spatial correlation and agglomeration characteristics between green innovation efficiency and high-tech industrial agglomeration. The reason is that agglomeration can generate intermediate product sharing, labour matching and learning effects, which facilitate enterprises to improve labour productivity and thus contribute to industrial agglomeration (Bao et al., 2023). The increase in green innovation efficiency contributes to sustainable economic development and an improved innovation environment, creating an interregional virtuous circle. Therefore, it is crucial to use spatial econometric models when analyzing the impact of high-tech industrial agglomeration on green innovation efficiency. TABLE 4 TABLE 4. Spatial autocorrelation test for variables. 4.3 Dynamic spatial Durbin model regression results We establish the model as a two-way stationary dynamic SDM because of the potential for bias in the estimates due to provincial differences and inter-period factors. The Hausman test indicated that the fixed effects model was significantly better than the random effects model. LR likelihood ratio and Wald tests rejected the original hypothesis that the SDM could be reduced to a spatial lag or spatial error model at the 1% significance level. Therefore, it is reasonable to choose a dynamic SDM with two-way fixed effects. The model estimation results are presented in Table 5. TABLE 5 TABLE 5. Dynamic spatial Durbin model estimation results. The time lag term for green innovation efficiency is significantly positive at the 1% level, indicating that green innovation efficiency has a significant time lag effect, and that accumulation of green technology and knowledge at the early stage will have a positive impact on green innovation at the later stage, indicating path dependence. The spatial lag coefficient of green innovation efficiency (ρ) is positive, passing the significance test of 1%, indicating that there is significant interregional interaction in green innovation efficiency, and the improvement of green innovation efficiency in a region will have a positive impact on green innovation efficiency in neighboring regions. This is largely due to the knowledge spillover effects of interregional cooperation and exchange. The agglomeration of high-tech industries is conducive to green innovation efficiency. Models (1) and (2) examine the impact of high-tech industrial agglomeration on green innovation efficiency. The coefficients of the high-tech industrial agglomeration and its spatial lag term in model (1) are significantly positive at the level of 1%, indicating that an increase in the degree of high-tech industrial agglomeration positively contributes to the green innovation efficiency of a region and surrounding areas. Industrial agglomeration can reduce the transportation and learning costs of enterprises within a cluster, improve the utilization of public resources, accelerate the exchange and dissemination of green innovation knowledge and technology, and generate knowledge and technology spillover effects, thus promoting the efficiency of green innovation. At the same time, knowledge and technology spillovers from industrial agglomeration can also contribute to green innovation in neighboring regions due to the close economic and trade ties that exist between them. Model (2) introduces a quadratic term for high-tech industrial agglomeration, but it is insignificant, indicating that there is no non-linear interaction relationship. The above results confirm Hypothesis 1. Heterogeneity exists in the impact of different industrial agglomeration patterns on green innovation efficiency. Models (3) and (4) examine the impact of specialized agglomeration on green innovation efficiency. The coefficients of the specialized agglomeration and its spatially lagged term in the model (3) are significantly negative at the 5% level. In model (4), the introduction of the quadratic term of specialized agglomeration reveals that the coefficients of the primary term of specialized agglomeration and its spatial lag term are positive and the coefficients of the quadratic term are negative, both of which are significant at the 5% level. This indicates that there is a non-linear relationship between specialized agglomeration of high-tech industries and green innovation efficiency. As the degree of specialized agglomeration increases, the efficiency of green innovation shows an inverted U-shaped curve that rises first and then falls. The reason is that while specialized agglomeration promotes green innovation efficiency through intra-industry division of labour and knowledge spillover, it tends to form a structurally homogeneous reservoir of knowledge and technology-based talent, which is not conducive to the diffusion of diversified information and technology, thus weakening the incentive for green innovation. The crowding effect of specialized agglomeration creates a scarcity of resources that can lead to unhealthy competition among firms, which inhibits the enhancement of green innovation efficiency. In addition, the region’s structurally homogeneous “knowledge pool” and “labour pool,” as well as the problem of resource scarcity, will inevitably continue to absorb resources and labour from neighboring regions, hindering the diversification of talent and technological innovation in the neighborhood. The above results support Hypothesis 2. Models (5) and (6) examine the impact of diversified agglomeration on green innovation efficiency. The coefficient of the diversified agglomeration and its spatial lag term in model (5) is significantly positive at the 1% level, indicating that the diversified agglomeration of high-tech industries is conducive to enhancing the green innovation efficiency in a region and its surrounding areas. In the spatial industrial structure of diversified agglomeration of high-tech industries, differentiated enterprises among industries can generate complementary knowledge and technology spillovers, establishing a driving force for technological innovation and promoting green innovation efficiency. In addition, a diversified pool of labour and knowledge is conducive to promoting the exchange of information and rational allocation of resources between industries, providing a good demonstration and driving force for neighboring regions, which in turn stimulates green technology innovation. Model (6) introduces a quadratic term for diversified agglomeration but is insignificant, indicating that there is no non-linear interaction relationship. Hypothesis 3 is confirmed. 4.4 Endogeneity and robustness tests We use a dynamic SDM with two-way fixed effects to mitigate the endogeneity problem that may be caused by omitted variables. Given that both high-tech industrial agglomeration and green innovation efficiency are outcome variables, there is inevitably an inverse causal relationship between the two and endogeneity issues arise. Industrial agglomeration has inertial development characteristics and may have lagged effects (Schiff, 2015); therefore, the level of industrial agglomeration with a one-period lag is selected as an instrumental variable. In addition, topographic relaxation, as a naturally occurring and objective exogenous variable, will have an impact on transport and infrastructure development, and has a significant correlation with industrial agglomeration (Mori and Smith, 2015), making it an appropriate instrumental variable. We use the system-wide instantaneous method for estimation tests. The LM and Hansen J test results justify instrumental variables by passing unidentifiable and overidentifiable tests, respectively. The estimation results are presented in models (1)–(3) in Table 6. TABLE 6 TABLE 6. Results of endogeneity and robustness tests. We take two approaches to robustness testing. The first is transforming the spatial weight matrix, which is constructed using (0, 1) neighborhoods instead of inverse geographical distances, and the estimation results are presented in models (4)–(6). Second, municipalities directly under the central government are excluded. Since municipalities are directly administered by the central government, their development plans may differ from those of prefecture-level cities (Lin and Zhu, 2021); thus, central government administered municipalities are excluded to avoid policy bias and the estimation results are presented in models (7)–(9). Table 6 reveals that the endogeneity treatment and robustness tests validate the credibility of the study’s findings. Estimated coefficients of core explanatory variables did not change significantly with the introduction of instrumental variables, and the direction of influence and significance levels remained unchanged. The robustness test results show that the transformation of the spatial weight matrix and the exclusion of municipalities did not affect the relationship between the core explanatory variables and green innovation efficiency. This indicates that the model estimation results are robust and the study findings are credible. 4.5 Heterogeneity analysis The above empirical studies mainly examine the impact of high-tech industrial agglomeration on green innovation efficiency at the national level. Due to the diversity of geographical location conditions and resource endowments in different regions of China, spatial differences are expected in both green innovation efficiency and the degree of high-tech industrial agglomeration. Therefore, we carry out grouped regressions for the eastern, central and western regions, to examine the impact of high-tech industrial agglomeration and different agglomeration patterns on green innovation efficiency from the perspective of regional heterogeneity. The estimation results of the dynamic SDM are shown in Table 7. TABLE 7 TABLE 7. Results of regional heterogeneity analysis. In terms of high-tech industrial agglomeration, the eastern, central and western economic regions contribute positively to green innovation efficiency through industrial agglomeration. The impact is stronger in the eastern region than in the central and western regions due to the relatively superior infrastructure and public services, which are conducive to the knowledge and technology spillover dividends that the high-tech industrial agglomeration can bring to green development. At the same time, the relatively developed economic and social environment of the eastern region also has a clear advantage in attracting highly skilled personnel and capital. This highlights the importance of developing policy guidelines to rationally promote the clustering and coordinated development of high-tech enterprises in each region. Regarding specialized agglomeration, the eastern region’s specialized agglomeration has a negative impact on green innovation efficiency, the specialized agglomeration in the central economic region has an inverted U-shaped relationship with green innovation efficiency, and the specialized agglomeration in the western economic region is conducive to improving green innovation efficiency. The reason may be that the eastern region has a developed economy and a high concentration of high-tech enterprises. Specialized agglomeration can cause problems such as traffic congestion, resource shortages, and rising production costs, which inhibit green innovation efficiency. During the study period, specialized agglomeration in the central region developed rapidly, and under the combined effect of positive and negative externalities generated by specialized agglomeration, green innovation efficiency showed an upward and then downward trend. In the western region, the degree of high-tech industrial agglomeration is low, and the crowding effect generated by specialized agglomeration is insignificant, indicating a positive agglomeration effect on green innovation efficiency. The diversified agglomeration of high-tech industries in the eastern, central and western economic regions indicates a significant contribution to green innovation efficiency. This is consistent with the test results of national data. Diversified agglomeration forms a diverse pool of labour and knowledge, which is conducive to stimulating the technological innovation of enterprises and promoting green technological innovation. In addition, diversified agglomeration facilitates the easy provision of intermediate products between firms and reduce transport and transaction costs, thus creating conditions for saving resources and reducing undesirable output, and thus enhancing the green innovation efficiency. In the future, a balanced spatial distribution of high-tech enterprises, the coordinated development of industries across regions, and the level of diversified agglomeration in each province should be promoted. 5 Conclusion and discussion 5.1 Conclusions Green development is a critical component of China’s new era of high-quality economic development, and improving the efficiency of green innovation is essential for achieving green development. As a strategic industry for economic development, the high-tech industry has considerable advantages in reducing energy use, improving efficiency, and promoting economic structural transformation, and is an important driving force for achieving green innovation. We reveal the mechanism of the effect of high-tech industrial agglomeration on green innovation efficiency through theoretical analysis. Using a sample of 30 Chinese provinces from 2006 to 2020, we establish a dynamic SDM to empirically test the effect of high-tech industrial agglomeration on green innovation efficiency, conducting a comprehensive analysis of the impact of different agglomeration patterns. The relevant findings are threefold. 1) China’s green innovation efficiency and high-tech industrial agglomeration level exhibit a stable growth trend, and spatial distribution is roughly characterized by a gradual decrease from east to west. Specialized agglomeration is rapidly developing, while diversified agglomeration is relatively underdeveloped. 2) At the national level, high-tech industrial agglomeration has a significant effect on green innovation efficiency, and different agglomeration patterns have heterogeneous effects. There is an inverted U-shaped relationship between specialized agglomeration and green innovation efficiency, while diversified agglomeration is conducive to promoting green innovation efficiency. 3) Regional heterogeneity in the impact of high-tech industrial agglomeration and different agglomeration patterns on green innovation efficiency is evident. The promotional effect of high-tech industrial agglomeration on green innovation efficiency is significant in all three economic regions, and the intensity of this effect is decreasing. Specialized agglomeration in the eastern economic region has a significant negative impact on green innovation efficiency, while the central economic region shows an inverted U-shaped relationship, while specialized agglomeration in the western economic region is conducive to promoting green innovation efficiency. Welcoming the results of the national test, the diversified agglomeration within the three economic regions makes an important contribution to green innovation efficiency. 5.2 Policy implications The findings of our study provide policymakers with three practical implications for improving green innovation. First, the development of high-tech industrial agglomeration should be accelerated. In terms of macro policy formulation, emphasis should be placed on coordinated national planning, deepening structural reform on the supply side, actively nurturing and introducing high-tech enterprises, strengthening the spatial clustering of high-tech industries, and effectively releasing the potential of high-tech development regions to enhance green innovation efficiency. The government should seize the opportunities presented by the paradigm shift of the digital economy and promote digitization, intelligence and greening in high-tech industries, prioritize strategic emerging industries and green industry clusters, accelerate the upgrading and transformation of obsolete production capacity, and promote the integration of high-end and green industries (Prah, 2022). Second, diversified agglomeration of high-tech industries should be promoted to achieve diversified development of high-tech enterprises. A large number of science and technology elements and innovation resources are gathered in high-tech industrial clusters, which should be leveraged to promote the transfer and production of green innovation knowledge and technology among enterprises by building diversified application scenarios to continuously stimulate the generation of new products, technologies and business models. The government should actively guide the regulation of competition and cooperation among high-tech enterprises to avoid large-scale homogenous clustering and the resulting crowding effects (Tsuji, 2022). Third, policy guidelines should be developed to promote the development of high-tech industrial agglomeration in accordance with local conditions (Atta-Mensah, 2021). In view of the development status of China’s three major economic zones, when guiding high-tech industrial agglomeration, industrial support policies and key development areas should be identified in relation to the specific stage they are in to effectively leverage the positive externalities of industrial agglomeration and generate the synergistic enhancement of the regional economy, innovation capacity, and ecological environment. The eastern economic region has the advantage of high-tech concentration and the development of intensive industries. The region should actively implement industrial transfer policies to transfer over-specialized labour-intensive industries to the central and western regions, promote industrial structure upgrading, and increase the level of diversified agglomeration. The central economic region should build on the sound development of existing industries and transfer into a number of coordinated and relevant industries to effectively absorb the spillover effects of knowledge and technology. Considering factors such as economic development, industrial base, and human resources, it is appropriate for the western economic region to prioritize the development of industries with regional characteristics and policy-oriented industries and actively receive a continuous inflow of capital, talent, and other resources that can be transformed into green innovation outputs. 5.3 Limitations and future directions Although detailed theoretical analysis and empirical testing are carried out, there are still areas worth further expansion in future research. First, we recognize that the provincial panel data used have sampling limitations because they ignore regional and international variations. In emerging economies, where various resource endowments and cultural values may have an impact on the linkages between variables, high-tech industrial agglomeration is a complex issue. As data availability and statistics improve, future research should test these results at the level of other emerging countries and cities. Second, our measurement of high-tech industrial agglomeration is only considered by industry as a whole, and further research on the agglomeration effect of sub-sectors is encouraged. Finally, given the complex impact of high-tech industrial agglomeration and different agglomeration patterns on green innovation efficiency, a non-parametric spatial model could be applied in the future to analyze the non-linear interaction between them. Data availability statement Publicly available datasets were analyzed in this study. This data can be found here: https:\/\/www.epsnet.com.cn\/index.html#\/Index. Author contributions SL: writing-original draft preparation, methodology, conceptualization. PW: writing—reviewing and editing, validation, supervision. All authors have read and agreed to the published version of the manuscript. Funding This work was supported by the Major Program of National Fund of Philosophy and Social Science of China (20&ZD133). Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Atta-Mensah, J. (2021). Commodity-linked bonds as an innovative financing instrument for African countries to build back better. Quantitative Finance Econ. 5 (3), 516–541. doi:10.3934\/QFE.2021023 CrossRef Full Text | Google Scholar Boons, F., and Ludeke-Freund, F. (2013). Business models for sustainable innovation: State-of-the-art and steps towards a research agenda. J. Clean. Prod. 45, 9–19. doi:10.1016\/j.jclepro.2012.07.007 CrossRef Full Text | Google Scholar Campos, F. S., David, J., Lourenço-de-Moraes, R., Rodrigues, P., Silva, B., Vieira da Silva, C., et al. (2021). The economic and ecological benefits of saving ecosystems to protect services. J. Clean. Prod. 311 (15), 127551. doi:10.1016\/j.jclepro.2021.127551 CrossRef Full Text | Google Scholar Chen, C. P., Ding, Y. J., and Liu, S. Y. (2008). City economical function and industrial development: Case study along the railway line in north Xinjiang in China. J. Urban Plan. Dev. 134 (4), 153–158. doi:10.1061\/(asce)0733-9488(2008)134:4(153) CrossRef Full Text | Google Scholar Chen, J., Cheng, J. H., and Dai, S. (2017). Regional eco-innovation in China: An analysis of eco-innovation levels and influencing factors. J. Clean. Prod. 153 (1), 1–14. doi:10.1016\/j.jclepro.2017.03.141 CrossRef Full Text | Google Scholar Chen, L. M., and Huo, C. J. (2022). The measurement and influencing factors of high-quality economic development in China. Sustainability 14 (15), 9293. doi:10.3390\/su14159293 CrossRef Full Text | Google Scholar Chen, M., and Wang, H. B. (2022). Import technology sophistication and high-quality economic development: Evidence from city-level data of China. Econ. Research-Ekonomska Istraživanja 35 (1), 1106–1141. doi:10.1080\/1331677x.2021.1956362 CrossRef Full Text | Google Scholar Chen, Y., Cook, W. D., Kao, C., and Zhu, J. (2013). Network DEA pitfalls: Divisional efficiency and frontier projection under general network structures. Eur. J. Operational Res. 226 (3), 507–515. doi:10.1016\/j.ejor.2012.11.021 CrossRef Full Text | Google Scholar Ding, J., Liu, B. L., and Shao, X. F. (2022). Spatial effects of industrial synergistic agglomeration and regional green development efficiency: Evidence from China. Energy Econ. 112, 106156. doi:10.1016\/j.eneco.2022.106156 CrossRef Full Text | Google Scholar Dong, F., Wang, Y., Zheng, L., Li, J. Y., and Xie, S. X. (2020). Can industrial agglomeration promote pollution agglomeration? Evidence from China. J. Clean. Prod. 246, 118960. doi:10.1016\/j.jclepro.2019.118960 CrossRef Full Text | Google Scholar Dong, X., Fu, W. S., Yang, Y. L., Liu, C. U., and Xue, G. Z. (2022). Study on the evaluation of green technology innovation efficiency and its influencing factors in the central plains city cluster of China. Sustainability 14 (17), 11012. doi:10.3390\/su141711012 CrossRef Full Text | Google Scholar Du, J. L., Liu, Y., and Diao, W. X. (2019). Assessing regional differences in green innovation efficiency of industrial enterprises in China. Int. J. Environ. Res. Public Health 16 (6), 940. doi:10.3390\/ijerph16060940 PubMed Abstract | CrossRef Full Text | Google Scholar Duranton, G., and Puga, D. (2001). Nursery cities: Urban diversity, process innovation, and the life cycle of products. Am. Econ. Rev. 91 (5), 1454–1477. doi:10.1257\/aer.91.5.1454 CrossRef Full Text | Google Scholar Dyck, B., and Silvestre, B. S. (2018). Enhancing socio-ecological value creation through sustainable innovation 2.0: Moving away from maximizing financial value capture. J. Clean. Prod. 171, 1593–1604. doi:10.1016\/j.jclepro.2017.09.209 CrossRef Full Text | Google Scholar Fallah, B., Partridge, M. D., and Rickman, D. S. (2014). Geography and high-tech employment growth in US counties. J. Econ. Geogr. 14 (4), 683–720. doi:10.1093\/jeg\/lbt030 CrossRef Full Text | Google Scholar Garau, G. (2022). Total factor productivity and relative prices: The case of Italy. Natl. Account. Rev. 4 (1), 16–37. doi:10.3934\/NAR.2022002 CrossRef Full Text | Google Scholar Gu, W., Liu, D., Wang, C., Dai, S. F., and Zhang, D. H. (2020). Direct and indirect impacts of high-tech industry development on CO 2 emissions: Empirical evidence from China. Environ. Sci. Pollut. Res. 27 (21), 27093–27110. doi:10.1007\/s11356-020-09071-x CrossRef Full Text | Google Scholar He, W. C., Li, E. L., and Cui, Z. Z. (2021). Evaluation and influence factor of green efficiency of China’s agricultural innovation from the perspective of technical transformation. Chin. Geogr. Sci. 31 (2), 313–328. doi:10.1007\/s11769-021-1192-x CrossRef Full Text | Google Scholar Kaartemo, V., and Nystrom, A. G. (2021). Emerging technology as a platform for market shaping and innovation. J. Bus. Res. 124, 458–468. doi:10.1016\/j.jbusres.2020.10.062 CrossRef Full Text | Google Scholar Lechner, C., and Leyronas, C. (2012). The competitive advantage of cluster firms: The priority of regional network position over extra-regional networks - a study of a French high-tech cluster. Entrepreneursh. Regional Dev. 24 (5-6), 457–473. doi:10.1080\/08985626.2011.617785 CrossRef Full Text | Google Scholar Lee, C. Y., and Johnson, A. L. (2014). Proactive data envelopment analysis: Effective production and capacity expansion in stochastic environments. Eur. J. Operational Res. 232 (3), 537–548. doi:10.1016\/j.ejor.2013.07.043 CrossRef Full Text | Google Scholar Li, T. C., Liang, L., and Han, D. R. (2018). Research on the efficiency of green technology innovation in China’s provincial high-end manufacturing industry based on the Raga-PP-SFA model. Math. Problems Eng. 1, 1–13. doi:10.1155\/2018\/9463707 CrossRef Full Text | Google Scholar Li, X., Lai, X. D., and Zhang, F. C. (2021). Research on green innovation effect of industrial agglomeration from perspective of environmental regulation: Evidence in China. J. Clean. Prod. 288, 125583. doi:10.1016\/j.jclepro.2020.125583 CrossRef Full Text | Google Scholar Li, Z., Huang, Z., and Su, Y. (2023). New media environment, environmental regulation and corporate green technology innovation: Evidence from China. Energy Econ. 119, 106545. doi:10.1016\/j.eneco.2023.106545 CrossRef Full Text | Google Scholar Li, Z. H., Zhu, J. H., and He, J. J. (2022). The effects of digital financial inclusion on innovation and entrepreneurship: A network perspective. Electron. Res. Archive 30 (12), 4697–4715. doi:10.3934\/era.2022238 CrossRef Full Text | Google Scholar Li, Z., Zou, F., and Mo, B. (2021). Does mandatory CSR disclosure affect enterprise total factor productivity? Econ. Research-Ekonomska Istraživanja 35 (1), 4902–4921. doi:10.1080\/1331677X.2021.2019596 CrossRef Full Text | Google Scholar Liang, X. D., Si, D. Y., Zhang, X. L., Ren, T., Du, X., Chen, Q., et al. (2018). An empirical study on green innovation efficiency in the green institutional environment. Sustainability 10 (3), 724. doi:10.3390\/su10030724 CrossRef Full Text | Google Scholar Lin, B., and Zhu, J. (2021). Impact of China’s new-type urbanization on energy intensity: A city-level analysis. Energy Econ. 99, 105292. doi:10.1016\/j.eneco.2021.105292 CrossRef Full Text | Google Scholar Liu, C. Y., Gao, X. Y., Ma, W. L., and Chen, X. T. (2020). Research on regional differences and influencing factors of green technology innovation efficiency of China’s high-tech industry. J. Comput. Appl. Math. 369, 112597. doi:10.1016\/j.cam.2019.112597 CrossRef Full Text | Google Scholar Liu, F. Y., and Liu, C. Z. (2019). Regional disparity, spatial spillover effects of urbanisation and carbon emissions in China. J. Clean. Prod. 241, 118226. doi:10.1016\/j.jclepro.2019.118226 CrossRef Full Text | Google Scholar Liu, X. P., and Zhang, X. L. (2021). Industrial agglomeration, technological innovation and carbon productivity: Evidence from China. Resour. Conservation Recycl. 166, 105330. doi:10.1016\/j.resconrec.2020.105330 CrossRef Full Text | Google Scholar Liu, Y., Failler, P., and Liu, Z. (2022b). Impact of environmental regulations on energy efficiency: A case study of China’s air pollution prevention and control action plan. Sustainability 14 (6), 3168. doi:10.3390\/su14063168 CrossRef Full Text | Google Scholar Liu, Y., Li, Z., and Xu, M. (2020). The influential factors of financial cycle spillover: Evidence from China. Emerg. Mark. Finance Trade 56 (6), 1336–1350. doi:10.1080\/1540496x.2019.1658076 CrossRef Full Text | Google Scholar Luo, X., and Zhang, W. Y. (2021). Green innovation efficiency: A threshold effect of research and development. Clean Technol. Environ. Policy 23, 285–298. doi:10.1007\/s10098-020-01977-x CrossRef Full Text | Google Scholar Luo, Y. S., Salman, M., and Lu, Z. N. (2021). Heterogeneous impacts of environmental regulations and foreign direct investment on green innovation across different regions in China. Sci. Total Environ. 759, 143744. doi:10.1016\/j.scitotenv.2020.143744 PubMed Abstract | CrossRef Full Text | Google Scholar Lv, C. C., Shao, C. H., and Lee, C. C. (2021). Green technology innovation and financial development: Do environmental regulation and innovation output matter? Energy Econ. 98, 105237. doi:10.1016\/j.eneco.2021.105237 CrossRef Full Text | Google Scholar Mendonca, S. (2009). Brave old world: Accounting for 'high-tech' knowledge in 'low-tech' industries. Res. Policy 38 (3), 470–482. doi:10.1016\/j.respol.2008.10.018 CrossRef Full Text | Google Scholar Mori, T., and Smith, T. E. (2015). On the spatial scale of industrial agglomerations. J. Urban Econ. 89, 1–20. doi:10.1016\/j.jue.2015.01.006 CrossRef Full Text | Google Scholar Ostergaard, C. R., and Park, E. (2015). What makes clusters decline? A study on disruption and evolution of a high-tech cluster in Denmark. Reg. Stud. 49 (5), 834–849. doi:10.1080\/00343404.2015.1015975 CrossRef Full Text | Google Scholar Ozcan, S., and Islam, N. (2014). Collaborative networks and technology clusters - the case of nanowire. Technol. Forecast. Soc. Change 82, 115–131. doi:10.1016\/j.techfore.2013.08.008 CrossRef Full Text | Google Scholar Pei, Y., Zhu, Y. M., Liu, S. X., and Xie, M. L. (2021). Industrial agglomeration and environmental pollution: Based on the specialized and diversified agglomeration in the Yangtze River Delta. Environ. Dev. Sustain. 23 (3), 4061–4085. doi:10.1007\/s10668-020-00756-4 CrossRef Full Text | Google Scholar Prah, G. J. (2022). Innovation and economic performance: The role of financial development. Quantitative Finance Econ. 6 (4), 696–721. doi:10.3934\/QFE.2022031 CrossRef Full Text | Google Scholar Qiu, D., and Li, D. J. (2021). Comments on the \"SSF Report\" from the perspective of economic statistics. Green Finance 3 (4), 403–463. doi:10.3934\/GF.2021020 CrossRef Full Text | Google Scholar Ren, S. Y., and Wu, H. T. (2022). Path to green development: The role environmental regulation and labor skill premium on green total factor energy efficiency. Green Finance 4 (4), 387–410. doi:10.3934\/GF.2022019 CrossRef Full Text | Google Scholar Rennings, K. (2000). Redefining innovation — Eco-innovation research and the contribution from ecological economics. Ecol. Econ. 32 (2), 319–332. doi:10.1016\/s0921-8009(99)00112-3 CrossRef Full Text | Google Scholar Semenenko, I., Bilous, Y., and Halhash, R. (2022). The compliance of the regional development strategies and funding with the sustainable development concept: The case of Ukraine. Green Finance 4 (2), 159–178. doi:10.3934\/GF.2022008 CrossRef Full Text | Google Scholar Shen, T. T., Li, D. J., Jin, Y. Y., and Li, J. (2022). Impact of environmental regulation on efficiency of green innovation in China. Atmosphere 13 (5), 767. doi:10.3390\/atmos13050767 CrossRef Full Text | Google Scholar Shuen, A., Feiler, P. F., and Teece, D. J. (2014). Dynamic capabilities in the upstream oil and gas sector: Managing next generation competition. Energy Strategy Rev. 3, 5–13. doi:10.1016\/j.esr.2014.05.002 CrossRef Full Text | Google Scholar Simonen, J., Svento, R., and Juutinen, A. (2015). Specialization and diversity as drivers of economic growth: Evidence from High-Tech industries. Pap. Regional Sci. 94 (2), 229–247. doi:10.1111\/pirs.12062 CrossRef Full Text | Google Scholar Song, Z. M., and Zhang, N. (2020). Research on green innovation efficiency of ListedChinese energy companies based on triple bottom line. Complexity 2020, 3450471. doi:10.1155\/2020\/3450471 CrossRef Full Text | Google Scholar Tsuji, C. (2022). The meaning of structural breaks for risk management: New evidence, mechanisms, and innovative views for the post-COVID-19 era. Quantitative Finance Econ. 6 (2), 270–302. doi:10.3934\/QFE.2022012 CrossRef Full Text | Google Scholar Wang, M. X., Li, L., and Lan, H. Y. (2021). The measurement and analysis of technological innovation diffusion in China's manufacturing industry. Natl. Account. Rev. 3 (4), 452–471. doi:10.3934\/NAR.2021024 CrossRef Full Text | Google Scholar Wang, M. X., Li, Y. L., and Liao, G. K. (2022). Spatial spillover and interaction between high-tech industrial agglomeration and urban ecological efficiency. Front. Environ. Sci. 10, 829851. doi:10.3389\/fenvs.2022.829851 CrossRef Full Text | Google Scholar Wang, W. X., Yu, B., Yan, X., Yao, X. L., and Liu, Y. (2017). Estimation of innovation’s green performance: A range-adjusted measure approach to assess the unified efficiency of China’s manufacturing industry. J. Clean. Prod. 149, 919–924. doi:10.1016\/j.jclepro.2017.02.174 CrossRef Full Text | Google Scholar Wu, J. Z., Ge, Z. M., Han, S. Q., Xing, L. W., Zhu, M. S., Zhang, J., et al. (2020). Impacts of agricultural industrial agglomeration on China’s agricultural energy efficiency: A spatial econometrics analysis. J. Clean. Prod. 260, 121011. doi:10.1016\/j.jclepro.2020.121011 CrossRef Full Text | Google Scholar Wu, K., You, K. R., Ren, H., and Gan, L. (2022). The impact of industrial agglomeration on ecological efficiency: An empirical analysis based on 244 Chinese cities. Environ. Impact Assess. Rev. 96, 106841. doi:10.1016\/j.eiar.2022.106841 CrossRef Full Text | Google Scholar Xu, D., Yu, B., and Liang, L. N. (2022). High-tech industrial agglomeration and urban innovation in China’s Yangtze River Delta Urban Agglomeration: From the perspective of industrial structure optimization and industrial attributes. Complexity 2022, 1–14. doi:10.1155\/2022\/2555182 CrossRef Full Text | Google Scholar Xu, Y., Li, X. Y., Tao, C. Q., and Zhou, X. (2022). Connected knowledge spillovers, technological cluster innovation and efficient industrial structure. J. Innovation Knowl. 7 (3), 100195. doi:10.1016\/j.jik.2022.100195 CrossRef Full Text | Google Scholar Zandiatashbar, A., and Hamidi, S. (2021). Transportation amenities and high-tech firm location: An empirical study of high-tech clusters. Transp. Res. Rec. 2675 (12), 820–831. doi:10.1177\/03611981211031219 CrossRef Full Text | Google Scholar Zeng, J. Y., Skare, M., and Lafont, J. (2021). The co-integration identification of green innovation efficiency in Yangtze River Delta region. J. Bus. Res. 134, 252–262. doi:10.1016\/j.jbusres.2021.04.023 CrossRef Full Text | Google Scholar Zeng, W. P., Li, L., and Huang, Y. (2021). Industrial collaborative agglomeration, marketization, and green innovation: Evidence from China’s provincial panel data. J. Clean. Prod. 279, 123598. doi:10.1016\/j.jclepro.2020.123598 CrossRef Full Text | Google Scholar Zhang, J. X., Kang, L., Li, H., Ballesteros-Perez, P., Skitmore, M., and Zuo, J. (2020). The impact of environmental regulations on urban Green innovation efficiency: The case of Xi’an. Sustain. Cities Soc. 57, 102123. doi:10.1016\/j.scs.2020.102123 CrossRef Full Text | Google Scholar Zhang, M. F., Hong, Y. X., Wang, P., and Zhu, B. Z. (2022). Impacts of environmental constraint target on green innovation efficiency: Evidence from China. Sustain. Cities Soc. 83, 103973. doi:10.1016\/j.scs.2022.103973 CrossRef Full Text | Google Scholar Zhang, W. X., Wang, B., Wang, J., Wu, Q., and Wei, Y. D. (2022). How does industrial agglomeration affect urban land use efficiency? A spatial analysis of Chinese cities. Land Use Policy 119, 106178. doi:10.1016\/j.landusepol.2022.106178 CrossRef Full Text | Google Scholar Zhao, N., Liu, X. J., Pan, C. F., and Wang, C. Y. (2021). The performance of green innovation: From an efficiency perspective. Socio-Economic Plan. Sci. 78, 101062. doi:10.1016\/j.seps.2021.101062 CrossRef Full Text | Google Scholar Zhao, P. J., Zeng, L. E., Lu, H. Y., Zhou, Y., Hu, H. Y., and Wei, X. Y. (2020). Green economic efficiency and its influencing factors in China from 2008 to 2017: Based on the super-SBM model with undesirable outputs and spatial Dubin model. Sci. Total Environ. 741, 140026. doi:10.1016\/j.scitotenv.2020.140026 PubMed Abstract | CrossRef Full Text | Google Scholar Zhu, J. H., and Li, Z. H. (2021). Can digital financial inclusion effectively stimulate technological innovation of agricultural enterprises?—a case study on China. Natl. Account. Rev. 3 (4), 398–421. doi:10.3934\/NAR.2021021 CrossRef Full Text | Google Scholar","filter_flag":1}
{"title":"ISGEC receives ESP-related order from Mahagenco - Your Gateway to Power Transmission & Distribution - T&D India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9pc2dlYy1yZWNlaXZlcy1lc3AtcmVsYXRlZC1vcmRlci1mcm9tLW1haGFnZW5jby_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9pc2dlYy1yZWNlaXZlcy1lc3AtcmVsYXRlZC1vcmRlci1mcm9tLW1haGFnZW5jby_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9pc2dlYy1yZWNlaXZlcy1lc3AtcmVsYXRlZC1vcmRlci1mcm9tLW1haGFnZW5jby_SAQA","guidislink":false,"published":"Mon, 27 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=86, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9pc2dlYy1yZWNlaXZlcy1lc3AtcmVsYXRlZC1vcmRlci1mcm9tLW1haGFnZW5jby_SAQA?oc=5\" target=\"_blank\">ISGEC receives ESP-related order from Mahagenco - Your Gateway to Power Transmission & Distribution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ISGEC receives ESP-related order from Mahagenco - Your Gateway to Power Transmission & Distribution - T&D India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9pc2dlYy1yZWNlaXZlcy1lc3AtcmVsYXRlZC1vcmRlci1mcm9tLW1haGFnZW5jby_SAQA?oc=5\" target=\"_blank\">ISGEC receives ESP-related order from Mahagenco - Your Gateway to Power Transmission & Distribution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","source.href":"https:\/\/www.tndindia.com","source.title":"T&D India","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Orders & Contracts ISGEC receives ESP-related order from Mahagenco T&D India T&D India March 27, 2023 Share ISGEC Heavy Engineering Ltd has received an order related to the renovation and modernization (R&M) of electrostatic precipitators (ESPs). In a stock exchange communication, IGSEC said that this order, valued at Rs.197.25 crore, was placed by Maharashtra State Power Generation Company Ltd (Mahagenco) and relates to ESPs installed at the utility’s 2×500-mw Chandrapur thermal power plant located in Chandrapur district, Maharashtra. The ESPs shall be retrofitted and modernised for particulate emission reduction in order to meet the latest emission norms and guidelines for thermal power plants, ISGEC said. The scope of work includes complete design, engineering, supply, assembly, erection, commissioning and performance guarantee testing for ESP retrofitting\/upgradation of 2×500-mw units (No.5 and No.6) of the said power plant. “ESP is one of our major products in air pollution control equipment portfolio apart from DeSOx and DeNOx solutions. We are already executing an order for Mahagenco for Dry Sorbent Injection (DSI) based DeSOx system and are really excited to receive this prestigious order for ESP R&M from the same customer. We are all geared up to take on and successfully execute this project, ” noted said Suman Jain, Group Head – Utility Boilers, Air Pollution Control Equipment & New Technology Development, ISGEC Heavy Engineering Ltd. Also read:ISGEC Heavy Engineering Lands Order For Waste-To-Energy Boilers Collaboration agreement In an independent development, ISGEC Heavy Engineering also announced that it has entered into a collaboration and licensing agreement with US-based United Conveyor Corporation (UCC), on March 24, 2023. The purpose of the agreement is to bid and execute ash handling projects for thermal power projects in India, ISGEC said in a stock exchange filing. Both parties shall work exclusively with each other for projects mutually identified for bidding, the filing said. The featured photograph shows a long view of Mahagenco’s Chandrapur superthermal power project in Maharashtra. According to the information available, the Chandrapur thermal power plant has an installed capacity of 2,920 MW coming from two units of 210 MW and five of 500 MW.","filter_flag":1}
{"title":"Old technology, new market - Medical Buyer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3Lm1lZGljYWxidXllci5jby5pbi9vbGQtdGVjaG5vbG9neS1uZXctbWFya2V0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3Lm1lZGljYWxidXllci5jby5pbi9vbGQtdGVjaG5vbG9neS1uZXctbWFya2V0L9IBAA?oc=5","id":"CBMiOWh0dHBzOi8vd3d3Lm1lZGljYWxidXllci5jby5pbi9vbGQtdGVjaG5vbG9neS1uZXctbWFya2V0L9IBAA","guidislink":false,"published":"Wed, 29 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=88, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3Lm1lZGljYWxidXllci5jby5pbi9vbGQtdGVjaG5vbG9neS1uZXctbWFya2V0L9IBAA?oc=5\" target=\"_blank\">Old technology, new market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medical Buyer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Old technology, new market - Medical Buyer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3Lm1lZGljYWxidXllci5jby5pbi9vbGQtdGVjaG5vbG9neS1uZXctbWFya2V0L9IBAA?oc=5\" target=\"_blank\">Old technology, new market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medical Buyer<\/font>","source.href":"https:\/\/www.medicalbuyer.co.in","source.title":"Medical Buyer","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Players are enhancing and adding newer features to differentiate their product offerings in the fiercely competitive MS market. These not only improve the performance of routine tasks but also make it simpler to carry out challenging tasks as analysis of biomarkers and biologic drugs. Analytical chemistry’s workhorse is mass spectrometry. Mass spectrometers are a crucial component of the market for analytical instrumentation because they analyze the sample. However, a recent change in the laboratory environment is requiring a change in the shape and capabilities of mass spectrometry equipment. Shorter testing times, faster throughput, and smaller footprint requirements for laboratories are driving the market to create more compact, higher-performing systems. Indian market dynamics The Indian mass spectrometers market gained huge traction in 2022. Estimated at ₹710.4 crore, it saw an 84.5 percent increase over 2021 by value. By quantity the market increased from 268 units in 2021 to 458 units in 2022, a 71 percent increase. Major players. SCIEX, Waters and Agilent dominate the market. New products are being launched by them regularly, and they are upbeat on their grip on the market. Leading players* 2022 Segment Major Players Single Quadrupole Waters, Shimadzu, Agilent, and Thermo Fisher Scientific Triple Quadrupole SCIEX, Waters, Shimadzu, Agilent, and Thermo Fisher Scientific ion trap Thermo Fisher Scientific Q trap SCIEX MALDI-TOF & MALDI TOF-TOF Biomerieux, Shimadzu, and Bruker HRMS (includes Q TOF and Orbitrap) SCIEX, Waters, Agilent, Thermo Fisher Scientific, and Bruker *Vendors are placed in different tiers on the basis of their sales contribution to the overall revenues of the Indian mass spectrometers market. ADI Media Research Other players in this segment include Thermo Fisher Scientific, Shimadzu and Bruker. The world’s smallest MALDI-TOF imaging solution from Shimadzu features a dual-polarity ion source. Suitable for users starting out in the world of biomolecular imaging, the compact format of the Shimadzu benchtop MALDI-TOF system provides a welcoming platform by combining the ease of MALDI analysis with extremely intuitive software in an all-inclusive imaging kit. The system can serve as an ideal teaching tool to introduce users to MALDI imaging. In addition, it offers a low-cost entry point to users who would like to see what MALDI imaging can offer for their workflow. bioMérieux is leading the MALDI TOF segment, with VITEK MS being its fast-moving model. An automated mass spectrometry microbial identification system it contains a comprehensive FDA 510(k) cleared database for bacteria and fungi, including mycobacteria, Nocardia, and molds—now including Brucella, Candida auris, and Elizabethkingia anophelis. The HRMS segment estimated at ₹145 crore, with 56 units in 2022, saw a major increase over 2021. Thermo Fisher Scientific leads the pack. The vendor has had success with its newest Orbitrap Ascend Tribrid, a high-end instrument aimed at proteomic and biopharma applications. The addition of a second collision cell is the most significant advance in the new system, as this feature improves the speed of the instrument and allows researchers to analyze more of the ions introduced into the machine. The instrument can accumulate ions (in a collision cell) while doing an analysis in the Orbitrap or the ion trap, as it gives an enhancement in sensitivity, key for low-level proteins. Complex technology, high entry cost and shortage of trained manpower are potent combinations to restrict entry of new players. August 2022 saw the exit of PerkinElmer through a sale to private equity firm New Mountain Capital, divest its food safety, environmental testing and industrial quality assurance divisions, including its chromatography and mass spectrometry hardware made for use in forensics, semiconductor manufacturing, chemical production and more. The government is active in this segment. The state government agencies and Public Sector Undertakings have invited bids for 7 single quadrupole mass spectrometers so far in 2023. These include 3 units by Telengana, 2 units by Kerala, 1 unit each from Maharashtra and Gujarat state government. Other bids have been invited by CSIR, NDDB, DST and MoFAHD. Increasing government spending, cost benefits in terms of affordable manpower, real estate expenses compared to other global markets and growing startups are providing impetus to the industry. Drugs of abuse analysis at the fingertips Bhaumik Trivedi Assistant Manager, Clinical & Diagnostic Business Development, Shimadzu Analytical (India) Pvt Ltd Drugs of abuse is use of illegal drugs or the use of prescription or over-the-counter drugs for purposes other than those for which they are meant to be used, or in excessive amounts. Drug abuse may lead to social, physical, emotional, and job-related problems. “Drug abuse is an exclusively urban phenomenon is a myth,” said Gary Lewis, the South Asia regional representative of the UN Office on Drugs and Crime. Abuse of such drugs can lead to physical and mental damage as well as leads to dependence and addiction. To understand the prevalence of drug abuse in India, a study was conducted by the Ministry of Social Justice and Empowerment (MoSJE). As per the 2019 report, 14.6 percent of the population uses alcohol. It is higher among men than women. It was found that 2.8 percent of the population uses Cannabis. For overcoming the burden Ministry of Social Justice & Empowerment which is the Nodal Ministry for Drug Demand Reduction has formulated and launched Nasha Mukt Bharat Abhiyaan (NMBA) on August 15, 2020. Liquid Chromatography Mass Spectrometry [LC-MS\/MS] is the go-to technology. Testing for drugs of abuse can be used to Discover drug abuse; Monitor someone who has a substance abuse problem; Detect drug intoxication; and Determine the overdosed drug. Moreover, these tests will have the potential to improve the quality of clinical management in emergencies and can be used as evidence in court of law. Conventional immunoassays can be sometime regarded as speculative owing to following limitations: The results are frequently class-specific and cannot be linked to a single medication or drug metabolite, and Cross-react with structurally related and unrelated substances, resulting in false-positive results. This is where LC-MS\/MS will have an EDGE. With numerous advantages like ultra-high sensitivity, capability to handle heavy workload due to automation, artificial intelligence, ease of operation and software capabilities, LC-MS\/MS will always have an upper hand as a reliable analytical tool in drugs of abuse testing. Gaining popularity of California Certified Organic Farmers (CCOF) has also given a push to this segment. CCOF certification under the Global Market Access (GMA) program allows for export to Europe without requiring import licenses. This eliminates the need for additional certifications, paperwork, and expenses and exporting companies to EU collectively concentrate on core organic certification issues and shift away from minor differences in international standards. There is rising demand for mass spectrometry from the food and beverage testing industry. The scheme of setting up and upgradation of food testing laboratories by Ministry of Food Processing Industries (MOFPI) introduced on June 8, 2022 is another driver. The food facilities so created under the Scheme are made available to the food processing units for testing their products. The Indian market is expected to witness the highest growth in the contract development and manufacturing organization (CDMO) space due to the low cost of the R&D and manufacturing side, not to mention the highly skilled workforce. The biggest advantage in outsourcing to India is the cost benefit compared to the United States and Europe; it is estimated that the cost of outsourcing to India is 37.5 percent lower than this competition. Another major advantage in outsourcing to India is the world class manufacturing facilities available. Additionally, Indian CDMO’s have an outstanding track record. In the pharmaceutical industry, India is the largest exporter of OTC’s to the United States with over 40% of the market share, meaning that we will not be missing out on the quality of the drug due to years of experience. There have been many companies that have enjoyed recent success; Biocon, Sai Life Sciences, GVK Bio, and Piramal (to name a few) have a fantastic track record in terms of commercial delivery. Finally, in profitability, the Indian CDMO’s outperformed their counterparts having far higher EBITDA margins from 25-35 percent compared to 10-20 percent margins of their European and US competition. The growing applications of the technology and the stringent regulatory guidelines for drug development and safety in biopharma is pushing sales. MS is used for analysis throughout the process of biopharmaceutical development, from initial target identification and proteomics to toxicology and industrial quality control. Drug discovery involves three key elements: determining the mechanism of disease, identifying molecular targets for treatment and developing bioactive compounds to act on these targets.1 As proteins are the most common drug targets and are also increasingly used as biotherapeutics, MS-based techniques in proteomics and chemoproteomics are essential for drug discovery and development. Proteome profiling, combined with affinity probes and other chemoproteomics techniques, is used in target deconvolution to identify both drug targets and the molecules that affect their activity. Thermal profiling combined with high-resolution MS is used to determine drug mechanisms of action (MoA) and the stability of their protein targets. MS can be used in the identification of active compounds from traditional herbal remedies, to develop regulated biotherapies. It is particularly useful when detecting compounds in solution with other nearly identical molecules. High-resolution MS techniques can distinguish masses down to several decimal points, which allows better identification of the components of the solution. This trend is expected to continue. The increasing investments by market players in research and development activities and the expansion of their distribution networks in the region are also creating continued demand. Add to this, global investor interest in India. However, the industry faces a major challenge from the dearth of skilled professionals. The players are offering training sessions and workshops to enable users to understand the intricacies of the instruments and their applications. MS is a complex and precise analytical technique and requires highly trained and experienced personnel. Global market dynamics The global mass spectrometry market in terms of revenue is estimated to be worth USD 4.5 billion in 2022, poised to reach USD 7 billion by 2028, growing at a CAGR of 7.5 percent from 2023 to 2028. Increased spending on pharmaceutical R&D, government regulations on drug safety, a growing focus on the quality of food products, an increase in crude and shale gas production, and enhanced government initiatives for pollution control and environmental testing are high-growth prospects for the mass spectrometry market. Product insights. The instruments segment held the largest revenue share of 77.39 percent in 2022. Spectrometers offer a wide range of applications in the biotechnology sector and are witnessing rising awareness about the benefits of mass spectrometry workflows. These instruments can be used in clinical and preclinical testing for drug discovery as well as for biomedical research in the pharmaceutical industries. Consequently, the demand for mass spectrometry devices for high-throughput screening is also growing. The consumables and services segment are projected to record a rapid CAGR of 8.93 percent over the next 5 years, with increasing demand from various academic institutions and research centers. The institutions offer researchers access to mass spectrometry systems in their labs at a nominal cost and, in turn, drive the demand for consumables. In addition, revenue from services, such as maintenance and analytical testing, is expected to grow with the increasing adoption of the technique for various academic and pharmaceutical research and development activities. Technology insights. Quadrupole liquid chromatography-mass spectrometry led with the largest share of 37.09 percent in 2022. Demand for this technology has grown significantly in the past few years due to the advantages offered by the technique. For instance, the triple-quadrupole technology is one of the essential analytical techniques for clinical research analysis, and can measure trace levels of biomarkers in complex matrices of biological fluids. Several key players have established offerings in this domain. The Fourier transform-mass spectrometry (FT-MS) is the fastest-growing segment, and is expected to grow at a CAGR of 8.78 percent. This can be attributed to the high resolving power, minimal error rate, high accuracy, and ease of operations offered by the technique. The technology also has applications in forensic laboratories for the identification of drugs and contraband substances, such as cocaine. Such a broad range of applications opens up new avenues for the growth of the segment. Buyer insights. Over the past few decades, mass spectrometry has been a leading technology in pharmaceutical analysis, which incorporates both qualitative and quantitative components. Also, the area of usage of MS is increasing at an unprecedented rate, as new applications are getting developed almost on daily basis. Coupled with it, instrumentation development is advancing to keep up with the continuously rising demand for sensitivity and throughput, sometimes influenced by the tightening of regulatory requirements. A wide variety of biological and chemical entities are characterized and analyzed by using MS, which is one of the key analytical techniques utilized in drug discovery and development. Absorption, distribution, metabolism, and elimination (ADME) assays with high throughput have been incorporated into drug discovery programs in large numbers due to the improved sensitivity, selectivity, and ease of automation that are available with liquid chromatography combined with MS (LC-MS and LC-MS\/MS). Tandem mass spectroscopy has made room for newer, more expansive applications. The higher mass resolution and sensitivity in quantitative assays, a variety of ionization techniques, the ability to monitor single ions or multiple reactions, and the availability of several sample-processing\/clean-up techniques have all increased the implications of MS in the pharmaceuticals industry. The drug discovery and development category held the largest mass spectroscopy market share of over 42 percent in 2022. MS serves as a major application in drug discovery and development. It helps in determining the structure of drugs and metabolites. In addition, it is involved in a quantitative and comprehensive analysis of a wide array of metabolites in biological samples. The usage of various ionization techniques, such as electrospray and matrix-assisted laser desorption techniques, allows the analysis of a wide range of biomolecules including peptides, lipids, and sugars. Furthermore, it helps in the confirmation of combinatorial chemistry synthesis, ADME assays, and traditional small-molecule quality assurance\/quality control (QA\/QC). Opportunities. The growth of the MS market is driven by the increasing use of technology in developing countries. The increasing focus of manufacturers for the development of new products and technologies is expected to provide immense opportunities. India and China are expected to provide abundant growth opportunities. Increasing investments in research and development activities and the expansion of distribution networks are the key drivers. Challenges. Premium product pricing is one of the major factors constraining growth. High-end MS systems are typically priced at a premium, and these prices can be prohibitive. The cost of consumables, such as sample preparation kits, is also quite high. Cost of hiring and maintaining skilled personnel is also a major challenge. Geographical insights. North America accounted for the largest market share of 41.94 percent in 2022 due to the high extent of research and development activities, and the presence of an established research and healthcare infrastructure. The mass spectrometry market in North America is driven primarily by factors, such as the growing funding for research and government initiatives in the US, widespread usage of mass spectrometry in the metabolomics and petroleum sector, and CFI funding toward mass spectrometry projects in Canada. In addition, the FDA is encouraging the use of analytical techniques to ensure that the pharmaceutical products released in the market adhere to quality requirements. The Asia-Pacific region is expected to grow at the fastest CAGR of 8.97 percent. The rising attention drawn by proteomics and genomics research, as well as the increase in initiatives, undertaken by academic institutions for the development of protein-based therapeutics, have presented significant growth opportunities. In the Chinese clinical industry, diagnostics and research using MS are developing rapidly. Doctors and patients are gradually becoming more familiar with biomarkers that were previously only detectable, using mass spectroscopy platforms. Additionally, LCMS systems are now used for biomarker assessments that were previously incompatible with clinical requirements and were made using different technologies. Major players. The major players in the global mass spectrometry market are Thermo Fisher Scientific, SCIEX, Agilent Technologies, Waters Corporation, PerkinElmer, Shimadzu Corporation, Bruker, Analytik Jena, JEOL, Rigaku, DANI Instruments, LECO, and Hiden Analytical. These companies are considered emerging key players in recent years due to various strategic investments, agreements, and product launches in the mass spectrometry market space. Industry updates In October 2022, Shimadzu Corporation acquired Tescan, a manufacturer of mass spectrometers. The acquisition will help Shimadzu to expand its product portfolio in the field of mass spectrometry. In August 2022, Agilent Technologies acquired Mosse Automation, a company that specializes in automation and data acquisition solutions for mass spectrometry. The acquisition will help Agilent expand its product and services portfolio in the mass spectrometry market. In July 2022, Waters Corporation acquired TA Instruments, a manufacturer of mass spectrometers and chromatography systems. The acquisition will help Waters to expand its product portfolio in the mass spectrometry market. In May 2022, Thermo Fisher Scientific acquired Advanced Scientifics, Inc., a manufacturer of sample-introduction systems for mass spectrometers. The acquisition will help the company to expand its product and services portfolio in the field of mass spectrometry. In January 2022, Bruker Corporation acquired Hiden Analytical Limited, a leading manufacturer of mass spectrometers. The acquisition will expand Bruker’s range of products and services portfolio in the mass spectrometry market. Recent advances make headway As technology has been advancing exponentially over the years, more efficient diagnostic tools have been developed for cancer detection, and MS tops the list. It has not only advanced in methods but also in the way that samples are being prepped, thus creating new avenues in cancer diagnosis. New development in ionization methods has unlocked new ways to process data without having the sample degraded too much during ionization. ESI (electron-spray ionization) and MALDI (matrix-assisted laser desorption\/ionization) are recent advanced ionization methods that are considered soft ionization methods and have led to new ways of processing samples. Additionally, imaging MALDI has been able to detect masses on the sample that is on the matrix. Seeing this data in a spatial-based result can help researchers determine where the novel biomarkers are with respect to those already investigated. Some of the advances in mass spectrometry scanning modes include data-dependent acquisition, BoxCar data acquisition method, and data-independent acquisition. The downside of using these modes is lower inter-sample reproducibility, which hampers the capability of finding novel biomarkers across various samples. Recent technological developments in MS and automation have revolutionized its application for use in high-throughput screens. High-throughput screening drug discovery, during which thousands or millions of compounds are screened, remains the key methodology for identifying active chemical matter in early drug discovery pipelines. These methods allow the targeting of unlabeled biomolecules in high-throughput assays, thereby expanding the breadth of targets, for which high-throughput assays can be developed compared to traditional approaches. Moreover, these label-free MS assays are often cheaper, faster, and more physiologically relevant than competing assay technologies. Transferring MS from laboratories to clinics For the first time, complex mixtures, such as whole blood, urine, and tissue samples, can be analyzed on-site directly without the need of sample preparation and chromatographic separation. Ambient ionization MS is, therefore, widely employed for analysis of therapeutic drugs, metabolites, and other bioactive species in biofluids. This technology presents a huge implication on transferring MS technology to non-expert users, such as nurses and physicians for clinical and POC disease diagnosis. Ambient MS produces minimal damages to the sample, which also shows exceptional potential for tissue analysis. For instance, DESI is one of the ambient ionization methods mostly employed for this purpose. Recently, a direct sampling probe, named MassSpec Pen, was developed to further enable on-site tissue profiling. A rapid evaporative ionization MS (REIMS) method, also known as the intelligent knife (iKnife), was also developed for the chemical analysis of electrosurgery-generated aerosols. A hand-held mass spectrometry desorption probe, using picosecond infrared laser (PIRL), was developed to couple with an optical surgical tracking system. This direct sampling MS system, enabled in situ tissue pathology and the histopathological analysis of neuronal tissues in a mouse model, showed comparable results between PIRL and the surgical scalpel method. Rapid classification of medulloblastoma subgroups, based on small molecule signatures, has been achieved subjected to 10- to 15-s principal component analysis of PIRL-MS data. Outlook Mass spectrometry is a powerful tool in analytical chemistry, and is experiencing a translation from analytical chemistry to clinical applications. Ambient ionizations allow biological samples to be sampled directly in their native environment without pretreatment. Meanwhile, the soft nature of ambient ionization guarantees minimal destruction to the biological samples and invasions to the patients. This is a prerequisite that mass spectrometry technique could be transferred to non-expert users and used in clinical settings, such as nurses and physicians in clinical office and operation room. Another difficulty for the technical translation is the size and mobility of the mass spectrometry systems, which prevent the application of mass spectrometry in on-site scenarios, such as ambulances and outdoors for point-of-care diagnosis. Miniature mass spectrometry systems with an adequate performance can well fill the gap. Instead of pursuing ultimate high performance as large-scale instruments, the system design for miniature MS systems is intended to achieve a balance among the size reduction, ease of use, and required performance of specific applications. With highly specific molecular information in hand, miniature mass spectrometry systems incorporated with direct sampling methods are expected to provide point-of-care service and personalized treatment for patients in future.","filter_flag":1}
{"title":"Tk100cr fresh investment to ramp up waste paper processing - The Business Standard","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRic25ld3MubmV0L2Vjb25vbXkvaW5kdXN0cnkvdGsxMDBjci1mcmVzaC1pbnZlc3RtZW50LXJhbXAtd2FzdGUtcGFwZXItcHJvY2Vzc2luZy02MDE4MjbSAWhodHRwczovL3d3dy50YnNuZXdzLm5ldC9lY29ub215L2luZHVzdHJ5L3RrMTAwY3ItZnJlc2gtaW52ZXN0bWVudC1yYW1wLXdhc3RlLXBhcGVyLXByb2Nlc3NpbmctNjAxODI2P2FtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRic25ld3MubmV0L2Vjb25vbXkvaW5kdXN0cnkvdGsxMDBjci1mcmVzaC1pbnZlc3RtZW50LXJhbXAtd2FzdGUtcGFwZXItcHJvY2Vzc2luZy02MDE4MjbSAWhodHRwczovL3d3dy50YnNuZXdzLm5ldC9lY29ub215L2luZHVzdHJ5L3RrMTAwY3ItZnJlc2gtaW52ZXN0bWVudC1yYW1wLXdhc3RlLXBhcGVyLXByb2Nlc3NpbmctNjAxODI2P2FtcA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnRic25ld3MubmV0L2Vjb25vbXkvaW5kdXN0cnkvdGsxMDBjci1mcmVzaC1pbnZlc3RtZW50LXJhbXAtd2FzdGUtcGFwZXItcHJvY2Vzc2luZy02MDE4MjbSAWhodHRwczovL3d3dy50YnNuZXdzLm5ldC9lY29ub215L2luZHVzdHJ5L3RrMTAwY3ItZnJlc2gtaW52ZXN0bWVudC1yYW1wLXdhc3RlLXBhcGVyLXByb2Nlc3NpbmctNjAxODI2P2FtcA","guidislink":false,"published":"Sun, 19 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=78, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRic25ld3MubmV0L2Vjb25vbXkvaW5kdXN0cnkvdGsxMDBjci1mcmVzaC1pbnZlc3RtZW50LXJhbXAtd2FzdGUtcGFwZXItcHJvY2Vzc2luZy02MDE4MjbSAWhodHRwczovL3d3dy50YnNuZXdzLm5ldC9lY29ub215L2luZHVzdHJ5L3RrMTAwY3ItZnJlc2gtaW52ZXN0bWVudC1yYW1wLXdhc3RlLXBhcGVyLXByb2Nlc3NpbmctNjAxODI2P2FtcA?oc=5\" target=\"_blank\">Tk100cr fresh investment to ramp up waste paper processing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business Standard<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tk100cr fresh investment to ramp up waste paper processing - The Business Standard","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRic25ld3MubmV0L2Vjb25vbXkvaW5kdXN0cnkvdGsxMDBjci1mcmVzaC1pbnZlc3RtZW50LXJhbXAtd2FzdGUtcGFwZXItcHJvY2Vzc2luZy02MDE4MjbSAWhodHRwczovL3d3dy50YnNuZXdzLm5ldC9lY29ub215L2luZHVzdHJ5L3RrMTAwY3ItZnJlc2gtaW52ZXN0bWVudC1yYW1wLXdhc3RlLXBhcGVyLXByb2Nlc3NpbmctNjAxODI2P2FtcA?oc=5\" target=\"_blank\">Tk100cr fresh investment to ramp up waste paper processing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business Standard<\/font>","source.href":"https:\/\/www.tbsnews.net","source.title":"The Business Standard","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Paper industry leaders are now leaning towards boosting the recycling of waste paper as the dearth of dollars continues to hinder the import of raw materials of pulp and paper. According to sector insiders, the new investment will be a shot in the arm for the industry, which has been facing a crisis since the pandemic hit in early 2020, halting imports. The Russia-Ukraine war made the crisis only worse with the dollar shortage. Lipy Paper Mills Ltd, a company that currently produces and exports white print paper, has invested Tk100 crore in waste paper processing to turn discarded or thrown-away paper into new paper products. Shahriar Hasan Khan, deputy managing director of Lipy Paper Mills, told The Business Standard (TBS), \"We made the investment in waste paper processing to reduce the dependence on import of raw materials (pulp). We are now in the middle of installing modern machinery in our factory in Sonargaon to process discarded paper and make new products.\" According to people concerned, at present only a few local paper mills have the required infrastructure to recycle waste paper. Bashundhara Paper Mills Ltd, Base Papers Ltd, Meghna Pulp and Paper Mills Ltd and a few other mills are engaged in the paper recycling business. But the amount of waste paper recycled by these mills is inadequate compared to demand. The demand for recycled waste paper, which is reused as a raw material in paper mills, is soaring now. Hence, the price of paper is increasing. The paper industry faced its first blow during the pandemic when educational institutions and offices were shut for a long time. As offices and educational institutions reopened, the paper business started to rebound quickly to meet the gap in demand arising out of the pandemic. But the Russia-Ukraine war was a double whammy for the industry, bringing in major supply chain disruptions and price hikes of raw materials. Shafiqul Islam Vorosha, president of the Bangladesh Paper Importers' Association, told TBS, \"Opening letters of credit (LC) is a big problem now for the industry. We can open only 20% of the LCs required for importing raw materials. That is why local mills are unable to produce paper products as per demand.\" The National Curriculum and Textbook Board (NCTB) has also faced problems in the free distribution of books due to the increase in the price of paper and the shortage of pulp (needed to make paper). To solve the shortage of pulp, the NCTB supplied its own old books to the paper mills. These old papers have been recycled and new paper has been produced, with which the new textbooks of NCTB have been printed. The newspaper industry has also been counting losses due to the soaring paper prices. According to Textbook Printing and Marketing Association sources, the country needs about eight lakh tonnes of paper every year. The local mills produce the lion's share of the yearly demand while some paper is imported from different countries. However, a majority of the raw materials needed for producing paper are imported. Why is Lipy Paper investing in paper recycling? As a new player in the waste paper processing sector, Lipy Paper Mills is setting up a new waste paper processing factory in Sonargaon upazila of Narayanganj. According to PULPPAPERnews, Lipy Paper bought paper processing machines from the ANDRITZ Group — an international technology group offering plants, equipment, systems and services for various industries including the pulp and paper industry. The ANDRITZ RCF (Recycled Fibre) line is the first-ever paper processing line in Bangladesh, which is scheduled to start operation in the middle of 2023. According to sources, ANDRITZ will supply key equipment for two RCF lines, featuring a total capacity of 150 tonnes per day and processing LOCC (Local OCC) and MOW (Mixed Office Waste) as raw material for the production of test liner, writing and printing paper. Shahriar Hasan Khan, deputy managing director of Lipy Paper Mills, told TBS, \"We are investing Tk100 crore in waste paper processing mainly to reduce the pressure on foreign exchange reserves and produce new products from discarded paper.\" \"The NCTB could not print books on time due to a shortage of raw materials and the high cost of paper. As a result, books have been printed by processing old paper with a lot of effort. The quality of these books is also not good,\" he said. \"Around 40 tonnes of waste paper is created from every 100 tonnes of paper sold. This waste paper goes into landfill. It is possible to save dollars by recycling this waste paper locally,\" Shahriar Hasan Khan added. Mohammad Iqbal, organising secretary of the Bangladesh Waste Paper Suppliers Association, said, \"For the last two years, the demand for waste paper from paper mills is increasing. But the amount of collected waste paper is far less compared to demand. Waste paper is not coming to the proper channel and a large part of it is ending up in landfills.\" Bashundhara Paper Mills Ltd, one of the major players in the paper industry and market leader in the tissue industry, is the major shareholder in the paper processing industry. M Mazedul Islam, general manager of Bashundhara Paper Mills, said, \"Our mill has been in operation for a long time to produce raw materials by processing waste paper, which is able to meet part of the raw material demand of the local mills.\" \"Now the dollar crisis has worsened the shortage of raw materials in the paper industry. Bashundhara Paper has not had any problems yet. But we might face issues in the future if the dollar shortage continues. In that case, waste paper processing will provide good support,\" he added.","filter_flag":1}
{"title":"Algae: Overview and Applications in Diverse Industries - Credence Turbine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL9IBZGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL9IBZGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL2FtcC8?oc=5","id":"CBMiYGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL9IBZGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL2FtcC8","guidislink":false,"published":"Mon, 06 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=65, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL9IBZGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL2FtcC8?oc=5\" target=\"_blank\">Algae: Overview and Applications in Diverse Industries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Credence Turbine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Algae: Overview and Applications in Diverse Industries - Credence Turbine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL9IBZGh0dHBzOi8vY3JlZGVuY2V0dXJiaW5lLmNvbS9iaW90ZWNobm9sb2d5L2FsZ2FlLW92ZXJ2aWV3LWFuZC1hcHBsaWNhdGlvbnMtaW4tZGl2ZXJzZS1pbmR1c3RyaWVzL2FtcC8?oc=5\" target=\"_blank\">Algae: Overview and Applications in Diverse Industries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Credence Turbine<\/font>","source.href":"https:\/\/credenceturbine.com","source.title":"Credence Turbine","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Algae are eukaryotic, photosynthetic creatures belonging to the Protista kingdom, found mostly in water and other habitats. They lack plant-like characteristics and can be found in a wide range of habitats, making them almost ubiquitous. Algae are categorized based on their habitat, and their composition can be altered by changing growing conditions. Algae are widely used in a variety of industries such as food, biofuel, cosmetics, bio-packaging, bioplastics, and pharmaceutical applications. Food Industry Agar is widely used as a gelatin substitute in the food industry. It’s also used to thicken and gel jams and marmalade, as well as to keep bread and pastries from drying out. Microalgae for human nutrition is currently available in a variety of formats, including pills, capsules, and liquids. They can also be found in snacks, pasta, candy bars, and chewing gums, as well as nutrition bars, noodles, wine, breakfast cereals, beverages, and cookies. Pharmaceutical Industry Algae have been used as an herbal medication to cure sunstroke and digestive issues in China for a long time. Algae products are also used in the modern pharmaceutical sector. Algae have been used medicinally since ancient times to cure diseases such as coughs, hypertension, diarrhea, and gout. The utilization of algae as anti-cancer drugs is the focus of current research. Cosmetic Products Algae-derived goods can be found in nail enamels, body lotions, lipsticks, shaving creams, and shampoos. Algae products are employed in thickening agents, water-binding agents, antioxidants, iridescent pigment, and cosmetic packaging. Some microalgal species, particularly Arthrospira and Chlorella, are well-known in the skin care industry. Bio-Plastic Production Algae is a great raw material for bioplastic manufacture because of its various benefits, including high yields and the capacity to grow in a variety of settings. Bioplastics have the added benefit of being environmentally benign and reducing the use of fossil fuels. Bio-Fertilizers Seaweed has long been utilized as a fertilizer in coastal areas around the world, primarily for its mineral content and to boost the soil’s water-binding ability. Nitrogen-fixing microalgal species are significant, notably in rice farming. Most nutrients are still present in the left-over biomass after oil or carbohydrates are extracted from both seaweed and microalgae. Biofertilizer is one possible market for this nutrient-rich biomass. Pollution Control Algae can be utilized to catch fertilizer runoff from surrounding farms that enter lakes and streams. Some power stations employ algae to reduce CO2 emissions. Wastewater treatment, heavy metal biosorption, soil additives, conditioners, CO2 capture, and fertilizers are some of the possible applications. Emerging Opportunities for Players Operating in Algae Market The global algae market is being driven by the increasing demand for biofuels, the growing demand for algae-based products in the food and pharmaceutical industries, and the rising awareness of the environmental benefits of using algae. Major players in the algae market are looking to expand their operations by increasing production and exploring new applications for algae-based products. Conclusion Algae are an important resource that can be used in a variety of industries. With their wide range of applications and the potential for new products to be created, algae represent an exciting area for research and development. As the demand for sustainable and environmentally-friendly products continues to grow, algae-based products are likely to play an increasingly important role in the global economy.","filter_flag":1}
