{"title":"AGL plans huge solar recycling plant at retired coal site that Dutton wants for nuclear","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6821442afb8e27627ca61156a&url=https%3a%2f%2freneweconomy.com.au%2fagl-plans-huge-solar-recycling-plant-at-retired-coal-site-that-dutton-wants-for-nuclear%2f&c=18341834456843321846&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6821442afb8e27627ca61156a&url=https%3a%2f%2freneweconomy.com.au%2fagl-plans-huge-solar-recycling-plant-at-retired-coal-site-that-dutton-wants-for-nuclear%2f&c=18341834456843321846&mkt=en-us","summary":"The start-up, whose patented technology transforms used solar panels into new products used in the construction and manufacturing industries, was one of 10 start-ups to take part in EnergyLab’s 2023 ...","published":"Mon, 24 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"RenewEconomy","news_image":"http:\/\/www.bing.com\/th?id=OVFT.--e6yDRymQiNxCm68v4F0C&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":524.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"AGL plans huge solar recycling plant at retired coal site that Dutton wants for nuclear","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The start-up, whose patented technology transforms used solar panels into new products used in the construction and manufacturing industries, was one of 10 start-ups to take part in EnergyLab’s 2023 ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Green Manufacturing\" \"new products\"&format=rss","text":"AGL Energy is looking to add commercial-scale solar panel recycling to the renewables-focused plans it is developing for the site of its shuttered Liddell coal-fired power station – the same site in the New South Wales Hunter region that Peter Dutton proposes appropriating for nuclear. AGL and emerging PV recycling outfit Elecsome said on Tuesday they have signed a memorandum of understanding (MoU) to develop a feasibility study for a facility with the potential to upcycle half a million solar panels a year at AGL’s Hunter Energy Hub. A second stage would then focus on the extraction of high value materials, including silicon wafer for re-use in PV and battery grade silicon, electric conductors for re-use in electrical appliances, and the extraction and re-use of silver, copper and aluminium. The deal proposes to add another green layer to AGL’s Hunter Energy Hub, where it is developing one of Australia’s biggest grid-forming batteries, and where it is also exploring the potential for solar manufacturing with local innovator SunDrive and battery recycling with Renewable Metals. The feasibility study with Elecsome will determine the engineering and infrastructure requirements as well as the key environmental and regulatory approvals required for the development, construction, and operation of the panel recycling facility. If the study proves up, the recycling plant would be Elecsome’s first commercial-scale solar panel recycling facility in NSW with the potential to upcycle up to 500,000 residential and grid-scale solar panels a year. The two companies will also assess the feasibility of a solar cable manufacturing plant at the site, which could produce up to 20,000 km of cable a year for use in residential and commercial solar installations, as well as for large-scale solar farms. The MoU is a welcome sign that those who are actually in the business of generating and selling energy, and their shareholders, remain focused on the transition to renewable energy the shoring up of the industries needed to support that transition. Damien Nicks, the boss of AGL which has two sites targeted by the Coalition’s skeletal nuclear plans – Liddell and Loy Yang – has repeatedly said nuclear forms no part of the gentailer’s plans, and that it wants to create new clean energy and industrial hubs. “As the owner of these sites, nuclear energy is not a part of these plans,” he said in March as part of a statement that AGL reissued last week. “There is no viable schedule for the regulation or development of nuclear energy in Australia, and the cost, build time and public opinion are all prohibitive,” Nicks said. “Policy certainty is important for companies like AGL and ongoing debate on the matter runs the risk of unnecessarily complicating the long-term investment decisions necessary for the energy transition.” In a statement this week, AGL’s general manager of energy hubs, Travis Hughes, said AGL’s vision for the Hunter Energy Hub is starting to take shape. “Since the closure of Liddell Power Station one year ago, we have signed MoUs that could bring battery recycling with Renewable Metals and solar panel manufacturing with SunDrive to the Hunter Energy Hub,” he said. “Today we add solar panel recycling and solar cable manufacturing to that list of partners.” For Elecsome, the MoU with AGL follows the successful commissioning of its first solar upcycling facility in Victoria, in association with the federal department of industry, The University of Melbourne and RMIT. The start-up, whose patented technology transforms used solar panels into new products used in the construction and manufacturing industries, was one of 10 start-ups to take part in EnergyLab’s 2023 Climate Solutions Accelerator program. One of its main products, SolarCrete – a pre-mixed concrete made using glass recovered from used solar panels – will form part of the feasibility study at the Hunter site, the companies say. Elecsome managing director, Neeraj Das, describes resource recovery and upcycling of solar panels as Australia’s “next-gen mining” opportunity. “At the same time, it’s our responsibility to have an effective solution for solar waste in place for future generations,” he said back when Elecsome was working with EnergyLab. With AGL, Elecsome will also look into the feasibility of extracting the materials used in a solar panel for re-use in green energy manufacturing at the Hunter Hub. The companies say this could include recovering silicon wafer for re-use in PV and battery grade silicon, electric conductors for re-use in electrical appliances, silver and copper extracted for other industries, and the aluminium frames repurposed for cans and new solar PV frames. “If successful, the establishment of a solar panel recycling plant and solar cable manufacturing plant with Elecsome will mean we are hosting several parts of the solar energy value chain with both manufacturing and recycling of grid-scale and residential solar panels at the Hunter Energy Hub,” AGL’s Hughes says. “These partnerships have the potential to make a significant contribution to the economy of the Upper Hunter by creating new jobs in the renewable energy sector.”","filter_flag":1}
{"title":"‘Tech Jedi’ John Chambers discusses accelerating AI startup growth","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6821442afb8e27627ca61156a&url=https%3a%2f%2fwraltechwire.com%2f2024%2f06%2f20%2ftech-jedi-john-chambers-discusses-accelerating-ai-startup-growth%2f&c=10856918249224122874&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6821442afb8e27627ca61156a&url=https%3a%2f%2fwraltechwire.com%2f2024%2f06%2f20%2ftech-jedi-john-chambers-discusses-accelerating-ai-startup-growth%2f&c=10856918249224122874&mkt=en-us","summary":"A few weeks ago, all of us enjoyed hearing from \"Tech Jedi\" John Chambers on AI and our future to a packed audience of startups, investors and elected leaders at the AI Summit I hosted I am going to ...","published":"Thu, 20 Jun 2024 11:52:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=11, tm_min=52, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"WRAL TechWire","news_image":"http:\/\/www.bing.com\/th?id=OVFT.Hm-xJO7vcXw_S-hYQZznhS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":394.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"‘Tech Jedi’ John Chambers discusses accelerating AI startup growth","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"A few weeks ago, all of us enjoyed hearing from \"Tech Jedi\" John Chambers on AI and our future to a packed audience of startups, investors and elected leaders at the AI Summit I hosted I am going to ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Green Manufacturing\" \"new products\"&format=rss","text":"A few weeks ago, all of us enjoyed hearing from “Tech Jedi” John Chambers on AI and our future to a packed audience of startups, investors and elected leaders at the AI Summit I hosted I am going to do my best to sum up some of his advice, and of course, feel free to go back and listen to the interview. A busy summer delayed this post but here it is! I also thank NC Tech, NC Idea, NC Association of Indian Americans, TIE Carolinas, IT Serve and Central Pine Regional Council for working with me to host this historic fireside chat. There certainly was a disturbance in the tech force that evening, as we heard from Chambers on how quickly AI innovation is moving and how important it is for companies, local governments, to have a clear AI Strategy amid such disruptive innovation. These AI strategies must involve communicating your product’s differentiation, upskill your employees with this technology (which boosts productivity), and continually evolve your strategy to remain competitive. The companies and organizations that get it right will survive and thrive. The companies that do not execute a compelling AI strategy will fail. Growing AI startups A major takeaway from Chambers’ talk was how AI innovation can fuel the growth of startups and in many ways, create many new jobs across almost every industrial sector. Artificial intelligence in his own words will be bigger than the internet and cloud combined. While VC funding is still tough, the VC market is prioritizing startups with strong AI strategies. Chambers says he has seen this movie play out before with the internet and cloud, but AI will move faster than ever and on a scale we’ve never seen. There will be plenty of winners and losers with spectacular trainwrecks along the way, including big tech companies that have historically been market leaders. During his talk, Chambers said there are 43 companies between the $10 billion to $100 billion revenue stage at the present time. Companies in this category are on track to become $1 billion unicorns. He predicts that we could see at least 100 of these types of companies and at least five more trillion-dollar AI companies in the next seven years. These new AI leaders will emerge in much the same way as Google and Amazon did during the cloud revolution. Startups with game-changing ideas and strong leadership teams will emerge quicker and faster than ever before. AI is significantly changing the rules of the game for company formation. Up until the present day, a company would get a round of funding, take two years to bring a product to market, and only in year three, would they hit the $1 million-plus revenue mark and if they really got traction, they could be one of the 7% of startups that hit $5 million in year five. Now, Chambers says it is the norm for his portfolio investments to take a product to market in three months, ramp up sales in month four, and hit $5 million I nrevenue in 18 months. The pace of this speed to market is a game changer for companies in this new economy. Companies with crisp AI strategies will have much higher multiples than any company without an AI strategy. A comparison of Facebook and Chat GPT proves how times are changing. Facebook reached the 1 million user milestone just 10 months after it was founded in Febbruary 2004. It took Instagram approximately 2.5 months to reach 1 million downloads. Netflix had to wait around 3.5 years to reach 1 million users. Chat GPT reached 1 million users in two months and 100 million users in five years. It’s amazing that CHAT GPT is a $80 billion company after only two years. It took Facebook seven years to hit this valuation. We have never seen such disruptive and rapid innovation take place at such rapid speed. One can only imagine the types of valuations we will be seeing from companies within a few months or years of being founded. Given this fact, I believe that it will be very important for our region to have an AI Startup Playbook, a set of plays which we can turn to accelerate AI innovation and create many of the jobs of the new economy right here in the Triangle and North Carolina. I would like to see more Pendos in the Triangle and in North Carolina, a pipeline of startups who can become $1 billion unicorns. Chambers’ talk inspired me to think out of the box, and look at how we can grow our AI startups and talent in our region. Growing the Triangle AI startup ecosystem One of my ideas is that we create a scalable, sustainable bridge between Silicon Valley (SV) and Research Triangle Park (RTP) that leverages the entrepreneurial experience, culture and AI expertise of SV and the strong RTP tech community. We can build a sustainable startup ecosystem in RTP to reduce reliance on large companies and increase jobs for RTP graduates. The functional possibilities of AI have taken leaps and bounds over the past decade, and no place is a bigger hotbed for such development than Silicon Valley. Home to AI giants like Nvidia and Google, the Bay Area is fostering tremendous talent and innovation when it comes to what deep machine learning can do. These Silicon Valley AI companies demonstrate how fast AI innovation is moving. Show me the money! Of course, there is the enormous amounts of money flowing into Bay Area AI companies In fact, funding data as well as interviews with startup investors and real estate industry professionals show the San Francisco Bay Area has become the undisputed epicenter of artificial intelligence. Last year, more than 50% of all global venture funding for AI-related startups went to companies headquartered in the Bay Area, Crunchbase data shows, as a cluster of talent congregates in the region. Beginning in Q1 2023, when OpenAI’s ChatGPT reached 100 million users within months of launching, the amount raised by Bay Area startups in AI started trending up. That accelerated with OpenAI raising $10 billion from Microsoft — marking the largest single funding deal ever for an AI foundation model company. In that quarter, more than 75% of AI funding went to San Francisco Bay area startups. How do we grow AI innovation in North Carolina? Chambers did mention his concerns that we need more Venture Capital and some of the other major players like Microsoft and Google, to have more of a presence in North Carolina. The Triangle certainly is a great place to start his process. The good news is that we are starting to see founders and companies in the region make their AI moves. Pendo continues to make waves as they surpassed $200 million in annual recurring revenue (ARR) this year, adding more than 400 new customers, and launched a record number of new products. Pendo also generated positive cash flow for the first time in the first quarter of the year. At the AI Summit, many of us were inspired by Chip Kennedy, CEO\/Founder of Civic Reach AI and Pavani Peri, CEO\/Founder of ACTA Solutions. During a panel, Kennedy shared how his company is utilizing generative AI to help automate and enhance the customer service to the residents of local governments. AI-powered 311 call centers can be developed very quickly at a significantly lower cost than staffing a Call Center with real agents. Peri shared with us how her company automates customer service communications for local governments so that they can save time, increase revenue and speedily provide services through the power of AI. ACTA already has 15 million citizens on their platform and is serving local governments across the country including the Town of Morrisville, Tampa, Winston Salem, the city of Asheville, and the city of Grenville. Let’s not forget some of the startups showcased at the NC Tech Summit a few weeks ago in Durham. One of these companies, founded by startup star, Robbie Allen, Bionic Health is leveraging AI to deliver personalized, precision health care to all consumers in the market. Tanjo (Ultism), founded by successful Triangle Entrepreneur, Richard Boyd, continues to grow their AI and machine learning company by offering personas and AI brains to governments and companies. What does this mean for us in North Carolina? Now is the time to increase venture investment in local startups with clearly defined AI strategies. If we start to grow more valuable AI companies, Pendo and SAS, etc. can acquire local companies, invest more in local talent, and grow more jobs! I know that all of us would be very excited if we had a few more Pendos in the area. It would create more jobs, and a great story to tell the larger investors in the nation to invest more in North Carolina. Maybe, with some arm-twisting, we can get Chambers’ firm to invest in our local startups, and add to the list of AI unicorns in his portfolio. I mean, he does have a connection to Duke, and Cisco RTP grew significantly under his presence. Chambers also shared that he would like to see more of the larger players like Microsoft, Google and Amazon, play more of a role in investing in and acquiring AI startups and companies in North Carolina. Or we can convince Scot Wingo (Bionic Health Founder Robbie Allen is his partner) to focus more on tweener investments or perhaps have a separate fund focused on only AI companies. At the end of the day, this type of economic development strategy makes more sense than paying millions of incentives to recruit many of the larger companies or big whales. Vinfast, Apple and other major players appear to be delaying their expansion plans or at least not moving as fast as they promised. California-based Invitae pulled out of the Stitch (Outlet Mall) in Morrisville, and many of the larger players like Microsoft are scaling back on their offices. In fact, during his State of the Region address, Tom Snyder reminded us that $431 million of incentives have been reneged by companies that did not meet their performance targets. If we invested more of these dollars in startups, we would grow, and create more jobs. We often forget that SAS, Red Hat, and Wolfspeed were all start ups, which came out of NC State. Look at where these global companies are today. They are global companies, employing thousands of employees across the world. How can we accelerate the growth of AI startups in North Carolina? My time with Chambersalways gets my creative mind working, so bear with me for some brainstorming on this topic. First, we have an opportunity to increase RTP’s visibility as a source of startup-ready talent, to encourage hiring of RTP-based talent into both local NC and SV startups. Silicon Valley has an 80-year tradition of startups and an entrepreneurial culture of “do it again and\/or help others do it”. It also has a vast wealth of tech and entrepreneurial experience. However, the cost of living has made it very difficult for startups to grow organically without major investment. RTP has world-class tech education and big company job options for graduates. It also has a cost of living that significantly reduces the cost of starting companies. (in spite of rising housing prices in this market). The RTP startup culture is gaining momentum and could accelerate from access to the AI expertise of Silicon Valley. Silicon Valley\/RTP AI incubators I believe that we can establish an AI laboratory\/incubators in our area, managed by executive teams based in Silicon Valley and RTP that have founded startups (including multiple exits) and have collectively years of startup experience. These executives would have built a strong team of North Carolina-based AI experts who have developed enterprise AI applications across health care, education and almost every industry. These AI labs can build startups using North Carolina ideas, the RTP tech community, and new North Carolina university graduates, mentored and operated by Silicon Valley experts and the RTP-based AI team. This is not “just another incubator,” but a cradle-to-exit system that will own significant stakes in each startup. RTP-based teams and service providers will gain valuable experience running and servicing startup companies, and will be encouraged to follow the SV model of “do it again and\/or help others do it.” Another idea would be to merge this concept of AI Incubators with the RIOT Incubators, which have had tremendous success launching and growing successful companies. What better sister city program to establish than a Silicon Valley\/Research Triangle collaboration? The lab’s gains from successful exits will go back into nurturing the next round of startups. The lab will also seek and perform AI consulting projects using RTP-based graduates and other North Carolina-based candidates under the tutelage of our AI experts, to teach them AI skills, project management and offshore team management. The proceeds from these projects will help keep the lab self-sustaining. Our AI startup could involve the following plays: Community outreach to identify budding entrepreneurs and service providers in RTP who want to build and service innovative new companies. Connect with North Carolina state schools, community colleges and other talent sources to create a matching system that identifies fresh young talent for these companies – for internships and full-time positions. Wake Tech RTP is already offering industry-leading technology curriculum for their students, and partnerships with Credit Suisse, Lenovo and other tech leaders are providing internships, and jobs for our community college students. Adding AI courses and curriculum will help Wake Tech and other community colleges to accelerate the training needed to support the AI jobs of the future. Reach out to potential investors (such as John Chambers (JC2 Ventures and others) to get these companies on their funding radar. Reach out to RTP tech companies and government to identify AI consulting projects. Obtain initial capital and office space. The future multiple successful exits and cutting-edge AI projects in the RTP can create a sustained entrepreneurial\/AI snowball effect, making RTP the source of its own jobs and businesses. Silicon Valley takes advantage of the strong RTP entrepreneurial expertise and AI know-how to “inshore” Silicon Valley startups to RTP, creating a new blended SV-RTP startup model. The lab becomes a model for growing entrepreneurship in other states and abroad. At the end of the day, North Carolina has always been a visionary state, one whose world-class universities, talented workforce, and willingness to think outside the box, have resulted in a thriving economy. Startups like SAS, Cree, Red Hat, all became global companies, employing thousands, and most recently, green manufacturing jobs are on the move, with billions of dollars being invested in the State. Pendo is now emerging as a market-leading AI company, calling North Carolina its home. Now, with the AI revolution upon us, we have an opportunity to be leaders once again, and help our state move forward with better, faster reliable government programs, productive companies, and most importantly, progressive and bold investments in training our students, and workforce on the AI of the future. Training for the new jobs John says our greatest challenge is that the jobs will now be displaced much faster than we can replenish them. It will be critically important to have national and state AI strategies that focus on training programs on AI so we can quickly transition these employees back into the workforce. K-12 and college curriculums will have to adapt very quickly as well to an ever-changing workforce. Community college funding and programs in AI, data, analytics, etc will also have to increase. Companies will have to partner with these community colleges to help develop training and courses to meet the demands for skills needed today. Chambers was very proud that West Virginia University Business School (Business School is named after him) has increased placement of graduates to jobs from 60% to 90% by focusing more on internships and career paths in data, cybsersecurity, AI and other emerging tech areas. Companies will have to make it a much higher priority to train employees in AI. One example he provided was La Post, a French Company, whose CEO, mandated that 250,000 employees be trained on AI, and he worked with all seven unions to make this happen. Maybe, our next Labor Commissioner can implement an AI training initiative mandate or initiative with companies similar to the efforts by La Post. AI-powered smart cities There will be plenty of opportunities for local governments to embrace AI innovation to continue to solve problems and enhance the quality of life for residents. AI-powered chatbots can provide residents with 24\/7 access to city services and information. These apps can be valuable additions to smart city programs. AI can help residents navigate city services, report issues and stay informed about city events. They can significantly enhance various aspects of smart cities by improving efficiency, sustainability and the quality of life for residents. In addition, Chambers reminded us that cities are not alone in these efforts as it is important that they partner with tech companies and startups to solve problems. Morrisville has been able to work with local companies like Varidx to set up Smart City Dashboards, and win national awards for their programs. And Civic Reach AI is also gaining momentum with their AI Powered 311 Call Centers. Tom Snyder at RIOT is already working with AI companies by encouraging them to apply for the RIOT Incubator Programs and to connect with Smart City Programs. At the end of the day, state, city and county governments do not have to reinvent the wheel in these areas and can build their AI strategies by finding other relevant case studies where there has been Success in AI implementations. As I have always said, this is where regional collaboration and sharing best practices in these areas are critically important. Be bold in our digital vision Chambers inspired all of us at the end of the interview as he reminded the audience of how digital transformation has been a pillar of India’s successful economic strategy. While Chambers advised Modi on Digital India, Modi aggressively executed the plan almost flawlessly. The Digital India strategy has enabled the country to grow from a developing nation to one of the top economies in the world in only nine years. Smart cities, digital payment systems, digital manufacturing, and high-speed broadband have transformed India into an economic powerhouse and a startup nation. Chambers ended his time with us reminding that we can learn from India’s success in its digital revolution. A digital plan with a team to execute that plan has produced phenomenal results. Now, Modi says he will push even harder with AI innovation as he continues to execute on his digital roadmap. We can do the same right here at home. Our next governor and leaders need be bold in our digital transformation. We need to be leaders once again. Bold, like Archie Davis, Luther Hodges and Jim Hunt, whose visions for our state got us to where we are today. Our future depends on it. It is time for a: A digital North Carolina. An AI North Carolina. Imagine what we can do if we now have the courage to embrace a visionary AI strategy, one that will accelerate startup growth, and enhance the quality of life for all our residents. That time is now. We have the power to make it happen. May the AI force be with us! Editor’s note: Steve S. Rao is a councilmember at large and former mayor pro tem for the town of Morrisville and an opinion writer for WRAL TechWire. He served on the board of the New American Economy, now the American Immigration Council, and on the NC League of Municipalities Race and Equity Task Force.","filter_flag":1}
