{"title":"Renault Nissan Automotive crosses 2.5 million vehicle production milestone - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MdIBdWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MT9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MdIBdWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MT9hbXA9MQ?oc=5","id":"CBMib2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MdIBdWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MT9hbXA9MQ","guidislink":false,"published":"Thu, 27 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=208, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MdIBdWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MT9hbXA9MQ?oc=5\" target=\"_blank\">Renault Nissan Automotive crosses 2.5 million vehicle production milestone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Renault Nissan Automotive crosses 2.5 million vehicle production milestone - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MdIBdWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9yZW5hdWx0LW5pc3Nhbi1hdXRvbW90aXZlLWNyb3NzZXMtMjUtbWlsbGlvbi12ZWhpY2xlLXByb2R1Y3Rpb24tbWlsZXN0b25lLTExNjA4MT9hbXA9MQ?oc=5\" target=\"_blank\">Renault Nissan Automotive crosses 2.5 million vehicle production milestone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Reprocessed Waste\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"In total, 20 models of cars across Renault and Nissan have been manufactured by the plant since commencing operations. Renault Nissan Automotive (RNAIPL) has announced that it has manufactured 2.5 million cars at its state-of-the-art Chennai manufacturing facility. Over the past 13 years, the Alliance plant has exemplified manufacturing excellence, manufacturing on an average over 1.92 lakh (192,000) Renault and Nissan cars every year, equivalent to one car produced every three minutes. In total, 20 models of cars across Renault and Nissan have been manufactured by the plant since commencing operations. Spread over 600 acres at Oragadam, Chennai, the Alliance plant has manufactured cars not only for the Indian market but has also played a vital role in establishing Chennai as a renowned international hub for automotive exports. RNAIPL has exported more than 1.15 million vehicles from Chennai's Kamarajar Port Ltd (formerly Ennore Port Ltd.) to more than 108 destinations including markets in the Middle Eastern countries, Europe, Latin America, New Zealand, Australia, South-East Asia, SAARC countries, and Sub-Saharan Africa. Keerthi Prakash, Managing Director of RNAIPL, said: \"The 2.5 million cars manufactured milestone is a testament to RNAIPL's manufacturing excellence and the exceptional products we create for customers in India and overseas markets. We would also like to express our appreciation to our employees whose hard work and support has helped us reach this remarkable milestone. Moving to the future, RNAIPL is gearing up to manufacture six new models, three each for Renault and Nissan, as announced under the Alliance investment plan. We are confident that these cars, engineered and manufactured in India, will meet and exceed our customers' expectations.\" Frank Torres, President, Nissan India, said: \"Our 2.5 million-production-milestone reflects our unwavering commitment to growth and the powerful potential of manufacturing in India. RNAIPL's focus on best-in-class products, innovative technologies, robust performance, and safety has been effectively validated by consumers in India and across the globe. Going ahead, we will leverage our new investment in India and our global expertise to bring out a truly exceptional lineup of products that set new benchmarks for growth.\" Venkatram Mamillapalle, CEO and MD, Renault India said: \"It is a moment of immense pleasure to be an indispensable part of this momentous manufacturing milestone of 2.5 million cars achieved by Renault Nissan Automotive India Private Limited. Guided by the synergy and shared vision of our alliance, this accomplishment exemplifies our unwavering dedication to delivering exceptional vehicles and cutting-edge mobility solutions for discerning Indian market. This remarkable achievement propels our determination to push our boundaries, embrace state-of-the-art technologies, and shape India's future mobility, all while remaining committed to our overarching vision of driving innovation and delivering superior automotive experiences.\" Earlier this year, the Renault Nissan Alliance announced an investment of US$ 600 million crore in India to introduce new products and technologies, and boost production and R&D activities. The Alliance's future focus includes the production of six new vehicles, including two fully electric vehicles that will be manufactured at RNAIPL. These projects will enhance overall plant utilisation and secure thousands of jobs for years to come.","filter_flag":1}
