{"title":"Turning polystyrene into new products - Newswise","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz0gFFaHR0cHM6Ly9tLm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz0gFFaHR0cHM6Ly9tLm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz?oc=5","id":"CBMiR2h0dHBzOi8vd3d3Lm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz0gFFaHR0cHM6Ly9tLm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz","guidislink":false,"published":"Fri, 28 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=209, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz0gFFaHR0cHM6Ly9tLm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz?oc=5\" target=\"_blank\">Turning polystyrene into new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Newswise<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Turning polystyrene into new products - Newswise","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz0gFFaHR0cHM6Ly9tLm5ld3N3aXNlLmNvbS9hcnRpY2xlcy90dXJuaW5nLXBvbHlzdHlyZW5lLWludG8tbmV3LXByb2R1Y3Rz?oc=5\" target=\"_blank\">Turning polystyrene into new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Newswise<\/font>","source.href":"https:\/\/www.newswise.com","source.title":"Newswise","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Newswise — Polystyrene, a prominent polymer utilized in plastic tableware and insulating materials, has been extensively employed but poses recycling challenges. In a breakthrough study published in the journal Angewandte Chemie, a group of researchers from the United States has successfully devised a thermochemical method, facilitating the retrieval of valuable chemicals from discarded polystyrene in a straightforward two-step process. This innovative approach holds the potential to revolutionize the recycling of insulating and packaging materials, fostering a genuinely circular plastics economy. The groundbreaking technique known as \"Degradation Upcycling\" (Deg-Up) has been developed by Guoliang Liu and his team from Virginia Tech in Blacksburg, USA. This innovative approach allows for the production of a diverse range of highly valuable aromatic chemicals from polystyrene waste. The process involves a simple two-step cascade: first, polystyrene is broken down, resulting in the generation of benzene as the primary degradation product. Then, in the same reactor, this benzene product undergoes chemical modification. The outcome is the creation of various benzene derivatives, encompassing numerous essential substances for the cosmetics and pharmaceutical industries. Conventional methods for breaking down polystyrene into benzene typically rely on costly catalysts, are energy-demanding, and result in a complicated mixture of products. However, Liu and his team have introduced a novel thermochemical approach that overcomes these challenges. Their method utilizes inexpensive aluminum chloride catalysts and can be carried out in reactors operating at a moderate temperature of 80 °C (approximately 180 °F). An additional advantage of their technique is the ingenious utilization of the solvent, benzene. Liu explains that only the amount of benzene recovered from the polymer is converted into the desired chemical, allowing any unused solvent to be recycled for processing more polymer feed. To demonstrate the viability of their approach, the research team conducted an experiment involving the dissolution of different types of polystyrene waste, including packing peanuts and plastic utensils, in benzene. They then subjected the mixture to heat in a reactor under air-free conditions, utilizing aluminum chloride as the sole reagent. The resulting liquid product, primarily composed of benzene, proved to be highly effective. It could be directly used to obtain the desired value-added chemicals with exceptional yield and selectivity. As a practical illustration, the research team introduced the reagent acetyl chloride, resulting in the successful synthesis of acetophenone—an essential chemical in the cosmetics and pharmaceuticals sectors. Furthermore, by incorporating the related reagent oxalyl chloride, they obtained benzophenone, a widely used component in sunscreen products and plastic additives. Additionally, the team achieved a remarkable level of selectivity in generating sulfur-containing aromatics from polystyrene waste, some of which serve as high-performance solvents in the polymer industry. The primary objective of this innovative chemical upcycling method is to transform substantial quantities of polystyrene waste into value-added chemicals that can be utilized in various industrial processes. Since polystyrene insulating materials have low density, they are not ideal for mechanical recycling, which involves sorting, shredding, and transporting materials to create new products profitably. However, the Deg-Up process described here offers a resilient and contamination-tolerant alternative. It serves as a robust platform for the chemical upcycling of large volumes of polystyrene waste, paving the way for more sustainable and efficient recycling practices.","filter_flag":1}
{"title":"NEW STUDY CONFIRMS U.S.' MOST RECYCLED CONSUMER PRODUCT - LEAD BATTERIES - MAINTAINS ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1zdHVkeS1jb25maXJtcy11cy1tb3N0LXJlY3ljbGVkLWNvbnN1bWVyLXByb2R1Y3QtLWxlYWQtYmF0dGVyaWVzLS1tYWludGFpbnMtcmVtYXJrYWJsZS1taWxlc3RvbmUtOTktcmVjeWNsaW5nLXJhdGUtMzAxODc1MTA2Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1zdHVkeS1jb25maXJtcy11cy1tb3N0LXJlY3ljbGVkLWNvbnN1bWVyLXByb2R1Y3QtLWxlYWQtYmF0dGVyaWVzLS1tYWludGFpbnMtcmVtYXJrYWJsZS1taWxlc3RvbmUtOTktcmVjeWNsaW5nLXJhdGUtMzAxODc1MTA2Lmh0bWzSAQA?oc=5","id":"CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1zdHVkeS1jb25maXJtcy11cy1tb3N0LXJlY3ljbGVkLWNvbnN1bWVyLXByb2R1Y3QtLWxlYWQtYmF0dGVyaWVzLS1tYWludGFpbnMtcmVtYXJrYWJsZS1taWxlc3RvbmUtOTktcmVjeWNsaW5nLXJhdGUtMzAxODc1MTA2Lmh0bWzSAQA","guidislink":false,"published":"Wed, 12 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=193, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1zdHVkeS1jb25maXJtcy11cy1tb3N0LXJlY3ljbGVkLWNvbnN1bWVyLXByb2R1Y3QtLWxlYWQtYmF0dGVyaWVzLS1tYWludGFpbnMtcmVtYXJrYWJsZS1taWxlc3RvbmUtOTktcmVjeWNsaW5nLXJhdGUtMzAxODc1MTA2Lmh0bWzSAQA?oc=5\" target=\"_blank\">NEW STUDY CONFIRMS U.S.' MOST RECYCLED CONSUMER PRODUCT - LEAD BATTERIES - MAINTAINS ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NEW STUDY CONFIRMS U.S.' MOST RECYCLED CONSUMER PRODUCT - LEAD BATTERIES - MAINTAINS ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1zdHVkeS1jb25maXJtcy11cy1tb3N0LXJlY3ljbGVkLWNvbnN1bWVyLXByb2R1Y3QtLWxlYWQtYmF0dGVyaWVzLS1tYWludGFpbnMtcmVtYXJrYWJsZS1taWxlc3RvbmUtOTktcmVjeWNsaW5nLXJhdGUtMzAxODc1MTA2Lmh0bWzSAQA?oc=5\" target=\"_blank\">NEW STUDY CONFIRMS U.S.' MOST RECYCLED CONSUMER PRODUCT - LEAD BATTERIES - MAINTAINS ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The Industry's Strong Circular Economy Keeps 160 Million Batteries from Landfills Annually; Creates Near-Zero Waste Model of Sustainability CHICAGO, July 12, 2023 \/PRNewswire\/ -- Battery Council International (BCI), the leading trade association representing the global battery manufacturing and recycling industry, is thrilled to announce that the U.S. lead battery industry continues its outstanding recycling rate of 99% — the highest of any consumer product in the U.S. That's according to the BCI National Recycling Rate Study commissioned by BCI and prepared by Vault Consulting. BCI released the study, which is updated periodically, on July 12. New study: Lead batteries achieve 99% recycling rate and are the most recycled consumer product in the U.S. Post this A new study reveals that lead batteries are the most recycled consumer product in the U.S. with a 99% recycling rate. This model of sustainability keeps 160 million batteries from landfills each year. Roger Miksad, BCI president and executive director, said the achievement underscores BCI members' unwavering commitment to environmental sustainability and highlights the battery industry's enduring foothold in advancing responsible recycling practices. \"I'm honored to lead Battery Council International at this pivotal moment for the battery manufacturing and recycling industry. Achieving a sustained recycling rate of 99% for lead batteries over the past decade proves our members' dedication to sustainable manufacturing practices,\" Miksad said. \"Together, we'll continue to drive innovation, advance recycling technologies, and promote responsible battery lifecycle management.\" Miksad emphasized that lead batteries are an important part of the nation's transition to clean energy storage. Recycling raw materials instead of relying on newly mined minerals significantly reduces the manufacturing footprint for batteries. Lead batteries are critical to our low carbon future by being a critical component in many sustainable applications. Study Methodology The National Recycling Rate Study provides updates to aggregated data for the five-year reporting period, 2017-2021. The lead battery recycling rate for that period is derived by dividing the total pounds of lead batteries recycled by the total pounds of lead available for recycling in the U.S. To account for significant market disruptions during the COVID-19 pandemic, the study averaged the BCI Recycling Rate Studies spanning the decade of 2011-2021 to derive the sustained recycling rate of 99%. Overall, the study confirms the exceptional achievements of the lead battery industry in perfecting recycling processes and a circular economy for lead batteries. \"The lead battery industry is minimizing the environmental impact of battery disposal with a highly successful circular 'manufacture-use-reuse' model. It has become the blueprint for newer battery chemistries, as well as other industries,\" Miksad added. Facts about the Lead Battery Industry's Circular Economy Lead batteries are designed to be recycled. A lead battery's three main components (lead, plastic, acid) are 100% recyclable. This creates the raw materials needed for new lead batteries, and the typical new lead battery is formed of at least 80% recycled material. The lead from lead batteries can be infinitely recycled with no loss of performance. In fact, U.S. lead battery manufacturers source approximately 83% of the needed lead from North American recycling facilities. The plastic casings are also recycled. Lead batteries have an established, domestic infrastructure. There is a vast network of existing manufacturing, collection and recycling facilities, including more than 300,000 retail distribution and collection sites for used lead batteries. By promoting collaboration among stakeholders, BCI aims to develop robust recycling systems that support a circular economy and help the responsible management of battery waste. Ongoing research and development efforts. In addition to recycling, BCI and its members are actively engaged in making batteries more recyclable and sustainable. This integrated approach underscores BCI's commitment to advancing the industry's environmental performance and meeting regulatory needs worldwide. Miksad said BCI remains steadfast in its commitment to creating a more sustainable and secure energy storage future. \"By working closely with industry partners, policymakers, and the public, BCI is working hard to meet our energy storage needs now and well into the electrified future.\" About Battery Council International. Battery Council International (BCI) will soon celebrate its 100-year anniversary as the leading trade association of the North American battery industry representing more than 125 member companies. Formed in 1924, BCI joins together battery manufacturers and recyclers, marketers and retailers, suppliers of raw materials and equipment, and battery distributors from across North America and around the world. BCI members are committed to responsible manufacturing and recycling processes and serve as a unified voice for environmental, health, and safety stewardship. The organization continues to unite members within the lead industry to successfully communicate and protect, through education, science, and government efforts, the most successful circular economy on the planet. With 99% of used lead batteries collected and recycled in the U.S. and the typical new lead battery containing 80% or more of recycled content, BCI supports the path toward similar sustainability goals for all other battery chemistries. For more information, visit www.batterycouncil.org. SOURCE Battery Council International","filter_flag":1}
{"title":"Manufacturers placing a big bet on sustainable packaging - dairyfoods.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTkyLW1hbnVmYWN0dXJlcnMtcGxhY2luZy1hLWJpZy1iZXQtb24tc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTkyLW1hbnVmYWN0dXJlcnMtcGxhY2luZy1hLWJpZy1iZXQtb24tc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTkyLW1hbnVmYWN0dXJlcnMtcGxhY2luZy1hLWJpZy1iZXQtb24tc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA","guidislink":false,"published":"Wed, 26 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=207, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTkyLW1hbnVmYWN0dXJlcnMtcGxhY2luZy1hLWJpZy1iZXQtb24tc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5\" target=\"_blank\">Manufacturers placing a big bet on sustainable packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Manufacturers placing a big bet on sustainable packaging - dairyfoods.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2NTkyLW1hbnVmYWN0dXJlcnMtcGxhY2luZy1hLWJpZy1iZXQtb24tc3VzdGFpbmFibGUtcGFja2FnaW5n0gEA?oc=5\" target=\"_blank\">Manufacturers placing a big bet on sustainable packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","source.href":"https:\/\/www.dairyfoods.com","source.title":"dairyfoods.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycling Practices\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Dairy processors’ sustainability goals require many aspects, as are discussed throughout this issue. One important stop on the path to climate and carbon neutrality is sustainable packaging. The data backs up this claim. Future Market Insights (FMI) looks specifically at global cardboard trays, made from recyclable plant fiber that use no plastic in their manufacturing. According to FMI, the market for cardboard trays — just one piece of the sustainable packaging puzzle — is expected to accumulate a market value of $5.5 billion this year. Within the next 10 years, the market is expected to ascend at a 5.4% compound annual growth rate (CAGR), reaching $9.2 billion in 2033. “These biodegradable trays can be used for the storage of cold and warm food items because they can be heated in the microwave and can be frozen without any damage to the packing,” FMI states. “Also, cardboard trays easily carry food items that are heavy, light, solid, or liquid. It is a popular notion that these trays are the most user-friendly kind of packaging solution due to their airtight locking system, which prevents any spills and leaks.” Dairy Foods takes a look at the entire sustainable packaging market, thanks to the help of several suppliers, all of whom believe sustainable packaging will be a critical component for dairy processors moving forward. Paying attention Beyond its environmental benefits, packaging providers state consumers seek sustainable packaging. “We are hearing from our customers that consumers are paying more attention to what the packaging is made from and what they have to do with it after the contents have been used,” says Murray Bain, vice president of marketing at Stanpac, Totowa, N.J. Christopher Gabriel, strategic marketing director for dairy for Chicago-based TC Transcontinental Packaging, holds a similar sentiment, noting sustainable packaging has emerged as a critical factor influencing consumer buying decisions. “Sustainable packaging resonates with consumers as it aligns with their values and desire to make a positive impact on the planet. By choosing sustainable packaging, dairy processors can not only meet consumer expectations but also gain a competitive edge in the market,” he tells Dairy Foods. Sustainable packaging is also easily identifiable today, notes Jason Pelz, regional vice president of Sustainability for Denton, Texas-based Tetra Pak. Most packaging will indicate if it is recyclable, recyclable only where facilities exist, or in some cases, not recyclable at all. Packaging that offers additional sustainable benefits will often carry additional certifications or on-pack messaging, he says. “For example, some Tetra Pak cartons offer plant-based plastics made from sugarcane instead of fossil-fuel based sources, thereby reducing the environmental impact of the carton without compromising on food safety,” Pelz reveals. “These cartons often indicate this sustainable attribute with a Bonsucro logo or the Carbon Trust ‘Reducing CO2 Packaging’ logo to help educate consumers, making it easier to identify and purchase sustainable packaging options.” For some cheese applications, packaging could be adjusted to decrease the total amount of plastic in the package, states Amcor’s Travis Klug. Photo courtesy of Amcor. On the labeling front, there are certainly many ways to achieve gains at one or multiple levels, suggests Katie Austing, vice president of customer service and sustainability, KDV Label, Waukesha, Wis. Many brands KDV Label works with have reduced the overall thickness and\/or the size of their labels. These adjustments require some testing and tweaking especially when using automated application systems. However, they can be effective in reducing not only the material used, but can also reduce manufacturing waste and transportation emissions. “We work with customers to design sustainable label constructions to be optimally recycled with your container. With plastic so prevalently used in the dairy industry, we are members of the Association of Plastic Recyclers (APR) and follow the development of their guidelines closely to help advise our customers on the label construction that will best meet recyclability standards without sacrificing label performance,” Austing notes. “Dairy labels go through some of the most rigorous and thermal conditions during filling operations, but there are options that will maintain durability and also comply within recycle streams.” “Paper or plastic?” Based upon the aforementioned information, consumers are seeking sustainable packaging. However, plastic offers many unique properties that are difficult to replicate in packaging. “Plastics plays an important role in dairy and food packaging and continues to provide value for a wide variety of applications,” says Jonathan Cage, director of business development, ICPG, Putnam, Conn. “…Providing excellent package integrity and performance throughout the supply chain, plastics continue to be the best choice for dairy packaging today.” Yet, he stresses there are alternatives for dairy processors seeking to offer sustainable packaging, including ICPG’s XPP Polypropylene Solutions, “which not only meets performance considerations and offers drop-in process compatibility on existing thermoforming and FFS lines, but also provides higher yields at lower costs providing a true sustainable, fully recyclable, cost-effective solution for the dairy industry,” Cage maintains. For some cheese applications, packaging could be adjusted to decrease the total amount of plastic in the package. This could be achieved by reducing the thickness of the package material or in some cases by removing excess packaging, says Travis Klug, dairy marketing manager, Amcor Flexibles North America, Deerfield, Ill. “Including recycled content within a cheese package is also an important part of developing a more sustainable circular economy, and including it within a package helps improve the environmental footprint by reducing energy use and greenhouse gas emissions,” he notes. Amcor utilizes Post Consumer Recycled (PCR) resins in its packaging. Its DairySeal line of packaging features ClearCor, an advanced polyethylene terephthalate (PET) barrier technology, adds Carmen Becker, Amcor Flexibles’ vice president and general manager of specialty containers. Winpak also offers several sustainable packaging technologies for the dairy industry, claims Darin Gregg, market director of dairy for the Senoia, Ga., company. “For cheese, the Winpak ReFresh line of recycle-ready film structures offer cheese processors\/packagers the benefit of a more sustainable packaging solution while still providing excellent aesthetics, product protection, and operational productivity. In addition, Winpak offers PvDC free shrink bags and Flow Vac shrink rollstock materials,” Gregg states. In terms of rigid packaging, Winpak also utilizes PCR resins. In semi-rigid thermoforming films, Winpak offers PCR structures with 20-50% recycled PET, delivering an approximate 30% reduction of carbon dioxide emissions compared to standard structures, Gregg maintains. Gabriel recognizes plastic is sometimes necessary in dairy packaging due to its unique properties. “To make plastic more sustainable, we focus on incorporating post-consumer recycled content into our packaging. By utilizing recycled plastics, we reduce the demand for virgin materials and contribute to the circular economy. Additionally, we are exploring new technologies and materials that enhance the recyclability of plastic packaging, ensuring it can be effectively processed and reused,” he says. At Silgan Closures, the company uses lightweight closures or less material when possible. “Our latest lightweighted closure is our 30 F15 Carton Fitment,” says AJ Miller, director of marketing for the Downers Grove, Ill., company. “Using a single material in your packaging helps reduce contaminants in the recycling steam. You can do this by using a linerless closure so the closure is all one material. You can also use a single material for your bottles and closures.” Huhtamaki is focused on designing packaging that can be recycled, composted or reused. The company recently introduced its ICON ice cream package, made from 95% renewable bio-based material and combines a proprietary water-based barrier coating with Sustainable Forestry Initiative (SFI)-certified paperboard. This enables North American consumers to recycle ice cream containers and lids like other paper products, relays Michael Hodges, vice president of sustainability and communications for the De Soto, Kan., company. ICPG’s yogurt multi-packs are produced from its XPP Polypropylene Solutions. Photo courtesy of ICPG. “Another new dairy application we have offered in the United States is our paperboard dairy cup. A transition to paper versus plastic decreases the plastic usage by a substantial amount,” he says. “This technology can be used for yogurt, cottage cheese, sour cream, hummus, and more.” For dairy processors who produce chilled dairy milk, there are fully renewable package options available, Pelz reveals, noting Clover Sonoma Dairy was the first dairy processor in the United States to offer Tetra Pak’s fully plant-based, renewable carton. “The fully renewable carton is primarily made from Forest Stewardship Council-certified paperboard and a plant-based plastic liner, offering a smaller carbon footprint than traditional cartons,” Pelz explains. “Because this carton is made with renewable, plant-based materials, it gives dairy processors an edge when it comes to meeting sustainability goals and consumer demand.” Aseptic processing and packaging for shelf-stable dairy milk also offers a number of sustainable benefits, Pelz adds. Educating consumers As mentioned earlier, packaging sets forth not only to be more sustainable, but alert consumers about its benefits as well. The latter is still an ongoing process. For dairy processors looking to stand out, sustainable packaging could be the deciding factor in choosing which product they select. Stanpac’s Bain notes that problem No. 1 is a “very patchwork” recycling system across the country. “What is recycled and not — and how — are so different, so it is hard for a regional or national brand to make a claim that a product can be recycled or composted. A lot of work is needed to work toward a national system,” Bain asserts. Beyond a national system, what can be done? It may sound simple, but ensuring the recycling logo is clearly visible on the package is one of the best ways to encourage consumer recycling practices, Pelz stresses. “Research by Carton Council has found that packaging plays a critical role in driving recycling action,” he notes. “Fifty percent of consumers look to a product’s packaging first to determine recyclability. Additionally, recent research reveals that 75% of consumers would assume a package was not recyclable if there was no recycling symbol or language on pack. By simply ensuring that packaging includes clearly visible recycling logos, processors can help educate and encourage consumers to take action.” Gabriel adds dairy processors play a vital role in the education process. “Through strategic collaboration and partnerships, TC Transcontinental Packaging actively engages with processors to develop educational initiatives. These initiatives can include labeling that clearly communicates recycling instructions, working closely with recycling facilities and municipalities to streamline the recycling process, and leveraging digital platforms to raise awareness about the benefits of recycling,” he says. Huhtamaki foresees printed tags and codes that enable packaging to have a true digital identity will provide substantial added value, Hodges states. “One of the key values in smart packaging is the easy access to information on the raw materials used in the packaging, which facilitates easier recycling, customer engagement with the content, and traceability of the origin of the product,” he adds. “Smart packaging goes beyond printed tags, codes, and other potential features. It can unlock sustainability and contribute to circularity.” As technology in materials development progresses, the elimination of polyethylene (PE) coated paperboard are allowing ice cream packaging to be included in the paper recycling system, notes Stanpac’s Murray Bain. Photo courtesy of Stanpac. Silgan Closures’ Miller advises there’s one aspect of recycling dairy packaging that is not always known. The consumer should put the closure back onto the bottle before the package is placed in the recycling cart, he suggests. “A small closure by itself will get lost in the recycling process. Scraps below three inches in width cannot be easily sorted by automated systems,” Miller explains. “If the closure is attached to the bottle, the bottle will carry the closure through the recycling system and deliver it to the correct recycling stream. “Putting the closures on the bottle can be communicated with How2Recycle labels,” he continues. “The Sustainable Packaging Coalition offers How2Recycle labels that provide consistent and transparent on-package recycling information to consumers.” Forecasting the future TC Transcontinental’s Gabriel believes the future of sustainable packaging “holds great promise.” Several packaging providers are putting their money behind this trend, meaning sustainability in packaging is here to stay. Tetra Pak is clearly one such company, evidenced by the fact it is investing 100 million euros a year for the next five to 10 years in an effort to create the world’s most sustainable packaging, Pelz revealed. “In support of this, Tetra Pak has recently tested a number of sustainable innovations. This includes tethered caps, which will reduce litter and increase the amount of carton material that is properly recycled, and a new fiber-based barrier with the aim to replace the aluminum foil layer of the package to increase the share of renewable materials in every carton,” he says. Dairy packaging has a strong and sustainable future, affirms Phillip Crowder, Winpak’s director of corporate sustainability. “HDPE milk jugs are one of the most recycled packages of any material today. Beyond these formats, flexible packaging innovations are available today that are recycle-ready and are lower in GHG emissions,” Crowder says. “These flexible packaging innovations are typically more than 20% lower in GHG emissions versus traditional packaging structures. They can also incorporate recycled content to better support the circular economy.” Aseptic packaging is one important form of sustainable packaging. Photo courtesy of Tetra Pak. Additionally, digital watermarking is a solution being advanced today to support improved recyclability and traceability, especially in the area of flexible packaging. “This technology is expected to grow and support the growth of recycle ready flexible dairy packaging,” Crowder predicts. “Currently there are significant initiatives to reduce and replace today’s problematic materials,” ICPG’s Cage adds. “As these systems commercialize, there is an opportunity, for instance to eventually utilize PCR content back into the package itself creating a closed loop, circular economy system,” he says. Processors will continue to deliver on consumer expectations for freshness and flavor, with packaging delivering the ideal consumer experience, adds Amcor Flexibles’ Becker. “We’re identifying innovative solutions to tackle light transmission that are more sustainable, maintain freshness and offer the consumer an ideal experience.” Hodges states how important sustainability packaging is, with Huhtamaki’s ambition that 100% of its products be designed to be recyclable, compostable or reusable. By 2030, more than 80% of the materials it uses will renewable and recyclable, and 100% of the fiber it sources is either recycled or from certified sources, he states. However, Huhtamaki’s Hodges stresses that when “making choices in the product design phase — for example regarding the choice of materials or the structure of the packaging — there can never be a compromise on the safety and quality of the final product that is to be used in food contact. Product safety is non-negotiable and managing food contact safety is at the core of our sustainable packaging solutions for food.” Packaging will change in the years ahead, Bain predicts. “A lot of work from many companies is taking place at many levels to develop products that will not end up in landfills and use less resources to make them in the first place,” he maintains. “For us, it is increasing the paper used in ice cream packaging. The fiber can be used for many products and is a more sustainable approach to the stewardship of our resources.” KDV Labels’ Austing acknowledges sustainable packaging is not going to be a “fix-it-and-forget-it solution.” However as more focus and effort are put into innovating new materials, improving infrastructure for recycling and educating consumers, sustainable dairy packaging also should progress. “As we explore different types of raw materials, like bio-based resources, our materials will contain more renewable content. As we get better at recycling, our materials will contain more recycled content,” Austing concludes. “And as we tell customers about our efforts and the positive impact, consumers will expect and demand sustainable packaging. Solutions that make for sustainably disposing of packaging the easiest are going to rise to the top.”","filter_flag":1}
