{"title":"Secure and Reliable Wireless Private Network Facilitates Digital Transformation of Power Distribution and Consumption - Huawei Enterprise","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL2luZHVzdHJpZXMvZW5lcmd5LzIwMjMvZWxlY3RyaWMtcG93ZXItd2lyZWxlc3MtcHJpdmF0ZS1uZXR3b3Jr0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL2luZHVzdHJpZXMvZW5lcmd5LzIwMjMvZWxlY3RyaWMtcG93ZXItd2lyZWxlc3MtcHJpdmF0ZS1uZXR3b3Jr0gEA?oc=5","id":"CBMiXGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL2luZHVzdHJpZXMvZW5lcmd5LzIwMjMvZWxlY3RyaWMtcG93ZXItd2lyZWxlc3MtcHJpdmF0ZS1uZXR3b3Jr0gEA","guidislink":false,"published":"Mon, 07 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=219, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL2luZHVzdHJpZXMvZW5lcmd5LzIwMjMvZWxlY3RyaWMtcG93ZXItd2lyZWxlc3MtcHJpdmF0ZS1uZXR3b3Jr0gEA?oc=5\" target=\"_blank\">Secure and Reliable Wireless Private Network Facilitates Digital Transformation of Power Distribution and Consumption<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huawei Enterprise<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Secure and Reliable Wireless Private Network Facilitates Digital Transformation of Power Distribution and Consumption - Huawei Enterprise","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL2luZHVzdHJpZXMvZW5lcmd5LzIwMjMvZWxlY3RyaWMtcG93ZXItd2lyZWxlc3MtcHJpdmF0ZS1uZXR3b3Jr0gEA?oc=5\" target=\"_blank\">Secure and Reliable Wireless Private Network Facilitates Digital Transformation of Power Distribution and Consumption<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huawei Enterprise<\/font>","source.href":"https:\/\/e.huawei.com","source.title":"Huawei Enterprise","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Utilization\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Secure and Reliable Wireless Private Network Facilitates Digital Transformation of Power Distribution and Consumption 2023-08-07 3510 2 According to recent energy-based carbon emission trends released by the International Energy Agency, if nothing changes, it will be hard to achieve the goal of net zero greenhouse gas emissions proposed in the Paris Agreement by the middle of this century. Faster zero-carbon transformation has become a must. That being said,the electric power industry is on the verge of digital transformation. Industry digitalization will also inject more vitality into the zero-carbon transformation of the energy industry. To get the ball rolling, it needs to augment its structure to improve energy efficiency. A new power energy system that involves centralized and distributed energy of various types must be constructed. The system will connect with both sides of supply and demand, and aims to improve renewable energy utilization, strengthen electricity substitution, and integrate source, grid, load, and storage. This heightens energy efficiency, ensuring green, low-carbon, cost-effective, and efficient development for the electric power industry with safe supplies. The development trend of power distribution and consumption services places new requirements on the communications network for power distribution. Large-scale access of distributed PV, energy storage, micro-grid, electric vehicle, and interactive energy consumption devices alongside prolific user interaction has increased pressure on source-grid-load-storage synergy. This has also led to the rapid growth of diversified energy consumption service requirements from customers. Numerous devices on the power distribution network are changing quickly while the overall development is unbalanced and inadequate. These challenges place high demands on the digital transformation of distribution networks as well as the communications foundation that supports network operations. What this means is, the latency of the precise load control service must be less than 100 milliseconds; automatic meter reading needs to be shortened from 15 minutes to just 1 minute; and the latency of the distributed energy monitoring service must be under 1 second. However, the current power system delivers limited communications coverage across 10 kV or lower power distribution scenarios, with the power distribution network still using the blind adjustment and control mode. A novel communications system is a necessity, and it must adapt to the features of the new power system. This includes being able to keep up with heightened security, stability, reliability, and efficiency, as well as real-time performance, scattered distribution, and massive access. The 3GPP wireless broadband private network is an ideal choice for medium- and low-voltage power distribution communications networks. The distribution network lies at the end of the grid and connects end users. It features a complex structure, large quantity, and wide coverage. The power distribution communications network needs to resolve the problems of data transmission for substations, power supply stations, power distribution lines, distribution transformers, and household meters. The aim is to precisely control services, ensure a high site connection rate, quickly locate faults, and automatically collect meter data. The backbone power distribution communications network should use the optical private network. Currently, the communications access network of power distribution terminals can use the power line carrier (PLC), optical private network, wireless public network, wireless private network, or RF mesh. For example, it is expensive to build and reconstruct optical networks and even heavier investment is required to support the digital transformation of distribution networks through optical networks. Wireless public networks provide limited coverage and are less secure and reliable. They cannot be depended on to support remote control over power distribution automation, monitor PV and new energy in seconds, and ensure low latency for precise load control. For an RF mesh network, its deficiencies include long latency, slow networking, and inflexible capacity expansion. Additionally, the energy industry uses technologies like radio modem, mesh, and LoRa on the VHF\/UHF narrowband discrete spectrum. However, these technologies suffer from restrictions including long latency, small capacity, and insufficient bandwidth, which cannot meet the development requirements of power IoT. Considering this, the 3GPP wireless broadband private network that is secure, reliable, universal, cost-effective, and flexible has become an ideal choice for ensuring the last-mile access of power grids. The wireless network is not restricted by the ground line structure. In addition, it has the following advantages of wireless communications: excellent non-line-of-sight (NLOS) transmission, strong resilience in face of natural disasters, fast deployment, high-speed bandwidth, secure transmission, and flexible response to countless nodes. As such, wireless communications provide overwhelming technical advantages to meet service requirements. This includes remote control, information collection, and video security. A private power communications network using mature wireless broadband technologies not only enhances reliability and security, but also provides high-speed uplink and downlink data access services and multiple value-added services like voice and video security. Huawei's Smart Grid eLTE Private Network Solution quickly enables last-mile access. Centered on industry customer requirements, Huawei has developed this solution based on its extensive wireless technology accumulation and eLTE wireless private network solution to adapt to the service and spectrum characteristics of the electric power industry. This solution enables ubiquitous power IoT for all services. It builds a deeply integrated power wireless private network, which supports different network access types and carries a wide variety of services. This end-to-end solution for customers in the electric power industry is the best choice for building intelligent electric power communications networks. The Huawei solution adopts the mainstream 3GPP spectrum and boasts many advantages such as low latency, wide coverage, multiple services on one network, easy deployment and maintenance, openness and cooperation, and 5G-oriented evolution. It carries various services such as distribution automation, precise load control, station environment monitoring, power quality monitoring, and video security. This meets the requirements of intelligent electric power communications networks in terms of security, reliability, latency, and access capacity. Huawei has worked with a customer in Eastern China to pilot the commercial use of the Smart Grid eLTE Private Network Solution. After three years of construction, the project has enabled hundreds of thousands of power distribution terminals to access the network, rocketing the terminal online rate to over 99%. Huawei's solution supports the customer's services that require low latency and high reliability, such as power distribution automation, intelligent distribution and transformation, source-grid-load-storage, distributed PV, and power consumption information collection, significantly improving the quality of power supply services. The deployment of the wireless network also saves time and money when it comes to civil work, protecting the customer's capital expenditure and accelerating construction. Huawei is actively promoting the deployment of the Smart Grid eLTE Private Network Solution with customers around the world to solve communications problems in various electric power scenarios. Wireless broadband technologies build a secure, reliable, and 5G-oriented industry Internet. Drawing on its technical practices and industry experience in the wireless domain, Huawei understands the major challenges faced by customers in the electric power industry during digital upgrades. It fully recognizes the importance of wireless power distribution to the development and transformation of the industry. As such, Huawei proactively provides suggestions and development ideas regarding transformation. It keeps working with industry partners to strengthen device-network synergy using 4G\/5G technologies and new capabilities, as well as build highly reliable power distribution security networks that converge multiple modes to help electric power customers go digital. In doing so, Huawei paves a digital path for realizing global energy transition and carbon neutrality. For more information about Huawei enterprise wireless solutions, visit https:\/\/e.huawei.com\/en\/solutions\/enterprise-wireless\/industry-wireless. For more information about Huawei solutions for the electric power industry, visit https:\/\/e.huawei.com\/en\/industries\/grid. Disclaimer: The views and opinions expressed in this article are those of the author and do not necessarily reflect the official policy, position, products, and technologies of Huawei Technologies Co., Ltd. If you need to learn more about the products and technologies of Huawei Technologies Co., Ltd., please visit our website at e.huawei.com or contact us.","filter_flag":1}
