{"title":"A Plan to Reduce Semiconductor Emissions | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5\" target=\"_blank\">A Plan to Reduce Semiconductor Emissions | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A Plan to Reduce Semiconductor Emissions | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5\" target=\"_blank\">A Plan to Reduce Semiconductor Emissions | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The “low-carbon energy” scenario anticipates that the semiconductor industry can curb over half of benchmark 2050 emissions—the level of carbon output in the absence of any viable action to reduce it—by supporting the realization of the International Energy Agency’s Stated Energy Policies Scenario (STEPS). STEPS reflects the impact of existing government policy frameworks and announced plans. However, this outcome leaves chip manufacturing emissions at 168 Mt per year in 2050 and nearly 5 Gt total, significantly above net zero and 1.5°C targets. Our other scenario incorporates company commitments by the 40 highest emitters in semiconductor manufacturing, as currently reported, representing a substantial majority of all emissions. This scenario promises material progress toward a collective net zero goal. Even so, its results fall short of net zero by 2050—and of meeting the 1.5°C objective, by a factor of 3.5x. As the report shows, achieving the 1.5°C carbon expenditure goal will not be easy for semiconductor companies. Indeed, even the significant efforts already pledged and taken will not reduce the industry’s carbon footprint to net zero. Overcoming this gap will require deeper collaboration across the industry, which we strongly encourage and the SCC has begun to foster. Click here to read the full report.","filter_flag":1}
{"title":"Circular black masterbatch - PlasticsToday","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5\" target=\"_blank\">Circular black masterbatch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular black masterbatch - PlasticsToday","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5\" target=\"_blank\">Circular black masterbatch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","source.href":"https:\/\/www.plasticstoday.com","source.title":"PlasticsToday","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Cabot Corp., a global manufacturer of black masterbatch, launched its new REPLASBLAK product family of circular black masterbatches with certified material. Black masterbatch is a combination of black carbon pigment, resin, and other additives in granular form used to color plastics. Three new products will be sold as the company’s first International Sustainability & Carbon Certification (ISCC Plus) certified black masterbatch products powered by Evolve Sustainable Solutions. Cabot’s recently launched Evolve Sustainable Solutions platform delivers products with sustainable content and reliable performance at an industrial scale across three categories — recovered, renewable, and reduced, said Cabot. Masterbatch suitable for packaging, automotive applications Increased environmental pressure is driving greater demand for black masterbatch products that support a circular economy and decrease greenhouse gas (GHG) emissions, the company said. The new products can be used in various applications in the automotive, agriculture, packaging, and building and construction segments. Cabot’s three new black masterbatch products powered by Evolve Sustainable Solutions under the recovered category include the following: REPLASBLAK rePE5475 100% circular black masterbatch leverages 100% ISCC Plus mass balance–certified material made from reclaimed carbon from end-of-life tire pyrolysis and mechanically recycled polyethylene. GHG emissions are reduced by more than 60% compared with standard black masterbatch and the material adheres to the ISCC Plus voluntary add-on GHG emission requirements, the company said. It supports medium tint strength, making the material suitable for compounding, recycling, injection molding, and sheet extrusion applications relevant to the automotive, agriculture, packaging, and building and construction segments. REPLASBLAK rePE5265 70% circular black masterbatch leverages 70% ISCC Plus mass balance–certified material made from mechanically recycled polyethylene. It reduces GHG emissions by nearly 50% in comparison to standard black masterbatch and adheres to the ISCC Plus voluntary add-on GHG emission requirements, the company said. It delivers high gloss and jet pigmentation in thermoplastics, making it suitable for compounding, recycling, injection molding, and sheet extrusion applications in the automotive segment. REPLASBLAK rePE5250 60% circular black masterbatch leverages 60% ISCC Plus mass balance–certified material made from mechanically recycled polyethylene. It reduces GHG emissions by nearly 50% in comparison to standard black masterbatch and adheres to the ISCC Plus voluntary add-on GHG emission requirements, the company said. It delivers high tint strength making it suitable for compounding, recycling, injection molding, and sheet extrusion applications relevant to the automotive segment. ISCC is a globally applicable certification system designed to ensure compliance with ecological and social requirements, GHG emission savings, and traceability, the company said. Mass balance accounting is designed to trace the flow of materials through a complex value chain, including recycled feedstock at plants. Circular value chains and certified feedstocks “As the largest global manufacturer of black masterbatch, we have the capacity and expertise to deliver innovative solutions that help our customers solve their sustainability challenges as well as meet our own sustainability objectives,” said Jeff Zhu, executive vice president and president, Performance Chemicals segment and Asia Pacific region. “Our new black masterbatch products powered by Evolve Sustainable Solutions will be manufactured at our plants in Pepinster and Loncin, Belgium, which recently achieved ISCC PLUS certification. This gives our customers third-party validation that our products are leveraging circular value chains and certified feedstocks in the product manufacturing process. With several projects at various stages of development, we are excited about our progress and look forward to continuing to collaborate with our customers and industry partners on building out our product pipeline to enable a more sustainable world,” said Zhu.","filter_flag":1}
{"title":"Mars rethinks recipes, ingredients on journey to Net Zero - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9tYXJzLXJldGhpbmtzLXJlY2lwZXMtaW5ncmVkaWVudHMtb24tam91cm5leS10by1uZXQtemVyb9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9tYXJzLXJldGhpbmtzLXJlY2lwZXMtaW5ncmVkaWVudHMtb24tam91cm5leS10by1uZXQtemVyb9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9tYXJzLXJldGhpbmtzLXJlY2lwZXMtaW5ncmVkaWVudHMtb24tam91cm5leS10by1uZXQtemVyb9IBAA","guidislink":false,"published":"Wed, 29 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9tYXJzLXJldGhpbmtzLXJlY2lwZXMtaW5ncmVkaWVudHMtb24tam91cm5leS10by1uZXQtemVyb9IBAA?oc=5\" target=\"_blank\">Mars rethinks recipes, ingredients on journey to Net Zero<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mars rethinks recipes, ingredients on journey to Net Zero - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9tYXJzLXJldGhpbmtzLXJlY2lwZXMtaW5ncmVkaWVudHMtb24tam91cm5leS10by1uZXQtemVyb9IBAA?oc=5\" target=\"_blank\">Mars rethinks recipes, ingredients on journey to Net Zero<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In 2021, Mars Inc. committed to reach net zero emissions across its full value chain by 2050. Now, two years later the rice-to-chocolate major has outlined a net zero roadmap, including an ambition to halve emissions – from a 2015 baseline – by 2030. Mars is pulling many levers to achieve its net zero goal, including transitioning to renewable energy, eliminating deforestation from its supply chains, increasing climate smart agriculture initiatives, and improving logistics. The other tool in Mars’ toolbox is ingredient innovation and product reformulation. The company is developing new ingredients with lower greenhouse gas (GHG)-footprints for snacks and human food dishes, as well as alternative proteins for pet food. Addressing a major culprit: agriculture​ Mars, which boasts household name brands Ben’s Original, Twix, and Mars bar in its portfolio, has a current carbon footprint of 30.3mt CO2e. In other words, the company emits around the same amount of GHG as a country the size of Finland. Thirty-eight percent of the company’s emissions come from agriculture, including its food ingredients. Other emissions are associated with land use change (27%), retail (11%), logistics (10%), packaging (5%), and direct operations (4%). Not only is agriculture responsible for a majority of Mars’ emissions, but it is the most challenging to reduce. The company has made progress since 2015, which it attributes to a combination of recipe changes as well as early results from work in some crop supply chains. Thirty-eight percent of the company’s emissions come from agriculture, including its food ingredients. GettyImages\/Eliot76 To further lower emissions associated with agriculture, Mars is looking to optimise sourcing, process and distribution, and formulation. While changing product formulation can be challenging because there are numerous restraints – ranging from consumer perception to regulatory standards and nutritional requirements – the company sees opportunity to optimise and develop novel ingredients, as well as production practices, to further lower GHGs. It is estimated such actions could reduce emissions by 0.7mt CO2e. Tapping a potential ‘game-changer’ ingredient​ So what kind of innovations is Mars leveraging to reduce its emissions? According to Janet Dawson, VP of Science and Technology at Mars Snacking, the company’s Ingredient Science team is committed to ‘pioneering a new era of sustainable ingredients’. “Our latest breakthrough, developed in partnership with UC Davis, is a potential game-changer that could make allulose, a natural sugar substitute, more affordable and accessible though precise fermentation,” ​she told FoodNavigator. Mars funded the research, which saw the Mars Advanced Research Institute team up with UC Davis scientists to work on the sugar alternative allulose, otherwise known as D-psicose. In terms of flavour profile, allulose boasts close to 70% of the sweet taste of sucrose, yet is minimally metabolised by the body. This means that consumers can eat sweet treats with a reduced calorie intake. Further, the sugar substitute has an ‘imperceptible’ effect on blood glucose and insulin levels. Allulose is naturally occurring, but the researchers discovered a new way of producing it in a lab. By activating a natural process in a microorganism, the scientists were able to develop a method of high-yield and high-purity production through precise fermentation. Specifically, they found an industrial microorganism that has the enzymes to make allulose. The researchers were able to edit the organism’s metabolism to get the cells to convert glucose into allulose, so that when they were fed glucose, allulose was produced with a ‘noteworthy’ concentration, a yield of more than 60%, and purity of over 95%. “Allulose is a great alternative to sugar, but we have not had a cost-effective way to manufacture it,” ​said Shota Atsumi, professor of chemistry at UC Davis and corresponding author on the paper published in Science of Food​. “Our new method is efficient, economically feasible and could be scaled up for commercial production.”​ This technological innovation is just one example of how Mars is ‘constantly pushing the boundaries of what’s possible’, said Dawson. Using allulose instead of sugar is not currently an option for Mars in Europe, where the sugar substitute is considered a novel food and as such, requires pre-market. Naturally occurring allulose is currently undergoing safety assessments by the European Food Safety Authority (EFSA). Looking to start-up innovation​ In the US, Mars recently conducted a trial launch of CO2COA using Perfect Day’s precision fermentation-derived dairy protein. Image credit: Mars Inc. At the same time, Mars is looking to third-party ingredient suppliers to develop new products. In the US, Mars recently conducted a trial launch of CO2COA using Perfect Day’s precision fermentation-derived dairy protein. Perfect Day is making whey, casein, and dairy fats – without the cow. To date, only its whey protein beta-lactoglobulin is on the market. To make animal-free whey, the start-up uses a genetically engineered strain of the filamentous fungus Trichoderma Reesi​ and feeds it with a broth made from water, nutrients and sugar in a fermenter tank. The fungus then excretes the dairy protein for Perfect Day to harvest. A recent lifecycle assessment found that Perfect Day’s precision fermentation process uses up to 99% less water and produces up to 97% fewer GHG emissions compared to traditional production methods. Lactose-free milk chocolate brand CO2COA was made with Rainforest Alliance certified cocoa and sold in 83% fibre-based packaging. According to Dawson, Perfect Day’s animal-free protein delivered a ‘comparable chocolate experience that consumers ‘really liked’. Encouraging sustainable practices within current supply chains​ While working with novel sustainable ingredients will play a ‘critical’ role in delivering on Mars’ net zero commitment, Dawson stressed that this work is being conducted at the same time as efforts to make Mars’ current stable of ingredients more sustainable. “Our work on dairy is this ethos in action,” ​she told this publication. “We’re working on reducing the footprint of our dairy supply by 50% by 2023 through a number of on-farm interventions in partnership with our top suppliers.”​ Indeed Mars is a member of the Sustainable Agriculture Initiative’s (SAI) Sustainable Dairy Partnership, which aims to promote and communicate continuous improvement in dairy sustainability. The B2B programme targets commercial relationships between dairy buyers and processors. The latter is required to report on their progress and impacts, to help dairy buyers understand sustainability progress within the supply chain. Efforts to make Mars Inc. current stable of ingredients more sustainable are underway. GettyImages\/Johnny Greig Mars is also a member of SAI’s Dairy Working Group, which helps ensure the company is sourcing dairy from suppliers with advanced sustainable farming practices that protect animal welfare, the environment and human rights. How does M&A impact Mars’ net zero ambition?​ Mars has active in M&A of late, incorporate a number of new brands into its portfolio of late. In 2020, the confectionery major acquired snacks brand KIND North America, in 2020 it bought fruit brand Trü Frü, and just last week it was announced Mars would be acquiring UK-based luxury chocolate retailer Hotel Chocolat​. Besides managing the GHGs of businesses Mars operates today, the company acknowledges that climate is an important factor in its inorganic growth strategy. When Mars acquires a business, it also acquires its GHG footprint, all the way back to its baseline year of 2015 and into the future. So when considering an acquisition, Mars will assess the business’ GHG footprint. This includes building into the financial model an estimate of the costs to manage the footprint of the acquired business to align with Mars’ targets. With regards to Hotel Chocolat, the business has already been making progress towards reducing its GHG emissions. The luxury chocolate maker has committed to net zero for its Scope 1 and 2 emissions (those within its own direct operations) by 2030, and reductions have been made by switching electricity to renewable sources (75% wind and 25% biomass). Almost all packaging is now sourced closer to home (the UK and EU), instead of being airfreighted in from East Asia, which the company says has led to a ‘significant’ reduction in emissions. Other steps made to improve the sustainability of its packaging include reducing the amount of packaging where possible, using Forest Stewardship Council (FSC) certified card and paper, and designing packaging to be re-usable.","filter_flag":1}
{"title":"Managing plastic waste with advanced recycling - ExxonMobil","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL3doYXQtd2UtZG8vbWF0ZXJpYWxzLWZvci1tb2Rlcm4tbGl2aW5nL2FkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLXdhc3RlLWV4eG9ubW9iaWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL3doYXQtd2UtZG8vbWF0ZXJpYWxzLWZvci1tb2Rlcm4tbGl2aW5nL2FkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLXdhc3RlLWV4eG9ubW9iaWzSAQA?oc=5","id":"CBMic2h0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL3doYXQtd2UtZG8vbWF0ZXJpYWxzLWZvci1tb2Rlcm4tbGl2aW5nL2FkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLXdhc3RlLWV4eG9ubW9iaWzSAQA","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL3doYXQtd2UtZG8vbWF0ZXJpYWxzLWZvci1tb2Rlcm4tbGl2aW5nL2FkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLXdhc3RlLWV4eG9ubW9iaWzSAQA?oc=5\" target=\"_blank\">Managing plastic waste with advanced recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ExxonMobil<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Managing plastic waste with advanced recycling - ExxonMobil","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vY29ycG9yYXRlLmV4eG9ubW9iaWwuY29tL3doYXQtd2UtZG8vbWF0ZXJpYWxzLWZvci1tb2Rlcm4tbGl2aW5nL2FkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLXdhc3RlLWV4eG9ubW9iaWzSAQA?oc=5\" target=\"_blank\">Managing plastic waste with advanced recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ExxonMobil<\/font>","source.href":"https:\/\/corporate.exxonmobil.com","source.title":"ExxonMobil","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Plastics are essential for modern life. They’re needed for our computers, mobile phones and vehicles. They help preserve food, deliver clean drinking water, and protect against disease. At the same time, plastic waste is a major challenge ExxonMobil is committed to addressing. One way we’re doing that is through advanced recycling. This technology complements mechanical recycling by converting more types of plastics into new products. There’s rising demand for plastics circularity around the world, far exceeding the supply that mechanical recycling provides today. Our customers – and theirs – have goals to use more circular materials in their products and increase the amount of their products that are recycled. Advanced recycling can help consumer brands meet those goals. Marking this year’s America Recycles Day on November 15, I’m proud of the work my colleagues are doing to increase the amount of plastic waste into the recycling stream – in America and around the world. We’re helping to keep plastics out of landfills and away from incineration. In Baytown, Texas, where I spent part of my career, we’ve built one of North America’s largest plastic waste advanced recycling facilities. It’s up and running today and has the capacity to process 80 million pounds of plastic waste per year. And that’s just the start. We’re looking at potential new facilities at other sites in the United States, as well as in Canada, Belgium, the Netherlands and Singapore. All told, we expect to have the capacity to process a billion pounds per year around the world by 2027. Our Baytown plant processes plastic waste that’s difficult to recycle. We’re taking films, plastics with residue from food, motor oil bottles, artificial turf, dry cleaner bags, bubble wrap and more. We combine all of this plastic waste with other feed streams and turn it into the building blocks that create a wide range of products, including new plastics and high-value chemical products. Our process is efficient, converting about 90% of the plastic waste into raw materials. ISCC PLUS, a third-party audited approach, certifies the process and the new ‘certified-circular plastic’ we sell. This is how our customers can be sure their purchase contributes to giving plastic waste a new life and keeping plastics away from landfills. Through my 20+ years with ExxonMobil, I have always known our people to be dedicated to running safe and environmentally responsible operations. We have high standards, and we’re working toward net zero scope 1 and 2 greenhouse gas emissions by 2050 across all of our operated assets.","filter_flag":1}
{"title":"Dow's Board of Directors Approves Final Investment Decision for Path2Zero Project - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvd3MtYm9hcmQtb2YtZGlyZWN0b3JzLWFwcHJvdmVzLWZpbmFsLWludmVzdG1lbnQtZGVjaXNpb24tZm9yLXBhdGgyemVyby1wcm9qZWN0LTMwMTk5OTA0NC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvd3MtYm9hcmQtb2YtZGlyZWN0b3JzLWFwcHJvdmVzLWZpbmFsLWludmVzdG1lbnQtZGVjaXNpb24tZm9yLXBhdGgyemVyby1wcm9qZWN0LTMwMTk5OTA0NC5odG1s0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvd3MtYm9hcmQtb2YtZGlyZWN0b3JzLWFwcHJvdmVzLWZpbmFsLWludmVzdG1lbnQtZGVjaXNpb24tZm9yLXBhdGgyemVyby1wcm9qZWN0LTMwMTk5OTA0NC5odG1s0gEA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvd3MtYm9hcmQtb2YtZGlyZWN0b3JzLWFwcHJvdmVzLWZpbmFsLWludmVzdG1lbnQtZGVjaXNpb24tZm9yLXBhdGgyemVyby1wcm9qZWN0LTMwMTk5OTA0NC5odG1s0gEA?oc=5\" target=\"_blank\">Dow's Board of Directors Approves Final Investment Decision for Path2Zero Project<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dow's Board of Directors Approves Final Investment Decision for Path2Zero Project - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Rvd3MtYm9hcmQtb2YtZGlyZWN0b3JzLWFwcHJvdmVzLWZpbmFsLWludmVzdG1lbnQtZGVjaXNpb24tZm9yLXBhdGgyemVyby1wcm9qZWN0LTMwMTk5OTA0NC5odG1s0gEA?oc=5\" target=\"_blank\">Dow's Board of Directors Approves Final Investment Decision for Path2Zero Project<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Brownfield investment in Fort Saskatchewan, Alberta , will be the world's first net-zero Scope 1 and 2 emissions ethylene and derivatives complex Delivers 2 million MTA of organic growth in attractive, high-end markets while decarbonizing 20% of Dow's global ethylene capacity $1 billion of EBITDA growth expected at full run rates over the economic cycle; expected to be one of Dow's most cost-competitive sites in the world Eliminates 1 million MTA of CO 2 e by converting hydrogen from cracker off-gas as a clean fuel as well as CO 2 capture and storage Best-owner mindset leverages additional $2 billion of investment from third-parties for circular hydrogen, CO 2 capture, and other infrastructure assets Subsidies and incentives from federal, provincial, and local authorities support Dow's targeted returns MIDLAND, Mich., Nov. 28, 2023 \/PRNewswire\/ -- Dow (NYSE: DOW) today announced that its board of directors has declared Final Investment Decision on the Company's Fort Saskatchewan Path2Zero investment to build the world's first net-zeroi Scope 1 and 2 emissionsii integrated ethylene cracker and derivatives facility in Alberta, Canada. Aerial photograph of Dow, Inc.’s manufacturing site in Fort Saskatchewan, Alberta, Canada The $6.5 billion project, excluding governmental incentives and subsidies, includes building a new ethylene cracker and increasing polyethylene capacity by 2 million MTAiii as well as retrofitting the site's existing cracker to net-zero Scope 1 and 2 emissions. The investment is expected to deliver $1 billion of EBITDA growth per year at full run rates over the economic cycle while decarbonizing 20% of Dow's global ethylene capacity. This new capacity will enable Dow to capture growing customer demand in high-value markets, such as packaging, infrastructure and hygiene, among others, with potential additional value captured from commercializing low and zero-emissions products. The project builds on Dow's expertise in successfully implementing large projects, such as its TX-9 cracker in Freeport, Texas, which has delivered more than 15% return on invested capital since its 2017 start-up through best-in-class capital intensity, conversion cost, and low emissions intensity. The board's approval enables the Company to begin construction in 2024. Capacity additions are expected to come online in phases, with the first phase starting up in 2027, adding approximately 1,285 KTAiv of ethylene and polyethylene capacity, and the second phase starting up in 2029, adding an additional approximately 600 KTA of capacity. To achieve net-zero Scope 1 and 2 emissions, the Fort Saskatchewan Path2Zero project will deploy Linde's air separation and autothermal reformer technology to convert the site's cracker off-gas to hydrogen, which will be used as a clean fuel to supply the site's furnaces. In addition, carbon dioxide emissions will be captured and stored, reducing existing emissions by approximately 1 million MTA of CO 2 e while abating all emissions from the addition of the site's new capacity. The Canadian and Alberta Advantage Dow selected the Fort Saskatchewan site for this investment as Western Canada offers highly cost-competitive natural gas relative to other regions, as well as cost-advantaged ethane, a key feedstock for ethylene production. At full run-rates, the site is expected to be one of Dow's most cost-competitive in the world. The region also features access to existing CO 2 transportation and storage infrastructure with available capacity to fully support decarbonization of the project. It is home to a high-class workforce and Dow has been part of the community for more than 60 years. Additionally, the governments of Canada, Alberta, and Fort Saskatchewan have made subsidies and incentives available to support this project and to drive innovation in low-emissions manufacturing in Canada. It will be the first project to access Canada's new ITC program. Dow's investment leverages approximately $2 billion of investment from third-party companies for circular hydrogen, CO 2 capture, and other infrastructure assets critical to the project execution. Earlier this year, Dow announced that Linde had been selected as its industrial gas partner for the supply of clean hydrogen and nitrogen for the site, and Fluor was selected for front-end engineering and design. Additionally, Dow is partnering with Wolf Midstream, which will provide CO 2 transportation along the Alberta trunk line, and with Ravago which will provide third-party logistics for finished products from the site. Attributable Quotes Jim Fitterling, Dow Chair and CEO \"The project serves as a leading example that industrial decarbonization is both possible and profitable.\" \"The opportunity to decarbonize our assets while driving growth is central to Dow's business strategy. All our stakeholders benefit from this investment – creating value for our customers and shareholders, new opportunities for our employees, economic growth for the community, and fewer greenhouse gas emissions for the environment.\" Karen S. Carter, Dow President, Packaging & Specialty Plastics \"This investment paves the way for growth of our entire Packaging and Specialty Plastics portfolio. It gives us the opportunity to become the industry's first provider of zero-emissions products and solutions. Our commitment to innovation and designing products for circularity allows us to meet the evolving needs of our customers across growing sectors such as packaging, infrastructure, and hygiene, among others.\" \"Plastics have long been recognized for their environmental advantages, with a greenhouse gas footprint that is typically less than half of alternative materials. With this strategic investment and our commitment to transform plastic waste to create circular and renewable solutions, we are poised to achieve even greater reductions in emissions, empowering our customers to make significant strides in their sustainability efforts.\" Diego Ordonez, Dow Canada President \"This project will have a profound positive impact on our employees and the community, creating jobs and economic opportunity while positioning the region to be a leader in low emissions manufacturing. Our collaboration with government officials, the community of Fort Saskatchewan , our Indigenous neighbors, and the host of partner companies involved has been key to enabling this investment to move forward.\" Danielle Smith, Premier of Alberta \"This investment by Dow is further evidence of the opportunity that exists in Alberta . We are proud that Dow has chosen to build and launch their project here. This project does not just mean net-zero emissions, it means more jobs and a stronger economy. I look forward to the next steps, including construction starting next year.\" About Dow Dow (NYSE: DOW) combines global breadth; asset integration and scale; focused innovation and materials science expertise; leading business positions; and environmental, social and governance leadership to achieve profitable growth and help deliver a sustainable future. The Company's ambition is to become the most innovative, customer centric, inclusive and sustainable materials science company in the world. Dow's portfolio of plastics, industrial intermediates, coatings and silicones businesses delivers a broad range of differentiated, science-based products and solutions for its customers in high-growth market segments, such as packaging, infrastructure, mobility and consumer applications. Dow operates manufacturing sites in 31 countries and employs approximately 37,800 people. Dow delivered sales of approximately $57B in 2022. References to Dow or the Company mean Dow Inc. and its subsidiaries. For more information, please visit www.dow.com or follow @DowNewsroom on Twitter. Cautionary Statement about Forward-Looking Statements Certain statements in this press release are \"forward-looking statements\" within the meaning of the federal securities laws, including Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such statements often address expected future business and financial performance, financial condition, and other matters, and often contain words or phrases such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"opportunity,\" \"outlook,\" \"plan,\" \"project,\" \"seek,\" \"should,\" \"strategy,\" \"target,\" \"will,\" \"will be,\" \"will continue,\" \"will likely result,\" \"would\" and similar expressions, and variations or negatives of these words or phrases. Forward-looking statements are based on current assumptions and expectations of future events that are subject to risks, uncertainties and other factors that are beyond Dow's control, which may cause actual results to differ materially from those projected, anticipated or implied in the forward-looking statements and speak only as of the date the statements were made. These factors include, but are not limited to: sales of Dow's products; Dow's expenses, future revenues and profitability; any global and regional economic impacts of pandemic or other public health-related risks and events on Dow's business; any sanctions, export restrictions, supply chain disruptions or increased economic uncertainty related to the ongoing conflict between Russia and Ukraine; capital requirements and need for and availability of financing; unexpected barriers in the development of technology, including with respect to Dow's contemplated capital and operating projects; Dow's ability to realize its commitment to net neutrality on the contemplated timeframe; size of the markets for Dow's products and services and ability to compete in such markets; failure to develop and market new products and optimally manage product life cycles; the rate and degree of market acceptance of Dow's products; significant litigation and environmental matters and related contingencies and unexpected expenses; the success of competing technologies that are or may become available; the ability to protect Dow's intellectual property in the United States and abroad; developments related to contemplated restructuring activities and proposed divestitures or acquisitions such as workforce reduction, manufacturing facility and\/or asset closure and related exit and disposal activities, and the benefits and costs associated with each of the foregoing; fluctuations in energy and raw material prices; management of process safety and product stewardship; changes in relationships with Dow's significant customers and suppliers; changes in consumer preferences and demand; changes in laws and regulations, political conditions or industry development; global economic and capital markets conditions, such as inflation, market uncertainty, interest and currency exchange rates, and equity and commodity prices; business or supply disruptions; security threats, such as acts of sabotage, terrorism or war, including the ongoing conflict between Russia and Ukraine; weather events and natural disasters; and disruptions in Dow's information technology networks and systems; and risks related to Dow's separation from DowDuPont Inc. such as Dow's obligation to indemnify DuPont de Nemours, Inc. and\/or Corteva, Inc. for certain liabilities. Where, in any forward-looking statement, an expectation or belief as to future results or events is expressed, such expectation or belief is based on the current plans and expectations of management and expressed in good faith and believed to have a reasonable basis, but there can be no assurance that the expectation or belief will result or be achieved or accomplished. A detailed discussion of principal risks and uncertainties which may cause actual results and events to differ materially from such forward-looking statements is included in the section titled \"Risk Factors\" contained in the Company's Annual Report on Form 10-K for the year ended December 31, 2022, and the Company's subsequent Quarterly Reports on Form 10-Q. These are not the only risks and uncertainties that Dow faces. There may be other risks and uncertainties that Dow is unable to identify at this time or that Dow does not currently expect to have a material impact on its business. If any of those risks or uncertainties develops into an actual event, it could have a material adverse effect on Dow's business. Dow Inc. and The Dow Chemical Company (TDCC) assume no obligation to update or revise publicly any forward-looking statements whether because of new information, future events, or otherwise, except as required by securities and other applicable laws. For further information, please contact: Rachelle Schikorra 989-638-4090 ryschikorra@dow.com Twitter: https:\/\/twitter.com\/DowNewsroom Facebook: https:\/\/www.facebook.com\/dow\/ LinkedIn: http:\/\/www.linkedin.com\/company\/dow-chemical Instagram: http:\/\/instagram.com\/dow_official i Inclusive of Scope 1 and 2 emissions ii Carbon emissions refer to GHG emissions in CO2e iii MTA refers to metric tonnes per annum iv KTA refers to kilo tonnes per annum SOURCE The Dow Chemical Company","filter_flag":1}
{"title":"Carbon Limit Introduces Its CaptureCrete Technology to Residential Construction with NCP Industries Partnership - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NhcmJvbi1saW1pdC1pbnRyb2R1Y2VzLWl0cy1jYXB0dXJlY3JldGUtdGVjaG5vbG9neS1yZXNpZGVudGlhbC1jb25zdHJ1Y3Rpb24tbmNwLWluZHVzdHJpZXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NhcmJvbi1saW1pdC1pbnRyb2R1Y2VzLWl0cy1jYXB0dXJlY3JldGUtdGVjaG5vbG9neS1yZXNpZGVudGlhbC1jb25zdHJ1Y3Rpb24tbmNwLWluZHVzdHJpZXPSAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NhcmJvbi1saW1pdC1pbnRyb2R1Y2VzLWl0cy1jYXB0dXJlY3JldGUtdGVjaG5vbG9neS1yZXNpZGVudGlhbC1jb25zdHJ1Y3Rpb24tbmNwLWluZHVzdHJpZXPSAQA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NhcmJvbi1saW1pdC1pbnRyb2R1Y2VzLWl0cy1jYXB0dXJlY3JldGUtdGVjaG5vbG9neS1yZXNpZGVudGlhbC1jb25zdHJ1Y3Rpb24tbmNwLWluZHVzdHJpZXPSAQA?oc=5\" target=\"_blank\">Carbon Limit Introduces Its CaptureCrete Technology to Residential Construction with NCP Industries Partnership<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Carbon Limit Introduces Its CaptureCrete Technology to Residential Construction with NCP Industries Partnership - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NhcmJvbi1saW1pdC1pbnRyb2R1Y2VzLWl0cy1jYXB0dXJlY3JldGUtdGVjaG5vbG9neS1yZXNpZGVudGlhbC1jb25zdHJ1Y3Rpb24tbmNwLWluZHVzdHJpZXPSAQA?oc=5\" target=\"_blank\">Carbon Limit Introduces Its CaptureCrete Technology to Residential Construction with NCP Industries Partnership<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Concrete manufacturer NCP Industries has joined forces with Carbon Limit to bring the innovative CO2-capturing technology, CaptureCrete, to the residential construction industry. This collaboration extends the reach of CaptureCrete, a concrete additive designed to permanently capture CO2, to the broader cement and concrete manufacturing industry. The technology offers a sustainable solution for decarbonizing a range of structures, from homes to major infrastructure projects. Supported by funding from the U.S. Department of Defense and the U.S. Army Corps of Engineers, CaptureCrete empowers manufacturers by providing them with a licensable formula that allows them to produce the additive on-site and incorporate it into precast or ready-mix concrete, addressing the carbon emissions associated with concrete production. Recently unveiled at the 2023 Deck Expo in Las Vegas, NCP Industries introduced its new eCO2LUXE line, incorporating CaptureCrete. The line features products such as the ADORN Stone Premier Series, an exterior stone profile designed for aesthetics while actively capturing CO2 from the atmosphere, contributing to a reduction in its carbon footprint. CaptureCrete not only provides a sustainable solution but also generates carbon credits every time it is used in concrete. These credits are validated by Bureau Veritas under Covalent’s Certification Standard and are available for purchase on Carbon Limit’s website. Addressing the environmental impact of cement, a key ingredient in concrete production, is crucial. Cement production contributes to over 8 percent of global carbon emissions. The Global Cement and Concrete Association, representing major industry players, has pledged to reduce concrete’s carbon footprint by 25 percent by 2030 and achieve net-zero emissions by 2050. Carbon Limit's CEO, Tim Sperry, emphasized the industry's role in the sustainable construction revolution, stating, \"There is more interest than ever in finding a way to reduce CO2 emissions. Carbon Limit gives the concrete and cement industry the power to be a critical part of the sustainable construction revolution and lead the way to climate resilience.\" This article was produced with assistance from OpenAI's GPT-3.5 architecture.","filter_flag":1}
{"title":"Crocs is taking its used shoes back in 10 states. Here's why - GreenBiz","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5\" target=\"_blank\">Crocs is taking its used shoes back in 10 states. Here's why<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Crocs is taking its used shoes back in 10 states. Here's why - GreenBiz","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5\" target=\"_blank\">Crocs is taking its used shoes back in 10 states. Here's why<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","source.href":"https:\/\/www.greenbiz.com","source.title":"GreenBiz","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Crocs launched a program in October to take back used shoes in 10 U.S. states, to keep old footwear out of landfills and explore new ways to reuse the material. It’s a big opportunity. An estimated 22 billion pairs of shoes are thrown out annually while roughly the same number are produced, according to industry stats. The fashion and apparel sector contributes about 8 percent of greenhouse gas emissions each year, according to the United Nations. Crocs announced a series of sustainability goals in 2021, but quietly delayed its plan to reach net zero by a decade to 2040 after the company reported a big increase in emissions between 2021 and 2022. Deanna Bratter, vice president and global head of sustainability for the Broomfield, Colorado-based company, said circular design and production principles are core to delivering on that commitment. \"When you think about the circular economy, sometimes people just think about waste and doing something with waste,\" Bratter said. \"But when we think about the concept of creating a circular economy, it requires a variety of solutions, a lot of creativity.\" Three things will help Crocs deliver, she said: Design changes that enable products to be used for longer. Considering the need for future deconstruction and recyclability. Finding sources for renewable inputs. From ‘gently used’ to ‘unwearable’ Crocs’ new collection program will produce metrics to help it better understand the social and operational challenges it faces, Bratter said. Rather than randomly assigning takeback locations on a nationwide basis, it picked states that represent a cross-section of attitudes about climate change: Colorado, Georgia, Illinois, Michigan, Massachusetts, Minnesota, Ohio, Pennsylvania, Virginia and Wisconsin. Retail locations in those states, about 50 in total, will include collection bins to make it simpler for consumers to drop off products. Crocs will accept shoes in any condition. \"Gently used\" ones will be donated to Soles4Souls, a nonprofit that works with entrepreneurs building secondhand apparel businesses. Those that are \"well-loved\" or \"unwearable\" will head back to Crocs, where product designers will experiment with ways to reuse the materials, Bratter said. Here are some questions Crocs hopes to answer with its collection program: Who is returning shoes? What marketing messages are working? Are consumers donating because of the social or environmental impact? What types of shoes are most commonly returned and how old are they? Do gently used or well-loved shoes dominate the bins? The goal is to expand nationally, Bratter said. Crocs chose the U.S. as its first foray into product take-back because it can transport them to other locations for processing more easily. What’s inside Crocs’ clogs The predominant material in Crocs’ clogs — more than 81 percent — is Croslite, a proprietary resin designed for durability and sourced predominantly from fossil fuels. Croslite is responsible for 35-40 percent of Crocs’ emissions, its largest single source, Bratter said. Crocs has committed to sourcing 50 percent of its Croslite from bio-based options by 2030. The two most prominent alternative sources are tall oil, a byproduct from paper mills, and used cooking oil. In 2022, only 2.2 percent of Croslite came from non-fossil sources, but Crocs is on track to meet 20 percent by the end of 2023, Bratter said. Crocs is also increasing its use of recycled material. The company uses manufacturing scraps in 6.5 percent of its Croslite, according to the company’s 2022 ESG report. It’s possible that unwearable shoes collected by Crocs could be ground down and used in future products, increasing that amount, Bratter said, but it hasn’t publicly set goals for how many of them will be converted. Baby steps rather than a big leap The entire footwear sector is under pressure to cut waste and reduce emissions, according to Paul Foulkes-Arellano, founder of Circuthon Consulting and co-author of a book about materials and sustainability. While he praised Crocs’ decision to partner with \"well-respected\" Soles4Souls, he characterized the footwear company’s overall circular economy strategy as nascent and said it’s “notoriously difficult” to make takeback programs work at scale. One advantage Crocs will have as it transitions is the makeup of Croslite. \"It’s principally a monomaterial, so once the few extra components are removed, it can be reground as material for new shoes,\" he said. Recycling a material that includes both fossil fuels- and plant-based resins is more difficult, he said. Other shoemakers are striving for higher percentages of reused material on a shorter timeline, Foulkes-Arellano said. \"The footwear industry is way behind the textiles industry in its understanding of environmental impacts.\"","filter_flag":1}
{"title":"How Holcim is reducing cement's climate impact - Fortune","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZm9ydHVuZS5jb20vZXVyb3BlLzIwMjMvMTEvMDgvY2xpbWF0ZS1jaGFuZ2UtY29uY3JldGUtY2VtZW50LWhvbGNpbS1mb3J0dW5lLTUwMC1ldXJvcGUv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZm9ydHVuZS5jb20vZXVyb3BlLzIwMjMvMTEvMDgvY2xpbWF0ZS1jaGFuZ2UtY29uY3JldGUtY2VtZW50LWhvbGNpbS1mb3J0dW5lLTUwMC1ldXJvcGUv0gEA?oc=5","id":"CBMiX2h0dHBzOi8vZm9ydHVuZS5jb20vZXVyb3BlLzIwMjMvMTEvMDgvY2xpbWF0ZS1jaGFuZ2UtY29uY3JldGUtY2VtZW50LWhvbGNpbS1mb3J0dW5lLTUwMC1ldXJvcGUv0gEA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZm9ydHVuZS5jb20vZXVyb3BlLzIwMjMvMTEvMDgvY2xpbWF0ZS1jaGFuZ2UtY29uY3JldGUtY2VtZW50LWhvbGNpbS1mb3J0dW5lLTUwMC1ldXJvcGUv0gEA?oc=5\" target=\"_blank\">How Holcim is reducing cement's climate impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fortune<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Holcim is reducing cement's climate impact - Fortune","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vZm9ydHVuZS5jb20vZXVyb3BlLzIwMjMvMTEvMDgvY2xpbWF0ZS1jaGFuZ2UtY29uY3JldGUtY2VtZW50LWhvbGNpbS1mb3J0dW5lLTUwMC1ldXJvcGUv0gEA?oc=5\" target=\"_blank\">How Holcim is reducing cement's climate impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fortune<\/font>","source.href":"https:\/\/fortune.com","source.title":"Fortune","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In its peacefulness and civility, it may have been the most Swiss protest ever. At a classical music concert in the picturesque city of Lucerne in September, two climate activists glued themselves to the stage. The orchestra’s performance wheezed to a halt, much to the audience’s chagrin. After a brief negotiation, conductor Vladimir Jurowski announced a truce: The young protestors would be allowed to make their case, everyone in the audience would listen, and the concert would continue. What the protesters demanded wasn’t an end to oil exploration, or that everyone stop flying or driving, or that the old guard step down for having let the planet burn. Instead, they called for something else entirely: that all Swiss homes be renovated by 2030 so they could stay cool in summer, and warm in winter—but while using much less energy. The Lucerne saga was over after four minutes. But the Renovate Switzerland movement has engineered dozens of similar protests in the country since 2022, some of them much more disruptive—including a blocking of the main Geneva lake bridge by protestors similarly glued to the surface, and protestors “slow-walking” traffic by marching down the middle of busy city streets. What the actions have in common is an urgent plea for a less carbon-dioxide-heavy “built environment.” It’s a demand that makes sense. For all the attention given to cars, trucks, and airplanes, it turns out that houses and buildings actually make up the world’s single largest source of CO2 emissions, at a staggering 39%. The production of cement alone—omnipresent in our buildings, bridges, and sidewalks—is responsible for almost a quarter of those emissions. That’s due to the chemical processes and intense heat required to manufacture it, most of which typically involve fossil fuels. Ultimately, any call for a greener built environment is a call for greener cement and concrete, produced less resource-intensively and designed to fit in energy-efficient buildings. A serious effort to use more eco-friendly cement would create construction jobs, slash residents’ energy bills, and get just about every country and institution much closer to its zero-emissions goals. It sounds like a win-win, really. So why isn’t green cement the global norm in construction? A few miles northeast of Lucerne, one Fortune 500 Europe company is trying to make it so. Holcim, based in Zug, is the world’s largest cement company outside of China, with a production capacity of 260 million metric tons per year. It has been a global giant for decades—it brought in more than $30 billion in revenue in its last fiscal year—and that means that it has been responsible for a large share of its industry’s historical carbon footprint. But Holcim is now trying to be part of the solution, developing low-emissions cement and concrete while creating materials for energy-neutral buildings. If Holcim’s eco strategy succeeds, it could secure the company’s continued dominance in its industry and make it a lighthouse for other European and global companies to follow. Over the last decade, it has shown remarkable progress. The question is whether it can keep progressing quickly enough to meaningfully protect the planet—and to exorcise the demons of its own past. A new challenge for ‘the waste guy’ Clemens Woegerbauer, a director of Holcim’s Swiss subsidiary, first started thinking about low-carbon cement some 10 years ago, when a request from Zurich-based construction company Eberhardt landed on his desk. The question was as simple as it was intractable: Could Holcim help Eberhardt get rid of its construction demolition waste, and perhaps recycle it into new cement and concrete? Getting rid of construction and demolition debris was familiar work for Woegerbauer; in fact, he was known internally at Holcim as “the waste guy.” But the idea of reusing the waste was a new one—and it arrived, in a sense, at just the right time and just the right place. Clemens Woegerbauer, Holcim’s self-described ‘waste guy.’ Courtesy of Holcim A similar approach had been used by Europeans since at least Roman times, with bricks and stones from older buildings reused to construct new ones. (My own family in Belgium used to own property on which the remains of an eighth-century church were found, built with recycled stones from an ancient Roman villa. The “recycled” church stood for almost a thousand years.) But by the end of the 20th century, building codes all but prohibited the reuse or recycling of demolition waste all over Europe and the world—including in the United States, Holcim’s largest market and the source of over $10 billion of its yearly revenues. There was good reason to be cautious: Some low-quality construction materials used between the 1950s and 1990s, for example, turned out to have a life span of just 30 years, leading to a ban on their use. But even the recycling of stronger concrete, several researchers believed until recently, yielded material that lacked the strength of its “virgin” equivalent, making it a hazardous tool. By the time Woegerbauer started grappling with the issue, however, the mindset around recycled materials was starting to change—in landlocked Switzerland in particular. The Alpine country’s population largely lives on a sliver of land dubbed the “middle country,” sandwiched between the Alps and the Jura mountains. Switzerland’s cities, lakes, agriculture, and industry all have to share this plateau; the last thing anyone needed was for this precious land to be used for construction waste sites. As a result, by the 2000s, the practice of recycling of construction and demolition debris was well established in Switzerland, and Swiss regulators were amenable to expanding that practice. Woegerbauer and his team had their own reasons to fulfill Eberhardt’s wishes. First, recycled cement could be a new source of income. Eberhardt had to pay to get rid of its waste anyway, so it would gladly pay Holcim to do the same. If Holcim could incorporate the waste into new products, it would win twice: once when it received Eberhardt’s waste, and again when it sold its recycled cement products. Just as important was how recycled cement would fit into Holcim’s future business model. If Woegerbauer’s Swiss team could square the circle of construction demolition material recycling, the company might go from villain to hero on CO2 emissions. ‘Decarbonizing building’ vs. selling cement Holcim was undergoing changes at the top too. In 2017, the company appointed Jan Jenisch, the head of Swiss chemical company Sika, as its new CEO. As an outsider, Jenisch realized that Holcim needed to adapt to remain relevant in the 21st century. Ever since its founding in the petite Swiss town of Holderbank in 1912—Holcim is short for Holderbank Ciment—the company had been expanding through mergers and volume plays. Cement is a commodity, and for a long time the company’s philosophy was that bigger was better and biggest was best. But after Holcim merged with its longtime rival, France’s Lafarge, in 2015, there were essentially no meaningful acquisition targets left. Just as important, governments and public opinion were growing increasingly vocal in their dissatisfaction with the huge amounts of CO2 the cement industry emitted each year. For Holcim’s dominance to remain the same, everything had to change. “When I joined, I found strong, locally embedded businesses, 2,300 production sites, right-in-time supply, the largest building-material company in the world,” Jenisch told me. But what got Holcim to 2017 wouldn’t get it to 2027 or beyond, he also realized. “You have to think about how markets will develop in the future,” he said. Those developments still included growth and new construction, he firmly believed, given the world’s growing population and urbanization. But it would have to be built on different foundations than before: those of innovation and sustainability, rather than commodities and volume. Any other approach would not have societal buy-in. Jenisch brought on board a few newcomers to realize his mission, including Magali Anderson, a French engineer who had spent most of her career working on safety in the oil industry. Anderson joined as head of safety, but soon took on a more significant role: that of Holcim’s first-ever chief sustainability officer. The new team soon embarked on a new strategy, culminating in the company’s signing of a “net zero” pledge in September 2020, aiming for the horizon of 2050. Instead of selling cement, Holcim reinterpreted its role in the industry as “decarbonizing building.” To an outsider, such a statement may have reeked of greenwashing—akin to a cigarette company stating it wants people to stop smoking. But each component of the new strategy came with a cold business rationale. Decarbonizing was going to either reduce costs or create extra revenues. On a visit to one of Holcim’s cement plants, in the Swiss town of Eclépens, I saw several of the company’s decarbonizing mechanisms at work. Holcim had reduced much of its fossil fuel use there, and had created an additional revenue stream by using waste fuel instead—burning material that Holcim had been paid to dispose of. A live video feed of the kiln showed how shredded old tires and biomass were fed into the fire. The plant also rethought the composition of its concrete: Instead of using “clinker,” which is made by breaking down limestone in a highly CO2-intensive process, the company is using calcine clay and other, lower-emissions materials wherever possible. In its construction projects, too, Holcim aimed to build better with less. Adopting practices from Roman times, it experimented with using gravitational forces or metal clamps, rather than mortar, to hold archlike structures together. In its floorings, it would use concrete only where it had structural effects, replacing it with lighter, less CO2-heavy product mixes where possible. To make up for the loss in volume of cement or concrete sold, it would come up with new applications for its products. Finally, Holcim would take a more holistic approach to its role in the building sector. What if its concrete wall and floors could be components of buildings that could be heated and cooled in a carbon-neutral fashion? What if its concrete could fit into green urban architecture, rather than be a nemesis of it? A Waldorf School in Germany, built with Elevate RubberGard EPDM, a climate-friendly roofing material made by Holcim. Courtesy of Holcim In its revamped global innovation hub in Lyon, France, a team of engineers came up with all kinds of innovations. On a visit late this summer, I saw what those efforts had led to, over a few short years: a superlight isolation layer for roofs, for example, that felt to the touch more like chocolate mousse than concrete and is better suited for hot climates. Or concrete walls with plant seeds mixed in, which could then turn the walls into Babylon-esque hanging gardens over time as rain poured through them. Many of those innovations are still analogous to what concept cars are for car manufacturers: a proof of the company’s imagination and engineering prowess, but not products that have real-world impact today. Still, more of the products are crossing the barrier between theory and practice. A recently finished school in Vienna is a fitting exhibit: Finished earlier this year, the school, entirely built with state-of-the-art Holcim products, is capable of covering 90% of its energy needs through internal geothermal processes, the company claims. In France and Kenya, meanwhile, Holcim has been experimenting with 3D printing of homes and bridges as a sustainable solution. 3D printing lets contractors and architects use concrete only where it is strictly needed; that means the structures built with it retain the same strength while using up to 50% less material, Holcim says. A pandemic turning point In 2020, the COVID pandemic stopped economic life throughout much of the global economy. Much of Holcim’s global leadership team wound up being stuck in Switzerland for the better part of a year. For Clemens Woegerbauer and his local team, that proved to be a lucky break. After years of investments in product R&D, and as much time spent wooing regulatory commissions, their Susteno cement—of which 20% came from recycled demolition waste—had been making inroads on the Swiss market for two years. The lockdown gave Woegerbauer a chance to show off the product to a captive audience: his global HQ colleagues, who would otherwise have been traveling all over the world taking meetings at other Holcim subsidiaries. Susteno was a runaway success. “I was very surprised, but it was good to see how open the group was [to our product],” Woegerbauer said. “It was the right place and the right time. Everything converged.” Soon after, Jenisch and his executive team floored the accelerator on their global decarbonization strategy. In July 2020, Holcim launched Ecopact, a type of concrete with a reduced CO2 footprint of at least 30%, in the U.S., its largest market. In 2021 and 2022, further additions to the “eco” range of products followed, including Ecoplanet, Holcim’s green cement, and Ecocycle, a range of recycled products directly inspired by the Susteno recycling brand. The years since have vindicated Holcim’s strategy—and the Swiss innovations that catalyzed it. Today, Ecopact and Ecoplanet are blockbusters, with each posting more than a billion dollars in global sales. The “eco” range of products helped Holcim to record revenues and profits in 2022, and by the fall of 2023, almost a fifth of Holcim’s global sales came from the eco brands. In the U.S., Amazon became a marquee Ecopact client, using the concrete for its new data warehouses in northern Virginia and giving the brand additional credibility in Holcim’s biggest market. The concrete mix used in the project there, the companies said, would reduce the CO2 footprint of the concrete by 39%. The new CAP Group Headquarters building in Milan uses Holcim’s Ecopact concrete. Courtesy of Holcim Holcim also proved it could decouple revenue growth from greenhouse gas emissions. Its CO2 emissions per ton of cement produced dropped by 29% since the 1990s, the company calculated. The company has also diversified its product mix. Since 2020, CO2 emissions per dollar of net sales at the company have dropped by 43%—the result of a combination of higher prices, a further lowering of the CO2 intensity of its cement and concrete, and greater sales of other, less CO2-heavy building products. Holcim’s overall climate goal to be carbon-neutral by 2050 is now backed by what wonks call “science-based targets.” Practically, it means that if every company acted like Holcim, global warming would be limited to 1.5 degree Celsius between now and 2050, rather than the more than 2.5-degree pathway it is on now. Legal and regulatory battles loom Holcim’s recent transformation is a remarkable turnaround story. A company that just a few years ago was seen as a major villain by climate activists is now hell-bent on proving it can be a green ally. But to continue its sustainability winning streak, Holcim will have to outrun its more distant past. In Switzerland, Holcim faces a potentially precedent-setting lawsuit from a group of Pacific Islanders. The plaintiffs hail from the Indonesian island of Pari, one of many Pacific islands drastically affected by global-warming-induced sea level rise. In a court in Zug, they are seeking damages from Holcim for the company’s role in emitting the greenhouse gas emissions they believe are responsible for their deteriorated living conditions. According to a report by the Climate Accountability Institute, commissioned by an NGO that supports the plaintiffs, Holcim and its predecessors are responsible for 0.4% of all global postwar CO2 emissions—more than 7 billion tons of the greenhouse gas. If the judge finds Holcim liable, it could open the floodgates to similar cases from affected populations elsewhere, imperiling the company’s future. Regulation also stands in its way of further growth. In the U.S., for example, building codes don’t allow for the kind of recycling that Holcim is allowed to do in Switzerland. Any U.S. client that wants to use recycled cement in its concrete construction can do so only with a workaround, the company told me. In the case of the Amazon warehouses, for example, the low-carbon cement had to be transported from Spain and then used to make concrete in the U.S. in order to comply with local rules. Holcim will need to convince more regulators that recycled cement is viable, or the company will face a big roadblock in its sustainability journey. Jenisch’s focus is clearly talks with regulators rather than Holcim’s dealings in court. “I don’t think anyone can accept historical responsibility,” he said of the lawsuit by the islanders. “It’s more important what action we take now. This is what I want to be part of.” But it’s all hands on the regulatory deck for Jenisch. This summer, Magali Anderson announced her departure as Holcim’s chief sustainability officer. Like her predecessor, Nollaig Forrest, the new CSO, has no training in engineering or safety. But she’s steeped in government affairs and communications, skills she honed at other industrial groups such as Dow, DuPont, and American fragrance maker Firmenich. Forrest’s main job now, she told me, is to get regulators to embrace Holcim’s vision of sustainability in construction, especially in the U.S. and the European Union, where Holcim gets the lion’s share of its sales. One tactic Holcim is considering, she said, is to convince regulators in a large, influential state such as California of the effectiveness of Holcim’s approach, with the aim of creating a snowball effect across the country. It has been a tried and tested method in regulation of other green technologies, including electric vehicles. One stakeholder Forrest and her colleagues will still have to win over is Renovate Switzerland. It’s not that the organization doesn’t appreciate the efforts Holcim has undertaken so far. “From what we know, there is a lot of nice work, but [some of it] may be a false promise too,” Marie Seidel, a spokesperson for the organization, told me over the phone. Overall, the organization remains unconvinced that a company whose business model depends on cement and concrete can ever be a champion of a carbon-neutral world. “What our society needs right now is a complete U-turn in the way we consider the climate crisis,” Seidel said. “If Holcim would take this issue seriously, they would stop building buildings that emit CO2 at all, not 30% less.” For Renovate Switzerland, in other words, 2050 should start tomorrow. Correction: An earlier version of this story misspelled the name of the town where Holcim was founded; it is Holderbank, not Holderberg. A version of this article appears in the December 2023\/January 2024 issue of Fortune with the headline, “Concrete results.”","filter_flag":1}
{"title":"The Dirty Secret of Alternative Plastics - Pulitzer Center on Crisis Reporting","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcHVsaXR6ZXJjZW50ZXIub3JnL3N0b3JpZXMvZGlydHktc2VjcmV0LWFsdGVybmF0aXZlLXBsYXN0aWNz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcHVsaXR6ZXJjZW50ZXIub3JnL3N0b3JpZXMvZGlydHktc2VjcmV0LWFsdGVybmF0aXZlLXBsYXN0aWNz0gEA?oc=5","id":"CBMiRGh0dHBzOi8vcHVsaXR6ZXJjZW50ZXIub3JnL3N0b3JpZXMvZGlydHktc2VjcmV0LWFsdGVybmF0aXZlLXBsYXN0aWNz0gEA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcHVsaXR6ZXJjZW50ZXIub3JnL3N0b3JpZXMvZGlydHktc2VjcmV0LWFsdGVybmF0aXZlLXBsYXN0aWNz0gEA?oc=5\" target=\"_blank\">The Dirty Secret of Alternative Plastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pulitzer Center on Crisis Reporting<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Dirty Secret of Alternative Plastics - Pulitzer Center on Crisis Reporting","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vcHVsaXR6ZXJjZW50ZXIub3JnL3N0b3JpZXMvZGlydHktc2VjcmV0LWFsdGVybmF0aXZlLXBsYXN0aWNz0gEA?oc=5\" target=\"_blank\">The Dirty Secret of Alternative Plastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pulitzer Center on Crisis Reporting<\/font>","source.href":"https:\/\/pulitzercenter.org","source.title":"Pulitzer Center on Crisis Reporting","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In the three decades since it was first introduced, the plastic, coin-sized sticker you see on fruit and vegetables has become a staple of modern agriculture, imparting essential information about the grower, brand, country of origin, and even price of fresh produce as it crisscrosses the globe. The Product Look Up (PLU) label is designed to be briefly scanned then discarded, destined for landfill. There, it might last for hundreds of years, joining an endless accumulation of plastic packaging also intended to be removed after purchase and immediately jettisoned. Like most single-use packaging, the stickers are not easily recycled. Those that don’t end up in landfill collect in the environment, and then often end up clogging up our rivers and oceans. According to the United Nations Environment Program, nearly a garbage truck and a half’s worth of plastic ends up in rivers, lakes, and oceans every minute. Eventually those plastics break down into micro and nano plastic particles that poison our air, the water we drink, and our bloodstream. Approximately 40% of all plastic produced is designed for single-use purposes, and little of it is easily recycled. Like the PLU sticker, it is used just once and then thrown away. Yet the long-term consequences are enormous: The production of plastic, 98% of which is sourced from fossil fuels, is the cause of some 10% of all global greenhouse-gas emissions. As a nonprofit journalism organization, we depend on your support to fund more than 170 reporting projects every year on critical global and local issues. Donate any amount today to become a Pulitzer Center Champion and receive exclusive benefits! One proposed solution is to replace these plastics with alternatives: biodegradable utensils, compostable wrappers, plant-based bottles, and compressed-fiber plates and bowls. Theoretically, these products could seamlessly slot into existing supply chains, requiring no sacrifice on the part of consumers, who are clamoring for more sustainable options. But production is limited in scale, more expensive than conventional plastic, and it’s not yet clear that the alternatives are actually better for human and planetary health: Most plant-based plastics are, on a molecular level, identical to their fossil-fuel-sourced siblings and last just as long in the environment. Other substitutes require many of the same toxic chemical additives as conventional plastics to keep them waterproof, flexible, durable, and colorfast. Perhaps the biggest problem is that the infrastructure to ensure these bioplastics actually biodegrade or compost is very limited. That means that despite the best intentions of manufacturers and consumers, supposedly compostable plastic bags and supposedly biodegradable single-use cutlery may be causing just as much climate damage as conventional plastics. The future of such plastics, as well as the role of bioplastics in the global economy, is under negotiation. In November, representatives from 162 nations converged in Nairobi, Kenya, for INC-3, the third of five planned sessions for the Intergovernmental Negotiation Committee to develop a global treaty to end plastic pollution, a kind of Paris Climate Accords for plastic. So far, the delegates have put forth a wide range of options, ranging from greater recycling capacity to a tax on manufacturers, which would go to global cleanup projects. Among the more ambitious proposals is for global production of virgin plastic to be slashed, largely through a reduction in single-use products. Treaty negotiations are scheduled to conclude at the end of 2024. A complete ban would not be enough to end the plastic scourge, but it’s a start. A new tool developed by the University of California Santa Barbara, UC Berkeley, and the Benioff Ocean Initiative shows that a 90% reduction of single-use plastics would remove some 286 million metric tons of ocean pollution by 2050—the equivalent in water bottles stacked end-to-end would cover the distance to the sun and back nearly six times. (Marc and Lynn Benioff, who support the Benioff Ocean Science Laboratory at UC Santa Barbara, also own TIME Magazine). The composting complication Practically speaking, there isn’t enough global supply of alternative materials to replace the amount of single-use plastic being produced today, and that may be a good thing, says Paula Luu, project director for the Center for the Circular Economy at impact investing firm Closed Loop Partners. That’s because, while plastic alternatives show a lot of promise, it won’t be realized unless their implementation is accompanied by an upgrade of current waste-collection systems, ongoing scientific research, and policy change. “Before we do a full switchover, we really need to focus on addressing a number of different challenges, including customer education, waste-recovery infrastructure, and the economic incentives to a full transition,” says Luu. “If it’s not done thoughtfully, with a whole-system view, it could result in unintended consequences.” France’s effort to reduce single-use plastics is a case in point. In 2022, the country banned all non-compostable PLU tags. A win for French environmentalists, however, soon became a sticky problem for produce importers: In a globalized market where produce comes from all corners of the world, one country’s ban on plastic PLU tags only really works when every other country opts to do the same. The technology exists—multinational fruit-labeling company Sinclair, among others, has been producing them for years—but the cost is higher given how cheap plastic is. A global ban on plastic stickers would certainly encourage competition and economic incentives, leading to lower prices for compostable versions. But without widespread access to composting facilities, most of those compostable stickers would end up in landfill anyway, where they could cause even more climate damage than conventional plastic. In a well-regulated composting facility, bacteria use oxygen to break organic materials down into carbon. In a landfill’s low-oxygen environment, that material creates methane as it decomposes, a greenhouse gas 25 times more potent than carbon when it comes to trapping heat in the atmosphere. The terms “biodegradable” and “compostable” are often misinterpreted to mean that the products will melt away in the natural environment, which is rarely the case. To meet a baseline standard of compostability, 90% of a PLU sticker, or a fork, for that matter, must break down into carbon matter within six to 24 months under carefully regulated heat and moisture conditions. But if you just tossed a supposedly biodegradable fork into your backyard, it could last almost as long as your typical plastic cutlery. In one 2019 study, researchers left compostable plastic bags buried in soil or submerged in seawater for three years as a trial. At the end, some of the bags were intact enough to carry a full load of groceries. Which means that without a dramatically ramped-up global system of collecting and processing biodegradable packaging, compostable is little better than plastic for the environment. In the U.S., only 27% of the population has access to food waste composting programs, and only 142 out of the 201 industrial composting facilities nationwide that process food waste will accept compostable packaging as well, according to a new survey conducted by the composting website BioCycle and the Composting Consortium, a business group that promotes effective composting. That means that the country is producing far more compostable cups, plates, and take-out containers than it can actually process, says BioCycle’s editor and publisher, Nora Goldstein. Facilities that are reluctant to take compostable packaging argue that they can’t always tell the difference between conventional plastics and compostable, and they don’t want to risk contamination. A compostable sachet of pre-washed salad greens looks just like a polyethylene produce bag, says Goldstein. “If I can’t tell the difference, and I am a composting professional, your average consumer is just as likely to throw a plastic bag in the compost as a compostable bag in the recycling.” Both are bad: When plastic ends up in compost, the facility can’t sell it, which threatens the financial viability of the project. And when compostable packaging ends up in a recycling facility, it can gum up the machinery or, depending on how it is made, taint the next batch of recycled plastic. Plant-based doesn't necessarily mean plant-friendly Add plant-based plastics into the mix, and you have even more problems. Polyethylene terephthalate, the PET plastic used for most soda bottles (and also in many other single-use packaging products), is usually extracted from fossil fuels, but, in a process similar to turning corn into ethanol, it can also be manufactured from plants. The plant- and fossil-fuel-based versions are chemically indistinguishable—the only way to tell the difference is through radiocarbon dating (carbon molecules extracted from fossil fuels are older than ones that come from plants)—and like conventional PET, plant-based PET can be recycled. But when consumers see a label saying a plastic is plant-based, “One in two Americans will say, ‘Oh, this belongs in a composting bin’,” says Luu of Closed Loop Partners, which recently conducted a survey of American attitudes to plastic alternatives. In other words, consumers might think they are doing the right thing, even if half of them are putting their plant-based PET products in the wrong place. Luu believes better labeling is the answer: “Just like we universally understand the stop sign, we should immediately understand that this package is compostable because it’s tinted green or is prominently labeled. If we don’t get labeling and design right, we could be creating problems for both the recycling and the composting industries.” Another option, says Daphna Nissenbaum, CEO and co-founder of TIPA Corp, a multinational company producing a wide range of compostable plastic films and food packaging, is to go the fully compostable PLU route, and mandate, through global standards, that all flexible plastic packaging—sandwich wrappers, zipper bags, cling film, and shopping bags, for example—goes to the compost bin. TIPA’s technology, which is licensed to manufacturers around the world, can create compostable packaging for everything from dry cleaning to granola bars. The goal is for no one to ever worry about special labels, she says. “It will be intuitive. If it’s flexible, it will go in the compost with the banana peels.” On the other hand, if it’s rigid, like a soda bottle or a yogurt pot, it should go to recycling. The only problem is that while TIPA’s films are compostable, they, like many other compostable products, are still made partially from fossil fuels. The technology exists to make a fully compostable, fully plant-based plastic product, but it is far more expensive than conventional plastics, and does not always work as well, especially if it is used to package food items that are acidic, or liquid, or require long-term storage. Blending plant-based and fossil-fuel sourced plastics to create a compostable product lowers the cost and improves performance. The truth: 'Carbon is carbon' That is the dirty secret of so-called bioplastics, says Ramani Narayan, a chemical engineering professor at Michigan State University and an expert on alternative plastics. “Carbon is carbon, it doesn’t matter where it comes from when it comes to biodegradability.” What matters is how the long polymer chains that make the plastic, no matter the source of carbon, are configured: Insert oxygen molecules in the right place with the help of a chemical additive, and it opens the way for microbes that can accelerate decomposition. Compostability may help solve plastic pollution, but if compostable plastics are still made with fossil fuels, it does nothing to address the problem of carbon emissions. Like conventional plastics, both plant-based and biodegradable versions—no matter their source—still need chemical additives to help with durability, fire resistance, waterproofing and colorfastness. Compressed fiber and paper plates, bowls, and cups are often lined with a plastic film to keep them from leaking. Those additives can be toxic for human health and dangerous for the environment, yet few have been studied. Graphic by Aryn Baker and Lon Tweeten\/TIME. Pennie Lindeque, head of science for marine ecology and biodiversity at the U.K.’s Plymouth Marine Laboratory, is currently trying to do just that, investigating how the breakdown process of biodegradable plastics impacts the ocean ecosystem. Marine creatures still mistake fragments for prey, and chemicals released in the process of breaking down might have unforeseen consequences for other kinds of ocean life, including coral. “Biodegradable materials could help reduce the impacts of plastic waste in the ocean. However, we must be sure that such materials, and the chemicals they contain, do in fact demonstrate little or no impact on organisms and ecosystems,” she says. We don’t want to, as she puts it, “jump from the frying pan into the fire.” One of the most promising plastic replacements is polyhydroxyalkanoate, or PHA, which is made by fermenting plant sugars that come from beets, corn, and other vegetable waste, or even biogas from landfill, in a process similar to brewing beer. As with other naturally-occurring polymers like silk or cellulose, PHA products degrade into nontoxic components within months. They can also be shredded, melted, and reformed into new products. Different kinds of bacteria, some naturally occurring, others specifically engineered, are used instead of chemical additives to create properties such as flexibility and transparency. According to chemists that specialize in plastic alternatives, most conventional plastics could theoretically be replaced by PHA, but its biodegradable qualities are better suited for single-use and disposable items. That said, PHA is currently expensive and time-consuming to produce—current global capacity is 100,000 metric tons a year, compared to the 430 million metric tons of conventional plastic produced annually. And even Anindya Mukherjee, co-founder of GO!PHA, a global PHA-focused business coalition, admits that it could have other drawbacks that have yet to be discovered. Indeed, there is a glaring absence of scientific oversight for pretty much all the current alternative plastic options, he says. “Right now, anybody can say anything they want about how good their product is for the environment. There needs to be a scientific advisory board as part of the INC process, one that will regulate the development and the proliferation of alternatives. Otherwise, we will always have this problem.” Better science plays an important role, but it is not enough, says Christina Dixon, ocean lead for the London-based Environmental Investigation Agency. To solve plastic’s underlying problem, we have to look beyond substitutes and rethink our reliance on disposable goods. “These new materials may seem like some sort of Holy Grail—walking and talking like a plastic without plastic’s impact—but all they are doing is shifting the burden somewhere else.” Instead, Dixon argues, we need to create circular systems that rely on reusable, refillable goods that last, instead of a linear trajectory from production through consumption to disposal. “Our goods should not be designed to end up in landfill, no matter what they are made of,” she says. The alternative plastic world is a minefield, cloaked in sustainability marketing that at best is aspirational, and at worst causes as many problems as the products it is trying to replace. A ban on single-use plastics could level the playing field, allowing products that are better for the climate, for the environment, and for human health to rise to prominence. That also means questioning the very idea of disposability. That is, after all, what started all the problems in the first place. If plastic products were valuable, they probably wouldn’t end up polluting our oceans.","filter_flag":1}
{"title":"Can Food and Agriculture Companies Raise Their Game? - Bain & Company","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5\" target=\"_blank\">Can Food and Agriculture Companies Raise Their Game?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Can Food and Agriculture Companies Raise Their Game? - Bain & Company","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5\" target=\"_blank\">Can Food and Agriculture Companies Raise Their Game?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","source.href":"https:\/\/www.bain.com","source.title":"Bain & Company","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This article is part of Bain’s 2023 CEO Sustainability Guide Explore the report The global food system is an impressive human accomplishment. Over the past five decades, its vast productivity gains have greatly improved food security and substantially reduced the share of income that people need to spend for food. The food system has become so productive that it is now also helping to address other global issues, such as energy supply, through the growing use of biofuels. But, like virtually all other industries, food and agribusiness companies face mounting demands, from tackling the long-term health consequences of food products to fixing an outsized contribution to global climate and nature challenges. Today, agriculture consumes 70% of the world’s fresh water, and the food system more broadly contributes over one-third of all greenhouse gas emissions and is at the heart of the 20% of annual deaths attributed to poor diet. As a result, agriculture producers, consumer products companies, retailers, and others that make up the global food system are on the verge of coming under the same high-level scrutiny experienced by oil and gas companies. Elevating the ambition With this backdrop, food and agriculture companies have an urgent need to raise their ambitions on sustainability and health to build more future-proof and competitive businesses. There’s a lot at stake for companies that fail to take the aggressive steps required. Latecomers will face rising costs to address carbon requirements for their value chains, for example. Incumbent consumer goods companies will continue to cede growth to insurgents that are doing a better job of serving consumers’ rising demands for healthier food. Companies across the food chain will find themselves losing out amid the scarce supply of limited raw materials that meet environmental standards. They’re already lagging in the war for top talent. A telling fact: No agribusiness or food producer was named in the Fortune 100 Best Companies to Work For list in 2023. Acting now allows companies to turn risks into opportunities—new products, categories, and markets, or increased share of growth. By our analysis, food companies that seize the initiative can benefit from a potential 15% five-year revenue uplift compared with a 43% revenue decline for companies that fall behind based on a scenario of increasingly aggressive regulation. By changing product and ingredient portfolios, as well as where and how foods are produced, large food and agriculture companies can shift the food system toward healthier and more nutritious food—and healthier populations—while tipping the environmental impact from negative to a net positive. An integrated food systems ambition, once defined, will have strategic implications for agriculture and food businesses in three particularly critical areas: product portfolio, agricultural sustainability, and ways of working. Here are examples of winning approaches in each of those areas. Reinventing the portfolio Product portfolio reinvention will be a critical element of food system transformation for upstream and downstream companies alike. As an example of the scale of the issues at hand, one study determined that among 50,000 food products in the US, 73% is made up of ultraprocessed foods.1 Such foods are linked to a wide range of health issues, and reduced consumption is recommended in national dietary guidelines in places as diverse as Canada and Brazil. The need to transform portfolios is not limited to downstream players. For example, agricultural input portfolios may need to add seeds that support more diverse crops, or equipment and inputs to support more sustainable farming practices—in addition to supporting reduced fertilizer and chemical volumes through more precise application. Facing mounting pressure to offer healthier and more sustainable goods, companies can reevaluate their portfolio strategy to determine the product mix that will best help them meet those new demands without dismantling a core that has delivered decades of profitable growth. That means identifying and exiting the unfixable parts of the portfolio and spending more time and energy on the brands and products that have the fundamentals that will allow them to satisfy consumers' needs for delicious, healthy, and sustainable foods. When it comes to shifting food product portfolios toward better health, a common refrain from food company executives is that the indulgent segments of consumer goods categories are growing faster than the “better for you” segments. Indeed, in the US, consumption of ultraprocessed foods increased from 53.5% in 2001 to 57% in 2018, and the consumption of whole foods declined over the same period. However, many leaders are not accepting that such a shift is an either\/or decision, and the winners of the future will likely have more balanced portfolios than most food companies today. They will offer products that reduce trade-offs for consumers, introducing ones that can be delicious, healthy, and affordable. PepsiCo took a step in this direction when it started gradually lowering the amounts of sodium, saturated fat, and sugar in its snacks and beverages, with plans to bring them even lower—and to do it without consumers noticing. The company already has reached its 2025 target of producing 75% of its food portfolio volume with 1.1 grams or less of saturated fat per 100 calories. It also is advancing on its targets for reducing sodium and added sugars. This shift toward healthier portfolios will get a big push from sugar and salt taxes introduced, as well as from newly required health labeling on packages. Consider that around 85 jurisdictions around the world have implemented a form of sugar tax. Also at play: a flood of venture financing—roughly $13 billion—was invested into sustainable food systems technology and innovation globally in 2021. (By comparison, the total R&D budget for the top 10 global food companies was roughly $4 billion.) This magnitude of venture funding to solve the problems of health and sustainability shows these issues are already a major focus among private investors. Now, the question is whether food companies will get ahead of this imperative or be disrupted by it. In addition to aggressively reducing salt and sugar content in its products, Nestlé has turned to M&A to transform its portfolio. In the years 2017–22 the world’s largest food company made more than 20 acquisitions and sold 10 business units. During that period, total shareholder return rose by an annual 9.5%. Nestlé also has committed substantially more funds to sustainability efforts, more than $1 billion annually, twice as much as the next competitor. Accelerating agricultural transformation Almost all food and agriculture companies are way behind in their Scope 3 emissions reduction. Agricultural production contributes two-thirds of those emissions, which could be substantially reduced through more sustainable farming practices, such as regenerative agriculture for crops (see Figure 1). But adoption of these practices is low, and until companies can solve the scaling problem, they will fail to achieve their Scope 3 commitments. Most important, they will fail to realize the opportunity that exists for agriculture to reduce its own climate impact and be a positive contributor on the path to net zero and in other areas such as water and biodiversity. Figure 1 Addressing Scope 3 emissions through regenerative agriculture is a powerful opportunity to deliver on GHG commitments Reducing the food supply carbon footprint requires engagement across the food value chain—everyone from input and equipment providers, to farmers, to commodity traders and processors, to ingredient and food companies—and with a broader ecosystem of stakeholders such as governments, financial services providers, investors, and grower organizations. As far back as the 1980s, soil health was a growing concern for many stakeholders in the Canadian food system who wanted to generate acceptance for conservation tillage, a regenerative agriculture practice. After local farm associations spread awareness and provided technical expertise, equipment companies marketed new equipment, prototyped by entrepreneurial local farmers, that made conservation tillage compatible with mechanical seeding. Meanwhile, the federal government offered grants to reduce upfront costs of new equipment. As a result of coordinated ecosystem action, adoption of conservation tillage practices in Canada are now at almost 80%, substantially further ahead than other developed markets. Success calls for a paradigm shift for upstream and downstream companies: putting growers at the center, surrounded by the right conditions for making changes. We refer to these as the 4As of adoption. Awareness: Farmers must know about climate-smart and nature-positive practices and technologies—and have access to the technical expertise and support needed to implement them. Advantage: Farmers must have confidence that adopting new practices and technologies will deliver an attractive rate of return, both now and into the future. Access: The right inputs, tools, equipment, and methods must be available to farmers, when and where needed. Affordability: Upfront costs for farmers must be reasonable, with affordable financing available to support initial investments. Collaboration between players across the ecosystem is essential to establishing these 4A conditions for farmers, particularly for creating the economic case for change to growers (Advantage and Affordability), which our analysis shows is the biggest barrier to change. This requires involvement of players inside the value chain as well as those outside it, such as financial services providers. The Soil and Water Outcomes Fund is one such innovative, precompetitive partnership model, which brings together actors across the value chain (including Nutrien, Cargill, PepsiCo, Target, and ReHarvest Partners, a financial services provider) and the Iowa Soybean Association. SWOF aids farmers’ transition to regenerative agriculture through payments for carbon and water outcomes. While partnership models like SWOF are encouraging, still more investment is needed. Most regenerative practices are not widely adopted, and many have yet to be adopted on even 10% of the roughly 230 million acres of soy, corn, and wheat planted annually in the US. Changing the organization Just as important as what needs to be done is how companies mobilize their enterprises to progress on these priorities. For example, it requires cross-functional collaboration in newly established forums to factor the impact on sustainability or health in funding decisions. The food systems imperative will give rise to a new set of heroes. In food retailers, it will be the merchandisers. In consumer goods companies, it will be supply chain and procurement teams. They will be the ones driving Scope 3 decarbonization. But they won’t be able to do it alone. They will need to partner with brands and R&D functions to collaborate on how to address sustainability challenges in ways that deliver delicious and affordable products for consumers. As with any successful change to ways of working, this one starts with management alignment and commitment. As an example, General Mills’ Global Impact Governance Committee, which includes the company’s CEO, CFO, and group president, North America Retail, among others, has adopted and signed a formal charter that articulates its ownership over this enterprise mission. It is not a steering committee sitting in judgment of others’ efforts. Instead, it has taken on the responsibility of seeing General Mills’ mission through. In a global food system facing huge changes, winning companies will be those with unwavering support from the top—and with leaders willing to make the tough trade-off decisions that inevitably will be required. Getting started Companies can begin this journey into the future by asking and answering a series of fundamental questions. How are we contributing—both positively and negatively—to the health and environmental footprint of the food system? How might environmental, health, consumer, technology, and regulatory dynamics\/developments affect the food industry over the next 10 years? What will the agri-food company of the future—and our company—need to look like in 10 years? How do we scale our regenerative agriculture and portfolio reinvention priorities? How can we better mobilize our entire organization?","filter_flag":1}
{"title":"Navien enters HVAC market with new product launch - Supply House Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA","guidislink":false,"published":"Fri, 10 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=314, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5\" target=\"_blank\">Navien enters HVAC market with new product launch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply House Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Navien enters HVAC market with new product launch - Supply House Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5\" target=\"_blank\">Navien enters HVAC market with new product launch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply House Times<\/font>","source.href":"https:\/\/www.supplyht.com","source.title":"Supply House Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"✕ In late September Navien held a virtual product launch event to announce three new products, one of which is the company’s first-ever HVAC product — the NPF Hydro-furnace. To hear more about the product launch and Naviens plans for the HVAC market, Supply House Times chatted with Product Management Director David Hoskyn after the event. Available in Upflow and Horizontal configurations, the NPF comes in two sizes of 60,000 BTU\/h and 100,000 BTU\/h that both boast 97.0% AFUE and meet the stringent requirements of SCAQMD rule 1111 for Ultra-Low NOx performance. SHT: Tell us about the decision to branch into the HVAC market. Why is now the right time? DH: We have heard that question many times during the development and launch of the Hydro-furnace, but I want to point out that indirectly we have been in HVAC for a while. We have seen our boilers or water heaters feeding air handling units with hydronics coils for many years. The NPF now combines those to give us a true HVAC product in the market. We also understand that the entire industry is evolving and changing, but we feel there is still a place for this product. SHT: What is the Hydro-Furnace, and how does it work exactly? DH: The Hydro-furnace combines the proven technology of our stainless-steel condensing heat exchanger with a hydronic heat exchanger coil that is placed in the conditioned air stream. In heating mode, water is heated in the combustion heat exchanger and pumped up through the hydronic coil. The hot water flowing through the coil then heats the air stream. One major advantage of this process is our ability to vary the combustion capacity of the unit from 15-100%, which combined with the ECM variable speed blower provides a very consistent room temperature throughout the varying demands of the heating season. This design also allows us to operate the unit at a much lower plenum temperature, and control the unit based on either the supply air temperature or return air temperature. Available in Upflow and Horizontal configurations, the NPF comes in two sizes of 60,000 BTU\/h and 100,000 BTU\/h that both boast 97.0% AFUE and meet the stringent requirements of SCAQMD rule 1111 for Ultra-Low NOx performance. SHT: How much research and development went into this product? Have you considered the specific needs and preferences of HVAC contractors in your product design? DH: As with all our products, there was extensive R&D done on the Hydro-furnace, along with field trials in existing home applications. The benefit of this product is that it adapts much of the technology from our other boilers, combining many proven off the shelf components. In terms of the needs and preferences of the HVAC contractors, we tried to address those through industry standard cabinet widths to adapt to coils, common furnace heights to help with replacement work, and fully capable airflows up to 1.0” static. In addition, the control panel on the NPF provides a clear setup wizard to assist with set up, along with full menu functionality to adjust heating, cooling, and airflow. The NPF also includes the option for either variable air control, or constant air volume. All of this is done using any single stage or two stage thermostat and does not require the addition of a special wall control. And to help support the contractor, the NPF will carry a strong warranty which will include 1 year labor coverage for all products. SHT: How will Navien address environmental concerns and energy efficiency requirements in its HVAC products? DH: The name Navien is made up from the words “Navigating Energy and Environment” and comes from our desire to make products that are environmentally responsible and lower energy usage. From our launch of the first condensing tankless water heater in North America back in 2008, to our condensing combi and boiler products, our focus is on high efficiency products to lower energy use and emissions. The NPF continues that with a 97.0% AFUE rating, and controls that operate the unit only at the capacity required to satisfy the load. Combined with Ultra-Low NOx on all the units, not just market specific ones, we help lower the GHG emissions throughout the US and Canada. SHT: What are the future plans for Navien and the HVAC market? Are there more new products on the pipeline? DH: We are always looking at products that we can add to our lineup, but only if it adds value to the market. If we can introduce a product that does not currently exist, or improve on one that already does, then we certainly will consider it. Since Navien is part of a global company, we are also looking at other markets such as Europe and Asia to follow developments there. I am confident that the NPF will not be the last new product that we introduce for North America. SHT: What are the top customer — contractor and end user — needs in the tankless market in 2023? DH: As we know the tankless industry is going through some changes right now. Issues such as efficiency regulations, electrification, and restrictions on greenhouse gas emissions all have been in the news lately. The trades are also still trying to bring more people to the workforce to help install and service whatever products are out there. Finally the end users are still not sure what many of these changes mean for them in terms of all gas appliances, not just water heaters. But for tankless in general I don’t think the needs have changed that much – the contractor wants you to have a good product that is easy to install and service, and provide training and technical support to help them be efficient at their job. They also want to know that you are a reliable source for information about what is going on in the industry, since most are too busy to keep up with the changes. As for the end user – they want hot water without having to worry about it. SHT: How has the global push for decarbonization affected Navien’s product development and go-to-market strategy? DH: As I mentioned before, we are looking at the changes that are happening not just in the US and Canada, but also in Europe, Asia, and other countries. We are exploring products in the electric segment for North America, both resistance and heat pump technology. Adding one or both of those to our lineup will happen once we have the right products for our market. In addition we are testing with Hydrogen as a fuel source, both as a blend and pure hydrogen. That work is being done while still improving and developing our gas fired products, including additional residential commercial boilers and commercial water heaters. SHT: What new technologies and product features are on the rise in the water heating market? DH: Navien believes there is a place in the market for both electric and gas fired water heaters. We continue to look at options for electric source water heaters, but also exploring ways to improve gas efficiency and lower greenhouse gas emissions. Moving forward solutions such as dual fuel source products can help address applications that utilize the best of both technologies. An evolving area of products is the user interface, or the control panel that is now showing up on products. The launch of the Navien NPE-A2\/S2 included the EZ-Nav panel, which is a multi-line backlit display. This control makes the set up and operation of the product simpler and faster for the installer and helps a service contractor with maintenance or issues in the field. Wireless connectivity to the product for the end user also continues to grow, as IOT products become the norm in homes nowadays. Finally, as the workforce needs to be educated on the evolving technologies, we are looking at ways to help shorten the learning curve on both installation and service of the products. You will see more service tools that interface through a phone or tablet with the products in the future, reducing diagnostic time in the field.","filter_flag":1}
{"title":"Fashion Companies Show Progress in Lowering Carbon Impact, but Increased Production Makes It a Wash - EcoWatch","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVjb3dhdGNoLmNvbS9mYXNoaW9uLWNvbXBhbmllcy1jYXJib24taW1wYWN0LXN1c3RhaW5hYmlsaXR5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVjb3dhdGNoLmNvbS9mYXNoaW9uLWNvbXBhbmllcy1jYXJib24taW1wYWN0LXN1c3RhaW5hYmlsaXR5Lmh0bWzSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LmVjb3dhdGNoLmNvbS9mYXNoaW9uLWNvbXBhbmllcy1jYXJib24taW1wYWN0LXN1c3RhaW5hYmlsaXR5Lmh0bWzSAQA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVjb3dhdGNoLmNvbS9mYXNoaW9uLWNvbXBhbmllcy1jYXJib24taW1wYWN0LXN1c3RhaW5hYmlsaXR5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Fashion Companies Show Progress in Lowering Carbon Impact, but Increased Production Makes It a Wash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EcoWatch<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fashion Companies Show Progress in Lowering Carbon Impact, but Increased Production Makes It a Wash - EcoWatch","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVjb3dhdGNoLmNvbS9mYXNoaW9uLWNvbXBhbmllcy1jYXJib24taW1wYWN0LXN1c3RhaW5hYmlsaXR5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Fashion Companies Show Progress in Lowering Carbon Impact, but Increased Production Makes It a Wash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EcoWatch<\/font>","source.href":"https:\/\/www.ecowatch.com","source.title":"EcoWatch","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Founded in 2005 as an Ohio-based environmental newspaper, EcoWatch is a digital platform dedicated to publishing quality, science-based content on environmental issues, causes, and solutions. A new report from Wrap, a climate action NGO, finds that despite making gains in lowering their carbon impact, such as reducing carbon impact and water usage per garment, fashion companies’ efforts are being canceled out by increased production. The Textiles 2030 Annual Progress Report reviewed brands that had signed up to Wrap’s voluntary Textiles 2030 initiative, in which participating businesses aim to reduce greenhouse gas emissions of new products by 50% and reduce the aggregate water footprint of new products by 30% compared to levels measured in 2019. According to the report, participating brands reduced carbon impact by 12% and water usage by 4% per metric ton from 2019 to 2022. Wrap noted these improvements happened because of actions such as reusing and recycling clothes at higher rates. Yet textile production and sales has increased 13% for the participating businesses, as the average person in the UK purchases about 28 new pieces, or 8 kilograms (17.6 pounds) of clothing per year, Wrap found. Overall, the 26 participating companies, including major retailers like AllSaints, ASOS, Boohoo, Gymshark, Primark and Urban Outfitters, had only a 2% reduction in total carbon impact from 2019 to 2022. Total water usage was actually up overall by 8%. Participants totalled 3.1 million cubic meters of water consumption in 2022, or enough water to supply 53% of the global population with drinking water for an entire year. “If we hope to get anywhere near achieving the critical goals of the Paris Agreement, we must get serious about textiles and everyone has a role to play,” Catherine David, director of behaviour change and business programmes at WRAP, said in a statement. “We need sustainable design, sustainable business models, and more sustainable ways of buying and using clothes from more businesses. But production is clearly the key issue, and the onus is on businesses to make preloved part of their portfolio, so it’s accessible, easy and fun.” Wrap noted that businesses have a critical role to play in reducing consumption, designing for longevity, recycling materials and developing more circular business models that incorporate actions like repairing and renting clothing. But consumers will also need to adopt more sustainable shopping habits, David shared. According to the report, just 9% of products sold by retailers were “preloved.” “We buy more clothes than any other nation in Europe. Our research shows that a quarter of most wardrobes go unworn in a year and nearly a quarter of us admit to wearing clothes only a few times,” David explained. “Moving into winter is the perfect time to look through our wardrobes — wear what we have and consider whether it’s time to let something go. You can donate, sell, or give clothes away — it all helps them move around the economy and reduce the amount produced.”","filter_flag":1}
{"title":"Plastic bottles and bags to be made with more recycled content - Islands' Weekly","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA","guidislink":false,"published":"Sat, 11 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=315, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5\" target=\"_blank\">Plastic bottles and bags to be made with more recycled content<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Islands' Weekly<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plastic bottles and bags to be made with more recycled content - Islands' Weekly","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmlzbGFuZHN3ZWVrbHkuY29tL25ld3MvcGxhc3RpYy1ib3R0bGVzLWFuZC1iYWdzLXRvLWJlLW1hZGUtd2l0aC1tb3JlLXJlY3ljbGVkLWNvbnRlbnQv0gEA?oc=5\" target=\"_blank\">Plastic bottles and bags to be made with more recycled content<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Islands' Weekly<\/font>","source.href":"https:\/\/www.islandsweekly.com","source.title":"Islands' Weekly","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Submitted by the Washington Department of Ecology You can find plastic trash everywhere. It’s one of the most common items in roadside litter. Plastic bottles and containers end up in our lakes and rivers, and plastic refuse mars our parks and public spaces. Moreover, the fossil fuels that go into making these products contribute to climate change. New regulations from the Washington Department of Ecology will help to address some of those problems by increasing the amount of plastic that gets recycled and reused to make new plastic packaging. Companies that sell drinks, milk, wine, trash bags, personal care products, and household cleaners must include more recycled plastic in their packaging, according to the new rule. “You don’t have to look very hard to see that we have a plastic problem – plastic containers are among the most common items we find in roadside litter,” said Ecology Director Laura Watson. “This rule will help us reduce pollution, increase the value of our recycling, and make sure that we’re doing everything possible to keep Washington beautiful and litter-free.” Since January, companies that make trash bags and beverage containers have been required to make their products with at least 10% and 15% recycled content, respectively. The requirements gradually increase over the next 12 years, and expand to include plastic packaging for other common products. By 2036, most plastic packaging will be required to contain at least 50% recycled content. A graph showing the increase in recycled material in plastic containers over the next 12 years. Every year, companies must comply with the requirements, report, and pay fees based on the weight of plastic they sell into the state. Increasing recycled content in plastics is the latest step in implementing a 2021 law passed by the Washington Legislature, aimed at reducing the use of single-use plastics. The law banned single-use plastic bags as well as foam packing peanuts and takeout containers. It also restricted the use of throw-away plastic takeout items at restaurants and lodging establishments and set new standards for recycled plastic content. “Plastic pollution is ugly, harmful, and expensive to clean up,” said Peter Lyon, manager of Ecology’s Solid Waste Management program. “Using recycled plastic to make new products is the sustainable thing to do, and it cuts down on harmful greenhouse gas emissions.”","filter_flag":1}
{"title":"Why Some Companies Are Ahead in the Race to Net Zero - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5\" target=\"_blank\">Why Some Companies Are Ahead in the Race to Net Zero<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Some Companies Are Ahead in the Race to Net Zero - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXNvbWUtY29tcGFuaWVzLWFyZS1haGVhZC1pbi10aGUtcmFjZS10by1uZXQtemVyby1hbmQtcmVkdWNpbmctZW1zc2lvbnPSAQA?oc=5\" target=\"_blank\">Why Some Companies Are Ahead in the Race to Net Zero<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Challenges Faced Only 10% of companies reported comprehensively measuring all their emissions, revealing no improvement relative to our 2022 survey. More concerning, only 14% of companies indicated reducing emissions in line with their ambitions, down 3pp from those reporting the same in 2022. Companies indicated that their reduction efforts have been obstructed by several challenges, most notably difficult macroeconomic conditions and capital constraints. Signs of Progress Despite these discouraging results at a global level, there are bright spots to highlight. On Scope 3, for example, companies have taken steps to significantly improve the coverage of their emissions measurement and reporting. The number of respondents indicating partial measurement and reporting of Scope 3 emissions has increased by 19pp since 2021, from 34% to 53%. In tandem, more respondents said they have set Scope 3 reduction targets—up 12pp since 2021, from 23% to 35%—with the most common areas of focus being waste management and purchased goods and services. According to the CDP, supply chain emissions (Scope 3) are, on average, 11.4 times greater than operational emissions (Scopes 1 and 2). Hence, the reported increase in Scope 3 measurement and reporting is encouraging, as increased collaboration along the supply chain is essential to attaining net zero. In addition, some regions have demonstrated a clear improvement in emissions measurement during the past two years. Since 2021, the number of Asia-Pacific respondents comprehensively reporting Scopes 1, 2, and 3 emissions increased by 7pp, while the number of South American and North American respondents comprehensively reporting their internal emissions—Scopes 1 and 2—grew by 9pp and 5pp, respectively. To drive more robust emissions accounting, countries have started to implement regulations related to climate-related disclosure and reporting. Many of these regulations initially call on large, publicly listed companies to report emissions and other climate impacts; in follow-on phases, the regulations will be expanded to smaller entities. Such regulations will likely spur more comprehensive reporting of Scopes 1, 2, and 3 emissions over the next few years, once they are fully in effect. Competitive Advantage Decarbonization provides a host of financial and nonfinancial rewards to businesses. A growing number of companies recognize this, citing the following as top benefits: reputational value, lower operating costs, greater regulatory compliance, higher valuations, increased revenues, the improved attraction and retention of talent, and tax savings. When asked to quantify, 40% of respondents estimated an annual financial benefit of at least $100 million for meeting emissions reduction targets, a 3pp increase compared with last year’s survey. Businesses that have made decarbonization progress are capturing these wide-ranging benefits and gaining a competitive edge over their peers. To catch up, laggards will need to accelerate their emissions reduction in the near term, even as their measurement and reporting are still maturing. A Path Forward When we compare companies that report reducing their emissions in line with their ambitions and those that do not, we find that the former disproportionately display four notable traits: They collaborate with suppliers and customers on emissions measurement and reduction. They calculate emissions at the product level. They harness the power of digital technology in the emissions management process. They consider emissions-reporting regulations to be a key enabler of reduction. Collaborating with Suppliers and Customers. As indicated above, companies globally have made strides in expanding their Scope 3 coverage and establishing reduction targets over the past two years. Businesses reported that, in their efforts to meet these new targets, they have benefited significantly from robust partnerships with both suppliers and customers. Indeed, 75% of companies that cut emissions in line with their ambition have joint reduction initiatives with most of their suppliers, and 54% have similar initiatives with most of their customers. Schneider Electric, a global energy technology company, is an example of an organization unifying its supply chain in a broad emissions reduction effort. In 2021, the company launched partnerships with more than 1,000 of its suppliers to calculate, report, and set goals on emissions reduction. Through workshops and educational webinars, the company catalyzed nearly 900 suppliers to begin reporting and actively decreasing emissions, driving progress beyond the gates of its own operations. Calculating Emissions at the Product Level. We find that 75% of companies attempt to measure emissions for at least some of their products from cradle to gate, that is, from raw materials to distribution. To be most effective, these product-level assessments require regular supplier input and accurate attribution of emissions to each product. Reckitt, a multinational consumer goods company, sees its product-level approach as critical to meeting its sustainability targets, including emissions reduction. Fabrice Beaulieu, the company’s chief marketing, sustainability, and corporate affairs officer, adds, “Consumers expect brands to meet their needs, while also using less plastic and emitting less carbon. Our playbook for sustainable product innovation leverages the power of product-level data to meet these expectations and drive more sustainable product design.” As consumers drive demand for new or upgraded products, the company deploys its internal Sustainable Innovation Calculator to compare the footprints of various product designs, evaluating the impact that different compositions, packaging, transport modes, and other factors have on a product’s overall sustainability score. Reckitt uses these assessments to innovate and develop new products that have lower environmental impact compared with the products they replace. Fabrice highlights, “We innovate to create value for consumers, meet their evolving demands, and lower our environmental impact. The scientific precision of our tools helps us create more sustainable and attractive products, fulfilling these goals.” Reckitt also seeks to use product-level innovation to improve sustainability in consumer behaviors. For example, Reckitt’s dishwashing brand, Finish, is innovating to meet the UN’s Sustainability Development Goal focused on clean water and sanitation. The brand reformulated Finish dishwashing products to eliminate the need for prerinsing, enabling customers to save water in their everyday use of the product. This type of innovation allows Reckitt to engage consumers, persuade them to act differently, and, in doing so, reduce their own environmental footprint. Klöckner & Co is one of the largest producer-independent distributors of steel and metal products and one of the leading steel service companies worldwide, with more than 90,000 customers. As a pioneer in the sustainable steel industry, Klöckner & Co developed a proprietary Product Carbon Footprint (PCF) calculation engine, the Nexigen PCF Algorithm, which has calculated more than 200,000 PCFs. (Nexigen is a trademark of Klöckner & Co.) Each PCF calculated is accompanied by a TÜV SÜD certificate that is available to Klöckner & Co’s customers with each green material purchased. Taking its Nexigen PCF Algorithm a step further, Klöckner & Co developed a solution, Nexigen Data Services, that enables customers to see the carbon footprint of their past purchases and offers greener alternatives for future purchases. Felix Schmitz, CEO of Klöckner & Co subsidiary Kloeckner Metals Germany, comments, “Green steel is the way forward, and we arm our customers with decision-useful product-level data. This information enables customers to make green purchase decisions, and it sends a demand signal back through the whole supply chain.” As a result, Klöckner & Co’s customers are empowered by knowing the exact carbon footprint of each product and can easily choose greener alternatives. Harnessing the Power of Digital Technology. Technology solutions improve accuracy and efficiency when assessing emissions and can help identify innovative ways to reduce them. Our survey finds that companies with automated digital solutions for measurement are 2.5 times more likely to measure their emissions comprehensively. In addition, surveyed companies listed technology adoption and use as the leading strategic enabler for improving emissions reduction in their organization. As an example, The Economist Group, a global media and information services company, deploys CO2 AI’s data platform, an end-to-end sustainability platform that helps large, complex organizations manage their sustainability goals by measuring and reducing emissions at scale. The decision to use a technology solution such as CO2 AI came from The Economist Group’s focus on a science-based and data-driven approach. “The Economist Group is known for the rigor and accuracy of both its reporting and its business-intelligence products and services, and we wanted to ensure that this was reflected in our [sustainability] approach,” says Emily Jackson, SVP Sustainability. CO2 AI–enabled automation of measurement also generates efficiency for the company. “Measuring emissions is key for monitoring our progress and for KPI and disclosure reporting—but it is a highly repetitive process. It made good business sense to use an automated tool to do this on a monthly or quarterly basis, rather than tie up team resources,” remarks Jackson. Most important, The Economist Group uses the platform in translating measurement into actual reduction. The company has identified hot spots, found new reduction levers, and used key tool outputs to engage top-emitting suppliers in new joint reduction initiatives. “Emissions heat maps have opened up transparent conversations on reduction with our suppliers where we didn’t have them before,” Jackson adds. As AI matures, digital technology solutions will continue to improve accuracy, efficiency, and decision making in emissions management. Companies recognize this potential. Of those surveyed, about 30% plan to expand deployment of AI-powered tools in the next three years across a variety of functions, including predictive modeling and supply chain tracking. Viewing Regulations Positively. Companies that are reducing their emissions in line with their ambition are twice as likely to view emissions-reporting regulations as helpful guidance to their emissions measurement approach and twice as likely to view the regulations as an enabler of emissions reduction. These findings suggest that, in addition to the internal company practices highlighted above, external reporting mechanisms can play a pivotal role in advancing emissions reduction. Through collaboration, product-level assessments, and digital technology, companies can find the data and strategies they need to close the gap between their actions and their ambitions in reducing emissions. Progress in these areas will not only alleviate the burden of climate change but also deliver a boost to the bottom line. The authors thank Laurent Acharian, Juliette Callahan, Jack Higham, Heather Nowaczyk, Joe Vasquez, and Eva Wilde for their contributions to the analysis and writing of this report. This research was a collaboration between BCG and CO2 AI, an enterprise sustainability management platform that helps companies master their end-to-end net zero journey.","filter_flag":1}
{"title":"How AI Can Speed-Up Climate Action | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA","guidislink":false,"published":"Mon, 20 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5\" target=\"_blank\">How AI Can Speed-Up Climate Action | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How AI Can Speed-Up Climate Action | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWFpLWNhbi1zcGVlZHVwLWNsaW1hdGUtYWN0aW9u0gEA?oc=5\" target=\"_blank\">How AI Can Speed-Up Climate Action | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"With the world on a path to fail to meet the Paris Agreement’s goal to keep warming under 1.5° Celsius, there is an urgent need to accelerate climate action. To get back on track, a substantial reduction in emissions—to 57% of 2010’s level—is required by 2030. And leveraging AI for climate change has enormous promise given the technology’s strength in understanding and modeling complex systems. Accelerating Climate Action with AI—a new BCG report commissioned by and co-authored with Google—finds that deploying today’s AI technology and scaling has already proven that AI applications for climate can significantly reduce global greenhouse gas (GHG) emissions. Moreover, it outlines how AI can also substantially enhance climate-related adaptation and resilience efforts and shape climate-friendly behaviors. It also discusses AI’s potential to contribute to groundbreaking scientific discoveries—for example, in nuclear fusion—that open new avenues for climate action. The report also spotlights early success stories, explores AI-related risks and options to address them, and summarizes opportunities for policymakers and business leaders to maximize the benefits and minimize the risks of AI for climate change. Six Takeaways on AI for Climate Change 1. By scaling currently proven applications and technology, AI has the potential to unlock insights that could help mitigate 5% to 10% of GHG emissions by 2030—and to significantly bolster climate-related adaptation and resilience initiatives. 2. Beyond helping to reduce emissions and enhance the resilience of communities and infrastructure, AI can accelerate climate action by taking climate modeling to the next level, enabling new approaches to climate education, and supporting breakthroughs in climate science, climate economics, and fundamental research. 3. AI’s strengths in curating information, enhancing prediction, and guiding optimization can speed progress in three crucial areas: Mitigating emissions Supporting adaptation and resilience to unavoidable climate impacts Enhancing the state of the art in climate modeling, climate economics, climate education, and climate-related basic research 4. While AI is only just starting to be applied to climate challenges, leading-edge organizations and use cases are already achieving real results—and demonstrating the potential of AI for climate change if adopted at scale. And 87% of executives believe AI has potential to address their climate challenges. 5. AI, of course, also poses risks—data center emissions, water use for data center cooling, and electronic waste as well as broader concerns about equity and privacy—that must be managed thoughtfully. And organizations have options and are already taking steps to mitigate risks. 6. Policymakers have three critical oversight roles to play in maximizing the benefits and minimizing the risks of AI for climate. The report details three critical policy outcomes, offering a potential list of supporting policy moves and policy examples (see the exhibit below) for each:","filter_flag":1}
{"title":"Call for more EU funding for meat alternatives - Science Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vc2NpZW5jZWJ1c2luZXNzLm5ldC9uZXdzL2Fncmlmb29kL2NhbGwtbW9yZS1ldS1mdW5kaW5nLW1lYXQtYWx0ZXJuYXRpdmVz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vc2NpZW5jZWJ1c2luZXNzLm5ldC9uZXdzL2Fncmlmb29kL2NhbGwtbW9yZS1ldS1mdW5kaW5nLW1lYXQtYWx0ZXJuYXRpdmVz0gEA?oc=5","id":"CBMiUGh0dHBzOi8vc2NpZW5jZWJ1c2luZXNzLm5ldC9uZXdzL2Fncmlmb29kL2NhbGwtbW9yZS1ldS1mdW5kaW5nLW1lYXQtYWx0ZXJuYXRpdmVz0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vc2NpZW5jZWJ1c2luZXNzLm5ldC9uZXdzL2Fncmlmb29kL2NhbGwtbW9yZS1ldS1mdW5kaW5nLW1lYXQtYWx0ZXJuYXRpdmVz0gEA?oc=5\" target=\"_blank\">Call for more EU funding for meat alternatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Science Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Call for more EU funding for meat alternatives - Science Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vc2NpZW5jZWJ1c2luZXNzLm5ldC9uZXdzL2Fncmlmb29kL2NhbGwtbW9yZS1ldS1mdW5kaW5nLW1lYXQtYWx0ZXJuYXRpdmVz0gEA?oc=5\" target=\"_blank\">Call for more EU funding for meat alternatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Science Business<\/font>","source.href":"https:\/\/sciencebusiness.net","source.title":"Science Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A new research partnership is needed to accelerate development of sources of non-meat protein if Europe is to make serious headway in reducing the 26% – 34% of greenhouse gas emissions that come from its food system, according to a think tank set up by The European Institute of Innovation and Technology’s (EIT) food innovation group. “This is the single biggest lever for climate impact,” said Kari Tronsmo, open innovation manager at the French multinational food company Danone and president of the EIT Protein diversification think tank, which wrote the report. Innovation is required in terms of “plant breeding, adapting crops to the new climate and adapting crops to grow together in synergy,” Tronsmo told Science|Business. Traditionally, breeding innovation has focused on staple crops, including wheat, maize and rice. “There has been much less effort on all the smaller crops. That’s what we need now,” she said. Protein diversification holds the potential to reduce greenhouse gas emissions more per euro invested than any other industry, according to a 2022 Boston Consulting Group report. But as things stand, less than 1% of all food research funding in Europe went into alternative proteins between 2007 and 2020. Given that it is unlikely that Europe can meet its climate targets without reducing meat consumption, there is a need to put greater effort into exploring and establishing alternative sources of protein. These will range from high tech approaches such as cultivating meat in the lab and the fermentation of fungi and yeast, to protein derived from plants that have been part of non-European diets for centuries, algae-based and insect-based alternative sources. Transitioning to these alternatives will require investment in research, development and innovation, to devise new products, scale up production, and better understand consumer behaviour. EU policy-makers should explore amplifying the impact of existing funding through partnerships, such as by setting up a Horizon Europe partnership on Protein Diversification, the report says. “Synergies with other funding bodies could be created to accelerate the new sustainable food systems, and private and philanthropic foundations have expressed interest in jointly exploring ways to collaborate with the EU,” says the report published last week by the think tank, which is composed of representatives from academia, industry and NGOs. “So far, the alternative protein industry has primarily depended on investments from venture capitalists and private equity, with insufficient support from public funds,” the report says. The investment needed in infrastructure is especially difficult for start-ups. “De-risking is the key, which means reducing investment risk through public financial instruments and a clearer policy framework,” says the report. Loan guarantees, incentives for minimum purchase contracts, and public subsidies are ways policymakers can help during the scaling phase. As you sow Alternative proteins have already been selected as a key area for research in the EU’s Food 2030 framework and are cited in the proposed Horizon Europe partnership for Sustainable Food Systems, due to launch in 2024. Over and above this, EIT Food think tank emphasised the need to invest in research into crop reliability, new protein sources, breeding crops with a higher protein content, and making it more attractive for farmers to cultivate protein crops such as soybeans. Investment is needed throughout the value chain, including in development to improve the taste and to create alternatives which resemble familiar meat products. This also applies to infrastructure, particularly to support the fermentation and cultivated meat sectors. Setting up shared infrastructure would be one approach, so that every start-up does not have to fund its own pilot plant, Tronsmo said. There are exemplars, such as the Ferments du Futur public-private partnership launched last year by French public research institute INRAE and the ANIA industry association. Thanks partly to €48.3 million in public funding, an innovation platform will be set up near Paris to facilitate the development of new fermented foods. Traditional processors such as butchers should also be involved in the transition, said Peter Holl of the German Institute of Food Technologies, who contributed to the report. “They have the technologies, they know the customers and they know their business,” he said. Other recommendations include assessing whether the EU’s rules relating to approval of novel foods are hindering innovation, reducing VAT for sustainable proteins to encourage consumer uptake, and reforming the Common Agricultural Policy to promote protein diversification. The report is published at a time when uncertainty surrounds the future of the EU’s Farm to Fork strategy, which aims to enable fair, healthy and environmentally-friendly food systems, because the push for sustainability is coming up against concerns over food security. The European Commission was expected to adopt a proposal for a legislative framework for sustainable food systems by the end of this year. However, there are now doubts as to whether this will see the light of day before next year’s European elections. The Commission is also due to review its protein policy in the first quarter of 2024 to address Europe’s dependence on imports. This would address not just alternative proteins for human consumption, but also plant-based proteins for animal feed.","filter_flag":1}
{"title":"Chemical recycling “a dangerous deception” for solving plastic pollution: Report - Environmental Health News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmVobi5vcmcvY2hlbWljYWwtcmVjeWNsaW5nLXBvbGx1dGlvbi0yNjY2MDk5NzIxLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmVobi5vcmcvY2hlbWljYWwtcmVjeWNsaW5nLXBvbGx1dGlvbi0yNjY2MDk5NzIxLmh0bWzSAQA?oc=5","id":"CBMiQGh0dHBzOi8vd3d3LmVobi5vcmcvY2hlbWljYWwtcmVjeWNsaW5nLXBvbGx1dGlvbi0yNjY2MDk5NzIxLmh0bWzSAQA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmVobi5vcmcvY2hlbWljYWwtcmVjeWNsaW5nLXBvbGx1dGlvbi0yNjY2MDk5NzIxLmh0bWzSAQA?oc=5\" target=\"_blank\">Chemical recycling “a dangerous deception” for solving plastic pollution: Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Environmental Health News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chemical recycling “a dangerous deception” for solving plastic pollution: Report - Environmental Health News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vd3d3LmVobi5vcmcvY2hlbWljYWwtcmVjeWNsaW5nLXBvbGx1dGlvbi0yNjY2MDk5NzIxLmh0bWzSAQA?oc=5\" target=\"_blank\">Chemical recycling “a dangerous deception” for solving plastic pollution: Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Environmental Health News<\/font>","source.href":"https:\/\/www.ehn.org","source.title":"Environmental Health News","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Chemical recycling — an umbrella term used to describe processes that break plastic waste down into molecular building blocks with high heat or chemicals and convert them into new products — will not help reduce plastic pollution, but rather exacerbate environmental problems, according to a new report by nonprofit environmental advocacy groups Beyond Plastics and the International Pollutants Elimination Network (IPEN). The report comes just weeks before the United Nations Environment Programme meeting slated to take place in Nairobi in mid-November, where officials from countries worldwide will convene for a third round of negotiations to develop an international legally binding treaty to curb plastic pollution. Less than 10% of the seven billion tons of plastic waste humans have generated has been recycled, according to the UN Environment Programme. That echoes U.S. trends: available Environmental Protection Agency data showed that while the country generated 35.7 million tons of plastics in 2018, just three million tons, or 8.7%, were recycled. Some other accounts, such as a 2022 report from Beyond Plastics, found the U.S. plastic recycling rate is even lower — between 5% to 6%. “This is the perfect report for delegates to read on the plane,” Judith Enck, president of the anti-plastics advocacy group Beyond Plastics that co-developed the report, told EHN. “Currently, the draft of the treaty does not allow for chemical recycling, but we know that the plastics and chemical industry is working hard to change that.” “A dangerous deception” In mid-November the United Nation Environment Programme will meet in Nairobi for a third round of negotiations to develop an international legally binding treaty to curb plastic pollution. Credit: UNEP To investigate the impacts of chemical recycling, the IPEN and Beyond Plastics report analyzed peer-reviewed literature as well as publicly available data on the 11 existing chemical recycling plants in the U.S., Lee Bell, mercury and persistent organic pollutants policy advisor at IPEN who is also the author of the new report, told EHN. The analysis concluded that chemical recycling is “a dangerous deception” to solving the plastic waste problem as it is “inefficient, energy-intensive and contributes to climate change.” Even at full capacity, the report noted, the 11 chemical recycling facilities in the U.S. would handle less than 1.3% of the plastic waste generated annually within the country. The report also claimed chemical recycling to be “dangerous and dirty,” emitting toxic waste back into the environment along the process. According to the analysis, typical emissions from pyrolysis, one of the most prevalent methods used in chemical recycling that involves breaking plastics down with high heat, include carcinogenic polycyclic aromatic hydrocarbons, volatile organic compounds, chlorinated and brominated dioxins, furans and acid gasses. Per- and polyfluoroalkyl substances , also known as PFAS, “may also be a contaminant of concern in chemical recycling output, but little information is available on the subject,” the report pointed out. Furthermore, as part of the report, Beyond Plastics said it analyzed the 5-mile radius around each of the 11 chemical recycling plants using the EPA’s Environmental Justice Screening and Mapping Tool. The results showed that eight of the plants are located in areas with lower-income communities while “seven have higher-than-average concentrations of people of color than the rest of the state and country,” the report noted. “Researchers worldwide have all agreed that the amount of data released by the chemical recycling industry is insufficient to determine its full impacts,” Bell said.” But what we have been able to deduce from the information that is available is that there are some very, very hazardous impacts associated with the processes.” Controversies of chemical recycling For many years, chemical recycling, also dubbed advanced recycling, has often been touted by proponents as a potential saving grace for the plastic pollution problem by creating “a new life cycle” for used plastic products. However, some opponents contend that chemical recycling is nothing more than an industry ploy to support the ongoing expansion of plastic production and a tactic to deflect environmental responsibilities. “It has been sold and hyped as a solution to the plastic pollution problem,” said Bell. “Unfortunately, chemical recycling does not play any significant role in addressing the plastic pollution issue.” The results from the new report mirror the eyebrows raised by some researchers and lawmakers on the benefits and impacts of chemical recycling. A September report A September report published by the Nordic Council of Ministers , the official body for intergovernmental cooperation in the Nordic region, for instance, asserted that chemical recycling presents “drawbacks such as higher energy consumption, lower material-to-material yields, increased greenhouse gas emissions and greater investment requirements that could create ‘lock-in’ effects, disincentivizing better solutions in the future.”","filter_flag":1}
{"title":"Alt-Meat Companies Are Grappling With A Harsh Reality - TIME","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdGltZS5jb20vNjMzOTA1MC9wbGFudC1iYXNlZC1tZWF0LW1vdmVtZW50LWhhcnNoLXJlYWxpdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdGltZS5jb20vNjMzOTA1MC9wbGFudC1iYXNlZC1tZWF0LW1vdmVtZW50LWhhcnNoLXJlYWxpdHkv0gEA?oc=5","id":"CBMiQWh0dHBzOi8vdGltZS5jb20vNjMzOTA1MC9wbGFudC1iYXNlZC1tZWF0LW1vdmVtZW50LWhhcnNoLXJlYWxpdHkv0gEA","guidislink":false,"published":"Wed, 22 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=326, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdGltZS5jb20vNjMzOTA1MC9wbGFudC1iYXNlZC1tZWF0LW1vdmVtZW50LWhhcnNoLXJlYWxpdHkv0gEA?oc=5\" target=\"_blank\">Alt-Meat Companies Are Grappling With A Harsh Reality<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TIME<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Alt-Meat Companies Are Grappling With A Harsh Reality - TIME","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdGltZS5jb20vNjMzOTA1MC9wbGFudC1iYXNlZC1tZWF0LW1vdmVtZW50LWhhcnNoLXJlYWxpdHkv0gEA?oc=5\" target=\"_blank\">Alt-Meat Companies Are Grappling With A Harsh Reality<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TIME<\/font>","source.href":"https:\/\/time.com","source.title":"TIME","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The general tone of most industry conferences tends to be akin to a sector-specific pep rally. But at an anti-factory-farming summit last month in Denver, the tenor of discussions was more like a group therapy session. The words “Adversity. Strength. Resilience,” were posted on the covers of schedule handouts. Signs posted around the event contained somber messages: “Giving up on reducing societal meat consumption is not an option.” At the opening ceremony, one slide pointed to the adversity ahead. “No matter the odds, we must strive to create a more sustainable, healthy, and compassionate world.” The conference’s host, the Reducetarian Foundation, is one corner of the broader universe of groups opposed to factory farming. The foundation speaks for a coalition of animal welfare advocates, climate activists (meat production is responsible for about 14% of humanity’s greenhouse gas emissions), and alt-protein entrepreneurs. But recently, sinking fortunes in that world have made their shared goal of cutting global meat consumption seem much farther off, or almost out of reach. “It’s been a tough year,” says Brian Kateman, director of the Reducetarian Foundation. What really matters to Kateman is how much meat is being consumed globally each year—and despite all the much-hyped alt-meat startups, that number is rising. “I can’t stand up onstage and tell people that everything is going perfectly well, because at the end of day, that’s the number I look at,” he says. This is a stark contrast to just a couple years ago when spirits were high across the alt-meat world. Big early players like Beyond Meat and Impossible were growing fast, while venture capitalists were plowing cash into new, smaller competitors. That innovation, and the big money fueling it, buoyed spirits amongst people who wanted to cut meat consumption for ethical or environmental reasons. It seemed that sophisticated faux-burgers would be able to cut into meat’s market share—and its environmental impacts—where tofu and tempeh couldn’t, and the era of peak meat seemed to be at hand. But the era of good vibes didn’t last long. In recent months, rising interest rates have cut off flows of cheap startup cash, while inflation has squeezed consumers, causing many to forgo expensive meat alternatives. Meat industry messaging campaigns have affected consumer perceptions, seeding the idea that the new alternatives weren’t healthy (the science on the real health trade offs is fuzzy, and also depends on which meat substitute one chooses). And there may have been real weaknesses to the much-hyped products themselves, with sellers often seeing a lot of people trying their meatless sausages or burgers a few times, but far fewer making those substitutes a consistent part of the dinner rotation. The result has been a period of financial hardship among ventures trying to take the meat out of meat. Bigger players like Beyond have taken a thrashing, while many of the smaller companies have closed up shop. For some people at the conference, though, it wasn't all bad news. Meati, a company that makes vegan chicken and steak alternatives out of mycelium, the thin, rootlike structures grown by mushrooms, laid off 20% of their staff in September to cut costs. But over a beer at the Denver Westin, Morrad Fadel, VP of innovation and commercialization at vegan chicken and steak company Meati, said that thinning out the competition can give good products more room to shine. The alt-protein space, he says, is akin to boomtown Denver in the 19th century, when the gold rush attracted settlers who built wooden structures, which later burned down and were replaced by more sturdy brick and mortar buildings. “That's what Meati is doing right now, is becoming the brick and mortar of the alternative meat category,” Fadel says. Making money in the current financial environment is still hard, though; the company laid off 20% of its staff in September to cut costs. A version of this story also appears in the Climate is Everything newsletter. To sign up, click here. Some entrepreneurs say they’re learning from the recent hardships in the sector. Parendi Birdie, an entrepreneur working to develop so-called “blended meats,” or meat replacements that contain some amount of real meat, says a lot of the advertising from the prior generation of meat alternatives focused too much on making the intellectual case for meat alternatives, trying to convince consumers that they were healthier and more ethical. “The ultimate reason that we buy meat is more for that deeper unconscious satisfaction,” Birdie says. “I think leaning into that indulgent imagery and language [in advertising] is going to be important.” To some observers at the Reducetarian Summit, though, it was clear that the entire model of venture capital-backed food startups has serious issues. David Meyer, CEO of meat reduction nonprofit Food System Innovations, says that VC-backed alt-protein companies faced a lot of pressure to hype their products, and to make rosy projections about how long it would take consumers to start buying them en masse. The reality of building food businesses to that scale, though, was always going to be much more difficult, a reality on full display now as the prospects of early leaders slump. A lot of that difficulty has to do with the costs of scaling: the so-called “valley of death” between small-scale pilot-production facilities and the truly monstrous installations businesses need to reach global scale and achieve economies of scale. Meanwhile, getting around some of the more fundamental issues holding back alternative meat—that so far, no one has created something actually indistinguishable from the real thing—may take more basic research, perhaps at university labs. Ultimately, though, Meyer thinks that companies looking to sell new products to replace meat at the dinner table are going to be successful, if only because humanity has little choice. “It is the climate that’s going to drive it,” Meyer says. “We literally cannot meet our Paris [Agreement] climate goals without reforming the animal food system, and replacing it with something much more sustainable.”","filter_flag":1}
{"title":"Sidel launches new PET bottle | Dairy Foods - dairyfoods.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2ODI2LXNpZGVsLWxhdW5jaGVzLW5ldy1wZXQtYm90dGxl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2ODI2LXNpZGVsLWxhdW5jaGVzLW5ldy1wZXQtYm90dGxl0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2ODI2LXNpZGVsLWxhdW5jaGVzLW5ldy1wZXQtYm90dGxl0gEA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2ODI2LXNpZGVsLWxhdW5jaGVzLW5ldy1wZXQtYm90dGxl0gEA?oc=5\" target=\"_blank\">Sidel launches new PET bottle | Dairy Foods<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sidel launches new PET bottle | Dairy Foods - dairyfoods.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2ODI2LXNpZGVsLWxhdW5jaGVzLW5ldy1wZXQtYm90dGxl0gEA?oc=5\" target=\"_blank\">Sidel launches new PET bottle | Dairy Foods<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","source.href":"https:\/\/www.dairyfoods.com","source.title":"dairyfoods.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Sidel's new PET bottle is designed to offer an increased competitive advantage for liquid dairy manufacturers. The mini-size has been designed for products such as drinking and probiotic yoghurts with capacities between 65ml to 150ml and is ideally suited for ambient and cold chain processes. The bottle would also suit applications within the juice, nectar, soft drinks, isotonics and tea sector, the company said. “This new format has been launched to support the liquid dairy product industry where the use of PET packaging has increasingly become an attractive alternative,” said Laurent Naveau, Packaging Innovator Leader at Sidel. “Part of Sidel’s continuous packaging optimization program, this bottle is designed to reduce greenhouse gas emissions and costs while also offering new marketing opportunities and high production performance for manufacturers.” By switching to PET, manufacturers can achieve up to a 40 percent cost reduction when moving from polystyrene to PET and a 20 percent reduction from HDPE (high density polyethylene), the company adds. “Our new size has the best-in-class bottle weight with just 3.9g for a 100ml extended shelf-life bottle and 5.4g for 100ml aseptic bottle achieved through a dedicated preform design. This new preform design is qualified for 100% rPET content and also enables a low blowing pressure below 15 bars. Sidel’s new PET mini-bottle guarantees producers total product integrity while also offering compatibility with a range of safe, convenient capping solutions,\" said Naveau. ","filter_flag":1}
{"title":"Sidel launches ultra-small, ultra-light PET bottle for liquid dairy products - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDI1NS1zaWRlbC1sYXVuY2hlcy11bHRyYS1zbWFsbC11bHRyYS1saWdodC1wZXQtYm90dGxlLWZvci1saXF1aWQtZGFpcnktcHJvZHVjdHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDI1NS1zaWRlbC1sYXVuY2hlcy11bHRyYS1zbWFsbC11bHRyYS1saWdodC1wZXQtYm90dGxlLWZvci1saXF1aWQtZGFpcnktcHJvZHVjdHPSAQA?oc=5","id":"CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDI1NS1zaWRlbC1sYXVuY2hlcy11bHRyYS1zbWFsbC11bHRyYS1saWdodC1wZXQtYm90dGxlLWZvci1saXF1aWQtZGFpcnktcHJvZHVjdHPSAQA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDI1NS1zaWRlbC1sYXVuY2hlcy11bHRyYS1zbWFsbC11bHRyYS1saWdodC1wZXQtYm90dGxlLWZvci1saXF1aWQtZGFpcnktcHJvZHVjdHPSAQA?oc=5\" target=\"_blank\">Sidel launches ultra-small, ultra-light PET bottle for liquid dairy products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sidel launches ultra-small, ultra-light PET bottle for liquid dairy products - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDI1NS1zaWRlbC1sYXVuY2hlcy11bHRyYS1zbWFsbC11bHRyYS1saWdodC1wZXQtYm90dGxlLWZvci1saXF1aWQtZGFpcnktcHJvZHVjdHPSAQA?oc=5\" target=\"_blank\">Sidel launches ultra-small, ultra-light PET bottle for liquid dairy products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The new PET bottle from Sidel is designed to offer an increased competitive advantage for liquid dairy manufacturers. This mini-size has been designed for products such as drinking and probiotic yogurts with capacities between 65ml to 150ml and is ideally suited for ambient and cold chain processes. The bottle would also suit applications within the juice, nectar, soft drinks, isotonics and tea sector. “This new format has been launched to support the liquid dairy product industry where the use of PET packaging has increasingly become an attractive alternative,” comments Laurent Naveau, Packaging Innovator Leader at Sidel. “Part of Sidel’s continuous packaging optimization program, this bottle is designed to reduce greenhouse gas emissions and costs while also offering new marketing opportunities and high production performance for manufacturers.” Advanced sustainability and cost efficiency With Sidel’s new ultra-light bottle, manufacturers can benefit from PET’s heightened sustainability credentials. Not only is it the most affordable plastic on the market, but it is also the only food grade bottle-to-bottle recycled plastic. Manufacturers can achieve up to a 40 percent cost reduction when switching from polystyrene to PET and a 20 percent reduction from HDPE (high density polyethylene). Naveau says: “Our new size has the best-in-class bottle weight with just 3.9g for a 100ml extended shelf-life bottle and 5.4g for 100ml aseptic bottle achieved through a dedicated preform design. This new preform design is qualified for 100% rPET content and also enables a low blowing pressure below 15 bars. Sidel’s new PET mini-bottle guarantees producers total product integrity while also offering compatibility with a range of safe, convenient capping solutions.” Creative shelf-appeal The global yogurt and probiotic market size alone was valued at USD 86.87 billion in 2022 and is expected to grow at a compound annual growth rate of 9.3 percent from 2023 to 2030. Manufacturers are increasingly looking for ways to create stand-out shelf appeal in a competitive marketplace. The new ultra-small bottle offers a range of creative options including: different formats and shapes; one-shot or multi-serve consumption; the use of white or transparent PET; multiple graphics and textures; plus, a wide range of bottle necks and caps. It is also compatible with roll-fed or sleeve labelling. High performance Sidel’s new ultra-small bottle is based on a uniquely designed preform, which ensures a wide process window even with reduced heating zones. This offers optimum material distribution guaranteeing a high-bottle performance. Naveau comments: “Sidel’s packaging experts have developed a preform that achieves great bottle quality. The accurate material distribution on the bottle ensures that its performance is secured even with lower blowing pressure and a reduced quantity of material. We’re excited to work with producers within the liquid dairy product sector to realize the full scope of our new ultra-small and light design range.” Complete line solutions Sidel offers a complete line solution for liquid dairy and sensitive products, building on over 40 years of experience operating within and supporting manufacturers in this industry. The new bottle size is compatible with the company’s Aseptic Combi Predis™ FMa - the market’s simplest and fastest aseptic solution with dry preform decontamination. It offers a safe, hygienic and cost-effective way of packaging sensitive products to ensure high-end taste and long shelf life with minimal water and chemical usage. Similarly, the bottle is also suitable for high production speeds of up to 66,000 bottles per hour. ","filter_flag":1}
{"title":"Bakery waste to be put to use as sustainable oils and fats in new partnership - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9iYWtlcnktd2FzdGUtdG8tYmUtcHV0LXRvLXVzZS1hcy1zdXN0YWluYWJsZS1vaWxzLWFuZC1mYXRzLWluLW5ldy1wYXJ0bmVyc2hpcNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9iYWtlcnktd2FzdGUtdG8tYmUtcHV0LXRvLXVzZS1hcy1zdXN0YWluYWJsZS1vaWxzLWFuZC1mYXRzLWluLW5ldy1wYXJ0bmVyc2hpcNIBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9iYWtlcnktd2FzdGUtdG8tYmUtcHV0LXRvLXVzZS1hcy1zdXN0YWluYWJsZS1vaWxzLWFuZC1mYXRzLWluLW5ldy1wYXJ0bmVyc2hpcNIBAA","guidislink":false,"published":"Wed, 29 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9iYWtlcnktd2FzdGUtdG8tYmUtcHV0LXRvLXVzZS1hcy1zdXN0YWluYWJsZS1vaWxzLWFuZC1mYXRzLWluLW5ldy1wYXJ0bmVyc2hpcNIBAA?oc=5\" target=\"_blank\">Bakery waste to be put to use as sustainable oils and fats in new partnership<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bakery waste to be put to use as sustainable oils and fats in new partnership - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8yOS9iYWtlcnktd2FzdGUtdG8tYmUtcHV0LXRvLXVzZS1hcy1zdXN0YWluYWJsZS1vaWxzLWFuZC1mYXRzLWluLW5ldy1wYXJ0bmVyc2hpcNIBAA?oc=5\" target=\"_blank\">Bakery waste to be put to use as sustainable oils and fats in new partnership<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Clean Food Group, a biotech company, will use Roberts Bakery’s surplus as a feedstock for its proprietary fermentation technology, creating oil and fat ingredients. The waste of bread ​ Food waste is, as in many other sectors, a significant problem in bakery. Some studies have suggested that almost one million tons of bread are lost from the supply chain every year. This level of food waste also creates a climate problem, releasing significant amounts of greenhouse gas. “Wheat, the major proponent in most bread, has a considerable greenhouse footprint due to the considerable quantity of fertilizers required and farming practices needed as part of the cultivation process​,” Professor Chris Chuck, Co-founder of Clean Food Group, told FoodNavigator. “Producing more bread than is needed results in excessive use of fertilizer. Additionally, the disposal of bread at any stage of the process leads to higher quantities of methane gas as a result of food decomposing in landfills​.” The partnership between the two companies sees Clean Food Group aiming to utilise the waste provided by Roberts Bakery, reducing greenhouse gas emissions in the process. “By keeping waste bread out of landfills,”​ Professor Chuck told us, “less methane will be produced. The technology also allows us to produce more food products, more efficiently, without an increase in land use. Effectively getting more edible products per hectare of wheat grown​.” Making use of the waste​ The fermentation process will transform the waste products into oils and fats, which can be used for replacements for other products. For example, the oil can be used to replace palm oil. “The edible oils produced from our yeast process, fed on the bread waste hydrolysate produce an oil structurally equivalent to a high oleic palm oil​,” Professor Chuck told us. “The oils can be used as a like-for-like, direct replacement with the same nutritional functionality​.” Roberts Bakery will also be able to use the oils and glucose syrup created by the process in its own baked goods, essentially feeding its own waste back into its own products. “We have discovered that the one step processing of the bread waste makes an ideal fermentation feedstock​,” Professor Chuck told us, “which could be used to feed other types of fermentation. However, the yeast we have developed to produce a palm oil substitute is especially well suited to use all the components of the bread waste once it has been hydrolysed​.”","filter_flag":1}
{"title":"Simplifying R&D: tech solutions for faster and more efficient NPD - CosmeticsDesign-Europe.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMS8xMC9zaW1wbGlmeWluZy1yLWQtdGVjaC1zb2x1dGlvbnMtZm9yLWZhc3Rlci1hbmQtbW9yZS1lZmZpY2llbnQtbnBk0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMS8xMC9zaW1wbGlmeWluZy1yLWQtdGVjaC1zb2x1dGlvbnMtZm9yLWZhc3Rlci1hbmQtbW9yZS1lZmZpY2llbnQtbnBk0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMS8xMC9zaW1wbGlmeWluZy1yLWQtdGVjaC1zb2x1dGlvbnMtZm9yLWZhc3Rlci1hbmQtbW9yZS1lZmZpY2llbnQtbnBk0gEA","guidislink":false,"published":"Fri, 10 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=314, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMS8xMC9zaW1wbGlmeWluZy1yLWQtdGVjaC1zb2x1dGlvbnMtZm9yLWZhc3Rlci1hbmQtbW9yZS1lZmZpY2llbnQtbnBk0gEA?oc=5\" target=\"_blank\">Simplifying R&amp;D: tech solutions for faster and more efficient NPD<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Simplifying R&D: tech solutions for faster and more efficient NPD - CosmeticsDesign-Europe.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMS8xMC9zaW1wbGlmeWluZy1yLWQtdGVjaC1zb2x1dGlvbnMtZm9yLWZhc3Rlci1hbmQtbW9yZS1lZmZpY2llbnQtbnBk0gEA?oc=5\" target=\"_blank\">Simplifying R&amp;D: tech solutions for faster and more efficient NPD<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-europe.com","source.title":"CosmeticsDesign-Europe.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The increased pressures to quickly get new products on the market, combined with never-ending regulations changes and demand for sustainability transparency throughout the supply chain, means that many R&D professionals are working longer hours to meet these needs. Of course, there’s a lot to consider when creating a brand new beauty or personal care product. You need inventiveness in terms of product claims, composition and application properties, balanced out with the assurances of repeatable manufacturing, product stability, microbiological purity\/safety of the product application, along with ensuring there's evidence of the claimed effect. It's no wonder that a plethora of tech solutions have recently launched to assist R&D experts in their role. R&D assistant tools to futureproof products​ One such tool is CosmetoSAFE Assist, a proprietary tool to support the work of technologists, product documentation specialists, regulatory departments, and product managers. CosmetoSAFE claims the tool can help professionals halve the time they spend on cosmetic product documentation by automating product documentation (PIF), concentration calculations or price calculations, making the management of formulations, raw material documentation and related information more efficient; assessing compliance with the requirements for marketing statements; and enabling the tracking of blacklists and information on banned substances. Meanwhile, Sahas Dendukuri, who was previously an AI researcher at Apple and the University of Michigan, has recently built a new AI-powered software called Cosmex, which is designed to help cosmetic chemists and manufacturers formulate safer products faster. The AI software tool for cosmetic chemists, formulators, brands and contract manufacturers is designed to instantly validate cosmetic product formulas against numerous regulatory and retailer standards. According to Dendukuri, it can greatly enhance productivity by screening multiple targeted regulatory standards in the US and EU, as well as retailer Clean Beauty standards from the likes of Sephora, Ulta and Target. Users enter the cosmetic ingredient and percentages then select the standards to immediately determine if the formula is regulatory and retailer-standard compliant. The tool screens a data set of over 30,000 cosmetic ingredients and will also instantly flag any problematic ingredients and percentages if the formulation is not compliant and will provide information on the issues and recommended corrective actions. Dendukuri believes that using a tool like this will result in increased transparency for the industry. “Companies will be able to get a much better understanding of regulations and clean beauty standards and how their products stack up against them,” ​he explained. “The ease of checking requirements across multiple countries and retailers at once also means that companies can more easily future proof their products. They can think about launching their products in multiple retailers and regions from the beginning rather than having to reformulate down the line when expanding their presence,”​ he continued. ​ “MoCRA is something the industry is tracking closely and we've gotten a lot of requests for tooling around it. For that reason, we're launching a new module on Cosmex this month that'll help with product listing and adverse event reporting with the FDA.”​ P&G: using AI software for scent development​ Beauty and personal care multinational Procter & Gamble recently announced that is using Moodify White – an AI-based fragrance design software solution – for fragrance development. The business has started to harness Moodify's capabilities for malodour control based on digital scent creation, marking a huge shift for the company to use AI technology to enhance its product development, design and speed to market. Jerry Porter, Chief R&D and Innovation Officer, Fabric & Home Care, Flavour & Fragrances at Procter & Gamble said the decision was: “a significant step in our digital transformation agenda, emphasising the use of digital tools to improve the use of fragrance in products.” ​ Meanwhile, Univar Solutions has just launched BeautyLAB this week – a lab-focused global initiative that was developed to identify solutions to today’s formulation challenges. BeautyLAB’s technical experts use ingredients from its suppliers to help customers better understand product efficacy, quality, formulation challenges, and more. The company has also created special digital content on its website and channels to help its customers and suppliers navigate the complex world of beauty and support product development needs. AI tools can support ESG policies ​ In an era of heightened environmental awareness and evolving ESG priorities, R&D experts must also integrate environmentally friendly, ethical practices and transparent governance to meet consumers' wants and needs. One such tool that can help with this is MaterialsZone, which can be used at the R&D stages. The platform incorporates AI and claims to help researchers reduce the number of trial-and-error experiments that often result in unnecessary waste, for a more efficient R&D process and a shorter time to market for new products According to its CEO and co-founder, Dr Assaf Anderson, by incorporating ESG from the R&D stages, businesses will be able to create a ripple effect and reduce the environmental footprint of the entire manufacturing industry significantly. Another example of a tool for ESG purposes is BASF’s D’lite, which claims to help simplify sustainability work in the laboratory and save time when repositioning in the market. The digital service is constantly being developed and supplemented with new components that enable formulators to efficiently develop sustainable products. BASF has integrated the Product Carbon Footprints (PCF) of its personal care portfolio into the digital service to help customers gain insights into the total greenhouse gas emissions generated by the products they purchase from the ingredients’ supplier. Its PCF calculations are based on greenhouse gas emissions from its own plants, as well as high-quality average data for purchased raw materials and purchased energy using a methodology that’s in line with the relevant international standard ISO 14067:2018. It also includes various sustainability-related aspects to offer its customers the transparency they need to design formulations in line with the label from the outset, as well as reports on certifications such as EU Ecolabel, COSMOS and NATRUE.","filter_flag":1}
{"title":"Vineyards of the future will produce more than wine - European Union","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vcHJvamVjdHMucmVzZWFyY2gtYW5kLWlubm92YXRpb24uZWMuZXVyb3BhLmV1L2VuL2hvcml6b24tbWFnYXppbmUvdmluZXlhcmRzLWZ1dHVyZS13aWxsLXByb2R1Y2UtbW9yZS13aW5l0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vcHJvamVjdHMucmVzZWFyY2gtYW5kLWlubm92YXRpb24uZWMuZXVyb3BhLmV1L2VuL2hvcml6b24tbWFnYXppbmUvdmluZXlhcmRzLWZ1dHVyZS13aWxsLXByb2R1Y2UtbW9yZS13aW5l0gEA?oc=5","id":"CBMicWh0dHBzOi8vcHJvamVjdHMucmVzZWFyY2gtYW5kLWlubm92YXRpb24uZWMuZXVyb3BhLmV1L2VuL2hvcml6b24tbWFnYXppbmUvdmluZXlhcmRzLWZ1dHVyZS13aWxsLXByb2R1Y2UtbW9yZS13aW5l0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vcHJvamVjdHMucmVzZWFyY2gtYW5kLWlubm92YXRpb24uZWMuZXVyb3BhLmV1L2VuL2hvcml6b24tbWFnYXppbmUvdmluZXlhcmRzLWZ1dHVyZS13aWxsLXByb2R1Y2UtbW9yZS13aW5l0gEA?oc=5\" target=\"_blank\">Vineyards of the future will produce more than wine<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Union<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vineyards of the future will produce more than wine - European Union","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vcHJvamVjdHMucmVzZWFyY2gtYW5kLWlubm92YXRpb24uZWMuZXVyb3BhLmV1L2VuL2hvcml6b24tbWFnYXppbmUvdmluZXlhcmRzLWZ1dHVyZS13aWxsLXByb2R1Y2UtbW9yZS13aW5l0gEA?oc=5\" target=\"_blank\">Vineyards of the future will produce more than wine<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Union<\/font>","source.href":"https:\/\/projects.research-and-innovation.ec.europa.eu","source.title":"European Union","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In Palmela, a wine region near Portugal’s capital Lisbon, Miguel Cachão is focused on an unusual aspect of the autumn harvest. He’s developing a technology for wineries to capture carbon dioxide and use it to grow algae. The CO2, produced when grape juice ferments, can cultivate a nutrient-rich freshwater algae called chlorella that has uses in animal feed, cosmetics, food supplements and wine production. Economic, cultural motives Winegrowers across Europe face twin squeezes from extreme weather caused by climate change and from heightened overseas competition. In Portugal, side income for the wine industry would also have cultural significance. ‘It’s such a big part of people’s lives, so even if a vineyard isn’t big or profitable, it’s important for them to keep producing,’ said Cachão, an agronomic engineer at the Association of Wine Growers of the Municipality of Palmela. The Portuguese drink more wine per person than anyone else in the world, according to a 2021 study. Communities in the country have a strong bond with their local vineyards going back generations. The EU itself is the world’s top producer of wine, accounting for almost half of global wine-growing areas in 2020. Portugal, with its renowned full-bodied Douro reds and fresh Vinho Verde whites, ranks as Europe’s fifth-biggest wine producer. Finding an extra source of income could save wineries in Europe from closure. Algae profits Cachão leads a research project that received EU funding to pioneer the technique of using CO2 to grow chlorella at wineries. Chlorella is a type of green algae whose photosynthetic qualities make it a source of food and energy. It’s also rich in antioxidants useful for the cosmetics industry. Chlorella needs CO2, sunlight and water to grow. It converts sunlight into chemical energy needed to make carbohydrates, proteins and other compounds. The process could generate more than €15 million a year for a winery with annual volumes of at least 7 million litres of wine – the amount of a large European producer. “ The algae importantly locks the CO2 in. Miguel Cachão, REDWine It could also cut wine producers’ greenhouse-gas emissions by at least 30%, according to the project. Called REDWine, it runs for four years until the end of April 2025 and is part of an initiative by the EU and industry called the Circular Bio-based Europe Joint Undertaking, or CBE JU. The first demonstration unit will be ready at the end of 2023, according to Cachão, who coordinates REDWine. It will be built about 100 metres from a local winery. A pipe will transport CO2 from the winery’s grape-fermentation tanks to the unit for compression. The CO2 will then be liquefied for storage and be ready for use in growing chlorella. ‘My hope is that we can show it’s viable for wineries of all sizes – small, medium and large – to use,’ he said. Some wineries in Europe and elsewhere already capture CO2 and use it to protect their newly harvested grapes from oxidation, a process that can affect the final colour and aroma of wine. They also convert it into calcium carbonate to reduce the acidity of soil. Locked-in CO2 But with both of these processes, the CO2 ends up back in the atmosphere, according to Cachão. ‘The algae importantly locks the CO2 in,’ he said. REDWine involves 12 companies and other organisations in six countries: France, Germany, Ireland, the Netherlands, Portugal and Spain. The participating companies include Algama, a French maker of foods from algae, and Spain-based Lipotec, a specialist in active ingredients for cosmetics. Skins and seeds Other potentially useful elements in winemaking are the leftovers from pressed grapes: the skins, pulp and seeds. They’re full of naturally occurring chemicals that protect the grapes from sun damage and pests. “ We can extract this arsenal of compounds and make useful products. Professor Marta Lores, NeoGiANT Grape skins, pulp and seeds offer the prospect of healthy alternatives to antibiotics. An EU-funded research project called NeoGiANT is developing natural therapies to help curb the use of antibiotics on animal and fish farms. The project reflects growing concerns that resistance to antibiotics in animals and people is growing as a result of overuse in livestock and aquaculture. ‘Using them in healthy animals to prevent disease and infection – and not just as a treatment – has resulted in one of the biggest problems of our day: antibiotic resistance,’ said Marta Lores, a professor of analytical chemistry at the University of Santiago de Compostela in Spain. Antibiotic substitutes She coordinates NeoGiANT, which runs for four years through September 2025 and brings together universities, research institutes, farming representatives and companies from nine countries. Partners come from Belgium, the Czech Republic, Germany, Hungary, Poland, Portugal and Spain and – outside the EU – Argentina and the UK. Antimicrobial resistance occurs when bacteria, viruses, fungi and parasites change over time and no longer respond to medicines, making infections harder to treat and increasing the risk of disease spread, severe illness and death, according to the World Health Organization. The NeoGiANT researchers are extracting antioxidants and eubiotics – additives that improve the gut health of animals – to use in feed. The goal is to make animals more resilient to infection and disease. ‘We can extract this arsenal of compounds and make useful products from them,’ said Lores. The grape waste is also yielding treatments for some of the most common animal diseases including mastitis – a mammary gland inflammation – in cows, post-weaning diarrhoea in pigs and a skin disease called exudative epidermitis in piglets. These are currently mainly treated using antibiotics. In addition, the project aims to substitute antibiotics for antimicrobial extracts in semen extenders. These are preservatives that prolong the life of semen collected for artificial insemination in livestock farming. If all these compounds are successful, 12 new products will be ready for market by the end of the project. Lores expects most of the planned products to be successful. But she said that, even if the total ends up being less than a dozen, the research effort will have been worthwhile. ‘If only one of the products is marketed, that will mean fewer antibiotics used,’ Lores said. ‘In the end, all will benefit. The healthier the livestock, the healthier the food humans are eating.’ Research in this article was funded by the EU. The views of the interviewees don’t necessarily reflect those of the European Commission. If you liked this article, please consider sharing it on social media.","filter_flag":1}
{"title":"CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5","id":"CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5\" target=\"_blank\">CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4ODA3MS01LWV4YW1wbGVzLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1zb2x1dGlvbnMtaW5kdXN0cnktY29udHJpYnV0ZS1jaXJjdWxhctIBAA?oc=5\" target=\"_blank\">CSRWire - 5 Examples of Sustainable Packaging Solutions for the Industry That Contribute to the Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Published 11-09-23 Submitted by Henkel In this story, you'll learn: Produce, use, reuse – by 2025, we want to design and develop 100 percent of Henkel's packaging so that it can be reused or recycled as completely as possible.1 This is because we want to continuously contribute to ensuring that all packaging waste is properly disposed of and recycled, and thus does not end up in the environment. To this end, our experts are working on optimizing secondary and transport packaging and the associated logistics. We want to replace the linear economic model of \"produce, use, dispose\" and keep materials in the material cycle for longer. ₁ With the exception of products where components or residues may affect recyclability or contaminate recycling streams. We are convinced that we need strong partnerships to drive sustainable development. It's not just about making our business more sustainable, but helping our customers and stakeholders comply with regulatory requirements and achieve their own sustainability goals. That's why we work with customers and suppliers in strategic partnerships along the entire value chain to jointly design and develop efficient sustainable solutions. Pernille Lind Olsen, CSVP Packaging & Consumer Goods at Henkel For a sustainable economy, the recyclability of packaging is an important lever for making resources reusable several times over and transferring them to new products. After all, eliminating packaging completely is not a solution either – it protects the quality and performance of our products and enables safe use and disposal. In line with the 12th Sustainability Development Goal (SDG), which calls for sustainable consumption and production patterns, our experts at Henkel are rethinking packaging concepts along the circular value chain – for Henkel and for the industry. Our packaging expertise reaches back to 1922 when we first started producing paper, cardboard and packaging adhesives for our own use. What started small, has since developed into a global success story, shaping industries and consumers’ lives through the decades. Today we are applying our know-how to enable intelligent packaging design for the circular economy and to reduce both packaging material and waste with the help of sustainable solutions. Here we show how Henkel Adhesive Technologies creates sustainable industrial solutions and thus contributes to the circular economy, using five examples. 1. Debonding for recycling processes appropriate to the material Establishing sustainable practices is important at home and in industry – and can start with proper waste separation. Products and packaging can only be recycled in a material-friendly way if we separate the individual materials from one another – at home, for example, this means separating the aluminum lid from the plastic yogurt pot before throwing both into the recycling can. But separating different materials is not always quite as simple as with the yogurt pot. Multilayer flexible packaging in particular presents a challenge. This is where the so-called debonding process helps in waste processing. Debonding makes it possible to separate different materials that are not suitable for joint recycling and thus provides the basis for reusing and recycling product parts. Together with the start-up Saperatec, our experts at Henkel Adhesive Technologies have developed the Loctite Liofol solution specifically for recycling to enable debonding at the end of the value chain. In combination with the Saperatec process, this solution allows multilayer packaging to be separated from one another again, so that after separation the individual materials made of PE, aluminum and PET can be sorted and returned to the value chain as recyclable materials. EPIX technology gives shipping bags increased functionality by using lightweight cushioning material instead of bubble wrap to create an impact-resistant package without increasing the weight of the product. 2. More paper, less plastic – with EPIX and KeelClipTM Plastic packaging is often preferred to paper packaging because it is more robust against environmental influences and thus better protects sensitive products. Our experts at Henkel Adhesive Technologies have made it their business to design adhesive solutions that replace plastic and promote sustainable packaging alternatives – such as EPIX and KeelClipTM. From shipping bags to paper straws to food packaging, EPIX technology makes paper a true alternative to plastic for popular disposable materials. EPIX extends the functionality of paper by adding features to paper products such as barrier properties, thermal insulation, and resistance to mechanical impact. For example, paper packaging with EPIX is better protected against water and grease penetration. The improved thermal insulation properties also make the technology highly suitable in the production of takeaway beverage cups: Double-walled cups offer higher temperature resistance for both hot and cold beverages thanks to EPIX. Best of all, paper packaging with EPIX can still be recycled. KeelClipTM, a solution developed by Graphic Packaging International (GPI) using adhesive technologies from Henkel Adhesive Technologies, also proves that it doesn't always have to be plastic. KeelClipTM represents a sustainable option for the outer packaging of beverage cans. The technology not only reduces plastic, but also saves CO 2 emissions in the life cycle of the packaging. Unlike plastic films or plastic rings that otherwise hold beverage cans together, with KeelClip this task is performed by recycled and recyclable cardboard – supported by our adhesive solutions. KeelClipTM can replace plastic film and plastic rings in the multi-packaging of beverage cans, increasing the recyclability of the packaging and reducing plastic waste. 3. Bio-based adhesives for more environmentally friendly food packaging Functional, safe and sustainable – that's how we want packaging in the food industry to be. The Technomelt Supra Eco hotmelt adhesive developed by our adhesives experts not only meets the strict packaging guidelines for food, but also has a significantly reduced carbon footprint. The adhesive solutions in the range are made from up to 98% biomass and can be used for a wide range of packaging. The carbon footprint of the Technomelt Supra Eco range and its raw material sourcing are also fully traceable. This helps not only us, but also our customers to keep track of their CO 2 emissions, so that together we can drive a sustainable industry. And without compromising on the performance of the adhesive product. A win-win solution for the packaging industry and sustainability. 4. Gluing instead of wrapping In logistics, it is common for goods to be stacked in large paper cartons on wooden pallets to be prepared for transport and storage. To ensure that the goods can be transported safely within the supply chain, the cartons are often wrapped with a plastic film. This prevents the goods from falling off the pallet during transport or storage. Our adhesives experts have found a solution to reduce this film consumption in palletizing by up to 90%. The Technomelt Supra PS Hotmelts adhesive solution from Henkel Adhesive Technologies can be used to secure cartons to each other and to the pallet – making safe transport and storage no problem. Only 0.15 grams per carton is required and the adhesive remains stable even in very hot or cold conditions – ideal for temperature differences in supply chains. This eliminates the need for conventional stretch film, which is usually wrapped around the cartons on the pallet and saves a lot of plastic. Another advantage? Subsequent depalletizing is not only easier, but also takes far less time. In addition to cartons, the adhesive is also suitable for PET bottles, metal cans and many other goods, making it a real gamechanger in the packaging industry. Our adhesive solution Technomelt Supra PS Hotmelts is a sustainable alternative to stretch film and can reduce film consumption in palletizing by 90%. 5. Achieving goals together – with the cyclos-htp institute Together with our strategic partners, we achieve our sustainability ambitions much faster. One example is our partnership with the cyclos-htp Institute (CHI). The partnership enables us to link two critical components of the packaging and consumer goods value chain: Adhesives and coatings, and recycling expertise. CHI specializes in testing, evaluating and certifying packaging for recyclability. CHI's certification process determines the recyclability of packaging based on the amount of recovered recycled material (paper fiber) available to produce the starting material (new paper). Building on the generally accepted CHI test methods, it acts as a neutral testing and certification body and, through its partnership with Henkel, can offer its services to a broader customer base. CHI's rigorous evaluation and certification thereby supports the performance and sustainability of product concepts. With the institute's expertise and advice, we can further improve our packaging and adhesive solutions, integrate the recyclability of our products and solutions earlier in the design process, and strengthen sustainability in the industry together with our customers.","filter_flag":1}
{"title":"14 Vegan Thanksgiving Roasts for Your Plant-Based Feast - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdmVnbmV3cy5jb20vYmVzdC12ZWdhbi1yb2FzdHMtdGhhbmtzZ2l2aW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdmVnbmV3cy5jb20vYmVzdC12ZWdhbi1yb2FzdHMtdGhhbmtzZ2l2aW5n0gEA?oc=5","id":"CBMiMmh0dHBzOi8vdmVnbmV3cy5jb20vYmVzdC12ZWdhbi1yb2FzdHMtdGhhbmtzZ2l2aW5n0gEA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdmVnbmV3cy5jb20vYmVzdC12ZWdhbi1yb2FzdHMtdGhhbmtzZ2l2aW5n0gEA?oc=5\" target=\"_blank\">14 Vegan Thanksgiving Roasts for Your Plant-Based Feast<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"14 Vegan Thanksgiving Roasts for Your Plant-Based Feast - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdmVnbmV3cy5jb20vYmVzdC12ZWdhbi1yb2FzdHMtdGhhbmtzZ2l2aW5n0gEA?oc=5\" target=\"_blank\">14 Vegan Thanksgiving Roasts for Your Plant-Based Feast<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"There was once a time when vegan holiday meals were extremely limited. Years ago, when celebrating amongst a mixed company of eaters, vegans had to make their own plant-based feast or scavenge through the few veggie sides that didn’t include butter, cream, or meat drippings. But vegan Thanksgiving roasts are making the feast a lot easier. The vegan food market has dramatically evolved since then and vegan holiday roasts start hitting mainstream shelves as early as mid-October. We’ve tasted them all and even tried our hand at making our own with the guidance of a few brilliant recipes. Whether you opt for store-bought or don an apron, here is your guide to the vegan holiday roasts everyone will enjoy. Keep turkey off the table this Thanksgiving Traditionally, turkey is served as the main dish on Thanksgiving. In 2021, one poll by CBS News noted that two in three Americans eat the bird for their main course. This means that every year, approximately 46 million turkeys are slaughtered in the run-up to the holiday. Most will have spent their lives on factory farms in cramped, industrialized conditions. These farms are also an environmental nightmare. Every year, animal agriculture accounts for around 14.5 percent of global greenhouse gas emissions, which is more than the entire aviation industry. Jonathan Cooper\/Unsplash Those who attempt to make a more sustainable choice by purchasing from small family farms also contribute a significant climate footprint, as these birds are often raised and killed in middle America, packaged, and shipped via planes, trains, and automobiles to homes across the country. In short, there is no such thing as an ethically slaughtered turkey, and there is no such thing as sustainable poultry. However, it’s easier than ever to leave turkey off the table this Thanksgiving. Not only is this a more compassionate decision, but it’s also better for the planet, too. What are vegan Thanksgiving roasts made from? The vegan Thanksgiving roast options have largely expanded from the inaugural Tofurky debut in 1997, but the vast majority of them have stuck to the original ingredients. Seitan—a “meaty” plant-based food made from vital wheat gluten—and tofu are two of the most heavily used products to create the succulent plant-based roasts that are featured on many a vegan table. Most roasts are seasoned with spices such as thyme, sage, and rosemary, then stuffed with a wild rice or savory stuffing mixture. Tofurky Like turkey, they’re high in protein and often contain fair amounts of calories and fats. For example, a single serving of the original Tofurky contains 300 calories, 10 grams of fat, and 33 grams of plant-based protein. Vegan Thanksgiving roasts to buy We’ve listed several excellent homemade roast recipes farther down, but these are generally for the patient and adventurous cook. Those who prefer a heat-and-eat option should look to any one of these 10 fabulous store-bought vegan roasts. Tofurky 1 Tofurky Founded in 1979, Tofurky is a veteran in the vegan roast market. The all-natural, plant-based company launched commercial production of its signature Tofurky Holiday Roast in 1995 and built a loyal fanbase throughout the decades. The tender, savory roast is made of seasoned seitan and tofu, giving it a meaty chew and satisfying taste. The round is filled with wild rice and breadcrumb stuffing and comes with a side of vegan gravy. Beyond the original, Tofurky fans can opt for the seasonal Ham Roast with Amber Ale Glaze. If you’re a fan of Tofurky products, you won’t want to overlook this belly-satisfying holiday roast. Find it here Gardein 2 Gardein Like Tofurky, Gardein is another company that helped to popularize plant-based meat. Come holiday season, Gardein offers two outstanding main meal options. The brand’s more traditional Holiday Roast is large enough to serve eight and includes a cranberry wild rice stuffing and homestyle gravy. For smaller celebrations, opt for the Savory Stuffed Turk’y. This option includes two individual-sized breaded Turk’y roasts that are crispy on the outside and tender on the inside. Each is filled with cranberry wild rice stuffing and the box includes gravy, too. Pick up the Turk’y if it’s just for you or choose the Roast to feed a crowd. Find it here The Herbivorous Butcher 3 The Herbivorous Butcher Based in Minneapolis, MN, The Herbivorous Butcher has garnered national attention. The growing brother-and-sister-run company was even featured on the Food Network’s hit show, Diners, Drive-Ins, and Dives. The Turkey-Free Feast ships nationwide and contains an assortment of vegan holiday meats and cheeses including a 2.5-pound stuffed turkey, maple bacon, cranberry brie, Butternut Squasage, mac sauce, and Roads End Organics Quick Gravy. An unstuffed turkey roast, meatloaves, and a wide selection of cheeses are also available to purchase and ship à la carte. Find it here Field Roast 4 Field Roast This cult favorite brand offers three plant-based roast options perfect for any vegan Thanksgiving dinner. The Celebration Roast is crafted with sage, garlic, and bread stuffing. A savory porcini mushroom gravy ties it all together for one delectable holiday main. The Sage and Garlic roast is made with butternut squash, onions, and lentils. Field Roast’s Hazelnut and Cranberry Plant-Based Roast features hazelnut-infused vegan meat stuffed with rosemary, candied ginger, and sausage stuffing, all encased in a layer of buttery, flaky puff pastry. The company’s three options are equally appealing, just with different flavor notes. Can’t decide between all three? Get them all. They freeze well. Find it here Native Foods 5 Native Foods The beloved Original Native Foods Wellington isn’t a roast—it’s better. The puff pastry-encased main is layered with juicy seitan, sliced sweet potatoes, savory stuffing, tart cranberries, and tender steamed kale. It comes with a side of mushroom gravy, but the Wellington is so moist and flavorful on its own that you really don’t need it. Stock up for Friendsgiving, Thanksgiving, Christmas, and any other winter celebration you can imagine. Note the Wellington is available at all locations except for Glendale, CO. Find it here Sol Cuisine 6 Sol Cuisine Canadian Thanksgiving has passed, but this limited-edition Stuffed Turk’y Roast with Gravy can certainly be served for the winter holidays. This juicy, breaded seitan centerpiece is packed with cranberry-studded stuffing and is best served in a pool of warm, silky gravy. While some Sol Cuisine products are available in the US, this latest item is only available in Canadian stores. Get the recipe VegNews 7 Whole Foods Market Decided to throw a last-minute Friendsgiving? Head to the freezer aisle and pick up a 365 by Whole Foods Market Plant-Based Roast. The breaded, seitan-based centerpiece is filled with cranberry-speckled stuffing and includes a packet of vegan gravy. This vegan-friendly grocer is also offering a comprehensive vegan meal for two that includes a mushroom and root vegetable en croûte with mushroom gravy, sea salt and cracked black pepper green beans, roasted butternut squash with cranberries and sage, roasted fingerlings with garlic and parsley, and pumpkin curry soup. If you prefer this latter option, remember to order in advance. Find it here Vegetarian Plus 8 Vegetarian Plus Expect a few double-takes from your guests as you plant this golden vegan turkey on the table. It’s entirely plant-based, but it looks like a traditional bird right down to the golden crispy “skin.” Carve it up to reveal its juicy interior and serve with a side of tender stuffing and gravy—both included in the box. Find it here Three Girls Vegan Creamery 9 Three Girls Vegan Creamery Sink your teeth into this savory, chewy holiday roast. Crafted with a base of seitan, this filling main features herby stuffing made with apples and sausage. The roast comes with a side of mushroom gravy made in the “Italian culinary tradition” that fans of Three Girls Vegan Creamy can’t get enough of. Find it here Vegan Thanksgiving roast recipes to make Preparing your own vegan roast is ideal when hosting a potluck—you make the main and ask others to bring the sides. Here are five solid plant-based roast recipes to impress all your guests. Simon Smith 10Vegan Stuffed Squash Roast With Cranberry-Orange Sauce This vegetable-forward main is not a roast in the traditional sense. No one will take a bite and believe it’s meat. However, it’s a stunning and delicious centerpiece, and it’s roasted, so there you go. Playing off the grotesque yet popular Turducken trend, this more compassionate dish involves a fork-tender butternut squash stuffed with layers of wild rice, sauteed mushrooms, glazed onions, roasted red peppers, and lightly wilted spinach. Get the recipe LIke a Vegan 11Vegan Holiday Roast With Cranberry Walnut Stuffing If you prefer a meatier roast but don’t want to serve up any animals this Thanksgiving, this impressive vegan roast recipe will give you the best of both worlds. Made with a mix of vegan beef grounds and herbs, it’s satisfyingly meaty but 100 percent plant-based. Get the recipe 12Vegan Garlicky Herb-Roasted Whole Cauliflower Don’t underestimate the humble cauliflower. When roasted whole in a garlicky, cheesy, herbed oil, there’s no doubt that this former side vegetable will become the star of the Thanksgiving table. GET THE RECIPE 13Herbed Vegetable Roast With Garlic Mashed Potatoes Keep things simple this Thanksgiving by swapping out a big centerpiece for a plate of flavorful roasted vegetables, like red potatoes, baby carrots, portabello mushrooms, and butternut squash. Served with creamy garlic mash, they’re easy to make and bursting with flavor. GET THE RECIPE Sara Kiyo Popowa 14Vegan Roasted Sweet Basil Squash This roasted sweet basil squash might not be a traditional Thanksgiving dish, but when your guests try the buttery, intense, autumnal flavors, they’re guaranteed to be asking for it year after year. Serve with traditional side dishes, or change things up by offering wild rice and salad, instead. GET THE RECIPE","filter_flag":1}
{"title":"Chemical recycling of plastic not so fantastic, report finds - Mongabay.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8xMS9jaGVtaWNhbC1yZWN5Y2xpbmctb2YtcGxhc3RpYy1ub3Qtc28tZmFudGFzdGljLXJlcG9ydC1maW5kcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8xMS9jaGVtaWNhbC1yZWN5Y2xpbmctb2YtcGxhc3RpYy1ub3Qtc28tZmFudGFzdGljLXJlcG9ydC1maW5kcy_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8xMS9jaGVtaWNhbC1yZWN5Y2xpbmctb2YtcGxhc3RpYy1ub3Qtc28tZmFudGFzdGljLXJlcG9ydC1maW5kcy_SAQA","guidislink":false,"published":"Fri, 24 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=328, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8xMS9jaGVtaWNhbC1yZWN5Y2xpbmctb2YtcGxhc3RpYy1ub3Qtc28tZmFudGFzdGljLXJlcG9ydC1maW5kcy_SAQA?oc=5\" target=\"_blank\">Chemical recycling of plastic not so fantastic, report finds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mongabay.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chemical recycling of plastic not so fantastic, report finds - Mongabay.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8xMS9jaGVtaWNhbC1yZWN5Y2xpbmctb2YtcGxhc3RpYy1ub3Qtc28tZmFudGFzdGljLXJlcG9ydC1maW5kcy_SAQA?oc=5\" target=\"_blank\">Chemical recycling of plastic not so fantastic, report finds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mongabay.com<\/font>","source.href":"https:\/\/news.mongabay.com","source.title":"Mongabay.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A new report by NGOs International Pollutants Elimination Network (IPEN) and Beyond Plastics scrutinizes the chemical recycling industry that is on the rise in the U.S. and other parts of the world, including several European countries. Chemical recycling, also known as advanced recycling, is an umbrella term for industrial processes designed to use plastic waste as a feedstock to create fuel and new plastic products. While plastic producers and fossil fuel companies argue that chemical recycling presents a solution to the world’s plastic problem, environmentalists say chemical recycling is an unproven process that exacerbates the pollution problems it’s supposed to solve. In mid-November, negotiators met in Nairobi, Kenya, to discuss the global plastics treaty. Chemical recycling was not formally discussed, but critics are concerned that it may be a part of future treaty negotiations. In today’s industrialized world, avoiding plastic is virtually impossible. Every trip to the grocery store likely means coming home with food and household items packaged in plastic bottles, tubs and packaging. Order something online, and your product may arrive shrink-wrapped in plastic. Not only that, but plastic is often part or all of the product itself, be it kids’ toys, holiday decorations or one of our ubiquitous electronic devices. So, how does one responsibly dispose of all this plastic? The answer to that simple question is frustratingly complex. Many plastic products are marked with seemingly helpful recycling symbols, leading consumers to believe that most, if not all, plastic can be recycled. But that’s not the case. Traditional recycling — the process of breaking down, melting and remolding plastic to form new products — is expensive, time-consuming and limited to certain plastic types. In the U.S., for example, only types 1 and 2 are easily recyclable, while 3 through 7 aren’t. Recycling rates are also historically low; in the U.S., it’s estimated that only 5-6% of plastic is recycled. There’s another way to deal with plastic waste, according to the world’s big petrochemical companies: It’s called “chemical recycling,” or “advanced recycling,” an industrial process that the industry claims could recycle more types of plastics and help humanity transition to a circular economy. However, according to a recent report released by Swedish nonprofit International Pollutants Elimination Network (IPEN) and U.S.-based NGO Beyond Plastics, most chemical recycling claims have yet to be proven, while existing chemical recycling facilities are exacerbating the pollution problem they’re supposedly trying to solve. All this is happening against the backdrop of ongoing negotiations for a binding international plastics treaty that would reduce plastic pollution across its entire lifecycle. This type of treaty is also a regulatory process that fossil fuel and petrochemical companies and oil-producing states are resisting. Chemical recycling: Recycling solution or greenwashing? The IPEN and Beyond Plastics report suggests that chemical recycling is not really recycling at all. Instead, it’s an “umbrella term for a range of technologies that use heat or chemicals (or both) to break down the polymer chains in plastic waste to create ‘output.’” Two main chemical recycling processes are in use today: pyrolysis, which heats waste without oxygen at very high temperatures; and gasification, the heating of waste in a low-oxygen environment. In most cases, the output is fuel, although chemical recycling can also generate feedstock for new plastic products, according to the petrochemical industry. However, the report’s authors write that most chemical recycling facilities in operation today produce very little usable plastic feedstock despite creating no shortage of hazardous waste that damages the environment and threatens human health and safety. “We’re seeing this technology hyped [by the plastics industry] as a solution to the plastic crisis, and it’s no such thing,” Lee Bell, the report’s lead author and IPEN’s policy advisor for persistent organic pollutants (POPs), told Mongabay in an interview. “It won’t deal with very much of the plastic waste that has been generated at all. So my concern is we’re being misled into … a false solution, and that there are many regulators and decision-makers and policymakers who are confused about this.” A world brimming with plastic The world is desperately in need of effective plastic solutions. About 430 million metric tons of plastic are produced per year, according to the United Nations Environment Programme. That’s 75 times as heavy as the Great Pyramid of Gîza. Most of this plastic is used only briefly and then discarded, often improperly. An estimated 2,000 garbage trucks full of plastic are dumped into the world’s oceans, lakes and rivers every day. The problem is set to get far worse. If the plastics industry is permitted to continue growing without significant regulation, plastic production may nearly triple in the next 40 years, from about 460 million metric tons in 2019 to 1.23 billion metric tons by 2060. The planet has already become so inundated with pollution from plastics and other synthetic chemicals that scientists say we’ve breached a critical “boundary.” This assertion is based on the planetary boundaries theory, which argues that Earth has nine key operating systems that enable life to thrive. However, each of these systems has a boundary threshold — or thresholds — that, if crossed, can destabilize Earth’s “safe operating space.” Plastic pollution is considered part of the “novel entities” boundary, and scientists say that this one, along with five other boundaries, including climate change and biosphere integrity, has been crossed. Plastic producers and fossil fuel companies argue that chemical recycling presents a solution to the world’s plastic problem since it is intended to process plastics that can’t traditionally be recycled, keeping them out of the environment. The report’s authors counter that chemical recycling is a “risky” business. According to research they reference, chemical recycling processes create large amounts of toxic waste and toxic emissions that can cause significant human health problems, while the facilities themselves have been prone to fires and explosions. Additionally, they say the greenhouse gas emissions from chemical recycling processes contributes to the acceleration of climate change. The authors write that these processes, far from offering a solution, can “create as much as 100 times more damaging environmental and climate impacts than virgin plastic production,” which seriously calls into question the efficiency and environmental benefit of chemical recycling. Ross Eisenberg, the president of America’s Plastic Makers, an arm of the American Chemistry Council (ACC), a plastic industry association based in Washington, D.C., takes a different view. He argues that chemical recycling activities are strictly monitored and provide a way to “build a more sustainable and lower carbon future.” “It is unfortunate that organizations like Beyond Plastics and IPEN, that have never visited a chemical recycling facility, perpetuate misleading allegations about technologies that are helping reduce plastic waste and minimize environmental impacts,” Eisenberg told Mongabay in an emailed statement. “However, it’s not surprising that a group that publicly disavows all plastic recycling would construct its own set of ‘findings’ to spread false information on chemical recycling technologies.” Eisenberg also referenced a study conducted by the Argonne National Laboratory, a U.S. government-funded research and development center in Illinois, that found that chemical recycling engaged in pyrolysis oil production generated an 18% to 23% decrease in greenhouse gas emissions and also decreased fossil energy use, water use and solid waste. However, as Lee explained in a subsequent email, this particular study relies on industry data and doesn’t “address or characterize the toxicity of solid waste, atmospheric emissions or other hazardous releases from the pyrolysis process,” which is a key criticism of chemical recycling in the IPEN and Beyond Plastics report. He said the Argonne study also doesn’t note that pyrolysis oil is usually loaded with contaminants, making it “unsuitable” for plastic production and refineries, and that it requires dilution with virgin petrochemicals, which makes the pyrolysis process “neither sustainable [nor] circular.” “The Argonne paper does nothing to rebut our position that chemical recycling will, at best, deliver only a marginal contribution to plastic recycling (and plastic pollution) and any recycling benefits will likely be outweighed by the negative impacts of hazardous emissions, wastes and contaminated product from chemical recycling,” Lee said. A poor record of success? While investors have already spent billions of dollars to develop chemical recycling, the industry is not yet fully fledged. The ACC has advocated for the building of 150 chemical recycling plants across the U.S., but at present, there are only 11 constructed facilities in the country. Among them, four operate at a pilot or demonstration scale, and four others are partially operational. IPEN and Beyond Plastics analyzed company records, news sources and other information to provide details about these U.S. facilities in their report. At least seven of the facilities were found not to be operating at capacity or delivering what they had promised, with aims and goals still unmet and unproven. For instance, the report notes that a Brightmark Energy facility in Ashley, Indiana, predicted in June 2020 that it would “reach a yearly plastic waste recycling capacity of 100,000 tons by early 2021,” and the operation received $4 million in U.S. federal subsidies to help make this happen. However, the report notes that, to date, the plant has only processed about 2,000 tons of plastic waste, while it has been impacted by fires, oil spills and worker health and safety complaints. For the remaining four facilities, there is a paucity of publicly available information about their capacities and output. A proposed plant highlighted in the report has raised eyebrows for its potential threat to human health. Chevron intends to build a chemical recycling facility to turn waste plastic via pyrolysis into oil that can be refined into jet fuel. However, the U.S. Environmental Protection Agency found that the project had a public risk factor of 1 in 4 — a level 250,000 times greater than what is typically permitted. “This means that 25% of the local population would likely develop cancer in their lifetime as a result of exposure to the facility’s emissions,” the report’s authors write. Other potential plastics-to-fuel products connected to this proposed plant had even greater risks associated with them. Chemical recycling plants aren’t only popping up in the United States. There are already plants in the U.K. and several other countries in Europe, including Denmark, Netherlands, Germany, France, Belgium, Spain and Poland. But those facilities come with a difference, said Lauriane Veillard, the policy officer on chemical recycling and plastic-to-fuels at Zero Waste Europe, a Belgian NGO. While U.S. plants can claim to be “recycling” facilities, that isn’t the case for those that convert waste plastic to fuel in the U.K. and Europe. “In Europe, we still have safeguards to be sure that this production is not considered as recycling,” Veillard told Mongabay in an interview. However, she adds that the concerns regarding air pollution and contamination from these facilities are essentially the same for chemical recycling plants on both continents. “We see that chemical recycling is the solution to end the plastic waste crisis,” Veillard said. However, it’s important to consider humanity’s collective consumption patterns, she added. “A lot is put into recycling and improving it when solutions such as reuse, for example, that are directly tackling the issue of plastic waste, are completely [outside] of the discussion.” Chemical recycling: Will it rise or fall? Bell said he believes one reason chemical recycling has been able to progress without strong opposition and close scrutiny is because companies are not releasing adequate data, especially in relation to their toxic emissions and hazardous waste streams. “There is insufficient data being made available from the industry to determine its impacts,” Bell said. “What there is raises some red flags. But there’s nowhere near enough data being made available about its impact, or indeed, even its yield — that is, how much useful material it develops based on the amount of [plastic waste] input.” This lack of data and transparency can pose a problem for environmental regulators, policymakers and even investors who are enabling the rise of this industry, he said. At the same time, Bell believes policymakers are now becoming more aware of the risks associated with chemical recycling. He noted, for example, that government regulators who manage the Basel Convention on hazardous waste, which came into force in 1992, “recently rejected chemical recycling as an environmentally sound management technique to include in global plastic waste management guidelines.” “It was felt that chemical recycling is unproven,” Lee said. The petrochemical industry “could not demonstrate that it’s environmentally sound as a technique for managing plastic waste. And it was not agreed to include it in the global plastic waste treatment guidelines.” It remains to be seen whether chemical recycling will be included in the global plastics treaty, which is still under negotiation. Russia, Saudi Arabia and Iran, three states highly invested in the petrochemical industry, worked to stall progress on the treaty at the most recent set of meetings in Nairobi, Kenya, which concluded Nov. 19. Additionally, more than 140 lobbyists from the fossil fuel and petrochemical industries attended the meeting. Bjorn Beeler, the general manager and international coordinator for IPEN, who attended the recent sessions in Nairobi, said chemical recycling was not formally discussed and remains on the periphery. At the same time, however, “Everything is on the table with regards to the treaty,” he said. Banner image caption: A waste processing management facility and research center in Canada. Image by David Dodge\/Green Energy Futures via Flickr (CC BY-NC-SA 2.0). Elizabeth Claire Alberts is a senior staff writer for Mongabay. Follow her on Mastodon, @[email protected], and Blue Sky, @elizabethalberts.bsky.social.","filter_flag":1}
{"title":"Tonnes of cocoa in EU warehouses face being destroyed because of red tape regarding new deforestation law - ConfectioneryNews.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI3L1Rvbm5lcy1vZi1jb2NvYS1pbi1FVS13YXJlaG91c2VzLWZhY2UtYmVpbmctZGVzdHJveWVkLWJlY2F1c2Utb2YtcmVkLXRhcGUtcmVnYXJkaW5nLW5ldy1kZWZvcmVzdGF0aW9uLWxhd9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI3L1Rvbm5lcy1vZi1jb2NvYS1pbi1FVS13YXJlaG91c2VzLWZhY2UtYmVpbmctZGVzdHJveWVkLWJlY2F1c2Utb2YtcmVkLXRhcGUtcmVnYXJkaW5nLW5ldy1kZWZvcmVzdGF0aW9uLWxhd9IBAA?oc=5","id":"CBMingFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI3L1Rvbm5lcy1vZi1jb2NvYS1pbi1FVS13YXJlaG91c2VzLWZhY2UtYmVpbmctZGVzdHJveWVkLWJlY2F1c2Utb2YtcmVkLXRhcGUtcmVnYXJkaW5nLW5ldy1kZWZvcmVzdGF0aW9uLWxhd9IBAA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI3L1Rvbm5lcy1vZi1jb2NvYS1pbi1FVS13YXJlaG91c2VzLWZhY2UtYmVpbmctZGVzdHJveWVkLWJlY2F1c2Utb2YtcmVkLXRhcGUtcmVnYXJkaW5nLW5ldy1kZWZvcmVzdGF0aW9uLWxhd9IBAA?oc=5\" target=\"_blank\">Tonnes of cocoa in EU warehouses face being destroyed because of red tape regarding new deforestation law<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ConfectioneryNews.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tonnes of cocoa in EU warehouses face being destroyed because of red tape regarding new deforestation law - ConfectioneryNews.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5jb25mZWN0aW9uZXJ5bmV3cy5jb20vQXJ0aWNsZS8yMDIzLzExLzI3L1Rvbm5lcy1vZi1jb2NvYS1pbi1FVS13YXJlaG91c2VzLWZhY2UtYmVpbmctZGVzdHJveWVkLWJlY2F1c2Utb2YtcmVkLXRhcGUtcmVnYXJkaW5nLW5ldy1kZWZvcmVzdGF0aW9uLWxhd9IBAA?oc=5\" target=\"_blank\">Tonnes of cocoa in EU warehouses face being destroyed because of red tape regarding new deforestation law<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ConfectioneryNews.com<\/font>","source.href":"https:\/\/www.confectionerynews.com","source.title":"ConfectioneryNews.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The new regulation sets strong mandatory due diligence rules for companies that want to place relevant products on the EU market or export them. Operators and traders will have to prove that the products are both deforestation-free (produced on land that was not subject to deforestation after 31 December 2020) and legal (compliant with all relevant applicable laws in force in the country of production). When the new rules enter into force, all relevant companies will have to conduct strict due diligence if they place on the EU market, or export from it: palm oil, cattle, soy, coffee, cocoa, timber and rubber as well as derived products (such as beef, furniture, or chocolate). These commodities have been chosen on the basis of a thorough impact assessment identifying them as the main driver of deforestation due to agricultural expansion. Since the EU is a major economy and consumer of these commodities, regulation is meant to stop a significant share of global deforestation and forest degradation, in turn reducing greenhouse gas emissions and biodiversity loss. Once adopted and applied (at the end of 2024), the new law will ensure that a set of key goods placed on the EU market will no longer contribute to deforestation and forest degradation in the EU and elsewhere in the world. Futures trading platform ICE (Intercontinental Exchange), said in a white paper that clear guidance from Brussels and government agencies “will be a critical step​” to prevent the cocoa from being destroyed. Speaking to the Financial Times, Pamela Coke-Hamilton, executive director of the International Trade Centre, said. “If it lands on the market within the transition period that’s fine. But if it is held and released after the end of the transitional year, it may not be … it could be extremely difficult . . . [the goods] won’t be allowed in because [producers] wouldn’t have . . . done anything that would make it compliant with the new regulations​.” That means that producers would probably send it elsewhere “or dump it​”, she said. The new law is also in danger of disrupting the whole supply chain from already impoverished farmers in West Africa right up to retail and consumer level. Almost 70% of the world’s cocoa comes from Ghana and Cote d’Ivoire, where deforestation and other issues such as child labour have been a particular concern. Regulatory bodies in both countries have argued that the law will make it expensive and punitive to trade with EU countries. ICE has issued documents that claimed almost 200,000 metric tons of cocoa and 150,000 metric tons of coffee beans were held in ICE-licensed warehouses in European ports this summer. Nicolas Mounard, Barry Callebaut’s sustainability and farming director, acknowledged that the EU is the largest market for the chocolate and cocoa supplier and said the new regulations pose a significant financial risk without a clear agreement from Brussels during this transition period. ConfectioneryNews will be presenting a special live webinar on Tuesday 23 January 24 at 17:00Paris \/ 10:00AM Chicago to discuss the new requirements for market access for cocoa and chocolate suppliers into the European Union.​","filter_flag":1}
{"title":"Second Vegan BILLA PFLANZILLA Store Opens in Austria Today - vegconomist - the vegan business magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3JldGFpbC1lLWNvbW1lcmNlL3NlY29uZC1iaWxsYS1wZmxhbnppbGxhLXN0b3JlLWF1c3RyaWEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3JldGFpbC1lLWNvbW1lcmNlL3NlY29uZC1iaWxsYS1wZmxhbnppbGxhLXN0b3JlLWF1c3RyaWEv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3JldGFpbC1lLWNvbW1lcmNlL3NlY29uZC1iaWxsYS1wZmxhbnppbGxhLXN0b3JlLWF1c3RyaWEv0gEA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3JldGFpbC1lLWNvbW1lcmNlL3NlY29uZC1iaWxsYS1wZmxhbnppbGxhLXN0b3JlLWF1c3RyaWEv0gEA?oc=5\" target=\"_blank\">Second Vegan BILLA PFLANZILLA Store Opens in Austria Today<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Second Vegan BILLA PFLANZILLA Store Opens in Austria Today - vegconomist - the vegan business magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdmVnY29ub21pc3QuY29tL3JldGFpbC1lLWNvbW1lcmNlL3NlY29uZC1iaWxsYS1wZmxhbnppbGxhLXN0b3JlLWF1c3RyaWEv0gEA?oc=5\" target=\"_blank\">Second Vegan BILLA PFLANZILLA Store Opens in Austria Today<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","source.href":"https:\/\/vegconomist.com","source.title":"vegconomist - the vegan business magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"BILLA PFLANZILLA opens in Graz, Austria on November 9th. After the flagship store in Vienna, this is the second REWE Group store in Austria with a vegan shop concept. The range in the new, around 100 m² BILLA PFLANZILLA store in Graz will include around 2,000 purely vegan products. BILLA PFLANZILLA recently celebrated its birthday, having opened its first plant-based store in Vienna in September 2022. Earlier this year, Billa revealed that it now offers Austria’s largest range of plant-based products, with around 4,000 products verified as animal-free by the Vegan Society Austria. The chain has achieved this by significantly expanding its own-brand vegan range, along with offering products by other brands including Juicy Marbles, Wunderkern, and Revo Foods, whose mycoprotein-based salmon filet launched at the Vienna store this September, marking the first-ever 3D-printed product available in supermarkets worldwide. As one of the largest food retailers in Austria, BILLA is reacting to changing eating habits and has set itself the task of meeting the needs of its customers with a diverse plant-based range and corresponding offers with a comprehensive plant-based strategy. As stated by Greenpeace this year, on average, Austrians eat around 89 kilograms of meat every year, which is more than three times as much as recommended by the Austrian Society for Nutrition. Extrapolated to the whole of Austria, a meat-reduced diet can save 3.7 million tons of greenhouse gas emissions per year – this corresponds to the total greenhouse gas emissions of the federal state of Salzburg per year. Attempts by retailers to help combat this and to encourage plant-based consumption in the country are therefore not only commendable but necessary and urgent. Peter Gschiel, BILLA Sales Director in Styria, comments: “We are delighted to open the second BILLA PFLANZILLA right in the centre of Graz, between the River Mur and the ever-busy Jakominiplatz. Residents of the city and the surrounding area are offered a great place to go for purely plant-based enjoyment. The range extends from an essential basic assortment to popular classics and new innovations from young, up-and-coming start-ups, local entrepreneurs and visionary pioneers who are rethinking the topic of plant-based. The team at the new BILLA PFLANZILLA is happy to provide advice and assistance with every purchase.”","filter_flag":1}
{"title":"Yara Launches New Biostimulants Brand - Agribusiness Global","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vcGxhbnQtaGVhbHRoL2Jpb3N0aW11bGFudHMveWFyYS1sYXVuY2hlcy1uZXctYmlvc3RpbXVsYW50cy1icmFuZC_SAWhodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL3BsYW50LWhlYWx0aC9iaW9zdGltdWxhbnRzL3lhcmEtbGF1bmNoZXMtbmV3LWJpb3N0aW11bGFudHMtYnJhbmQvP2FtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vcGxhbnQtaGVhbHRoL2Jpb3N0aW11bGFudHMveWFyYS1sYXVuY2hlcy1uZXctYmlvc3RpbXVsYW50cy1icmFuZC_SAWhodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL3BsYW50LWhlYWx0aC9iaW9zdGltdWxhbnRzL3lhcmEtbGF1bmNoZXMtbmV3LWJpb3N0aW11bGFudHMtYnJhbmQvP2FtcA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vcGxhbnQtaGVhbHRoL2Jpb3N0aW11bGFudHMveWFyYS1sYXVuY2hlcy1uZXctYmlvc3RpbXVsYW50cy1icmFuZC_SAWhodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL3BsYW50LWhlYWx0aC9iaW9zdGltdWxhbnRzL3lhcmEtbGF1bmNoZXMtbmV3LWJpb3N0aW11bGFudHMtYnJhbmQvP2FtcA","guidislink":false,"published":"Wed, 29 Nov 2023 20:41:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=20, tm_min=41, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vcGxhbnQtaGVhbHRoL2Jpb3N0aW11bGFudHMveWFyYS1sYXVuY2hlcy1uZXctYmlvc3RpbXVsYW50cy1icmFuZC_SAWhodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL3BsYW50LWhlYWx0aC9iaW9zdGltdWxhbnRzL3lhcmEtbGF1bmNoZXMtbmV3LWJpb3N0aW11bGFudHMtYnJhbmQvP2FtcA?oc=5\" target=\"_blank\">Yara Launches New Biostimulants Brand<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Agribusiness Global<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Yara Launches New Biostimulants Brand - Agribusiness Global","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vcGxhbnQtaGVhbHRoL2Jpb3N0aW11bGFudHMveWFyYS1sYXVuY2hlcy1uZXctYmlvc3RpbXVsYW50cy1icmFuZC_SAWhodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL3BsYW50LWhlYWx0aC9iaW9zdGltdWxhbnRzL3lhcmEtbGF1bmNoZXMtbmV3LWJpb3N0aW11bGFudHMtYnJhbmQvP2FtcA?oc=5\" target=\"_blank\">Yara Launches New Biostimulants Brand<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Agribusiness Global<\/font>","source.href":"https:\/\/www.agribusinessglobal.com","source.title":"Agribusiness Global","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Yara Launches New Biostimulants Brand In response to farmers asking for solutions to increase crop resilience and nutrient use efficiency, Yara has announced the launch of YaraAmplix, a new brand of biostimulants, at the Biostimulant World Congress in Milan, Italy. “Extreme weather is destroying crops all over the world with drought, flooding and frost. Biostimulants helps farmers make their crops stronger, and more resilient to stress from climate change. Farmers are the first line of defense against food insecurity, and we are adapting to their needs with solutions that allow them to prosper when the environment is not always on their side,” says Svein Tore Holsether, CEO Yara. Advertisement In the last five years, Yara has developed a comprehensive product portfolio of biostimulants, with each one based on a unique formulation, and with the ability to stimulate plant metabolism and performance. Since 2018, this portfolio has grown with a compound annual growth rate of more than 50%. These products will now become part of a new brand family, YaraAmplix, with several new products in the pipeline for 2024. The portfolio is formulated with mostly natural ingredients such as seaweed and plant extracts, to deliver targeted effects such as enhanced tolerance to abiotic stress, improved nutrient use efficiency, crop yield and quality. YaraAmplix is a vital solution for regenerative agriculture addressing climate, soil health, resource use, biodiversity and prosperity. With over 100 years of crop nutrition expertise, Yara continues to leverage this extensive knowledge with increasing investments in R&D, to enable Yara’s team of scientists to work on creating new innovative formulations. These formulations are intended to be used on different crops in multiple regions, addressing specific challenges. YaraAmplix is a complement to Yara’s fertilizer portfolio, providing a complete crop nutrition solution; in what will become a key offering for farmers in the future. Yara’s ambition is to grow a nature-positive food future, and the company is conducting scientific and independent trials on biostimulants in all regions to evaluate and validate their effects in various conditions and crops. A dataset of 359 data points from 2018 to 2020 shows an average yield increase of 7.5% with a win rate of 74% over control treatment. “Popular foods we all rely on, such as tomato, maize, soybean, and citrus to name a few, are at increased risk of yields loss due to extreme weather, so lowering greenhouse gas emissions to avoid a worsening scenario is key. As part of the solution, biostimulants are an essential tool to help reduce loss of food due to climatic stresses while improving nutrient use efficiency, a critical lever when it comes to enabling farmers to keep their business profitable and sustainable. The launch of YaraAmplix emphasizes even more our focus on regenerative agriculture and that is why we intend to take on a leading position of biostimulants in the future,” says Rejane Souza, SVP Global Innovation. YaraAmplix will begin commercial rollout in China, Brazil, and France during the end of 2023, and will gradually be rolled out to the rest of the world in 2024.","filter_flag":1}
{"title":"Burnbrae Farms launches free-range, solar-produced eggs - RealAgriculture","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnJlYWxhZ3JpY3VsdHVyZS5jb20vMjAyMy8xMS9idXJuYnJhZS1mYXJtcy1sYXVuY2hlcy1lZ2dzLWZyZWUtcmFuZ2Utc29sYXItZWdncy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnJlYWxhZ3JpY3VsdHVyZS5jb20vMjAyMy8xMS9idXJuYnJhZS1mYXJtcy1sYXVuY2hlcy1lZ2dzLWZyZWUtcmFuZ2Utc29sYXItZWdncy_SAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LnJlYWxhZ3JpY3VsdHVyZS5jb20vMjAyMy8xMS9idXJuYnJhZS1mYXJtcy1sYXVuY2hlcy1lZ2dzLWZyZWUtcmFuZ2Utc29sYXItZWdncy_SAQA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnJlYWxhZ3JpY3VsdHVyZS5jb20vMjAyMy8xMS9idXJuYnJhZS1mYXJtcy1sYXVuY2hlcy1lZ2dzLWZyZWUtcmFuZ2Utc29sYXItZWdncy_SAQA?oc=5\" target=\"_blank\">Burnbrae Farms launches free-range, solar-produced eggs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RealAgriculture<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Burnbrae Farms launches free-range, solar-produced eggs - RealAgriculture","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnJlYWxhZ3JpY3VsdHVyZS5jb20vMjAyMy8xMS9idXJuYnJhZS1mYXJtcy1sYXVuY2hlcy1lZ2dzLWZyZWUtcmFuZ2Utc29sYXItZWdncy_SAQA?oc=5\" target=\"_blank\">Burnbrae Farms launches free-range, solar-produced eggs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RealAgriculture<\/font>","source.href":"https:\/\/www.realagriculture.com","source.title":"RealAgriculture","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Burnbrae Farms, a Canadian family-owned and operated egg company, is launching two new specialty offerings that showcase eggs that come from the company’s Woodstock, Ont., solar-powered farm. The new products will be offered in some grocery stores across Ontario, Quebec, and Atlantic Canada. The products, Naturegg Solar Free Range and Nature Omega Plus Solar Free Range eggs, will be produced at Burnbrae’s solar-powered farm equipped with high-efficiency motors, lighting, and ventilation. This solar farm is a step towards the company’s goal to reduce greenhouse gas emissions. Burnbrae Farms has been tracking its carbon footprint since 2018. Margaret Hudson, president and CEO of Burnbrae, says they are reducing greenhouse gas emissions and electricity consumption across its farms. “At Burnbrae Farms, we recognize that a lot goes into a little,” explains Hudson. “As the largest family-owned and operated egg business in Canada, our mission is to produce healthy, great tasting eggs and egg products while respecting the environment, people, and animals in our care. Our Naturegg Solar Free Range products reflect our sustainable and responsible farming practices, our family values, and our commitment to nourishing Canadian communities from coast to coast.” The new offerings come from free range hens that are housed in open-concept barns with access to the outdoors.","filter_flag":1}
{"title":"Plant-Based Fish: Nestlé Adds to Growing Vegan Seafood Sector - Green Queen Media","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL25lc3RsZS1nYXJkZW4tZ291cm1ldC1oYXJ2ZXN0LXZlZ2FuLXdoaXRlLWZpc2gtcGxhbnQtYmFzZWQtc2VhZm9vZC1sYXVuY2gv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL25lc3RsZS1nYXJkZW4tZ291cm1ldC1oYXJ2ZXN0LXZlZ2FuLXdoaXRlLWZpc2gtcGxhbnQtYmFzZWQtc2VhZm9vZC1sYXVuY2gv0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL25lc3RsZS1nYXJkZW4tZ291cm1ldC1oYXJ2ZXN0LXZlZ2FuLXdoaXRlLWZpc2gtcGxhbnQtYmFzZWQtc2VhZm9vZC1sYXVuY2gv0gEA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL25lc3RsZS1nYXJkZW4tZ291cm1ldC1oYXJ2ZXN0LXZlZ2FuLXdoaXRlLWZpc2gtcGxhbnQtYmFzZWQtc2VhZm9vZC1sYXVuY2gv0gEA?oc=5\" target=\"_blank\">Plant-Based Fish: Nestlé Adds to Growing Vegan Seafood Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Green Queen Media<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plant-Based Fish: Nestlé Adds to Growing Vegan Seafood Sector - Green Queen Media","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LmdyZWVucXVlZW4uY29tLmhrL25lc3RsZS1nYXJkZW4tZ291cm1ldC1oYXJ2ZXN0LXZlZ2FuLXdoaXRlLWZpc2gtcGxhbnQtYmFzZWQtc2VhZm9vZC1sYXVuY2gv0gEA?oc=5\" target=\"_blank\">Plant-Based Fish: Nestlé Adds to Growing Vegan Seafood Sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Green Queen Media<\/font>","source.href":"https:\/\/www.greenqueen.com.hk","source.title":"Green Queen Media","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"4 Mins Read Nestlé has announced the launch of three new vegan white fish SKUs in Europe and Asia, as it becomes the latest brand to release a plant-based seafood product to cater to the growing demand for seafood and sustainable proteins. Nestlé will debut marine-style crispy fillets and nuggets in Europe under its Garden Gourmet brand, which are made with wheat and pea protein. The products will be available online and in-store in European countries including Germany, Spain, Italy, Austria, Poland, the Czech Republic and Slovakia. This follows the company’s launch of crispy fish-free fingers (made from soy and wheat) under its Harvest Gourmet brand in Malaysia and Singapore. “These new fish alternatives are the result of our deep expertise in plant-based proteins and our strong commitment to continue delivering exciting innovations that meet consumers’ expectations,” said Torsten Pohl, global food R&D head at Nestlé. “During consumer testing, our products received high praise for the great taste and texture that is close to white fish.” Honing in on health and Nutri-score labels Courtesy: Nestlé Pohl added that the products “come with strong nutritional credentials, making them competitive in the marketplace”. It’s a reference to consumers’ increased focus on health in their food choices post-pandemic. Nestlé’s announcement makes a point to highlight the nutritional aspects of the new products, highlighting the high protein and low saturated fat content, as well as the fact that they’re rich in fibre. The company points out that the products in Europe have an A Nutri-score rating, which will be reflected on-pack in the countries that use this labelling system (France, Germany and Spain). These labels have a definite impact on consumers. A French study of 1,201 adolescents aged 11-17 last year revealed that 54% had already been impacted by Nutri-Score labels during food purchases, for example. Health is a growing driver of consumers’ food choices. Last year, an 8,000-person McKinsey survey covering the US, UK, France and Germany revealed that between 37-52% of people have cut their meat consumption in the last year out of health concerns. Similarly, another 2022 survey of 3,700 respondents in seven countries showed having a healthier diet is the primary motivator for 75% of consumers to begin consuming alternative proteins. It’s a focus mirrored by other recent plant-based meat launches and marketing campaigns too. US vegan giant Beyond Meat, for example, is spotlighting health on its latest TV ad, honing in on the heart-healthy attributes of its steak alternative. Similarly, in the UK, plant-based leader THIS is also putting nutrition at the forefront of its first TV commercial. In Spain, Heura is doing the same with its new alternative to York-style ham. Adding to a burgeoning category Courtesy: Nestlé The fact that Nestlé – a giant of the food industry – is launching vegan seafood is a marker for things to come for the niche. The plant-based seafood category has seen a flurry of developments this year on the back of encouraging sales growth. According to the Good Food Institute, plant-based meat unit sales dropped by 8%, but vegan seafood saw a 40% year-on-year growth in pound sales last year. Startups that raised funding include Konscious Foods and Hooked Foods, and two European brands received a €1.5M grant to create 3D-printed mycoprotein to replace seafood, which debuted in September. Meanwhile, eight months after securing vegan seafood brand Good Catch, Wicked Kitchen acquired alt-seafood startup Current Foods in May, Other product launches include South Korean startup Unlimeat‘s upcycled vegan tuna, Singapore-based HAPPIEE‘s vegan shrimp and squid in the UK, and Canadian brand Seed to Surf‘s plant-based whole-food white fish and snow crab. As of 2021, there were already at least 90 companies working with plant-based seafood. Along with Nestlé’s Garden Gourmet and Harvest Gourmet SKU expansion, these new products serve an increasing demand for seafood, which is expected to grow by 14% from 2020-30. But this ballooning demand has led to higher greenhouse gas emissions, while the heavy fuel use by ocean fishery vessels contributes to the climate crisis. Overfishing operations receive $22B in capacity-enhancing subsidies every year, a figure the UN special envoy Peter Thomson has called “madness”. Speaking to Green Queen last year, Lily Ng, owner of US vegan seafood company Lily’s Vegan Pantry, said: “Overfishing disrupts the food chain. And when populations are diminished, other species will overpopulate, destroying biodiversity and making changes to the entire ecosystem. In the end, our consumption of fish still destroys our planet.” The 2021 documentary Seaspiracy details the endemic issues attached to this sector. “People continue to seek out plant-based options for their favourite dishes,” said Massimo Zucchero, global category lead for plant-based meals at Nestlé. “These new alternatives… are tasty, nutritious and can also help to reduce overfishing and protect the biodiversity of our oceans.”","filter_flag":1}
{"title":"Burnbrae Farms unveils two new shell egg offerings - food in canada","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmZvb2RpbmNhbmFkYS5jb20vY29uc3VtZXItcHJvZHVjdHMvYnVybmJyYWUtZmFybXMtdW52ZWlscy10d28tbmV3LXNoZWxsLWVnZy1vZmZlcmluZ3Mv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmZvb2RpbmNhbmFkYS5jb20vY29uc3VtZXItcHJvZHVjdHMvYnVybmJyYWUtZmFybXMtdW52ZWlscy10d28tbmV3LXNoZWxsLWVnZy1vZmZlcmluZ3Mv0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmZvb2RpbmNhbmFkYS5jb20vY29uc3VtZXItcHJvZHVjdHMvYnVybmJyYWUtZmFybXMtdW52ZWlscy10d28tbmV3LXNoZWxsLWVnZy1vZmZlcmluZ3Mv0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmZvb2RpbmNhbmFkYS5jb20vY29uc3VtZXItcHJvZHVjdHMvYnVybmJyYWUtZmFybXMtdW52ZWlscy10d28tbmV3LXNoZWxsLWVnZy1vZmZlcmluZ3Mv0gEA?oc=5\" target=\"_blank\">Burnbrae Farms unveils two new shell egg offerings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">food in canada<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Burnbrae Farms unveils two new shell egg offerings - food in canada","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmZvb2RpbmNhbmFkYS5jb20vY29uc3VtZXItcHJvZHVjdHMvYnVybmJyYWUtZmFybXMtdW52ZWlscy10d28tbmV3LXNoZWxsLWVnZy1vZmZlcmluZ3Mv0gEA?oc=5\" target=\"_blank\">Burnbrae Farms unveils two new shell egg offerings<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">food in canada<\/font>","source.href":"https:\/\/www.foodincanada.com","source.title":"food in canada","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Burnbrae Farms launches two new specialty products: Naturegg Solar Free Range and Naturegg Omega Plus Solar Free Range eggs. Produced in Woodstock, Ont., at Burnbrae’s solar-powered farm, these new offerings are another step toward the company’s goal to reduce greenhouse gas emissions. “At Burnbrae Farms, we recognize that a lot goes into a little,” said Margaret Hudson, president and CEO, Burnbrae Farms. “As the largest family-owned and operated egg business in Canada, our mission is to produce healthy, great tasting eggs and egg products while respecting the environment, people and animals in our care. Our Naturegg Solar Free Range products reflect our sustainable and responsible farming practices, our family values, and our commitment to nourishing Canadian communities from coast to coast.” The new offerings come from free range hens that are housed in open-concept barns with access to the outdoors. Advertisement Naturegg Omega Plus Solar Free Range and Naturegg Solar Free Range eggs are available in Ontario, Quebec and Atlantic Canada.","filter_flag":1}
{"title":"Circular economy education: The time is now | Research | NTU Singapore - Nanyang Technological University","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3Lm50dS5lZHUuc2cvcmVzZWFyY2gvcmVzZWFyY2gtaHViL25ld3MvZGV0YWlsL2NpcmN1bGFyLWVjb25vbXktZWR1Y2F0aW9uLXRoZS10aW1lLWlzLW5vd9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3Lm50dS5lZHUuc2cvcmVzZWFyY2gvcmVzZWFyY2gtaHViL25ld3MvZGV0YWlsL2NpcmN1bGFyLWVjb25vbXktZWR1Y2F0aW9uLXRoZS10aW1lLWlzLW5vd9IBAA?oc=5","id":"CBMiY2h0dHBzOi8vd3d3Lm50dS5lZHUuc2cvcmVzZWFyY2gvcmVzZWFyY2gtaHViL25ld3MvZGV0YWlsL2NpcmN1bGFyLWVjb25vbXktZWR1Y2F0aW9uLXRoZS10aW1lLWlzLW5vd9IBAA","guidislink":false,"published":"Fri, 03 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=307, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3Lm50dS5lZHUuc2cvcmVzZWFyY2gvcmVzZWFyY2gtaHViL25ld3MvZGV0YWlsL2NpcmN1bGFyLWVjb25vbXktZWR1Y2F0aW9uLXRoZS10aW1lLWlzLW5vd9IBAA?oc=5\" target=\"_blank\">Circular economy education: The time is now | Research | NTU Singapore<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nanyang Technological University<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular economy education: The time is now | Research | NTU Singapore - Nanyang Technological University","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3Lm50dS5lZHUuc2cvcmVzZWFyY2gvcmVzZWFyY2gtaHViL25ld3MvZGV0YWlsL2NpcmN1bGFyLWVjb25vbXktZWR1Y2F0aW9uLXRoZS10aW1lLWlzLW5vd9IBAA?oc=5\" target=\"_blank\">Circular economy education: The time is now | Research | NTU Singapore<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nanyang Technological University<\/font>","source.href":"https:\/\/www.ntu.edu.sg","source.title":"Nanyang Technological University","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Education is critical in ensuring students understand, respect and appreciate a “life cycle mindset”, where products are made to be used as long as possible. But, why is it important for institutions to embrace the circular economy? Every day, we throw away something in the bin at home and at public places. Most of us buy things without asking ourselves, “Do I need it?”, “How long will it last?”, “Is it healthy and environmentally friendly?”, “Who made it?”, “Where & How is it made?” and “How is my consumption behavior related to carbon neutrality?”. The consequence of our “unquestionable” consumption and its continuously growing production has polluted our air, trashed our land, and contaminated waterways from canals and rivers to the ocean. Meanwhile, we are depleting our natural resources, from energy to materials, and continuing the growth of greenhouse gas emissions. We know the “Take-Make-Consume-Dispose” linear economic model is not sustainable. Imagine waste we dispose of daily in the bin can be transformed into material feedstock and energy to produce value-added products or nutrients for plants\/food production. Imagine energy production is from renewable sources. This requires transitioning from a linear economic system to a regenerative and circular economy. We design, produce, and use products guided by Life Cycle Thinking (LCT). Products are made to be in use as long as possible. They are designed for re-use, re-furbish\/repair, and remanufacture at the component and system level. At their end of life, the materials used are recyclable and recoverable as feedstock of new products or energy. Materials and functional units are used and processed in optimal circularity to ensure energy & materials efficiency. Today, the circularity transition has been slow in scalability due to the lack of synergised action from different stakeholders, the existing inert production and consumption system, and the lack of knowledge. Education is critical in accelerating the transition. We need to: i) Develop a circularity mindset; ii) Acquire knowledge on circularity in different sectors (from policy, R&D, industries, to financing); iii) Discover & Create exciting business opportunities; iv) Practice Entrepreneur activities; v) Understand how circularity can address the three pillars of sustainability: environment, society, and economy, accelerate the reaching of the Sustainable Development Goals (SDGs). Adopting system and life cycle thinking with an entrepreneurship mindset in our education curriculum, we can nurture the next generation leaders and workforce to drive green and digital transformation through the adoption of AI and Big data analytics, coupled with decarbonization and circularity in economic model transition, and creating a sustainability ecosystem that uses fewer resources and creates a bigger impact. At the King Mongut’s University of Technology Thonburi (KMUTT) Thailand, a general education module GEN352- Technology & Innovation for Sustainability: Smart Circular Economy has been pionereed. We adopted the transdisciplinary approach integrating Industry 4.0 knowledge with circular economy addressing the impact on the SDGs. Students conduct value chain and supply chain analyses on innovations developed at the university and learn how to create impact through market research, business model design, marketing, and financing. Plastics Circularity (STEAM Platform) Since 2021, sustainability programs have been introduced as part of Nanyang Technological University (NTU) Singapore’s core interdisciplinary undergraduate program. NTU has recently been selected to host the CIFAL (International Training for Authorities and Leaders) in Singapore. In partnership with the United Nations Institute for Training and Research (UNITAR), the center offers sustainability education and knowledge sharing for government officials and leaders from the APAC region. As part of the education for future youth leaders and entrepreneurs, the Master of Science in Technopreneurship and Innovation programme held at NTU Entrepreneur Academy, students in the Ecosystem Development class in 2023 took up simulated roles of various stakeholders and practiced how to synergize solutions in driving Singapore's circular economy transition from the role of government policymaker, technology provider, investor, industry, entrepreneurs to the end community consumers. NTU will launch in September 2023 a new graduate certificate program, “Circular Economy: Enabling a Sustainable Future”. The circular economy transition is driven by policy intervention, emerging technologies, product design & business model innovation, innovative financing mechanisms, and consumer behavior. Multi-stakeholder alignment and multi-disciplinary approach in research and education is becoming ever more critical in higher education practices. With the rapid advancement of big data analytics, digital twins, and AI, we are able to track the entire product life cycle allowing optimization of resources used, production process, usage, and end-of-use\/life management. Circular product design allows us to keep the product in use for as long as possible and create new products through innovative materials technologies. Circular entrepreneurship education prepares an action-driven workforce to drive change in respective stakeholders’ roles. The convergence of emerging digital technologies (Big data, IoT, AI, Blockchain), physical (Nanotech, Robotics, Materials Science, 3D Printing), and biological (Bioenergy, Bioremediation, Microbiome, Biorefinery) technologies will accelerate the CE transformation. By Lerwen Liu, Associate Professor in Entrepreneurship, NTU; Arslan Siddique, Postdoctoral Research Associate, UNSW Australia; and Shu Sheng Chia, MSc Technopreneurship and Innovation Alumni, NTU The article appeared first in Issue 6 of QS Insights Magazine.","filter_flag":1}
{"title":"Atlas Honda rolls out first electric scooter in two-wheel EV push - The News International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnRoZW5ld3MuY29tLnBrL3ByaW50LzExMzM0MzAtYXRsYXMtaG9uZGEtcm9sbHMtb3V0LWZpcnN0LWVsZWN0cmljLXNjb290ZXItaW4tdHdvLXdoZWVsLWV2LXB1c2jSAWhodHRwczovL3d3dy50aGVuZXdzLmNvbS5way9hbXAvMTEzMzQzMC1hdGxhcy1ob25kYS1yb2xscy1vdXQtZmlyc3QtZWxlY3RyaWMtc2Nvb3Rlci1pbi10d28td2hlZWwtZXYtcHVzaA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnRoZW5ld3MuY29tLnBrL3ByaW50LzExMzM0MzAtYXRsYXMtaG9uZGEtcm9sbHMtb3V0LWZpcnN0LWVsZWN0cmljLXNjb290ZXItaW4tdHdvLXdoZWVsLWV2LXB1c2jSAWhodHRwczovL3d3dy50aGVuZXdzLmNvbS5way9hbXAvMTEzMzQzMC1hdGxhcy1ob25kYS1yb2xscy1vdXQtZmlyc3QtZWxlY3RyaWMtc2Nvb3Rlci1pbi10d28td2hlZWwtZXYtcHVzaA?oc=5","id":"CBMiamh0dHBzOi8vd3d3LnRoZW5ld3MuY29tLnBrL3ByaW50LzExMzM0MzAtYXRsYXMtaG9uZGEtcm9sbHMtb3V0LWZpcnN0LWVsZWN0cmljLXNjb290ZXItaW4tdHdvLXdoZWVsLWV2LXB1c2jSAWhodHRwczovL3d3dy50aGVuZXdzLmNvbS5way9hbXAvMTEzMzQzMC1hdGxhcy1ob25kYS1yb2xscy1vdXQtZmlyc3QtZWxlY3RyaWMtc2Nvb3Rlci1pbi10d28td2hlZWwtZXYtcHVzaA","guidislink":false,"published":"Wed, 29 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnRoZW5ld3MuY29tLnBrL3ByaW50LzExMzM0MzAtYXRsYXMtaG9uZGEtcm9sbHMtb3V0LWZpcnN0LWVsZWN0cmljLXNjb290ZXItaW4tdHdvLXdoZWVsLWV2LXB1c2jSAWhodHRwczovL3d3dy50aGVuZXdzLmNvbS5way9hbXAvMTEzMzQzMC1hdGxhcy1ob25kYS1yb2xscy1vdXQtZmlyc3QtZWxlY3RyaWMtc2Nvb3Rlci1pbi10d28td2hlZWwtZXYtcHVzaA?oc=5\" target=\"_blank\">Atlas Honda rolls out first electric scooter in two-wheel EV push<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The News International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Atlas Honda rolls out first electric scooter in two-wheel EV push - The News International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LnRoZW5ld3MuY29tLnBrL3ByaW50LzExMzM0MzAtYXRsYXMtaG9uZGEtcm9sbHMtb3V0LWZpcnN0LWVsZWN0cmljLXNjb290ZXItaW4tdHdvLXdoZWVsLWV2LXB1c2jSAWhodHRwczovL3d3dy50aGVuZXdzLmNvbS5way9hbXAvMTEzMzQzMC1hdGxhcy1ob25kYS1yb2xscy1vdXQtZmlyc3QtZWxlY3RyaWMtc2Nvb3Rlci1pbi10d28td2hlZWwtZXYtcHVzaA?oc=5\" target=\"_blank\">Atlas Honda rolls out first electric scooter in two-wheel EV push<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The News International<\/font>","source.href":"https:\/\/www.thenews.com.pk","source.title":"The News International","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"KARACHI: Atlas Honda Ltd., Pakistan's largest motorcycle maker, launched its first electric scooter on Tuesday, marking its entry into the two-wheel EV segment in the country. The company, a joint venture between Atlas Group and Honda Motor Co., unveiled the 'BENLY e' scooter at a ceremony at its Sheikhupura factory, where it also celebrated its 60th anniversary of operations in Pakistan. This screenshot shows Honda's BENLY e launched in Pakistan on Nov 28, 2023. —YouTube\/Info Tech Solutions The scooter will be offered for test marketing, and the company will introduce new products based on the feedback from the market and customers, Noriaki Abe, Chief Officer of Motorcycle and Power Products at Atlas Honda, said at the event. \"Honda products have become an essential part of the daily life of many in Pakistan,\" Abe said. \"We will continue to provide products that meet the needs and expectations of our customers.\" The launch comes as Pakistan is seeking to promote electric vehicles as part of its efforts to reduce air pollution and greenhouse gas emissions. The government approved an ambitious National Electric Vehicles Policy (NEVP) in 2019 that aimed at seeing electric vehicles take 30 percent share of all the passenger vehicle and heavy-duty truck sales by 2030, and 90 percent by 2040. A more ambitious goal was set for two- and three-wheelers and buses at 50 percent of new sales by 2030 and 90 percent by 2040. Atlas Honda, which has a market share of 85 percent in the two- and three-wheel segment, according to Pakistan Automotive Manufacturers Association data, said it is ready to embrace the EV revolution. Shinji Aoyama, Executive Vice President and COO of Honda Motor, and Toshio Kuwahara, President & CEO of Asian Honda Motor, also attended the ceremony. Aoyama said that the mobility industry is going through a rapid transformation and Honda Motor is well positioned for the future. Kuwahara said that Pakistan is an important market and Honda will strive to introduce attractive products for Pakistani customers. Saquib H. Shirazi, President and CEO of Atlas Honda, said that the company has expanded its product line up and achieved localization of up to 95 percent. \"The company developed the largest network of local auto parts manufacturers and dealers. With more than 10,000 touchpoints, the company has created direct employment opportunities for more than 150,000 people,\" Shirazi said. In 2022-23, Atlas Honda sold over 1 million motorcycles out of the total 1.18 million total two- and three-wheel unit sales.","filter_flag":1}
