{"title":"Ireland's new national air quality forecast goes live today - TheJournal.ie","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZW52aXJvbm1lbnRhbC1wcm90ZWN0aW9uLWFnZW5jeS1haXItcXVhbGl0eS1mb3JlY2FzdC02MjEzMjUyLU5vdjIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZW52aXJvbm1lbnRhbC1wcm90ZWN0aW9uLWFnZW5jeS1haXItcXVhbGl0eS1mb3JlY2FzdC02MjEzMjUyLU5vdjIwMjMv0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZW52aXJvbm1lbnRhbC1wcm90ZWN0aW9uLWFnZW5jeS1haXItcXVhbGl0eS1mb3JlY2FzdC02MjEzMjUyLU5vdjIwMjMv0gEA","guidislink":false,"published":"Fri, 03 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=307, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZW52aXJvbm1lbnRhbC1wcm90ZWN0aW9uLWFnZW5jeS1haXItcXVhbGl0eS1mb3JlY2FzdC02MjEzMjUyLU5vdjIwMjMv0gEA?oc=5\" target=\"_blank\">Ireland's new national air quality forecast goes live today<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheJournal.ie<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ireland's new national air quality forecast goes live today - TheJournal.ie","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZW52aXJvbm1lbnRhbC1wcm90ZWN0aW9uLWFnZW5jeS1haXItcXVhbGl0eS1mb3JlY2FzdC02MjEzMjUyLU5vdjIwMjMv0gEA?oc=5\" target=\"_blank\">Ireland's new national air quality forecast goes live today<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheJournal.ie<\/font>","source.href":"https:\/\/www.thejournal.ie","source.title":"TheJournal.ie","query":"https:\/\/news.google.com\/rss\/search?q=\"Air Quality Management\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"THE ENVIRONMENTAL PROTECTION Agency (EPA) has launched a national air quality forecast online, which the regulator says will enable people to plan their outdoor activities “in order to reduce potential exposure to poor air quality”. The forecast will allow members of the public to read maps that show a predicted daily air quality in their area for up to three days. The maps are based on the Air Quality Index for Health (AQIH), a scale from 1 to 10 which indicates what the air quality currently is in the nearest station and whether or not it might affect someone’s health. A reading of 10 means the air quality is very poor, while a reading of one to three means that the air quality is good. There are 114 monitoring stations around the country, including 34 stations in different locations in Dublin. The forecasts read daily concentrations of particulate matter (PM), nitrogen dioxide (NO2) and ozone (O3), the three main air pollutants impacting human health in Ireland. The AQIH index for each pollutant is worked out separately, and the overall AQIH for each grid in the map represents the highest point for all pollutants assessed. The EPA said fine particulate matter (PM 2.5) from burning solid fuel and nitrogen dioxide from vehicle emissions are the main pollutants impacting on people’s health in the country. Fine particulate matter is linked to lung disease, heart disease, strokes and cancer. Advertisement A look at the air quality in Dublin alongside the AQIH scale. EPA EPA The EPA said the forecast will help people plan their activities in line with the AQIH recommendations, such as reducing physical activity when air pollution levels are predicted to increase. The forecast maps will be uploaded twice daily, once in the morning and once in the evening. Maps should be updated by 9.30am and 5.30pm each day. The web page allows users to toggle between the existing Monitoring Stations map and new Air Quality Forecast Maps using two drop down menus to alternate between day of forecast and AQIH\/pollutant for each day. The maps are produced by computer models which have been developed under the EU Life Emerald project, a three-year project aimed at strengthening air quality management in Ireland. The models use Irish and European data such as air quality measurements, forecast weather and land cover data. The EPA has partnered on this with the Department of the Environment, Climate and Communications (DECC), the Health Service Executive (HSE), VITO, a Belgian research institute, University College Cork (UCC) and the Asthma Society of Ireland. Marking the launch of the forecast, Dr Micheál Lehane, Director of the EPA’s Office of Radiation Protection and Environmental Monitoring, said air pollution can seriously impact people’s health. “The air quality forecast will provide an important health and air quality resource for everyone, and will be even more impactful for those of us who are particularly affected by poor air quality, including those suffering from respiratory disease and asthma,” he said. “The forecast will also serve policy makers as a valuable tool for analysing air quality in Ireland.’’ Eilís Ní Chathnia, the CEO of the Asthma Society of Ireland, also welcomed the launch of the forecast, saying it will be an important resource for its members and everyone with respiratory conditions. “Ireland has the highest incidence rate of asthma in Europe with one in ten children and one in thirteen adults developing the condition – with 890,000 people likely to develop asthma in their lifetimes,” she said. The forecast and further information on air quality and the Air Quality Index for Health are available on airquality.ie.","filter_flag":1}
