{"title":"Housing officials: Fort Knox residents now have recycling options - United States Army","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFybXkubWlsL2FydGljbGUvMjcyNDU5L2hvdXNpbmdfb2ZmaWNpYWxzX2ZvcnRfa25veF9yZXNpZGVudHNfbm93X2hhdmVfcmVjeWNsaW5nX29wdGlvbnPSAWhodHRwczovL3d3dy5hcm15Lm1pbC9hcnRpY2xlLWFtcC8yNzI0NTkvaG91c2luZ19vZmZpY2lhbHNfZm9ydF9rbm94X3Jlc2lkZW50c19ub3dfaGF2ZV9yZWN5Y2xpbmdfb3B0aW9ucw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFybXkubWlsL2FydGljbGUvMjcyNDU5L2hvdXNpbmdfb2ZmaWNpYWxzX2ZvcnRfa25veF9yZXNpZGVudHNfbm93X2hhdmVfcmVjeWNsaW5nX29wdGlvbnPSAWhodHRwczovL3d3dy5hcm15Lm1pbC9hcnRpY2xlLWFtcC8yNzI0NTkvaG91c2luZ19vZmZpY2lhbHNfZm9ydF9rbm94X3Jlc2lkZW50c19ub3dfaGF2ZV9yZWN5Y2xpbmdfb3B0aW9ucw?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmFybXkubWlsL2FydGljbGUvMjcyNDU5L2hvdXNpbmdfb2ZmaWNpYWxzX2ZvcnRfa25veF9yZXNpZGVudHNfbm93X2hhdmVfcmVjeWNsaW5nX29wdGlvbnPSAWhodHRwczovL3d3dy5hcm15Lm1pbC9hcnRpY2xlLWFtcC8yNzI0NTkvaG91c2luZ19vZmZpY2lhbHNfZm9ydF9rbm94X3Jlc2lkZW50c19ub3dfaGF2ZV9yZWN5Y2xpbmdfb3B0aW9ucw","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFybXkubWlsL2FydGljbGUvMjcyNDU5L2hvdXNpbmdfb2ZmaWNpYWxzX2ZvcnRfa25veF9yZXNpZGVudHNfbm93X2hhdmVfcmVjeWNsaW5nX29wdGlvbnPSAWhodHRwczovL3d3dy5hcm15Lm1pbC9hcnRpY2xlLWFtcC8yNzI0NTkvaG91c2luZ19vZmZpY2lhbHNfZm9ydF9rbm94X3Jlc2lkZW50c19ub3dfaGF2ZV9yZWN5Y2xpbmdfb3B0aW9ucw?oc=5\" target=\"_blank\">Housing officials: Fort Knox residents now have recycling options<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">United States Army<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Housing officials: Fort Knox residents now have recycling options - United States Army","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFybXkubWlsL2FydGljbGUvMjcyNDU5L2hvdXNpbmdfb2ZmaWNpYWxzX2ZvcnRfa25veF9yZXNpZGVudHNfbm93X2hhdmVfcmVjeWNsaW5nX29wdGlvbnPSAWhodHRwczovL3d3dy5hcm15Lm1pbC9hcnRpY2xlLWFtcC8yNzI0NTkvaG91c2luZ19vZmZpY2lhbHNfZm9ydF9rbm94X3Jlc2lkZW50c19ub3dfaGF2ZV9yZWN5Y2xpbmdfb3B0aW9ucw?oc=5\" target=\"_blank\">Housing officials: Fort Knox residents now have recycling options<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">United States Army<\/font>","source.href":"https:\/\/www.army.mil","source.title":"United States Army","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"A new recycling bin sits near Oak Park military community that allows residents the opportunity to recycle #1 and #2 plastics as well as aluminum and steel. Residents haven’t had the opportunity since 2020, when COVID restricted pickups. (Photo Credit: Eric Pilgrim, Fort Knox News) VIEW ORIGINAL FORT KNOX, Ky. — Some huge green recycling bins suddenly appeared recently at three Fort Knox locations. What makes these bins so unique is that they have been positioned in housing areas, and they belong to a neighboring community: Meade County, to be exact. “This is the first stage of an overall plan to increase capacity and capability to recycle for our residents on post, and to meet our climate strategy initiatives,” said Col. Chris Ricci, Fort Knox Garrison commander. “We couldn’t have done this without Meade County.” Officials from Knox Hills said residents have been requesting recycling services for a few years. “Our residents have been requesting some type of recycling program since services were first postponed during COVID, then again when we switched trash providers over the summer,” said Katie Huff, Knox Hills project director for parent company Lendlease. “Understanding this is an important service for our residents, we have worked diligently to come up with a program that would be beneficial and convenient for residents.” Ricci gives the credit for the idea to Troy Kok, who is Judge Executive of Meade County and a retired Army major general. “He knew that we used to have recycling on Fort Knox for our residents, and now we don’t,” said Ricci. “He saw that as an opportunity that’s a win, not only for Fort Knox, but also his county since ultimately we can recycle products to Meade County, and they can make the money off of the investment through recycling.” A new green Meade County recycling bin at Dietz community joins a Recycle Center blue bin, giving residents another option besides plastic, aluminum and steel. Officials say they are hoping to include bins for glass soon. (Photo Credit: Eric Pilgrim, Fort Knox News) VIEW ORIGINAL Recycling has been a complex issue at Fort Knox in past years. The Fort Knox Qualified Recycle Center has a separate mission that prevents it from being the recycling point for all of the installation. Its main focus is on facilities and organizations. Changing markets in 2019 forced the center, which is a non-appropriated funds organization, to adjust what can and cannot be recycled there. However, starting in October of this year, the center agreed to collect cardboard for residents at three locations due to high demand. One month later, Fort Knox officials signed a memorandum of agreement, making Meade County the go-to for the housing communities. “Right now, we’re purposely starting small in our residential areas,” said Ricci. “We’ve got three bulk drop-offs established. We want to learn lessons and make sure our objectives are correct between us and the county before going larger: so, super small baby steps right now.” Jamie Daley, manager of the Qualified Recycle Center, said those locations are the Godman Neighborhood off Walsh Street, parallel to Warhawk and Sumner for the historic district; the open-in road at North Tulip between Oak Park and Chestnut Glen for those communities; and the gravel parking lot of the Dietz Community Center for the Dietz community. Knox Hills officials praised the move by Meade County. “There are several benefits to this service, including lowering our impact on the environment, lowering emissions that come from landfilling,” said Huff, “and reducing the number of new products that need to be created from virgin materials.” Besides cardboard, the additional recycle bins will accept #1 and #2 pre-rinsed plastics, newspaper and white paper, aluminum and steel cans, magazines and all small metal pieces that fit into corresponding bins. “The service provides an opportunity for Meade County to carefully sift through items to ensure they are up to par with the recycling products they accept,” said Huff. “This was the biggest issue we faced in the past, as they quite often received recycling products that were not actually recyclable or were unable to be recycled due to cleanliness of the item.” Ricci said glass remains off the list of recyclable materials for now. However, it is not forgotten. “We’re hoping to move to glass and other products,” said Ricci. Mary Ellen Correia, Fort Knox Housing Division chief, said the request from Meade County to take over recycling in the housing areas benefits everyone. “It a win-win situation as they can get increased volume of materials to recycle, and we diminish items going into our landfills.”","filter_flag":1}
{"title":"These Eco-Friendly Dog Accessories are good for your pooch and the planet too! - Yanko Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnlhbmtvZGVzaWduLmNvbS8yMDIzLzEyLzA0L25ldy1yYW5nZS1vZi1zdXN0YWluYWJsZS1hbmQtaW50dWl0aXZlLWRvZy1wcm9kdWN0cy1ieS1lYXJ0aC1yYXRlZC1hbmQtbGF5ZXIv0gF4aHR0cHM6Ly93d3cueWFua29kZXNpZ24uY29tLzIwMjMvMTIvMDQvbmV3LXJhbmdlLW9mLXN1c3RhaW5hYmxlLWFuZC1pbnR1aXRpdmUtZG9nLXByb2R1Y3RzLWJ5LWVhcnRoLXJhdGVkLWFuZC1sYXllci9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnlhbmtvZGVzaWduLmNvbS8yMDIzLzEyLzA0L25ldy1yYW5nZS1vZi1zdXN0YWluYWJsZS1hbmQtaW50dWl0aXZlLWRvZy1wcm9kdWN0cy1ieS1lYXJ0aC1yYXRlZC1hbmQtbGF5ZXIv0gF4aHR0cHM6Ly93d3cueWFua29kZXNpZ24uY29tLzIwMjMvMTIvMDQvbmV3LXJhbmdlLW9mLXN1c3RhaW5hYmxlLWFuZC1pbnR1aXRpdmUtZG9nLXByb2R1Y3RzLWJ5LWVhcnRoLXJhdGVkLWFuZC1sYXllci9hbXAv?oc=5","id":"CBMidGh0dHBzOi8vd3d3LnlhbmtvZGVzaWduLmNvbS8yMDIzLzEyLzA0L25ldy1yYW5nZS1vZi1zdXN0YWluYWJsZS1hbmQtaW50dWl0aXZlLWRvZy1wcm9kdWN0cy1ieS1lYXJ0aC1yYXRlZC1hbmQtbGF5ZXIv0gF4aHR0cHM6Ly93d3cueWFua29kZXNpZ24uY29tLzIwMjMvMTIvMDQvbmV3LXJhbmdlLW9mLXN1c3RhaW5hYmxlLWFuZC1pbnR1aXRpdmUtZG9nLXByb2R1Y3RzLWJ5LWVhcnRoLXJhdGVkLWFuZC1sYXllci9hbXAv","guidislink":false,"published":"Mon, 04 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=338, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnlhbmtvZGVzaWduLmNvbS8yMDIzLzEyLzA0L25ldy1yYW5nZS1vZi1zdXN0YWluYWJsZS1hbmQtaW50dWl0aXZlLWRvZy1wcm9kdWN0cy1ieS1lYXJ0aC1yYXRlZC1hbmQtbGF5ZXIv0gF4aHR0cHM6Ly93d3cueWFua29kZXNpZ24uY29tLzIwMjMvMTIvMDQvbmV3LXJhbmdlLW9mLXN1c3RhaW5hYmxlLWFuZC1pbnR1aXRpdmUtZG9nLXByb2R1Y3RzLWJ5LWVhcnRoLXJhdGVkLWFuZC1sYXllci9hbXAv?oc=5\" target=\"_blank\">These Eco-Friendly Dog Accessories are good for your pooch and the planet too!<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yanko Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"These Eco-Friendly Dog Accessories are good for your pooch and the planet too! - Yanko Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnlhbmtvZGVzaWduLmNvbS8yMDIzLzEyLzA0L25ldy1yYW5nZS1vZi1zdXN0YWluYWJsZS1hbmQtaW50dWl0aXZlLWRvZy1wcm9kdWN0cy1ieS1lYXJ0aC1yYXRlZC1hbmQtbGF5ZXIv0gF4aHR0cHM6Ly93d3cueWFua29kZXNpZ24uY29tLzIwMjMvMTIvMDQvbmV3LXJhbmdlLW9mLXN1c3RhaW5hYmxlLWFuZC1pbnR1aXRpdmUtZG9nLXByb2R1Y3RzLWJ5LWVhcnRoLXJhdGVkLWFuZC1sYXllci9hbXAv?oc=5\" target=\"_blank\">These Eco-Friendly Dog Accessories are good for your pooch and the planet too!<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yanko Design<\/font>","source.href":"https:\/\/www.yankodesign.com","source.title":"Yanko Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Canadian dog brand Earth Rated has embarked on a transformative journey, collaborating with design agency Layer to redefine its identity and expand its product line. The result is a clean and simple rebrand that not only emphasizes recycling and natural products but also introduces a captivating range of sustainable dog toys. This extensive two-year project represents a commitment to holistic design, integrating sustainability into every aspect of the brand. Designers: Earth Rated, Layer Design (Benjamin Hubert) At the heart of the rebrand is a simple yet effective brandmark that captures the playful essence of Earth Rated. The brand name, expressed in a minimalistic sans-serif font, features a characterful dog silhouette cleverly integrated into the negative space of the “T” and “H” letterforms. This subtle representation of a dog marks an evolution from the more overt cartoon canine mascot associated with Earth Rated’s origins, reflecting a sophisticated and modern approach. The new identity is defined by fresh greens and vibrant yellow accents, creating a distinctive and ownable signature. The choice of yellow holds significance beyond aesthetics, as it is one of the few colors visible to dogs, aligning with the brand’s focus on creating products that resonate with our furry companions. Earth Rated proudly holds B Corp Certification, reflecting its commitment to social and environmental impact. The rebrand by Layer reinforces these sustainable values, with new products crafted from recycled and recyclable materials, post-consumer waste, and natural resources such as natural rubber. Even the packaging is designed with eco-friendliness in mind, utilizing recycled plastics, post-consumer waste, recycled cardboard, and natural ink. Affordability is a key aspect of the rebrand, making great design accessible to a wide range of dog owners. For instance, the poop bag dispenser retails for just $5.99, while a pack of 315 scented or unscented poop bags is priced at $18.99. Earth Rated is renowned globally for its distinctive poop bags and dispensers, both of which have been reimagined by Layer. The new poop bag dispenser features an intuitive design with a clip to hold used bags, a textured strap for easy attachment to a leash or bag, and a slot for easy access to the bags. The bags, available in compostable, lavender-scented, and unscented versions, not only offer practicality but also serve as a subtle billboard for the Earth Rated brand as they unroll. Layer’s influence extends to a new collection of dog toys that celebrates the sustainable values driving Earth Rated. Joyful geometric forms and textured surfaces invite interaction, creating an intuitive user experience for both pets and their owners. The material palette includes recycled and recyclable materials, compostable and post-consumer recycled plastics, and natural rubber. Dishwasher-safe for easy cleaning, these toys are designed to be recycled at the end of their life. The five toys in the collection—Fly, Tug, Fetch, Treat, and Chew—reimagine classic typologies for added functionality. Each toy offers a unique interaction, from the Fly Toy’s raised rim for easy gripping to the Chew Toy’s twisted form that enables dogs to hold it effectively. The Fetch Toy, with its intersecting forms, adds an element of unpredictability to playtime, keeping both pets and owners engaged. Designer Benjamin Hubert, leading the Layer team, expressed excitement about collaborating with Earth Rated, emphasizing the project’s rewarding nature. The results, he states, celebrate shared values of responsible, sustainable, and affordable design, marking a significant step in the evolution of Earth Rated and setting a new standard for the pet industry.","filter_flag":1}
{"title":"Quadpack: A range of five mono-material recyclable lipsticks - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9xdWFkcGFjay1hLXJhbmdlLW9mLWZpdmUtbW9ubywyMzA0N9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9xdWFkcGFjay1hLXJhbmdlLW9mLWZpdmUtbW9ubywyMzA0N9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9xdWFkcGFjay1hLXJhbmdlLW9mLWZpdmUtbW9ubywyMzA0N9IBAA","guidislink":false,"published":"Fri, 08 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=342, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9xdWFkcGFjay1hLXJhbmdlLW9mLWZpdmUtbW9ubywyMzA0N9IBAA?oc=5\" target=\"_blank\">Quadpack: A range of five mono-material recyclable lipsticks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Quadpack: A range of five mono-material recyclable lipsticks - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9xdWFkcGFjay1hLXJhbmdlLW9mLWZpdmUtbW9ubywyMzA0N9IBAA?oc=5\" target=\"_blank\">Quadpack: A range of five mono-material recyclable lipsticks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Quadpack launches a full range of five monomaterial lipsticks made of recyclable materials. The five products, comprising aluminium, polypropylene (PP) and polyethylene (PET) designs and two refill formats, boast an advanced level of sustainability, according to Quadpack’s positive-impact packaging (PIP) ratings system. A full report is available for each one, based on life-cycle assessments of their environmental impact. Versatile and customizable The versatile range offers a large variety of shapes, features and gestures, and can support different types of formulas, from lip colour to blush, concealer and even solid fragrance. According to Quadpack, their look and feel can adapt to suit any brand identity, using a host of decoration techniques and finishes. For instance, adding a soft-touch effect brings a sensory dimension to premium products. The range, named to reflect the elegance of tall, iconic architectural structures, includes: – Oculus: A refillable aluminium lipstick, with a luxurious ribbed design and a balanced 50\/50 ratio. Refilling is easy: just pull out the cartridge and snap in the new one! The refill cap is made of PET. Cup size: 12.7mm. Capacity: 4-4.2g. – Menara: Designed to support long-lasting claims, this lipstick has an airtight closure to protect formulations from drying out. Its PP construction offers high compatibility, making it a perfect solution for a variety of skincare, makeup and solid fragrance products. Available with up to 50% PCR PP. Cup size: 11.0mm. Capacity: 3.5-3.8g. – Kouros: With 90\/10 proportions, this classy lipstick has a modern design that combines recyclability with practicality. Made entirely of PET, it can include up to 50% PCR PET. Cup size: 12.7mm. Capacity: 4-4.2g. – Reforma: Perfect for creamy formulas, this petite lipstick features a 50\/50 design and a slanted tip to allow precise application on any area of the face. It is made of PET and can include up to 50% PCR PET. Cup size: 11mm. Capacity: 3.5-3.8g. – Emerald: The first PET lipstick to be launched in the range, Emerald’s cylindrical variant is now available with a unique twist-and-lock refill mechanism (refill cap is HDPE). Simply twist the base to lock and unlock, for effortless bullet replacement. Emerald also comes in a square design and all variants can contain up to 100% rPET. All these lipstick tubes are top-filling and compatible with standard filling lines.","filter_flag":1}
{"title":"Approval sought for new landfill near Glendale - Niagara Now","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmlhZ2FyYW5vdy5jb20vbmV3cy5waHRtbC9hcHByb3ZhbC1zb3VnaHQtZm9yLW5ldy1sYW5kZmlsbC1uZWFyLWdsZW5kYWxlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmlhZ2FyYW5vdy5jb20vbmV3cy5waHRtbC9hcHByb3ZhbC1zb3VnaHQtZm9yLW5ldy1sYW5kZmlsbC1uZWFyLWdsZW5kYWxlL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vbmlhZ2FyYW5vdy5jb20vbmV3cy5waHRtbC9hcHByb3ZhbC1zb3VnaHQtZm9yLW5ldy1sYW5kZmlsbC1uZWFyLWdsZW5kYWxlL9IBAA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmlhZ2FyYW5vdy5jb20vbmV3cy5waHRtbC9hcHByb3ZhbC1zb3VnaHQtZm9yLW5ldy1sYW5kZmlsbC1uZWFyLWdsZW5kYWxlL9IBAA?oc=5\" target=\"_blank\">Approval sought for new landfill near Glendale<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Niagara Now<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Approval sought for new landfill near Glendale - Niagara Now","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmlhZ2FyYW5vdy5jb20vbmV3cy5waHRtbC9hcHByb3ZhbC1zb3VnaHQtZm9yLW5ldy1sYW5kZmlsbC1uZWFyLWdsZW5kYWxlL9IBAA?oc=5\" target=\"_blank\">Approval sought for new landfill near Glendale<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Niagara Now<\/font>","source.href":"https:\/\/niagaranow.com","source.title":"Niagara Now","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Steve Hardaker Community Correspondent With only eight years remaining in the life of Walker Industries’ major landfill overlooking Niagara-on-the-Lake’s Glendale community, the company has started planning to develop the next phase of the dump. Located on top of the Niagara Escarpment, what’s known as the south landfill has been in operation for more than 15 years. But it is reaching full capacity and must be phased out. The proposed south landfill’s phase 2 is east of the existing landfill, across Taylor Road and south of Mountain Road. It is now a working limestone quarry for Walker’s aggregate operations which will close once the proposed new landfill is approved by the Ontario Ministry of the Environment. An initial open house will be held Dec. 14, from 4 to 8 p.m. at Club Italia on Montrose Road in Niagara Falls. Walker’s 2,000-acre sprawling Niagara campus on top of the Niagara Escarpment initially started as a small limestone quarry and aggregate operation more than 136 years ago. Today, it is home to a multi-faceted waste collection and recovery operation where materials like wood waste, railway ties, asphalt shingles and clean soils are recycled to produce new products. It handles about 75 per cent of Niagara’s garbage. Walker is also a leader in modern composting where municipal green bin organics are converted into quality compost products. The Niagara campus is home to a biosolid organic waste facility where organic waste is processed to recycle nutrients for agricultural production. The facility also receives the region’s blue and grey bin materials. What cannot be recycled, reused or composted is sent to the landfill. Methane gas is a natural product of the decomposition of any organic materials in any dump. For the last 15 years, Walker has collected this gas through a series of wells and pipes and that methane can be used to generate renewable energy. The company now has the largest renewable natural gas from landfill gas facility in Ontario. When commissioned near the end of 2023, the facility will produce enough energy to heat more than 8,700 homes annually through Enbridge Gas’ distribution system, Walker says. It has been managing landfill gas projects for over 20 years. And because it is being extracted from landfill, the natural gas produced is a renewable resource. That landfill gas is now being supplied to the neighbouring General Motors propulsion plant in St. Catharines, which will help the automaker reduce its carbon footprint by approximately 70 per cent, making it one of GM’s cleanest propulsion plants. Before Walker Industries can open its proposed new landfill, a rigorous environment assessment needs to be done. That could take up to eight years. Despite recycling and green bin composting efforts, there is still a need for landfill space for non-recyclable materials. Darren Fry, the project director overseeing the development of the phase 2 landfill, said, “Ontario has some of the strictest ground water protection laws in Canada or even in North America for that matter.” In designing the new facility, “We will look at how to protect water. We will study air quality. We will look at traffic. We will look at ecology. We’ll look at visual impacts,” he said. “There are about 14 studies we will be undertaking as part of the environmental assessment,” Fry said. Once the environmental assessment is approved by the province, the new landfill can be designed. It is not as simple as starting to dispose of waste into a hole in the ground or, for this site, the abandoned quarry. Modern landfills are designed to ensure groundwater and the environment are protected and safe. The company says it will use a state-of-the-art, 12-foot-thick liner system, to make sure waste in the landfill is contained. The liner is made up of many layers, each playing a role in protecting the environment. Walker says it will conduct extensive consultation with the public, agencies like the conservation authority, Indigenous communities and others. The first open house on Dec. 14 will be used to introduce the project, review, and discuss the environmental assessment process and gather feedback. More open houses are planned. Steve Hardaker has lived in Glendale for over 13 years and is active in many community organizations.","filter_flag":1}
{"title":"In Vietnam, young people embrace green lifestyles - TUOI TRE NEWS","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vdHVvaXRyZW5ld3Mudm4vbmV3cy9mZWF0dXJlcy8yMDIzMTIzMC9pbi12aWV0bmFtLXlvdW5nLXBlb3BsZS1lbWJyYWNlLWdyZWVuLWxpZmVzdHlsZXMvNzc1NDYuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vdHVvaXRyZW5ld3Mudm4vbmV3cy9mZWF0dXJlcy8yMDIzMTIzMC9pbi12aWV0bmFtLXlvdW5nLXBlb3BsZS1lbWJyYWNlLWdyZWVuLWxpZmVzdHlsZXMvNzc1NDYuaHRtbNIBAA?oc=5","id":"CBMiaWh0dHBzOi8vdHVvaXRyZW5ld3Mudm4vbmV3cy9mZWF0dXJlcy8yMDIzMTIzMC9pbi12aWV0bmFtLXlvdW5nLXBlb3BsZS1lbWJyYWNlLWdyZWVuLWxpZmVzdHlsZXMvNzc1NDYuaHRtbNIBAA","guidislink":false,"published":"Sat, 30 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=364, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vdHVvaXRyZW5ld3Mudm4vbmV3cy9mZWF0dXJlcy8yMDIzMTIzMC9pbi12aWV0bmFtLXlvdW5nLXBlb3BsZS1lbWJyYWNlLWdyZWVuLWxpZmVzdHlsZXMvNzc1NDYuaHRtbNIBAA?oc=5\" target=\"_blank\">In Vietnam, young people embrace green lifestyles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TUOI TRE NEWS<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"In Vietnam, young people embrace green lifestyles - TUOI TRE NEWS","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vdHVvaXRyZW5ld3Mudm4vbmV3cy9mZWF0dXJlcy8yMDIzMTIzMC9pbi12aWV0bmFtLXlvdW5nLXBlb3BsZS1lbWJyYWNlLWdyZWVuLWxpZmVzdHlsZXMvNzc1NDYuaHRtbNIBAA?oc=5\" target=\"_blank\">In Vietnam, young people embrace green lifestyles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TUOI TRE NEWS<\/font>","source.href":"https:\/\/tuoitrenews.vn","source.title":"TUOI TRE NEWS","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"With a profound awareness of the dire consequences of climate change, many Vietnamese youths are championing green lifestyles by introducing innovative approaches to goods production and embracing eco-friendly products. \"Green\" and recycled materials are gaining momentum in Vietnam, driven by the passion of young individuals committed to contributing to a sustainable and eco-friendly society. Exploring \"green\" materials At the age of 25, Nguyen Hoang An Khuong started to become aware of the detrimental impact of plastic waste on society and the environment. Motivated to find alternatives, Khuong established The Greenmart Vietnam, a company which focuses on providing daily essentials, stationery, and clothing made from natural materials such as bamboo, grass, sedge, water hyacinth, and bulrush. Tran Thi Thanh Tam (center) is dedicated to sustainable production, viewing it as the essential factor in creating environmentally friendly products. Photo: Khanh Huyen \/ Tuoi Tre In a similar vein, Tran Thi Thanh Tam, the 34-year-old founder of Tiem Thua Nuoc, has also put a focus on producing environmentally-friendly consumer goods by recycling plastic waste using jesmonite, a durable and eco-friendly material that can bond with plastic and nylon to create new products using recycled materials. Tiem Thua Nuoc’s recycling process includes molding broken pieces of plastics with colorant and jesmonite to create material with distinctive shapes, colors, and patterns. \"While we cannot eliminate plastic entirely, we can repurpose and recycle it into useful items, reducing harmful waste in the environment,” Tam said. The rise of sustainable production Tam and her team actively promote eco-friendly materials and technologies to students through workshops on crafting with green materials. These initiatives aim to inspire a trend of sustainable production, particularly in the fields of crafts, arts, and interior design. Recently, a group of students from Ton Duc Thang University's industrial design department transformed over 100 kilograms of plastic waste into a multi-functional CD player cabinet and a versatile wardrobe. According to group member Nguyen Ngoc Yen Phuong, the group’s intention was to create unique, multi-functional products from plastic bags and bottles using patterns to convey the importance of recycling. \"The patterns of rounds and circles symbolize the circulation of recycled materials - a process where a used product is given a new life by being recycled for a different purpose,\" Phuong said. \"With these two products, we are harnessing our creative capabilities and demonstrating our commitment to innovation by developing solutions for pressing environmental issues,\" said Phuong. Crafted with inspiration from the risks associated with plastic waste in the ocean, these keychain models are made from recycled materials, including straws, bottle caps, wrappers, and nylon bags. Photo: Tiem Nua Thuoc According to Duong Lien Trang Nha, a master's degree lecturer in industrial design at Ton Duc Thanh University, young people are becoming increasingly motivated to adopt green lifestyles by developing solutions to find solutions for environmental issues within their surroundings. The trend of using recyclable materials is gaining particular traction in craft and design circles. \"Through education, youths can develop a proper awareness of using recycled materials as an everyday lifestyle rather than a short-term trend, enabling them to be creative in crafting new products that are safe and practical,\" Nha emphasized. Like us on Facebook or follow us on Twitter to get the latest news about Vietnam!","filter_flag":1}
{"title":"Dubai's recycling programme treats over 8,000kg of waste every week - Khaleej Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVr0gGAAWh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVrP2FtcD0x?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVr0gGAAWh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVrP2FtcD0x?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVr0gGAAWh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVrP2FtcD0x","guidislink":false,"published":"Mon, 11 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=345, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVr0gGAAWh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVrP2FtcD0x?oc=5\" target=\"_blank\">Dubai's recycling programme treats over 8,000kg of waste every week<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Khaleej Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dubai's recycling programme treats over 8,000kg of waste every week - Khaleej Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVr0gGAAWh0dHBzOi8vd3d3LmtoYWxlZWp0aW1lcy5jb20vdWFlL2Vudmlyb25tZW50L2dvaW5nLXNtYXJ0LWR1YmFpcy1yZWN5Y2xpbmctcHJvZ3JhbW1lLXRyZWF0cy1vdmVyLTgwMDBrZy1vZi13YXN0ZS1ldmVyeS13ZWVrP2FtcD0x?oc=5\" target=\"_blank\">Dubai's recycling programme treats over 8,000kg of waste every week<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Khaleej Times<\/font>","source.href":"https:\/\/www.khaleejtimes.com","source.title":"Khaleej Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Published: Mon 11 Dec 2023, 6:00 AM Last updated: Mon 11 Dec 2023, 8:45 PM Ever spotted a colourful recycling bin in Dubai and wondered what it does? Called the Smart Sustainability Oasis (SSO) project, these form the crux of the mammoth recycling programme that Dubai conducts to divert materials from landfills to reuse or recycle them. Every week, the Dubai Municipality (DM) collects an average of over 8000kg of recyclable materials from the 17 bins placed in various locations in the emirate. “It is one of the municipality’s highly successful initiatives to advance environmental goals while exploring new ways of promoting a culture of waste segregation and recycling in collaboration with the local community,” said Saeed Abdul Rahim Safar, acting director of the Waste Operations Department at DM. “The project also helps meet national environmental targets in line with the UN Sustainable Development Goals.” Open 24x7, and recycling 18 different types of materials including metal and electronic waste, the community centres have diverted close to 2.5 million tonnes of waste from landfills since the project was launched in 2018. These centres segregate waste at source, collecting recyclable materials to promote environmental sustainability and social responsibility. “The most significant outcome of these recycling stations is that it promotes the practice of waste segregation at source and reducing the amount of waste going to landfills, which in turn will help support the recycling industry in Dubai,” said Saeed. Stay up to date with the latest news. Follow KT on WhatsApp Channels. Recyclables are also collected from other projects, such as My City, My Environment and the NORD system. All collected recyclables are diverted to approved treatment and recycling plants and facilities, where they are transformed into new products. Non-recyclable materials and byproducts of the treatment and recycling processes are diverted to the Warsan Waste-to-Energy Centre, where they are fed into digesters and converted into energy. Designed with purpose The recycling centres are designed with their purpose clear: Reuse and create a circular economy. The municipality recast old, abandoned shipping containers of 40 cubic metre capacity to make these bins, in keeping with environmental best practices and standards. Each of the recycling centres boast a capacity of one tonne, using multicoloured containers to collect as many recyclable items as possible, including discarded electronic devices, used mobile phones and dry batteries. To track the quantity of materials collected, each container at the centre is provided with remote sensors. The centres make use of solar energy to meet their electricity needs. ALSO READ: Dubai to introduce sustainable volleyball court made from old tyres Dubai announces ambitious plan to achieve 50% reduction in carbon emissions by 2030 New Dubai project to generate clean electricity from waste Each centre is equipped with cameras and audio devices to acknowledge users and convey thank you messages. It is also designed to make it accessible to people of determination. Customers don’t need to leave their vehicles at the centre so long as they take the designated entry and exit points. According to Saeed, DM is actively looking to expand the recycling infrastructure throughout the emirate. “Under the Waste Recycle Materials Collection Centre initiative, the establishment of a novel recycling centre within the current year is on the horizon,” he said. The location for this new centre is being meticulously selected based on technical requirements and population density.","filter_flag":1}
