{"title":"Technology meets humanity at Swinburne","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cff9f974c819c057667b6a7db67&url=https%3a%2f%2fwww.nature.com%2farticles%2fd42473-018-00014-2&c=13554616782825687063&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cff9f974c819c057667b6a7db67&url=https%3a%2f%2fwww.nature.com%2farticles%2fd42473-018-00014-2&c=13554616782825687063&mkt=en-us","summary":"In coming years, countless new products and services will be based ... already known to science has much to offer in the way of carbon mitigation, he says. Professor Adams has been studying ...","published":"Sat, 29 Sep 2018 05:15:00 GMT","published_parsed":"time.struct_time(tm_year=2018, tm_mon=9, tm_mday=29, tm_hour=5, tm_min=15, tm_sec=0, tm_wday=5, tm_yday=272, tm_isdst=0)","news_source":"Nature","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Technology meets humanity at Swinburne","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"In coming years, countless new products and services will be based ... already known to science has much to offer in the way of carbon mitigation, he says. Professor Adams has been studying ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Mitigation\" \"new products\"&format=rss","text":"Swinburne University of Technology research pursues impactful results. In coming years, countless new products and services will be based on new technologies. With so many promising applications of technology, we need to ask what the best investment of our resources, effort and ideas is. At Swinburne University of Technology, this is the deeply ingrained principle driving our research: technology must aim to achieve positive economic and social impact by improving people’s lives and the state of our planet through better and smarter applications. Put another way, new technologies that help people will be the ones that succeed. Our applied research at Swinburne is placed at the interface between technology and humanity. As a science and technology university, Swinburne’s fundamental research often leads to new discoveries and breakthrough technological solutions. At Swinburne, we are proud to pursue research with impact. Associate Professor Sonja Pedell focuses on technology development and design, especially new technologies that can benefit elderly users. The Robot Therapist is In As the Director of Swinburne’s Future Self and Design Living Lab, Associate Professor Sonja Pedell focuses on technology development and design, especially new technologies that can benefit elderly users. She has been examining how the NAO humanoid robot can stimulate mobility and interactions among people with dementia. “I think robots can help increase social interaction and feeling in touch with the world, but they can’t replace it.” Associate Professor Pedell introduced NAO to 30 seniors with dementia in a group setting. The robot was set up on a table and controlled via laptop demonstrating how to do hip stretches. The exercises and dances performed by the robot elicited a positive response from the seniors, who showed interest in it, clapping along with it and trying to communicate with it. “For me it meant that they had found something they were interested in and it wasn’t imposed on them,” says Pedell. The cyber detective Professor Yang Xiang, Dean of the Digital Research and Innovation Capability Platform is a world expert in Distributed Denial of Service (DDoS), a type of cyber-attack in which the perpetrator may use thousands of different internet addresses to flood a victim’s computer with attack code. To create an algorithm sensitive enough to detect these low-rate attacks, Xiang and co-workers borrowed a concept from physics called entropy, which represents the level of disorder in the universe. “We essentially measure the level of disorder in the network traffic, and the areas of high entropy indicate an attack.” Spotlight on Robotics To improve malware classification, Xiang and co-workers have used a ‘deep learning’ approach, inspired by artificial intelligence research aiming to develop electronic brains that learn and make decisions on their own. “Deep learning has two advantages,” says Xiang. “Firstly, it can analyse a huge number of malware samples without any human input. Secondly, it can provide us with very precise predictions regarding new versions of malware that are likely to appear. Previous malware classification algorithms were missing some of these finer details.” Most notably, he is using deep learning algorithms to analyze not only the source codes of network traffic, but also the underlying binary code. “These are much harder to analyse, but will give us a better indication of vulnerabilities,” he says. An app for greener homes After surveying 1,250 Australian households, Professor Peter Newton from Swinburne Centre for Urban Transitions was surprised to find that people professing to have strong environmental concerns used almost the same amount of resources as people with little interest in environmental issues. “People might say they have pro-environmental attitudes but when you look at consumption of electricity, gas and water; travel; housing space; and appliances, we found there was no difference between committed greens and environmental skeptics,” says Professor Newton. Since behaviour change is not guaranteed to reduce carbon consumption, Professor Kath Hulse, Director of the Centre for Urban Transitions, has investigated the benefits of communicating energy efficiency strategies to home renovators via an app. Renovations present a prime opportunity to improve the energy rating of existing homes, but it is often not a high priority for homeowners, says Hulse. “People spend a lot of time researching at the early stage of the project, so this is the ideal time to help people incorporate energy efficiency into their project.” Professor Adams, BioScience and Innovations at Swinburne University of Technology Finding the pulse of sustainability “Legumes can help with a whole lot of stuff. They can help reduce your water and fertiliser demand, and help produce ourdietary needs and wants,” says Mark Adams, Professor of BioScience and Innovation at Swinburne University of Technology. Further exploring just the legumes already known to science has much to offer in the way of carbon mitigation, he says. Professor Adams has been studying how nitrogen availability affects plants’ ability to absorb carbon. And just as the carbon cycle has been altered by human activity, so too has the nitrogen cycle. It is only now that questions are being raised as to what levels are sustainable, whether there are environmental impacts from too much available nitrogen, and how plants will respond to it. “The beauty of legumes is that biological nitrogen fixation is self-regulating. Once the plant has enough, it shuts it down. So if we were only relying on biological nitrogen fixation for our agricultural nitrogen we would have a much more sustainable system because it’s end-product inhibition.”","filter_flag":1}
