{"title":"Designing super-fast trimodal sponges using recycled polypropylene for organics cleanup | Scientific Reports - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00MTUwNi020gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00MTUwNi020gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00MTUwNi020gEA","guidislink":false,"published":"Tue, 29 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=241, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00MTUwNi020gEA?oc=5\" target=\"_blank\">Designing super-fast trimodal sponges using recycled polypropylene for organics cleanup | Scientific Reports<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Designing super-fast trimodal sponges using recycled polypropylene for organics cleanup | Scientific Reports - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00MTUwNi020gEA?oc=5\" target=\"_blank\">Designing super-fast trimodal sponges using recycled polypropylene for organics cleanup | Scientific Reports<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Waste-to-Value\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Creation of trimodal structure Factors affecting cavity size and opening Size of the cavity opening can be influenced by several factors, including: (a) Preheating of the solid substrate is required for large cavity openings, whereas small cavity openings do not require preheating, (b) The contact area between the cavity forming agent and the solid substrate should be high for large cavity openings. This can be achieved using a cubic or cuboid-shaped cavity forming agent. For small cavity openings, the contact area should be small, which can be achieved by using a spherical-shaped cavity forming agent, and (c) The viscosity of the polymer solution should be high for large cavity openings and low for small cavity openings. Factors affecting the size of macro-voids The size of the macro-voids can be affected by the following factors: (a) A small ratio of polymer to cavity forming agent is necessary for larger macro-voids, while a high ratio is required for smaller macro-voids, (b) The speed of rotation should be high for larger macro-voids and low for smaller macro-voids, and (c) The viscosity of the polymer solution should be low for larger macro-voids and high for smaller macro-voids. Role of rpm on the formation of macro-voids and cavity openings The formation of macro-voids and cavity openings can be influenced by the rpm (revolutions per minute). The recommended rpm ranges for different scenarios are: (a) For macro-voids with large cavity openings, the rpm should range from 600 to 900 with a preheated solid substrate, (b) For macro-voids with small cavity openings, the rpm should range from 600 to 900 without a preheated solid substrate, (c) For large cavity openings with no macro-voids, the rpm should range from 300 to 500 with a preheated solid substrate, and (d) For small cavity openings with no macro-voids, the rpm should range from 300 to 500 without a preheated solid substrate. Annealing Annealing was performed to prevent the collapse of the film structure due to its weak strength. During annealing, the polymer chained soften, realign, and restructure themselves. This leads to a more compact and dense structure with enhanced crystallinity, which ultimately increased the intermolecular dispersion forces. As a result, the film maintained its structural integrity. Optimum temperature and time of annealing were required to prevent polymer fluidization which might result in pores and voids collapsing. The melting induces the polymer chains to disorder and then reorganize themselves upon cooling under atmospheric conditions. DSC, XRD, and FTIR DSC was used to used to calculate % crystallinity through enthalphy change calculations as shown in Fig. 3a. The melting peak for PP was observed at around 170 °C and expectedly only one distinguished peak was found, confirming the presence of only PP. The enthalpy was found to be 112.32 J\/g, which was compared with 100% pure crystalline PP50. The as-prepared sorbent showed 54.2% crystallinity, which shows the semi-crystalline nature of the polypropylene. Figure 3b shows the XRD results of the PP sample. The characteristic peaks for PP were found to be at 14°, 17° and 19°, respectively. Moreover, the crystallinity from the XRD was calculated and was found to be 58%. The XRD outcome of semi-crystalinity support the DSC results. Figure 3 (a) DSC spectra of PP, (b) XRD spectra of PP, (c) FTIR spectra of PP. Full size image FT-IR was used to examine the functional groups, as shown in Fig. 3c. At 2836, 2869, 2919, and 2951 cm-1, C–H symmetric and asymmetric stretching peaks were observed. While at 1459 and 1376 cm-1, C–H symmetrical bending peaks were evident for PP. We observed a C–O peak at 1240 cm-1. This peak is due to ether linkage that creates crosslinking between polymer chains and provides strength. The fingerprint region of the FTIR spectra showed the stretching and rocking peaks of C–C and C-H bonds. SEM, tensile strength, and contact angle The SEM images exhibiting cavities, macro-voids, and micropores are shown in Fig. 4a,b. In these images, the PP can be viewed as a network resembling a fibrous web. The sizes of 3D swellable cavities and macro-voids are approximately 50–70 μm and 150–200 μm, respectively (see Fig. 4a). These swellable cavities enhance the sorption volume, and the size of cavities is controlled by the cavity forming agent (NaCl) size. The agent was properly mixed in the solution for even distribution of the cavities within the thin film, which is also evident by the SEM images. In addition, it was found that the glass substrate's temperature significantly influences how big the cavities' openings are. The macro-voids present in the thin film contribute to the sorption capacity as well as the oil diffusion and faster saturation. The dense micropores (~ 5 μm) can be seen in the close view (Fig. 4b), which facilitates oil sorption and oil retention due to cohesive and adhesive. These micropores also improve the retention capacity because of capillary action forces. Thus, the developed film is highly porous to accommodate high retention volume. Figure 4 SEM images of PP-based thin film sorbent (a) 3D cavities and macrovoids (b) close view showing micropores and macro-voids; 3D profilometry imaging of (c) top view and (d) bottom view of sorbent material. Full size image Moreover, the 3D-image projection of the cavities and macro-voids was obtained using profilometry (Fig. 4c,d). The 3D shapes of cavities are evident from the top and bottom views. The surface roughness facilitates oil sorption and retention. The oil from the cavities can be collected when the sorbent is mechanically compressed or washed with the solvent, and the sorbent is then utilized for another cycle. The structure of cavities contracts with compression to the thickness of the thin film, which retains its original inflated structure upon reuse and resorption. As a result, these cavities serve as expandable reservoirs. We investigated the tensile strength of sorbent films at various thicknesses, heating temperatures, and porosity. We employed an inorganic filler as a cavity forming agent with a particle size of 150–200 μm, with a 2:1 concentration of filler to polymer. The target was to develop a sorbent film that possesses both high porosity for effective sorption and sufficient tensile strength for commercial use. The results showed that the highest porosity of 82% was achieved at a temperature of 25 °C and a film thickness of 16 μm. However, the PP film was not in the form of a freestanding thin film, so the tensile strength was not determined. As the temperature increased to 150–160 °C, the porosity and film thickness decreased due to the condensing and close arrangement of the polymer chains. At 165 °C, a film thickness of 5 μm was obtained with good tensile strength of 10 MPa, but the porosity was less than 1%, which is not desirable for sorption. Therefore, the optimal conditions were found to be at 160 °C and 20 min, resulting in a 7 μm sorbent film with 34% porosity and a tensile strength of 5 MPa. This film had a good sorption capacity and was strong enough to be used as a freestanding thin film. Table 1 presents the effect of annealing temperature and annealing time on porosity and strength. Table 1 Effect of annealing temperature and annealing time on porosity and strength. Full size table The main application of the developed PP sorbent is to remove a thin layer of oil from the water surface. For this purpose, the sorbent material should possess hydrophobic properties. Therefore, contact angles were measured for water, engine oil, toluene, and sunflower oil, as shown in Fig. 5a–d. It was found that the contact angle is 116.2° for water, which was desired. For toluene, engine oil, and sunflower oil, the contact angles were found to be < 1°, 16.1°, and 26.5°, respectively. After 15 s, the contact angles were measured, where we observed a rapid decrease in the contact angle, which was attributed to the fast spreading of fluid over the sorbent surface, sorption inside the surface, and helped in quick penetration of fluid into the porous structure. Figure 5 Sorbent film’s contact angle measurements for (a) water, (b) toluene, (c) engine oil, and (d) sunflower oil, at 0 s and 15 secs. Full size image Organic sorption The cavities, macro-voids, and micropores in the thin film sorbents allowed for substantial oil retention volume and oil penetration. The cohesion and adhesion forces between oil molecules in the sorbent's structure and on its surface, as well as the adhesive forces between the sorbent and oil, were responsible for the improved oil retention capacity. These sorbents are inert in nature, do not degrade when used for oils, and can be recycled and reused. The oil was immediately adsorbed onto the surface as it came in contact with the thin film sorbent. When the oil permeated the sorbent and the cavities over time, the absorption capacity increased. The dripping kinetics of PP sorbent is shown in Fig. 6a. The as-prepared sorbent followed an uptake mechanism which was a combination of the following: (a) cohesion between oil molecules trapped inside the internal structure of the oleophilic film (pores, macro-voids, and 3D-cavities) and on the surface, resulting in a strong capillary action; (b) adhesion between oil and sorbent molecules, such that higher viscous oil tended to adhere more at the rough surface; and (c) higher surface area to thickness ratio, providing maximum available sites for oil uptake. A combination of adhesion, cohesion, and a large internal surface area plays a significant role in the oil uptake and retention mechanism51. The immediate capacity of sorbent reached a maximum of 97 g\/g, and as the dripping started, the capacity decreased and reached the equilibrium state of 52 g\/g. Figure 6 (a) Dripping kinetics exhibiting sorption capacity using engine oil (inset, sorbent after oil sorption), (b) sorption capacity with time for immediate and equilibrium conditions using engine oil, (c) performance comparison of PP sorbent with commercial sorbents, and (d) uptake capacity for different oils. The experiment was repeated five times and the standard deviation was reported as the error bars. Full size image To find out how quickly the oil sorbent reached its maximal absorption capability, the saturation kinetics of the sorbent was studied, as shown in Fig. 6b. The trimodal structure of the sorbent allows absorbing the oil quickly as it reaches maximum capacity in 30 s for both immediate and equilibrium conditions. The saturation kinetic capabilities showed no noticeable change, much as the dripping kinetics. Furthermore, the sorbent was compared with the commercial sorbents, available as pads in Fig. 6c. It can be seen that the sorption capacity of the PP sorbent is around three times that of the commercial sorbents. Moreover, our sorbents are better suited for removing thin oil layers from water. Figure 6d shows the performance comparison of our sorbent for toluene, sunflower oil, paraffin oil, crude oil, and engine oil. With different oils, differing uptake volumes can be observed; this is because the oils have different viscosities and affinities with the sorbents. The sorbent was found to have a higher uptake capacity for engine oil and crude oil. The oleophilic nature of the sorbents and the 3D-structural design of the cavities are responsible for the good uptake capacity of organic solvents like toluene demonstrated despite their lower viscosity. A total of 55 independent films were used for these experiments. The experiment was repeated five times and the standard deviation was reported as the error bars. Oil–water separation efficiency Oil spills on the water surface make it difficult to collect only oil by repelling water; we looked into oil–water separation experiments to understand the effectiveness of the sorbents in practical applications. The selective separation demonstrated strong oil selectivity over water and can be utilized to adsorb and separate oil from water, as shown in Fig. 7. These films have a stronger affinity for oil than for water because they are superoleophilic and hydrophobic. They only absorbed oil and repelled water when placed on thin oil coatings that were placed on the water. A 100 ml volume of water containing various oil concentrations was taken, and a 25 cm2 thin film sorbent is placed on the surface. Up to 400 ppm of oil concentration, the separation efficiency was more than 95%. The capacity of the sorbent to absorb water decreased as the percentage of oil in the water increased. This issue can be solved by using a larger sorbent. Nonetheless, the oil selectivity was over 99.5%, and the water retention was less than 0.5%. Figure 7 Sorbent efficiency for different oil concentrations in water. Full size image Recyclability To determine whether the sorbent may be reused, the recyclability test was conducted. The sorbents must be strong enough to be reused repeatedly without losing their ability to absorb the material and without causing the structure to collapse. The sorbent thin films were annealed following spin coating. After the sorption and desorption of oil from the sorbent structure, the annealing procedure aided in increasing the mechanical strength of the thin film, making the sorbent a reusable product. The recyclability test was carried out for ten cycles for both immediate and equilibrium conditions, as shown in Fig. 8. Figure 8 Recyclability of PP-based sorbent for immediate and equilibrium conditions. Full size image Both mechanical squeezing and solvent washing have been utilized to reuse the sorbent films. The mechanical squeezing technique is the most effective for recycling the sorbent, but a small amount of oil is trapped inside the material since pressing won’t be enough to get rid of oil from the pores. When the sorbent is reused, the thin film cavities retain their structural integrity and absorb the oil to their maximum capacity. Hence, mechanical squeezing facilitates oil collection easily and rapidly, with a 97% efficiency. On the contrary, the solvent-washing approach takes a lot of time but is completely effective in terms of oil recycling. This procedure involves squeezing the oil after oil sorption and submerging the sorbent in hexane which dissolves the oil and thoroughly cleans the sorbent. Furthermore, the sorbent film's maximum capacity for absorption was effectively utilized after being reused. Finally, the oil and hexane were separated by evaporating the hexane solvent in a rotary evaporator. With the solvent washing procedure, 100% efficiency was achieved. It was observed from the SEM investigations that the oil sorbent before and after oil sorption showed the retention of cavities without structural disintegration, see Fig. 9a. During the oil sorption, the sorbent absorbed and retained the oil on the surface and cavities get swollen showing the oil meniscus, see Fig. 9b. After 10 cycles, the oil was removed and washed with nonpolar solvent, the cavity structures were retained and the surface showed no damage, see Fig. 9c. And thus, these sorbents can be used for repeated times. Figure 9 SEM images of oil sorbent (a) before oil sorption, (b) during oil sorption, (c) after oil sorption. Full size image Kinetics study In Fig. 10, both pseudo-first order (PFO) and pseudo-second order (PSO) models were used to model the uptake kinetics. The resulting plots were then used to determine the sorption constants, which are listed in Table 2. The sorption capacity (qe) is a parameter that affects the value of ‘k’. Figure 10 Modelling of sorption kinetics based on (a) non-linear form of Pseudo First-Order Model (b) linear form of Pseudo First-Order Model (c) non-linear form of Pseudo Second-Order Model and (d) linear form of Pseudo Second-Order Model. Full size image Table 2 Fitted parameter values of kinetic models. Full size table Sorption kinetics of dripping at retention value in comparison with measurements immediately done after sorption showed higher rate constant. The value of qe will also decrease over time as loosely connected oil drips off from the sorbent sponge until equilibrium is reached with no more dripping. From the Table 2 it can be observed that the (q e ) which is the sorption capacity at final stage is predicted in good agreement with PFO. Moreover, Fig. 10d shows good agreement of PSO for both the stages of sorption. But comparatively, it can be seen from Fig. 10a,c that PSO is a good fit at initial stage of sorption whereas PFO is in good agreement at the final stage of sorption.","filter_flag":1}
{"title":"Trützschler and Balkan join forces for textile recycling - The Textile Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi90cnV0enNjaGxlci1hbmQtYmFsa2FuLWpvaW4tZm9yY2VzLWZvci10ZXh0aWxlLXJlY3ljbGluZy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi90cnV0enNjaGxlci1hbmQtYmFsa2FuLWpvaW4tZm9yY2VzLWZvci10ZXh0aWxlLXJlY3ljbGluZy_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi90cnV0enNjaGxlci1hbmQtYmFsa2FuLWpvaW4tZm9yY2VzLWZvci10ZXh0aWxlLXJlY3ljbGluZy_SAQA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi90cnV0enNjaGxlci1hbmQtYmFsa2FuLWpvaW4tZm9yY2VzLWZvci10ZXh0aWxlLXJlY3ljbGluZy_SAQA?oc=5\" target=\"_blank\">Trützschler and Balkan join forces for textile recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Trützschler and Balkan join forces for textile recycling - The Textile Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi90cnV0enNjaGxlci1hbmQtYmFsa2FuLWpvaW4tZm9yY2VzLWZvci10ZXh0aWxlLXJlY3ljbGluZy_SAQA?oc=5\" target=\"_blank\">Trützschler and Balkan join forces for textile recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","source.href":"https:\/\/www.indiantextilemagazine.in","source.title":"The Textile Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Waste-to-Value\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The cooperation with Balkan Textile Machinery. INC.CO completes our product portfolio for recycling by cutting and pulling solutions, making us the first full-liner in spinning preparation for recycling! Thanks to our combined machinery expertise and technological know-how our customers can produce yarns at the highest possible quality level – and literally turn waste into value. Markus Wurster, Director Sales and Marketing at Trützschler Group, (left), and Osman Balkan, Owner of Balkan Textile Machinery INC.CO. We are happy to introduce Balkan Textile Machinery. INC.CO, a partner that not only complements our product line but also shares our values. Both Balkan and Trützschler are family-owned companies for whom sustainability in the textile chain is a major concern. Balkan is well established in Turkey, one of the most important markets for textile recycling. Their robust and reliable machines help to cut, mix and tear textile waste to individual fibers, and to press them into bales of secondary fibers. These bales can be fed to the preparation process with Trützschler machines. “We are now able to provide a complete line-up of technologically leading machinery which has been specifically developed for rotor and ring yarns from recycled materials”, says Markus Wurster, Director Sales and Marketing at Trützschler Group. “Customers benefit from less complexity when planning and executing a mill project. The combined processes from Trützschler and Balkan are perfectly fine-tuned, reliable and reproducible. And of course, customers have access to Trützschler’s premium service.” Osman Balkan, Owner of Balkan Textile Machinery. INC.CO, adds: “I am very happy that we can join forces with such a strong international player like Trützschler. Together we can make a significant contribution to dealing with textile waste globally.” From waste to value: Balkan and Trützschler process for the recycling of hard textile waste. Processing secondary fibers with appropriate card clothing Of course, appropriate card clothing is part of our complete recycling solution. Trützschler Card Clothing continuously developed their card clothing to meet the technological challenges in the processing of secondary fibers and to improve the resulting yarn quality. Special attention has been paid to the flat top as the heart of the carding process. Trützschler Card Clothing has combined the strength of MT\/PT 40 and the cleaning power of MT\/PT 45, resulting in the development of the MT\/PT 45R – the new flat top for recycled materials. The right combination of flat top and cylinder wire is the key for yarn quality. Therefore, Trützschler Card Clothing offers various cylinder wires suitable for different recycling applications depending on production rates, type of textile waste and raw material – pure or blends. Thanks to this specification, customers can benefit from the best possible carding result, long lifetime of wires and high production in recycling applications. MT\/PT 45R flat top for recycling “We are excited to offer our customers globally a complete package for recycling from June 2023 onwards”, says Markus Wurster, “including tearing line, blow room, card, draw frame, card clothing and of course our service and technological know-how.” TRUECYCLED stands for state-of-the art recycling installations from Trützschler. These Trützschler preparation processes enable manufacturers to achieve a high-quality end-product from hard waste. With TRUECYCLED, manufacturers can rest assured they use the best technology and a reliable and reproducible manufacturing process – the pre-requisite for high-quality yarn made from hard textile waste. How does a TRUECYCLED process look like? It is based on Trützschler’s technological recommendations and a Trützschler machinery line-up to ensure ideal results from recycled materials. For example, Trützschler recently worked with a fashion company to make use of their own pre-consumer waste. Thanks to a special combination of Trützschler blow room machinery, the usage of TC 19i for Recycling and Trützschler draw frames, it was possible to create a ring yarn containing 60% of pre-consumer waste – a true TRUECYCLED product! Trützschler customers and partners may use the brand TRUECYCLED for both the process itself and the end-product, as long as it contains a significant amount of textile waste.","filter_flag":1}
{"title":"Celebrating 75 Years of the Very Best Kiwi Farming - MiNDFOOD","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3Lm1pbmRmb29kLmNvbS9hcnRpY2xlL2NlbGVicmF0aW5nLTc1LXllYXJzLW9mLXRoZS12ZXJ5LWJlc3Qta2l3aS1mYXJtaW5nL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3Lm1pbmRmb29kLmNvbS9hcnRpY2xlL2NlbGVicmF0aW5nLTc1LXllYXJzLW9mLXRoZS12ZXJ5LWJlc3Qta2l3aS1mYXJtaW5nL9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3Lm1pbmRmb29kLmNvbS9hcnRpY2xlL2NlbGVicmF0aW5nLTc1LXllYXJzLW9mLXRoZS12ZXJ5LWJlc3Qta2l3aS1mYXJtaW5nL9IBAA","guidislink":false,"published":"Tue, 22 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3Lm1pbmRmb29kLmNvbS9hcnRpY2xlL2NlbGVicmF0aW5nLTc1LXllYXJzLW9mLXRoZS12ZXJ5LWJlc3Qta2l3aS1mYXJtaW5nL9IBAA?oc=5\" target=\"_blank\">Celebrating 75 Years of the Very Best Kiwi Farming<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MiNDFOOD<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Celebrating 75 Years of the Very Best Kiwi Farming - MiNDFOOD","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3Lm1pbmRmb29kLmNvbS9hcnRpY2xlL2NlbGVicmF0aW5nLTc1LXllYXJzLW9mLXRoZS12ZXJ5LWJlc3Qta2l3aS1mYXJtaW5nL9IBAA?oc=5\" target=\"_blank\">Celebrating 75 Years of the Very Best Kiwi Farming<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MiNDFOOD<\/font>","source.href":"https:\/\/www.mindfood.com","source.title":"MiNDFOOD","query":"https:\/\/news.google.com\/rss\/search?q=\"Waste-to-Value\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"According to Māori legend, the silver fern once lived in the sea. It was asked to come and live in the forest to guide the Māori people, where hunters and warriors used the fern’s silver underside to find their way home as fronds were bent over to catch the moonlight and shine a path through the forest. For 75 years, Silver Fern Farms have been shining a path since 1948, a pivotal year of rapid change across New Zealand. New Zealand’s population had not yet hit two million, that didn’t happen until 1952. Back in 1948, George VI was on the throne and Peter Fraser was the Labour Prime Minister. It was also the year the company Primary Producers Co-operative Society, trading as PPCS, was registered – today better known as Silver Fern Farms. Seventy-five years ago we saw the abolition of tea, sugar and meat rationing, introduced during WWII. “Rationing had been a burden,” said Mr E. R. Blanchard, President of the Canterbury Master Butchers Association being interviewed by the Christchurch Press at the time. “It will be a big relief to trade, and it was likely that the sale of offal meats, such as tripe, and manufactured goods, such as sausages and saveloys would drop, and the demand for steaks and chops will increase.” Another change was happening on the food front within Kiwi homes. Towards the end of the Depression of the 1930s, a time when low household incomes went hand in hand with aggravated health and dental problems, The New Zealand Women’s Food Value League was formed. The League’s principal objectives were to improve food standards and to educate the public in “the grammar of nutrition”. By 1948, having pioneered nutritional work in New Zealand, the League disbanded and the educational void left was picked up by the Department of Health to carry out public instruction in nutrition that also saw Plunket nurses educate mums about the importance of a balanced diet and nutrition. Now consumers increasingly want to eat only the very best when they choose meat as an option, the perception of quality is changing, evolving to be less about just ‘me’ and my tastebuds, to be more about the entire planet and the environment, respect for the land and animals, caring from start to finish, and a passion for the very best ingredients and the difference that makes. In New Zealand, the climate, clean air and plentiful pure water fuel the year-round growth of lush, green pastures. As diligent guardians of the land and environment, Silver Fern Farmers are committed to raising animals on this pasture, with the ability to roam and graze freely with little intervention. Allowing the animals to eat and live as they would naturally reduces stress and means better animal welfare. Silver Fern Farmers’ ability to grow quality, nutritious grass means they produce animals more naturally, the result is high- quality, tasty, tender red meat. A diet of nutrient-rich grass produces natural marbling and gives a fine, delicate texture. The Highest Standards Barry and Heather Gray with son Richard and daughter-in-law Juliet farm together at Hakataramea Station in Canterbury, with more than 30,000 stock units including deer, sheep and cattle. “We have very healthy country up here, it’s good for animal health,” says Barry. As Silver Fern Farmers they are required to ‘make the cut’ as their beef is given an Eating Quality (EQ) System® mark that indicates it is of the highest standard for tenderness, juiciness and flavour every time. Understanding the consumer is at the core of the company’s Plate to Pasture strategy, which was introduced in 2010. As a marketer and producer of food, Silver Fern Farms understand the expectations consumers have for premium quality, natural, grass-fed red meats for a delicious meal experience. Silver Fern Farmer Fiona Hancox from Kowai Downs, a picturesque Tapanui property, one of three West Otago sheep and beef farms she owns with husband Nelson, has always admired the attention paid to the consumer. “Silver Fern Farms has the correct focus in that we’ve got to be aware of what the consumer wants,” she says. “There’s no sense in us as farmers producing food if the consumer doesn’t want that type of food. I’ve really always liked how proactive Silver Fern Farms have been in marketing and considering the consumer; I think Plate to Pasture is a really good concept.” Silver Fern Farmers William and Emily Beetham have set themselves high expectations at Brancepeth, one of New Zealand’s oldest stations in Wainuioru, situated 15 minutes’ east of Masterton in the Wairarapa. The 32-room Brancepeth homestead was added to the original structure built in 1856 and is registered with Heritage New Zealand under its highest ranking, Category 1. Although their farm is steeped in history, the Beethams have welcomed a new era in farming, where the focus is on a sense of community, people and partnerships. The attention to detail and focus this young couple have around best practice in farming and building a business is impressive. Treasuring rural community relationships, they consider all aspects of the environment in all their decision-making. “Yes, we are committed to enhancing the quality of soil, water, flora and fauna, respecting our animals and accepting responsibility for their welfare and recognising their dependency on our actions,” says William. “We have high expectations, and therefore must uphold the highest standards and be open and honest. It is also always about the people.” And this attitude is something all generations of the Beetham family have clearly understood. Each generation of the Beetham family over the years has learnt to speak Māori, as close relationships with local iwi are a priority. Kiwi feathered cloaks were presented to the subsequent new generation of Beethams at their christenings as a mark of mutual respect. In 2021 Silver Fern Farms ratified a programme of work to lean in to their bicultural space. Te Ara Huri (a turning pathway) was introduced to the business to enrich understanding and strengthen connect to Te Ao Māori. Silver Fern Farms Te Ara Huri framework is headed up by Kaiarataki Ricky Fife whose responsibility is to implement, advocate and support business initiatives aligned to Te Ara Huri. Recently launched to the organisation under the korowai (cloak) of Cultural Progression, one of the four main pillars of Te Ara Huri is their Te Maunga Teitei (Reaching for the Summit) programme, aimed to support understanding and connection from a bicultural perspective. A series of online foundation learning modules have been released to the business discussing important concepts related to Māori values, Māori society, Te Reo Māori, Treaty of Waitangi as well as what Te Ara Huri and Māori development means to Silver Fern Farms. Silver Fern Farms is committed to becoming more diverse and inclusive across their organisation through a range of initiatives supporting the growth and development of its people. This, paired with the breadth of Silver Fern Farms’ operational footprint, means they understand their interdependencies within respective communities as well as the importance of genuine partnerships and relationships with mana whenua, hapū and whānau and the importance these partnerships play in the social, cultural and economic licence that enables enduring value for their people, communities and environments. As a significant regional employer, Silver Fern Farms is actively committed to the development of Māori within their business, wanting to play a part in mentoring young Māori leaders for the future. This is achieved through working proactively with local mana whenua in the regions ensuring Silver Fern Farms understand their views and perspectives, wanting to make a positive contribution to the communities they operate in when it comes to the guardianship of water, land and other natural resources. On the East Coast of the North Island of Aotearoa New Zealand, lies Whāngārā, a small community north of Gisborne. A place where rolling green hills look across the ocean, where the sun first rises, and where looking after the land is a top priority. Whāngārā Farms is made up of six farm units, with a total land size of 9,000 hectares, growing 100% grass-fed beef and lamb supplied to Silver Fern Farms, and delivered to global consumers under a trusted New Zealand brand. Whāngārā Farms is now owned by a collective of three Māori Incorporations, with around 2,000 joint shareholders, who work as a collective to manage the business in a way that prioritises intergenerational care and value. The day-to-day running of the farm units by a team of passionate staff is managed by General Manager, Richard Scholefield. “We need to get young people interested in farming, and into the business of farming,” he says. “There are so many opportunities within farming now.” Those core values of nurturing the land and business and developing it for future generations, are key to the way that Scholefield and his team go about their work. “Sustainability is the key. Being in a Māori incorporation, the land can’t be sold, so we’re here for future generations. Decisions that we make today are going to affect future generations, and I think we have to be really mindful of it. Being environmentally sustainable goes hand in hand with everything that we do on the farm, our policies and procedures, our decisions and our systems,” Scholefield says, referring to a project undertaken with Silver Fern Farms. “We went through our properties and did a land environmental plan to the highest standard that we could,” he explains. “It has fully changed the land-use capability of our farm, all the different soil types, and then given a priority list of the ways to manage it in the most environmentally sound way.” Technological Innovation FarmIQ is another innovation employed by Silver Fern Farms to help farmers record and trace information about their stock, enabling them to make more informed decisions about how they farm and match what they produce to what consumers want to eat Silver Fern Farms works closely with farmers, collecting and sharing information, key insights and feedback from consumers before trialling new techniques on the farm. In line with the New Zealand Farm Assurance Programme, stock are treated with the utmost care and respect at every step where all cattle and deer are individually tagged on the farm under the National Animal Identification and Tracing system and tracked using radio-frequency identification (RFID) technology. The company’s production processes are rigorously tested and audited to ensure they meet the highest standards set here in New Zealand by the Ministry of Primary Industries and internationally such as The United States Department of Agriculture (USDA) and British Retail Consortium (BRC). In addition, integrated farm planning is also an integral part of the recently implemented New Zealand Farm Assurance Plus Programme, which aims to protect and enhance all natural resources, including soil and water, improve biodiversity, create better and more sustainable farming businesses and incorporate a higher level of socially responsible and ethical practices. Nicola Johnston, General Manager of Growth for Silver Fern Farms says, “Alongside the Farm Assurance Plus Programme, we are also encouraging our farmers to embrace technologies that will help better capture on-farm data and enhance measurement of farming outcomes and impacts. All this will ensure we can deliver a truly authentic, evidence-based promise to consumers, that’s trust you can trace back.” Better Quality Guaranteed The Silver Fern Farms Eating Quality (EQ) System® is a science-backed grading process that allows the company to guarantee the consumer a better eating experience, with 7 criteria to contribute to the eating quality of red meat. It stands behind the Master Graders’ promise of beef that consistently meets the highest standards of taste, tenderness and juiciness. Cuts are hand- selected by an Accredited Master Grader and then aged with care for at least 21 days. Over the years Silver Fern Farms has narrowed down what attributes make up their elite product and over two years were part of an extensive study in which more than 95,000 samples of beef were tasted by 13,700 people in New Zealand and the US. The collaborative study with, Texas Tech University in the USA, Silver Fern Farms and Otago University in New Zealand was used to determine the factors affecting eating quality. It involves a technical process done by hand by Silver Fern Farms Eating Quality (EQ) System® accredited master graders, who are re-tested every eight weeks to ensure they’re all grading the meat correctly, as per the study’s findings. Silver Fern Farmers like the Grays and Hancoxes work with their trusted Silver Fern Farms drafter, who provides them with information allowing them to raise better-tasting beef. For example, they must keep the pH of the animals low, which means ensuring the animals are stress-free. They do take measures to keep the animals calm and it shows out in the field, where the stock are curious rather than nervous. Silver Fern Farms introduced a new 100% Standard Lamb Programme, which means certified farms have the ability to supply stock, where lamb is 100% grass-fed, antibiotic-free, has no added hormones, GMO-free and doesn’t use feedlots. This may be taken for granted in NZ but on the world stage, this is something of a rarity. Silver Fern Farms has in recent years made a transformative shift in how they think about sustainability that is fundamental to delivering enduring value for their people, communities and farmers. As a company, they view sustainability as a journey, not a destination. “We see the transition to a low-carbon economy as an opportunity, rather than a risk,” says Johnston. “We trust this lens will ensure our business and our farmers’ businesses will remain resilient and relevant for the next 75 years.” A Sustainable Future Silver Fern Farms is New Zealand’s first meat company to develop a sustainability programme and to have a verified carbon footprint with an industry-leading emissions reduction programme. Kate Beddoe, Chief Sustainability & Risk Officer, says as a company, “We are reshaping our business to be future fit. The company has recently renewed their purpose to ‘Creating Goodness From the Farms the World Needs’ with a focus on enduring value”. Silver Fern Farms has also joined the International Science Based Targets initiative (SBTi) and has achieved Toitū enviromark diamond certification, the highest New Zealand-based environmental certification. They are also a founding member of the Centre for Climate Action Joint Venture, which is all about putting real tools into the hands of farmers to reduce methane emissions. Net Carbon Zero is a unique programme with activity occurring across the business, including on farms through insetting the carbon sequestration (the capturing, removal and storage of carbon dioxide CO2 from the earth’s atmosphere), and in market delivering an independently certified, USDA-approved and trusted net carbon zero meat product to consumers. The key to this methodology is insetting, ensuring that the carbon produced by the product and its journey to the consumer is absorbed by the local environment. New Zealand has a uniquely biodiverse farming environment, with on-farm vegetation including regenerating native bush, woodlot forests, shelter belts, summer shade and winter animal shelter, and erosion and riparian planting. The company launched its first net carbon zero-certified beef in the US last year and is looking to expand the program to other markets and products in the future, representing the future direction of the company. “We are not outsourcing our emissions – rather we are recognising and incentivising our farmers for their efforts to create farm environments that are better able to capture carbon, increase biodiversity and support nature-positive food production,” says Silver Fern Farms Chief Executive Simon Limmer. “In New Zealand, we have a deep connection to nature, and caring for the environment is part of who we are. With our Net Carbon Zero range we want to show we can produce great-tasting red meat in a way that is better for the planet.” Consumers can expect even more innovation from the company in the future, using every part of the animal from nose to tail responsibly, so the brand will broaden the focus beyond red meat, generating a number of new products to add to their portfolio. From offals to pet food ingredients, collagen to pharmaceuticals, tallow to edible oils, the company intends to find new opportunities to reach consumers with new solutions and create additional value by adopting circular thinking to transform waste to value. For 75 years Silver Fern Farms have had a unique grass-based farming system here in New Zealand, it is something that the world wants and will increasingly value into the future. From the delicious and nutritious options that the company produce, to the way they farm them, ethically and sustainably, Silver Fern Farms are passionate about supporting farmers to continue to lead the way in nature-positive food production, creating goodness from the farms the world needs. For more information, visit silverfernfarms.com MiNDFOOD Promotion","filter_flag":1}
