{"title":"Cubot Note 21: Review of a budget smartphone - Root-Nation.com - Root-Nation.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcm9vdC1uYXRpb24uY29tL2VuL2dhZGdldHMtZW4vc21hcnRwaG9uZXMtZW4vZW4tY3Vib3Qtbm90ZS0yMS1yZXZpZXcv0gFNaHR0cHM6Ly9yb290LW5hdGlvbi5jb20vZW4vZ2FkZ2V0cy1lbi9zbWFydHBob25lcy1lbi9lbi1jdWJvdC1ub3RlLTIxLXJldmlldy8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcm9vdC1uYXRpb24uY29tL2VuL2dhZGdldHMtZW4vc21hcnRwaG9uZXMtZW4vZW4tY3Vib3Qtbm90ZS0yMS1yZXZpZXcv0gFNaHR0cHM6Ly9yb290LW5hdGlvbi5jb20vZW4vZ2FkZ2V0cy1lbi9zbWFydHBob25lcy1lbi9lbi1jdWJvdC1ub3RlLTIxLXJldmlldy8?oc=5","id":"CBMiTWh0dHBzOi8vcm9vdC1uYXRpb24uY29tL2VuL2dhZGdldHMtZW4vc21hcnRwaG9uZXMtZW4vZW4tY3Vib3Qtbm90ZS0yMS1yZXZpZXcv0gFNaHR0cHM6Ly9yb290LW5hdGlvbi5jb20vZW4vZ2FkZ2V0cy1lbi9zbWFydHBob25lcy1lbi9lbi1jdWJvdC1ub3RlLTIxLXJldmlldy8","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcm9vdC1uYXRpb24uY29tL2VuL2dhZGdldHMtZW4vc21hcnRwaG9uZXMtZW4vZW4tY3Vib3Qtbm90ZS0yMS1yZXZpZXcv0gFNaHR0cHM6Ly9yb290LW5hdGlvbi5jb20vZW4vZ2FkZ2V0cy1lbi9zbWFydHBob25lcy1lbi9lbi1jdWJvdC1ub3RlLTIxLXJldmlldy8?oc=5\" target=\"_blank\">Cubot Note 21: Review of a budget smartphone - Root-Nation.com<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Root-Nation.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cubot Note 21: Review of a budget smartphone - Root-Nation.com - Root-Nation.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcm9vdC1uYXRpb24uY29tL2VuL2dhZGdldHMtZW4vc21hcnRwaG9uZXMtZW4vZW4tY3Vib3Qtbm90ZS0yMS1yZXZpZXcv0gFNaHR0cHM6Ly9yb290LW5hdGlvbi5jb20vZW4vZ2FkZ2V0cy1lbi9zbWFydHBob25lcy1lbi9lbi1jdWJvdC1ub3RlLTIxLXJldmlldy8?oc=5\" target=\"_blank\">Cubot Note 21: Review of a budget smartphone - Root-Nation.com<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Root-Nation.com<\/font>","source.href":"https:\/\/root-nation.com","source.title":"Root-Nation.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Robust design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Cubot is a Chinese company that was founded in 2012 and is still trying to win the hearts of Europeans. The brand has a number of models that meet the most diverse needs of users, including the King Kong series with a robust design, the Cubot X line with powerful processors and decent photo capabilities, etc. But the company does not stop there, new products appear on the market, such as the hero of our today’s review – Cubot Note 21. What can this “Chinese” offer us? Is it worth paying attention to this budget device? Let us explain! Cubot Note 21 technical specifications Display: 6.56″, IPS LCD, 720×1612 pixels, density ~269 ppi, 90 Hz Chipset: Unisoc T606 Graphics: Mali-G57 Charging: 10 W RAM: 6 GB ROM: 128 GB Wireless networks: Wi-Fi 802.11 a\/b\/g\/n\/ac, Bluetooth 5.0, A-GPS, GLONASS, BDS, GALILEO, optional: Accelerometer, Contactless, Compass Main camera: 50 MP Samsung S5KJN1, 2 MP f\/2.4 macro sensor, 1080p@30 fps video recording Front camera: 8 megapixels Battery: 5200 mAh Operating system: Android 13 Dimensions: 165.70 x 75.90 x 10.55 mm Weight: 214 g Colours: black, blue, orange Read also: Cubot Kingkong Power smartphone review: unbreakable powerbank with torch Positioning and price The device is already on sale on AliExpress and in some European stores for about $100. Currently, smartphones at this price point don’t offer super-high performance or sufficient functionality, but what about our hero? We’ll tell you next. In addition, we have a choice of colours: black (as in our test) and brighter blue and orange. Package contents The package includes a charger with USB Type-C, a SIM eject tool, a plain transparent case, a protective glass and documentation. I think that for such a budget device, the contents of the box are superb – there is everything, and, of course, no one expects a top-of-the-line case or additional accessories. If the Note 21 is a gift for an elderly person or a child, then this set will be quite acceptable. Design, materials and build We have a classic design for a mid-range phone – plastic everywhere, a large “chin”, rather large screen bezels, and an outdated teardrop-shaped notch for the front camera. Cubot Note 21 1 - 3 As I already mentioned, the front panel does not please us with its thinness, the screen takes up a little less space and protrudes. On the right side, we find all the functional, but plastic buttons – a double volume button and a power button. Another simplification is the absence of a fingerprint scanner. On the left, we see a combined slot for two nanoSIM cards or for a single SIM card paired with a regular microSD card. However, it would be nice to see a triple slot. At the bottom, in the centre, there is a USB Type-C port, as well as 12 round holes for a microphone and speakers. - Advertisement - The back panel, on the other hand, looks quite good, with one expressive element, namely the camera island, which occupies ⅓ of the entire “back” and does not protrude above the body, which provides additional comfort. There are camera modules on the island, as well as a flashlight and a strange inscription “HD Camera, Professional Phone”. In daylight, the black model turns “grey”, even though we have ordinary plastic on the back. I think other colour options will look just as good, or maybe even better. But let’s get back to the design of the rear panel of the device. I want to praise the matte finish. It’s definitely nicer than the terrible gloss of competitors. Another advantage is that it shows no signs of use at all and you can do without a case. Read also: Cubot X30 review. Testing the Capabilities of Affordable Flagship Lookalike Ergonomics The phone is not one of the thinnest or lightest devices. However, my hands did not get tired during the entire time of use, so it is more likely that the user’s personal habits play a role here. Smartphone dimensions: 165.7 × 75.9 × 10.55 mm, and the weight is 214 g. The body is not wide and, with some skill, the phone can be used with one hand. Cubot Note 21 display The display has a diagonal of 6.56″, an IPS LCD matrix and a resolution of 720×1612 pixels. The density is 296 ppi and the refresh rate is higher than the standard 90 Hz. The screen is definitely the trump card of the novelty – it is bright, and the maximum brightness is comfortable both indoors and outdoors. The display has a low resolution, but the detail is decent. We were also pleased with the wide viewing angles. The refresh rate is 90 Hz, so scrolling looks smooth. - Advertisement - In the settings, you will find the main screen settings: font, dark mode, colours and contrast, and night light. Performance The Note 21 is powered by the low-cost Unisoc T606 chipset, which is manufactured on 12nm technology and has 8 cores (2×1.6 GHz and 6×1.6 GHz). It is supported by a MAli-G57 graphics card and 6 GB of RAM. The RAM is a bit lacking, but you can add 6 GB of virtual memory at the expense of fixed memory, and the effect is immediately noticeable! There is 128 GB of permanent memory. Not much, but fortunately we have a microSD card slot. But you can use either two SIM cards or one SIM + microSD. Most of the time, the phone works smoothly, but there are still lags and slowdowns. Of course, it copes with simple everyday tasks: instant messaging, social media, browser, etc. Basic games work well, but demanding applications are unlikely to boast of speed and smoothness (40-50 frames per second maximum), although you can always reduce the graphics settings. I should add that the model does not heat up at all. Read also: Cubot KingKong 7 review: Inexpensive Rugged Smartphone Note 21 cameras The photographic equipment looks modest: only an 8-megapixel selfie camera and a 50-megapixel main sensor, and, yes, there is also a useless 2-megapixel macro camera. How do these modules work in practice? The selfie camera can’t boast of detail or natural colours, all the photos were artificial and seemed to bleach my face even more. The main camera is the best: it takes decent photos for the price. Of course, the shots are not up to the level of more expensive models, but still, if you are patient, you can take quite acceptable pictures. I say this because you have to stand still for a few seconds to get good photos. Cubot Note 21 photo 1 - 10 As for night photography, the situation is ambiguous: on the one hand, I had to darken the frame to make the visible elements clearer. On the other hand, when the camera “saw” illuminated inscriptions or lanterns, the situation improved, and I liked the pictures. The video quality is also quite low, with a maximum of 30 frames per second in Full HD. The camera app has a lot of features, but I personally found some of them unnecessary, such as memory tracking or volume control. I’m not saying that they are completely unnecessary, but maybe not on such a budget phone. The rest of the functions are clear, and the shooting process could be improved if necessary. Unlocking methods The smartphone has several ways to unlock it: a pattern, PIN, password and face recognition. And, unfortunately, it doesn’t have the most popular one – a fingerprint scanner, which is a shame, because it’s simple and reliable. I used the PIN code every day, but someone might choose a different method. For example, facial recognition works well and is relatively fast, but is only available when there is at least some ambient light. Read also: Infinix NOTE 30 Pro review: The perfect mid-ranger from an ambitious brand Battery life I was very pleased with the endurance of the smartphone, primarily because the affordable device has a 5200 mAh battery. In addition, we have a 10W charger in the box. This is far from record-breaking power, but the smartphone charges in 1.2 hours – it could be worse. At the start of the test, with all the benchmarks, photos and tasks assigned to it, the smartphone lasted 2 days! In normal use, you can expect two or even three days of reliable operation from a single charge. Sound and communication The earpiece speaker is of satisfactory quality: we have a narrow frequency range and a small volume margin, but it is enough for conversations. The multimedia speaker (there is only one, that is, we have monaural sound) is also not very effective: the sound is flat, quiet, dominated by high frequencies without bass. Note 21 lacks a 3.5 mm jack. And maybe this is not so critical, because almost everyone has wireless headphones, but some users will be upset by this fact. However, most budget smartphones nowadays have a mini-jack. When it comes to communications, not everything is as we would like it to be. For example, the model doesn’t have NFC, it supports the old version of Bluetooth (5.0), and I won’t even mention 5G. And if the latter is not a problem for potential buyers, the inability to pay with this phone in a store is disappointing, because most even cheaper models have NFC. Read also: TECNO SPARK 10 Pro review: an inexpensive smartphone with a large screen Software The phone runs on the latest Android 13. We don’t know what Cubot’s shell is called, but it’s hardly a full-fledged shell, just its own launcher (icons, widgets). The interface is beautiful, simple, and intuitive. There is no “bloatware” (unwanted pre-installed programs). In the settings you will find options for each functional element of the phone: screen, sound privacy, system, notifications, etc. Cubot Note 21 UI 1 - 10 It seems to be nothing out of the ordinary, but I was a little annoyed by one thing during testing. Namely, the incomplete localisation of the interface. I tested a device with a Polish interface, but in the general settings there were sections in English. They were not translated. The situation is identical in the camera app settings. I’m not picking on this because I can’t translate, but because if a user consciously chooses a language, they certainly want to get a full understanding of the processes and functions associated with it. This may not be a problem for younger customers, but what about older people? Let’s hope that with future updates, this problem will simply disappear. But, nevertheless, it often appears in devices not only of popular Chinese brands. Read also: ZTE Blade A72s review: ultra-budget with a big screen and 90 Hz Conclusions I believe that the Cubot Note 21, despite its shortcomings, will definitely gain a place in the market. The phone is very affordable, but it lasts a long time and does all its tasks well. For comparison, take a look at the pros and cons to make your final decision. Advantages Long operating time (5200 mAh battery) Affordable price (about $100) Not a bad main camera High-quality screen with a frequency of 90 Hz. Disadvantages No fingerprint scanner No NFC and an old version of Bluetooth Low-quality plastic case. Read also:","filter_flag":1}
