{"title":"Bridging the $18 Trillion Gap in Net Zero Capital - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYnJpZGdpbmctdGhlLXZhc3QtZ2FwLWluLW5ldC16ZXJvLWNhcGl0YWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYnJpZGdpbmctdGhlLXZhc3QtZ2FwLWluLW5ldC16ZXJvLWNhcGl0YWzSAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYnJpZGdpbmctdGhlLXZhc3QtZ2FwLWluLW5ldC16ZXJvLWNhcGl0YWzSAQA","guidislink":false,"published":"Mon, 20 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYnJpZGdpbmctdGhlLXZhc3QtZ2FwLWluLW5ldC16ZXJvLWNhcGl0YWzSAQA?oc=5\" target=\"_blank\">Bridging the $18 Trillion Gap in Net Zero Capital<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bridging the $18 Trillion Gap in Net Zero Capital - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYnJpZGdpbmctdGhlLXZhc3QtZ2FwLWluLW5ldC16ZXJvLWNhcGl0YWzSAQA?oc=5\" target=\"_blank\">Bridging the $18 Trillion Gap in Net Zero Capital<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"However, their journey is riddled with hurdles. In the present climate, higher inflation, persistent supply chain pressures, and rising capital costs cause significant bottlenecks, slowing the pace of the energy transition. The setting is also reshaping investor behavior; companies face more demanding calls for higher returns, more disciplined capital management, and more efficient resource allocation, even within the high-growth renewables space. The energy sector’s response has been proactive. A flurry of transaction activities signals a strategic push to fine-tune capital frameworks for the energy transition; so far in 2023, total energy sector deals exceed $320 billion. Oil and gas companies have emerged as dominant buyers, while utilities are using carve-outs to raise funds and recalibrate. As capital markets evolve, only projects that strike the right balance between risk and returns will receive sufficient funding. Regions where stakeholders effectively align policy directives and market mechanisms will be the prime recipients of future investments. To flourish in the face of growing capital demands, energy companies must reassess portfolios, create innovative capital strategies and new partnerships, optimize their financial structures, and emphasize stringent cost and supply chain efficiencies. This report highlights the sector’s crucial capital allocation dynamics and the implications for competitive success in the energy transition. Follow the Capital: Tracking the Investment Landscape of the Energy Transition BCG’s Center for Energy Impact recently analyzed the investment plans of the world’s leading energy companies, governments, and private equity players, to compare real-world energy transition investments with net-zero scenario benchmarks. The study reveals two major trends. One is that energy companies and governments aim to inject an impressive $19 trillion into the energy transition over the next seven years. This includes nearly $2 trillion in new government spending, spurred by US and European legislative initiatives. Company targets suggest a 15% increase in energy expenditures between 2023 and 2027, with an increasing share allocated to low-carbon investments. (See Exhibit 2.)","filter_flag":1}
{"title":"Investing in net-zero transition: What to know about this growing sector - RBC Wealth Management","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnJiY3dlYWx0aG1hbmFnZW1lbnQuY29tL2VuLXVzL2luc2lnaHRzL2ludmVzdGluZy1pbi1uZXQtemVyby10cmFuc2l0aW9uLXdoYXQtdG8ta25vdy1hYm91dC10aGlzLWdyb3dpbmctc2VjdG9y0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnJiY3dlYWx0aG1hbmFnZW1lbnQuY29tL2VuLXVzL2luc2lnaHRzL2ludmVzdGluZy1pbi1uZXQtemVyby10cmFuc2l0aW9uLXdoYXQtdG8ta25vdy1hYm91dC10aGlzLWdyb3dpbmctc2VjdG9y0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LnJiY3dlYWx0aG1hbmFnZW1lbnQuY29tL2VuLXVzL2luc2lnaHRzL2ludmVzdGluZy1pbi1uZXQtemVyby10cmFuc2l0aW9uLXdoYXQtdG8ta25vdy1hYm91dC10aGlzLWdyb3dpbmctc2VjdG9y0gEA","guidislink":false,"published":"Thu, 16 Nov 2023 14:51:29 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=14, tm_min=51, tm_sec=29, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnJiY3dlYWx0aG1hbmFnZW1lbnQuY29tL2VuLXVzL2luc2lnaHRzL2ludmVzdGluZy1pbi1uZXQtemVyby10cmFuc2l0aW9uLXdoYXQtdG8ta25vdy1hYm91dC10aGlzLWdyb3dpbmctc2VjdG9y0gEA?oc=5\" target=\"_blank\">Investing in net-zero transition: What to know about this growing sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RBC Wealth Management<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Investing in net-zero transition: What to know about this growing sector - RBC Wealth Management","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnJiY3dlYWx0aG1hbmFnZW1lbnQuY29tL2VuLXVzL2luc2lnaHRzL2ludmVzdGluZy1pbi1uZXQtemVyby10cmFuc2l0aW9uLXdoYXQtdG8ta25vdy1hYm91dC10aGlzLWdyb3dpbmctc2VjdG9y0gEA?oc=5\" target=\"_blank\">Investing in net-zero transition: What to know about this growing sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RBC Wealth Management<\/font>","source.href":"https:\/\/www.rbcwealthmanagement.com","source.title":"RBC Wealth Management","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Share While climate-related disasters and record temperatures intensify around the world, commitments to decarbonization initiatives from governments and businesses seek to address the most pressing challenges. But the transition to a net-zero future is no small undertaking. BloombergNEF Energy Outlook estimates it will take a staggering $194 trillion—or nearly $7 trillion a year—to decarbonize the global economy by 2050. This presents a significant multitrillion-dollar investment opportunity and is leading to an increased focus on transition investing. Net-zero transition investing: A rapidly growing sector In the simplest terms, transition investing provides financing to support progress toward net zero. This is particularly important in hard-to-abate sectors—like the trucking and steel industries—where it’s difficult to lower emissions without substantial investments in new technology and other improved climate strategies. It is essential to understand that the 2050 net-zero goal is not an endpoint but a midpoint in a century-long effort to stabilize emissions. It’s a rapidly growing sector: According to BloombergNEF, global investment in low-carbon energy transition totaled $1.1 trillion in 2022 (up 31 percent over the previous year). The energy sector—the source of approximately three-quarters of greenhouse gas emissions, according to the International Energy Agency—is integral to the global net-zero transition, with demand for traditional sources of energy expected to continue to grow over the next decade, before ebbing slightly by mid-century. The sector will need to continue pursuing decarbonization pathways and meaningfully reduce operational emissions to achieve net-zero targets. Significant operational changes are also required in other high-emitting industries, such as industrials, manufacturing, mining, automotive and agriculture. Meanwhile, renewable energy sources like solar, wind, hydropower and biofuels need to scale significantly to become a larger portion of the global energy mix. But businesses require considerable support to realize net-zero ambitions, especially if the move to a more sustainable economy is to be fair, inclusive and help address economic inequalities across society. It’s widely recognized that governments cannot finance net-zero ambitions alone—some estimates indicate approximately 70 percent of investment will need to come from private finance. Investors and net-zero transition Investors—both institutional and retail—are increasingly aware of net-zero transition. The inclusion of environmental, social and governance (ESG) factors in portfolios, often with a focus on emerging energy technology, is now commonplace. As companies continue to innovate and strive for positive impacts, responsible investing opportunities continue to increase. “I have seen consistent investor interest in responsible investing. Clients want to talk about—and invest in—sustainable technologies and have conversations with their advisors about this growing space,” says Kent McClanahan, head of Responsible Investing for RBC Wealth Management. “As new innovations in the energy transition space arise, we shouldn’t lose sight of engaging with all sectors. When we as investors work with companies across many industries and geographies, that is when we can help make an impact, leading us closer to our end goal of lower emissions.” On the surface, transition investing seems like a natural fit for investors looking to drive impact in the economy. However, some may balk at investing in businesses that are currently high emitters, amid fears they are not transitioning quickly enough or stretching beyond their business as usual. “Greenwashing”—misleading or inaccurate statements about the sustainable performance of a firm or an investment—is also a common concern. Transition investing focuses on the financial impacts on a client’s portfolio in response to a shift toward a low-carbon economy. Providing capital to high-emitting companies so they can decarbonize and transition toward net-zero targets is vital in reducing emissions in absolute terms. “The point is not to place blame or point fingers; rather, to understand what data is actually showing versus what we think it’s showing,” says Kyle Bergacker, a senior portfolio advisor for Responsible Investments at RBC Wealth Management–U.S. How to invest in the transition to net zero Interest in investing in the energy-transition and decarbonization efforts is reflected in the broad range of financial products available to investors. Your financial advisor can help identify investments that are suitable for your specific situation. Transition investing can also help diversify an investment portfolio, not only in terms of asset allocation but in terms of widening the investable sectors and industries. This is particularly true for investors who want to consider ESG factors but have previously invested only in companies dubbed “green” or are low emitters. However, it’s essential these investments fit with your appetite for risk. It’s also useful to take the time to understand how different funds perform—from a sustainability perspective—through their ESG ratings. Doing so can help verify that you’re comfortable with the companies the funds invest in, and that their transition goals align with your values. It’s worth noting that ESG ratings are imperfect and are regularly being refined. As a result, they should represent one of the factors in decision-making, rather than the factor. It’s important to not only focus on the new innovative clean-energy businesses in the energy-transition space, as these business models are typically inflexible and unadaptable. “The key is to identify businesses with extremely flexible business models that can quickly evolve from their current high-carbon-emitting operations,” says Bergacker. Net zero is more than an endgame Commitments to decarbonization and net zero are now becoming a corporate norm. According to Oxford’s Net Zero Stocktake 2023 report, 65 percent of the annual revenue of the world’s 2,000 largest companies is now covered by a net-zero target. Of course, there are companies with aggressive decarbonization targets that are doing more than their peers, but it is the implementation at an operational level against which everyone is going to be judging them. “Fossil fuel divestment seems to punish high carbon emitters through a hoped increase in their cost of capital, making it more difficult to operate,” says Bergacker. “However, it does not actually solve the long-term issue that investors are trying to address by investing in a climate-based portfolio—that is, lowering global emissions in absolute terms.” Investors will also be questioning what returns might be realized. RBC Capital Markets analysis suggests that from December 2011 to April 2023, companies in emissions-intensive sectors (energy, industrials and utilities) that have reduced their emissions intensity the most have outperformed peers that reduced emissions the least. As with any investment, performance must be reviewed as part of your overall, ongoing portfolio planning. The transition to net zero will affect us all The relevance of transition investing is an all-encompassing and ongoing effort, says McClanahan. “It’s not just an energy transition, but an economic transition—the implications of moving to net zero are broad across all sectors and in our everyday lives.” McClanahan notes that as high emitters are fundamental to a functioning society, we can’t just turn them off; the logical way forward that will make a big impact is for them to reduce their emissions. And investors can help. “Forward-looking companies aim to identify these risks and opportunities and introduce new products and services to reduce their own emissions as well as those of their customers. Investors who utilize an ESG-integrated strategy can invest in these companies long term and participate in the transition,” says McClanahan.","filter_flag":1}
{"title":"CIIE a showcase for the latest trends - Chinadaily.com.cn - China Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzExLzA2L1dTNjU0ODhiZjZhMzEwOTA2ODJhNWVjYTY4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzExLzA2L1dTNjU0ODhiZjZhMzEwOTA2ODJhNWVjYTY4Lmh0bWzSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzExLzA2L1dTNjU0ODhiZjZhMzEwOTA2ODJhNWVjYTY4Lmh0bWzSAQA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzExLzA2L1dTNjU0ODhiZjZhMzEwOTA2ODJhNWVjYTY4Lmh0bWzSAQA?oc=5\" target=\"_blank\">CIIE a showcase for the latest trends - Chinadaily.com.cn<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">China Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CIIE a showcase for the latest trends - Chinadaily.com.cn - China Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmNoaW5hZGFpbHkuY29tLmNuL2EvMjAyMzExLzA2L1dTNjU0ODhiZjZhMzEwOTA2ODJhNWVjYTY4Lmh0bWzSAQA?oc=5\" target=\"_blank\">CIIE a showcase for the latest trends - Chinadaily.com.cn<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">China Daily<\/font>","source.href":"https:\/\/www.chinadaily.com.cn","source.title":"China Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This photo taken on Nov 5, 2023 shows a Mercedes-Maybach S 580e sedan displayed at the 6th China International Import Expo (CIIE) in East China's Shanghai. [Photo\/Xinhua] AUTOMOBILES 30,000㎡ 40+ exhibitors 15 leading car manufacturers The Automobiles Exhibition Area, with the theme of \"Unlimited Mobility Possibilities in the Future\", showcases the latest automotive technologies, services and new market trends. Apart from exploring the unlimited possibilities for life in the future, it also gives in-depth discussions on topics such as intelligent transportation, future mobility, electrification and travel life. The exhibition area is keen to be a place for companies, which are looking to enter the Chinese market, to showcase and launch new products. EXHIBITS Finished vehicles: passenger cars, supercars, prototype vehicles, concept vehicles, new energy vehicles, off-road vehicles, two-wheeled vehicles and recreation vehicles Smart mobility and new energy: automatic driving products, technologies and solutions, intelligent Internet connection, new energy, smart transportation, future mobility, drive parts, chassis parts, body parts, lightweight parts, auto interior, on-board systems, automobile sports and competitions and automobile culture and lifestyle Automobile supporting products and maintenance supplies: automobile after-market, measuring, testing and diagnostic equipment, oil paint and lubricating oil FOOD AND AGRICULTURAL PRODUCTS 85, OOO㎡ 100+ countries and regions 1,600+ exhibitor 50+ pavilions of overseas organizations A surging demand among consumers for healthy, nutritional and safe food has sparked a wave of innovation in the food industry. Against this backdrop, the Food and Agricultural products Exhibition Area is dedicated to establishing itself as a platform that not only highlights distinctive global products, but also showcases brands, strengths and social responsibilities of businesses. With its overarching theme of \"Seeking Innovation and Opportunities in Food\", this exhibition area strives to foster dialogue, facilitate exchange, and foster partnerships between the Chinese and international food industries. EXHIBITS Dairy products: liquid milk, milk powder, condensed milk, milk fat, cheese and dairy additives Fruits, vegetables and agricultural products: fruits, vegetables, grain oil and plant-based products Crop seed industry: seeds, crop breeding or cultivation technologies, innovative R&D achievements of the seed industry, instrument technology and equipment, pesticides and micro element fertilizers Alcohol; wine, beer, spirits, cocktails. Baijiu and alcoholic drinks Coffee, tea and beverage: coffee, fruit juice, mineral water, carbonated drinks, herbal tea, functional drinks, protein drinks, prepared drinks, tea and honey Meat, aquatic products and frozen foods: meat, meat products, aquatic animal and plant products, aquatic animal and plant processed products and cooled and frozen food Snack foods, sweets, condiments: biscuits, cakes, preserves, puffed food, nuts, chocolate, Ice cream, candy, sweets and condiments Comprehensive food: comprehensive food, supermarkets and pet food CONSUMER GOODS 80,000㎡ 600+ exhibitors 70+ countries and regions The Consumer Goods Exhibition Area, with the theme of \"Exploring the World's Top Consumer Goods and Enjoying a Green, Innovative and Fashionable Life\", showcases the achievements of consumer goods enterprises in promoting green development, products and services innovation, cross-border cooperation and integration, customization and intelligent technology to meet people's growing demand for a better life. EXHIBITS Beauty, cosmetics and cleaning products: facial care and makeup, body care and daily use chemical products, maternal and child products and feminine care, household cleaning and paper and professional beauty Green and intelligent home appliances and home decors: white appliances, black appliances, small appliances, kitchen appliances, bathrooms, furniture, household goods and consumer electronics Fashion clothing and accessories: high-quality clothing, jewelry, watches, shoes, bags and artworks Sports and outdoors: sporting goods, sports technology, outdoor clothing and products and fitness equipment MEDICAL EQUIPMENT AND HEALTHCARE PRODUCTS 7,000㎡ Top 10 medical equipment companies 10 Fortune 500 pharmaceutical companies The Medical equipment and Healthcare Products Exhibition Area, with theme of \"Healthy China, Better Life\", focuses on supporting the construction of a strong healthcare system in China. It focuses on the latest development trends and common topics in the global medical industry, closely following the aspirations of the general public for a healthy and better life. It attaches great importance to showcasing leading innovative medical products, cutting-edge technologies, and services in the world. EXHIBITS Pharmaceuticals: chemical raw materials for medicine. Western medicine, biopharmaceuticals, traditional Chinese medicine, pharmaceutical intermediates, pharmaceutical raw materials and vaccines Medical instruments: testing and diagnostic equipment, treatment equipment, ward care and monitoring equipment, endoscopy equipment, first-aid equipment, surgical instruments, instruments for life science and clinical medicine, environmental monitoring instruments, clinical testing and analysis instruments, diagnostic reagents, laboratory equipment and instruments, biochemical diagnosis, immune diagnosis, blood cell testing, molecular diagnosis, POCT instruments and reagents, protective supplies, purification equipment and disinfection products and medical cosmetology Health and elderly care: assistive products for rehabilitation, special mobility aids, nursing homes and pension real estates, elderly products, healthcare technologies, sleep repair, rehabilitation from sports injuries, medical tourism, medical health services Nutritional and health food: health food, nutrient supplements, dietary supplements, formula products for special medical purposes and sports nutritional food TRADE IN SERVICES 30,000㎡ 300+ exhibitors 15 Fortune 500 exhibitors Emphasizing digitalization and focusing on the whole life cycle of business activities, this area is themed \"Green and Low-carbon Development, Stable and Strong Chains, and Digital and Smart Future\". The exhibition in this area aims to facilitate the digital transformation of the entire industry. It is also set to be a platform for exhibitors in other exhibition areas at the CIIE to meet with potential clients and get inspired. EXHIBITS Commercial logistics: ocean freight, land transportation, air freight, multimodal transport, freight forwarding, warehousing, distribution, information processing, international trading companies and cross-border e-commerce platforms Consulting services: finance, marketing, legal services, human resources, strategies, IT, inspection and testing services, property management and design Financial services: commercial banking services, insurance, finance, credit rating, financial information services and fintech services Cultural and tourism: cultural services, tourism platform services, tourism agency services, ticketing services, hotel services, catering services, entertainment services, intellectual property and IP authorization services, exhibition organizers, venues and exhibition supporting services Comprehensive services: industrial parks, international organizations, public administration and social organizations INNOVATION INCUBATION SPECIAL SECTION 300+ enterprises and projects 30+ countries and regions Innovation Incubation Special Section, with the theme of \"Crossing Boundaries, Incubating Innovative Forces and Leading Future Technologies\", invites global innovative enterprises, internal incubation platforms of multinational enterprises and innovation incubation parks to participate. It helps innovative enterprises unleash their innovation passion, communicate with industry leaders and explore the path of innovation. The section welcomes unlisted growth and innovative enterprises at the seed stage, startup stage and growth stage to register for participation. Taking into account the development requirements of these enterprises, the special zone offers more competitive booth prices. Additionally, participating enterprises can also take part in awards and forum activities held within the section. The section is also dedicated to establishing an innovative incubation system with the core features of \"accelerated incubation + investment-driven + scenario access\". Its objective is to support innovative enterprises in expanding their networks and expedite their exploration journey in China. INTELLIGENT INDUSTRY AND INFORMATION TECHNOLOGY 70,000㎡ 300+ exhibitors 30+ Fortune 500 exhibitors Committed to the goal of leading innovative development and integrating the whole industry chain, this area focuses on demonstrating high-end and intelligent equipment. It addresses key topics such as peak carbon dioxide emissions and carbon neutrality, digitization, integrated circuits and artificial intelligence. The development concept of \"high-end + intelligent + green\" is incorporated and presented in three sectors: industries, science and technology and environmental protection. This exhibition centers on advanced technology and leads the innovation trends of related industries. It showcases cutting-edge technology and high-end equipment, providing a high-end exhibition and communication platform for the global manufacturing industry. Highlights of this exhibition include an AI experience area and a low-carbon summit. EXHIBITS Digital industry automation: industry automation, industrial robotics, industrial solutions, construction machinery and equipment, cutting machines and pressing machine, special laser processing equipment, additive manufacturing tools, fixtures, testing tools, measurement and parts, aviation and aerospace Integrated circuits: raw materials, semi-conductor equipment and chips Low-carbon energy and environmental protection technology: mining, new materials, new energy, fossil energy, water treatment and environmental protection technology Artificial intelligence: human-computer interaction, database, the internet of Things and communication Digital printing and optical technology: digital printing, 3D printing, scanning equipment, optical materials and optical equipment and technology PAVILION OF INDUSTRIAL ORGANIZATIONS The CIIE is in partnership with international organizations, trade and investment promotion agencies and business associations from various countries and regions to support small and medium-sized enterprises and enterprises in special industries to the CIIE in groups. CIIE and its partners also facilitate small and medium-sized enterprises to visit China. Business groups are allocated in different exhibition areas for display based on their industry. During the 2023 CIIE, there is a dedicated trade docking zone specifically designed for small and medium-sized enterprises to enhance experience and effectiveness. Please visit the CIIE official website www.ciie.org to browse the organizers of business groups in your country or region.","filter_flag":1}
{"title":"Bangladesh embraces wind energy with Chinese solutions - Xinhua","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZW5nbGlzaC5uZXdzLmNuLzIwMjMxMTA4LzU0NjFmMmFjODViNzQzMWI5YWFjZTBhNmIzZjEzZTA3L2MuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZW5nbGlzaC5uZXdzLmNuLzIwMjMxMTA4LzU0NjFmMmFjODViNzQzMWI5YWFjZTBhNmIzZjEzZTA3L2MuaHRtbNIBAA?oc=5","id":"CBMiSGh0dHBzOi8vZW5nbGlzaC5uZXdzLmNuLzIwMjMxMTA4LzU0NjFmMmFjODViNzQzMWI5YWFjZTBhNmIzZjEzZTA3L2MuaHRtbNIBAA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZW5nbGlzaC5uZXdzLmNuLzIwMjMxMTA4LzU0NjFmMmFjODViNzQzMWI5YWFjZTBhNmIzZjEzZTA3L2MuaHRtbNIBAA?oc=5\" target=\"_blank\">Bangladesh embraces wind energy with Chinese solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Xinhua<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bangladesh embraces wind energy with Chinese solutions - Xinhua","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZW5nbGlzaC5uZXdzLmNuLzIwMjMxMTA4LzU0NjFmMmFjODViNzQzMWI5YWFjZTBhNmIzZjEzZTA3L2MuaHRtbNIBAA?oc=5\" target=\"_blank\">Bangladesh embraces wind energy with Chinese solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Xinhua<\/font>","source.href":"https:\/\/english.news.cn","source.title":"Xinhua","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This photo taken on Oct. 30, 2023 shows the site of Cox's Bazar wind power project in Bangladesh. (Photo by Salim\/Xinhua) \"The successful operation of this project marks a new era for the wind power industry in Bangladesh,\" Bangladeshi Ambassador to China Jashim Uddin said via video link. DHAKA, Nov. 8 (Xinhua) -- Khurushkul, once a small village in Bangladesh's Cox's Bazar district, some 400 km southeast of the capital Dhaka, boasts Bangladesh's first wind power plant built by a Chinese company. The plant, a large-scale centralized wind power plant with 22 wind turbines with a single capacity of 3 megawatts (MW) installed, has started operation, facilitating the South Asian country's energy transition and green development. Last month, Bangladesh joined the global wind power club with the inauguration of its Cox's Bazar wind power project. The wind power project is invested by Wuling Power Corp., a subsidiary of China's State Power Investment Corp. (SPIC), and built by PowerChina Chengdu Engineering Corp. Upon its full operation, the project will provide Bangladesh with about 145 million kWh of clean electricity per year, reduce coal consumption by 44,600 tons and carbon dioxide emissions by 109,200 tons, as well as meet the electricity demand of 100,000 households. Bangladeshi engineer Abdullah Arif, who graduated from a Chinese university, is working as an operation shift in-charge in the plant. \"After graduation, I joined this project. From here we can learn and serve our country for the renewable energy and we can improve our electricity demand,\" Arif told Xinhua. He said the plant now feeds 30 MW of electricity into the national grid and will run at the full capacity by the end of year. This photo taken on Oct. 30, 2023 shows the site of Cox's Bazar wind power project in Bangladesh. (Photo by Salim\/Xinhua) Out of the 22 turbines of this project, he said, they have installed 10 turbines with a capacity of 30 MW. \"We can expect at the end of this year, we can install the remaining 12 turbines of this project, produce 60 MW in total, and transfer it to the national grid,\" he added. Arif expressed his hope that Bangladesh can develop a huge generation capacity in renewable energy in the future. \"Because electricity is one of the top priorities in building a developed country.\" \"It will help improve my country's environment,\" said Arif, explaining that wind is definitely a green energy that can help reduce Bangladesh's carbon emissions. This aerial photo taken on Oct. 30, 2023 shows the site of Cox's Bazar wind power project in Bangladesh. (Photo by Salim\/Xinhua) Yin Bobo, director of the Cox's Bazar Wind Power Plant, said the project has customized the \"China Plan\" for Bangladesh, coming up with site-specific solutions for the coastal areas featured by frequent tropical cyclone disasters, poor alluvial plain geological foundation, and low average wind speed. During the construction of the project, more than 1,500 jobs were provided for the locals, said Yin, adding that the current eight operation and maintenance employees of the power plant have received strict and systematic wind power technology training. Yin said Wuling will continue to focus on the development of green energy and assist Bangladesh in its low-carbon energy transformation in realizing the dream of \"Golden Bangladesh\" at an early date. \"It's a major watershed in our nation's journey towards cleaner and more sustainable energy,\" said Habibur Rahman, senior secretary of Power Division under Bangladesh's Ministry of Power, Energy and Mineral Resources, when addressing the launching ceremony last month. This photo taken on Oct. 30, 2023 shows the site of Cox's Bazar wind power project in Bangladesh. (Photo by Salim\/Xinhua) This project will not only provide clean electricity to thousands of households, but also help reduce Bangladesh's reliance on fossil fuels. It will also have a positive impact on the country's environment and air quality, and mitigate the effects of climate change, the official noted. \"The successful operation of this project marks a new era for the wind power industry in Bangladesh,\" Jashim Uddin, Bangladeshi Ambassador to China, said via video link. \"The historic introduction of wind power by Chinese enterprises to Bangladesh marks a milestone of bilateral cooperation in new energy sector,\" Chinese Ambassador to Bangladesh Yao Wen noted, stressing that China stands ready to help Bangladesh develop new energy. ■","filter_flag":1}
{"title":"A Plan to Reduce Semiconductor Emissions | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5\" target=\"_blank\">A Plan to Reduce Semiconductor Emissions | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A Plan to Reduce Semiconductor Emissions | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvYS1wbGFuLXRvLXJlZHVjZS1zZW1pY29uZHVjdG9yLWVtaXNzaW9uc9IBAA?oc=5\" target=\"_blank\">A Plan to Reduce Semiconductor Emissions | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The “low-carbon energy” scenario anticipates that the semiconductor industry can curb over half of benchmark 2050 emissions—the level of carbon output in the absence of any viable action to reduce it—by supporting the realization of the International Energy Agency’s Stated Energy Policies Scenario (STEPS). STEPS reflects the impact of existing government policy frameworks and announced plans. However, this outcome leaves chip manufacturing emissions at 168 Mt per year in 2050 and nearly 5 Gt total, significantly above net zero and 1.5°C targets. Our other scenario incorporates company commitments by the 40 highest emitters in semiconductor manufacturing, as currently reported, representing a substantial majority of all emissions. This scenario promises material progress toward a collective net zero goal. Even so, its results fall short of net zero by 2050—and of meeting the 1.5°C objective, by a factor of 3.5x. As the report shows, achieving the 1.5°C carbon expenditure goal will not be easy for semiconductor companies. Indeed, even the significant efforts already pledged and taken will not reduce the industry’s carbon footprint to net zero. Overcoming this gap will require deeper collaboration across the industry, which we strongly encourage and the SCC has begun to foster. Click here to read the full report.","filter_flag":1}
{"title":"Veolia supports the UK's first low carbon, heating and cooling network - Food and Drink Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDk5MjAvdmVvbGlhLXN1cHBvcnRzLXRoZS11a3MtZmlyc3QtbG93LWNhcmJvbi1oZWF0aW5nLWFuZC1jb29saW5nLW5ldHdvcmsv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDk5MjAvdmVvbGlhLXN1cHBvcnRzLXRoZS11a3MtZmlyc3QtbG93LWNhcmJvbi1oZWF0aW5nLWFuZC1jb29saW5nLW5ldHdvcmsv0gEA?oc=5","id":"CBMid2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDk5MjAvdmVvbGlhLXN1cHBvcnRzLXRoZS11a3MtZmlyc3QtbG93LWNhcmJvbi1oZWF0aW5nLWFuZC1jb29saW5nLW5ldHdvcmsv0gEA","guidislink":false,"published":"Fri, 03 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=307, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDk5MjAvdmVvbGlhLXN1cHBvcnRzLXRoZS11a3MtZmlyc3QtbG93LWNhcmJvbi1oZWF0aW5nLWFuZC1jb29saW5nLW5ldHdvcmsv0gEA?oc=5\" target=\"_blank\">Veolia supports the UK's first low carbon, heating and cooling network<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Veolia supports the UK's first low carbon, heating and cooling network - Food and Drink Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua3RlY2hub2xvZ3kuY29tL25ld3MvNDk5MjAvdmVvbGlhLXN1cHBvcnRzLXRoZS11a3MtZmlyc3QtbG93LWNhcmJvbi1oZWF0aW5nLWFuZC1jb29saW5nLW5ldHdvcmsv0gEA?oc=5\" target=\"_blank\">Veolia supports the UK's first low carbon, heating and cooling network<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","source.href":"https:\/\/www.foodanddrinktechnology.com","source.title":"Food and Drink Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A new low carbon energy network, developed by SmartParc supported by Veolia, is set to cut carbon emissions for food manufacturing by 30,000 tonnes per year at the flagship SmartParc site near Derby. Home to the UK’s first ever low-carbon food manufacturing community, covering 186,000 m2 (2 million square feet), the system serving the new business campus will use the latest technologies to deliver the essential cooling and heating needs for the food manufacturers on the site, whilst future-proofing the industry. Most food manufacturers have a requirement for both heating and cooling to support their storage, processing, space heating, and hygiene activities, and SmartParc’s energy sharing infrastructure aims to utilise wind and solar initially, combined with central services, to deliver sustainable food production. To support this aim the scheme incorporates industrial ammonia chillers and heat pumps, and the resultant energy will be supplied through a 9.8km district cooling infrastructure. This is designed to deliver a diversified cold glycol cooling duty of 11MW at -6°C and, by capturing the waste heat from the refrigeration plant, will provide hot water capability of up to 10MW at 72°C across the park. The cooling system is anticipated to provide an annual CO2 e saving of around 27,000 tonnes between 2024 and 2030. By capturing process heat, the heating network will deliver a further CO2 e saving of 3,500 tonnes per year, with potential to double this, when compared to gas boilers. A further environmental benefit comes from the use of ammonia refrigerant in the network, which has a zero global warming potential compared to equivalent synthetic hydrofluorocarbon (HFC) refrigerant systems. Veolia designed the pipe network, and will operate the entire heating, cooling and high voltage distribution across the 155-acre site on behalf of SmartParc, including managing metering and billing, and provide 24\/7 year-round engineering support. Commenting on this latest project, John Abraham, chief operating officer -– Industrial, Water & Energy for UK, Ireland and Nordics said: ” Reducing the carbon footprint of food production is of key importance as we advance to net zero. By collaborating with food manufacturers we can identify and implement new innovative solutions that both support essential food production, and deliver major cuts in greenhouse gas emissions. “Veolia’s work on this new state of the art site highlights what can be achieved today, takes another significant step towards achieving ecological transformation, and helps further protect the environment for future generations.” Phil Lovell, chief operating officer – Europe for SmartParc, said: “We are excited to be delivering this pioneering energy solution at SmartParc Segro Derby, which is the first of its kind in the food industry. The heating and cooling network is a critical part of SmartParc’s sustainable, collaborative model for food production. The pipe network and energy centre we have completed will benefit all tenants on the Park, ensuring significant carbon reductions and cost savings. We’re delighted to be supported by Veolia on this project.” By adopting innovative solutions, and changing patterns of production and consumption Veolia is placing ecology at the heart of every process to achieve its goal of being carbon neutral. This includes maximising the value from resources to effectively ensure a secure supply of energy, and easing resource scarcity challenges. Related content","filter_flag":1}
{"title":"Energising the North East | Manufacturing 100 Interview with Steve Scrimshaw - Insider Media","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lmluc2lkZXJtZWRpYS5jb20vbm9ydGgtZWFzdC9tYW51ZmFjdHVyaW5nLTEwMC0yMDIzL3N0ZXZlLXNjcmltc2hhd9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lmluc2lkZXJtZWRpYS5jb20vbm9ydGgtZWFzdC9tYW51ZmFjdHVyaW5nLTEwMC0yMDIzL3N0ZXZlLXNjcmltc2hhd9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3Lmluc2lkZXJtZWRpYS5jb20vbm9ydGgtZWFzdC9tYW51ZmFjdHVyaW5nLTEwMC0yMDIzL3N0ZXZlLXNjcmltc2hhd9IBAA","guidislink":false,"published":"Mon, 20 Nov 2023 01:12:19 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=1, tm_min=12, tm_sec=19, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lmluc2lkZXJtZWRpYS5jb20vbm9ydGgtZWFzdC9tYW51ZmFjdHVyaW5nLTEwMC0yMDIzL3N0ZXZlLXNjcmltc2hhd9IBAA?oc=5\" target=\"_blank\">Energising the North East | Manufacturing 100 Interview with Steve Scrimshaw<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Insider Media<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Energising the North East | Manufacturing 100 Interview with Steve Scrimshaw - Insider Media","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lmluc2lkZXJtZWRpYS5jb20vbm9ydGgtZWFzdC9tYW51ZmFjdHVyaW5nLTEwMC0yMDIzL3N0ZXZlLXNjcmltc2hhd9IBAA?oc=5\" target=\"_blank\">Energising the North East | Manufacturing 100 Interview with Steve Scrimshaw<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Insider Media<\/font>","source.href":"https:\/\/www.insidermedia.com","source.title":"Insider Media","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Energising the North East Steve Scrimshaw, vice president, UK & Ireland, Siemens Energy Being spun off from Siemens in October 2020, Siemens Energy is focused on energy transition, the move to decarbonise the future. Employing around 600 people in the North East and 5,500 throughout the UK the company has a large facility in Newcastle where much of its project work is carried out. Steve Scrimshaw leads Siemens Energy in the UK and Ireland from the Shields Road site, known as Charles Parsons Works, in Newcastle. He sat down to speak to Philip Cunliffe about the business’ role in the energy transition. Can you start by telling us about what you’re involved in and some of the projects and customers you are serving? Siemens Energy provides technology across the energy value chain; from compressors to steam turbines to wind farm equipment. We essentially provide all the technology needed to generate, transmit and store energy. Our scope covers offshore and onshore wind farms, supplying transformer modules, then connecting these to the National Grid. Our clients today are some of the big utility companies, such as SSE and Uniper, as well as energy developers of the likes of Orsted and Equinor. Our legacy lies in power generation, particularly turbines and just a few weeks ago we celebrated the completion of Keadby2 Power Station with our partner SSE. With our 9000HL 50Hz turbine technology at the heart of Keadby2 this is the world’s most efficient gas power station. We’re working together with partners to deliver carbon capture projects such as the one on Net Zero Teesside which involves capturing carbon from power stations using post-combustion capture technology and storing it under the North Sea. As the demand for thermal power plants using fossil fuels in the UK has reduced and we have diversified and moved into other technologies and fuels like hydrogen, our business in Newcastle has been transformed into an Energy Park where we do transmission projects such as transformers and grid solutions. We believe that there’s no energy transition without transmission - whatever the technology; whether it’s an electrolyser or an EV charger, it needs a grid connection. There’s a huge backlog for grid projects, so this is a huge growth area for us here in Newcastle but also across the UK. What is manufactured at the Newcastle facility? In terms of manufacturing here in the North East, we’ve converted the Newcastle site into a service facility which services existing power plants and their equipment. We believe that the energy transition needs to benefit society and as we more from being in a carbon-intensive industry to a low-carbon one we need to bring people and skills along the journey. We have a joint venture with a company called GeoPura to manufacture hydrogen power units which provide off-grid electricity using green hydrogen here in Newcastle. We have 40 of these units on order and to make sure we have the necessary skills to work on them, we’ve retrained some of our employees on the assembly of these units. The units have been used on projects such as BBC Springwatch and Netflix shows, programmes that want low-carbon energy instead of diesel generation. Is R&D on new products done in the North East? We have our own engineering teams in the North East and in the development of new technology we are focused on centres of competence around the world. Hydrogen is a lot less dense than gas and we’re developing new high-speed compressors at one of these centres. At the power station up in Lynemouth there are three turbine generators and we’ve been involved over many years to support them by making improvements and efficiencies. So we’re not always involved in supplying newly manufactured products but we often service or provide engineering support for existing turbines, generators and compressors. We have some very big strategic assets here in the North East, some balancing facilities, vacuum chambers and balance-pits which are simply enormous. They’re used whenever there’s a customer requirement. The government wants to get to 10 Gigawatts of hydrogen by 2030 and to achieve this we need to increase this by 10,000 times from where we are today. Steve Scrimshaw, Siemens Energy How easy has it been to recruit new skills into the North East? We tend to have a more flexible workforce these days that can move around from place to place depending on requirements, rather than being focused on manufacturing at one site. The majority of the skills we have in the business are in the high-tech area and we regularly recruit apprentices and graduates. And this isn’t just because of the strength of the Siemens Energy brand – it’s also because of the purpose of what we’re doing which is really important for people today. Our ambition is about energising society and this has real appeal. We like to recruit locally - some of the large projects that we have in the pipeline, such as the carbon capture projects on Teesside, will require large numbers of people, so we want to draw from the local community to recruit these workers. We like to take on apprentices and bring them on to university at entry level as well as giving them technical skills. We’ve got our own Training School in Newcastle and one of the things we’re doing is diversifying from our traditional skills to things like hydrogen because these will be the skills of the future. We’re looking quite deeply into strategic workforce planning, looking not just five years in the future but ten. The government wants to get to 10 Gigawatts of hydrogen by 2030 and to achieve this we need to increase this by 10,000 times from where we are today. And this will require a huge workforce with different skillsets. I started as an apprentice in the Newcastle facility as a 16 year-old and, over the course of my career, have run some of the biggest projects that Siemens Energy has ever been involved with. And my office today is just yards from where I began aged 16! When I speak to apprentices I tell them they can do whatever they want to do, they really can – if I can do it, they can too. Can you tell us about your investment strategy and what this is focused on? Globally, we spend around $1bn and we look very carefully how this is spent to ensure the focus is on investing for the long-term future. We allocate investment more towards our decarbonisation products and one example of this is the GeoPura venture. This is a great business opportunity for us and the investment will give us about 40 years of work which will go through the Newcastle facility. We have consolidated two facilities onto one site in Newcastle, so we have our Grid Technology service and our Transformer sales operation here, as well as our Gas Services business. Bringing all these together on one site means we can offer a one-stop shop for our customers. And it’s great for breaking down silos within the business too. When we’re all together, we get a different perspective on what we’re aiming to do. Finally, why is it important for the business to be operating in the North East? Our facility in Newcastle is the site on which Charles Parsons invented the first steam turbine so we have a long history here. There is so much heritage for us in the region. The North East has always been an engineering powerhouse and this heritage is very important to us.","filter_flag":1}
{"title":"Government announces £4.5bn funding for UK manufacturers - The Engineer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnRoZWVuZ2luZWVyLmNvLnVrL2NvbnRlbnQvbmV3cy9nb3Zlcm5tZW50LWFubm91bmNlcy00NWJuLWZ1bmRpbmctZm9yLXVrLW1hbnVmYWN0dXJlcnMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnRoZWVuZ2luZWVyLmNvLnVrL2NvbnRlbnQvbmV3cy9nb3Zlcm5tZW50LWFubm91bmNlcy00NWJuLWZ1bmRpbmctZm9yLXVrLW1hbnVmYWN0dXJlcnMv0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LnRoZWVuZ2luZWVyLmNvLnVrL2NvbnRlbnQvbmV3cy9nb3Zlcm5tZW50LWFubm91bmNlcy00NWJuLWZ1bmRpbmctZm9yLXVrLW1hbnVmYWN0dXJlcnMv0gEA","guidislink":false,"published":"Mon, 20 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnRoZWVuZ2luZWVyLmNvLnVrL2NvbnRlbnQvbmV3cy9nb3Zlcm5tZW50LWFubm91bmNlcy00NWJuLWZ1bmRpbmctZm9yLXVrLW1hbnVmYWN0dXJlcnMv0gEA?oc=5\" target=\"_blank\">Government announces £4.5bn funding for UK manufacturers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Engineer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Government announces £4.5bn funding for UK manufacturers - The Engineer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnRoZWVuZ2luZWVyLmNvLnVrL2NvbnRlbnQvbmV3cy9nb3Zlcm5tZW50LWFubm91bmNlcy00NWJuLWZ1bmRpbmctZm9yLXVrLW1hbnVmYWN0dXJlcnMv0gEA?oc=5\" target=\"_blank\">Government announces £4.5bn funding for UK manufacturers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Engineer<\/font>","source.href":"https:\/\/www.theengineer.co.uk","source.title":"The Engineer","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"UK manufacturers are to receive £4.5bn in funding from 2025 for five years as the government seeks to boost investment across eight sectors. Over £2bn will go to the automotive industry and £975m to the aerospace sector to support the manufacture, supply chain and development of zero emission vehicles and energy efficient, zero-carbon aircraft equipment respectively. Commenting on the announcement, Mike Hawes, chief executive of trade body SMMT (Society of Motor Manufacturers and Traders), said: \"[This] announcement is an unequivocal vote of confidence in the UK’s critical automotive industry. Coming on the back of almost £20bn committed by the sector in next generation plants and technologies this year alone, it is indicative of the scale of investment such support can leverage and the result of substantial collaboration between government and the industry.” The government also committed to £960m for a Green Industries Growth Accelerator to support clean energy manufacturing, and £520m for life sciences manufacturing. Along with existing manufacturing support and plans for net zero transition, the funding will help to unlock private investment, provide certainty to investors, boost energy security, and protect and create jobs. The government claims this approach has led to £198bn in public and private investment in low carbon energy deployment since 2010. In a statement, Jeremy Hunt, chancellor of the exchequer, said: “Britain is now the eight largest manufacturer in the world, recently overtaking France. To build on this success, we are targeting funding to support the sectors where the UK is or could be world-leading. “Our £4.5bn of funding will leverage many times that from the private sector, and in turn will grow our economy, creating more skilled, higher-paid jobs in new industries that will be built to last.” MORE FROM MANUFACTURING The government has also published its response to Professor Dame Angela McLean’s review of the role that regulation and standards can play in driving innovation and growth in advanced manufacturing. The government accepted the 14 recommendations in the report, including the accelerated deployment of digital twins. To boost growth in small and medium sized manufacturing businesses more widely, it has also been announced that the government will expand the Made Smarter Adoption programme, offering the scheme to all English regions in 2025-26 before working with the Devolved Administrations to explore making the programme UK-wide from 2026-27. The programme helps small and medium sized manufacturing companies to use advanced digital technologies which can reduce carbon emissions and drive up productivity, and its expansion will also involve inclusion of digital internships. “We…welcome the government’s commitment to expand the Made Smarter programme to a pan-UK programme, which will benefit businesses across our nations and regions,” said Kevin Craven, chief executive of ADS, the trade body for the aerospace, defence and security sectors. “This is a very timely intervention given the growing pace of aerospace recovery, huge aircraft order backlog and industries’ continued commitment to net zero.”","filter_flag":1}
