{"title":"Initial vote on PPWR signals relief for policymakers - Zero Waste Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vemVyb3dhc3RlZXVyb3BlLmV1L3ByZXNzLXJlbGVhc2UvaW5pdGlhbC12b3RlLW9uLXBwd3Itc2lnbmFscy1yZWxpZWYtZm9yLXBvbGljeW1ha2Vycy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vemVyb3dhc3RlZXVyb3BlLmV1L3ByZXNzLXJlbGVhc2UvaW5pdGlhbC12b3RlLW9uLXBwd3Itc2lnbmFscy1yZWxpZWYtZm9yLXBvbGljeW1ha2Vycy_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vemVyb3dhc3RlZXVyb3BlLmV1L3ByZXNzLXJlbGVhc2UvaW5pdGlhbC12b3RlLW9uLXBwd3Itc2lnbmFscy1yZWxpZWYtZm9yLXBvbGljeW1ha2Vycy_SAQA","guidislink":false,"published":"Tue, 24 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=297, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vemVyb3dhc3RlZXVyb3BlLmV1L3ByZXNzLXJlbGVhc2UvaW5pdGlhbC12b3RlLW9uLXBwd3Itc2lnbmFscy1yZWxpZWYtZm9yLXBvbGljeW1ha2Vycy_SAQA?oc=5\" target=\"_blank\">Initial vote on PPWR signals relief for policymakers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Zero Waste Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Initial vote on PPWR signals relief for policymakers - Zero Waste Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vemVyb3dhc3RlZXVyb3BlLmV1L3ByZXNzLXJlbGVhc2UvaW5pdGlhbC12b3RlLW9uLXBwd3Itc2lnbmFscy1yZWxpZWYtZm9yLXBvbGljeW1ha2Vycy_SAQA?oc=5\" target=\"_blank\">Initial vote on PPWR signals relief for policymakers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Zero Waste Europe<\/font>","source.href":"https:\/\/zerowasteeurope.eu","source.title":"Zero Waste Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Substitution\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Brussels, 24 October – The environmental network Zero Waste Europe has called the latest ENVI Committee round of voting on the heavily-lobbied Packaging and Packaging Waste Regulation (PPWR) a ‘relief for policymakers’, while noting the result deviates from the Commission’s original proposal. Aline Maigret, Head of Policy at Zero Waste Europe states: “While the text has been considerably diluted from the Commission’s original proposal, we believe this represents the best outcome we can attain at this point in time. Zero Waste Europe welcomes the adoption of the Rapporteur’s compromise amendments today, and commend MEP Ries for upholding the integrity of this bill.” Following the adoption of compromise amendments 10 and 12 on reuse and single-use packaging, a round of applause made its way around the room, signalling relief for the policymakers involved. With the adoption of reuse targets in compromise amendment 10, it is proposed that 50% of large household appliances packaging from economic operators including online platforms should be reusable. The fight to include cardboard within these reuse targets is a notable step in the direction of refining reuse policies. Joan Marc Simon, Director-Founder of Zero Waste Europe states: “For the first time in European packaging legislation, prevention and reuse are given a chance. The ENVI Committee’s decision allows for systemic solutions which can deliver on the ultimate purpose of this revision: reduce packaging waste.” Compromise amendment 12 passed, setting restrictions on the sale of single-use packaging, and sets forth a ban on all single-use packaging in restaurants, preventing material substitution. Raphaëlle Catté, Policy & Research Support, states: “This amendment challenges fast-food giants like McDonald’s and emphasises the importance of environmentally friendly choices over single-use packaging.” Despite opposition from the EPP and ECR, who sought to delete this ban completely, this stance adopted by the Committee underscores a first step to the commitment of robust environmental measures. Another clear advancement was the adoption of compromise amendment 8, which guarantees a minimum quota for recycled content in new products. Lauriane Veillard, Chemical Recycling and Plastic-to-Fuels Policy Officer, states: “We welcome the compromise amendment reached on quotas for recycled content, which builds on the Commission’s proposal and goes a step further by considering the environmental impact of recycling process, thus bringing environmental requirements into the circular economy agenda.” However, one clear setback was the adoption of compromise amendment 25, which creates loophole. This amendment raises concerns as it allows for the use of bio-based virgin plastics within recycled content targets. “The requirement to meet recycled content targets,” Veillard continued, “is strongly undermined by the possibility to use bio-based plastic. There is no point in integrating circular thinking into packaging production if half of the targets can be fulfilled by using virgin plastic.” The ENVI Committee convened on Tuesday to vote on the vital environmental package, a session delayed by over a month. In the lead-up to the vote, the right-wing EPP and ECR parties jointly rejected the compromise amendments proposed by the rapporteur, MEP Frédérique Ries, and tabled their own amendments late, significantly diluting the regulation’s original ambitions. The final tally in the ENVI Committee concluded with 56 in favour of the bill, 23 against, and 5 abstentions, marking the end to the first stage of intense deliberations on the file. Zero Waste Europe acknowledges that the compromise advanced by MEP Ries was far from perfect, but any further dilution would only serve the interests of the single-use sector. Aline Maigret, Head of Policy at Zero Waste Europe states: “There were many challenges from opposing parties, as well as an unprecedented level of corporate lobbying. We eagerly anticipate the upcoming plenary vote in November for this crucial environmental bill.” Notes to the Editor European Commission: “Proposal for a revision of EU legislation on Packaging and Packaging Waste”: https:\/\/environment.ec.europa.eu\/publications\/proposal-packaging-and-packaging-waste_en Eurostat: “EU packaging waste generation with record increase”: https:\/\/ec.europa.eu\/eurostat\/en\/web\/products-eurostat-news\/w\/DDN-20231019-1 Earlier this year, 81 European environmental organisations published an Open letter & FactSheet on Reuse urging policymakers to back the European Commission’s specific reuse targets, especially in the takeaway sector, promoting the reuse of packaging to reduce waste. False claims from corporate lobbying have been a hallmark of this crucial waste regulation. One tell-tale argument goes: pushing for reuse will impact negatively the cost of living of citizens and cut jobs, whereas the EPP and ECR’s compromise amendments 10 and 12 are likely to exacerbate just that, according to the European Commission estimates. The legislative journey of the PPWR unfolded across several pivotal milestones. It commenced in November 2022 when the Commission introduced its draft regulation, marking the initiation of the process. Subsequently, in April 2023, rapporteur Fréderique Ries presented her draft report containing recommendations for amendments. By May 10th, MEPs had submitted their proposed amendments. Technical discussions on the PPWR took place from April to July 2023, encompassing concurrent meetings in both the Council and the European Parliament. EPP and ECR amendments: the reuse obligation will no longer cover cardboard, a derogation from all reuse targets will be allowed if a Life Cycle Assessment (LCA) can prove that a single-use solution is more environmentally beneficial, and most of the restrictions on single-use packaging formats, especially in the HORECA sector and for fresh fruit and vegetables, will be removed. General: “Debunking common myths about food hygiene, food waste, and health concerns related to reusable packaging” Myth busting paper (ZWE) Packaging at the core of pollution (ZWE) infographics + text On reuse: Comms Materials: Press contacts Sean Flynn, Media Outreach & Communications Officer at Zero Waste Europe, [email protected] or [email protected] \/ +32 471 96 55 93 Joan Marc Simon, Director-Founder, [email protected] Aline Maigret, Head of Policy, [email protected] Lauriane Veillard, Chemical Recycling and Plastic-to-Fuels Policy Officer, [email protected] About Zero Waste Europe Zero Waste Europe is a European network of communities, local leaders, experts, and change agents working towards the elimination of waste in our society. Advocating for sustainable systems and the redesign of mankind’s relationship with resources, they accelerate a just transition towards zero waste for the benefit of people and the planet. www.zerowasteeurope.eu","filter_flag":1}
