{"title":"U.S. Department of Energy Awards Team Led by Ginkgo Bioworks Funding to Develop Algal Crop Protection Solutions - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VzLWRlcGFydG1lbnQtb2YtZW5lcmd5LWF3YXJkcy10ZWFtLWxlZC1ieS1naW5rZ28tYmlvd29ya3MtZnVuZGluZy10by1kZXZlbG9wLWFsZ2FsLWNyb3AtcHJvdGVjdGlvbi1zb2x1dGlvbnMtMzAyMDE4MTAyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VzLWRlcGFydG1lbnQtb2YtZW5lcmd5LWF3YXJkcy10ZWFtLWxlZC1ieS1naW5rZ28tYmlvd29ya3MtZnVuZGluZy10by1kZXZlbG9wLWFsZ2FsLWNyb3AtcHJvdGVjdGlvbi1zb2x1dGlvbnMtMzAyMDE4MTAyLmh0bWzSAQA?oc=5","id":"CBMipQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VzLWRlcGFydG1lbnQtb2YtZW5lcmd5LWF3YXJkcy10ZWFtLWxlZC1ieS1naW5rZ28tYmlvd29ya3MtZnVuZGluZy10by1kZXZlbG9wLWFsZ2FsLWNyb3AtcHJvdGVjdGlvbi1zb2x1dGlvbnMtMzAyMDE4MTAyLmh0bWzSAQA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VzLWRlcGFydG1lbnQtb2YtZW5lcmd5LWF3YXJkcy10ZWFtLWxlZC1ieS1naW5rZ28tYmlvd29ya3MtZnVuZGluZy10by1kZXZlbG9wLWFsZ2FsLWNyb3AtcHJvdGVjdGlvbi1zb2x1dGlvbnMtMzAyMDE4MTAyLmh0bWzSAQA?oc=5\" target=\"_blank\">U.S. Department of Energy Awards Team Led by Ginkgo Bioworks Funding to Develop Algal Crop Protection Solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"U.S. Department of Energy Awards Team Led by Ginkgo Bioworks Funding to Develop Algal Crop Protection Solutions - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VzLWRlcGFydG1lbnQtb2YtZW5lcmd5LWF3YXJkcy10ZWFtLWxlZC1ieS1naW5rZ28tYmlvd29ya3MtZnVuZGluZy10by1kZXZlbG9wLWFsZ2FsLWNyb3AtcHJvdGVjdGlvbi1zb2x1dGlvbnMtMzAyMDE4MTAyLmh0bWzSAQA?oc=5\" target=\"_blank\">U.S. Department of Energy Awards Team Led by Ginkgo Bioworks Funding to Develop Algal Crop Protection Solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Algae-based biotechnology can be used to drive forward clean energy solutions, such as sustainable aviation fuel, yet scaling algal biotechnologies for such purposes faces major barriers The DOE has awarded a Ginkgo-led team — which also includes partners from Pacific Northwest National Laboratory, Colorado School of Mines , and Global Algae Innovations — to build revolutionary algal crop protection solutions , and Global Algae Innovations — to build revolutionary algal crop protection solutions The team will leverage its expertise in applied algal biology, metagenomics, high-throughput screening, and adaptive laboratory evolution to work to design algal crop protection solutions as more environmentally-friendly alternatives to conventional chemical pesticides, while enhancing productivity BOSTON, Dec. 19, 2023 \/PRNewswire\/ -- Ginkgo Bioworks (NYSE: DNA), which is building the leading platform for cell programming and biosecurity, today announced that a Ginkgo-led team — including partners from the Pacific Northwest National Laboratory, Colorado School of Mines, and Global Algae Innovations — has been awarded funding through the U.S. Department of Energy's (DOE) Bioenergy Technologies Office (BETO). The scope of the project will be to develop a new approach to algal crop protection, inspired by integrated pest management strategies used for terrestrial crops. U.S. Department of Energy Awards Team Led by Ginkgo Bioworks Funding to Develop Algal Crop Protection Solutions Fueling the Future with Algae-Based Biotechnology The awarded project is part of DOE's investment in the development of clean energy solutions that reduce greenhouse gas emissions . More specifically, this project is focused on improving algal biotechnology to enable increased production of affordable biofuels and bioproducts from atmospheric CO 2 at large scales. Microscopic Pests Threaten Valuable Algal Crops A major barrier to scaling algal biotechnologies is predation on algae by microscopic 'pests' in open outdoor ponds. Current algal pest management strategies are generally not specific to a singular pest and include chemical or environmental control methods that can negatively impact algal productivity and increase pest resistance. There is a clear need for algal crop protection solutions that are highly selective against specific algal pests, are safe to use in aquaculture feeds for animal consumption, and do not produce detrimental environmental impacts commonly associated with traditional pesticides. Environmentally-Friendly Solutions for Algal Crop Protection Antimicrobial peptides (AMPs) are short chains of amino acids exhibiting antimicrobial activity that are considered a more environmentally-friendly alternative to conventional chemical pesticides. A wide range of organisms, including bacteria, plants, and animals naturally produce AMPs. The Ginkgo-led team will work to develop new algal pest-specific AMPs and at the same time use powerful adaptive laboratory evolution (ALE) capabilities to increase the tolerance of the algae and of their protective microbiome to AMP treatment. This combination of AMP treatment and evolved AMP tolerance holds significant potential for reducing the frequency of pest-related crashes in commercial algal ponds—during which the ponds can rapidly go from healthy and vibrant to sick and dead—and simultaneously increasing productivity. The team will also work to augment their understanding of outdoor pond ecologies via metagenomic and transcriptomic screening. \"We built our platform to help partners in sustainability like the DOE to enable novel and improved energy solutions. We're excited to leverage our uniquely powerful AMP and adaptive laboratory evolution (ALE) technologies,\" said Dr. Nikos Reppas, Senior Foundry Lead at Ginkgo Bioworks. \"This project is built around a world-class team of research and development partners, and we're proud to do our part to bring this promising crop protection strategy forward. We are eager to play a critical role in this space for our government partners and commercial algae cultivators around the world.\" If successful, this BETO investment has the potential to unlock a new suite of algal crop protection strategies to enhance productivity in outdoor environments. In the future, such aquaculture protection strategies could be used to enhance the economic viability of algae-based biomanufacturing to produce a range of products such as biofuels, nutritional supplements, cosmetics, and bioplastics from atmospheric CO 2 and sunlight, further enabling collective efforts toward carbon neutral production processes. About Ginkgo Bioworks Ginkgo Bioworks is the leading horizontal platform for cell programming, providing flexible, end-to-end services that solve challenges for organizations across diverse markets, from food and agriculture to pharmaceuticals to industrial and specialty chemicals. Ginkgo's biosecurity and public health unit, Concentric by Ginkgo, is building global infrastructure for biosecurity to empower governments, communities, and public health leaders to prevent, detect and respond to a wide variety of biological threats. For more information, visit ginkgobioworks.com and concentricbyginkgo.com , read our blog , or follow us on social media channels such as X (formerly known as Twitter) (@ Ginkgo and @ ConcentricByGBW ), Instagram (@ GinkgoBioworks and @ ConcentricByGinkgo ), Threads (@ GinkgoBioworks ) or LinkedIn . Forward-Looking Statements of Ginkgo Bioworks This press release contains certain forward-looking statements within the meaning of the federal securities laws, including statements regarding the capabilities and potential success of the partnership and Ginkgo's cell programming platform. These forward-looking statements generally are identified by the words \"believe,\" \"can,\" \"project,\" \"potential,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"may,\" \"should,\" \"will,\" \"would,\" \"will be,\" \"will continue,\" \"will likely result,\" and similar expressions. Forward-looking statements are predictions, projections and other statements about future events that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including but not limited to: (i) volatility in the price of Ginkgo's securities due to a variety of factors, including changes in the competitive and highly regulated industries in which Ginkgo operates and plans to operate, variations in performance across competitors, and changes in laws and regulations affecting Ginkgo's business, (ii) the ability to implement business plans, forecasts, and other expectations, and to identify and realize additional business opportunities, (iii) the risk of downturns in demand for products using synthetic biology, (iv) the uncertainty regarding the demand for passive monitoring programs and biosecurity services, (v) changes to the biosecurity industry, including due to advancements in technology, emerging competition and evolution in industry demands, standards and regulations, (vi) our ability to realize the expected benefits of merger and acquisition transactions, (vii) the outcome of any legal proceedings against Ginkgo, including as a result of recent acquisitions, (viii) our ability to realize the expected benefits from and the success of our Foundry platform programs, (ix) our ability to successfully develop engineered cells, bioprocesses, data packages or other deliverables, and (x) the product development or commercialization success of our customers. The foregoing list of factors is not exhaustive. You should carefully consider the foregoing factors and the other risks and uncertainties described in the \"Risk Factors\" section of Ginkgo's quarterly report on Form 10-Q filed with the U.S. Securities and Exchange Commission (the \"SEC\") on November 8, 2023 and other documents filed by Ginkgo from time to time with the SEC. These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and Ginkgo assumes no obligation and does not intend to update or revise these forward-looking statements, whether as a result of new information, future events, or otherwise. Ginkgo does not give any assurance that it will achieve its expectations. GINKGO BIOWORKS INVESTOR CONTACT: [email protected] GINKGO BIOWORKS MEDIA CONTACT: [email protected] SOURCE Ginkgo Bioworks","filter_flag":1}
{"title":"Unprecedented solar and storage growth on horizon with record installations and investments in U.S. - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8xOC91bnByZWNlZGVudGVkLXNvbGFyLWFuZC1zdG9yYWdlLWdyb3d0aC1vbi1ob3Jpem9uLXdpdGgtcmVjb3JkLWluc3RhbGxhdGlvbnMtYW5kLWludmVzdG1lbnRzLWluLXUtcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8xOC91bnByZWNlZGVudGVkLXNvbGFyLWFuZC1zdG9yYWdlLWdyb3d0aC1vbi1ob3Jpem9uLXdpdGgtcmVjb3JkLWluc3RhbGxhdGlvbnMtYW5kLWludmVzdG1lbnRzLWluLXUtcy_SAQA?oc=5","id":"CBMiigFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8xOC91bnByZWNlZGVudGVkLXNvbGFyLWFuZC1zdG9yYWdlLWdyb3d0aC1vbi1ob3Jpem9uLXdpdGgtcmVjb3JkLWluc3RhbGxhdGlvbnMtYW5kLWludmVzdG1lbnRzLWluLXUtcy_SAQA","guidislink":false,"published":"Mon, 18 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=18, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=352, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8xOC91bnByZWNlZGVudGVkLXNvbGFyLWFuZC1zdG9yYWdlLWdyb3d0aC1vbi1ob3Jpem9uLXdpdGgtcmVjb3JkLWluc3RhbGxhdGlvbnMtYW5kLWludmVzdG1lbnRzLWluLXUtcy_SAQA?oc=5\" target=\"_blank\">Unprecedented solar and storage growth on horizon with record installations and investments in U.S.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Unprecedented solar and storage growth on horizon with record installations and investments in U.S. - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5wdi1tYWdhemluZS5jb20vMjAyMy8xMi8xOC91bnByZWNlZGVudGVkLXNvbGFyLWFuZC1zdG9yYWdlLWdyb3d0aC1vbi1ob3Jpem9uLXdpdGgtcmVjb3JkLWluc3RhbGxhdGlvbnMtYW5kLWludmVzdG1lbnRzLWluLXUtcy_SAQA?oc=5\" target=\"_blank\">Unprecedented solar and storage growth on horizon with record installations and investments in U.S.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"In recent years, the United States has made substantial progress in embracing a renewable energy revolution, positioning itself on a path toward a more sustainable future. This transition is being propelled by a convergence of factors, including environmental concerns, economic opportunities and advancements in technology. With the introduction of the Inflation Reduction Act (IRA) and the Bipartisan Infrastructure Law (BIL), the U.S. is accelerating its move toward clean energy solutions. To illustrate the extent of this progress, consider the following key statistics: In 2022, the share of renewable energy sources (RES), including hydroelectric power, in the nation’s electricity generation had reached approximately 22%; furthermore, the share of RES in the total electricity generation capacity had increased to approximately 30%. Notably, in the transportation sector, there is also a growing awareness among consumers, who are increasingly opting for zero-emission fuels, such as electric vehicles. In 2022, the battery electric vehicles (BEVs) share in new vehicle registrations stood at 5.6%, and by the first half of 2023, the share had surged to 7.1%, according to EUPD Research estimates. The U.S. has set ambitious targets, including achieving 100% carbon pollution-free electricity by 2035 and aiming for economy-wide net-zero greenhouse gas emissions by no later than 2050. These targets are expected to provide a significant boost to the clean energy sector in the country, further reinforcing its commitment to a sustainable and environmentally responsible future. IRA and BIL fueling the boom The IRA and BIL mark an epochal shift in the landscape of clean energy policy, heralding a new era for the solar and energy storage sectors in the U.S. The IRA allocates substantial resources toward addressing the climate crisis, bolstering domestic clean energy production, and solidifying the U.S. role as a global leader in clean energy manufacturing. According to U.S. Department of Energy (DOE), a substantial investment exceeding $120 billion in the U.S. battery manufacturing and supply chain sector has been announced since the introduction of IRA and BIL. Furthermore, plans have been announced for the establishment of more than 200 new or expanded facilities dedicated to minerals, materials processing and manufacturing. This is anticipated to create over 75,000 potential job opportunities, strengthening the country’s workforce. After the introduction of IRA and BIL, solar PV manufacturing in the U.S. has also seen a substantial surge in planned investments, amounting to nearly $13 billion, according to the DOE. Furthermore, a total of 94 new and expanded PV manufacturing plants have been announced, which could potentially create over 25,000 jobs in the country. Surging solar sector In recent years, the solar sector in the U.S. has outpaced other energy sources, including wind and natural gas, in terms of capacity growth. EUPD Research estimates reveal a noteworthy upward trajectory in the contribution of solar capacity to annual power capacity additions. This trend has seen a rise from 37% in 2019 to 38% in 2020, further increasing to 44% in 2021, and reaching an impressive 45% in 2022. Annual PV capacity in the U.S. has been steadily rising in the past years, albeit with a temporary setback in 2022 caused by pandemic-related delays, enforcement of trade laws, disruptions in the supply chain, and increasing costs. (The country installed 21.1 GWdc of PV capacity in 2022, as compared to 23.1 GWdc in 2021.) The U.S. now is on track to make an historic addition to its PV capacity in 2023. According to EUPD Research’s 2023 forecast, the U.S. is poised to achieve its largest-ever expansion in PV capacity, with an estimated 32 to 35 GWdc, if all the planned utility-scale capacity gets installed. Moreover, in the period from 2023 to 2028, the U.S. is estimated to add approximately 233 GWdc of PV capacity. To learn more about how EUPD collects historical installed PV and storage data and make projections for future installed capacity, see EUPD Research’s Global Energy Transition (GET) Matrix. Popular content In terms of cumulative installed PV capacity (utility-scale + C&I + residential) on a state-by-state basis, California holds the top position followed by Texas, Florida, North Carolina and Arizona. Notably, Texas is rapidly expanding its utility-scale PV capacity, and it is poised to potentially surpass California within the next two years. Rapid expansion of battery storage Battery energy storage has emerged as the dominant and rapidly expanding source of energy storage in the U.S. in recent years. The proportion of battery storage in the country’s energy storage capacity has surged dramatically, climbing from a mere 3% in 2017 to a substantial 36% in the first half of 2023. In the U.S., battery storage capacity additions have been dominated by utility-scale installations. The rise of intermittent energy sources like solar and wind has made utility-scale batteries increasingly important. According to the DOE, the majority of planned utility-scale battery storage capacity is being installed alongside solar and wind facilities in the U.S. At the end of 2022, around 9 GW\/23.24 GWh of utility-scale battery storage capacity was installed in the U.S., as per EUPD Research estimates. Our projections show that in the year 2023, the U.S. is estimated to install a substantial 9.6 GW\/26.4 GWh of utility-scale battery storage capacity, surpassing the cumulative installed capacity up to 2022. In terms of total installed battery storage capacity (utility-scale + small-scale), California at present holds the top position followed by Texas, Florida, Hawaii and Arizona. Unveiling the top installers Crucial to the flourishing solar and storage industry in the U.S. are the downstream players, specifically installers. These entities play a pivotal role in driving sector expansion and shaping its trajectory. To ensure continued growth and success, understanding the landscape of the top installers in the country is imperative. Against this context, EUPD Research in its recently published report “Market Leadership Study: The United States 2023” came out with a ranking of the top installers in the U.S. distributed generation market. We also conducted a comprehensive evaluation of top installers, creating a data-driven snapshot of their competitive positioning. The installers were ranked using a rigorous methodology that considers various critical factors, such as installed capacity, sector coupling, vertical integration, financing options, and more. Each of these factors was assigned a specific weighting to determine the final rankings. EUPD Research is pleased to reveal the names of the top 10 distributed installers in the U.S., according to our report. Topping the list are industry giants Sunrun, Sunpower, and Tesla Energy, in positions 1, 2, and 3, respectively. The remaining companies in the top 10 are: Sunnova, ADT Solar, Palmetto Solar, Freedom Forever, Trinity Solar, Titan Solar Power, and Momentum Solar. In conclusion, the U.S. stands at the cusp of an energy revolution, propelled by ambitious targets and landmark legislation. The solar PV and energy storage sectors are witnessing unprecedented growth, guided by substantial investments and a surge in installations. With industry leaders driving innovation and sustainability, the nation is poised to achieve its clean energy goals, reaffirming its commitment to a greener future. Markus A.W. Hoehner is the founder and CEO of EUPD Research. Markus has over three decades of extensive expertise in top-level research and consulting, with a particular focus on renewable energies, the clean tech sector, and sustainable management. He is a dedicated advocate of the global energy transition and has actively championed this cause by spearheading various initiatives, projects, and enterprises aimed at fostering the expansion of sustainable industries on a global scale. The views and opinions expressed in this article are the author’s own, and do not necessarily reflect those held by pv magazine.","filter_flag":1}
{"title":"The EU wants to put a tax on emissions from imports. It's irked some other nations at COP28 - The Associated Press","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2NvcDI4LWNsaW1hdGUtc3VtbWl0LWNhcmJvbi10YXhlcy1ldS01MTE5MzFjOWQzZGE0MWY2MzMzOGMxMDllYjAxNDBmZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2NvcDI4LWNsaW1hdGUtc3VtbWl0LWNhcmJvbi10YXhlcy1ldS01MTE5MzFjOWQzZGE0MWY2MzMzOGMxMDllYjAxNDBmZdIBAA?oc=5","id":"CBMiYGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2NvcDI4LWNsaW1hdGUtc3VtbWl0LWNhcmJvbi10YXhlcy1ldS01MTE5MzFjOWQzZGE0MWY2MzMzOGMxMDllYjAxNDBmZdIBAA","guidislink":false,"published":"Sun, 10 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=344, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2NvcDI4LWNsaW1hdGUtc3VtbWl0LWNhcmJvbi10YXhlcy1ldS01MTE5MzFjOWQzZGE0MWY2MzMzOGMxMDllYjAxNDBmZdIBAA?oc=5\" target=\"_blank\">The EU wants to put a tax on emissions from imports. It's irked some other nations at COP28<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The EU wants to put a tax on emissions from imports. It's irked some other nations at COP28 - The Associated Press","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2NvcDI4LWNsaW1hdGUtc3VtbWl0LWNhcmJvbi10YXhlcy1ldS01MTE5MzFjOWQzZGE0MWY2MzMzOGMxMDllYjAxNDBmZdIBAA?oc=5\" target=\"_blank\">The EU wants to put a tax on emissions from imports. It's irked some other nations at COP28<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","source.href":"https:\/\/apnews.com","source.title":"The Associated Press","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"DUBAI, United Arab Emirates (AP) — A European Union plan to tax the carbon pollution emitted to make goods imported from countries like India and China has sparked a debate at the United Nations climate conference in Dubai, as poorer countries fear such tariffs will harm livelihoods and economic growth. Through the tax, the EU hopes to set a price on the carbon emitted to make energy-intensive products like iron, steel, cement, fertilizer and aluminum in other countries. The aim is to both reduce emissions from imports and create a level-playing field for goods made in the European bloc that must meet stricter green standards. The issue strikes at a core dilemma that policymakers are grappling with — and haggling over — at the COP28 climate conference in Dubai: How to get the world to go greener without upending more-fragile developing economies. Developing countries are worried that the tax under the EU’s planned Carbon Border Adjustment Mechanism would harm their economies and make it too expensive to trade with the bloc. “CBAM’s sole aim is to prevent carbon leakage” elsewhere in the supply chain, European Commissioner for Climate Action Wopke Hoekstra told reporters at the COP28 conference. He said the tax is crucial for funding and achieving the EU’s climate goal of slashing emissions 55% by 2030. A recent study by the U.N. Conference on Trade and Development found that a tax of $44 per ton of carbon emitted would slash pollution from the supply chain by half. It also estimated that rich countries would make $2.5 billion from the tax, but poorer countries might lose up to $5.9 billion. Others in wealthier countries including Britain, Canada and the United States are looking to follow suit. Sen. Sheldon Whitehouse of Rhode Island and Rep. Suzan DelBene of Washington, both Democrats, on Wednesday reintroduced legislation to create the “Clean Competition Act” that would similarly set a fee on imports from high-carbon emitting producers. Whitehouse, at a panel event Sunday at COP28, praised CBAM as “the brightest star in terms of emissions reduction in our firmament right now.” “This bill is the effort to do our piece of creating that international carbon pricing regime,” he said, expressing hopes to cut through “a blockade of fossil-fuel dark money and influence in Congress.” Responding to the worries in the developing world, Whitehouse said such measures would generate revenues for climate justice and improve the pathway toward “climate safety” — the lack of which would “fall far more heavily on the people in the economies and the countries that have fewest resources.” “I have zero remorse about CBAM from a climate justice point of view,” he said, insisting that his legislation would both grant exemptions to the least-developed countries and focus on the worst polluters in any given industry. India’s government is one of those strongly opposed to the idea. Former steel secretary Aruna Sharma has urged the government in New Delhi to continue to oppose the tax, but said industries do need to invest in lowering their carbon footprint for both exports and domestic goods. Mohamed Adow, the founder-director of Power Shift Africa, an independent think tank based in Kenya, called carbon taxes a “trade weapon” that could negatively affect Africa. He estimated the European measure could lead to a loss of at least $25 billion in trade revenue for his continent. Li Shuo, director of China Climate Hub at the Asia Society Policy Institute, said: “This issue is a significant concern in international climate politics. It’s not going away, and lives are at stake.” There’s also a technical concern: Vaibhav Chaturvedi, a research fellow at the Council on Energy, Environment and Water in New Delhi, said that under the U.N. climate change rules, countries cannot dictate how others should reduce emissions. Carbon taxes go against that rule, he said. Trade and climate policy experts say many developing countries fear being shut out of Western markets because they won’t be able to clean up their businesses fast enough. They also worry about being caught in conflicts between China and the West, with China seen as the primary target of the EU’s carbon tax. But K R Raghunath, founder of clean energy solutions company KIS group, said that even though a carbon tax could be “painful” for some countries in the short-term, it will still have a positive impact because it will reduce planet-warming emissions. “It will be good for everyone in the long run,” he said. “Ultimately, everybody has to reduce their carbon emissions.” ___ EDITOR’S NOTE: This article is part of a series produced under the India Climate Journalism Program, a collaboration between The Associated Press, the Stanley Center for Peace and Security and the Press Trust of India. ___ Associated Press climate and environmental coverage receives support from several private foundations. See more about AP’s climate initiative here. The AP is solely responsible for all content.","filter_flag":1}
{"title":"Dover Completes Acquisition of FW Murphy - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZG92ZXItY29tcGxldGVzLWFjcXVpc2l0aW9uLW9mLWZ3LW11cnBoeS0zMDIwMDQ5NTIuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZG92ZXItY29tcGxldGVzLWFjcXVpc2l0aW9uLW9mLWZ3LW11cnBoeS0zMDIwMDQ5NTIuaHRtbNIBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZG92ZXItY29tcGxldGVzLWFjcXVpc2l0aW9uLW9mLWZ3LW11cnBoeS0zMDIwMDQ5NTIuaHRtbNIBAA","guidislink":false,"published":"Mon, 04 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=338, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZG92ZXItY29tcGxldGVzLWFjcXVpc2l0aW9uLW9mLWZ3LW11cnBoeS0zMDIwMDQ5NTIuaHRtbNIBAA?oc=5\" target=\"_blank\">Dover Completes Acquisition of FW Murphy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dover Completes Acquisition of FW Murphy - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZG92ZXItY29tcGxldGVzLWFjcXVpc2l0aW9uLW9mLWZ3LW11cnBoeS0zMDIwMDQ5NTIuaHRtbNIBAA?oc=5\" target=\"_blank\">Dover Completes Acquisition of FW Murphy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"DOWNERS GROVE, Ill., Dec. 4, 2023 \/PRNewswire\/ -- Dover (NYSE: DOV) announced today that it has completed the previously reported acquisition of the business of FW Murphy Production Controls, LLC, which will become part of the Dover Precision Components operating unit within Dover's Pumps & Process Solutions segment. About Dover: Dover is a diversified global manufacturer and solutions provider with annual revenue of over $8 billion. We deliver innovative equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services through five operating segments: Engineered Products, Clean Energy & Fueling, Imaging & Identification, Pumps & Process Solutions and Climate & Sustainability Technologies. Dover combines global scale with operational agility to lead the markets we serve. Recognized for our entrepreneurial approach for over 65 years, our team of over 25,000 employees takes an ownership mindset, collaborating with customers to redefine what's possible. Headquartered in Downers Grove, Illinois, Dover trades on the New York Stock Exchange under \"DOV.\" Additional information is available at dovercorporation.com. Investor Contact: Media Contact: Jack Dickens Adrian Sakowicz Senior Director – Investor Relations Vice President – Communications (630) 743-2566 (630) 743-5039 [email protected] [email protected] SOURCE Dover","filter_flag":1}
{"title":"How did the top smartphone makers fare in sustainability in 2023? - Rappler","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5\" target=\"_blank\">How did the top smartphone makers fare in sustainability in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rappler<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How did the top smartphone makers fare in sustainability in 2023? - Rappler","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnJhcHBsZXIuY29tL3RlY2hub2xvZ3kvZmVhdHVyZXMvc21hcnRwaG9uZS1icmFuZHMtbWFrZXJzLXN1c3RhaW5hYmlsaXR5LXJlcG9ydHMtMjAyMy_SAQA?oc=5\" target=\"_blank\">How did the top smartphone makers fare in sustainability in 2023?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rappler<\/font>","source.href":"https:\/\/www.rappler.com","source.title":"Rappler","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"This is AI generated summarization, which may have errors. For context, always refer to the full article. According to an Alibaba study, in the Philippines, up to 89% of consumers desire sustainable lifestyles, making tech brands' green efforts more important than ever MANILA, Philippines – Smartphones are the most common and ubiquitous consumer electronics device today, estimated to have more than 4.5 billion users in 2022. These devices consume a lot of energy and resources to make, generating over 146 million tons of carbon dioxide or equivalent emissions, according to financial advisory group Deloitte’s estimates in 2022. It’s actually a tiny fraction of the 36.8 gigatons of emissions produced in 2022, but as Deloitte notes, “it is still worth trying to reduce.” Where is the carbon or equivalent emission produced in the life of a phone? In 2022 estimates, about 83% is said to come from the manufacture, shipping, first-year usage of new smartphones, while about 11% comes from the usage of existing phones, 4% comes from refurbishing old phones, and another 1% is from recycling processes. What does this tell us? A new smartphone purchase has a bigger carbon cost than extending one’s usage of an existing phone. As it stands, the standard practice among almost, if not all, smartphone manufacturers is to release new models on an annual basis. That’s the current pace of this business, which is designed to push you to upgrade sooner rather than later. There have been some evidence, however, that people are holding on to their phones longer, partly due to seemingly more minor annual improvements. Apple, earlier this year, was also investigated by France over accusations of planned obsolescence. The EU is legislating for replaceable batteries in phones, while the Biden administration in the US has pushed for more robust right-to-repair laws. All of these actions may potentially lengthen phone ownership. But even amid shifting buyer trends spurred partly by the lack of significant improvements, and government-led initiatives to extend smartphone usefulness, smartphone manufacturers aren’t likely to shift release cycles anytime soon. New products, at least for the foreseeable future, will continue to come out annually. As informed consumers, we can choose to not immediately latch on to the shiny new thing, especially if the year-to-year improvement isn’t that striking. But if it’s really time to upgrade, let’s take a look at which brand has the greenest processes, based on the latest versions of their sustainability reports, and other press-issued statements. Apple Apple has long been viewed as a leader in environmental standards, and the tech giant has never been shy to incorporate its progress in these initiatives to its product marketing. At its annual September launch event, the iPhone-maker aired a five-minute sketch, where CEO Tim Cook, among other employees, held a meeting with a personified Mother Nature, played by Hollywood actor Octavia Spencer. In that meeting, Cook and company try to win over Mother Nature’s heart by sharing with her a report of the progress the company has made on its sustainability objectives. The video is, of course, meant to tout how this year’s Watch models reportedly carry the carbon neutral branding, with the company aiming to do the same for all of its products by 2030. The sketch drew mixed reactions from the public. Some called it out for how it used climate initiatives to sell products, while others simply didn’t find it entertaining at all. For this list, however, the focus will be on the iPhone. As mentioned previously, manufacturing smartphones is energy- and resource-intensive, creating a lot of emissions that impact the environment. Last year’s iPhone 14 Pro, for instance, emits 65 kg of carbon dioxide into the atmosphere during its lifecycle, according to Apple. No less than 81% of those emissions occur during the manufacturing process, which covers the extraction of raw materials, the manufacturing of the device itself and transport, to name a few steps. This year’s iPhone 15 Pro, in comparison, emits 66 kg of carbon dioxide, one kilogram higher than the iPhone 14 Pro’s emissions. Apple, however, notes that the 15 Pro’s emissions would have been 26 kg higher if not for the use of more recycled materials and clean energy solutions. Still, it’s not a move towards a lower number, so it’s tough to argue that the iPhone moved the needle this year in terms of green efforts. What might be worth mentioning is that Apple debuted USB-C connectivity on this year’s iPhone generation, the iPhone 15. While it can be argued that the European Union’s common charger legislation forced the company’s hand, the change still marks a significant contribution towards lessening e-waste. With iPhones now sporting a USB-C port, you’ll be able to use the cables and adapters you might already have to charge your device. Making the USB-C as standard across all devices is estimated to save at least 11,000 tons of e-waste annually. Xiaomi Xiaomi is similarly taking action to reduce its carbon emissions, adopting what it calls its Zero-Carbon Philosophy to reach its goals. This plan was reportedly rolled out in phases, and spans different aspects of the Chinese electronics giant’s operations. The first phase, which was set in 2021, involved Xiaomi lowering carbon emissions of its main headquarters, targeting a 4.5% decrease by 2026 versus its 2020 figure. But in just two years, the company says it has already managed to surpass its target, recording a 21.12% reduction in per capita carbon emissions compared to the 2021 baseline. The company has also touted new, more energy-efficient technologies in its products. In the past year, for example, it said it has developed a more energy-efficient 5G and signal transmission solution, reducing the power consumption of the company’s smartphones by up to 30% compared with the previous generation. Another notable effort is the development of a new, more energy-efficient display technology, which reduces the energy consumption of devices by up to 70% in specific applications. Xiaomi also promotes a circular economy, anchored by a refurbishing system that renews discarded devices. The company claims that within the past year, it has refurbished about 94,000 smartphones, all of which were later sold again as certified refurbished products. Other green initiatives include the use of wear-resistant ceramic materials and synthetic silicone in smartphones, the adoption of eco-friendly packaging with less paper and plastic, and the development of a recycling system that finds new use for e-waste. Honor HONOR 90 5G Honor in 2023 published its first-ever Environmental, Social and Governance Report, where it outlined its goal to reduce its carbon emissions by 88%, achieve 100% use of renewable energy, and reach carbon neutral operations by 2045. As part of that sustainability commitment, the former Huawei sub-brand is overhauling its product development lifecycle. For example, it has reportedly reduced its use of hazardous substances and materials by 3,861 tons and recycled more than 1,785 tons of e-waste. Additionally, 98% of the materials used in the packaging of the Magic V foldable smartphone are non-plastic. On the production side, automated technology is reportedly employed to reduce energy and resource consumption. These efforts, according to Honor, puts it on track to reach its goal to reach carbon neutral operations by 2045. realme Realme in 2023 reaffirmed its commitment to its “Sustainability Vision” initiative, which involves cutting 50% of its carbon emissions from its popular GT smartphone series within five years. The initiative, which was announced in 2022, has the Chinese brand try to minimize its carbon footprint as much as it can throughout the whole smartphone cycle, from design to manufacturing to recycling. In its sustainability report, Realme highlighted three important approaches it’s taking as part of the initiative. First, it’s extending the lifespan of its products by adopting a more modular design and improving after-sales services. Second, it’s adopting stricter standards around hazardous substance control to reduce the environmental impact of the disposal of its smartphones. Last, it has set up a recycling system and a trade-in business to take in discarded smartphones, preventing them from ending up in a landfill. Realme also touted that its 2022 flagship, the Realme GT2 Pro, is the world’s first TCO 9.0 certified smartphone. TCO 9.0 is a certification given to IT products that fulfill a certain criteria for sustainability. The GT2 Pro features a biopolymer rear panel, which supposedly decreases carbon emissions from its manufacturing by 35.5%. The material also creates up to two kilograms less carbon emissions for every kilogram made versus petroleum. OPPO Similar to the other companies on this list, OPPO also has its own commitment to sustainability that covers the optimization of smartphones’ lifecycles and the use of eco-friendly materials in manufacturing, among others. What’s a bit different with the company’s approach, however, is it’s also getting like-minded individuals involved in its low-carbon development roadmap. In 2022, OPPO launched the Inspiration Challenge, which called on tech professionals and entrepreneurs to submit their ideas for tech innovations. Winning ideas were awarded a grant and technical support from the company. This year, OPPO brought back the challenge, featuring two categories: “Inspiration for People” and “Inspiration for the Planet”. The latter, of course, focuses on solutions that promote green technology as applied to consumer electronics. Among the winners was Estonia-based startup Woola’s packaging solution for the OPPO Watch, made from recycled wool. Each of the five winners received a grant of $50,000 as well as opportunities to collaborate with OPPO and its partners to further develop their ideas. OPPO was also recognized by Time in 2023 for its Zero-Power Tag, a tracking device that sends out temperature or location data without using a battery. The lightweight prototype uses ambient energy sources like radio waves and heat to power it, negating the need for a lithium ion battery, which are harmful to the environment and eventually end up in landfills. The company said it’s refining the tracker to expand its feature set and perhaps apply it to other smaller devices. Samsung Samsung claims that 2023’s S23 models are its “most sustainable phones yet.” The South Korean electronics giant touted the devices’ are UL ECOLOGO-certified for reduced environmental and health impact. Furthermore, the Galaxy S23 Ultra is said to be made up of 12 internal and external components of recycled material, up from the Galaxy S22 Ultra’s six. The materials include recycled aluminum and glass as well as recycled plastics sourced from discarded fishing nets and water barrels. All the materials for the packaging are also sustainably sourced. While it’s nice to hear about an uptick in usage of recycled materials, the overall impact is not clear at the moment. In addition, Samsung promised to deliver up to four generations of OS updates and five years of security updates for the S23 series. This promise should help prolong the life of your device and let you use it longer without it feeling outdated. Samsung said it’s also made strides towards its New Environmental Strategy, which is the company’s roadmap to reach net zero at the Device eXperience (DX) Division by 2030 and at the company level including the Device Solutions (DS) Division by 2050. The DX division covers the company’s smartphone and home appliance businesses. Among those strides is the increase in use of renewable energy by 65% compared to the previous year, reaching 8,704 gigawatt hours. In line with this, all of DX division’s offices in Korea as well as manufacturing plants in Vietnam, India, and Brazil have reportedly transitioned to 100% renewable energy, following the same transition in the company’s US, Europe, and China offices in 2020. In its annual sustainability report, the company said its efforts in 2022 produced a total sustainability value equivalent to about $88.9 billion. However, in 2023, it’s expecting that value to decline, citing “global economic recession and industry stagnation” as major factors. It said, though, that this decline won’t stop it from investing in environmental management initiatives in semiconductor process gas reduction and water resource preservation, among others. Samsung in 2023 also launched its Sustainability Website, showing key data on its progress towards its net zero goals and details on its sustainability-related initiatives. The website, which covers a range of topics, helps the company disclose the relevant information in a transparent and easy-to-digest fashion. Fairphone Play Video It’s not a household name but when it comes to sustainability, there’s arguably no other brand that has stronger credentials than the Fairphone. This is why the Dutch cooperative has found itself on this list. In 2023, it released the Fairphone 4, a modern smartphone designed in such a way that you can repair yourself from the comfort of your home. A lot of that repairability comes from the device’s modular design. Its rear panel can, for instance, be unclipped without any tools, while the battery can easily be replaced using your standard screwdriver. Fairphone also said that the device is manufactured from fair trade gold and silver and ethically sourced aluminum and tungsten as well as recycled metals and plastic. The brand has also committed to recycling the equivalent volume of electronics per device sold. While some of the aforementioned smartphone manufacturers above also have recycling practices and promote repairability, none of them have gone to the lengths Fairphone has. So in this regard, it deserves some form of recognition, despite the fact that it’s not as readily available as most other phone brands here. Huawei Huawei has its “Tech for a Better Planet” planet pledge that focuses on “advancing energy conservation and emissions reduction, promoting renewable energy, and contributing to a circular economy.” The company said that the average energy efficiency of their main products in 2022, when its last green report was published, has increased 2.1 times compared with 2019. For their manufacturing processes, Huawei said their use of a digital energy monitoring system that manages power consumption on production lines, and upgrades towards more efficient machines have led to energy savings of 19.67 million kWh throughout 2022, or the equivalent of 11,218 tons of emissions. Like many brands, they tout the use of lightweight packaging, minimize plastic use, and promote reuse of packaging materials. Huawei said in its sustainability report, “The longer a product’s lifecycle, the smaller its impact on the environment.” To that end, they promised “easy” upgrades for their Harmony OS “over the long term.” They touted a smooth user experience across all devices, even providing upgrade services down to their older phones such as the Mate 9 series released way back in 2016. “The OS makes it possible for users to revive old models from many years ago,” Huawei said. The company also said it has a global recycling system wherein they work with scrap providers to reuse raw materials for use in refurbishing devices. The program has so far led to 600,000 sold refurbished devices, including phones. vivo In its sustainability report, Vivo touts the thinness of their products as a way to reduce materials use. For examples, their S series phones’ components have become thinner by 15 to 30%, resulting in not just a lighter product for the user, but slightly for the environment as well. The company also said that they’ve made their packaging lighter over the years, citing a reduction of about 18 grams for some models. “For every 10 million mobile phones, the reduction is equivalent to saving the use of 180 tons of paper,” vivo said. In their Y series phones, 50% of the fibers in their packaging materials come from recycling, with the company saying they’re aiming for a higher percentage gradually. They’ve lowered the use of plastics in earphone and data cable cases too by 17.5% and 6.7% respectively. For everyday use, the company highlighted how they make their phones more energy efficient for it to last longer. “To the best of our ability, we use electronic components with higher energy efficiency, and use intelligent algorithms to intelligently adjust device performance according to users’ usage scenarios and application needs,” it said. Making their devices tougher will extend product life too, said vivo, explaining how the rate of display modules cracking has been reduced by 70%. Assessing sustainability It’s worth assessing the sustainability efforts of these smartphone giants each year as there’s reportedly a growing number of consumers who are seeking eco-friendly products to support sustainable lifestyles. In the Philippines, up to 89% of consumers desire sustainable lifestyles but find it difficult due to inconvenience and high costs, according to an Alibaba Group study. Those are the two major factors that are stopping them from changing their shopping behaviors in this aspect. With regards to the smartphone industry, there are steps being taken to address both inconvenience and costs in support of sustainability, led by the EU with its new rules on USB-C standardization, battery replaceability, and right-to-repair laws. Such regulations can help solve the two aforementioned challenges stopping consumers leading sustainable lifestyles, allowing them to hold onto their devices for longer, which saves them from repair fees or the cost of a new device. Would these changes offset the smartphone industry’s impact on the environment? Alone, perhaps not. However, when factored in with the other initiatives that companies like Apple, Samsung, and Xioami, to name a few, are rolling out behind the scenes as well as the EU’s other regulatory efforts, there’s a strong potential to turn the smartphone value chain green. – Rappler.com","filter_flag":1}
{"title":"Millennium Welt, Gentari break ground on EV charging flagship store - theSun","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdGhlc3VuLm15L2J1c2luZXNzL21pbGxlbm5pdW0td2VsdC1nZW50YXJpLWJyZWFrLWdyb3VuZC1vbi1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1DTzExODY1NjY30gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdGhlc3VuLm15L2J1c2luZXNzL21pbGxlbm5pdW0td2VsdC1nZW50YXJpLWJyZWFrLWdyb3VuZC1vbi1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1DTzExODY1NjY30gEA?oc=5","id":"CBMiaGh0dHBzOi8vdGhlc3VuLm15L2J1c2luZXNzL21pbGxlbm5pdW0td2VsdC1nZW50YXJpLWJyZWFrLWdyb3VuZC1vbi1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1DTzExODY1NjY30gEA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdGhlc3VuLm15L2J1c2luZXNzL21pbGxlbm5pdW0td2VsdC1nZW50YXJpLWJyZWFrLWdyb3VuZC1vbi1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1DTzExODY1NjY30gEA?oc=5\" target=\"_blank\">Millennium Welt, Gentari break ground on EV charging flagship store<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">theSun<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Millennium Welt, Gentari break ground on EV charging flagship store - theSun","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdGhlc3VuLm15L2J1c2luZXNzL21pbGxlbm5pdW0td2VsdC1nZW50YXJpLWJyZWFrLWdyb3VuZC1vbi1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1DTzExODY1NjY30gEA?oc=5\" target=\"_blank\">Millennium Welt, Gentari break ground on EV charging flagship store<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">theSun<\/font>","source.href":"https:\/\/thesun.my","source.title":"theSun","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"PETALING JAYA: Millennium Welt, a dealer partner for BMW, MINI and BMW Motorrad brands, and Gentari Malaysia, a clean energy solutions provider, today broke ground on their first EV Charging Flagship Store which will offer a new concept and experience. BMW Asia-Pacific, Eastern Europe, Middle East and Africa sales region senior vice-president Jean-Phillipe Parain said the Millennium Welt and Gentari EV Charging Flagship Store, located at Jalan Kuching, Kuala Lumpur, will offer a first-of-its-kind concept for electric vehicle charging in Southeast Asia. Based on the concept of an EV charging store, the facility enables the charging of multiple vehicles at one time with a specialised store representing the brands of the BMW Group. “The facility demonstrates the Retail.Next appearance as well as services which is developed to complement the future mobility capabilities of our new products and offerings,” Parain said. Millennium Welt Group managing director Bryan Wong said the groundbreaking ceremony represents not only the commencement of their first EV Charging Flagship Store, but the realisation of a vision that is deeply rooted in their commitment to redefining the future of mobility. “At Millennium Welt, we believe that electrification goes beyond a choice, it is a lifestyle. Through our partnership with Gentari, we are able to take a leap towards advancing the electric mobility experience by creating an immersive space where cutting-edge technology is seamlessly integrated with sustainable solutions to meet the evolving needs of our valued customers. I am thrilled about our transformative journey ahead as we continue to set the standard for a cleaner and more sustainable nation,” he added. Shah Yang Razalli, deputy CEO of Gentari and CEO of Gentari Green Mobility Sdn Bhd, said, “We are pleased to do our part in levelling up the EV charging experience in Malaysia through this EV Charging Flagship Store, jointly developed with our partner, Millennium Welt. Beyond the deployment of 14 EV charging points, including high-speed 240kW and AC chargers, we are also introducing a vibrant experience hub for the Malaysia enjoyment of our customers while they charge.” The EV Charging Flagship Store – which is to be powered completely by renewable energy sources – will house a display area capable of featuring 66 cutting-edge electric vehicles, in addition to seamlessly integrated services, including a dedicated BMW Premium Selection showroom and insurance renewal business. The store elevates the premium experience with state-of-the-art infrastructure for the charging of electric vehicles, including six units of 240kW DC chargers and two units of 22kW AC chargers, complemented by 14 parking bays.","filter_flag":1}
{"title":"ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5","id":"CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA","guidislink":false,"published":"Fri, 01 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5\" target=\"_blank\">ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5\" target=\"_blank\">ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Informa Markets Unveils ENERtec Asia, Transforming the ASEAN M&E Trade Show KUALA LUMPUR, Malaysia, Dec. 1, 2023 \/PRNewswire\/ -- The global energy landscape is undergoing a rapid transformation, driven by the urgent need to transition to sustainable energy sources and enhance energy efficiency. In response to this critical need, Informa Markets, the world's leading exhibitions organiser, proudly announces the rebranding of the highly successful ASEAN M&E trade show to ENERtec Asia, ushering in a new era of innovation and transformation. ENERtec Asia 2024 - Official Launch The energy landscape has undergone a profound transformation in the face of climate change challenges, geopolitical conflicts, and mounting pressure for businesses to adopt sustainable practices. Escalating energy costs and the demand for Environmental, Social, and Governance (ESG) compliance have intensified the need for clean energy solutions. Against this backdrop, ENERtec Asia emerges as a catalyst for change, offering sustainable solutions to alleviate financial strain and reduce carbon footprints for businesses worldwide. Scheduled to take place from 26th to 28th June 2024, at the prestigious Kuala Lumpur Convention Centre (KLCC), Malaysia, ENERtec Asia 2024 is set to revolutionise the industry. This transformative event will bring together a diverse array of global solution providers, mechanical and electrical industry professionals, and energy experts, providing them with a unique platform to collaborate and innovate under one roof. ENERtec Asia will feature three distinctive segments - TENAGA (Renewable Energy & Cleantech), REVAC (Energy Efficiency & Decarbonisation), and an exciting new addition - BATTERY & EV Tech (Energy Storage & EV Technology and Solutions). This innovative trade show will lead the way in the energy transition journey within the Southeast Asia region, showcasing revolutionary technologies ranging from renewable power generation and smart energy management to battery and energy storage solutions, as well as HVACR products focused on decarbonization and energy efficiency. Furthermore, it will spotlight innovations related to electric vehicles, creating a comprehensive platform for exploring the future of sustainable energy and transportation. Expressing his enthusiasm for the forthcoming event, Gerard Leeuwenburgh, Country General Manager of Informa Markets, said \"ENERtec Asia 2024 signifies a pivotal moment in the energy landscape of ASEAN. We are proud to be at the forefront of this transformation, bringing together key stakeholders, innovative solutions, and groundbreaking initiatives shaping the future of energy. This event will foster collaborations and drive meaningful discussions, accelerating our collective journey towards a sustainable and energy-efficient ASEAN.\" This rebranding is a testament to Malaysia's growing leadership in the energy transition within ASEAN. Malaysia, ranked 35th in the World Energy Transition Index (ETI) and No.1 in ASEAN, is spearheading the energy transition within the region. The nation's commitment to the Net Zero Carbon Neutral target drives the economy towards becoming a High-Income Nation. Malaysia's energy transition goals are outlined in the National Energy Transition Roadmap (NETR) and the New Industrial Master Plan (NIMP2030). These initiatives underscore the significance of ESG and the Green Industry, pivotal elements propelling Malaysia towards a sustainable future. Malaysia's energy transition strategy encompasses ten flagship projects under NETR, focusing on Renewable Energy, Energy Efficiency, and Green Industrial Development. The Industrial Environmental Sustainability Guidelines (iESG) introduced by the Ministry of International Trade and Industry (MITI) extend the goals of NIMP2030, emphasizing green transitions in industrial sectors. Furthermore, Malaysia's energy transition strategy emphasizes Renewable Energy and Energy Efficiency, targeting urban areas, industrial parks, technology parks, and agriculture. The forthcoming Energy Efficiency and Conservation Act (EECA), currently in its parliamentary process, will serve as the cornerstone of Malaysia's journey towards energy efficiency, shaping the nation's sustainable future. In a significant stride towards sustainability, all Bursa Malaysia-listed companies are mandated to obtain their ESG certificates by 2024. This initiative underscores the country's commitment to environmental, social, and governance standards, ensuring sustainable practices across industries. Malaysia is driving electric vehicle (EV) adoption by aiming to establish 10,000 EV charging stations by 2025, aligning with the Low Carbon Mobility Blueprint 2021-2030. This initiative promotes eco-friendly transportation solutions and supports the growing demand for electric vehicles. As a major electrical and electronics manufacturing hub in Southeast Asia, Malaysia offers a strategic advantage to automakers and investors. The components sub-sector, including semiconductors, sensors, batteries, and vehicle assembly, provides a robust supply chain for Next-Generation Vehicles (NxGVs). \"Malaysia's commitment to the Energy Transition is unwavering. ENERtec Asia provides a platform to showcase our achievements, share knowledge, and collaborate with international partners. Together, we will drive innovation and champion the adoption of Renewable Energy and Energy Efficiency for a greener, more sustainable future for our nation and the ASEAN region,\" Ir. Chang Yew Cheong, President of The Electrical & Electronics Association of Malaysia (TEEAM). ENERtec Asia is proud to announce strategic collaborations with prominent industry stakeholders, including TEEAM (The Electrical and Electronics Association of Malaysia), EIC (Energy Industries Council), APUEA (Asia Pacific Urban Energy Association), Megajana, MDCA (Malaysian District Cooling Association), ASHRAE Malaysia Chapter, FMM (Federation of Malaysian Manufacturers), Malaysia Green Building Council, and SME Association of Malaysia. Their expertise and support will enhance the event's impact and relevance. \"As a leading player in the energy sector, we are excited to participate in ENERtec Asia. This event aligns perfectly with our mission to drive innovation and sustainability in our industry. We look forward to engaging with fellow experts, exploring new technologies, and contributing to the dialogue on energy transition and environmental stewardship,\" said Mr Azman Nasir, Regional Director of Energy Industries Council (EIC). The participation of several industry giants as exhibitors underscores the event's significance in the energy sector, reaffirming ENERtec Asia as the epicenter of innovation and transformation. \"ENERtec Asia signifies a transformative moment in the region's energy landscape. This event serves as a catalyst, driving the transition towards a sustainable, low-carbon future. We are excited to witness and take part in the innovations and collaborations that will shape the future of energy in ASEAN.\" said Mr. Peter Lundberg, Executive Director of Asia Pacific Urban Energy Association (APUEA). ENERtec Asia 2024 promises to be a transformative event, uniting industry leaders, policymakers, and innovators to drive the energy transition agenda forward. With an impressive lineup of 400 exhibitors, encompassing renowned industry giants and esteemed representatives from 5 international pavilions, ENERtec Asia 2024 is set to reign as the focal point of ingenious solutions and sustainable practices across the region. ENERtec Asia 2024 is set to attract over 10,000 participants, including industry professionals, consultants, engineers, contractors, and policymakers. The event will serve as a hub for networking, knowledge exchange, and collaboration, bringing together thought leaders and decision-makers to explore the latest advancements in ESG initiatives and energy transition technologies. For more information, please visit www.enertecasia.com. About ENERtec Asia ENERtec Asia (www.enertecasia.com) is Southeast Asia's premier event dedicated to ESG and energy transition. Formerly known as ASEAN M&E, ENERtec Asia has been rebranded with a renewed and dynamic identity to reflect its expanded focus across three key segments namely, TENAGA (Renewable Energy & Cleantech), REVAC (Energy Efficiency & Decarbonisation) and an exciting NEW segment - BATTERY & EV Tech (Energy Storage & EV Technology and Solutions). Organised by Informa Markets, ENERtec Asia serves as the region's leading platform, uniting industry leaders, innovators, and policymakers to explore sustainable practices, cutting-edge technologies, and collaborative initiatives driving the region's energy transition towards a low-carbon future. By fostering a dynamic environment where businesses can showcase their latest products and services, forge strategic partnerships, and spearhead the development of sustainable energy landscapes, ENERtec Asia emerges as a catalyst for shaping a greener future for the region's energy sector. The event also features a comprehensive conference program with insights from industry experts on a wide range of topics related to ESG and energy transition. For more information, please visit www.enertecasia.com. About Informa Markets Informa Markets (www.informamarkets.com) creates platforms for industries and specialist markets to trade, innovate and grow. Our portfolio is comprised of more than 550 international B2B events and brands in markets including Healthcare & Pharmaceuticals, Infrastructure, Construction & Real Estate, Fashion & Apparel, Hospitality, Food & Beverage, and Health & Nutrition, among others. We provide customers and partners around the globe with opportunities to engage, experience and do business through face-to-face exhibitions, specialist digital content and actionable data solutions. As the world's leading exhibition organiser, we bring a diverse range of specialist markets to life, unlocking opportunities and helping them to thrive 365 days of the year. SOURCE ENERtec Asia","filter_flag":1}
{"title":"BMW and Gentari join hands for EV Charging Flagship Store in Jalan Kuching - ZigWheels Malaysia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZ9IBcmh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZz9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZ9IBcmh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZz9hbXA9MQ?oc=5","id":"CBMibGh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZ9IBcmh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZz9hbXA9MQ","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZ9IBcmh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZz9hbXA9MQ?oc=5\" target=\"_blank\">BMW and Gentari join hands for EV Charging Flagship Store in Jalan Kuching<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZigWheels Malaysia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BMW and Gentari join hands for EV Charging Flagship Store in Jalan Kuching - ZigWheels Malaysia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZ9IBcmh0dHBzOi8vd3d3LnppZ3doZWVscy5teS9jYXItbmV3cy9ibXctYW5kLWdlbnRhcmktam9pbi1oYW5kcy1mb3ItZXYtY2hhcmdpbmctZmxhZ3NoaXAtc3RvcmUtaW4tamFsYW4ta3VjaGluZz9hbXA9MQ?oc=5\" target=\"_blank\">BMW and Gentari join hands for EV Charging Flagship Store in Jalan Kuching<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZigWheels Malaysia<\/font>","source.href":"https:\/\/www.zigwheels.my","source.title":"ZigWheels Malaysia","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"KUALA LUMPUR: BMW Group Malaysia is putting a lot of effort into developing the electric vehicle infrastructure in the country. The recent collaboration between Millennium Welt and Gentari Malaysia is a strong indication of its dedication. KEY TAKEAWAYS What are the key highlights of the BMW-Gentari EV Charging Flagship Store? The BMW-Gentari EV Charging Flagship Store includes a display space for 66 cutting-edge EVs, six 240kW DC Chargers, two 22kW AC Chargers, 14 parking bays, BMW’s Retail.Next ambience and integrated services like the BMW Premium Selection showroom and Insurance Renewal Business. The dealer partner for the brands BMW, MINI, and BMW Motorrad, Millennium Welt, and the clean energy solutions provider, Gentari, broke ground for their first EV Charging Flagship in Jalan Kuching earlier this morning. The EV Charging Flagship Store offers a new concept and experience for EV charging. Among its key highlights are - With a display space for 66 cutting-edge electric vehicles, the new store is a hub for firsthand experiences of future mobility The store comprises six 240kW DC Chargers, two 22kW AC Chargers, and 14 parking bays for efficient EV charging It offers customers a premium ownership experience of electrified BMW vehicles with BMW’s Retail.Next ambience and integrated services like the BMW Premium Selection showroom and Insurance Renewal Business The new EV Charging Flagship Store is staffed by an exceptional team that guides customers through its offerings with sophistication and excellence and thus ensures a personalised and seamless experience The store will run entirely on renewable energy sources, demonstrating the brand’s commitment to sustainability and environmental responsibility. Jean-Phillipe Parain, Senior Vice President of the Sales Region in Asia-Pacific, Eastern Europe, Middle East and Africa said, “The Millennium Welt and Gentari’s EV Charging Flagship Store would be amongst the first of its kind experience concept for electric vehicles in Southeast Asia. Based on the concept of an EV charging store, the facility enables the charging of multiple vehicles at a single time with a specialised store representing the brands from the BMW Group. The facility demonstrates the Retail.Next appearance as well as services which is developed to complement the future mobility capabilities of our new products and offerings.” Bryan Wong, Managing Director of Millennium Welt Group, added, “Today’s groundbreaking ceremony represents not only the commencement of our first EV Charging Flagship Store, but the realisation of a vision that is deeply rooted in our commitment to redefining the future of mobility. At Millennium Welt, we believe that electrification goes beyond a choice, it is a lifestyle. Through our partnership with Gentari, we are able to take a leap towards advancing the electric mobility experience by creating an immersive space where cutting-edge technology is seamlessly integrated with sustainable solutions to meet the evolving needs of our valued customers. I am thrilled about our transformative journey ahead as we continue to set the standard for a cleaner and more sustainable nation.” “We are pleased to do our part in levelling up the EV charging experience in Malaysia through this EV Charging Flagship Store, jointly developed with our partner, Millennium Welt. Beyond the deployment of 14 EV charging points, including high-speed 240kW and AC chargers, we are also introducing a vibrant experience hub for the enjoyment of our customers while they charge,” shared Shah Yang Razalli, Deputy CEO of Gentari & CEO of Gentari Green Mobility Sdn Bhd. The new EV Charging Flagship Store is set to be the first of its kind in the Southeast Asian region. It joins BMW Group Malaysia's fastest-growing EV charging network, with over 1,700 BMW i and MINI charging spots nationwide. Also read: BMW Group Malaysia welcomes Benjamin Nagel as new Managing Director and CEO","filter_flag":1}
{"title":"BMW dealer Millennium Welt and Gentari break ground on ASEAN's first EV charging flagship store in KL - paultan.org - Paul Tan's Automotive News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3BhdWx0YW4ub3JnLzIwMjMvMTIvMTMvYm13LWRlYWxlci1taWxsZW5uaXVtLXdlbHQtYW5kLWdlbnRhcmktYnJlYWstZ3JvdW5kLW9uLWFzZWFucy1maXJzdC1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1pbi1rbC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3BhdWx0YW4ub3JnLzIwMjMvMTIvMTMvYm13LWRlYWxlci1taWxsZW5uaXVtLXdlbHQtYW5kLWdlbnRhcmktYnJlYWstZ3JvdW5kLW9uLWFzZWFucy1maXJzdC1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1pbi1rbC_SAQA?oc=5","id":"CBMihAFodHRwczovL3BhdWx0YW4ub3JnLzIwMjMvMTIvMTMvYm13LWRlYWxlci1taWxsZW5uaXVtLXdlbHQtYW5kLWdlbnRhcmktYnJlYWstZ3JvdW5kLW9uLWFzZWFucy1maXJzdC1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1pbi1rbC_SAQA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3BhdWx0YW4ub3JnLzIwMjMvMTIvMTMvYm13LWRlYWxlci1taWxsZW5uaXVtLXdlbHQtYW5kLWdlbnRhcmktYnJlYWstZ3JvdW5kLW9uLWFzZWFucy1maXJzdC1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1pbi1rbC_SAQA?oc=5\" target=\"_blank\">BMW dealer Millennium Welt and Gentari break ground on ASEAN's first EV charging flagship store in KL - paultan.org<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Paul Tan's Automotive News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BMW dealer Millennium Welt and Gentari break ground on ASEAN's first EV charging flagship store in KL - paultan.org - Paul Tan's Automotive News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3BhdWx0YW4ub3JnLzIwMjMvMTIvMTMvYm13LWRlYWxlci1taWxsZW5uaXVtLXdlbHQtYW5kLWdlbnRhcmktYnJlYWstZ3JvdW5kLW9uLWFzZWFucy1maXJzdC1ldi1jaGFyZ2luZy1mbGFnc2hpcC1zdG9yZS1pbi1rbC_SAQA?oc=5\" target=\"_blank\">BMW dealer Millennium Welt and Gentari break ground on ASEAN's first EV charging flagship store in KL - paultan.org<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Paul Tan's Automotive News<\/font>","source.href":"https:\/\/paultan.org","source.title":"Paul Tan's Automotive News","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Posted in BMW, Cars, Local News \/ By Danny Tan \/ December 13 2023 5:08 pm Millennium Welt – a dealer partner for BMW, MINI and BMW Motorrad brands – and clean energy solutions provider Gentari broke ground on the first EV Charging Flagship Store in Jalan Kuching today. The KL facility will offer a new concept and experiences for EV charging, BMW Group Malaysia says. “Millennium Welt and Gentari’s EV Charging Flagship Store would be amongst the first of its kind experience concept for EVs in Southeast Asia. Based on the concept of an EV charging store, the facility enables the charging of multiple vehicles at a single time with a specialised store representing the brands from the BMW Group,” said Jean-Phillipe Parain, BMW’s senior VP of sales in Asia-Pacific, Eastern Europe, Middle East and Africa. “The facility demonstrates the ‘Retail.Next’ appearance as well as services which is developed to complement the future mobility capabilities of our new products and offerings,” he added. The EV Charging Flagship Store will have six 240 kW DC chargers and two 22 kW AC chargers, complemented by 14 parking bays. While the EV is charging, owners can browse a display area capable of housing 66 EVs. There will also be a BMW Premium Selection showroom and insurance renewal counter at the facility, which will be powered completely by renewable energy sources. “At Millennium Welt, we believe that electrification goes beyond a choice, it is a lifestyle. Through our partnership with Gentari, we are able to take a leap towards advancing the electric mobility experience by creating an immersive space where cutting-edge technology is seamlessly integrated with sustainable solutions to meet the evolving needs of our valued customers,” said Bryan Wong, MD of the Millennium Welt Group. Looking to sell your car? Sell it with Carro.","filter_flag":1}
{"title":"NWTN Announces Strategic Partnership with China State Construction Engineering Corporation (Middle East) - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL253dG4tYW5ub3VuY2VzLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC13aXRoLWNoaW5hLXN0YXRlLWNvbnN0cnVjdGlvbi1lbmdpbmVlcmluZy1jb3Jwb3JhdGlvbi1taWRkbGUtZWFzdC0zMDIwMDkyNTguaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL253dG4tYW5ub3VuY2VzLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC13aXRoLWNoaW5hLXN0YXRlLWNvbnN0cnVjdGlvbi1lbmdpbmVlcmluZy1jb3Jwb3JhdGlvbi1taWRkbGUtZWFzdC0zMDIwMDkyNTguaHRtbNIBAA?oc=5","id":"CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL253dG4tYW5ub3VuY2VzLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC13aXRoLWNoaW5hLXN0YXRlLWNvbnN0cnVjdGlvbi1lbmdpbmVlcmluZy1jb3Jwb3JhdGlvbi1taWRkbGUtZWFzdC0zMDIwMDkyNTguaHRtbNIBAA","guidislink":false,"published":"Thu, 07 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=341, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL253dG4tYW5ub3VuY2VzLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC13aXRoLWNoaW5hLXN0YXRlLWNvbnN0cnVjdGlvbi1lbmdpbmVlcmluZy1jb3Jwb3JhdGlvbi1taWRkbGUtZWFzdC0zMDIwMDkyNTguaHRtbNIBAA?oc=5\" target=\"_blank\">NWTN Announces Strategic Partnership with China State Construction Engineering Corporation (Middle East)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NWTN Announces Strategic Partnership with China State Construction Engineering Corporation (Middle East) - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL253dG4tYW5ub3VuY2VzLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC13aXRoLWNoaW5hLXN0YXRlLWNvbnN0cnVjdGlvbi1lbmdpbmVlcmluZy1jb3Jwb3JhdGlvbi1taWRkbGUtZWFzdC0zMDIwMDkyNTguaHRtbNIBAA?oc=5\" target=\"_blank\">NWTN Announces Strategic Partnership with China State Construction Engineering Corporation (Middle East)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"DUBAi, UAE, Dec. 7, 2023 \/PRNewswire\/ -- NWTN Inc. (Nasdaq: NWTN), an eco-conscious mobility technology company bringing passenger-centric green premium mobility solutions to the world (\"NWTN\" or the \"Company\"), is thrilled to announce a landmark Memorandum of Understanding (MOU) with China State Construction Engineering Corporation (Middle East) LLC (CSCEC), marking a significant stride in international cooperation and sustainable development. This partnership sets a new precedent in the pursuit of advancements in new energy vehicles and green hydrogen projects. NWTN China Construction MOU Signing NWTN China Construction MOU Signing This pivotal agreement, witnessed by Wang Shaofeng, President of CSCEC Middle East, and Alan Nan, Chairman and Chief Executive Officer of NWTN, was formalized between Wei Chuaihai, Vice President of CSCEC Middle East, and Faris AI Yafei, Director of Strategic Cooperation of NWTN. The signing ceremony took place at the NWTN booth in the COP28 Green Zone, Dubai Expo City, and was graced by the presence of H.E. Omar Ahmed Suwaina Al Suwaidi, Undersecretary of the Ministry of Industry and Advanced Technology (MOIAT). The signing ceremony was attended by notable figures including Ma Wenlong, Vice President of CSCEC Middle East; Guo Haizhou, President Assistant of CSCEC Middle East; Paul Lin, NWTN Group Automotive Business President; and Steven Cao, NWTN Group Vice President and Chief Marketing Officer. Scope and Objective of Cooperation This strategic partnership encompasses extensive collaboration in market development and business promotion across diverse regions, including East Asia, North Africa, and Southeast Asia. The primary objective is to leverage each company's industry position and technological prowess to propel the development of innovative and sustainable projects, significantly enhancing both companies' market competitiveness and brand influence. Comprehensive Collaboration Framework Under the terms of the MOU, CSCEC will manage the comprehensive project construction process, including planning, feasibility studies, general contracting, and project financing assistance. In parallel, NWTN will focus on project investment and operations, harnessing its market and product advantages to boost the sales and market expansion of new energy vehicles and green hydrogen projects. Commitment to Sustainable Development This collaboration epitomizes our commitment to sustainable development and environmental protection. By combining CSCEC's construction and management expertise with NWTN Inc.'s innovative technology in new energy vehicles and green hydrogen, we aim to set new standards in the industry. Future Prospects This MOU is just the beginning of a fruitful and long-lasting partnership. Both parties have established a regular communication and exchange system, ensuring the smooth progress of joint projects. Further, each company recognizes the other as a strategic partner in their respective countries, committed to the success of this collaboration. NWTN is excited to embark on this journey with CSCEC. This partnership not only aligns with its strategic goals but also represents a significant step towards a sustainable future. We are confident that this collaboration will yield remarkable results and set a benchmark in the industry. ABOUT NWTN NWTN is a pioneering green energy company dedicated to providing passenger-focused, premium electric vehicle products and green energy solutions to customers worldwide. Headquartered in Dubai, United Arab Emirates (UAE), NWTN has a full vehicle assembly facility in Abu Dhabi. NWTN is committed to the future of mobility solutions that integrate pioneering design, personalized lifestyles, Internet of Everything (IoT), autonomous driving technology and the eco-system of green energy. In addition to the offering of new energy vehicles, NWTN is exploring opportunities in the entire clean energy value chain, including photovoltaics, green hydrogen power and energy storage in the UAE, the Middle East, North Africa, China, other Asian countries, and Europe. For further information, please visit: www.nwtn.ae FORWARD-LOOKING STATEMENTS This press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements are characterized by future or conditional verbs such as \"may,\" \"will,\" \"expect,\" \"intend,\" \"anticipate,\" believe,\" \"estimate\" and \"continue\" or similar words. You should read statements that contain these words carefully because they discuss future expectations and plans, which contain projections of future results of operations or financial condition or state other forward-looking information. Forward-looking statements are predictions, projections, and other statements about future events (including, but not limited to, the anticipated benefits of its partnerships) that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Actual results (including, but not limited to, the success of NWTN's partnerships in developing clean energy solutions) may differ significantly from those set forth or implied in the forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including but not limited to the risk factors contained in NWTN's filings with the Securities and Exchange Commission, which are available for review at www.sec.gov. Forward-looking statements speak only as of the date they are made. New risks and uncertainties arise over time, and it is not possible NWTN to predict those events or how they may affect NWTN. If a change to the events and circumstances reflected in NWTN's forward-looking statements occurs, NWTN's business, financial condition and operating results may vary materially from those expressed in NWTN's forward-looking statements. Readers are cautioned not to put undue reliance on forward-looking statements, and NWTN assumes no obligation and does not intend to update or revise these forward-looking statements, whether as a result of new information, future events or otherwise. SOURCE NWTN","filter_flag":1}
