{"title":"Elektros Launches New Clean Energy Technology Brand - Elektros Energy - Yahoo Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lbGVrdHJvcy1sYXVuY2hlcy1jbGVhbi1lbmVyZ3ktdGVjaG5vbG9neS0xMjQ1MDA5NzQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lbGVrdHJvcy1sYXVuY2hlcy1jbGVhbi1lbmVyZ3ktdGVjaG5vbG9neS0xMjQ1MDA5NzQuaHRtbNIBAA?oc=5","id":"CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lbGVrdHJvcy1sYXVuY2hlcy1jbGVhbi1lbmVyZ3ktdGVjaG5vbG9neS0xMjQ1MDA5NzQuaHRtbNIBAA","guidislink":false,"published":"Mon, 27 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=86, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lbGVrdHJvcy1sYXVuY2hlcy1jbGVhbi1lbmVyZ3ktdGVjaG5vbG9neS0xMjQ1MDA5NzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Elektros Launches New Clean Energy Technology Brand - Elektros Energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Elektros Launches New Clean Energy Technology Brand - Elektros Energy - Yahoo Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lbGVrdHJvcy1sYXVuY2hlcy1jbGVhbi1lbmVyZ3ktdGVjaG5vbG9neS0xMjQ1MDA5NzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Elektros Launches New Clean Energy Technology Brand - Elektros Energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","source.href":"https:\/\/finance.yahoo.com","source.title":"Yahoo Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"SUNNY ISLES BEACH, FL \/ ACCESSWIRE \/ March 27, 2023 \/ Elektros (OTC PINK:ELEK), an emerging leader in the electric mobility industry, announces the launch of its new clean energy technology brand, Elektros Energy. Elektros Energy brand will better reflect its focus on such areas as Lithium mining, EV charging, solar energy, and innovative solutions to help accelerate the world's transition to a cleaner and more sustainable energy future. Lithium mining is a critical component of the clean energy industry, as it is a key material used in the production of batteries for electric vehicles and renewable energy storage. Elektros Energy is committed to responsibly sourcing Lithium, ensuring that it is extracted in an environmentally and socially responsible way. Elektros recently announced it had begun discussions regarding potential stake or development agreement for virgin Lithium mining project located in Sierra Leon, Africa. EV charging is another area of focus for Elektros Energy, as the demand for electric vehicles continues to rise. The company is working on developing fast, reliable, and accessible charging solutions for EV drivers to make it easier for them to adopt this sustainable mode of transportation. The company's patent pending Multi-Port Charging Assembly allows users to use multiple charging features on electric vehicles we plan to not only include in our designs, but aggressively market to major electric vehicle manufacturers under licensing agreements. MISSION STATEMENT At Elektros, our mission is to revolutionize the clean technology industry by developing innovative and sustainable solutions that empower individuals, businesses, and communities to transition to a greener future. We believe that by harnessing the power of technology, we can create a cleaner, healthier, and more sustainable world for generations to come. We are committed to using the latest advancements in science and engineering to design and manufacture cutting-edge products that meet the highest standards of quality, efficiency, and sustainability. We strive to minimize our environmental impact by adopting sustainable practices in our operations and supply chain, while maximizing social impact through our partnerships and community engagement initiatives. At Elektros, we believe that clean technology is the key to unlocking a brighter future, and we are dedicated to making that future a reality. We are constantly pushing the boundaries of what is possible, and we are committed to delivering the best possible outcomes for our customers, our stakeholders, and the planet. For more information about Elektros Energy, please visit www.elektrosenergy.com Story continues About Elektros, Inc. Elektros, Inc. is a leading technology company dedicated to the development of innovative clean energy solutions. The company is focused on advancing the world's transition to a cleaner and more sustainable energy future through its work in electric vehicles (EV), Lithium mining, EV charging, and solar power. With a commitment to responsible sourcing and sustainability, Elektros is working to create a more environmentally and socially conscious world. Through its focus on cutting-edge technologies and a team of experienced professionals, Elektros is poised to make a significant impact on the clean energy industry and help drive positive change for generations to come. www.elektrosenergy.com Twitter: https:\/\/twitter.com\/elektrosenergy Facebook: https:\/\/www.facebook.com\/Elektrosmotors\/ Cautionary Language Concerning Forward-Looking Statements This release contains \"forward-looking statements\" that include information relating to future events and future financial and operating performance. The words \"may,\" \"would,\" \"will,\" \"expect,\" \"estimate,\" \"can,\" \"believe,\" \"potential,\" and similar expressions and variations thereof are intended to identify forward-looking statements. Forward-looking statements should not be read as a guarantee of future performance or results and will not necessarily be accurate indications of the times at, or by, which that performance or those results will be achieved. Forward-looking statements are based on information available at the time they are made and\/or management's good faith belief as of that time with respect to future events and are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in or suggested by the forward-looking statements. Important factors that could cause these differences include, but are not limited to: fluctuations in demand for Elektros, Inc.'s products, the introduction of new products, the Company's ability to maintain customer and strategic business relationships, the impact of competitive products and pricing, growth in targeted markets, the adequacy of the Company's liquidity and financial strength to support its growth, and other information that may be detailed from time to time in Elektros Inc.'s filings with the United States Securities and Exchange Commission. Examples of such forward-looking statements in this release include statements regarding future sales, costs, and market acceptance of products as well as regulatory actions at the State or Federal level. For a more detailed description of the risk factors and uncertainties affecting Elektros Inc., please refer to the Company's Securities and Exchange Commission filings, which are available at www.sec.gov. Elektros, Inc. undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. CONTACT: Elektros, Inc. Email: info@elektrosmotors.com SOURCE: Elektros, Inc. View source version on accesswire.com: https:\/\/www.accesswire.com\/745860\/Elektros-Launches-New-Clean-Energy-Technology-Brand--Elektros-Energy ","filter_flag":1}
{"title":"Canada formalizes 30% federal ITC credit, other incentives – pv magazine International - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzMxL2NhbmFkYS1mb3JtYWxpemVzLTMwLWZlZGVyYWwtaXRjLWNyZWRpdC1vdGhlci1pbmNlbnRpdmVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzMxL2NhbmFkYS1mb3JtYWxpemVzLTMwLWZlZGVyYWwtaXRjLWNyZWRpdC1vdGhlci1pbmNlbnRpdmVzL9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzMxL2NhbmFkYS1mb3JtYWxpemVzLTMwLWZlZGVyYWwtaXRjLWNyZWRpdC1vdGhlci1pbmNlbnRpdmVzL9IBAA","guidislink":false,"published":"Fri, 31 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=90, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzMxL2NhbmFkYS1mb3JtYWxpemVzLTMwLWZlZGVyYWwtaXRjLWNyZWRpdC1vdGhlci1pbmNlbnRpdmVzL9IBAA?oc=5\" target=\"_blank\">Canada formalizes 30% federal ITC credit, other incentives – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Canada formalizes 30% federal ITC credit, other incentives – pv magazine International - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzAzLzMxL2NhbmFkYS1mb3JtYWxpemVzLTMwLWZlZGVyYWwtaXRjLWNyZWRpdC1vdGhlci1pbmNlbnRpdmVzL9IBAA?oc=5\" target=\"_blank\">Canada formalizes 30% federal ITC credit, other incentives – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"From pv magazine USA Canada’s federal government has outlined a new, six-year investment tax credit that puts a 30% tax credit in place for solar, wind and energy storage projects deployed through March 2034. The Clean Technology ITC was included as part of the Canadian government’s 2023 Budget Day fiscal priorities on March 28, with Deputy Prime Minister and Finance Minister Chrystia Freeland releasing the government’s 2023 federal budget. The Canadian government is prioritizing a clean energy economy as one of the three main pillars of its multi-year budget plan. The federal government has a goal of making its electric grid net zero by 2035 through tax incentives for clean energy projects over the next six years. Canada’s Budget 2023 mirrors the IRA and includes two new ITCs targeting clean energy and technology manufacturing. In the government’s remarks this week, it said the new plan allows Canada to remain competitive with its southern neighbor. In the government’s 2022 Fall Economic Statement, it proposed a 30% refundable Clean Technologies ITC, available to eligible properties that are acquired or become available for use on or after March 28, 2023. In Budget 2023, the government expanded this ITC to apply to geothermal energy projects, in addition to solar, wind and energy storage. The term of the ITC was also extended from phasing out in 2032, as was intended under the 2022 proposal, and will remain at 30% through December 2033, stepping down to 15% in 2034 before phasing out altogether after 2034. A new incentive that the Canadian government is providing is a refundable 15% investment tax credit on the capital costs made by non-taxable entities. These include indigenous or tribal communities, municipal utilities and Crown-corporations that make investments in renewable energy, energy storage, interprovincial power transmission and other clean energy infrastructure projects. Popular content The ITC also applies to new hydroelectric, wave\/tidal projects, nuclear (including small modular reactors), and abated natural gas-fired generation. The Clean Hydrogen ITC was announced as part of the government’s 2022 proposals. New details of the basic design elements of the hydrogen ITC include a volumetric ITC credit based on carbon intensity of the project, measured by kilograms of carbon emissions produced per kilogram of hydrogen, and meeting prescribed labor conditions. As detailed in the above chart, green hydrogen produced using the least carbon emissions and produced with claimable trained labor can see an ITC of up to 40%, while grey or blue hydrogen as its called using lesser carbon recovery can see a 5% to 25% ITC, depending on labor conditions. To continue reading, please visit our pv magazine USA website.","filter_flag":1}
{"title":"Thorough Lifecycle Analysis of Ceramic Tiles - AZoM","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI1NDTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI1NDTSAQA?oc=5","id":"CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI1NDTSAQA","guidislink":false,"published":"Tue, 14 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=73, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI1NDTSAQA?oc=5\" target=\"_blank\">Thorough Lifecycle Analysis of Ceramic Tiles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoM<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Thorough Lifecycle Analysis of Ceramic Tiles - AZoM","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI1NDTSAQA?oc=5\" target=\"_blank\">Thorough Lifecycle Analysis of Ceramic Tiles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoM<\/font>","source.href":"https:\/\/www.azom.com","source.title":"AZoM","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Ceramic tiles are a common building material renowned for their resilience, adaptability, and aesthetic qualities. As with any other building material, the manufacture and disposal of ceramic tiles have a significant influence on the environment. To understand the environmental effect of the fabrication and use of ceramic tiles, it is crucial to undertake a full lifecycle analysis. Image Credit: DUO Studio\/Shutterstock.com Need for Lifecycle Analyses of Ceramic Tiles Global urbanization is accelerating, and it is estimated that by 2050, up to 68 percent of the population will reside in urban regions. Cement, clay brick, ceramics, mortar, wood, plastic, and steel make up construction and demolition debris (CDW). The building sector has significantly contributed to the depletion of natural resources and has had profound effects on the environment; in 2019, 39% of worldwide CO2 emissions were attributable to the construction industry, with 11% due to the manufacturing of construction materials. Environmental rules and regulations are growing stricter as the demand for ecologically efficient structures continues to increase. Innovation is closely tied to economic progress, yet it is frequently accompanied by environmental damage. Thus, the appropriate use of raw materials, the implementation of sustainable power, utilizing environmentally efficient materials, and the management of environmental pollution are challenges for businesses. Assessing environmental performance necessitates an effective evaluation method that takes various elements into account. As a result of eco-innovation, several studies have stressed the need for Life Cycle Assessments (LCA). A Brief Introduction to Lifecycle Assessment Analysis Life Cycle Assessments (LCA) are thorough assessments that look at the ecological footprint of a product across its whole life cycle, beginning with the extraction of raw materials and concluding with waste management. Other stages of the lifecycle, including manufacturing techniques and transportation, are also analyzed thoroughly. This instrument is used internationally to address global ecological consequences, taking into account a full product's service life. The ability to acquire quantitative carbon footprint findings associated with a product or service across its entire life cycle and to identify opportunities for improvement is one of the primary advantages of this technique. Life Cycle Assessments (LCA) have become widely employed in the commercial ceramics sector to improve manufacturing system sustainability. As a result of this, life cycle assessment is now seen as a driving factor in government policy. In general, three aspects are considered: environmental, socioeconomic, and natural resource protection. The rigorous analysis of any product leads to efficient resource consumption by employing the most effective approaches available in a certain sector. In addition, LCAs are frequently used throughout the value chain, affording the possibility to evaluate the consequences and origins of a product or process in a holistic manner. The Ceramic Tile Industry Spain and Brazil have contributed to the global doubling of the ceramic tile industry via the development of new products and production techniques. The industry has two basic manufacturing processes - dry processing and wet processing - with distinct outcomes. Ceramic tiles are made via shaping and glazing. Shaping requires raw materials, slurry, forming, and drying, while glazing requires purchasing raw ingredients, generating glaze-frit, grinding and polishing, applying glaze to the ceramic body, and firing. MECS has released its global ceramic tile market projection for the next five years. According to the research 'Ceramic Tile Market Forecast Analysis - Trend 2021-2025', yearly production growth will average 5%. During the five years from 2021 to 2025, the global ceramic tile market is anticipated to expand at an average annual rate of 5% in terms of production (an extra 4.5 billion square meters by 2025) and 5.1% regarding consumption, culminating in a very minor rise in inventories. Ecological Impacts The ecological impacts of ceramic tiles could be understood by reviewing their manufacturing processes. The manufacture of ceramic tiles entails a variety of complex procedures requiring accuracy and skill. First, the raw ingredients, which commonly consist of clay, feldspar, kaolin, and other minerals, are prepared. These substances are combined in precise amounts before being processed into a fine powder. The powder is then combined with water to create a slurry, which is subsequently poured into molds. Typically, plaster is used to construct the molds, and the slurry is allowed to cure and solidify within the molds. When the tiles have been carefully removed from their molds, they undergo a procedure called firing. This is accomplished by heating the tiles to temperatures between 1,100 and 1,200 degrees Celsius in a kiln. During the firing process, the tiles become denser and more durable, and any residual moisture is pushed away. Following the fire, the tiles are examined for quality and, if necessary, glazed. Glazing includes putting a thin coating of liquid glass on the tile's surface, followed by a second firing to fuse the glaze to the tile's surface. This provides a smooth, waterproof surface to the tile and can also add aesthetic features. During the process of heating, several gases are emitted, which include large quantities of greenhouse gases. These gases contribute to ozone layer depletion and air pollution. Additionally, transporting ceramic tiles from the manufacturer to the construction site presents an additional environmental concern. Depending on the distance to be traveled, the transport of ceramic tiles may emit nitride and oxide hazardous gases as well as other pollutants. These toxic gases are a key contributor to environmental degradation. Ceramic tiles can also take thousands of years to degrade in a landfill, leading to environmental pollution. A preferable way is to recycle ceramic tiles instead of dumping them. Recycling ceramic tiles reduce the need for fresh raw materials, lowering their environmental impact. Lifecycle Analysis and the Ceramic Tiles Industry The latest research published in the Journal of Materials Research and Technology has presented a thorough lifecycle analysis of the ceramic tile industry. The researchers have proposed that determining the functional units, system boundaries, and climate impact allocations are essential steps. A functional unit identifies the amount of a product or product system based on the performance it provides in its final application. The researchers have found that in life cycle assessments (LCA), system boundaries must be described in several dimensions, including those between the technical system and environment, the geographical region and timeframe, etc. Concentrating on ceramic tiles, life cycle assessment breaks down the whole transportation, production, and disposal system into unit operations and evaluates all of its elements, subsystems, and materials. Inventory analysis, which records the inputs and outputs of ceramic tiles, is the most essential evaluation in this phase of the ceramic tile lifecycle. The most popular software applications utilized for life cycle analysis include Open LCA, SimaPro, Umberto NxT, GaBi, QuantisSuite, and Model Bousted. As per the researchers, the LCA of ceramic tiles has indicated that excessive power consumption, industry emissions (particulate matter, gases, and toxic liquids), and waste generation are the most significant hazards. The determination of the impacts of ceramic tile products throughout their life cycle is done by utilizing a systematic approach with environmental product declarations (EPDs). These statements improve environmental performance and aid in evaluating the life cycles of products. With EPDs, businesses compete to create more sustainable products. To summarize, the researchers have stressed the need for more research and data which would boost the sustainable production of ceramic tiles, leading to a reduction in hazardous emissions. Case Study: Life Cycle Analysis of Glazed Ceramic Tile A study published in Clean Technologies and Environmental Policy focuses on the lifecycle analysis of glazed ceramic tiles to measure the environmental impacts. Total Abiotic depletion potential (ADP) components in the manufacturing of glazed ceramic tiles were about 55 mg Sb\/m2. The estimated global warming potential (GWP) for ceramic tile was 14.4 kg CO 2 equivalent per square meter. CO 2 emissions account for approximately 92.1% of the overall effect. The manufacturing of ceramic tiles had an ozone layer depletion potential of 1.3 mg CFC-11 equivalents per square meter, which was mostly driven by the production phase (52.9%). The primary contributions to this impact are emissions of non-methane volatile organic compounds (NMVOC) to the atmosphere, such as halon 1301 (55.6 %) and halon 1201 (24.3 %), caused by the use of natural gas for heat generation. The plant consumed 1,130 TJ of energy annually to create 106,195 tons of glazed ceramic tile. Future Trends As environmental awareness increases, there is a greater demand for eco-friendly building materials. The ceramic tile industry is exploring ways to reduce its environmental impact. Biogas or renewable energy might lessen the environmental impact of producing fossil fuels. Installing a combined cycle system or utilizing waste heat in the manufacturing process is also a good step. Alternative materials or waste from other industries may be substituted for standard raw materials in formulations to lessen the environmental impacts of the raw materials supply. In conclusion, a thorough lifecycle analysis of ceramic tiles reveals that their production and use have significant environmental impacts, and steps must be taken for sustainable ceramic tile production. More from AZoM: Alumina Ceramics Joined by Spark Plasma Sintering References and Further Reading Ceramic World Web, 2022. World ceramic tile industry and market: forecasts to 2025. [Online] Available at: https:\/\/ceramicworldweb.com\/en\/economics-and-markets\/world-ceramic-tile-industry-and-market-forecasts-2025 Vieira AW. et. al. Life cycle assessment in the ceramic tile industry: a review. (2023) Journal of Materials Research and Technology. Available at: https:\/\/doi.org\/10.1016\/j.jmrt.2023.02.023. Atılgan Türkmen, B., Budak Duhbacı, T. & Karahan Özbilen, Ş. (2021). Environmental impact assessment of ceramic tile manufacturing: a case study in Turkey. Clean Techn Environ Policy, 23. 1295–1310. Available at: https:\/\/doi.org\/10.1007\/s10098-021-02035-w Disclaimer: The views expressed here are those of the author expressed in their private capacity and do not necessarily represent the views of AZoM.com Limited T\/A AZoNetwork the owner and operator of this website. This disclaimer forms part of the Terms and conditions of use of this website.","filter_flag":1}
{"title":"Panasonic focuses on European growth - Cooling Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL3BhbmFzb25pYy1mb2N1c2VzLW9uLWV1cm9wZWFuLWdyb3d0aC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL3BhbmFzb25pYy1mb2N1c2VzLW9uLWV1cm9wZWFuLWdyb3d0aC_SAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL3BhbmFzb25pYy1mb2N1c2VzLW9uLWV1cm9wZWFuLWdyb3d0aC_SAQA","guidislink":false,"published":"Mon, 13 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=72, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL3BhbmFzb25pYy1mb2N1c2VzLW9uLWV1cm9wZWFuLWdyb3d0aC_SAQA?oc=5\" target=\"_blank\">Panasonic focuses on European growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cooling Post<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Panasonic focuses on European growth - Cooling Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL3BhbmFzb25pYy1mb2N1c2VzLW9uLWV1cm9wZWFuLWdyb3d0aC_SAQA?oc=5\" target=\"_blank\">Panasonic focuses on European growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cooling Post<\/font>","source.href":"https:\/\/www.coolingpost.com","source.title":"Cooling Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Panasonic’s Czech factory will receive an extra JPY15bn investment JAPAN: Panasonic is to invest an additional JPY15bn (€105m) in its Czech factory as part of plans to accelerate growth of its European air-to-water heat pump and hydronic systems business. This new investment combined with the investment announced in October last year and the acquisition of Systemair’s air conditioning business, announced in November 2022, brings Panasonic’s total investment in the European region to JPY80bn (€560m). Panasonic sees Europe as a priority region being recognised a front runner in the transition to a carbon-free society. On April 1, the company will establish an HVAC Business Division Europe in Wiesbaden, Germany, transferring development, manufacturing and sales functions to the region and shift to regionally optimised management. In order to meet growing demand and strengthen profitability, the Czech plant will be doubled in size compared to the original plan as part of plans to further expand its A2W production capacity to 1 million units globally in the medium term. Following the completion of the acquisition of the Systemair’s air conditioning business, the HVAC Company will accelerate the hydronic systems business with products manufactured at factories in France and Italy. This will enable Panasonic to offer a complete lineup of hot-water supply, heating, and air conditioning equipment for residential and commercial use, and provide solutions to meet a wide range of needs. On the development side, a new R&D centre will be established in Milan. It will develop residential and commercial hydronic systems and models that use low GWP refrigerants, as well as conduct research on clean technology, sensor technology, and indoor air quality. It will also strengthen cloud development to expand IoT-based services for customers after equipment delivery. Remote monitoring and fault detection of equipment will reduce the management workload and enable timely inspections and repairs. In addition, the visualisation of energy consumption and air quality will enable energy savings and an optimal indoor environment, resulting in the safe, reliable, and comfortable use of products for a long time. Speaking at the ISH exhibition today, Hiroshi Komatsubara, recently appointed MD of Panasonic HVAC Business Division Europe, commented: “We are investing €550m in the European market with a range of activities including developing our Czech factory to strengthen A2W production and expanding the Panasonic R&D Centre in Italy working on local-fit product, low-GWP refrigerant product, clean technology, sensing technology, indoor air quality solutions as well as other initiatives.”","filter_flag":1}
{"title":"TTP are moving to their all-new ‘TTP Campus’ in April - Cambridge Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhbWJyaWRnZW5ldHdvcmsuY28udWsvbmV3cy90dHAtYXJlLW1vdmluZy10aGVpci1hbGwtbmV3LXR0cC1jYW1wdXMtYXByaWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhbWJyaWRnZW5ldHdvcmsuY28udWsvbmV3cy90dHAtYXJlLW1vdmluZy10aGVpci1hbGwtbmV3LXR0cC1jYW1wdXMtYXByaWzSAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmNhbWJyaWRnZW5ldHdvcmsuY28udWsvbmV3cy90dHAtYXJlLW1vdmluZy10aGVpci1hbGwtbmV3LXR0cC1jYW1wdXMtYXByaWzSAQA","guidislink":false,"published":"Wed, 15 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=74, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhbWJyaWRnZW5ldHdvcmsuY28udWsvbmV3cy90dHAtYXJlLW1vdmluZy10aGVpci1hbGwtbmV3LXR0cC1jYW1wdXMtYXByaWzSAQA?oc=5\" target=\"_blank\">TTP are moving to their all-new ‘TTP Campus’ in April<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cambridge Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TTP are moving to their all-new ‘TTP Campus’ in April - Cambridge Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhbWJyaWRnZW5ldHdvcmsuY28udWsvbmV3cy90dHAtYXJlLW1vdmluZy10aGVpci1hbGwtbmV3LXR0cC1jYW1wdXMtYXByaWzSAQA?oc=5\" target=\"_blank\">TTP are moving to their all-new ‘TTP Campus’ in April<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cambridge Network<\/font>","source.href":"https:\/\/www.cambridgenetwork.co.uk","source.title":"Cambridge Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"The big move will happen in mid-April, and we will be relocating from Melbourn Science Park to the all-new TTP Campus, a truly unique site built with a clear vision to become ‘The space to invent’ for TTP’s business, its people, and its clients. The new TTP Campus is located just outside of the Melbourn Science Park and will be immediately noticeable to those entering from the science park’s main entrance. TTP is a world-leading technology consultancy where scientists and engineers collaborate to invent, design and develop new products and technologies. From healthcare to telecoms to clean technology and consumer products, TTP develops breakthrough solutions and invests time into creating technologies that make a genuine impact and change the world for the better. 30 years of innovation and invention have been delivered from the company’s facilities at Melbourn Science Park, where for over three decades it has built strong relationships with the local community. As TTP has grown, it’s created a number of spin-out companies, most of which have also chosen Melbourn Science Park as their base. Specifically designed for collaboration, the new TTP Campus delivers a working environment which inspires interaction and creativity and enables closer partnership with clients. \"Investing in new technology and product development is integral to what we do at TTP. Our new campus will enable our technically brilliant people to come together and work across disciplines in a collaborative and creative environment. This will have a truly positive impact on how we support our clients in the most innovative and progressive way.\" Says Dr Sam Hyde, Managing Director at TTP Across the campus, the new buildings house state-of-the-art labs, offices, and manufacturing space, but key to the design are a variety of indoor and outdoor workspaces and working locations to stimulate TTP’s people to think differently. The mixed office and open lab space of The Hive covers nearly 80,000 ft2, it’s been designed on one level and is open plan to be fully inclusive. The Tech Barn offers over 18,000 square feet of focused laboratory, testing, and build space for multiple projects. The Exchange provides a staff restaurant, and gym, as well as collaboration, agile working, and social space. These are all connected to the external landscape and fitness trail. The campus has been built to last, providing a flexible and adaptable long-term home for TTP, as well as creating a sustainable and ecologically friendly environment. With fresh water, wildflower meadows and mature planting the hope is for some local residents of the four-legged and winged variety to also move in! The campus has sustainability at the heart of its design and is also low energy with minimal need for heating and cooling, and around 30% of the energy for the site coming from solar panels.","filter_flag":1}
{"title":"Government of Canada invests over $25.7 million to fuel innovation and economic growth in Vancouver - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWludmVzdHMtb3Zlci0yNS03LW1pbGxpb24tdG8tZnVlbC1pbm5vdmF0aW9uLWFuZC1lY29ub21pYy1ncm93dGgtaW4tdmFuY291dmVyLTg5MzY3NTUwNi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWludmVzdHMtb3Zlci0yNS03LW1pbGxpb24tdG8tZnVlbC1pbm5vdmF0aW9uLWFuZC1lY29ub21pYy1ncm93dGgtaW4tdmFuY291dmVyLTg5MzY3NTUwNi5odG1s0gEA?oc=5","id":"CBMilwFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWludmVzdHMtb3Zlci0yNS03LW1pbGxpb24tdG8tZnVlbC1pbm5vdmF0aW9uLWFuZC1lY29ub21pYy1ncm93dGgtaW4tdmFuY291dmVyLTg5MzY3NTUwNi5odG1s0gEA","guidislink":false,"published":"Mon, 20 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=79, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWludmVzdHMtb3Zlci0yNS03LW1pbGxpb24tdG8tZnVlbC1pbm5vdmF0aW9uLWFuZC1lY29ub21pYy1ncm93dGgtaW4tdmFuY291dmVyLTg5MzY3NTUwNi5odG1s0gEA?oc=5\" target=\"_blank\">Government of Canada invests over $25.7 million to fuel innovation and economic growth in Vancouver<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Government of Canada invests over $25.7 million to fuel innovation and economic growth in Vancouver - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWludmVzdHMtb3Zlci0yNS03LW1pbGxpb24tdG8tZnVlbC1pbm5vdmF0aW9uLWFuZC1lY29ub21pYy1ncm93dGgtaW4tdmFuY291dmVyLTg5MzY3NTUwNi5odG1s0gEA?oc=5\" target=\"_blank\">Government of Canada invests over $25.7 million to fuel innovation and economic growth in Vancouver<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Ten local businesses and organizations will receive funding to commercialize new technology, grow their operations, and reach new markets VANCOUVER, BC, March 20, 2023 \/CNW\/ - British Columbia has the people, ideas and resources to create an innovation ecosystem, generating local solutions with global impact. To support B.C.'s boldest and brightest changemakers, the Government of Canada is making strategic investments in local organizations that are catalysts for Canada-made innovation with a growing global demand. Government of Canada invests over $25.7 million to fuel innovation and economic growth in Vancouver (CNW Group\/Pacific Economic Development Canada) Today, the Honourable Harjit S. Sajjan, Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada (PacifiCan), announced an investment of over $25.7 million to help 10 Vancouver-based organizations fuel the B.C. economy, create jobs, and develop products that improve lives. This includes over $16.1 million for eight companies through the Business Scale-Up and Productivity program and over $9.6 million for two organizations through the Jobs and Growth Fund. Minister Sajjan made the announcement at Aspect Biosystems in Vancouver, where the biotechnology company is receiving over $3.6 million in Business Scale-Up and Productivity funding. This investment will help Aspect Biosystems develop the next generation of medical treatments by broadening the application of its bioprinting technology. Aspect's technology platform generates 3D bioprinted human tissues that restore or replace the function of damaged organs. For example, Aspect is using their technology to create insulin-producing pancreatic tissues to treat type 1 diabetes. PacifiCan funding will help the company expand its global network of partners and scale-up its manufacturing systems. Not only will this help to increase Aspect Biosystems' productivity, it will also support its goal of developing cures for currently incurable diseases. More details about the businesses and organizations receiving funding can be found in the backgrounder in the section below. In all, today's investments are expected to create over 500 jobs, over $500 million in revenue growth, and over $400 million in new global sales for B.C. businesses. The Government of Canada, through PacifiCan, supports innovation, business growth and community economic development in British Columbia. PacifiCan makes strategic investments in growing companies to strengthen B.C.'s position as a domestic and international leader in a variety of sectors, such as clean technology, life sciences and digital industries. Quotes \"British Columbia is fertile ground for companies to innovate and grow. To position our local talent for success, PacifiCan is investing in the ideas, businesses and people that will be key to the economy of the future. Today's investments are making innovation work for British Columbians by delivering high-paying jobs, unleashing new ideas, and helping Canadian-made products find global success.\" - The Honourable Harjit S. Sajjan, Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada \"Vancouver is home to talented minds and innovative organizations who are leading the way in life changing technology. Today's announcement is a testament to how our Government's commitment to creating high-paying jobs, investing in new ideas and supporting Canadian talent can accelerate growth and enable home-grown success\" - The Honourable Joyce Murray, Minister of Fisheries, Oceans and the Canadian Coast Guard, and Member of Parliament for Vancouver Quadra \"British Columbia's innovation and tenacity has lead to Vancouver Centre being home to some of the most diverse and rapidly growing businesses across various sectors. Today's announcement of over $25 million in PacifiCan funding will enable five Vancouver Centre businesses to scale up and bring Canadian innovation and technology around the world.\" - The Honourable Hedy Fry. P.C., Member of Parliament for Vancouver Centre \"This investment of over $25 million dollars, including to two local Vancouver Granville Businesses Tradable Bits Media and Arbutus Medical, will empower local companies to innovate, bring their products across North America, and bring more high quality jobs right here in Vancouver.\" - Taleeb Noormohamed, Member of Parliament for Vancouver Granville \"Canada has a rich history in regenerative medicine, and we are proud to be pioneering the next frontier of advanced living therapies from here in British Columbia. This support from the Government of Canada will help further our mission of developing bioprinted tissue therapeutics to transform how we treat disease.\" - Tamer Mohamed, Chief Executive Officer, Aspect Biosystems Quick Facts PacifiCan is the federal economic development agency dedicated to British Columbians. PacifiCan works with partners who are building innovative businesses, creating quality jobs, and supporting inclusive growth throughout our province. The Business Scale-up and Productivity program makes strategic investments in key economic sectors, helping innovative companies accelerate their growth and compete globally. The Jobs and Growth Fund helps job creators, and the organizations that support them, to future-proof their businesses. This includes building resiliency and growth by transitioning to a green economy, fostering an inclusive recovery, enhancing competitiveness and creating jobs across British Columbia . . Founded in 2013, Aspect Biosystems is a Vancouver -based biotechnology company that is transforming how diseases are treated. By combining its proprietary bioprinting technology, therapeutic cells, biomaterials, and computational design, Aspect is creating cutting-edge tissue therapeutics to treat incurable diseases. Associated Links: Stay connected Follow PacifiCan on Twitter and LinkedIn Toll-Free Number: 1-888-338-9378 TTY (telecommunications device for the hearing impaired): 1-877-303-3388 Backgrounder: Government of Canada invests over $25.7 million to fuel innovation and economic growth in Vancouver Today, the Honourable Harjit S. Sajjan, Minister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada (PacifiCan), announced an investment of over $25.7 million to help 10 Vancouver-based businesses and organizations fuel the B.C. economy, create jobs, and develop products that improve lives. This includes over $16.1 million for eight companies through the Business Scale-Up and Productivity program and over $9.6 million for two organizations through the Jobs and Growth Fund. The projects announced today include: Business Scale-Up and Productivity Program Arbutus Medical Inc. $400,000 Funding will help the recipient launch two new products and expand sales of its orthopedic power drill system to North American trauma centres. The regulatory-approved drill system allows orthopedic surgeons to use a hardware store power drill in sterile, medical environments, making it thirty times more cost-effective than its competitors. Aspect Biosystems Ltd. $3,677,430 Funding will help the recipient develop the next generation of medical treatments by broadening the application of its bioprinting technology, expand its global network of partners, and scale-up its manufacturing systems. Aspect’s technology platform generates 3D bioprinted human tissues that restore or replace the function of damaged organs. Augurex Life Sciences Corp. $473,500 Funding will help the recipient expand the market for its patented blood test, JOINTstat, and launch alternative testing formats such as remote sample collection. JOINTstat is currently used to detect rheumatoid arthritis, and funding will allow the company to explore applications for other autoimmune diseases such as Lupus and Sjogren's. Broadband TV Corp (BBTV) $5,000,000 Funding will be used to grow the recipient's digital marketing operations and expand its sales strategy by hiring new staff and implementing an Enterprise Resource Planning system. BBTV drives monetization opportunities for digital content creators, such as the NBA, Sony Pictures and Viacom, by providing comprehensive, end-to-end solutions to increase viewership and drive revenue powered by technology. Klue Labs Inc. $2,000,000 Funding will help the recipient scale-up its AI-driven competitive intelligence platform by expanding operational capacity, delivering a marketing plan to acquire new customers, and develop partnerships to increase market share. Klue's software enables companies to collect, curate, and distribute the information needed to close sales. MetaOptima Technology Inc. $2,031,250 Funding will enable the recipient, a digital health company, to expand export sales of its cloud and mobile software solutions for dermatology and skin care, specifically in the United States. Project activities include hiring team members, developing marketing and training material, and improving cloud services. The company's AI-driven platform enables affordable diagnostic solutions in dermatology, including much-needed telehealth services. PrecisionOS Technology Inc. $1,500,000 Funding will help the recipient grow its virtual reality medical training platform for adoption in global markets, by expanding operational capacity and implementing new tools to manage customer relationships and software subscriptions. The company's platform enables immersive virtual medical training for orthopedic surgeons, a cost-effective and accessible alternative to cadavers. TradableBits Media Inc. $1,020,000 Funding will help the recipient grow international sales of its software marketing platform which enables music, sports, and entertainment industry clients to collect, analyze, and activate fan data. Project activities include software development, expansion of sales and marketing activities, and new client trials in Europe and the Asia-Pacific. Jobs and Growth Fund Circle Innovation $4,692,000 Funding will enable the recipient to help a broad range of life sciences companies in British Columbia develop new technologies and expand services. Circle Innovation works with small- and medium-sized businesses to solve R&D challenges, grow revenues and create jobs. Project activities include hiring staff and contractors, hosting industry events, and developing skills training programs. CoPilot AI $5,000,000 Funding will help the recipient expand the market for its sales enablement software platform within the United States. The artificial intelligence software helps companies identify sales prospects and classify them by value and interest level, allowing them to effectively prioritize resources. SOURCE Pacific Economic Development Canada Haley Hodgson, Press Secretary, Office of the Minister of International Development and Minister Responsible for the Pacific Economic Development Agency of Canada, [email protected]; Amanda Costa Senior Communications Advisor, PacifiCan, [email protected]","filter_flag":1}
{"title":"New pavement charging solution launched - transportandenergy - Transport + Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzAzLzA5L2tlcmJvLWNoYXJnaW5nLWxhdW5jaC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzAzLzA5L2tlcmJvLWNoYXJnaW5nLWxhdW5jaC_SAQA?oc=5","id":"CBMiQGh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzAzLzA5L2tlcmJvLWNoYXJnaW5nLWxhdW5jaC_SAQA","guidislink":false,"published":"Thu, 09 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=68, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzAzLzA5L2tlcmJvLWNoYXJnaW5nLWxhdW5jaC_SAQA?oc=5\" target=\"_blank\">New pavement charging solution launched - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New pavement charging solution launched - transportandenergy - Transport + Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzAzLzA5L2tlcmJvLWNoYXJnaW5nLWxhdW5jaC_SAQA?oc=5\" target=\"_blank\">New pavement charging solution launched - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","source.href":"https:\/\/transportandenergy.com","source.title":"Transport + Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"UK startup Kerbo Charge has announced the roll-out of its self-closing cable channel for electric car owners. The product, which is aimed at domestic charging without driveways, solves the problem of how to charge an EV and could save users up to £1,439 a year compared to solely using fast public chargers – at present prices. The Kerbo Charge channel differs from other ‘cable channel’ products in three key ways, the company claim: The polymer channel includes a self-closing lid that snaps down shut as the cable is inserted and removed – eliminating the trip hazard. It’s been built to contour with the surface of the pavement so will sit flush. Its shallow form factor allows for fast installation by council engineers. There is a need for such products since 40% of the UK population do not have access to a driveway – meaning a current reliance on the public charging network. Milton Keynes is the first city to receive public installations of the new product with additional local authority partnerships planned for the rest of the UK, the firm said. Kerbo Charge co-founder Michael Goulden said: “We developed this product in partnership with local authorities – the critical design requirements are the ability to flex with uneven pavement surfaces, be easy to install and to be safe for all foot traffic. We also offer cashback incentives for customers who share their charge point with other members of their community.” Milton Keynes City Council Cabinet Member for Climate Action and Sustainability, Cllr Jennifer Wilson-Marklew, said: “This is a really innovative and exciting trial which could encourage people to make the switch to electric. We’re constantly looking for ways to both improve charging facilities and to give people the confidence that they will be able to charge their cars.” Share this: LinkedIn Twitter Facebook Email ","filter_flag":1}
{"title":"Hero MotoCorp Announces Collaboration With Zero Motorcycles To Develop New Electric Two-Wheelers - carandbike","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmNhcmFuZGJpa2UuY29tL25ld3MvaGVyby1tb3RvY29ycC1hbm5vdW5jZXMtY29sbGFib3JhdGlvbi13aXRoLXplcm8tbW90b3JjeWNsZXMtdG8tZGV2ZWxvcC1uZXctcHJvZHVjdHMtMzIwNjA2M9IBgQFodHRwczovL3d3dy5jYXJhbmRiaWtlLmNvbS9uZXdzL2hlcm8tbW90b2NvcnAtYW5ub3VuY2VzLWNvbGxhYm9yYXRpb24td2l0aC16ZXJvLW1vdG9yY3ljbGVzLXRvLWRldmVsb3AtbmV3LXByb2R1Y3RzLTMyMDYwNjM_YW1wPTE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmNhcmFuZGJpa2UuY29tL25ld3MvaGVyby1tb3RvY29ycC1hbm5vdW5jZXMtY29sbGFib3JhdGlvbi13aXRoLXplcm8tbW90b3JjeWNsZXMtdG8tZGV2ZWxvcC1uZXctcHJvZHVjdHMtMzIwNjA2M9IBgQFodHRwczovL3d3dy5jYXJhbmRiaWtlLmNvbS9uZXdzL2hlcm8tbW90b2NvcnAtYW5ub3VuY2VzLWNvbGxhYm9yYXRpb24td2l0aC16ZXJvLW1vdG9yY3ljbGVzLXRvLWRldmVsb3AtbmV3LXByb2R1Y3RzLTMyMDYwNjM_YW1wPTE?oc=5","id":"CBMie2h0dHBzOi8vd3d3LmNhcmFuZGJpa2UuY29tL25ld3MvaGVyby1tb3RvY29ycC1hbm5vdW5jZXMtY29sbGFib3JhdGlvbi13aXRoLXplcm8tbW90b3JjeWNsZXMtdG8tZGV2ZWxvcC1uZXctcHJvZHVjdHMtMzIwNjA2M9IBgQFodHRwczovL3d3dy5jYXJhbmRiaWtlLmNvbS9uZXdzL2hlcm8tbW90b2NvcnAtYW5ub3VuY2VzLWNvbGxhYm9yYXRpb24td2l0aC16ZXJvLW1vdG9yY3ljbGVzLXRvLWRldmVsb3AtbmV3LXByb2R1Y3RzLTMyMDYwNjM_YW1wPTE","guidislink":false,"published":"Mon, 06 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=65, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmNhcmFuZGJpa2UuY29tL25ld3MvaGVyby1tb3RvY29ycC1hbm5vdW5jZXMtY29sbGFib3JhdGlvbi13aXRoLXplcm8tbW90b3JjeWNsZXMtdG8tZGV2ZWxvcC1uZXctcHJvZHVjdHMtMzIwNjA2M9IBgQFodHRwczovL3d3dy5jYXJhbmRiaWtlLmNvbS9uZXdzL2hlcm8tbW90b2NvcnAtYW5ub3VuY2VzLWNvbGxhYm9yYXRpb24td2l0aC16ZXJvLW1vdG9yY3ljbGVzLXRvLWRldmVsb3AtbmV3LXByb2R1Y3RzLTMyMDYwNjM_YW1wPTE?oc=5\" target=\"_blank\">Hero MotoCorp Announces Collaboration With Zero Motorcycles To Develop New Electric Two-Wheelers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">carandbike<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hero MotoCorp Announces Collaboration With Zero Motorcycles To Develop New Electric Two-Wheelers - carandbike","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmNhcmFuZGJpa2UuY29tL25ld3MvaGVyby1tb3RvY29ycC1hbm5vdW5jZXMtY29sbGFib3JhdGlvbi13aXRoLXplcm8tbW90b3JjeWNsZXMtdG8tZGV2ZWxvcC1uZXctcHJvZHVjdHMtMzIwNjA2M9IBgQFodHRwczovL3d3dy5jYXJhbmRiaWtlLmNvbS9uZXdzL2hlcm8tbW90b2NvcnAtYW5ub3VuY2VzLWNvbGxhYm9yYXRpb24td2l0aC16ZXJvLW1vdG9yY3ljbGVzLXRvLWRldmVsb3AtbmV3LXByb2R1Y3RzLTMyMDYwNjM_YW1wPTE?oc=5\" target=\"_blank\">Hero MotoCorp Announces Collaboration With Zero Motorcycles To Develop New Electric Two-Wheelers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">carandbike<\/font>","source.href":"https:\/\/www.carandbike.com","source.title":"carandbike","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Hero MotoCorp has signed an agreement to partner with Zero Motorcycles to produce premium electric motorcycles. Zero motorcycles is a USA-based electric two-wheeler manufacturer whose product line up includes electric off-road bikes, electric adventure bikes, electric street bikes, supermoto and dual-sport bikes. The Indian brand had earlier invested $60 million dollars into Zero motorcycles as part of a $107 million round of financing that included other investors like Polaris and Exor. The partnership aims to make use of Zero’s expertise in developing powertrains and the manufacturing, sourcing, and marketing facilities of Hero MotoCorp. Zero Motorcycles is known for its range of high-quality premium electric motorcycles, which includes the Zero SR electric street bike pictured above. Pawan Munjal, Chairman & CEO, Hero MotoCorp, said “Our partnership with Zero Motorcycles is a significant milestone in our journey towards ushering in an era of sustainable clean technology in the mobility space. With Zero as our partner, we look forward to accelerate the transition of electric mobility in India and across our global markets.” The Indian brand had earlier invested 60 million dollars into Zero motorcycles as part of a financing round Commenting on the venture, Sam Paschel, CEO, Zero Motorcycles, said “We are delighted to have Hero MotoCorp – the world’s largest motorcycle maker – as our partner. Our companies are both committed to transforming the riding experience and bringing remarkable, innovative products to the world. With these shared passions, we look forward to delivering exceptional value, performance and fun for our customers.” The VIDA V1 Scooter Hero launched its first electric product in October, the V1 scooter under its emerging mobility brand VIDA, Powered by Hero. The company has also started operations of its public charging centres in in Bengaluru, Delhi and Jaipur. The company has set up 300 charging points, across the three cities.","filter_flag":1}
{"title":"Celebrating 50 inspiring Nigerian women 2023 - Businessday","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvbmV3cy9hcnRpY2xlL2NlbGVicmF0aW5nLTUwLWluc3BpcmluZy1uaWdlcmlhbi13b21lbi0yMDIzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvbmV3cy9hcnRpY2xlL2NlbGVicmF0aW5nLTUwLWluc3BpcmluZy1uaWdlcmlhbi13b21lbi0yMDIzL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvbmV3cy9hcnRpY2xlL2NlbGVicmF0aW5nLTUwLWluc3BpcmluZy1uaWdlcmlhbi13b21lbi0yMDIzL9IBAA","guidislink":false,"published":"Fri, 10 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=69, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvbmV3cy9hcnRpY2xlL2NlbGVicmF0aW5nLTUwLWluc3BpcmluZy1uaWdlcmlhbi13b21lbi0yMDIzL9IBAA?oc=5\" target=\"_blank\">Celebrating 50 inspiring Nigerian women 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Businessday<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Celebrating 50 inspiring Nigerian women 2023 - Businessday","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvbmV3cy9hcnRpY2xlL2NlbGVicmF0aW5nLTUwLWluc3BpcmluZy1uaWdlcmlhbi13b21lbi0yMDIzL9IBAA?oc=5\" target=\"_blank\">Celebrating 50 inspiring Nigerian women 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Businessday<\/font>","source.href":"https:\/\/businessday.ng","source.title":"Businessday","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Olori Atuwatse III Queen Consort of the Warri Kingdom Olori Aiyivieruewinoya ‘Ivie’ Emiko-Atuwatse, known as Olori Atuwatse III, Queen Consort of the Warri Kingdom, is a visionary with a heart for humanity, social enterprise, education, and capacity building for women and children. A qualified lawyer with an LLB from the London School of Economics, she was called to the Nigerian bar in 2010. She is a member of the CIARB Nigeria and has certifications from the Nigerian Chambers of Commerce and Chambers of Maritime. She has a strong entrepreneurial drive and has founded several businesses across industries. From the fashion label, Colour Couture, which she co-founded with a friend while at the university, to Breakfast in Bed, a first-of-its-kind breakfast delivery company in Lagos, Nigeria, which she established after graduation. She sits on the boards of the Wells Property Development Company, the Wells Carlton, and Wells Bakehouse, and is constantly on the lookout for opportunities to create value through enterprise. A dedicated philanthropist, she is the founder of Abba’s Jewels, a community of over 60 women who, together, raise funds to impact the community through outreaches, food drives, hospital, and prison visits. She also convened The Love Drive, a free yard sale that started in Lagos, Nigeria. As the President of RIG Africa, a prophetic training organisation, she trains people to hear God for themselves in ways that are practical and applicable to everyday life and work. Being a mother whose heart pants for the healing and revival of the Iwere people, Olori Atuwatse III has established programmes targeted at alleviating poverty, illiteracy, and infant mortality in the Warri Kingdom. The Captain Idahosa Wells Okunbo STEM and Innovation Lab is another initiative by the Queen Consort in partnership with CleverMinds Educational Foundation. Abimbola Onakomaiya MD\/CEO of Peakthrust Insurance Brokers Ltd Abimbola Onakomaiya is an insurance professional par excellence whose career spans underwriting, claims administration, business development, risk management and reinsurance. Abimbola’s career started as an Associate, Hill Samuel Life Investment Services, Wales, United Kingdom (1983) before relocating to Nigeria, joining NICON Insurance, the foremost insurance company in Nigeria, in 1987 and becoming the company’s first female fellow of the Chartered Insurance Institute London (FCII). Trailblazing for the ten-year service in Nicon Insurance, she honed her underwriting skills in special risks, marine, oil, energy and reinsurance classes of insurance. Her versatility, brilliance and in-depth knowledge of the Nigerian insurance market was tapped by Anderson Consulting (1997) with the unenviable responsibility to open the consulting world to the insurance industry and vis-versa, thus enhancing partnerships that have now spanned decades. Abimbola’s exit from her successful foray into the consulting ecosystem landed her a position as the Assistant General Manager (Operations) of a publicly quoted insurance company listed on the Nigerian Stock exchange, Unic Insurance Plc (1998), with a role that required her to formulate and execute strategic business plans to enhance statutory regulations and compliance. Another feather was again added to her cap with the position of AGM (Oil & Energy) enlarging her portfolio, a position she maintained till December 2002 before becoming the pioneer Managing Director\/CEO of Peakthrust Insurance Brokers Ltd from 2003 till date. Bimbo’s role as the MD\/CEO involves coordinating 5 branches nationwide, liaising with the Board of Directors and overseas technical partners, developing increased technical competence to ensure that Peakthrust remains one of the foremost insurance broking and financial services companies in the ecosystem. TAIRAT TIJANI Non-Executive Director, Sterling Bank Plc Tairat Tijani graduated from the Lancaster University with Honours in Accounting, Finance & Economics. She also graduated with a Distinction in MBA, International Business from the University of Birmingham. She is a member of the Association of Chartered Certified Accountants (ACCA) and the Institute of Chartered Secretaries & Administrators of Nigeria. Tijani has garnered significant experience as an operator in the capital market, participating in several landmark transactions which have contributed immensely towards the development of the Nigerian Capital Market. She was formerly the Head, Capital Markets Division of FBN Capital (a subsidiary of FBN Holdings Plc – formerly First Bank of Nigeria Plc) where she had oversight responsibility for deal origination and transaction execution. Tijani is a Non-Executive Director of Sterling Bank Plc, Central Securities Clearing System (CSCS) Plc and Rite Foods Limited. She has attended several trainings (both domestic and international) with a focus on leadership, corporate governance, building effective teams, capital structure and products, and anti-money laundering and counterfeit terrorism financing. FUNMI ADEWARA Founder\/CEO, Mobihealth International Funmi Adewara is a British-Nigerian Physician and Cambridge trained Bioscience multi award-winning entrepreneur and a globally recognised telehealth expert, with a background in Medicine, Pharmaceutical and business development. Mobihealth International is a multi-award-winning telemedicine and digital health service provider transforming the way patients receive care. Funmi is passionate about changing the poor narrative of healthcare in underserved communities and has led a multi-disciplinary team to design comprehensive telehealth program that addresses multiple challenges such as shortage of doctors, nurses and other healthcare professionals, long distance travel, and high treatment costs. Adewara contributes to policy formulation on healthcare and particularly around telehealth programs for Africa at both local and regional levels serving as an external reviewer to the Africa Development Bank, contributor to United Nations, World Health Summit and the Medical and Dental Council of Nigeria, MDCN. Adewara has earned herself and Mobihealth multiple awards globally. She was one of the seven winners of the World Bank SDGs & Her 2020 Awards amongst 2400 entries globally. Sanofi Africa-Tech Challenge (Winner, Category 2) which held virtually in Paris on the 11th of June 2020 amongst 268 contestants across 34 countries. Under Funmi’s visionary leadership, Mobihealth pioneered telehealth in the Nigerian Air Force in 2021, the 1st of its kind on the continent. Funmi led the strategic partnership deal of the Union Bank of Nigeria with Mobihealth to expansion services to it’s 6million customer base and to establish walk-in telehealth clinics across 300 branches nationwide. She is an international speaker featured on many platforms and is an external peer reviewer of the Global Community of Practice (G-COP) Policy Documents on Policies for Inclusive Health in Post COVID-19 Africa, and a speaker at the African Development Institute Policy Seminar on; Building Resilient Health Systems; Policies for Inclusive Health in Post-COVID-19 Africa sponsored by the African Development Bank, AfDB. Other awards for which Funmi has been recognised are the Prof Akinkugbe Ibadan College of Medicine Alumni Leadership Award, Zenith Global Health Award for advancing health with technology and the African Female Tech Founders (FTF) Award sponsored by the UK government amongst others. Funmi was invited by the Prime Minister, Boris Johnson Africa-UK investment summit in January 2020. She has featured as a panelist on Forbes Africa and Philips’ Africa Future Health Summit by CNBC, United Nations Committee on Science Technology and Innovation, African Development Bank, to mention a few. Adewara is recognised as one of the Most Influential People of African descent. Recently, in October 2022, under her leadership, Mobihealth was awarded a $1m grant by the United States Trade and Development Agency to extend telehealth services to other African countries. Lami Tumaka Chairman of Blue Economy Coordinating Group Lami Tumaka is a graduate of the renowned Ahmadu Bello University Zaria where she studied English with a bias for Literature. She also earned a Master of Business Administration (MBA) from the same University and holds a Certificate in Basic Film Production from the TV College Jos with Distinction. She has a Diploma in Public Relations from the prestigious Holborn College London. She has been a participant at many management and professional courses both locally and internationally. Lami Tumaka is a quintessential public relations professional, an astute administrator and a public speaker with over 30 years combined experience. Her excellent PR prowess and people skill shot her to the top of the Public Relations Department of the Peugeot Automobile Nigeria (PAN) Limited in 1990 as the PR Manager at a relatively young age. Lami Tumaka’s problem solving skill was again brought to the fore when she joined the services of the Nigerian Maritime Administration and Safety Agency (NIMASA) and was later appointed the Head of the Public Relations Unit. She was instrumental to the rebranding of the agency from a contract awarding organisation to a government agency with strategic mandates responsible for crystallising the development of the Nigerian maritime industry through critical partnerships with the United Nations Agencies like the International Maritime Organisation (IMO) and the International Labour Organisation (ILO). At NIMASA, she was Director Special Duties where she was responsible for handling external relations and coordinating technical cooperation activities. Lami Tumaka is a recipient of several outstanding awards and retired from the services of NIMASA as a director after 22 years of meritorious service. Her current vocations include mentoring young people and public speaking. She is the current and pioneer Chairman of Blue Economy Coordinating Group and she is a proud grandmother of three. AMINA RUTH SIJUWADE, ESQ Former Attorney-General and Commissioner for Justice in Kaduna state She is a lawyer and learned administrator with over 24 years working experience in both the public and private sector; a goal focused individual, a natural leader, effective team player with good interpersonal skills. As former Attorney-General and Commissioner for Justice in Kaduna state, she acted as the state’s Chief Law Officer, advising the government on all legal matters that affects the state, its ministries, departments, and agencies, prosecution of all criminal cases in the state, defending all civil matters involving the state, drafting of executive bills, contracts, MOUs, and vetting of same and also protection of citizens rights against abuse or violation. Some successes achieved while serving as Attorney-General include: chairing the Committee of Attorneys General of the 19 northern states which reviewed the Criminal Procedure Legislation by adopting the Administration of Criminal Justice Act. This has been passed by the State House of Assembly into Law in 2017. She improved case management in the Ministry, by successfully setting up a computerised case management system to monitor and track all case files in the Ministry. This was done with the support of the UK Department for International Development (DFID). She helped to review the guidelines for prisons decongestion to ease and made transparent the procedure for the prison decongestion exercise, she introduced skills acquisition programme for prison inmates in collaboration with the National Open University of Nigeria, and other partners in IT, tailoring, carpentry, and hair dressing. Amina reviewed the guidelines to ensure a fair, transparent, and equitable procedure for the recommendation of convicts to the Governor for his exercise of Prerogative of Mercy. Furthermore, Amina initiated the set up of 4 ‘No Sexual Assault’ referral centres in the three senatorial zones of the state to provide medical, psycho-social as well as legal services free of charge to survivors of sexual and gender based violence. On sub-ministerial appointments, she was Chairman – Committee of Attorneys-General of the Northern States of Nigeria, Member – Body of Benchers, Nigeria, Member – Legal Practitioners’ Disciplinary Committee, Nigeria, Chairman – Committee to set up KASTLEA, Kaduna State Transport Law Enforcement Authority, Chairman – Kaduna State Committee on the Proliferation of Small Arms and Light Weapons (Disarmament Committee). On charity work, till date, she is the coordinator, Abrahams Seed Foundation, a non-governmental organisation registered at the Corporate Affairs Commission in February 2008 and set up solely to provide care for homeless and abandoned children in the FCT. The goal is to help restore a sense of hope and purpose in their lives and help prepare them for independent life as equal citizens of our country. Ifeoluwa Dixon Senior Vice President and Portfolio Manager, FBNQuest Asset Management Ifeoluwa Dixon is the Senior Vice President and Portfolio Manager at FBNQuest Asset Management. FBNQuest Asset Management provides their clientele with first-rate investing options across all major traditional and alternative asset classes. As a fixed income portfolio manager and product specialist, Ifeoluwa consistently outperformed the benchmarks of the portfolios that she managed every quarter for over a decade. She managed fixed income portfolios with assets in excess of N250bn, direct client interface for 35 separately managed accounts, evaluation of economic data relevant to fixed income markets, and successfully created fixed income products to meet a variety of client investment goals. She has made presentations on fixed income strategy to individuals and groups to assist them make solid investment decisions, collaborated with other members of the investment committee to develop and implement core investment strategies, while reporting to the Managing Director and the Group Managing Director. As Vice President \/Portfolio Manager, FBN Capital Asset Management Limited, she structured various investment portfolios, including that of the company and private clients and worked hand-in-hand with other members of the Asset Management Group for the investment management of funds. Furthermore, she managed funds under management of N200bn in fixed income instruments and strategised to enhance portfolio returns. As Associate Investment Strategist and Portfolio Manager at FBN Capital Limited, she sourced and compiled financial and economic information, and analysed same with the aim of determining the strategic effects on financial markets. This basically involves transforming sourced data into useful and actionable information in a timely manner. Ifeoluwa also conducted fundamental investment and economic analysis of markets, analysed and wrote regular reports on the macro economy at large and fiscal and monetary implications on the equity, bond, money and other markets. Also, she worked with other members of the Asset Management team in top-down analysis for the investment management of funds, managed various investment portfolios, including that of the company and private clients, managed funds under management of N110bn in fixed income instruments and worked on bond indices. As Senior Investment Analyst and Portfolio Manager at Assur Asset Management Limited, she sourced and compiled financial and economic information, analysed same with the aim of determining the strategic effects on financial markets. This basically involves transforming sourced data (key fixed income securities and market indices) into useful and actionable information in a timely manner. Ifeoluwa also managed various investment portfolios. Monisola Adanijo MD\/Co-Founder, Naveen Healthcare & Naveen Technology Services Monisola is a medical doctor with over 13 years post fellowship experience as a cardiologist. Her broad experience as a cardiologist has enabled her to see first-hand the burden of cardiovascular diseases (CVDs) on global health especially in sub Saharan Africa. It has therefore been her mandate to drive preventive cardiology as a first line response to this burden. She is also a business leader, motivated by her desire to facilitate the rise of preventive cardiology in sub-Saharan Africa. She was the pioneer cardiologist for the first Tele-Electrocardiogram project in West Africa. She is also one of the co-founders of Naveen Healthcare, a fast-growing healthcare company which, through their medical collaboration service projects, enable hospitals to improve their workflow solutions to improve staff and equipment utilisation, increase productivity, quality of healthcare delivery and revenue. Adanijo is a Fellow, National Postgraduate Medical College of Nigeria and an international associate, American College of Cardiology. She was named as one of the 31 Rising Women in Africa, contributing to positive change, in 2021. She is also an educator and CME lecture provider. She makes health information easy to understand and teaches strategies so individuals can manage their risk factors and live a healthy life contributing to good health and well-being. CVDs are notorious for affecting professionals as a result of lifestyle and physical inactivity. Monisola therefore utilises her skills as a speaker and health workshop facilitator and cardiologist, to help professionals build physical resilience and make the right lifestyle choices. She strongly believes that mortality from cardiovascular disease can be reduced with screening, early detection as well as appropriate lifestyle and behavioural changes. That is why they collaborate with specialists to develop operational synergies in care transition and design health programs that impacts global community health practices. This is also in line with Naveen’s 10,000 heart project, aimed at screening 10,000 adult Nigerians (in the first instance) for the risk factors of cardiovascular disease, to reduce morbidity and mortality, which drives the United Nations SDG goals for health which says by 2030, to reduce by a third, premature mortality from non-communicable diseases through prevention and treatment. While at Federal Medical Centre Ebute Metta Lagos as a consultant cardiologist, she premiered in collaboration with the executive management team, the conceptualisation and the implementation of cardiovascular diagnostic department, presently used to drive the medical and organisational agenda of the medical centre, which facilitated significant improvement in patient care, reduction in mortality rate and hospitalisation of CVD patients. Also, she successfully optimised efficiencies across the department even during Covid-19 times, by defining performance metrics, setting up efficient patient appointment system, conducting evaluative tracking, monitoring progress, and reporting on results which has resulted in reduction of physician burnout and improved clinic efficiency. Mokutima Ajileye Managing Director at Procter & Gamble Nigeria Mokutima Ajileye is the Managing Director at Procter & Gamble Nigeria. She is the first female and first Nigerian in the history of the organisation to lead in Nigeria. As Managing Director, she is responsible for the entire Nigeria business with cross-functional responsibilities that includes delivering the operating TSR metrics of turnover, profit, cash, market share, establishing and sustaining right governance structure to ensure a sustainable business, leading productivity projects to deliver on cash targets and supply chain optimisation. Others include go-to-market responsibilities to deliver on sales targets including distributor operations, external stakeholder engagement (government and regulatory bodies) to enable seamless business operations and developing a world-class organisation, including talent development and career planning for all Nigeria employees. Ajileye is a highly experienced marketing and business leader with 18 years of vast accomplishments growing businesses based on astute strategic planning and problem-solving competencies. She has built brands across developing and developed regions (India, Middle East, Africa, and Europe), developed disruptive forms in mature product categories, and led world-class teams. Mokutima has consistently delivered revenue, profit, and market share growth while developing capabilities and talents within the organisation. She has an entrepreneurial mind-set, and is comfortable with ambiguity, which has enabled her to take on start-up roles and build the organisation from scratch. For Mokutima, there are three key pillars that has kept P&G, and she says the first is the people, because people are the bedrock of what they do, the second is innovation because at P&G, innovation is their lifeblood, since it keeps them going as a company. The third are their citizenship programmes. On local employee inclusion, she stated that “We have moved from 60-40 split of expert and locals to 100 percent local employees, and a 50-50 split at the managerial level.” She said. On their ‘Always Keeping Girls in School’ programme, Ajileye revealed that it commenced in 2009, and its core pillars includes education, where they educate both boys and girls. There is also the provision of training materials for school counselors who the girls can go to if they have questions. The third pillar she says is access, because at the end of the day, after the education, the children need to stay in school during their period days, so they give one year supply of sanitary pads to schools that P&G has the programme with every year. They do this because some girls miss school because they do not have sanitary protection. “The statistics is daunting. We do this to end period poverty. It is beyond being a CSR but should be a strategic imperative for organisations and communities, it actually develops the communities and organisation too”. Mokutima stated. Ndidi Nnoli-Edozien (PhD) Chairperson & Founder, Growing Business Foundation Ndidi Nnoli-Edozien is an angel investor who has dedicated a major part of her life to building entrepreneurs and helping thousands of people at the bottom of the economic pyramid (BOP) in Nigeria live better lives. She is the Chairperson and Founder, Growing Businesses Foundation. The foundation combats poverty by enabling enterprise amongst the poorest people in Nigeria. They are a professional and dependable development intermediary, and a strong advocate for sustainable economic development serving those at the bottom of the economic pyramid. Their vision is being a sustainable economic development led by socially responsible businesses and individuals. Her passion for economic, social and business development in Africa led her to start up Growing Businesses Foundation (GBF) almost 2 decades ago. With hard work, successful partnerships and teamwork, she has led the team at GBF to impact thousands of people at the BOP by collaborating with the public and private sector on multiple economic empowerment projects across Nigeria worth over N1billion. Ndidi’s belief and passion for African entrepreneurship is unrelenting. To this effect, she collaborated with a group of seasoned women investors and entrepreneurs to co-found Rising Tide Africa (RTA) in 2016. RTA has invested and nurtured women entrepreneurs in Africa. She also started Growing Businesses Capital which focuses on early-stage investment. Her works in social entrepreneurship have been recognised by Bertelsmann AG, Germany. She is an alumnus of the Wharton Business School. She holds a B.Sc. (Economics), with a Major in International Relations from the London School of Economics (LSE) and a PhD from Johann Wolfgang Goethe University Frankfurt, Germany. Ndidi sits on the board of ABN Microfinance Bank, Interswitch Inclusion, Sahara Foundation, ICT for Youth and ANAP Foundation. She is also an advisory board member of the Nigerian Private Sector Advisory Group (PSAG), which stemmed from the Global PSAG – UN SDG-Fund. She has served on various private sector-led presidential committees and supported worthy initiatives like the NESG. She has spoken at conferences worldwide and has published books in Nigerian and German on corporate governance, sustainability and Igbology. Ndidi Nnoli-Edozien joined the International Sustainability Standards Board of the IFRS Foundation in July 2022. The IFRS Foundation is a not-for-profit, public interest organisation established to develop high-quality, understandable, enforceable and globally accepted accounting and sustainability disclosure standards. She has lectured at the Lagos Business School\/Pan-Atlantic University, with responsibility for sustainability, public-private partnerships, ethics and social entrepreneurship. Her international roles include membership of the Club of Rome and founding President of the ToroNet Association. She started her career at First Securities Discount House (FSDH), and subsequently served as Vice-President, SecTrust (Afrinvest) Asset Management Division. Kelechi Okoro Founder\/Executive Director, Heal for Africa Initiative Kelechi Okoro is a multi-talented, multi-award winning and versatile medical doctor with an impeccable track record in civic and entrepreneurial activities. She is a Sustainable Development Goals advocate, with a focus on SDG 3: Good health and wellbeing and SDG 4: Quality education and SDG 5: Gender equality. She is the convener of “Pay Attention to Her (PATH) project which focuses on menstrual, sexual and reproductive health for women and girls especially in the underserved communities. PATH is a project of Heal for Africa initiative, (HFAI) a Non-Governmental Organisation committed to transforming Africa one community at a time. Other projects by HFAI include ‘SDGs Tutor’ to accelerate knowledge about the Sustainable Development Goals. The ‘PATH Rural Woman’ programme focuses on empowering women in the rural areas to improve their social, economic and health status thereby eliminating poverty, discrimination, illiteracy, and ill health. Activities captured under this exercise include reproductive health education (family planning and prevention of female cancers, menopause) and skill acquisition training. There is also the ‘PATH School Girl’ programme which is themed #TheEmpoweredGirlChild, focusing on menstrual hygiene education and enlightening the girl child about her role as a human resource tool in nation building. Through this program, they are nurturing the girl child to be healthy, self-aware, more confident and more equipped to thrive in a repressive society. Then there is “Heal The Slums” The #HealTheSlums project is geared towards impacting the lives of the poor, needy and hard to reach population with programmes centered around health education and medical outreaches. People living in the slums are denied basic rights such as good food, healthcare, shelter and portable water which makes life unpleasant for them. This project is dedicated to these group of people to give them a sense of belonging to the society and by so doing, renewing their hope for a better tomorrow. Through her ‘Healthertainer’ brand, she has recorded massive successes in effective health communications, reaching millions across various social media platforms, thereby increasing health literacy and influencing Nigerians and beyond to make healthier decisions. She has worked with notable international brands such as MTN, TECNO, Three Crowns, Arla Dano, LeadWay Insurance, Dettol, GSK, Roche Diagnostics, Ariel, to mention a few. She also founded “Health Hub Africa” that houses top health influencers, innovators, start-ups founders, and many other outliers in Africa, collaborating and creating in innovative solutions in the health sector. She is a global goodwill ambassador for health and social development for Nigeria. Outside the hospital and civic space, she also does public speaking, compering corporate events and volunteering with other non-profit organisations to propagate other worthy causes. Blessing Omakwu Head of Goalkeepers, Bill & Melinda Gates Foundation Blessing Omakwu is a Nigerian-American women’s equality advocate, strategist and writer. She is also the founder of The She Tank: a modern think-tank supporting the realisation of equality for women of African descent. In 2017, Blessing was recognised as one of the top 50 emerging global policy leaders by the British Council. In 2019, Blessing served as the Co-Curator of Melinda Gate’s session on gender bias at Goalkeepers New York City. She is currently a deputy director at the Gates Foundation, where she leads Goalkeepers: an initiative to accelerate progress on the sustainable development goals. A lawyer turned policy wonk, Blessing has been researching and working on human rights and women’s equality issues the past decade. Her career has been dedicated to the public sector, and she has worked and consulted for various government agencies and international organisations including the United Nations and the Nigerian Federal House of Representatives. In her role as executive director of a faith-based foundation, Blessing brokered a partnership with the office of the First Lady of South Sudan and coordinated on the ground post-conflict humanitarian relief in the country. Between 2016-2017, she served pro bono on the Victory Counsel (legal) team for Hillary Clinton’s presidential campaign. As the Special Advisor to the Executive Director of Global Policy at the ONE Campaign, Blessing advised a global gender campaign that centered around African female activists, and led to the creation of a docu-series. She also served as Co-Chair of ONE and RED’s global staff advisory group on equity, diversity and inclusion. Blessing previously led the design of a learning strategy related to religion and gender for the foundation as part of its gender equality special initiative. A wearer of many hats, Blessing has been a participant of the 17 Rooms Initiative (a project by the Rockefeller Foundation and Brookings Institute) since 2018, and a co-lead of “Room 5” (for SDG 5) since 2019. Between 2021-2022, she is curating Room 5 around a simple question: How can faith actors be catalysed to advance gender equality? Blessing has been invited to speak and moderate panels in cities around the world like Abuja, Johannesburg, London and New York; and delivered the keynote address at Cargill’s HQ for its 2019 International Women’s Day event (livestreamed by 100,000+ Cargill employees around the world). Blessing graduated summa cum laude from Oral Roberts University with a B.A in Government and International Relations and earned her Juris Doctor degree from the George Washington University Law School. She is a recipient of the 2012 USA National Association of Women Lawyers Outstanding Law Graduate award, and a member of the New York Bar. She has also completed executive education on Public Policy, Design Thinking and Leadership at Cambridge University. Stella Kalanne Fubara Regional Director of International Operations, Dubai Department of Economy & Tourism (DET) Stella Kalanne Fubara is a Regional Director of International operations with the Dubai Department of Economy & Tourism (DET), a position she has held since July 2015; DET is the principal authority for the planning, supervision, development, and marketing of Dubai’s economy and tourism sectors. Stella oversees the Tourism & Marketing activities for the Government of Dubai in all Sub-Saharan African countries, specifically focusing on Nigeria, South Africa, Ethiopia, Ghana, Kenya, Uganda, Tanzania, Zimbabwe, Rwanda, and Zambia. An accomplished leader in business and finance management, Stella has over two decades of impressive executive management. She is responsible for the operations of Dubai Tourism in Africa in line with the ultimate vision of positioning Dubai as the world’s leading tourism destination and commercial hub. Stella began her Professional career in 1999 as Financial Portfolio Manager at a global company, Owens Corning USA. In 2001 she moved on to become Senior Project Controller at Deloitte & Touche, where she set an excellent standard for using tools and project management techniques for Deloitte projects on the East coast. In 2003 she moved to Florida to take on the role of Project Finance Manager at Walt Disney World in Orlando, one of the most visited vacation resorts and entertainment complexes in the world. She eventually assumed the Division Finance Manager position for the parks Costume & Cosmetology division. Stella demonstrates effective management capabilities in finance, forecasting, marketing strategy, product\/business development, and policy formulation. She also exhibits excellent leadership delivered in an efficient training team-building spirit. Stella obtained a B.Sc in Business Management from Franklin University Columbus, Ohio, and a Master’s in Business Administration (MBA) in Finance & International Marketing. BINTA MAX-GBINIJE Chief Executive of BMG Seven Limited Binta is an experienced financial services executive and a management consultant with a demonstrated practical knowledge of the financial services value chain. She holds over 31 years of experience in strategic leadership, wholesale and retail banking, wealth and fiduciary management, treasury marketing, asset management and is the Chief Executive of BMG Seven Limited, a boutique consulting firm. A professional with a notable knack for starting and establishing thriving new businesses, she was the pioneer Chief Executive for Stanbic IBTC Trustees Limited where she led the team for about 8 years to establish a business that remains a market leader today. She was at various times pioneer Head of Expert Banking, Head – Commercial Banking & Public Sector Group Nigeria at Stanbic IBTC Bank Plc, Pioneer Head of Wealth Management in FBN Capital Limited, and Head of Treasury Marketing in then MBC International Bank. An astute board member, she also sits on boards of social impact organisations which enables her deliver on her interest in female development. She was an Executive Council Member of Women in Business, Management & Public Service (WIMBIZ) where she currently chairs the Membership & Programs Committee for the second time, was the Chairperson Stanbic IBTC Blue Women Network, Vice President of The Association of Corporate Trustees Nigeria and was voted in 2018 as one of Nigeria’s 100 Most Inspiring Women. She has also received various awards and recognitions by different organisations and bodies with the most recent being “The Most Inspiring Leaders Award” conferred by Ladies Breaking Boundaries. She was until recently an Independent Director on the Board of Access Pension Fund Custodian (a member of the Access Bank Group) where she was the Chairman of the Board Risk Management & Compliance Committee and a member of the Board Audit Committee; She was just appointed to the Board of ChamsMobile (Chams PLC), sits on the advisory board of Excel Energy Systems, is a Director on the board of the Goldcrest Family Centre, an NGO and also sits on the International board of The Institute of Business Transformation Africa (IBT Africa). A member of The Risk Management Association of Nigeria (RIMAN), she is also a member of the Institute of Directors (IoD) a WIMBOARD Fellow, a HCIB of the Chartered Institute of Bankers Nigeria (CIBN) and a Fellow of the Association of Investment Advisers & Portfolio Managers (IAPM). Binta has attended various Ivy League Business schools for Executive & Leadership education which include Harvard, INSEAD, Wharton, Kellogg Business School and the Yale School of Management. She is a MANDEV Certified Management Trainer and a frequent conference speaker on the topics of Financial literacy & inclusion, Faith and Women empowerment. Chienye Ogwo Founder, Red Toolkit Leveraging over twenty-years’ experience in for-profit and non-profit enterprise, Chienye Ogwo brings premium cross-sectoral understanding and expertise to designing solutions for Red Toolkit’s clients. Her experience spans organisational transformation, strategic communication, change management, sustainability and legal practice across development, banking, capital markets, telecommunications and international broadcast news. Chienye was Chief Executive Officer of Africa Initiative for Governance, a private, non-profit foundation established with the mission to be a catalyst for public sector transformation in Africa. She achieved significant quantitative and qualitative improvement in company programmes, achieved growth in awareness of public service as viable career for young talent, grew awareness and reach of scholarships programme, recording 720% increase in applications in first year of hire, with additional 84% increase in second year and significant improvement in quality and calibre of finalists recorded. Having successfully led the transition of the company from early-stage to full operations, Chienye was key to the design of a refreshed five-year strategy and operating model to guide the organisation’s future. In her role, she successfully coordinated efforts in the development of a three-year strategy for the transformation of Nigeria’s Federal Civil Service. She also served as Lead of the Measuring Performance Thematic Group of the Governance and Institutions Policy Commission of the Nigerian Economic Summit Group. In the financial services sector, Chienye served as Head of Change Management for the transformation of Nigeria’s second oldest bank, Union Bank, with responsibility for developing strategies for managing inevitable transformational disruptions in structure and technology, and for transitioning internal and external stakeholders from their current to the desired state. As Head of Corporate Social Responsibility\/Corporate Citizenship, she successfully ushered in a shift from reactive charity towards more intentional and sustainable giving, developing a corporate social responsibility strategy for the bank, aligned with its overall business strategy. Chienye has a master’s degree in Journalism from the Columbia University Graduate School of Journalism, a Law degree from the University of Lagos and a Barrister-at-Law qualification from the Nigerian Law School. She has completed executive education courses at the Harvard Business School, the Wharton School of the University of Pennsylvania and the Lagos Business School. A strong advocate for education and women empowerment, Chienye has served as volunteer for development and advocacy groups in several capacities, including mentor, teacher and speaker. She is the immediate past president of the Columbia Alumni Association of Nigeria. Onyeche Tifase Vice President, Grid Consulting, Siemens Energy Onyeche Tifase is an experienced engineering professional with extensive experience in the power and consulting industries. She graduated with a degree in Electrical & Electronics Engineering from the University of Nottingham and completed her master’s degree in electrical engineering from the University of Cambridge. She started her career with Siemens in 2001 as an Electrical Engineer in the Power Distribution Division of Siemens Plc UK. She progressed up the ranks, taking up other roles in Siemens Germany and Siemens USA. Onyeche worked with Accenture Nigeria from 2006 in management consulting and, in 2009, returned to Siemens as Deputy General Manager, Medium Voltage & Transformers for Siemens Ltd. Nigeria. Onyeche’s career path and achievements led to her appointment as the first Nigerian Managing Director and Chief Executive Officer of Siemens Nigeria, from November 2014 to October 2020. During this period, she was instrumental in developing the Nigeria Electrification Roadmap and the signing of an MOU between Siemens and the Nigerian government for implementation of the Presidential Power Initiative. From 2020 to 2022, Onyeche served as VP Strategy, Technology & Innovation for Siemens Energy Industrial Applications Division in Germany. She subsequently took on a new role from October 2022 and today leads the global Siemens Energy Grid Consulting business based in Erlangen, Germany. Onyeche is an advocate of local content and youth development and is married with 3 children. Diane Okoko Chairman of MO Group of Companies Diane is a Notary Public of Nigeria, the Chairman of MO Group of Companies and the Founding Partner of Marcus-Okoko & Co., a law firm based in Nigeria, with offices in Abuja and Johannesburg, South Africa. A seasoned Legal Adviser and Company Secretary to several boards and governing councils, multinational companies, government agencies and parastatals, Diane has expertise in arbitration, capital markets, legal and regulatory compliance, and is a corporate governance practitioner and facilitator. She possesses vast expertise in corporate and company law and practice, having garnered extensive knowledge and experience in these areas of practice over the years through her participation in several transactions bordering on these areas across Nigeria, West and East Africa, the United States and the United Kingdom. She is a Fellow and an approved faculty member of the Chartered Institute of Arbitrators (UK) Nigeria Branch, as well as a Fellow of the Institute of Construction Industry Arbitrators, a corporate governance practitioner and facilitator. She is a registered Capital Market Solicitor, a member of the National Prosecution Coordination Committee (NPCC) and a member of the Lagos Court of Arbitration Panel of Neutrals. She is also on the Panel of Neutrals of the Nigerian Communications Commission (NCC), the Dispute Resolution Centre of the Abuja Chamber of Commerce and Industry (ACCI DRC), the Cairo Regional Centre for International Commercial Arbitration (CRCICA), the Federal High Court Dispute Resolution Centre as well as the Abuja Multi-Door Courthouse (AMDC). She sits on a number of Boards and Governing Councils inclusive of Moneta Technologies Limited, Successory Nigeria Limited (until mid 2022), the Governing Council of Janada International Centre for Arbitration and Mediation (JICAM) and a Council Member of the Nigerian-Turkish Business Council Solape Akinpelu Co-Founder\/CEO at HerVest Solape Akinpelu is a certified financial education instructor and a member of the Personal Finance Speakers Association (USA). Solape is Founder, HerVest, a women-focused and inclusive fintech platform for the underserved and excluded women in Africa. HerVest enables women to participate in savings, impact-investments and credit, credit particularly for small holder women farmers in Nigeria. By addressing Africa’s $42bn gender funding gap with over 36% trapped in agriculture, HerVest provides growth opportunities for specific crops, grain banks, livestock, and digitised e-extension services for female small farmers in rural places. Their cooperative members enjoy substantial returns on investment while strengthening the financial capacity of women farmers through access to capital, training and markets. HerVest savings are placed with VFD Microfinance Bank and the bank is regulated by the CBN. HerVest’s women agro finance is to strengthen the capacity of urban and peri-urban women in making decisive impact investments particularly in female small-scale farmers, while also strengthening female small-scale farmers who mostly lack access to capital and market. As a financial feminist, Solape is pro SDG5 and SDG10 who believes in achieving gender equality and reducing inequality through financial literacy, technology and access to capital. For over 12 years, Solape has worked on Nigerian’s top financial brands including Skye Bank, Sterling Bank, Wema Bank, Leadway Assurance, and FCMB before moving to the client-side of communications at Meristem, a leading investment firm, as the head of corporate and marketing communications. Solape is the NIGERIAN chapter director of Women in Tech®, an international organisation with a double mission: to close the gender gap and to help women embrace technology. As former Head of Marketing and Corporate Communications at Meristem Nigeria, she led the brand & marketing communications’ team to tell their stories through integrated marketing strategies for brand love. She ensured an upward climb of the brand’s visibility through messages that are clear and forward in their chosen markets. They cover varying 5 wholly independent subsidiaries in the group creating a beautiful symphony for their most treasured stakeholders. Solape is fiercely pro-women. She believes in the women agenda towards building resilient and sustainable communities globally. She is also a member of the Chartered Institute of Marketing (UK). She has attended impactful executive programs at prestigious institutions including Lagos Business School and INSEAD, France. Afie Braimoh Hon. Commissioner, Ministry of Industry, Trade & Cooperatives, Edo state Afie is an accomplished program manager with over 20 years’ experience and a proven track record in project planning, change management and quality assurance across various sectors in Europe, US and Africa in finance, energy, technology, hospitality, agro-business and media, as well as developing and implementing project management office and shared services in organisations. As cyber security project manager at Strategic Solutions, she managed multiple cyber security projects following a merger. Work included managing virtual teams across continents including Asia, Africa, Europe, Australia, Latin America and US. Projects included the deployment of cloud based tools including proofpoint, zscaler, sumologic, cylance & crowdstrike, and also integrating cyberark into the various locations to improve the security controls across multiple businesses. As former project director for Africa International Film Festival (AFRIFF), once a year in the month of November, Braimoh consulted for and facilitated AFRIFF, one of the most popular annual film festivals in Africa, that is held for 7 fun filled and educational days in West Africa. The Africa International Film Festival deliberately commits to the ideals of empowerment and creative engagement. AFRIFF’s vision is to raise awareness about African Cinema, its vast potentials and the tremendous socio-economic impact it has, not only on African economies, but other third world and developing economies as well. As the former Planning Team Lead for GSK in the UK, Afie worked on the joint venture partnership programme between GSK and Novartis, which involved the combining of the over-the counter (OTC) units and to help transition all the relevant supply chain systems, processes and activities into the newly formed corporation (GSK Consumer Health), so as to achieve synergies in the form of increased revenues. She also worked on the M-ERP programme which was an integral component of the overall GSK ERP strategy, to simplify the business operating model, replacing multiple ERP systems with a single core SAP template. As a former Senior Project Director for Chase, Wilmington, over the period of 5 years, she managed major technology projects across the organisation from First USA Bank to Bank One and then the merger with Chase. Braimoh managed the successful integration of the network across JP Morgan Chase in support of the successful merger with Bank One. She also managed the design, conversion and implementation of a PBX system from Nortel to Avaya, whilst converting 3000+ users from the meridian to the Avaya phone and voicemail system. Successful completion resulted in immediate savings of $1.2m in the first year and $610,000 in subsequent years. Elile Olutimayin MD\/CEO CardinalStone Securities Ltd Elile Olutimayin, is the MD\/CEO of CardinalStone Securities Limited CardinalStone Securities Limited (CSSL) is a wholly owned securities trading subsidiary of CardinalStone Partners Limited that offers a bouquet of investment services to its clients. CSSL is a full-fledged dealing member of the Nigerian Stock Exchange (NSE) and registered with the Nigerian Securities and Exchange Commission (SEC) as a broker\/dealer. They are also registered with FMDQ OTC Securities Exchange as a dealing member and the NASD OTC Securities Exchange as a participating institution. They service a diverse base of local and international clientele, providing them access to equities, fixed income and international currency products to meet their investment objectives. Prior to being MD\/CEO of CardinalStone Securities Limited, Elile was the Head of Equities Trading desk at CardinalStone, where she was responsible for leading the equities trading team. Prior to CardinalStone, Olutimayin worked with Investment One Financial Services Limited (formerly known as GTB Asset Management Limited) and Kakawa Asset Management Limited. She has over a decade experience having worked in varying capacity and roles – equities trading, investment (Funds) management, credit management and sales. As MD\/CEO of CardinalStone Securities Ltd, she spearheaded strategy formulation, collaborations and implemented new market deepening plans across product lines and key market coverage which includes North America, Europe, Middle East and South Africa, resulting in 450% growth in revenue and 40% ROE. Furthermore, she took the securities trading firm from a relatively new market entrant with less than 1% market share to a top 5 firm with over 5% market share in less than 4 years. She also led successful completion of capital raising drive with a cumulative sum of over N100 billion (c.US$ 300m) As portfolio manager and equities trader at Investment One Financial Services, she outperformed set benchmarks while managing investments in excess of $35 million for two mutual funds namely, Vantage Guaranteed Income Fund (VGIF) and the Nigerian International Growth Fund (NIGFUND), as well as separately managed portfolios. Elile was also former Chairperson, Annual Conference Planning Committee, for Chartered Institute of Stockbrokers, where she was a major contributor to the success of the largest gathering of Nigeria’s capital market experts, where policies that support economic growth are conceptualised, shaped and influenced. Elile Olutimayin holds a B.Sc. in Mathematics & Economics from the University of Benin, Edo State, and she is an associate member of the Chartered Institute of Stockbrokers (CIS) and an Authorised Dealing Clerk of the Nigerian Stock Exchange (NSE). Ronke Sokefun Board Chairman of the Nigerian Deposit Insurance Corporation Ronke Sokefun currently serves as the Board Chairman of the Nigerian Deposit Insurance Corporation, a position she assumed in 2019. The NDIC -Nigeria Deposit Insurance Corporation, is an independent agency of the Federal Government of Nigeria. The purpose of the deposit insurance system is to protect depositors and guarantee the settlement of insured funds when a deposit-taking financial institution can no longer repay their deposits, thereby helping to maintain financial system stability. In her capacity as Chairman, she has continued to bolster the organisation’s reputation as a critical player in the Nigerian financial sector with collaborative agreements geared towards achieving global industry standards. Prior to joining the Corporation as Board Chairman, She served in the Ogun State Government as Commissioner of Agriculture and later Commissioner for Urban and Physical Planning, providing strategic leadership and overseeing seamless execution of government policy from 2012 to 2019. Her involvement in governance was kick-started in 2011 when she served as the Special Adviser\/ Director – General Bureau of Lands & Survey from 2011 to 2012. Before her foray into public service, she gained extensive experience in the private sector, rising through the ranks of her profession as a trained lawyer. Between 1990 and 1993, she worked in Ighodalo & Associates, a Company Secretarial firm. While there, she qualified as a member of the Institute of Chartered Secretaries & Administrators and later moved on to become a partner at Aluko & Oyebode; a prestigious Nigerian law firm in 2001. Her practice focus was business advisory services and she worked with several blue-chip companies in this regard. Armed with extensive experience and industry expertise, she went on to become Head, Management Services of Ocean & Oil Services in 2002, and Head, Legal Services of the Oando Group when it was formed in 2004, rising to the position of Group Chief Legal Officer of the Group in 2007, a position she held until 2011 when she heeded the call of public service. Several organisations have benefited from her expertise with a notable mention being the Vmobile (now Airtel) board where she served on the Legal, Regulatory and Finance subcommittee as an alternate director. As part of her commitment to giving back to society, she has an NGO known as the “M.R.S. Foundation”. The Foundation is focused on social intervention programmes to augment government efforts. Sokefun is a fellow of the Institute of Directors, a member of the Institute of Chartered Secretaries & Administrators, the Nigerian Bar Association, the International Bar Association, and the Association of International Petroleum Negotiators. She is also a member of the Institute of Directors, Nigerian Bar Association and International Bar Association. She graduated with honours from the Faculty of Law, Ogun State University (now Olabisi Onabanjo University) as the best student in Jurisprudence & Legal Theory and Commercial Law. Halima Ibrahim Abba Associate Vice President\/SA to the CIO at the Africa Finance Corporation Halima is an award-winning professional with 13+ years experience in development, investments & finance, legal, HR, operations, strategy and policy development across public, private and non-profit. She is an investor, executive and non-executive director, mentor, consultant and advisor. Ibrahim Abba is an Associate Vice President at the Africa Finance Corporation (AFC), a pan African US$8.7bn multilateral development finance institution focused on infrastructure and industrialisation. She has led, closed and portfolio managed US$2bn+ landmark award winning high impact transactions across power, industry, transport and logistics including ARISE Group and M&A on power assets across 5 countries. In her position as a transformation associate at AFC, the role resulted from the need for transformational strategic initiatives to be implemented to enable AFC achieve its US$10bn target, and be the leading infrastructure solutions provider in 5 years. She coordinates all investment team’s initiatives. Furthermore, she led the structuring, launch and operationalisation of the Infrastructure Corporation of Nigeria, working with the promoters – AFC, Central Bank of Nigeria and Nigerian Sovereign Investment Authority. She has worked in global investment banks, multi-lateral financial institutions and public sector including Goldman Sachs, Nomura, JP Morgan and Bureau of Public Enterprises. Halima is the Chair of a leading pan-African education, employability and entrepreneurship organisation called Skills Outside School Foundation, leveraging on data, advocacy and interventions, with 150+ partners and 50,000+ beneficiaries. She is an advisor, director and consultant on strategy, business development, finance, legal and governance, organisational planning and talent management to SMEs including Tongston Group, Cainergy & Tocam Capital. Halima is the MD of PIF Africa, focused on people and processes, infrastructure and industry, and finance and funding. She is a Guidepoint Global Advisor. Halima is also a mentor for Sponsors for Educational Opportunity Africa, Opportunity Desk, Tony Elumelu Foundation, SOSF and Women in Africa. She is an investor across financial services, education, oil & gas, technology and agriculture. She holds a First Class degree in Law from Kings College London and a Master’s in Philosophy in Development Studies from Cambridge University. She is an alum of Harvard Business School, Yale School of Management, Common Purpose Leadership Program, International Finance Faculty, AMT Training and Euromoney. Ibrahim Abba is a member of the Institute of Directors UK, the BoardRoom Africa, Women on Boards UK, Young Directors Forum (IODnig), European Mentoring and Coaching Council, Young CEO Club (ACCI) and International Institute of Directors and Managers. Her interests are in joining corporate\/NGO\/public sector statutory\/advisory boards, providing consulting, investment and advisory services to MSMEs, guest lectureship and speaking opportunities. Oluwatobi Boshoro CEO\/Partner, Strategy & Digital Transformation at Infintetiks Limited Oluwatobi Boshoro is an executive business leader with over 20 years of experience in crafting the requisite strategic vision to achieve business goals. She offers a rich blend of executive acumen, global team leadership, market centric product direction and revenue strategy, credited with strong ROI, operational improvements, and profitability. Oluwatobi is a fintech expert, digital payment professional, growth expert who is also passionate about empowering women. She approaches each new business challenge with intrinsic flair for innovation, creative problem-solving and measured risk taking to drive consistent growth and bottom line improvements. She has leveraged these strategies to steer digital strategy and transformation, e-Business and digital payments, emerging payments, digital channels, cards and payment tokens, business transformation, sales and marketing, brand management, new product launches and product line redesigns in complex digital businesses and Fintech firms, while overseeing up to 500 staff and multi-million dollar budgets. At Infintetiks, she is steering digital transformation for a traditional bank to deliver customer success and enhance customer experience. She is also supporting service delivery, process automations and management to entrench a customer-centric culture. She also spearheads channel transformation initiatives for timely product and service delivery by all customer contact channels. Furthermore, she introduces agile frameworks through the creation of agile product teams and provides technical support on merchant acquiring and collections, and financial inclusion. As former CEO of Renmoney, Oluwatobi provided visionary and strategic leadership, with full authority on strategic planning and execution, business transformation, product road maps and delivery, business development, market and portfolio growth. She led successful business transformation, leveraging agile methodology to transform the business from a traditional to a digital consumer lending company generating over $45M in annual revenues. Boshoro led a cross-functional and multicultural team of experts from Europe, Asia, Africa, and America to propel a 7-year business into its first profitability cycle within 6 months, re-positioning the company from a traditional bank to a digital lender. While at Stanbic IBTC Bank, she designed and rolled out a mobile App that attracted 10% adoption rate within a month of launch, and introduced a personal teller automated machine. At Interswitch Group, she was a member of a team that launched the Verve card, eclipsing competition and capturing 62% market share in 5 years. Still at Interswitch Group, on business development and territory, she captured untapped markets with entry into Ghana, Gambia, Kenya and Uganda. Oluwatobi Boshoro as an empowering leader, leads by providing support in the development of her team and infuses teams with energy and passion that empowers them to think big, achieve stretch goals, and outpace strategic business objectives. Ada Nduka Oyom Founder, She Code Africa Ada is the Founder of She Code Africa (SCA), a non-profit organisation focused on empowering young girls and women in Africa through technical skills. She founded SCA in 2016 and has since impacted over 17,000 women members across 20 African countries with her team, while championing gender diversity in tech through it. Their goal is to see an Africa where women are equally represented across all career roles in technology. Their mission is to build a community which embodies technical growth, networking, mentorship and visibility among all levels and career roles in technology. Ada’s role is to lead a cross functional team of 26, across 8 teams to oversee the creation and running of developer training programs targeted at the technical growth of community members in fields including web, mobile development, cloud re-engineering, open source, UX Design and so on, with programs going on to achieve greater than 93% completion rate. She is also responsible for defining community structure and creating scalable engagement and growth process with a large focus on membership. She has grown active membership from 0 to 17,000+ within 12 months in 20+ countries. She is also responsible for building, implementing and delivering standard software engineering practices and tools across internal engineering projects and community OSS technical projects. She started out as a self taught software developer in the university, and has since become involved in several other organisations within Africa’s technology sphere. Her expertise in developer relations and staunch advocacy for developers within Africa has earned her roles in several top organisations globally, including her current engagement as the Ecosystem Community Manager for sub-Saharan Africa with Google. Ada is also actively involved in advocating for open source in Africa, hence co-founded ‘Open Source Community Africa’, one of the largest communities for open-source enthusiasts, advocates and experts across Africa. Open Source Community Africa was created with the aim of growing and improving the number of credible contributions and development of open source technologies from African software developers and designers. Ada continues to volunteer her time as a technical and career mentor under several mentoring programs to help more people grow in tech. She is currently a Global Youth Ambassador for Their World, and has been awarded as one of Ytech 100 honourees by the Future Awards Africa 2019, Top 50 TechWomen of Lagos by TechCabal, Role model award winner in the Booking.com Tech Playmaker Awards 2020, Top 10 Women Making Change Through Education Across The World, via the 2021 Women Of the World (WOW) Hope Brigade exhibition, Developer Advocate Of The Year (2021) by HackerNoon. Nnenna Onyewuchi Co-Founder\/Chief Growth Officer, Halo Invest Nnenna is an internationally recognised marketing and business strategy executive with 25 years of experience planning and executing comprehensive strategies in support of business goals and objectives. Her expertise is in creating marketing tools, developing creative, effective communications, and driving business strategy. She is currently driving growth for Halo Financial Services as Co-Founder\/Chief Growth Officer. Halo is an innovative fintech enabling communities to offer personalised banking, investments and other financial services to their members. Their financial products and solutions cater to the investment needs of institutional and retail clients. They provide investment services and other financial products through several affiliates. Onyewuchi has knowledge and understanding of a variety of categories, including telecoms, retail, beverages and financial services. She has experiences working with global brands like MTV, Coca-Cola, BAT, Motorola, Absolut and Microsoft, as well as leading local brands, including Dangote, Zain, Robb, Joy, FCMB and Peak Milk. As VP, Strategic Planning at McCann Erickson, New York, she shared strategic leadership for McCann’s Tag Ideation, a specialised practice group within McCann Erickson New York, focusing on lifestyle brands. She managed a team of 4 junior planners and account executives, led project teams including senior staff from the agency, partner marketing firms and clients. Nnenna also developed a proprietary branding model, focused on the development of integrated marketing campaigns and strategies. As Director, Business Development at TBWA Concept, she defined strategy for new business development and new account acquisition, developed, executed and managed reputation management initiatives designed to raise the profile of the agency within the industry, and in the more general business environment. As Marketing Manager at HiTV, the project was to define positioning and marketing strategy for new entrant into the Pay-TV sector in Nigeria. She cultivated relationships with influential leaders within the print and electronic media. Furthermore, she developed materials for use by trade partners and supported sales team with POS and merchandising materials. As Director, Strategy\/Founder, Yellow Brick Road\/Blackbox, Nnenna Onyewuchi provided strategic oversight on all agency accounts and new business activities. She was responsible for thought leadership and knowledge transfer within the agency, and also co-managed high level client relationships. Onyewuchi was the former Chairman of the Board of WAVE, and was Executive Director, Strategy and Innovation at Yellow Brick Road\/Blackbox. Henrietta Bankole-Olusina VP\/Practice Lead of Economic Inclusion at Rockefeller Philanthropy Advisors Henrietta is a versatile and results-oriented executive leader with proven ability to lead cross-functional teams to success, with career achievements in digital transformation, innovation, fintech business development, payments, large-scale enterprise and IT transformation, product and channel development, customer experience, partnership and alliance building, strategy development and implementation, with change management and programme management capabilities and surely a strong regulatory interface. Rockefeller Philanthropy Advisors (RPA) is a non-profit organisation that currently advises on and manages more than $400 million in annual giving by individuals, families, corporations and foundations. Continuing the Rockefeller family’s legacy of thoughtful, effective philanthropy, RPA remains at the forefront of philanthropic growth and innovation, with a diverse team of experienced grant makers with significant depth of knowledge across the spectrum of issue areas. They advise established and aspiring philanthropists, foundations and corporations, and manage innovative, early-stage non-profits, while sharing insight and learning with their clients, their community and the sector. As former Managing Director at ARM Financial Advisers Limited, she was responsible for formulating and executing the short, medium and long-term digital and innovation strategy for the ARM Group (comprising 10 subsidiaries) including labs by ARM acceleration and innovation programme. Furthermore, she drove and led key digital transformation initiatives focused on innovation, digital capabilities, digital commerce (e-Commerce), digital marketing, customer experience, digital product development and channel, internal digitalisation, big data and analytics capabilities to enhance ARM’s overall growth and competitive advantage. She helped to develop digital products and channels (sales and distribution) on behalf of the group, with sales and revenue targets with specific focus on driving financial inclusion and penetration of the mass retail market. Henrietta designed, implemented, launched and managed PayDay by ARM (Nigeria’s first investment management fintech business to drive active users and revenue streams) and was also responsible for Group IT functions, including leading a multi-year IT transformation programme with focus on digital transformation for the Group. As former Group Head of Corporate Transformation and IT at Asset & Resource Management Holding Company (ARM HoldCo), she formulated and executed the short, medium and long term digital and innovation strategy for the ARM Group. At Accenture, where she spent 14 years, she was Management Consulting Lead, Financial Services, where she was a business development and operational value delivery executive, leading the Accenture management consulting financial services practice with responsibility for sales and revenue targets, responsible for initiatives origination, profitability, project management and delivery. Bankole-Olusina has an MBA in Corporate Strategy and Economic Policy from Maastricht School of Management and a BSc in Biology from the University of Lagos. Lilian Ebuoma Co-Founder, Lilly Women’s Health Breast Care Centre Lilian O. Ebouma leads the team of experts in Lilly Women’s Health Breast Care Centre. Her vision is to challenge the status quo regarding access to quality healthcare in Africa, particularly for women. At Lily Women’s Health Breast Cancer Centre, Ebuoma plays a leadership, as well as a hands-on role in the strategic planning, implementation and maintenance of all clinical program guidelines and growth strategies necessary to ensure Lilly Women’s Health Breast Care Centre’s success not only in the breast care industry but also in local communities. She sets the company’s strategic growth by providing vision and direction to the whole organisation, working in close partnership with key players from the health system, hospital campuses, Physician leaders and groups, communities and the internal teams. All her functions are in support of the delivery of quality breast care and achievement of a world class breast care centre, not only in Nigeria but all over Africa. She has been educated in prestigious universities (including Harvard Medical School) in the United States with Magna Cum Laude citations in Bachelor of Arts in Psychology. She is a Doctor of Medicine, with Diagnostic Radiology Specialisation and sub-specialisation in breast imaging and intervention. With more than a decade of experience in Radiology and Medicine, she brings together a team of other experts to Lilly Women’s Health who are on a mission to save women’s lives in Nigeria and eventually all of Africa from breast cancer. Lilian O. Ebuoma is also the President and Founder of Lilly Cares Foundation, a non-governmental organisation that engages in activities that empower, develop and enrich women in the society. Under the Lilly Cares Foundation, several programs exist to ensure that awareness, outreach and access to quality health services related to breast health are met. As a leader, Lilian Ebuoma inspires team Lilly to utilise their wealth of knowledge and experience to the overall integrity of the organisation and for the absolute service to patients and to mankind. A staunch believer in activating human potential, Lilian inspires, encourages, and motivates others for the purposes of transformational and transcending life change. She passionately cultivates behavioral change in others to build capacity and live their lives for the ultimate betterment of society. She is a certified professional coach, trained at the world-renowned Harvard Affiliated Co-Active Training Institute. She is an Associate certified coach from the International Coach Federation (ICF) and a Fellow of the Institute of Coaching at McLean, Harvard Medical School Affiliate. In collaboration with similar minded individuals and organisations, she aims to activate human potential to the next level for the development and activation of next generation leaders through transformational coaching. Maureen Ogbonna Founder\/CEO of Vallore Nigeria Limited Maureen is the Founder and CEO of Vallore Nigeria limited, an advisory, business and management consulting firm with a focus on business transformation. At Vallore Nigeria Limited, and they focus on business transformation and provide unique and authentic data-driven solutions that help organisations pivot or scale to become more efficient, sustainable and future-fit. Maureen maximises her diverse experience as a Board Chair, advisory board member, C-level strategist and business operations executive to help organisations become more efficient, sustainable and future-proof. Her diverse experience spans over twenty years in corporate, business and human resources strategy, equipment leasing, heavy vehicle fleet management, marine vessel lease and operations, Suzuki vehicles franchise management and personnel outsourcing within West Africa. In these sectors, she has worked in sales and marketing, business development, product design and development, business management, strategy and research and as ESG champion. She has led business and corporate culture transformation projects, scaled businesses from sub-units to fully fledged strategic entities, and led teams across functions, countries and cultures with positive outcomes in the post-pandemic volatile, uncertain, complex and ambiguous world. The thrilling and unique aspect of her varied business experience is her ability to improve business performance by developing and optimising strategies for sustainable growth. These strategies invariably give rise to more future-fit organisations that have positive impact in a truly exponential way. Maureen is a WIMBOARD Fellow and has acted as both interim Chairperson and Vice Chairperson of the Auto and Allied Sector of the Lagos State Chamber of Commerce and Industry. She is the Chairperson of the Board of Women in Management, Africa (WIMA) – a gender advocacy and empowerment company based in Tanzania. WIMA’s mission is to improve gender balance and diversity on boards and in leadership roles in line with the international benchmark for sustainable business practices, and Goals 5 & 10 of the United Nations Sustainable Developmental Goals (SDG 2030). Ogbonna holds a Bachelor of Technology in Industrial Chemistry from the Federal University of Technology, Imo State, Nigeria and an MBA (with a Merit) from Durham University Business School in the United Kingdom. Beyond the corporate office, her passion is working with a Christian charity organisation in Nigeria-the Society of Saint Vincent de Paul, to provide vocational and skills acquisition at the grass roots as well as support micro enterprises with funding and business advice. As the Founder and CEO of Vallore Nigeria limited, she maximizes her diverse experience as a strategist and business operations executive to help organisations achieve their business objectives in a sustainable way. Eloho Omame Partner at TLcom Capital | Co-Founder & General Partner at FirstCheck Africa Eloho Omame is an early-stage investor and a strong advocate for gender and inclusion in VC in Africa. She’s a Partner at TLcom Capital, a seed-to-growth stage VC firm, and a Co-Founder and General Partner at FirstCheck Africa, an early-stage VC firm investing in tech start-ups founded or co-founded by women. “In my new role at TLcom Capital, I’m excited to bring additional senior capacity to the firm’s high-touch approach with entrepreneurs and support deal flow generation at the pre-seed stage, as it doubles down on its commitment to Africa’s thriving tech opportunity with its $150m second fund, TIDE Africa II, which announced its first close in January this year.” She said. Omame co-founded FirstCheck Africa in 2021. FirstCheck Africa’s investment portfolio includes start-ups in Nigeria, Egypt, South Africa and Kenya, led by female founders building in financial services, education, healthcare and retail\/commerce. Through FirstCheck Africa, she is committed to helping Africa’s exceptional female entrepreneurial talent build great companies. TLcom Capital invests in Africa’s best entrepreneurs tackling the continent’s biggest challenges. Its portfolio includes a number of impressive high-growth companies, such as Twiga Foods, Ilara Health, Pula, Shara, Okra, Ulesson and Autocheck. The firm’s TIDE Africa Fund I ($70M) was the first on the continent to meet the G7’s 2X Criteria for gender lens investing. TIDE Africa Fund II (target: $150M) is actively investing. From 2018 to 2021, Eloho launched and operated Endeavor in Nigeria, serving as its inaugural Managing Director & CEO. Under her leadership, Endeavor Nigeria developed an impressive portfolio of services to support Nigeria’s growing community of high-growth entrepreneurs leading companies at the scale-up stage. In 2017, on behalf of the Lagos State Employment Trust Fund, under the auspices of one of Africa’s largest sub-national governments, she delivered “Lagos Innovates”, a first-of-its-kind portfolio of programs that she conceptualised, designed and implemented. Lagos Innovates has helped thousands of entrepreneurs launch their technology ventures. On entrepreneurship, Eloho says entrepreneurs are crucial for economic growth, but not all entrepreneurial firms are important contributors to economic productivity. According to her, the best entrepreneurs drive innovation, create high-quality jobs, spread wealth and wider prosperity, contributing to vibrant markets that boast inclusion and sustainability. DAMILOLA HASSAN Managing Director, Meristem Trustees Ltd Full of ideas, innovations and talents, Damilola Hassan heads the Trustees Division of Meristem. In her 13 years at Meristem, she has contributed a lot of growth to the organisation, harnessing her comprehensive experience in investment advisory, asset management, marketing and corporate communications and client relationship management. Her contributions have positioned Meristem as the choice investment partner in the Nigerian Capital Market. For over 19 years, Meristem has innovated, grown and attained the status of the preferred financial services provider for individuals and corporations in Nigeria and across the world, through a rich history of excellent customer service, demonstrated financial services expertise, combined with an enviable workplace culture of thoroughbred professionals. This has kept them true to their founding promise “Let’s grow wealth for you” They are a capital market conglomerate that provides a plethora of distinct financial services through a range of products in wealth management, stockbroking, financial advisory, trusteeship, registrars and probate management services, investment banking, lease, and loans. Their subsidiaries include Meristem Wealth Management, which helps grow clients’ wealth, Meristem Securities Trading, which offers brokerage services, securities dealing and strategic acquisitions, Meristem Investment Banking, which brings solutions tailored towards helping you achieve your strategic goals, Meristem Registrar Services, which offers first services in administrating shareholders register, IPO & Bond Issues Services and so on. Others include Meristem Trustee Services which provides services like Bonds & Debenture Trusteeship and so on. Finally, they have Meristem Loans and Leasing, the finance house of the Meristem group. Hassan is a financial planner, possessing extensive experience in investment advisory, wealth management and trust services. She loves to hand-hold her clients as they march towards their financial goals. “Tough decisions need to be made, and having a reliable financial planner who is genuinely interested in the attainment of these goals is priceless.” She said. Damilola spends her everyday proffering wealth management solutions tailored to suit the objectives of affluent individuals and their families. She is a graduate of Microbiology, holds an MSc and an MBA in Finance and Business Management, she is a Chartered member of Nigeria Institute of Management, an authorised Dealing Clerk of the Nigerian Stock Exchange, an associate member of the Chartered Institute of Securities & Investments (CISI) United Kingdom, and an associate member of the Chartered Institute of Stockbrokers, Nigeria. She is a facilitator at The Entrepreneurship Academy, Lagos Nigeria and serves as Trustee to The Chinwe Bode Akinwande Foundation. When not creating wealth for clients, Damilola loves to read and write fiction. Mercy Bello Abu President\/Global Convener, Entrepreneurs Platform Initiative Mercy Bello Abu is a management consultant and a clarity mind-reset strategist. She is a trainer at IHP Consulting Services, a well sought-after entrepreneurship, leadership, clarity coach, and a public speaker. A graduate of English and Literary Studies from the Edo State University, MBA from the University of Nigeria, Nsukka and has been involved in capacity building, training, and capacity development for over twenty years. She is also the Publicity Secretary of Port Harcourt Chamber of Commerce, Industry, Mines, and Agriculture (PHCCIMA), the appointed Coordinator of Women’s International Shipping & Trading Association WISTA Nigeria, Rivers state chapter. Bello Abu is the former Chairperson of NECA’s (Nigerian Employers Consultative Association) Network of Entrepreneurial Women (NNEW) South-South. Mercy is the President\/ Founder of Entrepreneurs Platform Initiative EPI. A forum where they share inspirational stories on entrepreneurship, a platform that is all about entrepreneurs and entrepreneurship. The EPI is a forum that shares the best of real life stories of entrepreneurship and celebrates entrepreneurs as well. This process is achieved by organising seminars, trainings and workshops, where seasoned entrepreneurs share their challenge -to -success stories. As the Executive Director of the School of Clarity, Entrepreneurship and Mentorship, she coaches and mentors individuals and organisations on having total mind reset with clarity for self-actualisation. She is a recipient of several awards, and a fellow of various professional bodies, including Fellow African Institute of Strategic Managers FAISM, Fellow Institute of Management Consultants (FIMC), Fellow Chartered Institute of Human Resources Management (FCIHRM), Fellow Chartered Institute of Loans and Risk Management of Nigeria (FCILRM), Doctoral Fellow Institute of Leadership Manpower and Management Development (DFILLMD). A recipient of several awards, some include The Entrepreneur Of The Year’, by the Women On Fire Initiative, and ‘The Woman Of Impact Award 2018’. Others include ‘The Distinguished Service Award’ and honorary Rotarian award by The Rotary Club of Port Harcourt Creekview of the Rotary International District 9141. She also won the prestigious education award by The Port-Harcourt Education Festival Beam International ‘Woman Of The Year 2020’ to mention a few. Mercy is an appointed member of various boards, including, board member Sustainable Enterprise Development (SED) initiative. She is happily married with four children, a God-lover, and an ordained evangelist at Just Jesus Assembly. Her goal is to help brands, individuals, and organisations with her vast knowledge in entrepreneurship and leadership training, train entrepreneurs to create systems, structures, and strategies with a clarity mind-set for business growth and sustainability. TEMITOPE YUSUFF Director, Internal Audit & Risk Management, IHS Towers Temitope is a seasoned business leader and finance professional, with over eighteen years of financial experience, with exposure to both local and international organisations. Her varied experience in providing core business transformation, strategy, auditing, risk management and corporate governance services provided her with a well-rounded perspective necessary to meet the business and financial needs of organisations. Currently, she serves as the Director of Internal Audit and Risk Management of one of the largest telecommunications infrastructure providers globally, and her work involves providing strategic leadership and direction in the planning, execution, and management of risk management and internal audit activities across IHS Africa (Nigeria, Cameroon, Cote d’Ivoire, Zambia, Rwanda, and South Africa). Temitope leads the organisation across a variety of global operational standards, which enables them to make efficient sound financial decisions, in line with global practices. Yusuff is a fellow of the Institute of Chartered Accountants(ICAN) and the Chartered Institute of Taxation of Nigeria (CITN), an alumna of IESE Spain, with an MBA from the Lagos Business School. As a consummate business professional, she possesses a drive to create and implement robust solutions that bring about sustainable impact, transforming the businesses of professionals and business owners. As Director, Internal Audit and Risk Management at IHS Towers, while she facilitates the implementation of the risk management framework across the African markets, she further ensures continuous review of operations, systems, and processes for efficiency and effectiveness, as well as management and staff compliance with laid down policies, procedures, and controls. While At PwC, Yusuff was Associate Director, Assurance, and she was responsible for sourcing, initiating and driving the execution of strategic engagements for PwC Nigeria’s Assurance division. This included liaising with key stakeholders in new and existing client organisations. She also consistently increased oversight on diversified portfolio within several engagements, utilising her project management skills to increase efficiency and quality of engagement delivery, maintaining focus on meeting and exceeding client’s expectations, ensuring clients are retained and all accounts stay profitable, whilst providing leadership oversight to a staff strength of one hundred and fifty (150) within the business unit. Also, while she was at PwC as senior manager , she was responsible for conceptualising key audit engagement strategies, including client service plans and quality monitoring and evaluations protocols. She worked with large businesses in the areas of audit, strategy, controls and processes to improve governance and manage risk . Yusuff was also charged with managing end-to-end annual audit engagements for top tier organisations and multinationals, in a variety of sectors including energy, consumer products and financial services. Adeolu Adewumi-Zer Immediate past MD\/CEO for Allianz Nigeria Insurance Ltd Adeolu Adewumi-Zer was the immediate past Managing Director\/CEO for Allianz Nigeria Insurance Ltd, headquartered in Lagos, a position she assumed in September 2020. She is a global strategist and transformation leader who has held a number of key executive positions within the Allianz Group, based in three different continents. In 2017, the company generated gross written premiums of N7.67billion representing an 86% growth over 2016 (N4.19billion). In May 2018, Allianz Nigeria Insurance Ltd officially became a company of The Allianz Group. Prior to serving as MD, Adeolu was the Regional Head of Mergers, Acquisitions and Transformation Africa for the Allianz Group, and was appointed the first female board member for Allianz Nigeria in 2019. She has worked since 2000 in global financial services across numerous mature and emerging markets, beginning her career in the USA as an Actuarial and International Benefits Consultant within the Aon Group. As a Nigerian and self-described Afro-optimist, with absolute conviction in the immense potential existing within the African continent, she does her part to prepare Africa‘s sons and daughters by coaching, mentoring and sponsoring tomorrow’s leaders both live and via her podcasts, webinars, conferences and publications, while volunteering mentoring services to several organisations. Her aspiration is to create, enable and lead the new Africa by developing the next generation of great leaders. Although she began her career as an actuary and consultant, her desire to act, not only to advise, brought her to Allianz, where she spearheaded growth and transformation across business lines, functions and now in Africa. In addition, she has coached teams and mentored people on at least four continents, and finds that the best way to bridge diverse cultures, backgrounds and experiences is to advocate discipline and professionalism while encouraging a supportive family atmosphere. Africa is Adeolu’s passion and purpose. She loves to connect with people to discuss how she can ignite the impact of your organisation on her continent. Adeolu is married with two children. In her limited spare time, she is a lifelong runner, a voracious reader and loves discovering new countries and cultures. Chinwe Ajene-Sagna Managing Partner at Catalyst Realty Solutions Ajene-Sagna is the Founder & Managing Partner of a full-service real estate firm Catalyst Realty Solutions (CRS), and an adjunct faculty member in the Strategy Department of the Lagos Business School. Chinwe is a Non-Executive Director and senior executive with over 20 years of experience in the real assets\/property management industry operating at CEO and C-suite level across the public and private sectors within the US, France, and in both Francophone and Anglophone West Africa. Recognised as one of the leading women in real estate in Nigeria and West Africa, Chinwe has a demonstrable track record of accomplishment delivering strategic advisory, asset management, and portfolio rationalisation solutions for private and institutional pan-African and international clients. Having spent over 14 years with JLL, a Fortune 500, NYSE listed global real estate market leader, Sagna, as Head of West Africa, opened up offices in Lagos and successfully executed the business strategy. She possesses in-depth experiences building master planned communities for both the public and private sectors. As Head of French International Desk at JLL, she was responsible for strategic advisory and providing global portfolio optimisation solutions for key French and international clients. She delivered a full spectrum of real estate services including financial analyses, strategic advisory, portfolio master planning, valuations, project and development services, and change management\/ work-place solutions. As an Associate for JLL, she was a housing specialist. She has broad privatisation experience from JLL Washington DC (USA) office where she worked on the multi-million dollar privatisation support contracts with the United States Army and Air Force for the development and redevelopment of military housing. 2000+ homes. More recently, she was Group Head of Business Development Africa for Rendeavour – Africa’s largest private city developers with over 12,000 hectares in Kenya, Nigeria, Ghana, DRC, and Zambia. Ajene-Sagna sits on the the advisory boards of Harvard Business School Africa Advisory Board, Seso Global, AfricaWorks (pan African real estate firm), and on the board of Amandla Capital\/Sunu real estate . She was responsible for establishing the Entrepreneurship Accelerator Program as Head of the Education Committee of Rising Tide Association (women’s angel network) and also sits in the investments committee amongst other roles. She holds an MBA from Harvard Business School and a BA (High Honors) from Dartmouth College. She is a member of the Royal Institute of Chartered Surveyors (MRICS), the UK Institute of Directors and the Nigeria Institute of Directors. She is fluent in French, is learning Arabic, enjoys running, travelling and golf, and is married with two children. Oluwayemisi Busari Senior Adviser, Government Relations, Honeywell Group Oluwayemisi Busari is Senior Adviser, Government Relations at Honeywell Group. She is responsible for leading and managing interactions with government and key regulatory bodies; supporting to ensure the key stakeholder group is effectively managed. Oluwayemisi is an accomplished legal practitioner with almost 3 decades of experience in the areas of company secretarial, corporate governance, litigation, and commercial law practices. Before now, she was Head, Group Legal and Regulatory Affairs, where she was responsible for legal activities of the Group and its member companies, while also serving as the Group’s primary interface with various regulatory institutions. Through her multifaceted role at Honeywell Group, Oluwayemisi has developed a reputation as a strong commercial lawyer with deep insight and knowledge across several business sectors, including Foods and Agro allied industry, the Energy industry, Solid Minerals industry and the Real Estate industry. She has worked on a number of strategic transactions and has been involved in pivotal capital raising initiatives, including leading all legal and regulatory compliance activities towards the successful listing of Honeywell Flour Mills Plc on the Nigerian Stock Exchange in October 2009. At various times, she has also been responsible for the Corporate Communications, Corporate Affairs and HR & Admin. functions at the Group. She has extensive experience providing legal advice and leading commercial negotiations for local and international transactions across various sectors- evidenced through over 5 major Mergers & Acquisitions transactions worth over N10bn across various legal jurisdictions ( Africa, Asia and Europe). As the Head of Group, Legal and Regulatory Affairs, she built the Legal Department into a Group Legal and Regulatory Affairs Department- developing and implementing structures and processes for the management of legal issues, providing legal advice on investment decisions, and managing the legal aspect of several strategic transactions. She started her career at Irving and Bonnar\/ Bentley Edu Law Firm in Lagos. She rose to the position of a senior associate before she left to join the Honeywell Group. Oluwayemisi obtained a bachelor’s degree in Law from the University of Lagos. Prior to that, she had studied English at the University of Ilorin. Following her call to bar, she earned a Master of Laws degree from the University of Lagos. She thereafter obtained a Master’s degree in Business Administration (MBA) from the Lagos Business School in association with the IESE Business School. She is a member of the Nigerian Bar Association and Federation of International Women Lawyers. She has attended various international and local training courses and conferences. She is also a member of the Institute of Directors (IOD) and Institute of Corporate Governance. Oluwayemisi loves to counsel and mentor young people. She is passionate about God and is married with three children. Foluke Michael Founder, The Green Entrepreneurs Foluke Michael is a Project Management Consultant, Author, IBM Enterprise Design Thinker and SDGs Implementer. She graduated with MSc in Project Management at the University of Salford Manchester, United Kingdom. She obtained a Certificate in Design-Led Strategy: Design Thinking For Business Strategy and Entrepreneurship from The University of Sydney, Australia. Foluke is the CEO and Project Director of Creative Youth Community Development Initiative. She created CYIAC Corruption Busters and other anti-corruption initiatives to curb corruption through educational and creative development in children and youth. The anti-corruption educational materials were published by UNODC’ Education for Justice #SDG16 for Global Dissemination. In 2018, Michael won the United Nations SDG Action Award – Innovator, at the Global Festival of Action for Sustainable Development. She also won the University of Salford Alumni Achievement Award in recognition of her exceptional contribution to society. Her works have been published globally. She created ‘Solution17 for SDGs’. The initiative has been published twice by United Nations as ‘Good Practice’, and ‘Inspiring Breakthrough’ that scaled up to help galvanise the momentum for implementation of the 2030 Agenda and the SDGs Climate Action – SDG3. She is currently leading global movement against climate crisis, she designed ‘Solution17 Art for Climate Change’, an initiative which has produced 34 Climate Action Enterprises on CANVAS, and was officially launched on September 25, 2020 by the UN Deputy Secretary-General Amina Mohammed. In October 2020, Foluke was recognised as the Hero of Climate Action by the Most Influential People of African Descent (MIPAD) in support of #SDG13. Foluke is also the founder of The Green Entrepreneurs. They undertake green initiatives with the primary objective to combat environmental problems by offsetting greenhouse gases (GHG). Green Entrepreneurs adopt sustainable, environmentally friendly production processes. They develop products with low energy consumption in mind and environmental responsibility is at the core of their culture. Her latest book ‘The Green Entrepreneurs’ was published on Amazon in 2021. Foluke launched ‘Naija Climate Now’ towards sustainable climate action. The first phase was completed in December 2021 in partnership with United Nations, German Cooperation, Italian Consulate in Lagos, British High Commission and Sterling Bank. She is a lover of creativity and innovation. She helps children and youths develop their God-given talents. She promotes and prepares them to lead positive changes in the future. In addition to this, she has strong passion for women empowerment, arts, culture and creative enterprise development. Essentially, Foluke is a lover of her country – Nigeria. Hence she is passionate about seeing sustainable development in Nigeria. This thus drives her to engage in projects that can contribute immensely to nation building. Somachi Chris-Asoluka CEO, Tony Elumelu Foundation (TEF) Somachi Chris-Asoluka is the CEO of the Tony Elumelu Foundation (TEF). She was most recently the Director of Partnerships and Communications for the Tony Elumelu Foundation (TEF), the leading philanthropy empowering young African entrepreneurs from all 54 African countries. In this role, Somachi oversaw marketing, communications, policy, advocacy, and partnerships for the Foundation. She leads TEF’s efforts to build strategic relationships with stakeholders, multilateral organisations, development institutions, civil society, foundations, and other key development partners to support African entrepreneurs and mobilise capital investments in these small businesses. She leads the Foundation’s regional and global external engagements and oversees TEF’s global brand strategy and positioning. Since the launch of the TEF Entrepreneurship Programme in 2015, the Foundation has trained over 1.5 million young Africans on its digital hub, TEFConnect, and disbursed nearly USD$100 million in direct funding to 18,000 African women and men, who have collectively created over 400,000 direct and indirect jobs. Under her leadership, the Foundation is increasingly sharing its unique ability to identify, train, mentor, and fund young entrepreneurs across Africa, through partnerships with institutions including the European Union, the United Nations Development Programme, the International Committee of the Red Cross, the United States Government via the United States African Development Foundation (USADF), the Organisation of African, Caribbean and Pacific States (OACPS), the French Development Agency (AFD), the German Development Finance Institution (DEG), the German Agency for International Cooperation (GIZ), the African Development Bank (AfDB), and Google. Somachi was a researcher at Lagos Business School, Pan-Atlantic University, where she co-authored research articles chronicling the internationalisation processes of top African institutions (e.g., Ecobank) for case studies to train MBA students. Furthermore, she also coordinated and managed the annual Lagos Business School Career Fair, which convened Nigeria’s most competitive private sector operators, and outstanding MBA students. As Consultant at Phillips Consulting Limited, she undertook feasibility studies and prepared business plans by developing core market entry strategies, gap\/porter’s analysis and industry\/risk assessment in select industries. Somachi graduated Summa Cum Laude from Saint Mary’s College of California with a BSc. in Economics and a minor in Mathematics and received the “Adam Smith” award given to the highest performing graduating student in Economics. She also has a master’s degree in International and Development Economics from Yale University. She is a member of the Financial Women’s Association, San Francisco, USA, the Omicron Delta Epsilon (National Economics Honor Society, USA), and a fellow of the Moremi Initiative for Women’s Leadership in Africa – a programme that annually identifies and engages the top 25 most promising women leaders on the continent. She is also a Deputy Champion of the World Economic Forum (WEF) EDISON Alliance. IGAZEUMA OKOROBA General Manager, Sustainability Nigeria & Pan Africa at Dangote Cement Igazeuma Okoroba (Ph.D) is General Manager, Sustainability Nigeria and Pan Africa at Dangote Cement Group. She is a Development Sociologist with over 19 years of experience in civil society, media, oil & gas, telecommunications and manufacturing sectors. Her career purpose is to transform industry through sustainability innovation for business growth and sustainable livelihoods for Africans. She is a self-starter and an altruistic personality with an aptitude for advocacy and research. Having mastered diverse roles in the business value chain, Igazeuma has performed roles in strategy, social impact assessment, Corporate Social Responsibility (CSR) and sustainability. Presently, she manages multidisciplinary and multicultural teams in 11 African countries. As part of her current role, she works to integrate Environmental, Social and Governance (ESG) factors in business operations. She leads the company’s circular economy programme. Igazeuma mentors a group of young professionals aspiring for strategic roles in industry, while also supporting civil society and academia as an academic reviewer of international journals. Her research interests lie in development sociology, human geography, gender and energy transition. Her work explores mechanisms through which social, spatial, and temporal contexts shape corporate outcomes in African societies. She is passionate about knowledge sharing and welcomes opportunities for bridging the ‘town’ and ‘gown’ divide in institutions. Okoroba holds an M.Sc in Sustainable Development from the University of Exeter, UK and a PhD in Development Sociology, from the University of Port Harcourt, Nigeria. She is a fellow of the Institute of Corporate Governance of Nigeria (ICGN) and the International Society of Sustainability Professionals (ISSP). She also serves on the board of non-governmental organisations focused on social development. Ifeoma Malo Co-Founder\/ CEO, Clean Tech Hub Nigeria Ifeoma is an organisational management expert with over 20 years’ experience, building and directing organisational policy and strategy in energy and large scale utility markets, public health, bio technology, leadership, change management and infrastructure finance. She is experienced in political economy, energy policy and energy markets, developmental economics biotechnology, climate and environment, sustainability, dispute resolution, process facilitation and organisational development. She is the Co-Founder\/ CEO, Clean Tech Hub Nigeria. Clean Technology Hub is a pioneering hybrid hub for the research, development, demonstration and incubation of clean and green ideas and technologies in Africa, and their validation for commercial-stage development. The Hub was founded in 2016 and is located in Abuja, with virtual hubs spread across the country. Clean Tech is Nigeria’s premier and pioneer energy innovation centre. It is also an early start-up incubator for inventions and innovations in clean energy, a consultancy for sustainability and energy efficiency solutions, and a driver of clean energy and climate-smart investments into Africa. Their goal is to drive energy access in Africa through novelty in clean energy technologies, research in sustainable energy development and development of energy access models that can be adopted in various African countries. They also aim to grow the next generation of Africa’s clean energy leaders. Ifeoma is skilled in programming, and is a policy expert in government relations and institutional stakeholder’s management, business negotiations and corporate restructuring. She is adept at design thinking, deal structuring and building sustainable organisations. Currently a renewable energy market advisor, she is also an energy access regulatory and policy expert. Furthermore, when it also comes to gender mainstreaming, innovation, talent discovery, providing research, program development and monitoring, including driving decentralised renewables across sub-Saharan Africa, and addressing environment and climate change mitigation, Ifeoma is certainly your go-to. She has had experiences in Nigeria, USA, Switzerland, United Kingdom, South Sudan, Ghana, Kenya, Sierra Leone, Zimbabwe, Rwanda, Gambia, South Africa and Cameroon. Her interests include providing policy, economic and strategy consulting services to businesses and organisations, providing government relations expertise and project management expertise for large and medium scale electricity grid connected and off grid projects. She is very interested in long term project management, research, advisory, economic development and policy formulation projects. Malo is a Caux Scholar, African Leadership PIA fellow, Desmond Tutu Fellow, Crans Montana New Leaders Fellow, Eisenhower Fellow and also the Global Leadership Academy – We Africa network. She is a Commonwealth Leaders Scholar – CSC Leaders. She is a member of boards that include: Green Peace International; Access to Energy Institute (AE2I), Extractive 360 and Norrenberger Financial Services. Lilian Olubi CEO, EFG Hermes Nigeria Ltd Lilian is a skilled finance and investment professional with over twenty years’ experience in capital markets and demonstrated capabilities in business development, acquisition integration, strategic planning, funding and leadership. She is the Chief Executive Officer of EFG Hermes Nigeria, a leading investment firm providing equities trading and actionable investment research to its domestic and international corporate clients. (Formerly Primera Africa Securities before its acquisition by EFG Hermes Group, a 30-year old financial services corporation in 13 countries across 4 continents, listed on both the London and Cairo Stock Exchanges). Lilian is an authorised dealing clerk of the Nigerian Stock Exchange, a Fellow of the Chartered Institute of Stockbrokers and Associate of the Chartered Institute for Securities & Investments, UK. She is also a board director and advisor for Volition, Winock Solar, Primera Microfinance Bank and NextGen FLX. Lilian is a member of the governing council, Chartered Institute of Stockbrokers, a boardroom Judge of The Next Titan, which is a successful entrepreneurship reality show that provides opportunities to young entrepreneurs with innovative business ideas. She is also a Founding Partner and member of the Board of Directors of Primera Africa Group. She is an advocate of social capitalism as the engine house of a great economy. As CEO of EFG Hermes Nigeria Ltd, she has the responsibility of providing effective leadership for the work force, directing and participating in growth activities to support the business objectives and mission to be the choice broker for unprecedented access to Sub-Saharan business opportunities. EFG Hermes Nigeria, (formerly Primera Africa Securities) is a top brokerage firm by value traded on the NSE providing equities sales, trading and execution, actionable investment research and corporate access. Their clients include International sell-side brokers, foreign fund managers, hedge funds, family offices, local pension fund administrators, insurance companies, corporations and HNIs. EFG Hermes Nigeria Securities Brokerage is an expansion of the EFG Hermes Frontier Markets team, the largest team across the Firm’s MENA footprint and a consistent leader of rankings across various exchanges. EFG Hermes Nigeria provides unprecedented access to high-level, incisive research that provides fresh insights into key sectors and equities as well as in-depth economic and strategy reports tailored to the Nigerian market. As Chief Executive Officer of Primera Africa Securities Limited, Olubi was responsible for defining the company’s strategy and framework, directing company operations to meet its goals. She also had the responsibility of directing the short and long term planning and budget development to support strategic business goals and provided leadership for workforce and oversaw all finances, business development, marketing, human resources and administrative affairs. Olufunke AlomoOluwa Managing Consultant at MaDop Associates Limited Olufunke AlomoOluwa is a C-Suite leader with over two decades cognate experience in business and corporate leadership, business re-engineering, board management, developing business processes, operational governance, and financial engineering. Over the last 20 years, she has served in various capacities including being the Managing Director\/CEO of Chams Access, a subsidiary of Chams Plc. As Executive Director – Innovation, Marketing Communication and Sales at CHAMS PLC, she managed and coordinated the operations of the company’s strategic business units by driving business efficiency and profitability through provision of strategic and operational leadership, managing portfolio expansion and instituting governance. Her role also included managing board and stakeholders expectations. As Managing Director, ChamsAccess LTD, she turned around the downward growth trend and grew the business revenue by over 6000% and profitability by over 4000% within 2 years. Olufunke also established new products as well as new partners, resulting in better integration in the financial sector and diversification into the telecommunication sector. Furthermore, she built strategic relationships with key industry players and relevant government functionaries in a bid to enhance the corporate image of Chams Access and Chams Plc as a whole. When Olufunke was Deputy Project Manager (BVN Project), Central Bank of Nigeria BVN Special Project, she was also the chief installation officer and she worked with the Central Bank of Nigeria (CBN) and the Baker’s Committee, to develop project implementation framework and also managed a team of 100 professionals in deploying over 30,000 BVN registration devices across 5,000 Bank branches nationwide, with a team of over 100 staff. She is currently the Managing Consultant of MaDop Associates Limited (Management and Financial Consulting Firm). MaDop is a consulting service company established to help SMEs in developing their business and growth strategy, formulating their financial strategy, and designing their process governance structure. They partner with clients to adapt proven international standards into their businesses. Olufunke’s competencies span across corporate strategy formulation and flawless execution, turnaround management, innovation management, information technology, business development, human capital development, auditing & accounting, corporate governance & finance, project management, organisational change management, succession planning and leadership. She is a fellow Member of Institute of Chartered Accountant of Nigeria (ICAN). She holds an MBA from the PAN Atlantic University (Lagos Business School) and a Bachelor of Science degree in Computer Science and Economics (combined honors) from the Obafemi Awolowo University, Ile-Ife. Olufunke has attended several executive trainings in top institutions like IESE Business School, Spain and University of Wisconsin, USA. She is a member of several professional associations including Nigeria Computer Society (NCS), Institute of Directors (IOD) and Women in Management, Business and Public Service (WIMBIZ). Mojolaoluwa Aderemi-Makinde Regional Head of Brand and Reputation, Africa, Google Mojolaoluwa is the Regional Head of Brand and Reputation for Google in Africa. She is passionate about technology and its ability to unlock human potential and improve the general good. At Google, she has led business development of various products and initiatives, as well as led sales across Africa, managing Google’s largest clients and growing industries from scratch. More recently, she is focused with her team on delivering Google’s commitments in Africa to drive economic opportunity on the continent, by supporting small business development \/ entrepreneurship, job creation, education and gender equality through Google’s flagship program ‘Grow With Google’. At Google, they believe technology is an enabler, and can help drive inclusive economic growth and development, therefore supporting small businesses to have access to the resources they need to expand, grow, and thrive in the digital economy. This is at the heart of Google’s work in Africa. “Nigeria is a focus market for us. We recently launched an initiative, Google Hustle Academy, a boot camp style training programme designed to help small business owners position their businesses for investment opportunities, and build viable business models for the future. Our goal for 2022, is to support 5,000 small businesses via the Google Hustle Academy. We are well on our way, and the feedback from our participants so far has been very encouraging.” She said. Gender equality is a topic Mojolaoluwa is deeply passionate about. She is deliberate about driving gender representation in their programs at Google “Examples include our Grow With Google program where up to 49% of the people we have trained are women. In addition, we have also run several programs and initiatives specially for women. “Aderemi-Makinde said. As part of Google’s philanthropic arm, Google.org is committing $1m in charitable funding to support programs helping women entrepreneurs to grow their businesses. They have also dedicated their March cohorts for ‘Hustle Academy’ to women owned small businesses, alongside other capacity building initiatives. Furthermore, Mojolaoluwa advocates and champions meaningful representation of women in business, and contributes to thought leadership and research on gender diversity both locally and internationally, in range areas including Artificial Intelligence. She has a wealth of experience spanning multiple industries and geographies, having also worked as a strategy consultant with Accenture amongst others. She is a strong diversity and inclusion champion and advocates for representation of girls and women in technology. Mojolaoluwa is a mentor and advises on various programmes and boards. She has been recognised as one of the 40 Leading Ladies driving the Sustainable Development Goals in Nigeria. She holds a Bachelor’s degree in Computer Science from the University of Lagos, and a Masters in Management and Strategic Information Systems from the University of Bath. Rabi Isma Independent non-executive director, Stanbic IBTC Bank Rabi Isma is an Independent Non-Executive Director on the Board of the Stanbic IBTC Bank. She was previously Director of HR Business Partnering & Health and Safety at Emerging Markets Telecommunications Services Limited (operators of 9Mobile). Prior to this, she had served in various roles as HR Consultant and Lead (international assignment) at Etisalat Sri Lanka; Director of Leadership and Organization Development at Etisalat Nigeria. Between 2011 and 2013, Isma also served as Special Adviser to the Governor of Kano State on matters relating to Non-Governmental Organizations, policy framework for investment and governance technical reform advisory. Rabi Isma also served as a Marketing Director for the British Council in Nigeria delivering strategic goals in the organisation’s partnership relations across education, marketing and communications. Prior to this, she had for the three preceeding years served as Director, Support Services, where she amongst other things, developed and led British Council Nigeria strategy for learning and development hubs, corporate communications, customer service support and the national strategy for outreach. Isma started her career as an Assistant Banking Officer at Guaranty Trust Bank PLC in 1996 and had risen to the cadre of Assistant Manager in 2002 when she left the bank. Isma holds a Master of Science (M.Sc.) Degree in International Development from the University of Birmingham, United Kingdom; PD Certificate in Peace Studies and Conflict Resolution from Chulalongkorn University, Bangkok Thailand; Master of Science (M.Sc.) Economics, Management of Information Services, University of Wales, Aberystwyth; Master of International Affairs and Diplomacy (MIAD), Ahmadu Bello University, Zaria; Post Graduate Diploma in Management (PGDM), Ahmadu Bello University, Zaria; Bachelor of Science (B.Sc.) in Computer Science and Economics, Obafemi Awolowo University, Ile-Ife. Rabi has also attended several executive programmes including General Management Program (GMP21) at Harvard and Advanced Human Resources Executive Program at the Michigan Ross Business School, Michigan USA. She currently sits on the Board of Leadership, Effectiveness, Accountability and Professionalism (LEAP) Africa, a non-governmental committed to developing dynamic, innovative and principled African Leaders. She also sits on the Board of ActionAid Nigeria, a non-profit organisation focused on advancing human and reducing poverty levels. Oluwatoyin Aralepo Global Head of Finance – Program FP&A Mastercard Foundation Oluwatoyin Aralepo is a ﬁrst class accounting graduate. A Fellow of the Institute of Chartered Accountants of Nigeria (ICAN), Fellow of the Institute of Information Management of Africa, and an Alumna of the London School of Business and Finance (LSBF), with over 20 years of experience across Banking, Telecoms, and FinTech. Areas of expertise include ﬁnance strategy and business partnering, ﬁnancial planning, analysis & reporting, audit and business assurance, ﬁnancial controls, and governance. She was the Head of Budget in UBA – responsible for over 400 business oﬃces’ budget preparation and consolidation; Commercial Controller and Financial Controller at Airtel Nigeria where she managed a portfolio of over $1 billion and supported cost initiatives that saved millions of Dollars, and former CFO of Cellulant Nigeria and Liquid Technologies. She recently founded Africa Finance & Strategy Hub to help businesses, especially SMEs, gain easy access to professional ﬁnancial management skills and tools that will assist them to understand, manage and scale their businesses. She aims to help businesses build sustainable ﬁnancial structures for proﬁtable growth and become investor ready. She is currently the Global Head of Finance – Program FP&A Mastercard Foundation. A very passionate and unassuming entrepreneurial role model to young women. She is a mentor of Wimbiz, Tony Elumelu Foundation, and Techquest STEM Academy to mention a few. Recently named one of the top 50 Women in Management in Africa 2023. She is the author of the book ‘How to Attract Billion-Dollar Investors’. Chidera Akwuba Manager Transformation, Public Affairs and Governmental Relations, Henkel Nigeria Chidera Akwuba is a highly accomplished and results-driven professional with extensive experience in transformation, strategy, public affairs, and governmental relations, currently leading the Transformation and PAG Department at Henkel Nigeria. Chidera is responsible for driving growth, enhancing organisational effectiveness, and engaging with stakeholders to shape public opinion. A graduate of the renowned Heriot-Watt University in Edinburgh, Chidera has honed her skills and expertise in business strategy, transformation, and stakeholder engagement over several years of experience in leadership positions in the oil and gas sector and most recently the FMCG sector. Before assuming her current role, she led the Government Relations Department at one of the largest downstream oil and gas companies in Nigeria where she was responsible for developing and implementing effective government relations strategies that facilitated business growth. In recognition of her exceptional performance, Chidera won the award as the Most Valuable Government Relations Advisor in Nigeria in 2021, and in 2022, she was also named one of the Top 100 Career Women in Nigeria, a testament to her outstanding leadership and contributions to the business community in the country. Passionate about female empowerment and sustainability, Chidera is a trailblazer in promoting gender equality and environmental sustainability in the workplace. She has been actively involved in mentorship programs for women and girls, advocating for their rights, and creating opportunities for them to excel in their chosen fields. Chidera would like to see a world driven by cleaner fuels in the near future. Folake Soetan Owodunni Co-Founder, Emergency Response Africa Folake Soetan Owodunni is a Co-Founder at Emergency Response Africa. Folake is dedicated to making healthcare accessible in Africa, she is a skilled communicator and Prosci-certified Change Management Practitioner with over 9 years of experience in healthcare, non-profit, consulting and higher education sectors in US, Nigeria and Canada. She has a passion for solving problems and gets energised by opportunities that require critical thinking, building new systems, storytelling, communicating with diverse audiences, leadership and project management. Emergency Response Africa is a healthcare technology company that is changing how medical emergencies are managed in Africa, beginning in Nigeria. By combining training, technology, and transportation, they are creating a scalable emergency medical services system. They are building the largest network of First Responders, emergency response vehicles, and verified Emergency-Ready hospitals across Nigeria who are connected to emergency victims using their technology application. This end-to-end subscription service ensures that in any medical emergency, they deliver the right level of care at the scene, and if needed, the patient is transferred to the most appropriate hospital for prompt treatment. Earlier in the year, Folake spent four days in San Francisco as part of the Silicon Valley Olympiad, a tour sponsored by the Japan International Cooperation Agency (JICA) as part of their Next Innovation with Japan (NINJA) start-up competition for Africa, with support from Double Feather Partners and 500 Global. Emergency Response Africa was one of seven Nigerian and Kenyan start-ups that attended the trip and what an experience it was. “As a founder, some of the best support and advice I have received has come from other founders, especially those who were further along. This trip was no different.” Folake said. The 5 things she learnt from the trip includes: You can engineer creativity and innovation, patience and persistence produce the greatest results, dig deep and build for long term, ask for help and be generous with yours and surround yourself with passionate people because “it is like getting a booster shot” she stated. Folake bagged a Master of Business Entrepreneurship and Technology – MBET from the University of Waterloo, a Certificate in Digital Marketing Management from Sheridan College (An intense employment bridging program designed for internationally experienced professionals, providing up-to-date knowledge and skills in business communications and project management), an MSc in Global Health and Development from UCL and a BSc in Biology from University of Oregon. Hadiza Ambursa Executive Director, Commercial, Access Bank Hadiza Ambursa was appointed Executive Director, Commercial Banking Division of Access Bank in November 2017. She has over two decades of banking experience from Guaranty Trust Bank and Access Bank. Her experience spans across transaction services, public sector, commercial banking and corporate finance. Prior to joining Access Bank in 2003, she was a Relationship Manager, Public Sector in Guaranty Trust Bank Plc. Ambursa graduated with a Bachelor of Science degree in Political Science from University of Jos in 1991 and obtained a Master’s Degree in Law and Diplomacy in 1996 from the same university. She subsequently attended Massachusetts Institute of Technology (‘MIT’) where she obtained a Master’s in Business Administration in 2009. She has attended several executive management development programmes in leading institutions, including Harvard Business School and MIT. She sits on the Boards of Access Bank Ghana Plc and Bank Directors Association of Nigeria. Yemi Keri Founder, Heckerbella Yemi Keri is the Chief Executive Officer of Heckerbella Limited, a digital transformation company. She is Chair, Non-Executive Director and Advisory Board member of various organisations, and an award-winning commercially minded technologist, with experience in the Information Technology and Telecommunications industries, operating at CEO and C-suite level across the public and private sectors. She is at the forefront of digital transformation to tackle business and social problems, recognised as one of the foremost Women in Technology in Nigeria to carve out a niche in the technology space, with over two decades of experience in both the public and private sectors. She is also a business development strategist, skilled at creating innovative business solutions to address organisational challenges and leverages on the use of technology as a catalyst for strategic growth. As CEO Heckerbella Limited, they are a digital transformation company, and a Partner at Holmen Consulting, an information technology consulting firm. She supports the iAspire Data Science Fellowship Program, an iDAF.ng flagship program that is training and preparing Nigeria’s bright minds to leverage artificial intelligence, and advanced machine, as well as deep learning concepts to tackle business and social problems. Prior to starting her entrepreneurial journey as the CEO of Heckerbella Limited, she held roles in executive management positions: the Consulting Head of IT at the National Pensions Commission (PENCOM), the General Manager for Information Technology and Enterprise Systems for NatCom Development and Investment Company Limited (trading as ntel), pioneer MD\/CEO of Edo state Directorate of Information Communications & Technology Agency (ICTA), and the Regional Manager, West Africa for SAP. Keri is passionate about creating endearing business opportunities and generational wealth through leveraging the limitless opportunities that information technology offers. With her expertise in technology and strategic business development, she has inspired many, men and women alike, to create indigenous technology companies. She has built an amazing career in information technology with a proven track record and is credited with creating the framework of the Information and Communication Technology (ICT) policy in Edo state, broadening the recognition of the values and acceptance of information technology into the public service, and the establishment of the first-ever Information Communications and Technology Agency – an enabler for the full delivery of e-governance in the state. This giant feat attracted several accolades locally and internationally. She is a global business consultant and an ardent advocate of women’s participation in Boardroom decision-making and having a voice at the table. She believes that talent and skills are major parameters in measuring performance. For her, a woman is as likely as a man to excel in any field if there is a level playing ground, given the excellent performance of women over the years in the corporate world. Dr OluToyin Akande-Ajala CEO of JBS Medicare Services Dr OluToyin Akande Ajala is a UK trained Consultant Geriatrician with over 27 years experience as a physician in the Geriatric Medicine in the UK’s NHS. She is the CEO of JBS Medicare Services, the leading private elderly healthcare service in Nigeria & the Founder\/MD of the newly founded JBS Gerontology Centre, Lekki, Lagos a hospital and specialist centre for the older age group. Her Foundation’s “Adopt a Gran” programme, caters for the underprivileged elderly in Nigeria & Subsaharan Africa. She is married to an Obstetrician\/Gynaecologist and is a mum of 4. She is an avid traveler and has been to the 7 continents (including Antarctica) and 67 countries. Oluwatoyin Onigbanjo Founder, Augustsecrets Nigeria Oluwatoyin Onigbanjo is passionately pushing impact in child nutrition, gender and family development. Oluwatoyin and her team are building an award-winning company; Augustsecrets Ltd with the mission to solve pressing child nutrition challenges using their creative and wholesome solutions. AugustSecrets Ltd is an award-winning company started by a young woman who had her child, Jaden, outside her country Nigeria. On returning, she bought all sorts of cereals and baby care items for the baby to be weaned at 6 months, but he later rejected them all. As a first time mum, she got frustrated as the child was starving, and then, this moved her to begin to find alternatives from every day African food crops to make homemade meals for her son. Alas! Jaden preferred all the natural, homemade ranges and grew healthy on them all. This attracted a lot more mums and caregivers who had picky eaters and fussy meal times to request for the natural cereals. As the demand grew, she engaged dieticians and nutritionists and was able to come up with an all-natural, nutritious cereal range; Jadens Cereals named after the baby. From selling to friends and family in 2017, today Jadens Cereals sells tonnes of packs from popular retail outlets and markets helping parents solve the frustration of feeding their babies right with more nutritious options from locally available crops like potatoes, rice, soya, and grains. The Cereals are also exported to all countries especially Ghana, UK and some parts of the USA. Joke Bakare Founder, Medplus Pharmacy Joke is the Founder of Medplus Pharmacy, Nigeria. She is a Fellow of the Pharmaceutical Society of Nigeria. Medplus is a leading health and beauty retailer chain pharmacy. The brand started in 1993 as Medicine Plus. In a bid to fulfil customer demand, the brand has metamorphosed to what is known today as Medplus. Medplus started with its first store at Adeola Odeku. Over the years, Medplus offerings has grown in terms of expertise and merchandise. With over 100 stores nationwide, their purpose is to help their customers live healthy, look beautiful and feel good. Their mission is to provide a holistic approach to healthcare; caring for the mind, body and spirit, and is committed to providing the best products, services and information possible. Ifedayo Durosinmi – Etti Founder of Herconomy Ifedayo Durosinmi – Etti is an author, entrepreneur and young global leader with over 10 years of management and leadership experience working in the fashion, marketing and manufacturing industries. Ife holds a first degree in Biochemistry and an MBA in Global Business. Prior to moving back to Nigeria in 2012, she worked with Arcadia Group Plc, a British multinational retailing company headquartered in London, and also worked at Aspire Acquisitions. Ifedayo joined Nigerian Breweries (Heineken Operating Company in Nigeria) as a Young African Talent (YAT) and transitioned to their Corporate Communications Department in the position of Corporate Social Responsibility and Sustainability Support Manager, where she successfully managed various corporate social responsibility and sustainability projects. Ifedayo is also an associate member of the Advertising Practitioners Council of Nigeria (APCON). In 2018, she was invited to Harvard University as a panellist, to discuss the role of women in democracy and how it impacts businesses in Africa, during their African Development Conference. She was recently appointed as a Youth Advisory Group Member for Solutions for Youth Employment (S4YE), a global coalition formed by the World Bank, aimed at providing catalytic support to employment and productive work for 150 million youth by 2030. Ifedayo was selected as a Mandela Washington Fellow in 2021, the flagship program of the U.S. Government, launched in 2014 for Young African Leaders. She was selected as a Global Shaper of the World Economic Forum and is currently the Project Lead for Startup Dome, a project launched to bridge the gender gap through the socio-economic empowerment of women in Nigeria. She is the proud founder of Herconomy (formerly called AGS Tribe), a community she developed driven by her own experience. Herconomy is a community for empowered women, combined with a financial platform, with a mission to empower women through financial services, capacity building, jobs and networking.","filter_flag":1}
