{"title":"Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap - Star Tribune","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5\" target=\"_blank\">Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Star Tribune<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap - Star Tribune","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5\" target=\"_blank\">Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Star Tribune<\/font>","source.href":"https:\/\/www.startribune.com","source.title":"Star Tribune","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Control\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Minnesota lake cabin owner Jim Nicholson knows the drill. When loons in the Brainerd lakes area start flocking together for their fall migration, it's time to pull his boat ashore near Outing and shrink-wrap it for winter. But as comforting as it is to seal his pontoon against the inevitable onslaught of snow and ice, it galls him every spring to remove the sky-blue film and jam it in the trash. \"How many football fields of this stuff get chucked into landfills every year?'' he asked. \"It must be some giant number.'' State Rep. Larry Kraft, DFL-St. Louis Park, puts the estimate at millions of pounds. He quietly introduced a boat wrap recycling bill near the end of the 2023 legislative session that will be watched in 2024 by manufacturers, marina operators, recycling advocates and boat owners. The bill (House File 3320) would require the producers to provide for the collection and recycling of the material, which has value for making new products out of its resin. Kraft said the proposed regulation is similar to Minnesota's successful \"producer responsibility\" stewardship program for the handling of leftover paint. \"It's hard for me to imagine there would be a lot of opposition to it,'' Kraft said of his bill, which he introduced May 13. \"It's a heckuva lot of plastic that right now is going to landfills across Minnesota.'' According to industry statistics cited by Kraft, Minnesota leads the nation in boats per capita with an estimated 14,500 vessels per 100,000 population. In 2022, boat registrations in the state totaled 822,450, second only to Florida. Of course, not all boats are shrink-wrapped for the winter; some are too small, and others are stored indoors. But Kraft estimates that 90% are big enough to be shrink-wrapped and that 25% to 40% of those get sealed, each with 15 to 40 pounds of plastic film. If 250,000 boats received 25 pounds of wrap — a moderate estimate — the waste would total 6.25 million pounds. Cindy Miller is the owner of Boat Doctor Up North, in Cass County. She runs a mobile shrink-wrapping service every fall, saving her clients indoor storage fees. Over the years, recycling options for the material have come and gone. There was a time when companies would pay for the discarded plastic. From there, the recycling market fell apart. For a time, companies would take the plastic free of charge, Miller said. Then, there was a nominal charge. Now, she said, boat owners dispose of the plastic at their own expense by throwing it in the garbage. \"I think it should be up to the manufacturers to put something in place,'' Miller said. \"Where we live, this plastic is not recyclable.'' Potential seen Gigi Jabbour of Minnetonka Marina gave a similar account of the decline in recycling options for boat wrap. Since about 2016, she said, there hasn't been a practical way in Minnesota to keep it out of the garbage stream. But Jabbour said her hopes were lifted at the Minneapolis Boat Show this year when she was introduced to a pilot project that has the potential for large-scale recycling of the blue and white sheets. Myplas, a $24 million plant in Rogers built by a South African company with the help of a coalition of Minnesota companies and the University of Minnesota, intends to recycle 90 million pounds of polyethylene packaging and film. Whether boat wrap will work as a raw material remains to be seen, but it would seem to work as an option for manufacturers if Kraft's bill is adopted by the Legislature. The bill would require each producer to operate a product stewardship program approved by the commissioner of the Minnesota Pollution Control Agency \"or enter into an agreement with a stewardship organization to operate on the producer's behalf.'' Paul Gardner, board chair of the Recycling Association of Minnesota, said Myplas has started to collect boat wrap. One of the challenges the plant faces is overcoming the used material's filth. \"Boat wrap is dirty,'' Gardner said. \"Whatever winter gives you is on there.'' In addition, the used material is often removed from boats and gathered from uncovered ground, adding to the mess. Still, too, he said, the collection would be seasonal — just once a year each spring. \"You want to have plentiful, even supplies of reasonable quality,'' he said. Regardless whether the Myplas facility will be the answer or how long it might take for boat wrap manufacturers to find a recycling solution, the proposed legislation will get people talking, Gardner said. \"People end up sitting down and saying, 'This material has [recycling] value,''' he said. \"Working through the supply chain mess is the key.'' Nicholson, the cabin owner, said he wouldn't mind paying a little extra for his annual supply of boat wrap if manufacturers passed on some of the cost to establish a lasting recycling solution. His tab for this year's wrap was $275. \"I would expect them to pass it along and not eat the cost,'' he said.","filter_flag":1}
