{"title":"DTC children’s food brand Little Spoon expands with breakfast SKUs, Oatly collaboration","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator-usa.com%2fArticle%2f2024%2f06%2f05%2fdtc-children-s-food-brand-little-spoon-expands-with-breakfast-skus-oatly-collaboration&c=18318945278976296505&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator-usa.com%2fArticle%2f2024%2f06%2f05%2fdtc-children-s-food-brand-little-spoon-expands-with-breakfast-skus-oatly-collaboration&c=18318945278976296505&mkt=en-us","summary":"Children’s food brand Little Spoon expands into breakfast with a range of new products, as it remains bullish on its direct-to-consumer (DTC) channel growth, company Co-founder and Chief Product ...","published":"Wed, 05 Jun 2024 06:31:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=5, tm_hour=6, tm_min=31, tm_sec=0, tm_wday=2, tm_yday=157, tm_isdst=0)","news_source":"Food","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"DTC children’s food brand Little Spoon expands with breakfast SKUs, Oatly collaboration","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Children’s food brand Little Spoon expands into breakfast with a range of new products, as it remains bullish on its direct-to-consumer (DTC) channel growth, company Co-founder and Chief Product ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Eco-friendly Production\" \"new products\"&format=rss","text":"“We have a wonderful feedback loop with our consumers because we are a direct-to-consumer brand. It is very easy for us to communicate with them, gather feedback, run surveys [and] really understand what they are looking for, and breakfast was a big gap for parents. It was a resounding point of feedback we were getting. Parents wanted their mornings to be easier [and] less hectic, and they wanted healthy options with protein that they can give their kids when they were running out the door. So, we are really answering that call,” Vranich said. Little Spoon adds breakfast options following parents' demands​ Founded in 2017 by Lisa Barnett, Michelle Muller, Ben Lewis and Vranich, Little Spoon offers organic baby and toddler foods, including Babyblends purees, finger foods for children transitioning to solid food (Biteables), ready-to-eat dinners for children, smoothies and snacks. Last year, Little Spoon raised funding from existing investors, against a $300 million valuation, for a total of $90 million across five rounds. Little Spoon is profitable today, and it does not \"really have a need to raise any money anytime soon,\" Vranich said. After hearing from customers and parents who were seeking quick breakfast options, Vranich and her team of six food scientists developed a line of breakfast products that could be prepared in 90 seconds or less. The new products will be exclusively on the brand’s website, starting at $6.49, and include: Pesto Eggs Biteable is a nut-free tray of cage-free scrambled eggs topped with parmesan, kale, diced apples and butternut squash cubes, providing 5 grams of protein per tray. Mini Classic Eggs + Sausage Biteable contains scrambled eggs, no-sugar-added pork sausage and cheese, providing 7 grams of protein per tray. The Classic Breakfast Plate features scrambled eggs, pork sausage, millet, sweet potato and carrot to provide 14 grams of protein per packaging. Additionally, Little Spoon will launch an overnight oat smoothie — available in Apple Cinnamon Swirl and Peach Berry Bliss flavors — on June 25 in collaboration with Oatly. \"Overnight oats are a wonderful breakfast option that many adults enjoy, [but] there are not a ton of overnight oats options marketed towards children. When we were thinking about how to bring this product to market, Oatley was an immediate idea for a lot of us in the office here. We are huge fans of Oatly at Little Spoon,” she said. Going beyond DTC: ‘Never say never’​ Despite many DTC-started brands pivoting to retail, Little Spoon is committed to growing its DTC business, Vranich said. However, Little Spoon has done several small-scale retail partnerships, including Pop Up Grocer in New York. “The direct-to-consumer business model and the consumer that we are catering to really makes sense. So, our customers are coming to us when they are having babies or just children. They are staying with us all the way into school age. ... When we look at how we are selling our products, having that one-to-one relationship — that direct relationship with our customer — to be able to really market products to them as their children are growing makes a lot of sense for us. In retail, never say never. I think there could be some interesting opportunities for us out there in the future,” Vranich said.","filter_flag":1}
{"title":"Watch on demand: How can plant-based protein win over consumers, retailers ‘burned’ by past experiences with the category?","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator-usa.com%2fArticle%2f2024%2f06%2f18%2fwatch-on-demand-how-can-plant-based-protein-win-over-consumers-retailers-burned-by-past-experiences-with-the-category&c=8240498833173844997&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator-usa.com%2fArticle%2f2024%2f06%2f18%2fwatch-on-demand-how-can-plant-based-protein-win-over-consumers-retailers-burned-by-past-experiences-with-the-category&c=8240498833173844997&mkt=en-us","summary":"25 Sep 2024 Wed Webinar Eco-friendly Production from Farm to Fork 26 Sep 2024 Thu Webinar New Tech and Novel Ingredients for a Sustainable Future On-demand webinars ...","published":"Tue, 18 Jun 2024 04:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=18, tm_hour=4, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=170, tm_isdst=0)","news_source":"Food","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Watch on demand: How can plant-based protein win over consumers, retailers ‘burned’ by past experiences with the category?","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"25 Sep 2024 Wed Webinar Eco-friendly Production from Farm to Fork 26 Sep 2024 Thu Webinar New Tech and Novel Ingredients for a Sustainable Future On-demand webinars ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Eco-friendly Production\" \"new products\"&format=rss","text":"According to data from Circana crunched by 210 Analytics, unit and volume sales of plant-based meat continued to fall double-digits in March 2024 as they have for the nearly two years. In March, unit sales of plant-based meat fell 10.3% to $17.2m and volume sales in pounds fell 10.6% to $13.1m. Dollar sales fell 8.3% to 104.7m in the five weeks ending March 31 over the same period a year ago. Figures for the full year were even steeper with dollar sales for the 52 weeks ending March 31 dropping 12% year-over-year and unit sales sliding 16.6%. “Winding the clock back, the big challenge was the spread between what was promised and what was delivered … was pretty big. So, you ended up with products that maybe did not taste as good or were not as healthy for you” as their animal counterparts and when combined with plant-based products’ premium pricing “a perfect storm of dissatisfaction with consumers” emerged, Eben Bayer, co-founder of plant-based bacon brand MyForest Foods, said during FoodNavigator-USA’s webinar Plant-based 3:0: Emerging from the trough of disillusionment​, ​ which is now free to watch on demand. He explained that consumers who were willing to try plant-based proteins once, are now hesitant to do so again. In response to sluggish sales, retailers are cutting back on how many plant-based meat products they carry. Analysis of Circana data by 210 Analytics from the same period shows retailers carried an average of 10 to 11 refrigerated meat alternatives per store, which was down 14% year-over-year. This SKU rationalization is compounding the downward sales of plant-based meat because consumers cannot find the products they want in stores as easily – if at all, explained Julie Emmett, vice president of marketplace development at the Plant Based Foods Association and Plant Based Foods Institute. What will it take to earn back the trust of consumers?​ The first step in convincing consumers to take another chance on plant-based proteins is to create “a great product,” that delivers on the taste and nutrition consumers want at a price point they deem reasonable, said Annie Ryu, CEO of Jack & Annie’s, which makes a range of jackfruit-based meat alternatives. “It starts with having great tasting foods. We went to market with foods that we are incredibly proud of and got consumer feedback proactively and addressed the different areas where people wanted us to make changes,” she said. A common request she heard from consumers is they wanted plant-based products made with whole foods and ingredients that they recognized – two demands that Jack & Annie’s easily meets as each product is made with minimally processed jackfruit, which the company explains in marketing materials and on packaging is a common plant that has been enjoyed as a meat alternative for thousands of years with minimal processing. “Jackfruit is capable of replicating foods that are typically made from beef, pork, chicken and seafood,” in part because it has a texture that is “naturally similar to meat,” she said. Using jackfruit as a base also allowed Jack & Annie’s to “get through some of the confusion that has impacted [the category] about consumers wondering what these foods are really made of and how are they made, because we started a whole education process about jackfruit before these questions really arose,” she said. MyForest Foods likewise is able to bypass consumer concerns about over-processing by offering whole cut, organic mushroom root products that are grown on a farm, said Bayer. The clean ingredients in Jack & Annie’s and MyForest Foods also allows them to deliver nutritional values that consumers want – including fiber and protein with less saturated fat. Winning over retailers requires a strong business case​ As for winning back the trust of retailers, and convincing them to stock a new or reformulated plant-based protein, Andrew Bluestein, co-founder and managing partner at Bluestein Ventures, advised manufacturers to complement “great products” with an equally compelling sales data story. “You have to get a great product and you have to communicate to the retailers why your product is great, why it is different, what is unique about it, why does it need what consumers are looking for,” said. Brands need to pair that with data that shows they will be successful at retail, such as growth from direct-to-consumer sales or a promotion and marketing program that shows how they will drive velocities or how carrying their product might lead to an increase in complementary products – such as a plant-based condiments, pre-made sides from the deli or other items that round-out a meal. “Go back to those fundamentals. It is not just about, ‘Hey, we have got these great things going on online – all these great celebrity influencers who maybe come some notice. At the end of the day it is about … how do I make sure [the product] is shining on shelf and how do I get it off the shelf? I think some of those things are … demos, promotional programs, great packaging,” he added. Emmett encouraged retailers to proactively work with plant-based meats to create a merchandising strategy that benefits the overall category. This could include in-store signs, consistent placement or grouping products together alongside animal-based offerings so that consumers can see the full range of options. Discover how else brands and retailers are leveraging storytelling, technological advancements and other strategies to drive innovation and consumer engagement around plant-based meat by watching on demand for free FoodNavigator-USA’s webinar Plant-based 3.0: Emerging from the trough of disillusionment​. Get all the details and watch online HERE​. ​","filter_flag":1}
{"title":"Butyl Rubber Market Poised For Steady Growth Driven By Automotive And Pharmaceutical Demands","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fmenafn.com%2f1108351068%2fButyl-Rubber-Market-Poised-For-Steady-Growth-Driven-By-Automotive-And-Pharmaceutical-Demands&c=10046537525723012124&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fmenafn.com%2f1108351068%2fButyl-Rubber-Market-Poised-For-Steady-Growth-Driven-By-Automotive-And-Pharmaceutical-Demands&c=10046537525723012124&mkt=en-us","summary":"Growth Opportunities: Innovation in Green Butyl Rubber: Developing and adopting eco-friendly production processes and bio-based ... and introducing new products and solutions. Some major players ...","published":"Wed, 19 Jun 2024 11:45:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=19, tm_hour=11, tm_min=45, tm_sec=0, tm_wday=2, tm_yday=171, tm_isdst=0)","news_source":"Mena FN","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Butyl Rubber Market Poised For Steady Growth Driven By Automotive And Pharmaceutical Demands","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Growth Opportunities: Innovation in Green Butyl Rubber: Developing and adopting eco-friendly production processes and bio-based ... and introducing new products and solutions. Some major players ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Eco-friendly Production\" \"new products\"&format=rss","text":"(MENAFN- EIN Presswire) Emergen Research Logo The global butyl rubber is expected to witness continued growth in the coming years, fueled by its versatility and unique properties VANCOUVER, BRITISH COLUMBIA, CANADA, June 19, 2024 \/EINPresswire \/ -- The global butyl rubber market is expected to witness continued growth in the coming years, fueled by its versatility and unique properties. According to a recent report by Emergen Research, the market size is projected to reach USD 5.30 billion by 2032, growing at a steady CAGR of 5.1%. This press release delves into the key trends, drivers, restraints, and opportunities shaping the butyl rubber market landscape. Market Overview: Butyl rubber, also known as isobutylene-isoprene rubber (IIR), is a synthetic rubber known for its excellent air impermeability, elasticity, and resistance to chemicals and aging. It finds application in various industries, including: Automotive: Inner tubes, tire liners, hoses, and seals Construction: Sealants, roofing membranes, and waterproofing materials Pharmaceutical: Stoppers for vials and bottles Food Packaging: Food contact liners and closures Medical Devices: Catheters and tubing You Can Download Free Sample PDF Copy Of This Report@ Key Trends and Drivers: Rising Automotive Demand: The increasing production of passenger vehicles and commercial trucks, particularly in emerging economies, is driving the demand for butyl rubber in tire inner liners and tubes. Electric Vehicle Boom: The growing popularity of electric vehicles (EVs) is expected to create new opportunities for butyl rubber in high-voltage battery components due to its superior electrical insulation properties. Focus on Sustainability: The development of bio-based butyl rubber alternatives aligns with the growing focus on sustainable materials, potentially opening new avenues for market expansion. Expanding Pharmaceutical Industry: The global expansion of the pharmaceutical industry is expected to lead to a rise in demand for butyl rubber stoppers, which offer excellent gas barrier properties for medication storage. Restraints and Challenges: Fluctuating Raw Material Costs: The volatile nature of petroleum-based feedstocks, the primary raw material for butyl rubber production, can impact production costs and market stability. Environmental Regulations: Stringent regulations on volatile organic compounds (VOCs) emissions during manufacturing pose a challenge for producers. Growth Opportunities: Innovation in Green Butyl Rubber: Developing and adopting eco-friendly production processes and bio-based alternatives can unlock new market segments and address environmental concerns. Expansion into Emerging Markets: Growing infrastructure and industrial development in regions like Asia Pacific present lucrative opportunities for butyl rubber manufacturers. Technological Advancements: Research and development efforts to enhance the performance and versatility of butyl rubber can create new applications across different industries. Find More Competitor in TOC with Profile Overview Share Growth Analysis @ Market Insights and SWOT Analysis: Strengths: Superior air impermeability and gas barrier properties Excellent resistance to chemicals and aging High elasticity and flexibility Broad range of applications across industries Weaknesses: Dependence on volatile petroleum-based feedstocks Susceptibility to fluctuations in raw material prices Environmental concerns regarding VOC emissions Opportunities: Development of bio-based and eco-friendly butyl rubber alternatives Rising demand from the automotive and pharmaceutical sectors Expansion into emerging economies Threats: Stringent environmental regulations on VOC emissions Technological advancements in alternative materials Fluctuations in the global economic climate Butyl Rubber Top Companies and Competitive Landscape The global butyl rubber market is fragmented, with several key players accounting for the majority of market revenue. Major players are deploying various strategies, entering mergers & acquisitions, strategic agreements & contracts, developing, testing, and introducing new products and solutions. Some major players included in the global butyl rubber market report are: LANXESS Exxon Mobil Corporation SIBUR Holding PJSC JSR Corporation China Petroleum & Chemical Corporation Reliance Industries Limited Zhejiang Cenway Materials Co., Ltd. Royal Adhesive Industries Vip Rubber Co., Inc. Hallstar THE RUBBER COMPANY BRP Manufacturing Eswar Rubber Products Pvt. Ltd. Strategic Developments On 15 August 2023, The Global Platform for Sustainable Natural Rubber (GPSNR) revealed that Sri Trang Agro-Industry (STA) has become the group's latest member within the producers, processors and traders category. STA has become part of GPSNR to work toward the sustainable and equitable production of natural rubber at scale. The firm has rubber plantations covering approximately 7,000ha in 19 provinces in Thailand. On 10 August 2022, Quanex released a new moisture protectant for solar panels that solar panel manufacturers can apply during the final manufacturing process. SolarGain Edge Sealant LP03 is a polyisobutylene butyl rubber adhesive with integrated desiccant. Preventing moisture ingress in solar modules, Solar Gain Edge Sealant helps better protect cells, connections, and conductive coatings to maximize performance and longevity. Quanex suggests an additional 10 to 15 years of useful life can be added to a solar panel with use of its sealant. Butyl Rubber Market Segment Analysis For the purpose of this report, Emergen Research has segmented the global butyl rubber market on the basis of rubber type, application, and region: Rubber Type Outlook (Revenue, USD Billion; 2019-2032) Regular Butyl Bromo Butyl Chloro Butyl Application Outlook (Revenue, USD Billion; 2019-2032) Tires and Tube Pharmaceuticals Adhesives and Sealants Industrial and Medical Gloves Others Request For Customization Country scope U.S., Canada, Mexico, Germany, U.K., France, Spain, BENELUX, Rest of Europe, China, India, Japan, South Korea, Rest of APAC, Brazil, Rest of LATAM, Saudi Arabia, UAE, Israel, and Rest of MEA Eric Lee Emergen Research +91 90210 91709 ... Visit us on social media: Facebook Twitter LinkedIn","filter_flag":1}
{"title":"Do consumers believe ‘better-for-you’ marketing on snacks?","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator.com%2fArticle%2f2024%2f06%2f10%2fdo-consumers-believe-better-for-you-marketing-on-snacks&c=11822669141332470602&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator.com%2fArticle%2f2024%2f06%2f10%2fdo-consumers-believe-better-for-you-marketing-on-snacks&c=11822669141332470602&mkt=en-us","summary":"These are often referred to as functional foods and they are EVERYWHERE! But do consumers trust the slew of new products on the shelves and, if not, what can brands do to win them over? Functional ...","published":"Mon, 10 Jun 2024 01:32:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=10, tm_hour=1, tm_min=32, tm_sec=0, tm_wday=0, tm_yday=162, tm_isdst=0)","news_source":"FoodNavigator","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Do consumers believe ‘better-for-you’ marketing on snacks?","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"These are often referred to as functional foods and they are EVERYWHERE! But do consumers trust the slew of new products on the shelves and, if not, what can brands do to win them over? Functional ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Eco-friendly Production\" \"new products\"&format=rss","text":"The wellness trend is in full swing, in fact, it’s everywhere! From the gut health​ trend, aimed at overall wellbeing, to elimination diets​, designed to identify food intolerances, the concept of ‘food as medicine’ has never been so popular. And where consumers lead, brands quickly follow, resulting in a whole range of products dedicated to improving health in one way or another. These are often referred to as functional foods and they are EVERYWHERE! But do consumers trust the slew of new products on the shelves and, if not, what can brands do to win them over? What are functional foods?​ Functional foods are foods, which claim to have an additional function, through the addition of particular ingredients. These functions typically relate to the promotion of better health. The term, functional food, can also apply to traits purposely bred into edible plants, such as purple potatoes, which have been modified to increase anthocyanin. Do consumers trust ‘better-for-you’ marketing on snacks?​ Trust in the food industry has seen a steady decline in recent years, with a recent report from EIT Food Consumer Observatory​, finding that just 46%, of consumers surveyed, trust food manufacturers​. Furthermore, only 44% believe the foods they are consuming, are healthy​. But likely, the most concerning statistic for the food industry is the fact that 27% of consumers actively distrust food manufacturers​. Consumer trust is essential to the success of any brand, so the news that consumer trust in the food industry is poor, and continuing to decline, will be make many in the food industry uneasy. Many consumers are paying much closer attention to the ingredients list on the back of a product to determine if a product is healthy. GettyImages\/SDI Productions So what about consumer trust in ‘better-for-you’ snacks? “There is definitely a certain level of confusion and mistrust surrounding nutritional and health claims on packaging,” Dr Sara de Pelsmaeker, group health and wellbeing director of ingredients supplier Puratos, told FoodNavigator. “Seventy-five percent of consumers look for product information on packaging, and in many cases, are also using it to judge how 'healthy' the product is.\" And it’s this focus on information displayed on packaging, which is starting to raise questions for consumers, and ultimately, cause issues for manufacturers. Consumers may pick up a product based on the health claims on the front, and then place it back down when they read the ingredients list on the back. This is particularly true when the list of ingredients is longer than five items, as the ‘clean label’ movement gains popularity. So how is the food industry helping consumers to understand the nutritional value of a product? What is the ‘clean label’ movement?​ Though there is no official definition, ‘clean label’ is the concept of making a product using as few ingredients as possible, and ensuring those ingredients are ones that consumers recognise. These will ideally be ingredients that consumers would themselves use when cooking at home. How is the food industry improving nutritional transparency?​ The food industry is being increasingly regulated and, as a result, health claims must be backed up by facts. “Front-of-pack labelling is now used by food producers in around 40 countries, either voluntarily or because they are legally required to do so,” explains Pelsmaeker. “These schemes serve two purposes, providing shoppers with more information to make healthier choices and encouraging the industry to develop more nutritionally balanced foods. Better transparency of ingredient lists means brands can no longer rely on the 'health halo' of a single ingredient. To help rebalance fat, sugar and salt content, the approach should be a 'proactive', health-centred reformulation exercise, to both improve products and restore consumer trust.” There is also additional certification, which brands can apply, and work to qualify, for. “Where confidence may have dwindled, signifiers such as the B Corp certification help maintain trust,\" Jackie Wilson, Kallø brand controller at Ecotone UK, told FoodNavigator. Nutritional information labelling, such as Nutri-Score, are helping to make the nutritional rating of a product clearer for consumers. It has been recommended for use by the European Union and the World Health Organization. GettyImages\/Viktoriia Ablohina What is the future of ‘better-for-you’ snacking?​ Many consumers are making a return to seasonal eating and buying local​, as a means to fully understand the provenance of their food. And it appears this trend is being echoed when it comes to having a better understanding of the contents of the foods they’re eating. “According to our Taste Tomorrow research, 71% of consumers are more likely to buy from bakeries where everything is made with natural ingredients,” explains Puratos’ Pelsmaeker. “This demonstrates the demand for cleaner label finished goods and more transparency about nutritional information, and the snacking industry must evolve to meet these consumer demands.” But when products are bought from supermarkets, communication with consumers needs to be clear and concise. “The future of the food industry needs clear, consistent and visible labelling of ingredients and nutritional profiles to draw consumers to the products they can trust,” adds Kallø's Wilson. Governments are also going further to, not only encourage, but work with food manufacturers, to reduce fat, sugar and salt​ levels in foods. But the challenge comes in ensuring those foods are still tasty. “Ultimately, of course, we’re aiming for healthy snacks that don’t compromise on indulgence,” says Pelsmaeker. This sentiment is echoed by Kallø's Wilson. “Taste will continue to be a priority to consumers – and something you can’t lose sight of within better-for-you snacks. It will continue to lead innovation with eight out of 10 people looking for new flavours within snacking.” These developments all represent a step in the right direction, but whether food brands can regain consumer trust remains to be seen. Watch this space!","filter_flag":1}
{"title":"How brands are capitalising on gut health","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator.com%2fArticle%2f2024%2f06%2f20%2fhow-brands-are-capitalising-on-gut-health&c=8651786818832588063&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf92ba443c6b59cc9bc55666fa8&url=https%3a%2f%2fwww.foodnavigator.com%2fArticle%2f2024%2f06%2f20%2fhow-brands-are-capitalising-on-gut-health&c=8651786818832588063&mkt=en-us","summary":"comes some true innovation. Firms across the world are developing new products to support the gut health of people of all ages. Dutch ingredients start-up, NutriLeads , is exploring the gut health ...","published":"Thu, 20 Jun 2024 01:38:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=1, tm_min=38, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"FoodNavigator","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How brands are capitalising on gut health","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"comes some true innovation. Firms across the world are developing new products to support the gut health of people of all ages. Dutch ingredients start-up, NutriLeads , is exploring the gut health ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Eco-friendly Production\" \"new products\"&format=rss","text":"The gut health trend is here to stay​. And unlike other trends (plant-based​ I’m looking at you) it shows no signs of slowing. So why is the gut health trend so successful and how have manufacturers turned it into the gold mine it’s become? Why has the gut health trend become so popular?​ By now, many are acquainted with terms like microbiome and probiotics (we’ve included a factbox below, if you’re unfamiliar). In fact, for some consumers, these terms have entered into common parlance in a way few would have predicted just a decade ago. According to the International Probiotics Association (IPA) 63% of European consumers surveyed knew what probiotics and probiotic foods were. “We live in a time where a simple Google search for ‘probiotics products’ shows over 94 million hits,” says a spokesperson for the IPA. “The probiotics market continuously expands with the globalisation of online sales, and probiotics are increasingly popular and widely advertised on the Internet.” And this is not limited to Europe alone. Figures from market research firm, Mintel, show that nearly three in five US adults say they try to eat foods that encourage a healthy gut. Furthermore, market research firm, Marketresearch.biz, estimates that the global digestive health products market will reach a value of approximately 94.4 billion USD within the next decade (2032). Kombucha can be made at home, but multiple brands are also launching their own versions. GettyImages\/NatalyaStepowaya So why has gut health become so popular? Many consumers first became aware of the concept of gut-friendly food and beverage products with the launch of probiotic milk drinks such as Yakult, Actimel and Muller Vitality back in the 1990s. “Consumer understanding of gut health has grown significantly in recent years, and we attribute this to various factors,\" Reshma Patel, marketing manager at Yakult UK, told FoodNavigator. \"While probiotics have been recognised globally for some time, it’s only relatively recently that scientific advancements have highlighted the profound impact of gut health on overall wellbeing. It extends way beyond digestion, with growing evidence revealing the interconnection of the body's major organs, with the gut at the centre of this intricate system. Another driving force has been a cultural shift towards preventive health measures rather than just focusing on cure. People are being increasingly proactive in maintaining their health, rather than waiting for diseases or illnesses to strike.\" Since then, consumer interest and understanding has grown exponentially. One of the potential reasons for this is the increase in gastrointestinal issues. “Current data suggest that the incidence and prevalence of these GI disorders, which includes the most common functional disorders, are generally increasing, with the highest rates reported in eastern European countries and in less affluent parts of western Europe,” explains a spokesperson for United European Gastroenterology (UEG). Moreover, figures from UEG show that gastrointestinal and liver disorders are responsible for around one million deaths across Europe each year and are associated with substantial morbidity and healthcare costs. Fermented drinks, such as kefir, have become popular with gut health enthusiasts. GettyImages\/minoandriani How have manufacturers monetised gut health?​ It’s no surprise that where consumers lead, food and beverage manufacturers follow, and when it comes to gut health, follow they have… in a big way. From gut-friendly drinks to gut-friendly flapjacks, the food and beverage industry is awash with gut-friendly products. But along with the perhaps less legitimate gut health marketing claims (mentioning no names!), comes some true innovation. Firms across the world are developing new products to support the gut health of people of all ages. Dutch ingredients start-up, NutriLeads​, is exploring the gut health potential of carrots, while British start-up, Little Inca​, is developing products to support the gut microbiota of infants, with quinoa-based baby foods. “Over the last ten years the patents and filings related to food and drink with probiotics added to them has just soared,” Mintel's Miller said during a recent Fi Webinar Series. “We’ve seen an exponential growth of probiotic infused products.” Sourdough bread has become a firm favourite amongst bread fans and it comes with the added benefit of being gut friendly. GettyImages\/alvarez What’s next for the gut health trend?​ The gut health trend is on the up and up​, with consumer interest, understanding, and demand for gut-friendly products, continuing to grow. “Gut health really is an important area within food and drink, particularly functional food and drink,\" says Rick Miller, associate director for specialised nutrition at market research firm Mintel. \"It’s moving away from the common areas that we would have associated with gut health in food and drink, which is functional and clinical management and moving into the everyday gut health support, so for conditions like functional bloating and irritable bowel syndrome.”","filter_flag":1}
