{"title":"UPM Specialty Papers and Lohmann join forces to uplift design for recycling for tape products - Packaging Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy91cG0tc3BlY2lhbHR5LXBhcGVycy1hbmQtbG9obWFubi1qb2luLWZvcmNlcy10by11cGxpZnQtZGVzaWduLWZvci1yZWN5Y2xpbmctZm9yLXRhcGUtcHJvZHVjdHMvMTA1NDUuYXJ0aWNsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy91cG0tc3BlY2lhbHR5LXBhcGVycy1hbmQtbG9obWFubi1qb2luLWZvcmNlcy10by11cGxpZnQtZGVzaWduLWZvci1yZWN5Y2xpbmctZm9yLXRhcGUtcHJvZHVjdHMvMTA1NDUuYXJ0aWNsZdIBAA?oc=5","id":"CBMijAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy91cG0tc3BlY2lhbHR5LXBhcGVycy1hbmQtbG9obWFubi1qb2luLWZvcmNlcy10by11cGxpZnQtZGVzaWduLWZvci1yZWN5Y2xpbmctZm9yLXRhcGUtcHJvZHVjdHMvMTA1NDUuYXJ0aWNsZdIBAA","guidislink":false,"published":"Tue, 31 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=304, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy91cG0tc3BlY2lhbHR5LXBhcGVycy1hbmQtbG9obWFubi1qb2luLWZvcmNlcy10by11cGxpZnQtZGVzaWduLWZvci1yZWN5Y2xpbmctZm9yLXRhcGUtcHJvZHVjdHMvMTA1NDUuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">UPM Specialty Papers and Lohmann join forces to uplift design for recycling for tape products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UPM Specialty Papers and Lohmann join forces to uplift design for recycling for tape products - Packaging Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy91cG0tc3BlY2lhbHR5LXBhcGVycy1hbmQtbG9obWFubi1qb2luLWZvcmNlcy10by11cGxpZnQtZGVzaWduLWZvci1yZWN5Y2xpbmctZm9yLXRhcGUtcHJvZHVjdHMvMTA1NDUuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">UPM Specialty Papers and Lohmann join forces to uplift design for recycling for tape products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","source.href":"https:\/\/packagingeurope.com","source.title":"Packaging Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Design for recycling\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"A partnership between Lohmann and UPM Speciality Papers aspires to drive the tape industry’s progress in designing paper liners for recycling with new products and closed-loop solutions. Liner recycling has proven to be a challenge for the tape industry, UPM explains. Siliconized release liners with a darker brown shade have become a roadblock to recycling adhesive tape liners, as recycling them alongside white or light-shaded glassine streams causes contamination. On the other hand, recycling them separately is not thought to be economically viable due to their comparatively small volume. In response, Lohmann introduced DuploCOLL ECO, its bio-based and solvent-free tape line. It seeks to provide equal performance in its white paper liner as standard darker alternatives, enabling the highest possible quality for recycling. Building on closed-loop paper liner recycling solution UPM LinerLoop, the collaboration also aligns with Lohmann’s strategy to develop sustainability-minded adhesive technologies. UPM LinerLoop and other established paper and paperboard recycling streams are expected to provide a drop-in solution to help Lohmann improve the recyclability of liner waste – keeping fibres in the recycling loop for as long as possible and drive down the consumption of primary resources. This comes alongside other measures to cut down on waste, increase packaging reusability, and achieve recyclability for more products and product components. UPM Specialty Papers also places emphasis on industry collaboration and designing for recycling, which are hoped to lead to robust recycling infrastructure for paper products. “We were aware that the recycling of liners needs to be on our sustainability action plan,” says Evert Smit, director Scouting at Lohmann. “We wanted to make the first move and set a new standard for our industry and now, in cooperation with UPM Specialty Papers, we hope that others in the tape industry will follow suit and promote sustainability as a collective.” “We are delighted to have been able to support Lohmann in removing the obstacles for recycling of paper liners in the tape industry,” adds Mikko Rissanen, director of Technology at UPM Specialty Papers. Earlier this year, tesa released its certified recyclable 60408 packaging tape – featuring a paper-based backing, natural rubber adhesive, and bio-based resin with a total bio-based carbon content of 92%. Meanwhile, Fedrigoni Self Adhesives sought to upcycle the discarded glassine backing of self-adhesive products into its Re-Play premium labelling solution. If you liked this article, you might also enjoy: The L’Oréal approach to packaging sustainability What steps is Apple taking to make its packaging more sustainable? How did Brazil achieve its 100% aluminium can recycling rate – and can it be replicated in the EU? Experts have their say on the EU’s Packaging and Packaging Waste Directive revisions Also, if you’re interested in packaging sustainability, you will want to attend our Sustainable Packaging Summit in Amsterdam on 14-15 November. The Summit brings together leaders and pioneers from across the industry to align strategically, learn, network, and create a critical mass to accelerate change. You can learn more by clicking here, and you can buy a ticket to attend here.","filter_flag":1}
{"title":"Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts - RecyclingPortal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5","id":"CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5\" target=\"_blank\">Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RecyclingPortal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts - RecyclingPortal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcmVjeWNsaW5ncG9ydGFsLmV1L0FyY2hpdmUvODE1NTfSAQA?oc=5\" target=\"_blank\">Plastic Recycling Industry at Crossroads: Uncertainty and Shrinking Demand Shifts<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RecyclingPortal<\/font>","source.href":"https:\/\/recyclingportal.eu","source.title":"RecyclingPortal","query":"https:\/\/news.google.com\/rss\/search?q=\"Design for recycling\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The European plastic recycling industry is facing pressing challenges as the demand for recycled polymers dwindles to its lowest point in recent years. The lack of manufactures’ commitment to introduce recycled material in new products and the growing imports from third countries are the main obstacles to the circularity of European plastic waste and to the development of the European recycling industry. On top of that, like numerous other industries, the recycling sector is not immune to the surrounding economic uncertainties and the ongoing inflation crisis. Hence, decisive, and bold policy measures are required to support one of Europe’s key industries for transitioning to a circular and carbon-neutral economy. Setting mandatory recycled content targets has proven to be an effective and valuable tool to boost the uptake of recycled materials and increase the recycling capacities in Europe. Indeed, the recycling capacity witnessed a 17% growth in 2021 only in EU27+3 [1] and almost doubled over a 5-year period, with substantial investments and innovation accelerating in the sector. However, for the potential benefits of the recycled content mandate to materialize fully, it must be accompanied by robust mechanisms ensuring traceability, accurate accounting, and rigorous verification of recycled polymers. “Recycling companies across Europe are investing in new equipment to both upgrade the recyclates and increase the recycling capacities. Our industry is taking its full share of the effort to the transition towards more circular and carbon-neutral plastic value chains. However, European plastic recyclers are currently operating well below their full capacity due to insufficient demand. This situation questions investments made by European recyclers to meet carbon-neutrality and circularity targets, as well as it questions recycler’s future ability to invest more” commented Sophie Sicard, President of EPRB, EuRIC’s Plastics Recycling Branch. EuRIC calls for urgent measures to support plastics recycling in Europe: Implementation of pragmatic mandatory EU recycled content targets for plastics to stimulate demand for recycled materials and secure investments to scale up recycling capacity in Europe. Strong mechanisms for verification and traceability of recycled polymers, to protect the European recycling industry from unfair competition and fraudulent import. When quantifying recycled plastic content, mandatory third-party certifications are needed to preserve the transparency and credibility of the industry. Introduction of incentives, whether market or tax-based, to bridge the price gap between virgin and recycled plastics. For instance, fiscal incentives in the form of lower VAT rates for products made of recycled plastics can have a significant impact on stimulating recycling. Mandatory collection targets and design-for-recycling criteria to enhance the quantity and quality of inputs to recycling processes. The European plastic recycling industry faces a defining moment; either we recycle the challenges into opportunities or let our future go to waste. It’s time to repackage commitment, shape bold policies, and recycle our way to a circular, carbon-neutral era. Source: EuRIC [1] EU27+3: European Union Member States, Norway, Switzerland, and United Kingdom","filter_flag":1}
{"title":"Tetra Pak Sustainability Report FY22 Collection & Recycling - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4Njk3MS10ZXRyYS1wYWstc3VzdGFpbmFiaWxpdHktcmVwb3J0LWZ5MjItY29sbGVjdGlvbi1yZWN5Y2xpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4Njk3MS10ZXRyYS1wYWstc3VzdGFpbmFiaWxpdHktcmVwb3J0LWZ5MjItY29sbGVjdGlvbi1yZWN5Y2xpbmfSAQA?oc=5","id":"CBMiZ2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4Njk3MS10ZXRyYS1wYWstc3VzdGFpbmFiaWxpdHktcmVwb3J0LWZ5MjItY29sbGVjdGlvbi1yZWN5Y2xpbmfSAQA","guidislink":false,"published":"Fri, 27 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=300, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4Njk3MS10ZXRyYS1wYWstc3VzdGFpbmFiaWxpdHktcmVwb3J0LWZ5MjItY29sbGVjdGlvbi1yZWN5Y2xpbmfSAQA?oc=5\" target=\"_blank\">Tetra Pak Sustainability Report FY22 Collection & Recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tetra Pak Sustainability Report FY22 Collection & Recycling - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4Njk3MS10ZXRyYS1wYWstc3VzdGFpbmFiaWxpdHktcmVwb3J0LWZ5MjItY29sbGVjdGlvbi1yZWN5Y2xpbmfSAQA?oc=5\" target=\"_blank\">Tetra Pak Sustainability Report FY22 Collection & Recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Design for recycling\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Published 10-27-23 Submitted by Tetra Pak Aectual x Tetra Pak concept line Measuring recycling value In line with our ambitions and strategy to grow recycling of all materials in collected carton packages, in addition to measuring carton package collection, we are also monitoring how the materials get effectively recycled. We are doing this by estimating a global gross effective recycling rate, deducting the non-recycled polyAl from the volume of cartons collected for recycling. In 2022, we estimate the global gross effective recycling rate5 to be 20%, which equals to 1 million tonnes of materials in post-consumer carton packages effectively being recycled. This can be compared to a 25% global carton package collection rate6. To increase the effective recycling rate, we are focusing on putting in place polyAl recycling capacities and develop end markets for recycled polyAl. In 2022, 1.2 million tonnes of carton packages were collected and sent for recycling. Out of that, the estimated amount of polyAl sent to recyclers was more than 100 kilo tonnes. READ MORE Our company is producing transportation pallets made entirely from recycled plastics. Part of the recycled plastics that we use comes from the recycling of beverage cartons. Recycled polyAl from beverage cartons presents functional characteristics that are similar to recycled polyolefins, while offering the extra advantage of a shiny look. Samuela Niboli, Plant manager of Valsir Recycling Division Accelerating recycling locally Our dedicated team of 70 recycling experts stationed at locations around the world works to activate, accelerate, and transform the collection and recycling of carton packages. Every day, they collaborate with recyclers, local authorities, and customers to provide insights on efficient collection and sorting schemes, and to co-invest with industrial partners in the recycling value chain. In 2022, there were approximately 200 recycling facilities for carton packages. Recycling facilities that we collaborate with worldwide 103 fibre Fibre recycling facilities recycle fibres by hydrapulping 61 polyAl PolyAl recyclers recycle polyAl by injection moulding, for example 36 integrated Integrated recyclers recycle both fibre and polyAl (separately or together) Working with industry associations We collaborated with the Alliance for Beverage Cartons and the Environment (ACE) on the ‘Design for recycling’ guidelines for carton producers alongside other industry players. The guidelines provide producers of beverage cartons with technical guidance to identify the materials compatible with existing recycling processes and how the recyclability of paper-based beverage cartons can be optimised. ACE and EXTR:ACT highlight that collection is precondition to the recycling of any material. While local authorities usually drive and control waste collection infrastructures, Tetra Pak supports them by advising on most efficient collection schemes, and invests in increasing recycling capacities and end markets for recycled materials from used carton packages. We are an active member of 4evergreen, an alliance representing the entire lifecycle of European fibre-based packaging, from mono-material corrugated cardboard to composite food and beverage packaging. The goal of 4evergreen is to reach 90% recycling rate for all fibre-based packaging by 2030 in Europe. In 2022, the alliance released an initial draft of the Recyclability Evaluation Protocol, a test methodology established to ensure the suitability of packaging recycling in standard paper mills, as well as Circularity by Design Guideline for mono-material packaging processed in standard mills. In 2023, the alliance will publish guidance for multi-material packaging processed in specialised mills. In 2022, we invested nearly €30 million7 in different projects around the world to further increase the collection and recycling of used carton packages worldwide. Going forward, our ambition is to invest up to €40 million8 in collection and recycling projects around the world in support of our three goals: Contribute to achieving a 70% recycling rate carton package target in the European Union by 2030 9 . . Fulfil national recyclability criteria in all countries we sell packaging. Fulfil Ellen MacArthur Foundation’s (EMF) Global Commitment10. To deliver on these goals, we have defined three different areas of focus dependent on market conditions: Driving higher recycling performance In countries with an already mature waste management sector, we support systemwide action and cooperation, advocate for efficient legislation to guide optimized collection systems, and contribute to the acceleration and scaling of sorting and recycling capacities. In countries with an already mature waste management sector, we support systemwide action and cooperation, advocate for efficient legislation to guide optimized collection systems, and contribute to the acceleration and scaling of sorting and recycling capacities. Advancing and transforming the recycling value chain In countries with already existing waste management infrastructure, we facilitate the transformation and optimisation of the sector, including adequate recycling capacity, building structural advancements in waste collection and sorting capabilities, and help to prepare for potential future Extended Producer Responsibility (EPR) schemes. In countries with already existing waste management infrastructure, we facilitate the transformation and optimisation of the sector, including adequate recycling capacity, building structural advancements in waste collection and sorting capabilities, and help to prepare for potential future Extended Producer Responsibility (EPR) schemes. Activating collection and recycling In countries with a primarily informal waste management sector, we initiate new collection programmes, contribute to establishing sufficient recycling capacity, and build circular economy awareness. See the map to explore collection and recycling initiatives in 2022. Collection and recycling initiatives Driving higher recycling performance Advancing the recycling value chain Activating collection and recycling Supporting workers in collection and recycling READ MORE about each initiative Furniture made from recycled carton packages In 2022, we collaborated with Dutch design firm, Aectual, to create a series of furniture made entirely from polyAl. Launched at the Milan Design Fair in June 2022, the Aectual x Tetra Pak concept line includes stylish and functional stools, planters, wall panels, window screens and more - all 3D printed. The products are created using less materials, there’s no stock and production is on demand. After use, products are returned, shredded, and reprinted to create new products – reducing up to 600% of material over a 50-year period. Our recently opened offices in Tokyo, Japan, and in Dublin, Ireland, have several pieces of Aectual furniture, and this product line will also be used in our offices in Sweden, Singapore, and Italy in 2023. Aectual developed and is commercializing a range of design furniture made from the recycled plastics and aluminium content of carton packages. We are expanding the use of these products in our offices. It is part of our Future Work Experience strategy to ensure that we live up to our promise to protect food, people and the planet in our workplace every day. Sudhir Saseedharan, FREM Director of Workplace Experience & Real Estate READ MORE View the full FY22 Sustainability Report here. 1 Based on a global carton recycling rate of 25% and Tetra Pak sales of 193 billion packages, we estimate the 1.2 million tonnes of carton packages collected for recycling includes approximately 48 billion Tetra Pak carton packages. 2 For the reported carton packages collected for recycling we use, where available, official publicly available data from renowned sources such as governmental agency, registered recovery organization, nationwide industry association, NGO etc. reported on a regular basis using a consistent approach. 3 Paper-based carton packages are recyclable where adequate collection, sorting and recycling infrastructures are in place 4 The non-fibre component of carton packages is known as polyAl, which designates the layers of polyolefins and aluminium being used as barrier against oxygen and humidity to protect the food content in aseptic carton packages. 5 We estimate the gross effective recycling rate by deducing the non-recycled polyAl from the weight of carton package bales sent to recyclers. Any additional contaminants, impurities and moisture are not taken into account in this measure. 6 Reported carton packages collection rate is based on the share of cartons collected and sent for recycling versus cartons deployed. We use, where available, official publicly available data from renowned sources such as governmental agency, registered recovery organization, nationwide industry association, NGO etc. reported on a regular basis using a consistent approach. 7 Both operational and capital expenditures. Capital expenditures are a company's major, long-term expenditures while operating expenditures are a company's day-to-day expenditures. 8 Both Operating Expenditure (OPEX) and Capital Expenditure (CAPEX). 9 Collection increase depending on supporting policy implementation per EU member country. 10 The Global Commitment is led by the Ellen MacArthur Foundation, in collaboration with the UN Environment Programme. Through the Global Commitment, businesses and governments commit to change how we produce, use, and reuse plastic. They will work to eliminate the plastic items we don’t need; innovate so all plastic we do need is designed to be safely reused, recycled, or composted; and circulate everything we use to keep it in the economy and out of the environment.\" Source: https:\/\/ellenmacarthurfoundation. org\/global-commitment-2022\/overview","filter_flag":1}
{"title":"Navigating the new beauty and personal care packaging rules - CosmeticsDesign-Europe.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMC8yNS9OYXZpZ2F0aW5nLXRoZS1uZXctYmVhdXR5LWFuZC1wZXJzb25hbC1jYXJlLXBhY2thZ2luZy1ydWxlc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMC8yNS9OYXZpZ2F0aW5nLXRoZS1uZXctYmVhdXR5LWFuZC1wZXJzb25hbC1jYXJlLXBhY2thZ2luZy1ydWxlc9IBAA?oc=5","id":"CBMidWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMC8yNS9OYXZpZ2F0aW5nLXRoZS1uZXctYmVhdXR5LWFuZC1wZXJzb25hbC1jYXJlLXBhY2thZ2luZy1ydWxlc9IBAA","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMC8yNS9OYXZpZ2F0aW5nLXRoZS1uZXctYmVhdXR5LWFuZC1wZXJzb25hbC1jYXJlLXBhY2thZ2luZy1ydWxlc9IBAA?oc=5\" target=\"_blank\">Navigating the new beauty and personal care packaging rules<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Navigating the new beauty and personal care packaging rules - CosmeticsDesign-Europe.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMC8yNS9OYXZpZ2F0aW5nLXRoZS1uZXctYmVhdXR5LWFuZC1wZXJzb25hbC1jYXJlLXBhY2thZ2luZy1ydWxlc9IBAA?oc=5\" target=\"_blank\">Navigating the new beauty and personal care packaging rules<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-europe.com","source.title":"CosmeticsDesign-Europe.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Design for recycling\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"In 2024, new packaging rules are set to come into force in the EU. The EU Packaging and Packaging Waste Regulation (PPWR),​ which aims at reducing packaging pollution and building a circular economy for packaging, has an overall objective to ensure all packs are designed for recycling by January 1st, 2030, and recyclable five years later. Meanwhile, over in the UK there is a similar sustainable packaging initiative Extended Producer Responsibility (EPR)​, which has been delayed but is still set to be in force in 2025. Under these regulations, the financial contribution will need to be paid by brands for packaging they put on the market to cover the cost of collecting, sorting, and recycling. While it appears that FMCG companies have been given plenty of time to prepare, the clock is ticking. Beauty consumers’ appetite for new innovations and a constant flux of new and improved formulas are presenting a huge challenge when it comes to packaging sustainability. According to Gillian Garside-Wight, consulting director at packaging sustainability consultancy Aura, this accelerated speed to market and frequent product evolution are at odds with the core principles of sustainability, while ‘luxury’ beauty products with high-end packaging aren’t helping redress the balance. However, she said there is much more cosmetics brands can do to minimise their impact on the environment and satisfy consumers. “It is about reinventing packaging and exploring new ways,” ​she said. “The whole industry is concerned and must work together to meet their engagements.”​ Garside-Wight also said that in the UK, only 9% of cosmetics packaging is currently recycled and the rest is put into landfill. ​ She points out that acknowledging the scale of the problem is the first step towards progress. Many brands have turned to refillable rather than single-use cosmetic packaging solutions, but this is not a simple switch and needs careful consideration of materials and data. There are also the potential health and safety issues that can arise if consumers are repeatedly refilling their own products at home, as recently noted by global packaging company Aptar​ at the Cosmetics 360 show. Garside-Wight said that beauty and personal care brands are missing a golden opportunity to educate consumers on their packaging sustainability goals. She noted how many focus on promoting cruelty-free, vegan-friendly, and responsibly sourced ingredients on the pack, but don’t bother communicating their packaging sustainability goals in this same space. “Brands such as Upcircle Beauty are doing it right when it comes to driving packaging sustainability, actively encouraging consumers to return packaging for refilling and providing a 20% discount on their products​,” she said. ​ Garside-Wight also notes the need for data-driven decision-making to help achieve these ecological packaging goals: “To avoid greenwashing, brands must have access to accurate, real-time packaging data across the entire supply chain, taking into account factors like recyclability, recycled content, waste reduction and shelf life,” ​she shared. ​ She continued: “Misleading claims and the complexity of recyclability in different regions highlight the importance of thoughtful design based on factual, live and accurate information, not presumption.”​ She concluded by saying that even though recycling rates have increased in Europe in the last years, the amount of waste generated is growing faster than the actual recycling. “Without action, the EU would see an increase of 19% in packaging waste by 2030,”​ she said. The daily mission of our development teams ​ While some beauty brands are still putting steps in place to start working on these targets, the packaging companies have needed to be ahead of the curve as their businesses depend on it. The VP for CSR and Product Sustainability at luxury packaging company Albéa Cosmetics & Fragrance, Gilles Swyngedauw, said that Albéa has been working on responsible packaging solutions for more than 15 years. “We are anticipating the new regulations, working with partners across the industry to establish common guidelines. Because in this long and complex journey, collaboration is key,”​ he said. Swyngedauw shared that Albéa is currently working on a big project with Citeo in France, to make skin care and makeup packaging designed for recycling into existing recycling streams and potential future streams. He also said that the company works with CEN, the European Committee for Standardisation, Recyclass in EU and APR in the US to develop D4RG (Design for Recycling Guidelines) and a single definition of ‘recyclability’. It is also a member of SPICE, the Sustainable Packaging Initiative for Cosmetics, which was co-founded by L'Oréal and Quantis sustainable packaging consultancy and offers a specialist tool for businesses to use. “Lowering the impact of our solutions is therefore the daily mission of our development teams,”​ shared Swyngedauw. “At Albéa Cosmetics & Fragrance, reusing packaging is the most important issue and we are working on refillable jars, compacts or sticks. Reinventing packaging also means looking for more virtuous materials: a dedicated technical team is re-inventing ABS\/SAN packaging to move away from these non-recyclable resins.”​ The company also has an Albéa Tubes arm which is currently focusing on making the tubes recyclable. “At least 90% of the products in our portfolio have a recyclable solution and we are working on the remaining 10%. In addition to recyclability, the teams are also focusing on the reduction of material with lightweight solutions for sleeves and caps,” ​shared Swyngedauw.​ He revealed that the integration of recycled content is also a key topic as the company is committed to incorporate 10% of PCR (Post-consumer recycled) in its solutions by 2025. Our message is ‘not to panic’​ Sustainability Champion at global cosmetics packaging company Quadpack Hulya Gray said that just like every other business in the industry, Quadpack is still working to gain clarity on the details of how to comply and integrate this in into its sustainability roadmap to transition and offer compliant products. As Quadpack is a B Corp, sustainability already underpins the business and Gray said that NPD now focuses on eco-design, mono-material packaging, refill formats and sustainable materials. “We are working to minimise the carbon footprint of our processes, by using renewable energy, regenerative systems and a biomass plant, ​she said. “We are also trying to deliver solutions close to our customers, to produce or stock, decorate and assemble locally. So, we’re already working towards a common goal.”​ Gray also said that although Quadpack always encourages clients to select sustainable packaging for their products, it is still a tricky area to navigate. “We offer life-cycle assessments on the impact of our solutions to help them make informed choices, ​she explained. “However, in terms of compliance, our message is not to panic. There is a lot to figure out, but the important part is that we've started the journey to make sure we take care of the planet for future generations.”​","filter_flag":1}
{"title":"Industry responds to Packaging and Packaging Waste Directive's controversial Compromise Amendments - Packaging Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9pbmR1c3RyeS1yZXNwb25kcy10by1wYWNrYWdpbmctYW5kLXBhY2thZ2luZy13YXN0ZS1kaXJlY3RpdmVzLWNvbnRyb3ZlcnNpYWwtY29tcHJvbWlzZS1hbWVuZG1lbnRzLzEwNTE1LmFydGljbGXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9pbmR1c3RyeS1yZXNwb25kcy10by1wYWNrYWdpbmctYW5kLXBhY2thZ2luZy13YXN0ZS1kaXJlY3RpdmVzLWNvbnRyb3ZlcnNpYWwtY29tcHJvbWlzZS1hbWVuZG1lbnRzLzEwNTE1LmFydGljbGXSAQA?oc=5","id":"CBMikAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9pbmR1c3RyeS1yZXNwb25kcy10by1wYWNrYWdpbmctYW5kLXBhY2thZ2luZy13YXN0ZS1kaXJlY3RpdmVzLWNvbnRyb3ZlcnNpYWwtY29tcHJvbWlzZS1hbWVuZG1lbnRzLzEwNTE1LmFydGljbGXSAQA","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9pbmR1c3RyeS1yZXNwb25kcy10by1wYWNrYWdpbmctYW5kLXBhY2thZ2luZy13YXN0ZS1kaXJlY3RpdmVzLWNvbnRyb3ZlcnNpYWwtY29tcHJvbWlzZS1hbWVuZG1lbnRzLzEwNTE1LmFydGljbGXSAQA?oc=5\" target=\"_blank\">Industry responds to Packaging and Packaging Waste Directive's controversial Compromise Amendments<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Industry responds to Packaging and Packaging Waste Directive's controversial Compromise Amendments - Packaging Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3BhY2thZ2luZ2V1cm9wZS5jb20vbmV3cy9pbmR1c3RyeS1yZXNwb25kcy10by1wYWNrYWdpbmctYW5kLXBhY2thZ2luZy13YXN0ZS1kaXJlY3RpdmVzLWNvbnRyb3ZlcnNpYWwtY29tcHJvbWlzZS1hbWVuZG1lbnRzLzEwNTE1LmFydGljbGXSAQA?oc=5\" target=\"_blank\">Industry responds to Packaging and Packaging Waste Directive's controversial Compromise Amendments<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","source.href":"https:\/\/packagingeurope.com","source.title":"Packaging Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Design for recycling\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Following the Committee on Environment (ENVI)’s vote on Compromise Amendments to the Packaging and Packaging Waste Directive, organizations from across the packaging value chain have made their voices heard – expressing a range of views on its targets, bans, and legislative adjustments regarding single-use plastics, reusable packaging, and more. On Tuesday, the Committee convened to vote on the amendments, with their rejection by the EPP and ECR parties followed by the late tabling of their own amendments delaying the process. The rapporteur, MEP Frédérique Ries, oversaw the final tally of fifty-six in favour of the bill, twenty-three against, and five abstentions. Recycling targets Perhaps the biggest point of contention in the industry’s response thus far comes in the pursuit of more ambitious recycling targets. United under the Permanent Material Alliance, the Association of European Producers of Steel for Packaging (APEAL), European Aluminium, the European Container Glass Federation (FEVE), and Metal Packaging Europe express their satisfaction with ENVI’s approach, which is thought to align with the potential for aluminium, glass, and steel to be recycled indefinitely in closed material loop schemes. “Recyclability performance grades now introduced in the PPWR are a great step forward to a truly EU Circular Economy,” commented Alexis Van Maercke, secretary general of APEAL. “These grades, a first of their kind, will reward packaging that can be recycled multiple times and that can feed into a closed material loop scheme.” Adeline Farrelly, secretary general of FEVE, added: “We are glad to see that the ENVI Committee adopted packaging waste reduction targets to mitigate against the risk of substitution of fully circular materials (Permanent Materials) by difficult-to-recycle packaging materials. Aluminium, glass and steel largely prevent waste generation as they are today already collected, sorted and undergo high-quality endless recycling into new loops.” Nevertheless, coalition members highlighted what they felt was an incomplete definition of ‘high-quality recycling’ – i.e., a closed-loop process – and, in turn, a limitation of the materials’ full potential. “The introduction of a definition for ‘high-quality recycling’ is surely a very important move,” said Sarah Cuvellier, deputy CEO of Metal Packaging Europe. “However, we believe that the ENVI Committee could have been more ambitious by emphasizing materials’ ability to withstand multiple recycling loops without any change to their main material properties. “An ambitious definition of ‘high quality recycling’ would stimulate the manufacturers of packaging to increase the design for recycling of their packaging and further boost their effective and efficient recycling.” Maarten Labberton, director Packaging Group of European Aluminium, continued: “High quality recycling of packaging materials highly depends on the availability of efficient separate collection and sorting systems for packaging waste. A timely and ambitious approach which encourages the separate collection of packaging waste in all EU Member States is a must. We fully support the separate collection target of 90% endorsed by the ENVI Committee.” Cepi agrees with the enforcement of a 90% collection target, citing a reported recycling rate of 82.5% for paper packaging – a figure that already exceeds the targets put in place for 2025. Increasing the rate would apparently require the separate collection of paper and board across Europe, which the vote aims to facilitate. However, its call to recycle packaging in a closed product loop is not thought to apply to paper and board, as these products can be recycled together into the same or similar product applications. This requirement is described by Cepi as an ‘unnecessary barrier to paper recycling without bringing any benefits to its quality’. Therefore, Cepi instead calls for a material loop and suggests that the quality of recycled materials, alongside their potential to substitute primary raw materials, would have served as ‘a better point of reference’. A market for secondary raw materials already exists in the paper and board industry, the organization states, with around 75% of paper-based packaging is currently said to be made from recycled materials. A minimum quota for recycled content in new products has been embraced by Lauriane Veillard, Chemical Recycling and Plastic-to-Fuels Policy officer at Zero Waste Europe. It is said that the measure “ builds on the Commission’s proposal and goes a step further by considering the environmental impact of recycling process, thus bringing environmental requirements into the circular economy agenda.” However, it is suggested that the same consideration has not been shown for contact-sensitive packaging. Virginia Janssens, managing director at Plastics Europe, expresses that the company is “particularly disappointed” by a reduction in recycled content targets, describing it as a “missed opportunity to encourage the necessary investment” that will “undermine the development of the market for recycled plastic packaging in Europe.” Various bans and reduction targets are accused of being ‘arbitrary’ and singling out plastic packaging without an accompanying impact assessment. Plastics Europe fears that a full ban goes against the Directive’s environmental goals and pre-existing circularity investments from the plastics industry by stifling recycling processes for shrink wraps, collation films, and other plastics packaging for fresh products and grouped packaging – all of which are ‘essential’ in protecting and transporting products. “Whilst politically attractive to some stakeholders, arbitrary bans are not the answer,” Janssens continues. “They will only encourage the substitution of plastics with other materials without any proven environmental advantages and will not solve the issue of single-use packaging. “We instead call for an ambitious proposal that creates the positive investment climate enabling the European plastics system to continue its sustainability journey.” Allowing for the use of bio-based virgin plastics in recycled content targets has been met with a mixed response. Veillard stresses that “the requirement to meet recycled content targets is strongly undermined by the possibility to use bio-based plastic. There is no point in integrating circular thinking into packaging production if half of the targets can be fulfilled by using virgin plastic.” On the other hand, Plastics Europe maintains that the vote has ‘weakened the ambition’ to create a market for recycled plastic material and fails to adequately incentivize the adoption of bio-based plastics. It criticizes the new measures for utilizing bioplastics only as a means of ‘dilut[ing] the targets for recycled content’ and pushes for separate, parallel targets for these materials, as they are believed to bring down greenhouse gas emissions and reduce reliance on fossil-based feedstock during production processes. Reuse and single-use bans Single-use packaging will be restricted on the European market in a bid to cut down on packaging waste. This seeks to cut down on packaging waste, avoid unnecessary packaging, and enable an uptake in reuse. ECOS made a statement on Twitter (X) to share its reservations about the ‘watered down’ compromises put forth for the takeaway sector in the new rules, emphasizing that the final text must address reuse targets. Programme manager Mathias Falkenberg said that “a shift to reusable packaging is still in Europe’s future”, but “we must increase our uptake of reusable packaging to reverse the trend of increasing packaging waste” as the measures put in place are “not as ambitious as we need across the board.” Cepi shares its view that recyclable and reusable packaging options complement each other – pointing out that paper packaging is already sourced from renewable content and widely recycled. Rather than applying a set of rules designed for fossil-based materials – and, according to Cepi, lacking in proof of its environmental performance – to a renewable material, the organization suggests a circular model. “It is not too late for the Parliament, as the Institution representing the voice of EU citizens, to acknowledge all the benefits of the EU so efficiently recycling a material that is renewable, and sustainably sourced and managed,” says Jori Ringman, director general at Cepi. “This is already a world class recycling system, the result of billions of euros of private but also public investment. We should not aim to break what works, but to make it better.” In Zero Waste Europe’s view, the proposition that 50% of large household appliance packaging should be reusable – including that made of cardboard and\/or distributed from online platforms – is a significant step forward. “For the first time in European packaging legislation, prevention and reuse are given a chance,” says director-founder Joan Marc Simon. “The ENVI Committee’s decision allows for systemic solutions which can deliver on the ultimate purpose of this revision: reduce packaging waste.” Conversely, Plastics Europe thinks that reuse models could have an adverse effect on transport packaging and questions the true achievability of reuse targets in the transport sector. “Unfortunately, today’s vote means that by 2030 flexible plastics films essential for transporting foods within, or between, EU Member States risk being banned entirely if the ENVI vote is confirmed in the final legislation,” says Janssens. “This will result in supply chain disruptions, higher costs for transporters and ultimately consumers, and will negatively impact transportation safety.” FoodDrinkEurope is also critical of rising reuse targets in conjunction with the rejection of an exemption mechanism for reuse targets and a lack of impact assessment. If Member States achieving an 85% recycling rate or above were allowed to derogate reuse targets, the company believes that enterprises could ‘choose what they can do best’ rather than spreading resources between recycling and reuse targets and potentially hindering their success rate across the board. As well as this, the European Commission’s impact assessment has come under fire for failing to mention safeguarding for food and safety hygiene in reuse targets – an oversight that, according to FoodDrinkEurope, is not amended in the new rules. Design, aesthetics, and the market Plastics Europe is supportive of the Design for Recycling criteria’s ability to assess the recyclability of packaging, as well as the recycling requirements developed in tandem with relevant stakeholders. On another note, though, FoodDrinkEurope cautions that it is unsure whether there is enough recycled material on the market to meet recycled content targets for 2030, or whether what is available is affordable. The company felt that the amendments should have implemented a reuse clause for these targets and reviewed their viability before the first deadline. Director general Dirk Jacobs stated that their true feasibility “remains to be seen” and insists that “it will also be important to ensure that national governments don’t start going beyond the proposed reuse targets, and in doing so, jeopardise the integrity of the Single Market, Europe’s most valuable asset.” Additionally, FEVE is concerned about the ability to protect Intellectual Property Rights under the new legislation, resulting in homogenous packaging designs, loss of individual brand identity, and a decrease in commercial value. “We fear this will result in standardized packaging and the gradual demise of brand differentiation,” Farrelly explains. “We are committed to ensuring that glass packaging solutions, agreed with our customers, are designed with the minimal necessary weight and volume. “However, we believe this measure restricts creative designs and iconic shapes of bottles often reflecting cultural heritage products to be placed on the market in future. This will massively dent the economic value these products bring to Europe and beyond.” Overall response Rethink Plastic feels that the Compromise Amendments are ‘lukewarm’ and cautions that ENVI’s stance could ‘not only reduce the environmental ambition of the regulation’ but ‘undermine its future enforcement as well’. It urges MEPs to fix reported ‘loopholes’ in its new approach – gesturing towards the initial Commission proposal and the current Spanish Presidency compromise text as examples of more consistent and effective legislation. Marco Musso, senior policy officer for Circular Economy at the European Environmental Bureau, argues that “the final text supported by the ENVI Committee is weaker than the original proposal as a result of unprecedented levels of lobbying from the biggest polluters in the single-use packaging industry.” Policy manager for Circular Economy Jean-Pierre Schweitzer supports this view; “The long list of derogations and exemptions introduced in the compromises risks repeating the shortcomings of the current packaging directive whose vague and unenforceable requirements failed to limit the uncontrolled growth of packaging waste. The European Parliament Plenary must deliver a solid set of rules to reduce waste, restrict unnecessary packaging and promote reusable packaging solutions, not a patchwork of loopholes to meet lobbying requests.” “The average lifetime of a packaging item does not exceed 20 minutes before it is thrown into a bin,” states Ioana Popescu, coordinator at Rethink Plastic. “Decision-makers should harness their regulatory power to drive ambition and support the mainstreaming of existing, proven solutions such as restrictions on certain types of packaging as well as reuse systems to reduce record-high amounts of packaging waste. Allowing business-as-usual practices to continue fuels the triple climate, biodiversity and pollution crisis.” Zero Waste Europe has referred to the revisions as a ‘relief for policymakers’, describing the compromise as ‘less than perfect, but any further dilution would only serve the interests of the single-use sector.’ Head of Policy Aline Maigret comments: “While the text has been considerably diluted from the Commission’s original proposal, we believe this represents the best outcome we can attain at this point in time. Zero Waste Europe welcomes the adoption of the Rapporteur’s compromise amendments today, and commend MEP Ries for upholding the integrity of this bill. “There were many challenges from opposing parties, as well as an unprecedented level of corporate lobbying. We eagerly anticipate the upcoming plenary vote in November for this crucial environmental bill.” UNESDA has also “welcome[d] the very strong stance taken by MEPs in favour of circularity by promoting closed-loop recycling of beverage bottles and a wider rollout of Deposit and Return Systems”, but opposes the measures that it believes will create “a patchwork of national targets that will have devastating consequences on Europe’s competitiveness”. Industry players across the packaging value chain also responded to revisions made to the EU’s Packaging and Packaging Waste Directive last year, which were described as ‘arbitrary’. If you liked this article, you might also enjoy: The L’Oréal approach to packaging sustainability What steps is Apple taking to make its packaging more sustainable? How did Brazil achieve its 100% aluminium can recycling rate – and can it be replicated in the EU? Experts have their say on the EU’s Packaging and Packaging Waste Directive revisions Also, if you’re interested in packaging sustainability, you will want to attend our Sustainable Packaging Summit in Amsterdam on 14-15 November. The Summit brings together leaders and pioneers from across the industry to align strategically, learn, network, and create a critical mass to accelerate change. You can learn more by clicking here, and you can buy a ticket to attend here.","filter_flag":1}
