{"title":"Fishermen Take the Lead in Tackling Ocean Plastic Pollution - The Fishing Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vdGhlZmlzaGluZ2RhaWx5LmNvbS9sYXRlc3QtbmV3cy9maXNoZXJtZW4tdGFrZS10aGUtbGVhZC1pbi10YWNrbGluZy1vY2Vhbi1wbGFzdGljLXBvbGx1dGlvbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vdGhlZmlzaGluZ2RhaWx5LmNvbS9sYXRlc3QtbmV3cy9maXNoZXJtZW4tdGFrZS10aGUtbGVhZC1pbi10YWNrbGluZy1vY2Vhbi1wbGFzdGljLXBvbGx1dGlvbi_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vdGhlZmlzaGluZ2RhaWx5LmNvbS9sYXRlc3QtbmV3cy9maXNoZXJtZW4tdGFrZS10aGUtbGVhZC1pbi10YWNrbGluZy1vY2Vhbi1wbGFzdGljLXBvbGx1dGlvbi_SAQA","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vdGhlZmlzaGluZ2RhaWx5LmNvbS9sYXRlc3QtbmV3cy9maXNoZXJtZW4tdGFrZS10aGUtbGVhZC1pbi10YWNrbGluZy1vY2Vhbi1wbGFzdGljLXBvbGx1dGlvbi_SAQA?oc=5\" target=\"_blank\">Fishermen Take the Lead in Tackling Ocean Plastic Pollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Fishing Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fishermen Take the Lead in Tackling Ocean Plastic Pollution - The Fishing Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vdGhlZmlzaGluZ2RhaWx5LmNvbS9sYXRlc3QtbmV3cy9maXNoZXJtZW4tdGFrZS10aGUtbGVhZC1pbi10YWNrbGluZy1vY2Vhbi1wbGFzdGljLXBvbGx1dGlvbi_SAQA?oc=5\" target=\"_blank\">Fishermen Take the Lead in Tackling Ocean Plastic Pollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Fishing Daily<\/font>","source.href":"https:\/\/thefishingdaily.com","source.title":"The Fishing Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Johnny Walsh, a highly regarded figure in the fishing industry, will actively participate in this initiative, with his three fishing vessels closely monitored for plastic usage and collection at sea. Utilising a dedicated mobile application and maintaining an annual log, this endeavour aims to showcase the positive impact of these vessels on ocean health, with all data stored transparently through blockchain technology. The old fishing nets from Walsh’s vessels will be repurposed in Asia and Africa, capable of collecting several million kilograms of plastic annually—up to 50 times more than the amount of plastic used by the fishing company. These collections will be independently audited, and blockchain technology will provide accessible data. For every kilogram of frozen langostino prawns sold under the Johnny Walsh brand, Ocean Integrity Group commits to removing one kilogram of ocean plastic. This commitment underscores Walsh’s unprecedented dedication to sustainability. The fishing company’s old nets, specifically Nylon 6 “monofilament,” will be recycled. Nylon 66 and HDPE trawls will be repurposed for ocean plastic collection. Two of these nets will be transformed into eight plastic collection devices, capable of removing over 2,000,000 kilograms of ocean plastic annually. All ocean plastic collected by Walsh’s vessels under the Blue Ocean Program will be meticulously tracked through the Ocean Integrity APP, with data securely stored on blockchain technology. This initiative is set to offset Johnny’s fishing company’s plastic footprint, resulting in a surplus of ocean plastic removal—up to 1,995,000 kilograms per year. The collective effort to remove 2000 tonnes of ocean plastic will substantially reduce the global carbon footprint by over 6000 tonnes of CO2. This initiative once again emphasises that fishermen are an integral part of the solution to ocean plastic waste, debunking the common portrayal of them as the problem. “Once again, fishermen are the solution to ocean plastic waste, not the problem as often portrayed,” says founder and CEO of the Ocean Integrity Group, Kieran Kelly. As this pioneering effort sets a remarkable precedent, the Ocean Integrity Group encourages support through likes, comments, and shares. Stay tuned for next week’s feature, highlighting another fishing company from Ballycotton County Cork.","filter_flag":1}
{"title":"“The best is yet to come”: Tour operators outline goals for 2024 - Travelweek","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnRyYXZlbHdlZWsuY2EvbmV3cy90b3VyLW9wZXJhdG9ycy90aGUtYmVzdC1pcy15ZXQtdG8tY29tZS10b3VyLW9wZXJhdG9ycy1vdXRsaW5lLWdvYWxzLWZvci0yMDI0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnRyYXZlbHdlZWsuY2EvbmV3cy90b3VyLW9wZXJhdG9ycy90aGUtYmVzdC1pcy15ZXQtdG8tY29tZS10b3VyLW9wZXJhdG9ycy1vdXRsaW5lLWdvYWxzLWZvci0yMDI0L9IBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LnRyYXZlbHdlZWsuY2EvbmV3cy90b3VyLW9wZXJhdG9ycy90aGUtYmVzdC1pcy15ZXQtdG8tY29tZS10b3VyLW9wZXJhdG9ycy1vdXRsaW5lLWdvYWxzLWZvci0yMDI0L9IBAA","guidislink":false,"published":"Fri, 29 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=363, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnRyYXZlbHdlZWsuY2EvbmV3cy90b3VyLW9wZXJhdG9ycy90aGUtYmVzdC1pcy15ZXQtdG8tY29tZS10b3VyLW9wZXJhdG9ycy1vdXRsaW5lLWdvYWxzLWZvci0yMDI0L9IBAA?oc=5\" target=\"_blank\">“The best is yet to come”: Tour operators outline goals for 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Travelweek<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"“The best is yet to come”: Tour operators outline goals for 2024 - Travelweek","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LnRyYXZlbHdlZWsuY2EvbmV3cy90b3VyLW9wZXJhdG9ycy90aGUtYmVzdC1pcy15ZXQtdG8tY29tZS10b3VyLW9wZXJhdG9ycy1vdXRsaW5lLWdvYWxzLWZvci0yMDI0L9IBAA?oc=5\" target=\"_blank\">“The best is yet to come”: Tour operators outline goals for 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Travelweek<\/font>","source.href":"https:\/\/www.travelweek.ca","source.title":"Travelweek","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"G ADVENTURES, David Green, Managing Director for Canada 2023 HIGHLIGHTS: “Travel is back – that is the biggest highlight for me. We are finally seeing bookings supersede pre-pandemic levels in some of our most popular destinations like Costa Rica, Thailand and Italy. Another big highlight was the relaunch of ChangeMakers, our biggest agent incentive, and the GX Summit we hosted in Cusco, Peru this past September where we unveiled our new Trees for Days initiative where we plant one tree per day for every traveller who is on a trip with us. It was also exciting to launch our new Geluxe Collection or premium active trips this past month, which is already hitting the spot with travellers. On the people front, we’re also back! We’ve recruited and grown our outside and inside sales teams, and our call answer rates and average handling times are now better than pre-pandemic.” 2024 GOALS: “I do believe that as an industry we need to find more ways to champion one another. We can all play a bigger part in helping to alleviate poverty if we travel responsibly and ensure that as many as our travellers’ dollars stay in the destinations that they visit. And remember, as travel agents, you have the power to ask your suppliers what they are doing to support local communities.” MESSAGE TO AGENTS: “The best is yet to come! Travel is back and people are hungry to see the world in a responsible and meaningful way, so 2024 will be better than ever, for all of us and for our travellers. Head into 2024 with a clear vision of what kind of agent you want to be. As travel professionals, we have a unique opportunity to change the lives of not only your clients, but also those of the communities that your clients visit.” GLOBUS FAMILY OF BRANDS, Steve Born, Chief Marketing Officer 2023 HIGHLIGHTS: “2023 was a year of continued innovation for the Globus family of brands as we look to the next wave of river cruise and touring clients. On the touring side, we relaunched Globus Choice tours, offering the widest selection of included excursions in touring and now with more time in the world’s most fascinating cities. We also enjoyed continued – and exciting – growth in our Small Group departures as well as our off-season tours, Escapes by Globus. Both are bringing a new profile of clients to touring.” 2024 GOALS: “2024 is looking like a great year, led by new production both from tried-and-true and new-to-industry travel advisor partners. While we’re back on a pre-pandemic sales pace, the mix of selling agents and new products is forming a very strong long-term picture for the Globus family of brands. Our goal is to be the easiest supplier for our advisors in terms of speed, service, tools and profitability.” MESSAGE TO AGENTS: “To travel advisors, you’ve survived everything the world could’ve thrown at you and now is your time to thrive. Your time, talent and expertise is so valuable, so embrace that and use it to focus on high-revenue products like touring and river cruising. Use your time and energy wisely for success and profitability – you’ve earned it.” GOWAY, Renee Stanton, Director of Sales 2023 HIGHLIGHTS: “In 2023, several record-breaking months marked the first half of the year and we anticipate continued success with more record-breaking months expected in Q1 of 2024. The GowayPro Travel Academy achieved ACTA accreditation, granting travel advisors four credit hours towards their CTC. The academy now boasts an impressive collection of over 250 video-based modules covering 50 countries. We also expanded our reservation team by over 160 people since 2019, and revamped our internal training program.” 2024 GOALS: “While the demand for European travel soared, we acknowledge that the turnaround time for quotes reached a peak. However, with the recent rollout of our new reservation platform and various technological enhancements, we are confident in our ability to provide the seamless experience that travel advisors are accustomed to. Our goal is to achieve a 24-hour turnaround time on all quotes.” MESSAGE TO AGENTS: “To our travel advisor partners, we extend our heartfelt gratitude for your continued support. We recognize that, in some instances, we may have fallen short of our renowned high level of customer service. Please be assured that we have carefully listened to your feedback and are more committed than ever to making your lives easier. Exciting initiatives are on the horizon for 2024, including the introduction of a new agent loyalty program, product development aimed at meeting consumer demand, and the launch of a brand new website.” INTREPID TRAVEL, Tom Smith, VP of Sales and Marketing for North America 2023 HIGHLIGHTS: “We kicked off 2023 by launching over 80 new experiences for travellers to experience the world in fresh and responsible ways. Travel was back in full force this year; in November, we actually surpassed last year’s total revenue made in Canada by 52% already. We saw a few trends come up in terms of trip styles, namely, family travel, which saw record sales of our offerings in 2023. Active trips also exploded in popularity, with a 445% increase in our Walking and Trekking sales globally in 2023 compared to last year. And as the world’s largest carbon-neutral travel company, we also launched new trips in lesser-visited destinations like Pakistan, Comoros and Timor-Leste to help combat overtourism. 2024 GOALS: In 2023, Intrepid released a report in partnership with Future Labs that predicted key future trends that will help ensure a more sustainable future of travel. Intrepid’s 1,000+ tours are carbon offset, which is a great place to start, but we want to continue to minimize the footprint of our tours in the future. Notably, we are in the process of taking internal and scenic flights out of itineraries, and our tours will have approximately 4,000 fewer flights on trips in 2024 compared to 2023. We’re also continuing to expand our offerings closer to home for Canadians in North, South and Central America so they can look to taking shorter-haul flights. MESSAGE TO AGENTS: “Know that we don’t see the excitement for travel that we saw in 2023 slowing down anytime soon. Destination-wise, South America is back on the map in a big way so don’t count this out with your clients. The region has been our biggest seller in the final quarter of 2023, and we expect this popularity to continue. We’re introducing new product in this region for 2024, including a 14-Day Best of Costa Rica Family Holiday, and a six-day journey through the Heart of Guatemala. SUNWING VACATIONS GROUP, Samantha Taylor, Chief Marketing and Digital Officer 2023 HIGHLIGHTS: “As we emerged from last year’s generational winter storm and resulting operational challenges, we have been hard at work on strengthening trust with our valued travel advisors and mutual customers. I am very pleased to say that we’ve delivered incredibly strong sales and performance throughout the summer months and for the start of this winter season, with nearly 100,000 Sunwing Vacations customers travelling to the tropics in the first two weeks of November alone. This is thanks in large part to the amazing work by travel advisors from coast to coast. We’re also thrilled to be increasing capacity from last winter season, including the newly added Cuban destinations of Cienfuegos and Manzanillo de Cuba, available from Montreal and Toronto this winter, along with expanded vacation options in Pacific Mexico, from Los Cabos to Mazatlán and Puerto Vallarta.” 2024 GOALS: “We are committed to continuing to work closely with travel advisors in 2024 to further strengthen our partnership. This includes ongoing communication on the breadth of our offering, key promotions and sales, and collaborating with them at every step to deliver even more vacation options to Canadians. We recently shared key operational enhancements implemented by our airline partner, Sunwing Airlines, to increase operational readiness for the winter season, which we are grateful for. We feel confident in delivering a strong season to Canadians this year with the support of advisors. MESSAGE TO AGENTS: “We would not be where we are today without the loyalty, trust and hard work of our travel advisor community, and for that we would like to thank all advisors. From myself and all of us at Sunwing Vacations, we wish all travel advisors a wonderful holiday season and a very Happy New Year. 2024 is looking very bright!” TRANSAT, Joseph Adamo, Chief Sales and Marketing Officer, and President of Transat Distribution Canada 2023 HIGHLIGHTS: “We hold a cautiously optimistic perspective for 2024 based on three key factors in 2023. These include the cutting-edge expertise of our teams, who are consistently attuned to market dynamics and customer behaviour. Second, the launch of two exclusive routes – Lima in December 2023 and Marrakesh in June 2024 – as well as the ongoing annualization of certain key routes such as Liberia and San Salvador. And third and perhaps most importantly, our transformative join venture with Porter. By combining both airlnes’ highly-complementary, non-overlapping networks, this alliance offers travellers enhanced travel options across North, Central and South America, Europe, North Africa, Mexico and the Caribbean, at Toronto and Montreal airports.” 2024 GOALS: “We are committed to diligently reducing our carbon footprint . We have formulated an ambitious plan with the ultimate goal of achieving net-zero carbon emissions by 2050. Furthermore, we have set a specific target to reduce our net CO2 emissions per revenue tonne-kilometre (RTK) by 24% by 2030, compared to 2019 levels. Our approach to achieving these goals involved fleet renewal with the most energy-efficient aircraft, supporting the growth of a sustainable aviation fuel (SAF) industry at the local level, enhancing our energy efficiency initiatives, and offering passengers the option to offset their carbon emissions.” MESSAGE FOR AGENTS: “Our faith in the capabilities and knowledge of our travel agencies remains unwavering, which are particularly relevant given the increasing prominence of artificial intelligence in 2023. The empathy and expertise demonstrated by our travel agents continue to play a significant role in guiding our customers throughout the entire travel journey, from initial research and booking to the actual travel experience itself. This is a level of service that simply cannot be replicated by any computer.”","filter_flag":1}
{"title":"Dr. Saeeda Jaffar, senior VP & group country manager, Visa GCC - Economy Middle East","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZWNvbm9teW1pZGRsZWVhc3QuY29tL25ld3Mvc2FlZWRhLWphZmZhci12aXNhLWludGVydmlldy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZWNvbm9teW1pZGRsZWVhc3QuY29tL25ld3Mvc2FlZWRhLWphZmZhci12aXNhLWludGVydmlldy_SAQA?oc=5","id":"CBMiQGh0dHBzOi8vZWNvbm9teW1pZGRsZWVhc3QuY29tL25ld3Mvc2FlZWRhLWphZmZhci12aXNhLWludGVydmlldy_SAQA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZWNvbm9teW1pZGRsZWVhc3QuY29tL25ld3Mvc2FlZWRhLWphZmZhci12aXNhLWludGVydmlldy_SAQA?oc=5\" target=\"_blank\">Dr. Saeeda Jaffar, senior VP & group country manager, Visa GCC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economy Middle East<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dr. Saeeda Jaffar, senior VP & group country manager, Visa GCC - Economy Middle East","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZWNvbm9teW1pZGRsZWVhc3QuY29tL25ld3Mvc2FlZWRhLWphZmZhci12aXNhLWludGVydmlldy_SAQA?oc=5\" target=\"_blank\">Dr. Saeeda Jaffar, senior VP & group country manager, Visa GCC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economy Middle East<\/font>","source.href":"https:\/\/economymiddleeast.com","source.title":"Economy Middle East","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Contactless solutions and sustainable finance in the spotlight The payment solutions market has seen many significant shifts in the past few years. With the rise of eCommerce and internet protection — coupled with the impact of COVID-19 — more businesses and consumers are turning to cashless and contactless methods. Sustainability and the demand for improved financial inclusion are also driving meaningful changes. In this feature, we gain insights into how Visa is pioneering transformative initiatives in the Gulf Cooperation Council (GCC) region. We talk to Dr. Saeeda Jaffar, senior vice president and group country manager of Visa GCC, as she delves into the trends, challenges and innovations that are steering the future of finance in the region. Economy Middle East: As the year draws to a close, and you look back to 2023, what do you consider to be the key factors that made an impact across key GCC markets? Dr. Saeeda Jaffar: As 2023 concludes, key trends have shaped the payment landscape in GCC markets. The surge in eCommerce and the extensive use of contactless payments (96 percent of face-to-face transactions) positioned the GCC as a leader in contactless payments. Moreover, the growing interest in installment solutions reflects consumer efforts to manage budgets and afford larger purchases. Our upcoming Visa Installment Solution targets the retail market. This provides flexibility and convenience for Visa credit cardholders to make installment payments in both online and in-store transactions. Addressing the increasing demand for sustainable financial practices, the emergence of green payments is noteworthy. We are launching the Eco Benefits Bundle, a groundbreaking climate banking platform in collaboration with ecolytiq and Mashreq. This innovative solution integrates eco-friendly features into card payments, enabling users to track their environmental impact and contribute to carbon offset initiatives. Lastly, consumers increasingly seek personalized financial services, leading the industry toward individualized offerings. This shift is influenced by the emergence of open banking. And we, at Visa, have partnered with Tarabut Gateway to introduce new products and solutions using open banking capabilities. Economy Middle East: Looking ahead, will inflation continue to be a challenge in 2024? Dr. Saeeda Jaffar: The UAE Central Bank has lowered its projections of inflation for 2023 from 3.1 percent to 2.8 percent, which is set to slow down further to 2.6 percent. This reflects lower transportation and food prices. However, interest rates remain high and are subject to further revisions, which translates to higher interest for loans, mortgages, credit cards and so on. This is where financial literacy plays a prominent role in aiding consumers’ budgeting and costing for the year. We believe everyone has the right to access basic financial services. And so cashless and contactless payment methods and digital wallets are enabling this empowerment. Economy Middle East: What key payment trends does Visa see emerging next year, especially in the GCC region? Dr. Saeeda Jaffar: In 2024, credit cards and digital wallets are expected to remain popular for online transactions, reflecting eCommerce’s continued growth. Installment payments like Buy Now Pay Later will rise. The majority of consumers in key GCC markets — the UAE (75 percent), Saudi Arabia (78 percent) and Qatar (66 percent) — are already aware of the service. About a third in each country has been using BNPL. Frictionless, real-time payments are expected to grow in demand as expectations for seamless payments – whether peer-to-peer, business-to-consumer or cross-border – increase. With Visa Direct, we are improving the speed, convenience and security of sending and receiving payments. The payment industry anticipates a transformation through artificial intelligence and deep learning, delivering value for customers, banks and merchants. A crucial aspect is enhancing fraud prevention and risk mitigation. In the Middle East, though cryptocurrency use cases are evolving, strong interest among central banks is observed, exploring the potential of Central Bank Digital Currency. For instance, the UAE Central Bank recently launched the CBDC Digital Dirham strategy. Economy Middle East: Gaps in financial inclusion have been a subject of discussion among stakeholders in the industry. What are your thoughts on this? Dr. Saeeda Jaffar: Recognizing the existing gaps in financial inclusion and the imperative to address them, Visa has proactively engaged with governments, banks, merchants and fintech entities to provide financial inclusion to numerous people across the globe. Visa has played a pivotal role in empowering SMBs with cost-effective acceptance solutions like Tap to Phone, Rapid Merchant and Click to Pay. Our commitment to inclusivity is also seen in initiatives supporting women entrepreneurs, such as the She’s Next Grant Program, with grants totaling $360,000 this year. Additionally, we’ve partnered with Dubai Holding to aid blue-collar workers in managing their finances. Visa also invests in educational campaigns and partnerships to promote safe, responsible use of digital payments. Economy Middle East: What are your key takeaways from the recent FII Summit? Dr. Saeeda Jaffar: The recent FII Summit was a call to leaders across the globe to ponder on the challenges of humanity. Financial inclusion, converting from cash to cashless and digital payment methods impact people remarkably. At Visa, we accelerate innovation in digital payment with solutions that create a frictionless experience, in transport, remittance and retail, including other sectors. We value collaboration between governments, financial institutions, merchants and fintechs, to foster economic growth and financial inclusion in the GCC and proudly align with the goals of the FII Summit. Economy Middle East: Visa has pledged to reach net-zero emissions by 2040. What initiatives have you implemented to reach this target? How can the finance industry in the GCC contribute to regional sustainability? Dr. Saeeda Jaffar: Sustainability has gained significant traction in financial services over the last few years, driven by stakeholders including governments and regulators, investors and global momentum built by COP28. Visa has committed to achieving net-zero emissions by 2040, building on its carbon-neutral status since 2020. Some of our key initiatives include the introduction of Visa Eco Benefits, allowing customers to calculate their transactional carbon footprint. Additionally, the Visa Foundation granted a $250,000 fund to Emirates Nature-WWF for environmental conservation in the UAE. Our latest Sustainable Commerce Study in the GCC revealed that half of surveyed consumers are aware of climate change as a leading challenge, with 67 percent believing sustainable payment options can impact carbon emissions. Nearly 8 out of 10 also claimed that stricter laws and regulations are necessary. Read: Damian Bunce: Exness is top brokerage with ‘better-than-market’ conditions About Dr. Saeeda Jaffar, senior vice president & group country manager – GCC, Visa Dr. Saeeda Jaffar serves as the senior vice president & group country manager for the Gulf Cooperation Council at Visa. With over two decades of experience, she spearheads the company’s growth in the region by fostering strategic partnerships with financial institutions, governments and key clients. Over the past 20 years, she has worked across the Middle East, Europe and the U.S. Notably, she was the managing director at Alvarez & Marsal ME, a leading turnaround and restructuring firm. Additionally, she took on leadership roles at McKinsey & Company and Bain & Company. Currently, she also sits as a member of the Board of Trustees at Kuwait University. Dr. Jaffar earned her bachelor’s degree in biomedical engineering from Boston University, graduating valedictorian. She obtained her master’s and doctorate degrees in chemical engineering from the Massachusetts Institute of Technology. She gained it through the HH Sheikh Mohammed bin Rashid Al Maktoum EDAAD Scholarship. For more interviews, click here.","filter_flag":1}
