{"title":"Post-Covid, Procurement Still Under-Resourced","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fepsnews.com%2f2024%2f06%2f20%2fpost-covid-procurement-still-under-resourced%2f&c=12423205572092565529&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fepsnews.com%2f2024%2f06%2f20%2fpost-covid-procurement-still-under-resourced%2f&c=12423205572092565529&mkt=en-us","summary":"It’s a familiar story: procurement departments don’t have sufficient resources to execute day-to-day business and work on strategic issues ...","published":"Thu, 20 Jun 2024 11:09:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=11, tm_min=9, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"Electronics Purchasing and Supply News","news_image":"http:\/\/www.bing.com\/th?id=OVFT.g9KNVzb7Sfl_F44yd0YnhS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":650.0,"news_imagemaxheight":351.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Post-Covid, Procurement Still Under-Resourced","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"It’s a familiar story: procurement departments don’t have sufficient resources to execute day-to-day business and work on strategic issues ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"It’s a familiar story: procurement departments don’t have sufficient resources to execute day-to-day business and work on sustainability, resilience and other strategic issues. Technology, including AI, is poised to automate time-consuming tasks, but investment in supply chain solutions is insufficient. In fact, recent research concludes that procurement departments are under-resourced and face several difficulties regarding funding, digital infrastructure and resource management. “Senior procurement leaders understand that more-effective use of data is vital. Yet many procurement functions still struggle to transform themselves into data- and technology-driven organizations,” according to business consultancy McKinsey. Three key problems are holding procurement initiatives back: issues with data quality and access, lack of clarity over the business case for new digital or AI applications, and difficulty driving adoption of the new tools at scale, McKinsey reported. It’s notable that procurement, the heroes of the Covid-19 pandemic, are now somewhat stymied in regard to digitalization. Some corporations have moved at full speed to modernize their procurement departments while others, facing a challenging economic environment, are at best maintaining their supply chain investments. Seventy-five percent of organizations worldwide have increased or maintained their budgets for supply chain and procurement technology, according research from Jaggaer, a supplier of digital procurement solutions. However, many investments aren’t going far enough. Nearly half (42 percent) of procurement teams state manual and inefficient processes slow them down and hold them back from fully addressing the C-suite‘s critical business priorities, such as navigating financial pressure. Gartner also found constraints are hobbling procurement departments, and supply chain leaders face barriers to addressing constrained resources. Many processes are still manual Procurement’s biggest gripe? Non-value-added tasks still take up a lot of time. Twenty-five percent of procurement and supply chain teams report having some digitalization across procurement, but many core processes are still manual and inefficient, Jaggaer reported. One-third (33 percent) of sourcing professionals state their team collectively spends 11-20 hours per week creating and sending out invoices alone. Twenty-six percent spend 31-40 hours per week. Teams focused on supplier or category management spend 21-30 hours (34 percent) collectively on supplier communications each week. This includes everything from aligning on capabilities and sourcing needs to invoicing and payments. Only a small percentage of procurement teams are almost fully automated, which Jaggaer defines as teams being free to spend most of their time on strategic business initiatives. Only 9 percent of procurement professionals say their function today is completely autonomous, meaning they leverage automation and machine learning to drive predictive and prescriptive analytics, providing actionable insights and recommending optimum courses of action. At the same time, organizations are increasingly pushing procurement to the frontlines of navigating ongoing financial pressures. Despite the improved economic outlook, inflation, recession risk, and monetary policy changes continue to hit organizations hard. Half of procurement and finance professionals report that these factors are having a major or severe impact on their business. The view on AI It’s clear that investment in technology is seen as the path toward more efficient procurement. Digital transformation is a top-three enterprise objective, according to Deloitte. In fact, 83 percent of IT teams that Jaggaer surveyed stated that their companies are aiming to modernize technology infrastructure in the broader business. Thirty-four percent of companies surveyed said emerging tech such as generative AI is already having a major impact on their business. Procurement professionals foresee generative AI adding value to their work for summarizing supplier performance (16 percent), identifying new suppliers (15 percent), and automating routine tasks like writing standard emails (12 percent). As organizations decide where and how to allocate the growing procurement and supply chain technology budgets, generative AI should be part of the conversation as it is incredibly powerful for helping procurement work both faster and smarter, Jaggaer advises. In addition to writing RFPs and creating POs, contract management is well-suited for AI, Jaggaer’s Vice President of Direct Procurement Strategy Georg Roesch told EPSNews earlier this year. It can identify commonalities across multiple contracts and update those sections when necessary. This is particularly helpful when regulations affecting the contract, for example, change. Some professionals see contract negotiation aided by AI. Managing constraints Supply chain solutions are constantly being pressured by events such as terror attacks in the Red Sea or — in the case of electronics — slow demand and high levels of inventory. In a resource-constrained environment, Gartner recommends dealing with immediate crises versus the long term. In its research, Gartner found three main barriers preventing supply chain leaders from taking sufficient action to address internal constrained resources: Access to labor; fixed or limited capacity; and excessive energy costs. Procurement should focus on immediate threats to business viability, Gartner recommends, and shift strategies to: Motivate action by de-prioritizing long-term constraints and focus on addressing short-term risks that stakeholders are most focused on. Seek investment and shareholder buy-in on efforts that address the issues their organizations are already facing. Reprioritize long-term constraints to design solutions. Effective supply chain organizations can exert significant influence in product design that can impact considerations from material use to labor efficiency. Start with a focus on designing resource constraints out of new products, phasing in more sustainable and viable products for the future. Leverage the marketplace to learn and innovate. Leading supply chains innovate new solutions by creating opportunities to learn and leveraging their standing as customers. Companies should forge partnerships with innovators, startups and solution providers with a clear goal in mind. Experts reiterate that procurement departments should build clear businesses cases when seeking funding. Whether companies focus on technology or strategy, transformation requires vision, ambition, and sustained commitment from senior leadership, McKinsey concludes. It also depends upon teamwork and engagement. Jaggaer surveyed more than 220 business leaders worldwide to better understand the role of procurement and supply chain management. Gartner identified the top current resource constraints that threaten business viability via a survey of 143 supply chain leaders. by","filter_flag":1}
{"title":"Alarms will be sounding at Qantas, but not in the cockpit","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.smh.com.au%2fbusiness%2fcompanies%2falarms-will-be-sounding-at-qantas-not-in-the-cockpit-in-the-boardroom-20240625-p5joil.html&c=3111502803488902133&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.smh.com.au%2fbusiness%2fcompanies%2falarms-will-be-sounding-at-qantas-not-in-the-cockpit-in-the-boardroom-20240625-p5joil.html&c=3111502803488902133&mkt=en-us","summary":"It’s not as though Qantas can look at this result in the World Airline Awards and shrug its shoulders. Instead, it should roll up its sleeves.","published":"Mon, 24 Jun 2024 21:15:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=21, tm_min=15, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"Sydney Morning Herald","news_image":"http:\/\/www.bing.com\/th?id=OVFT.Zy3Sfb9UU8TzRpF9b0-PFy&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":366.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Alarms will be sounding at Qantas, but not in the cockpit","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"It’s not as though Qantas can look at this result in the World Airline Awards and shrug its shoulders. Instead, it should roll up its sleeves.","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"It seems that Qantas and its new chief executive, Vanessa Hudson, have been doing a lot of apologising lately. And so they should, with the latest World Airline Awards showing our national carrier’s decline from fifth in 2022, to 17th in 2023, to a new low of 24th in the latest results. When an airline descends that rapidly, alarms usually go off: not in the cockpit, in the boardroom. The Skytrax World Airline Awards have been described as the Oscars of the aviation industry. So it’s not as though Qantas can look at this result and shrug its shoulders. Instead, it should roll up its sleeves. Qantas is currently a shadow of its former self. Credit: Getty Images The bad result is hardly surprising, with the airline flying from one bad news story to the next of late. No need for a passenger manifest of gripes here; a brief summary would include illegally sacking 1700 ground crew during the pandemic and selling seats on non-existent “ghost flights”. Essentially, it all boiled down to criticism that the airline’s arrogant management was more concerned about corporate profits and putting their own interests ahead of customers and staff.","filter_flag":1}
{"title":"Industrial Software Market worth $46.6 billion by 2029 - Exclusive Report by MarketsandMarkets™","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2findustrial-software-market-worth-46-141500357.html&c=17676179398540094648&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2findustrial-software-market-worth-46-141500357.html&c=17676179398540094648&mkt=en-us","summary":"The global industrial software market is expected to be valued at USD 21.5 billion in 2024 and is projected to reach USD 46.6 billion by 2029; it is expected to grow at a CAGR of 16.7 % from 2024 to ...","published":"Tue, 25 Jun 2024 07:15:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=7, tm_min=15, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"YAHOO!Finance","news_image":"http:\/\/www.bing.com\/th?id=OVFT.-i3OR-B63b7wLdc636S7gS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":400.0,"news_imagemaxheight":137.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Industrial Software Market worth $46.6 billion by 2029 - Exclusive Report by MarketsandMarkets™","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The global industrial software market is expected to be valued at USD 21.5 billion in 2024 and is projected to reach USD 46.6 billion by 2029; it is expected to grow at a CAGR of 16.7 % from 2024 to ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"CHICAGO, June 25, 2024 \/PRNewswire\/ -- The global industrial software market is expected to be valued at USD 21.5 billion in 2024 and is projected to reach USD 46.6 billion by 2029; it is expected to grow at a CAGR of 16.7 % from 2024 to 2029 according to a new report by MarketsandMarkets™. The industrial software market is propelled by several key factors driving smart manufacturing and intelligent factory initiatives globally. Adopting Industry 4.0 technologies such as IoT, AI, big data analytics, and cloud computing is pivotal in enhancing operational efficiency and agility. Industrial software solutions like MES, SCADA, and HMI systems optimize production processes by providing real-time monitoring, resource management, and workflow automation, reducing downtime and improving productivity. MarketsandMarkets Logo Download PDF Brochure: https:\/\/www.marketsandmarkets.com\/pdfdownloadNew.asp?id=27555137 Browse in-depth TOC on \"Industrial Software Market\" 150 – Tables 50 – Figures 220 – Pages Industrial Software Market Report Scope: Report Coverage Details Market Revenue in 2024 $ 21.5 billion Estimated Value by 2029 $ 46.6 billion Growth Rate Poised to grow at a CAGR of 16.7% Market Size Available for 2020–2029 Forecast Period 2024–2029 Forecast Units Value (USD Million\/Billion) Report Coverage Revenue Forecast, Competitive Landscape, Growth Factors, and Trends Segments Covered By Type, End-use and Region Geographies Covered North America, Europe, Asia Pacific, and Rest of World Key Market Challenge Susceptibility of industrial software like MES, SCADA, and HMI to cyberattacks Key Market Opportunities Integration of industrial software such as MES with ERP and PLM solutions Key Market Drivers Rapid adoption of Industry 4.0\/5.0 technologies in manufacturing and process industries These solutions also ensure compliance with stringent quality and regulatory standards in industries such as pharmaceuticals and automotive, enhancing product safety and regulatory adherence. Cost efficiency is achieved through better resource utilization and predictive maintenance strategies, contributing to overall cost savings. Smart manufacturing practices supported by industrial software foster innovation in product design and manufacturing flexibility, accelerating time-to-market for new products and improving global competitiveness. Continuous technological advancements further expand the capabilities of industrial software, driving innovation and enabling more autonomous and interconnected manufacturing environments. The automotive segment in the discrete industry is expected to grow fastest during the forecast period. Industrial software plays a crucial role in automotive manufacturing, driving significant growth due to its ability to enhance efficiency, quality, and innovation across the production lifecycle. Automotive manufacturers rely on advanced software solutions such as Manufacturing Execution Systems (MES), SCADA\/HMI, or robotic software to streamline design and assembly operations. MES systems optimize production schedules, monitor real-time performance, and ensure compliance with industry standards, thereby improving throughput and reducing costs. This software manages product data and lifecycle processes, facilitating collaboration among design teams and suppliers to accelerate time-to-market for new vehicle models. Moreover, the adoption of digital twins and AI-driven analytics enables predictive maintenance and quality control, minimizing defects and enhancing overall production reliability. The high growth in industrial software adoption within automotive manufacturing is driven by the industry's continuous pursuit of operational excellence, innovation in smart manufacturing technologies, and the need to meet stringent regulatory requirements while maintaining a competitive advantage in a global market. Story continues The Pharmaceuticals segment in process industries is projected to grow significantly during the forecast period. Industrial software plays a pivotal role in pharmaceutical manufacturing. It is experiencing substantial growth due to its ability to optimize processes, ensure regulatory compliance, and enhance product quality and safety throughout the production cycle. Pharmaceutical companies utilize advanced software solutions, such as Manufacturing Execution Systems (MES), to manage and monitor manufacturing operations with precision and efficiency. MES systems enable real-time monitoring of production processes, ensuring adherence to strict quality standards and regulatory requirements while optimizing resource utilization. The high growth in industrial software adoption within pharmaceutical manufacturing is driven by increasing demand for personalized medicine, stringent regulatory oversight, and the industry's continuous investment in technology to enhance operational efficiency and accelerate time-to-market for new drug formulations. These software solutions empower pharmaceutical companies to maintain high standards of product safety, reliability, and compliance while adapting to evolving market dynamics and consumer expectations. Inquiry Before Buying: https:\/\/www.marketsandmarkets.com\/Enquiry_Before_BuyingNew.asp?id=27555137 Asia Pacific is expected to grow significantly throughout the forecast period. Asia Pacific's industrial software industry is projected to grow significantly. In the Asia Pacific, initiatives promoting smart manufacturing and smart factory implementations are considerably shaping the industrial software market. Countries like China, Japan, South Korea, and Singapore lead efforts with strategic initiatives and investments tailored to advance manufacturing through cutting-edge technologies. China's \"Made in China 2025\" initiative focuses on integrating AI, IoT, and robotics to enhance productivity and innovation in manufacturing. Japan's \"Society 5.0\" vision aims to use digital technologies to revolutionize manufacturing efficiency and sustainability. South Korea's \"Manufacturing Industry Innovation 3.0\" emphasizes IoT and cloud computing for smart manufacturing enhancements. Singapore supports digital transformation through its \"Smart Industry Readiness Index\" framework, guiding companies toward becoming smart factories. These initiatives propel the adoption of MES, SCADA, ERP, and analytics solutions, driving operational efficiency, cost reduction, and faster time-to-market for products. They collectively bolster the industrial software market by fostering innovation and competitiveness in manufacturing across the region. Key Players The industrial software companies includes significant Tier I and II players such as Siemens (Germany), Rockwell Automation (US), ABB (Switzerland), Emerson Electric Co. (US) and General Electric (US), among others, are some of the key players in the industrial software market. Get 10% Free Customization on this Report: https:\/\/www.marketsandmarkets.com\/requestCustomizationNew.asp?id=27555137 Browse Adjacent Market: Semiconductor and Electronics Market Research Reports &Consulting Related Reports: Smart Manufacturing Market Size, Share, Statistics and Industry Growth Analysis Report by Technology (3D printing, Al in Manufacturing, Automated guided vehicle, Condition Monitoring, Cybersecurity, Digital Twin, HMI, Machine Vision, MES, PAM, Robot, Sensor), Industry, Region - Global Forecast to 2028 Industrial Control and Factory Automation Market by Component, Solution (SCADA, PLC, DCS, MES, Industrial Safety, PAM), Industry (Process Industry and Discrete Industry), and Region (North America, Europe, APAC, RoW) – Global Forecast to 2027 Smart Factory Market Size, Share, Industry Growth & Trends by Component (Industrial Sensors, Industrial Robots, Industrial 3D Printers, Machine Vision Systems), Solution (SCADA, Manufacturing Execution System, Industrial Safety, PAM), Industry and Region - Global Forecast to 2029 System Integrator Market Size, Share, industry Growth, Trends & Analysis by Technology (Human Machine Interface, Machine Vision, Industrial Robotics, Industrial PC, IIoT, Distributed Control System, SCADA, PLC), Service Outlook (Consulting, Software Integration Service) - Global Forecast to 2029 Process Automation and Instrumentation Market by Instrument (Field Instruments, Process Analyzers), Solution (PLC, DCS, SCADA, HMI, Functional Safety, MES), Industry and Region (2022-2027) About MarketsandMarkets™ MarketsandMarkets™ has been recognized as one of America's best management consulting firms by Forbes, as per their recent report. MarketsandMarkets™ is a blue ocean alternative in growth consulting and program management, leveraging a man-machine offering to drive supernormal growth for progressive organizations in the B2B space. We have the widest lens on emerging technologies, making us proficient in co-creating supernormal growth for clients. Earlier this year, we made a formal transformation into one of America's best management consulting firms as per a survey conducted by Forbes. The B2B economy is witnessing the emergence of $25 trillion of new revenue streams that are substituting existing revenue streams in this decade alone. We work with clients on growth programs, helping them monetize this $25 trillion opportunity through our service lines - TAM Expansion, Go-to-Market (GTM) Strategy to Execution, Market Share Gain, Account Enablement, and Thought Leadership Marketing. Built on the 'GIVE Growth' principle, we work with several Forbes Global 2000 B2B companies - helping them stay relevant in a disruptive ecosystem. Our insights and strategies are molded by our industry experts, cutting-edge AI-powered Market Intelligence Cloud, and years of research. The KnowledgeStore™ (our Market Intelligence Cloud) integrates our research, facilitates an analysis of interconnections through a set of applications, helping clients look at the entire ecosystem and understand the revenue shifts happening in their industry. To find out more, visit www.MarketsandMarkets™.com or follow us on Twitter, LinkedIn and Facebook. Contact: Mr. Aashish Mehra MarketsandMarkets™ INC. 630 Dundee Road Suite 430 Northbrook, IL 60062 USA: +1-888-600-6441 Email: sales@marketsandmarkets.com Visit Our Web Site: https:\/\/www.marketsandmarkets.com\/ Research Insight: https:\/\/www.marketsandmarkets.com\/ResearchInsight\/industrial-software-companies.asp Content Source: https:\/\/www.marketsandmarkets.com\/PressReleases\/industrial-software.asp Logo: https:\/\/mma.prnewswire.com\/media\/1951202\/4609423\/MarketsandMarkets.jpg Cision View original content:https:\/\/www.prnewswire.com\/news-releases\/industrial-software-market-worth-46-6-billion-by-2029---exclusive-report-by-marketsandmarkets-302181413.html SOURCE MarketsandMarkets","filter_flag":1}
{"title":"Part-Time MBA concentration in Strategy & Leadership","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.business.rutgers.edu%2fpart-time-mba%2fstrategy-leadership&c=7039444609558907483&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.business.rutgers.edu%2fpart-time-mba%2fstrategy-leadership&c=7039444609558907483&mkt=en-us","summary":"The Strategy track prepares you to develop and execute organizational and business strategies, create or extend new products and services to cope ... creative decision making, human resource ...","published":"Tue, 30 Apr 2013 19:35:00 GMT","published_parsed":"time.struct_time(tm_year=2013, tm_mon=4, tm_mday=30, tm_hour=19, tm_min=35, tm_sec=0, tm_wday=1, tm_yday=120, tm_isdst=0)","news_source":"business.rutgers","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Part-Time MBA concentration in Strategy & Leadership","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The Strategy track prepares you to develop and execute organizational and business strategies, create or extend new products and services to cope ... creative decision making, human resource ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"Credit totals may vary per group depending on the courses taken. Speak with an advisor for questions related to degree completeness. In this concentration, students have the option of choosing 1 track, either the Strategy track OR the Leadership track. Each track is 4 courses (12 credits) for a primary concentration. They are the same concentration and therefore the tracks cannot be combined. This includes making one track a primary concentration and the other a secondary concentration. Students can take this concentration as a secondary concentration if 9 credits in their track are completed. Foundation Course Requirement: Strategic Management is part of the MBA Curriculum and is required for all students who choose this concentration.","filter_flag":1}
{"title":"The Best Rain Barrels of 2024","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.popularmechanics.com%2fscience%2fenvironment%2fg60981003%2fbest-rain-barrels%2f&c=14017911254908642421&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.popularmechanics.com%2fscience%2fenvironment%2fg60981003%2fbest-rain-barrels%2f&c=14017911254908642421&mkt=en-us","summary":"Consulting local government authorities or water resource management agencies can clarify the legality and requirements for rainwater collection in your area. How long can water be stored in a rain ...","published":"Tue, 11 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=11, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=163, tm_isdst=0)","news_source":"Popular Mechanics","news_image":"http:\/\/www.bing.com\/th?id=OVFT.Qm4s1PGNJclwdCtbAO5R6S&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":350.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Best Rain Barrels of 2024","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Consulting local government authorities or water resource management agencies can clarify the legality and requirements for rainwater collection in your area. How long can water be stored in a rain ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"Gear-obsessed editors choose every product we review. We may earn commission if you buy from a link. Why Trust Us? You can’t always count on Mother Nature to fix your dry, patchy lawn or wilted garden. Perhaps the easiest way to conserve and store water for a non-rainy day is with a rain barrel specifically designed for that very purpose. These reservoirs are placed underneath your gutter’s downspout to collect runoff from your roof to use for irrigation and outdoor cleaning tasks, like washing down patio furniture or rinsing tools. Most rain barrels are made of all-weather plastic and have a spigot or a water hose connection, along with a screen at the collection point to prevent leaves and other debris from falling inside. They also come in multiple sizes, with 40 or 50 gallons offering plenty of capacity for the average homeowner. In terms of price, you can expect to pay $200 or less for a 50-gallon model. This buying guide covers expert tips to consider before purchasing a rain barrel, along with reviews of the best rain barrels we recommend. Following our reviews, we’ve also included rain barrel FAQs and tips to help you maintain your rain barrel year-round. The Best Rain Barrels Best Overall: Best Value: Best for Gardens: What to Consider Capacity When selecting a rainwater collection barrel, assess your water needs and usage patterns. Consider the size of your garden, frequency of watering, and any other purposes for which you intend to use collected rainwater, such as cleaning or irrigation. This helps determine the appropriate barrel capacity to meet your requirements without overflow or frequent refilling. Also take into account the average rainfall in your area. A larger capacity barrel is advisable for regions with higher rainfall or prolonged dry spells between rain events, ensuring a sufficient supply during periods of scarcity. The size of your roof is another thing to factor in, particularly if you live in a wet climate. Larger capacity barrels may be heavier and more challenging to maneuver, requiring additional support structures and careful placement. Penny Crispin from the Snohomish Conservation District says sizes can vary drastically to fit individual needs. “Some barrels are as small as 25 gallons, and others can hold over 100 gallons.” On average, most people will do fine with 40 or 50 gallons of capacity. Materials Most rain barrels, including PVC, polyethylene, and polyethylene resin varieties, are crafted from high-density plastic. This material is favored for its resistance to rot and rust, lightweight nature, and affordability, making it the most popular choice for its ease of cleaning and transportation. However, remember that plastic may degrade when exposed to sunlight, potentially affecting longevity. Stone and clay rain barrels offer more than just aesthetic appeal; their natural properties make them ideal for rainwater collection. While they may capture smaller amounts of rainwater than other materials, their durability and insulation qualities ensure water stays cool and protected from sunlight, preventing algae growth. Their porous nature allows gradual water percolation into the soil, promoting better hydration for plants. Wooden barrels offer a rustic look and blend well with garden surroundings. However, wood requires regular maintenance to prevent rot and decay, making it less practical for long-term use without proper care. Features Depending on the intended use of the rain barrel, there may be features to look out for while shopping. Standard features for rain barrels include spigots or taps for easy access to water, overflow spouts, and screen filters that are placed over intake openings to precent debris, leaves, and insects from entering the barrel. Most rain barrels also have child safety locks and some offer linking systems to connect multiple barrels for more capacity. State and Local Restrictions Lastly, consider regulatory restrictions or incentives related to rainwater harvesting in your area. According to Crispin, rainwater collection is regulated in some states due to issues such as water rights, the reduction of downstream water, and natural infiltration when rainwater is harvested. On the other hand, some states encourage and even provide incentives for installing rain collection systems. Check with your state regulations and programs before you install rainwater collection. How We Selected In selecting the best rain barrels, we focused on key criteria to ensure functionality, sustainability, and practicality. We prioritized rain barrels made from high-quality, UV-resistant materials capable of withstanding various weather conditions and models with ample capacity and efficient water distribution features, such as integrated spigots and overflow outlets. We also considered budget, aesthetic preferences, and ease of maintenance. To substantiate our recommendations, we consulted with an expert in rainwater collection and conservation, Penny Crispin, the Community Conservation Department Manager for the Snohomish Conservation District in Snohomish County, Washington State.","filter_flag":1}
{"title":"Full-Time MBA concentration in Strategy & Leadership","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.business.rutgers.edu%2ffull-time-mba%2fstrategy-leadership&c=4556861948216077713&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.business.rutgers.edu%2ffull-time-mba%2fstrategy-leadership&c=4556861948216077713&mkt=en-us","summary":"The Strategy track prepares you to develop and execute organizational and business strategies, create or extend new products and services to cope ... creative decision making, human resource ...","published":"Fri, 16 Oct 2015 12:39:00 GMT","published_parsed":"time.struct_time(tm_year=2015, tm_mon=10, tm_mday=16, tm_hour=12, tm_min=39, tm_sec=0, tm_wday=4, tm_yday=289, tm_isdst=0)","news_source":"business.rutgers","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Full-Time MBA concentration in Strategy & Leadership","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The Strategy track prepares you to develop and execute organizational and business strategies, create or extend new products and services to cope ... creative decision making, human resource ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"Credit totals may vary per group depending on the courses taken. Speak with an advisor for questions related to degree completeness. In this concentration, students have the option of choosing 1 track, either the Strategy track OR the Leadership track. Each track is 4 courses (12 credits) for a primary concentration. They are the same concentration and therefore the tracks cannot be combined. This includes making one track a primary concentration and the other a secondary concentration. Students can take this concentration as a secondary concentration if 9 credits in their track are completed. Foundation Course Requirement: Strategic Management is part of the MBA Curriculum and is required for all students who choose this concentration.","filter_flag":1}
{"title":"Industrial Software Market worth $46.6 billion by 2029 - Exclusive Report by MarketsandMarkets","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.finanznachrichten.de%2fnachrichten-2024-06%2f62576218-industrial-software-market-worth-dollar-46-6-billion-by-2029-exclusive-report-by-marketsandmarkets-008.htm&c=4675350215370242224&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.finanznachrichten.de%2fnachrichten-2024-06%2f62576218-industrial-software-market-worth-dollar-46-6-billion-by-2029-exclusive-report-by-marketsandmarkets-008.htm&c=4675350215370242224&mkt=en-us","summary":"Industrial software solutions like MES, SCADA, and HMI systems optimize production processes by providing real-time monitoring, resource management ... accelerating time-to-market for new products and ...","published":"Tue, 25 Jun 2024 09:17:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=9, tm_min=17, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"Finanznachrichten","news_image":"http:\/\/www.bing.com\/th?id=OVFT.-i3OR-B63b7wLdc636S7gS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":400.0,"news_imagemaxheight":137.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Industrial Software Market worth $46.6 billion by 2029 - Exclusive Report by MarketsandMarkets","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Industrial software solutions like MES, SCADA, and HMI systems optimize production processes by providing real-time monitoring, resource management ... accelerating time-to-market for new products and ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"CHICAGO, June 25, 2024 \/PRNewswire\/ -- The global industrial software market is expected to be valued at USD 21.5 billion in 2024 and is projected to reach USD 46.6 billion by 2029; it is expected to grow at a CAGR of 16.7 % from 2024 to 2029 according to a new report by MarketsandMarkets. The industrial software market is propelled by several key factors driving smart manufacturing and intelligent factory initiatives globally. Adopting Industry 4.0 technologies such as IoT, AI, big data analytics, and cloud computing is pivotal in enhancing operational efficiency and agility. Industrial software solutions like MES, SCADA, and HMI systems optimize production processes by providing real-time monitoring, resource management, and workflow automation, reducing downtime and improving productivity. Download PDF Brochure: https:\/\/www.marketsandmarkets.com\/pdfdownloadNew.asp?id=27555137 Browse in-depth TOC on \"Industrial Software Market\" 150 - Tables 50 - Figures 220 - Pages Industrial Software Market Report Scope: Report Coverage Details Market Revenue in 2024 $ 21.5 billion Estimated Value by 2029 $ 46.6 billion Growth Rate Poised to grow at a CAGR of 16.7% Market Size Available for 2020-2029 Forecast Period 2024-2029 Forecast Units Value (USD Million\/Billion) Report Coverage Revenue Forecast, Competitive Landscape, Growth Factors, and Trends Segments Covered By Type, End-use and Region Geographies Covered North America, Europe, Asia Pacific, and Rest of World Key Market Challenge Susceptibility of industrial software like MES, SCADA, and HMI to cyberattacks Key Market Opportunities Integration of industrial software such as MES with ERP and PLM solutions Key Market Drivers Rapid adoption of Industry 4.0\/5.0 technologies in manufacturing and process industries These solutions also ensure compliance with stringent quality and regulatory standards in industries such as pharmaceuticals and automotive, enhancing product safety and regulatory adherence. Cost efficiency is achieved through better resource utilization and predictive maintenance strategies, contributing to overall cost savings. Smart manufacturing practices supported by industrial software foster innovation in product design and manufacturing flexibility, accelerating time-to-market for new products and improving global competitiveness. Continuous technological advancements further expand the capabilities of industrial software, driving innovation and enabling more autonomous and interconnected manufacturing environments. The automotive segment in the discrete industry is expected to grow fastest during the forecast period. Industrial software plays a crucial role in automotive manufacturing, driving significant growth due to its ability to enhance efficiency, quality, and innovation across the production lifecycle. Automotive manufacturers rely on advanced software solutions such as Manufacturing Execution Systems (MES), SCADA\/HMI, or robotic software to streamline design and assembly operations. MES systems optimize production schedules, monitor real-time performance, and ensure compliance with industry standards, thereby improving throughput and reducing costs. This software manages product data and lifecycle processes, facilitating collaboration among design teams and suppliers to accelerate time-to-market for new vehicle models. Moreover, the adoption of digital twins and AI-driven analytics enables predictive maintenance and quality control, minimizing defects and enhancing overall production reliability. The high growth in industrial software adoption within automotive manufacturing is driven by the industry's continuous pursuit of operational excellence, innovation in smart manufacturing technologies, and the need to meet stringent regulatory requirements while maintaining a competitive advantage in a global market. The Pharmaceuticals segment in process industries is projected to grow significantly during the forecast period. Industrial software plays a pivotal role in pharmaceutical manufacturing. It is experiencing substantial growth due to its ability to optimize processes, ensure regulatory compliance, and enhance product quality and safety throughout the production cycle. Pharmaceutical companies utilize advanced software solutions, such as Manufacturing Execution Systems (MES), to manage and monitor manufacturing operations with precision and efficiency. MES systems enable real-time monitoring of production processes, ensuring adherence to strict quality standards and regulatory requirements while optimizing resource utilization. The high growth in industrial software adoption within pharmaceutical manufacturing is driven by increasing demand for personalized medicine, stringent regulatory oversight, and the industry's continuous investment in technology to enhance operational efficiency and accelerate time-to-market for new drug formulations. These software solutions empower pharmaceutical companies to maintain high standards of product safety, reliability, and compliance while adapting to evolving market dynamics and consumer expectations. Inquiry Before Buying: https:\/\/www.marketsandmarkets.com\/Enquiry_Before_BuyingNew.asp?id=27555137 Asia Pacific is expected to grow significantly throughout the forecast period. Asia Pacific's industrial software industry is projected to grow significantly. In the Asia Pacific, initiatives promoting smart manufacturing and smart factory implementations are considerably shaping the industrial software market. Countries like China, Japan, South Korea, and Singapore lead efforts with strategic initiatives and investments tailored to advance manufacturing through cutting-edge technologies. China's \"Made in China 2025\" initiative focuses on integrating AI, IoT, and robotics to enhance productivity and innovation in manufacturing. Japan's \"Society 5.0\" vision aims to use digital technologies to revolutionize manufacturing efficiency and sustainability. South Korea's \"Manufacturing Industry Innovation 3.0\" emphasizes IoT and cloud computing for smart manufacturing enhancements. Singapore supports digital transformation through its \"Smart Industry Readiness Index\" framework, guiding companies toward becoming smart factories. These initiatives propel the adoption of MES, SCADA, ERP, and analytics solutions, driving operational efficiency, cost reduction, and faster time-to-market for products. They collectively bolster the industrial software market by fostering innovation and competitiveness in manufacturing across the region. Key Players The industrial software companies includes significant Tier I and II players such as Siemens (Germany), Rockwell Automation (US), ABB (Switzerland), Emerson Electric Co. (US) and General Electric (US), among others, are some of the key players in the industrial software market. Get 10% Free Customization on this Report: https:\/\/www.marketsandmarkets.com\/requestCustomizationNew.asp?id=27555137 Browse Adjacent Market: Semiconductor and Electronics Market Research Reports &Consulting Related Reports: Smart Manufacturing Market Size, Share, Statistics and Industry Growth Analysis Report by Technology (3D printing, Al in Manufacturing, Automated guided vehicle, Condition Monitoring, Cybersecurity, Digital Twin, HMI, Machine Vision, MES, PAM, Robot, Sensor), Industry, Region - Global Forecast to 2028 Industrial Control and Factory Automation Market by Component, Solution (SCADA, PLC, DCS, MES, Industrial Safety, PAM), Industry (Process Industry and Discrete Industry), and Region (North America, Europe, APAC, RoW) - Global Forecast to 2027 Smart Factory Market Size, Share, Industry Growth & Trends by Component (Industrial Sensors, Industrial Robots, Industrial 3D Printers, Machine Vision Systems), Solution (SCADA, Manufacturing Execution System, Industrial Safety, PAM), Industry and Region - Global Forecast to 2029 System Integrator Market Size, Share, industry Growth, Trends & Analysis by Technology (Human Machine Interface, Machine Vision, Industrial Robotics, Industrial PC, IIoT, Distributed Control System, SCADA, PLC), Service Outlook (Consulting, Software Integration Service) - Global Forecast to 2029 Process Automation and Instrumentation Market by Instrument (Field Instruments, Process Analyzers), Solution (PLC, DCS, SCADA, HMI, Functional Safety, MES), Industry and Region (2022-2027) About MarketsandMarkets MarketsandMarkets has been recognized as one of America's best management consulting firms by Forbes, as per their recent report. MarketsandMarkets is a blue ocean alternative in growth consulting and program management, leveraging a man-machine offering to drive supernormal growth for progressive organizations in the B2B space. We have the widest lens on emerging technologies, making us proficient in co-creating supernormal growth for clients. Earlier this year, we made a formal transformation into one of America's best management consulting firms as per a survey conducted by Forbes. The B2B economy is witnessing the emergence of $25 trillion of new revenue streams that are substituting existing revenue streams in this decade alone. We work with clients on growth programs, helping them monetize this $25 trillion opportunity through our service lines - TAM Expansion, Go-to-Market (GTM) Strategy to Execution, Market Share Gain, Account Enablement, and Thought Leadership Marketing. Built on the 'GIVE Growth' principle, we work with several Forbes Global 2000 B2B companies - helping them stay relevant in a disruptive ecosystem. Our insights and strategies are molded by our industry experts, cutting-edge AI-powered Market Intelligence Cloud, and years of research. The KnowledgeStore (our Market Intelligence Cloud) integrates our research, facilitates an analysis of interconnections through a set of applications, helping clients look at the entire ecosystem and understand the revenue shifts happening in their industry. To find out more, visit www.MarketsandMarkets.com or follow us on Twitter, LinkedIn and Facebook. Contact: Mr. Aashish Mehra MarketsandMarkets INC. 630 Dundee Road Suite 430 Northbrook, IL 60062 USA: +1-888-600-6441 Email: sales@marketsandmarkets.com Visit Our Web Site: https:\/\/www.marketsandmarkets.com\/ Research Insight: https:\/\/www.marketsandmarkets.com\/ResearchInsight\/industrial-software-companies.asp Content Source: https:\/\/www.marketsandmarkets.com\/PressReleases\/industrial-software.asp Logo: https:\/\/mma.prnewswire.com\/media\/1951202\/4609423\/MarketsandMarkets.jpg View original content:https:\/\/www.prnewswire.co.uk\/news-releases\/industrial-software-market-worth-46-6-billion-by-2029---exclusive-report-by-marketsandmarkets-302181419.html","filter_flag":1}
{"title":"Alarms will be sounding at Qantas. Not in the cockpit, in the boardroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.brisbanetimes.com.au%2fbusiness%2fcompanies%2falarms-will-be-sounding-at-qantas-not-in-the-cockpit-in-the-boardroom-20240625-p5joil.html&c=16529759153674330296&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf6a5054e6592189d00e8fdc92f&url=https%3a%2f%2fwww.brisbanetimes.com.au%2fbusiness%2fcompanies%2falarms-will-be-sounding-at-qantas-not-in-the-cockpit-in-the-boardroom-20240625-p5joil.html&c=16529759153674330296&mkt=en-us","summary":"But these days, thanks to shared intelligence on vital things like cockpit resource management, most airlines around the ... latest in cockpit electronics and engine efficiency. These new products ...","published":"Tue, 25 Jun 2024 08:45:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=8, tm_min=45, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"Brisbane Times","news_image":"http:\/\/www.bing.com\/th?id=OVFT.07zIw03r1RKnRaay51JPJC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":366.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Alarms will be sounding at Qantas. Not in the cockpit, in the boardroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"But these days, thanks to shared intelligence on vital things like cockpit resource management, most airlines around the ... latest in cockpit electronics and engine efficiency. These new products ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Resource Management\" \"new products\"&format=rss","text":"It seems that Qantas and its new chief executive, Vanessa Hudson, have been doing a lot of apologising lately. And so they should, with the latest World Airline Awards showing our national carrier’s decline from fifth in 2022, to 17th in 2023, to a new low of 24th in the latest results. When an airline descends that rapidly, alarms usually go off: not in the cockpit, in the boardroom. The Skytrax World Airline Awards have been described as the Oscars of the aviation industry. So it’s not as though Qantas can look at this result and shrug its shoulders. Instead, it should roll up its sleeves. Qantas is currently a shadow of its former self. Credit: Getty Images The bad result is hardly surprising, with the airline flying from one bad news story to the next of late. No need for a passenger manifest of gripes here; a brief summary would include illegally sacking 1700 ground crew during the pandemic and selling seats on non-existent “ghost flights”. Essentially, it all boiled down to criticism that the airline’s arrogant management was more concerned about corporate profits and putting their own interests ahead of customers and staff.","filter_flag":1}
