{"title":"Bayer Crop Science Facility - 2018 P2 Awardee | US EPA - U.S. EPA.gov","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVwYS5nb3YvbW8vYmF5ZXItY3JvcC1zY2llbmNlLWZhY2lsaXR5LTIwMTgtcDItYXdhcmRlZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVwYS5nb3YvbW8vYmF5ZXItY3JvcC1zY2llbmNlLWZhY2lsaXR5LTIwMTgtcDItYXdhcmRlZdIBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmVwYS5nb3YvbW8vYmF5ZXItY3JvcC1zY2llbmNlLWZhY2lsaXR5LTIwMTgtcDItYXdhcmRlZdIBAA","guidislink":false,"published":"Tue, 25 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=206, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVwYS5nb3YvbW8vYmF5ZXItY3JvcC1zY2llbmNlLWZhY2lsaXR5LTIwMTgtcDItYXdhcmRlZdIBAA?oc=5\" target=\"_blank\">Bayer Crop Science Facility - 2018 P2 Awardee | US EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. EPA.gov<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bayer Crop Science Facility - 2018 P2 Awardee | US EPA - U.S. EPA.gov","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVwYS5nb3YvbW8vYmF5ZXItY3JvcC1zY2llbmNlLWZhY2lsaXR5LTIwMTgtcDItYXdhcmRlZdIBAA?oc=5\" target=\"_blank\">Bayer Crop Science Facility - 2018 P2 Awardee | US EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. EPA.gov<\/font>","source.href":"https:\/\/www.epa.gov","source.title":"U.S. EPA.gov","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Kansas City, Missouri Awardees with EPA Region 7 Administrator Jim Gulliford (click to enlarge) Bayer’s Crop Science Division is an agriculture enterprise with businesses in crop protection, seeds, and pest control. The Kansas City facility includes pesticide active ingredient manufacturing, along with formulation and packaging operations. Bayer’s pollution prevention efforts from 2015 to 2017 focused on reducing wastewater generated from the washout of equipment used to formulate and package products. During a typical year, approximately 115 different products and 60 to 70 million pounds of products will be packaged. To prevent cross-contamination, the equipment must be cleaned between product runs. That cleaning uses a significant amount of water and generates wastewater that requires treatment or other management. Using 2014 as a baseline, 12.9 million pounds (1.54 million gallons) of water were used for washouts and an equivalent amount of wastewater was generated. The following is a list of improvements made during the 2015-2017 time frame: Improved production scheduling, such as sequencing similar products together, decreased the amount of wash water required. (For example, a red product following a red product, rather than a white product following a red product.) Rerouted wash water directly to plant sumps to eliminate the wasteful practice of washing the floors. Converted a formulation plant from producing multiple products to a single product, which resulted in fewer washouts and less wastewater generation. Installed new pipelines constructed of sanitary tubing and installed polished tanks to reduce the amount of wastewater produced. Installed new pigging technology, which requires significantly less water to clean the pipelines compared to regular washout practices. Installed and used spray nozzles to improve washing efficiency. This allowed most of the batch water to be added through the spray nozzles, which keeps the tank walls clean and thereby requires less washing at the end of a product run. Installed a filter cleaner in one of the plants, reducing the amount of water needed during washout. Additional benefits realized from these efforts include: Personnel exposure to the hazards in the wastewater decreased during the washout process due to the reduced washout frequency, use of pigging technology, and use of spray nozzle technology. Less personnel resources and time are needed to complete washouts. Increased on-site incinerator capacity, cost-effectiveness, and potential for adding new products into production. Decreased waste shipping for off-site treatment. With 2014 as the baseline, there were 102 fewer washouts (27-percent reduction) in 2017 and the amount of wastewater generated was 3.2 million pounds (382,000 gallons) or 25 percent less in 2017. These improvements were accomplished while the quantity of products packaged increased by 14 percent in 2017, compared to 2014. Normalized to amount of goods packaged, the amount of wastewater generated was reduced by 34 percent. The reduced wastewater consumption saved Bayer $2.4 million at an average treatment cost of $0.30 per pound of wastewater treated during the three-year period. Bayer’s efforts could serve as a model for others in several ways. These efforts embody the spirit of continuous improvement and it’s not about simply implementing one big change to reduce the amount of wastewater generated. Rather, it has required multiple projects and many individuals who added their own small but significant contributions. As such, these efforts demonstrate the benefits of implementing the Plan-Do-Check-Act (PDCA) cycle for carrying out change and can serve as a model to other organizations looking to address environmental challenges through a continuous improvement effort. Another lesson to share is the power of measuring. Wastewater was a very significant part of the overall product cost. Until Bayer started measuring the amount of wastewater being generated, the facility did not have an appreciation of the true impact on the product cost. By measuring the amount of wastewater generated and establishing other key performance indicators, the facility also started tracking and seeing the results of the improvement efforts. This feedback of positive results in turn further fueled employees’ desire to make additional improvements. Finally, Bayer learned the importance and benefits of considering and acting upon wastewater reduction efforts during the design phase of new projects. Addressing the conservation of water during washouts during the design of new formulation and packaging systems was found to be significantly more efficient than efforts to reduce wastewater generation after a system or operation had already been built and placed in operation. This concept is readily transferrable to other pollution prevention and conservation efforts.","filter_flag":1}
{"title":"Q&A: The Truth About Those Plastic Recycling Labels - InsideClimate News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vaW5zaWRlY2xpbWF0ZW5ld3Mub3JnL25ld3MvMTUwNzIwMjMvdHJ1dGgtYWJvdXQtcGxhc3RpYy1yZWN5Y2xpbmctbGFiZWxzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vaW5zaWRlY2xpbWF0ZW5ld3Mub3JnL25ld3MvMTUwNzIwMjMvdHJ1dGgtYWJvdXQtcGxhc3RpYy1yZWN5Y2xpbmctbGFiZWxzL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vaW5zaWRlY2xpbWF0ZW5ld3Mub3JnL25ld3MvMTUwNzIwMjMvdHJ1dGgtYWJvdXQtcGxhc3RpYy1yZWN5Y2xpbmctbGFiZWxzL9IBAA","guidislink":false,"published":"Sat, 15 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=196, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vaW5zaWRlY2xpbWF0ZW5ld3Mub3JnL25ld3MvMTUwNzIwMjMvdHJ1dGgtYWJvdXQtcGxhc3RpYy1yZWN5Y2xpbmctbGFiZWxzL9IBAA?oc=5\" target=\"_blank\">Q&amp;A: The Truth About Those Plastic Recycling Labels<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">InsideClimate News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Q&A: The Truth About Those Plastic Recycling Labels - InsideClimate News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vaW5zaWRlY2xpbWF0ZW5ld3Mub3JnL25ld3MvMTUwNzIwMjMvdHJ1dGgtYWJvdXQtcGxhc3RpYy1yZWN5Y2xpbmctbGFiZWxzL9IBAA?oc=5\" target=\"_blank\">Q&amp;A: The Truth About Those Plastic Recycling Labels<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">InsideClimate News<\/font>","source.href":"https:\/\/insideclimatenews.org","source.title":"InsideClimate News","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"From our collaborating partner “Living on Earth,” public radio’s environmental news magazine, an interview by Producer Aynsley O’Neill with Jennie Romer, the EPA’s deputy assistant administrator for pollution prevention AYNSLEY O’NEILL: Let’s say you’ve just polished off a tub of creamy yogurt. Time to rinse and recycle… right? Well, the sad truth about your yogurt tub is that it is probably not going to be recycled at all. That’s because most of the yogurt in grocery stores comes in a tub made of plastic number 5, polypropylene, and it’s of little to no economic value. That little triangle symbol that you think means it’s recyclable… well, it doesn’t mean much. But now the federal government is looking into updating those symbols so that consumers aren’t duped. The Federal Trade Commission’s “Green Guides” date back to 1992 and they’re supposed to help companies avoid greenwashing when advertising their products. The Environmental Protection Agency is getting involved in the latest update, and joining me to explain is Jennie Romer, the deputy assistant administrator for pollution prevention at EPA. Jennie, welcome to Living on Earth! JENNIE ROMER: Thanks so much for having me. O’NEILL: In our everyday lives, we see that iconic triangular arrow label on a lot of products. And the first thing I think, and a lot of us think is, oh, good, it’s recyclable. But from what I understand, that’s not always the case. What do recycling labels actually tell us about a product? And to what extent might that system confuse the average consumer? ROMER: The symbols on the bottom of plastic bottles and containers are called resin ID codes. They were created to identify the type of plastic resin that the containers are made of; the resin number is usually surrounded by chasing arrow symbols. And we know that as a recyclable symbol. And sometimes you’ll see a solid triangle instead. But the symbol isn’t really meant to convey whether something is recyclable, it’s just meant to tell you the resin number. And it doesn’t necessarily mean that it can be recycled in your community. That’s why EPA has recently urged to have the chasing arrow symbol decoupled from the resin identification codes, and to really set a very high bar for when something can be marketed as recyclable. Categorizing plastics by resin identification codes coupled with that chasing arrow symbol does not accurately represent the recyclability of plastics, especially number three through seven, because those numbers don’t really have end markets that are financially viable to be recycled. We’re hiring! Please take a look at the new openings in our newsroom. See jobs From a pollution prevention standpoint, and that’s the office where I sit at EPA, there’s an opportunity to prevent harm to human health and the environment by making sure that consumers are presented with truthful marketing claims, including claims about recycling, because misleading claims can lead to a lot of that consumer confusion. O’NEILL: From what I understand, the Federal Trade Commission, the FTC, has these Green Guides, which are designed to help manufacturers avoid misleading environmental claims. And they were last revised in 2012. What kind of recommendations is the EPA making to the FTC? ROMER: The Green Guides are incredibly important because they let markets know what they can and can’t say, and companies all across the country pay a lot of attention to that. The main recommendation that EPA made in our comments on the Green Guides was to set a high bar for what can be considered recyclable, and specifically to require strong end markets for any products to be marketed as recyclable. Currently, in the Green Guides, FTC requires that in order to market something as recyclable, that item must be collected in a substantial majority of communities, and they set that bar at around 60 percent. It must be sorted with existing recycling machinery, and then it has to be made into something else. That last part is a little bit fuzzy. EPA, in the comments, is saying that the municipal recycler, after the collection happens, the sorting, that recycler has to be able to reliably find a market for that material, in order for it to be marketed as recyclable. It’s just clarifying that last step. That really can get rid of a lot of that consumer confusion about what’s recyclable or not. O’NEILL: If we scale out and look at the overall plastic landscape in the United States, what portion of the plastic we produce is actually recycled, actually makes it through that process? And what happens to the rest that doesn’t make it through that process? ROMER: Overall, the recycling rate for materials in general, including composting, hovers around 32 percent, and has for several years now. And for plastics, the recycling rate is around 8 percent of what is generated actually being recycled. Some resins, such as resins number one and two, those have the highest recycling rates by far. And that’s because those are worth a considerable amount of money on the commodities recycling market. And the rest of them, number three through seven, really don’t have that value. There are really two dynamics at play. One is your local recycling rules, what you’re told to put in your curbside bins. The second is the international commodities market. What happens next, once you put your recyclables into your bins? The next step is that it gets collected and brought to your local recycling facility, and there they’re sorted into different categories, put into bales and then sold on the commodities market to manufacturers to turn into new products. If that is all working correctly, then that’s a really effective mechanical recycling system. But it doesn’t work for everything, because there are some materials that do not have an end market, meaning that no one buys them. Those are the leftovers that you’re talking about. Those end up either getting sent to landfill, or to incineration, kind of depending on where you live. Some might also slip out into the environment as leakage as well. This story is funded by readers like you. Our nonprofit newsroom provides award-winning climate coverage free of charge and advertising. We rely on donations from readers like you to keep going. Please donate now to support our work. Donate Now O’NEILL: It sounds like there are updates in progress. But for now, what are consumers able to do on their end? ROMER: First, know your local recycling rules. Don’t unintentionally contaminate recycling. Don’t “wish cycle.” Don’t recycle something that could be a tangler. Plastic films are tanglers, things like garden hoses, clothing. If your local program only accepts number one and number two bottles and jugs, because those are worth the most money on the commodities market, follow those rules. If your local program accepts all rigid plastics, follow those local rules. But then, even more importantly, when you’re shopping, really focus on reducing and reusing materials before recycling. The most effective way to reduce waste is not to make it in the first place. Making a new product emits greenhouse gases, contributes to climate change and requires a lot of materials. As a result, when you’re reducing and reusing, you’re really effectively saving natural resources, and sometimes saving money.","filter_flag":1}
{"title":"Capex for FY24 includes a technology centre in Navi Mumbai and manufacturing site at Saykha: Dhiresh Shashikant Gosalia, CMD, Jesons Industries - Indian Chemical News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivgFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL2ludGVydmlld3MvY2FwZXgtZm9yLWZ5MjQtaW5jbHVkZXMtYS10ZWNobm9sb2d5LWNlbnRyZS1pbi1uYXZpLW11bWJhaS1hbmQtbWFudWZhY3R1cmluZy1zaXRlLWF0LXNheWtoYS1kaGlyZXNoLXNoYXNoaWthbnQtZ29zYWxpYS1jbWQtamVzb25zLWluZHVzdHJpZXMtMzA20gHDAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vaW50ZXJ2aWV3cy9saXRlL2NhcGV4LWZvci1meTI0LWluY2x1ZGVzLWEtdGVjaG5vbG9neS1jZW50cmUtaW4tbmF2aS1tdW1iYWktYW5kLW1hbnVmYWN0dXJpbmctc2l0ZS1hdC1zYXlraGEtZGhpcmVzaC1zaGFzaGlrYW50LWdvc2FsaWEtY21kLWplc29ucy1pbmR1c3RyaWVzLTMwNg?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivgFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL2ludGVydmlld3MvY2FwZXgtZm9yLWZ5MjQtaW5jbHVkZXMtYS10ZWNobm9sb2d5LWNlbnRyZS1pbi1uYXZpLW11bWJhaS1hbmQtbWFudWZhY3R1cmluZy1zaXRlLWF0LXNheWtoYS1kaGlyZXNoLXNoYXNoaWthbnQtZ29zYWxpYS1jbWQtamVzb25zLWluZHVzdHJpZXMtMzA20gHDAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vaW50ZXJ2aWV3cy9saXRlL2NhcGV4LWZvci1meTI0LWluY2x1ZGVzLWEtdGVjaG5vbG9neS1jZW50cmUtaW4tbmF2aS1tdW1iYWktYW5kLW1hbnVmYWN0dXJpbmctc2l0ZS1hdC1zYXlraGEtZGhpcmVzaC1zaGFzaGlrYW50LWdvc2FsaWEtY21kLWplc29ucy1pbmR1c3RyaWVzLTMwNg?oc=5","id":"CBMivgFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL2ludGVydmlld3MvY2FwZXgtZm9yLWZ5MjQtaW5jbHVkZXMtYS10ZWNobm9sb2d5LWNlbnRyZS1pbi1uYXZpLW11bWJhaS1hbmQtbWFudWZhY3R1cmluZy1zaXRlLWF0LXNheWtoYS1kaGlyZXNoLXNoYXNoaWthbnQtZ29zYWxpYS1jbWQtamVzb25zLWluZHVzdHJpZXMtMzA20gHDAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vaW50ZXJ2aWV3cy9saXRlL2NhcGV4LWZvci1meTI0LWluY2x1ZGVzLWEtdGVjaG5vbG9neS1jZW50cmUtaW4tbmF2aS1tdW1iYWktYW5kLW1hbnVmYWN0dXJpbmctc2l0ZS1hdC1zYXlraGEtZGhpcmVzaC1zaGFzaGlrYW50LWdvc2FsaWEtY21kLWplc29ucy1pbmR1c3RyaWVzLTMwNg","guidislink":false,"published":"Fri, 07 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=188, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivgFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL2ludGVydmlld3MvY2FwZXgtZm9yLWZ5MjQtaW5jbHVkZXMtYS10ZWNobm9sb2d5LWNlbnRyZS1pbi1uYXZpLW11bWJhaS1hbmQtbWFudWZhY3R1cmluZy1zaXRlLWF0LXNheWtoYS1kaGlyZXNoLXNoYXNoaWthbnQtZ29zYWxpYS1jbWQtamVzb25zLWluZHVzdHJpZXMtMzA20gHDAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vaW50ZXJ2aWV3cy9saXRlL2NhcGV4LWZvci1meTI0LWluY2x1ZGVzLWEtdGVjaG5vbG9neS1jZW50cmUtaW4tbmF2aS1tdW1iYWktYW5kLW1hbnVmYWN0dXJpbmctc2l0ZS1hdC1zYXlraGEtZGhpcmVzaC1zaGFzaGlrYW50LWdvc2FsaWEtY21kLWplc29ucy1pbmR1c3RyaWVzLTMwNg?oc=5\" target=\"_blank\">Capex for FY24 includes a technology centre in Navi Mumbai and manufacturing site at Saykha: Dhiresh Shashikant Gosalia, CMD, Jesons Industries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Capex for FY24 includes a technology centre in Navi Mumbai and manufacturing site at Saykha: Dhiresh Shashikant Gosalia, CMD, Jesons Industries - Indian Chemical News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivgFodHRwczovL3d3dy5pbmRpYW5jaGVtaWNhbG5ld3MuY29tL2ludGVydmlld3MvY2FwZXgtZm9yLWZ5MjQtaW5jbHVkZXMtYS10ZWNobm9sb2d5LWNlbnRyZS1pbi1uYXZpLW11bWJhaS1hbmQtbWFudWZhY3R1cmluZy1zaXRlLWF0LXNheWtoYS1kaGlyZXNoLXNoYXNoaWthbnQtZ29zYWxpYS1jbWQtamVzb25zLWluZHVzdHJpZXMtMzA20gHDAWh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vaW50ZXJ2aWV3cy9saXRlL2NhcGV4LWZvci1meTI0LWluY2x1ZGVzLWEtdGVjaG5vbG9neS1jZW50cmUtaW4tbmF2aS1tdW1iYWktYW5kLW1hbnVmYWN0dXJpbmctc2l0ZS1hdC1zYXlraGEtZGhpcmVzaC1zaGFzaGlrYW50LWdvc2FsaWEtY21kLWplc29ucy1pbmR1c3RyaWVzLTMwNg?oc=5\" target=\"_blank\">Capex for FY24 includes a technology centre in Navi Mumbai and manufacturing site at Saykha: Dhiresh Shashikant Gosalia, CMD, Jesons Industries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","source.href":"https:\/\/www.indianchemicalnews.com","source.title":"Indian Chemical News","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"2023 trends in Construction Chemicals, Textile Chemicals, Carpet Chemicals, Leather Chemicals, and Paper Chemicals? The industry is in sync with India's growth with a country focused on textiles and construction. We expect growth in textiles and construction to be around 12%. Company's financial performance in FY 2022-23? What's the forecast for FY 2023-24? In FY23, Jesons Industries Limited has shown a flattish volume growth and forecasts a volume growth of around 25% in FY24. Revenue mix within India and outside India for FY 2022-23? What will be the revenue mix in FY 2024-25? In FY23 exports contributed 26% of overall revenues whereas within India it was 74%. In FY24, the company is planning to increase its share of exports further to touch 28% of overall revenues. The company is focused on Specialty Coating Emulsions (SCE) and water-based Pressure Sensitive Adhesives (PSA) in tape and label segments in India. Any new developments on this front? Our technology centre at Turbhe, Navi Mumbai is churning out new products in the SCE and PSA categories for different applications. We are also in talks with a few global prominent players for collaboration. Capex investment in FY 2022-23 and projects\/facilities where the company has invested? Capex plans for the company in FY 2023-24 and how will this help the company in the long term? In FY23, the company expanded capacities in Roorkee, Chennai, and Mundra locations. Capex plans for FY24 include a new technology centre in Navi Mumbai and a new manufacturing site at Saykha, Gujarat. With these expansions, we expect to introduce innovative products and show robust growth in the coming years. The company holds about 30% market share as a specialty coating emulsions (SCE) supplier in the Indian paint sector? How does the company plan to increase it further? Any new product launches in the offing? Jesons has several new products in the pipeline in the SCE category for various applications and end uses. We are also in talks with several players for joint ventures and collaborations which will help us increase our market share. The company's portfolio of 170 products are marketed under seven different brands. Have you made any additions to this portfolio in 2022-23 or plan to do so in the near future? Yes, it is a continuous process and we have added several new products to the list. Our pipeline remains strong for the coming few years. What is the total installed capacity across six manufacturing plants and how much additional capacity added during FY 2022-23? What is your current capacity utilization and strategy to improvise it further? In FY23, the company’s capacity was around 283,000 MTPA with capacity utilization at around 65%. What are the key innovations undertaken at the company's DSIR recognized R&D centre? How will these innovations make an impact on the company and society? Innovations in Jesons are focused on enhancing customer productivity, delivering parallel innovative solutions, minimising impact on nature, and expanding our product adjacencies. The company is also focusing on minimizing natural resources such as water by developing high polymer content ready to use pressure sensitive adhesive for tapes and labels applications. Focus is also on products that enhances customer productivity by running at higher speeds on the coater line, safer in-compliance with FDA, and with highest quality standards products for packaging adhesive applications such as lamination, side pasting, etc., CMR free products for furniture adhesive applications; Coating binder which acts as scavenger for carcinogenic emission in the atmosphere; Development of green paint binders with latent crosslinking technology to enhance paints shelf life; Elastomeric coatings using sunlight for crosslinking; Moisture barrier coating for reducing water demand required for concrete curing; and using in-house products as raw materials for formulating competitive high-performance construction chemicals. The company has received prestigious Responsible Care certification from Indian Chemical Council (ICC). How will this strengthen your commitment towards future sustainability goals? Jesons Industries Limited is a Responsible Care (RC) Logo Certified organization which is an internationally recognized and global voluntary initiative through ICCA internationally and ICC in India. RC addresses community concern about chemicals and their impact on people and environment during processing, transportation, and use. This helps us to build trust and confidence with stakeholders i.e. employees, community customers, suppliers, contractors, and government. RC covers process safety, employee health and safety, pollution prevention, emergency response and communication, distribution, product stewardship, and security. RC logo is a symbol of commitment towards EHS excellence and thus helps us to strengthen a move towards sustainability. Level of automation and digitalization projects carried out in FY 2022-23? How do you plan to move ahead on this front both on brownfield and greenfield projects? We are currently at 75% automation in our plants and wish to enhance it to 90% by 2027. CSR projects undertaken in FY 2022-23 and plans for FY 2023-24? We have undertaken several CSR projects for promotion of education and healthcare. We have also carried out CSR activities towards the Prime Minister Relief Fund (PMRF). How is the company striking a balance between environment-friendly policies and business growth? Key sustainability initiatives of the company across various segments? In the energy sector, the company has installed 60 kw solar panels at Mundra; In water management, the company has developed a water harvesting system at 8 kl\/hr at Mundra; In waste management, the company is opting for paperless work procedures at Mundra; Reuse of drums; In biodiversity we are increasing green belt with plantation of 1,588 trees at Mundra; In supply chain, the company is deploying nicer globe tracking system into transported vehicles; and Journey Risk assessment of transportation. Compliances with national environment compliances. Prepared & implemented QEHS (Quality, Environment, Health and Safety) policy & its goal and third party certification for our system like ISO and Responsible Care. The company is going to implement the EcoVadis and ESG certification process. When is Jesons Industries planning to achieve Net Carbon Zero? What are the different milestones set up by the company to achieve it? We have appointed PwC as our ESG implementation partner and the milestones are under development.","filter_flag":1}
{"title":"FinalStraw After Shark Tank Update 2024 - Where Are They Now - Gazette Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZ2F6ZXR0ZXJldmlldy5jb20vZmluYWxzdHJhdy1hZnRlci1zaGFyay10YW5rLXVwZGF0ZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZ2F6ZXR0ZXJldmlldy5jb20vZmluYWxzdHJhdy1hZnRlci1zaGFyay10YW5rLXVwZGF0ZS_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vZ2F6ZXR0ZXJldmlldy5jb20vZmluYWxzdHJhdy1hZnRlci1zaGFyay10YW5rLXVwZGF0ZS_SAQA","guidislink":false,"published":"Mon, 17 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=198, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZ2F6ZXR0ZXJldmlldy5jb20vZmluYWxzdHJhdy1hZnRlci1zaGFyay10YW5rLXVwZGF0ZS_SAQA?oc=5\" target=\"_blank\">FinalStraw After Shark Tank Update 2024 - Where Are They Now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gazette Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"FinalStraw After Shark Tank Update 2024 - Where Are They Now - Gazette Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vZ2F6ZXR0ZXJldmlldy5jb20vZmluYWxzdHJhdy1hZnRlci1zaGFyay10YW5rLXVwZGF0ZS_SAQA?oc=5\" target=\"_blank\">FinalStraw After Shark Tank Update 2024 - Where Are They Now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gazette Review<\/font>","source.href":"https:\/\/gazettereview.com","source.title":"Gazette Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"FinalStraw Before Shark Tank FinalStraw is a collapsable reusable straw made of degradable material that helps the environment. The average American uses 1.6 straws a day, which is over 500 million straws used daily in the US. FinalStraw is a product that allows people to use reusable straws Instead of plastic straws, which would end up polluting the earth and killing ocean animals such as sea turtles, who are very susceptible to plastic straws clogging their nostrils. The company’s goal is to develop a product that helps reduce pollution; reusable metal straws meant to last a lifetime. Miles Pepper came up with the idea. He later teamed up with Emma Cohen to make FinalStraw a reality. Miles was a cinematographer who loved to develop and invent new objects to help solve problems; he lead the product development and manufacturing of FinalStraw. Emma worked in a lab’s pollution prevention department while she earned her master’s degree in environmental management and sustainability at Harvard University. She used her knowledge and experience to ensure the product was environmentally-friendly and biodegradable. FinalStraw began on Kickstarter on April 19, 2018, where it raised $1,894,878 from 38,443 backers within just one month, exceeding the original goal of $12,500. The Kickstarter campaign ended on May 19, and production started in September. FinalStraw began shipping to its backers in November without any delays to the promised schedule. With the massive Kickstarter success, FinalStraw founders Miles Pepper and Emma Cohen went on Shark Tank two months after starting the Kickstarter campaign. They were looking for a shark who would invest and guide their company to success. FinalStraw on Shark Tank FinalStraw’s founders Miles Pepper and Emma Cohen appeared on Shark Tank’s season 10 premiere. The founders were seeking $625,000 for 5% of their company. They pitched their product to the tanks, demonstrating its necessity by showing the sharks what the 5,700 plastic straws used in the US every second looked like. The sharks were impressed by their pitch and were given samples of the product. The founders demonstrated the impact of plastic straws on sea life by showing the sharks a sea turtle with a whole plastic straw inside its nostril. Miles and Emma told their story and how they co-founded FinalStraw as the judges tested their product. Miles claimed each straw costs $5 to make and they sell it for $20. Lori was interested in the company’s sales based on the valuation. Emma told the sharks about the Kickstarter campaign and the $1.89 million raised. She claimed that they also have pre-orders on their website, which have been making $15,000 a day in sales. Kevin O’Leary was concerned that large companies couldn’t afford to use the product. He stated that Starbucks had attempted to switch to paper straws, but they cost more than four times plastic straws to produce, and they become soggy when used for hot beverages. Emma countered this by stating that paper straws were single-use, thus ineffective at halting pollution as they would still require lots of energy and water to produce. Lori loved the idea and agreed with Emma; however, she knew there were lots of products with the same idea, and FinalStraw has never been used and tested by consumers yet, so she decided to withdraw from the deal. Kevin said they were not a company yet, just a mission with a product. He thought it was risky, and the only way for an investor to invest would be to structure a deal that ensures they get their capital back. Kevin made the couple an offer: He would offer them $625,000 for 10% of their company, and he also wanted a royalty of $2 per straw until he gets $1.8 million. Jamie Siminoff, a guess shark for that episode, said that he loved the mission and agrees that pollution needs to be solved. However, he thought changing consumer behavior to carry the straw in their pocket would be too difficult, so he was out. Daymond John also commended the cause, but he said the straw only targeted the 1% of the market that would buy the straw for $20. The straw isn’t for commercial use, so 95% of the market would want to get straws without increasing the cost of living. That would lead to difficulties scaling the company to reach the valuation they sought. That was why Daymond said he was out. Emma tried persuading the sharks about the price, but Kevin became frustrated that she was still pitching her product while he had already made her an offer. She told Kevin that she thought his offer would hurt the company rather than help it, so Kevin withdrew his deal and was out. Mark Cuban had concerns such as knockoffs and marketing, so he offered them $625,000 for 25% of the company. Emma made a counter-offer, $625,000 for 12.5%. Mark refused the offer and was out of the deal. With that, FinalStraw leaves the Shark Tank without a deal. FinalStraw Now in 2024 – The After Shark Tank Update Emma and Miles left Shark Tank without a deal, but that didn’t stop them from turning FinalStraw into a successful business. After the episode aired, FinalStraw gained so much traction that cheaper knockoffs started appearing in stores and on websites like Amazon, eBay, and Alibaba. The company had to use its resources to receive a utility patent for its product, which helped them combat cheap knockoffs in the US. By the end of 2018, the company had made $4.8 million in sales. FinalStraw eventually found its way on shelves in retailers across the US. The company shipped the straws for its Kickstarter backers in November, and soon after that tensions between the founders Emma and Miles increased. Emma sued Miles for launching a rival reusable straw company. Miles retaliated by locking the company’s properties and freezing its credit cards. The suit eventually settled, and the founders fell off causing Miles to leave the company and Emma to take over. Miles moved on to other projects that would help the environment; he soon launched Sanikind on Kickstarter, which raised $317,736. Emma continued work on FinalStraw, seeking retailers and contracts. In August 2019, FinalStraw was rebranded as Final to fit the company’s goal of creating reusable products for single-use items. In March 2020, Final launched its newest product, the FinalWipe, on Kickstarter. The Kickstarter raised its $50,000 goal within 8 hours and managed to raise $256,735 within one month. The company then launched its next product, the BiggieStraw, in August 2020; a large reusable straw for drinking smoothies and milkshakes. The company’s latest product is the FinalFork and FinalSpork, collapsable reusable utensils to replace plastic forks and sporks. Final launched FinalFork and FinalSpork on their website on August 2020, FinalStraw has greatly expanded and improved since its appearance on Shark Tank. The company, now called Final, currently has five products in 2022, with annual revenue of $7,000,000. Final continues to expand and create new products that help the environment by disposing of single-use plastics. Find out more on their website here.","filter_flag":1}
