{"title":"Packsize's X5 Erected Box System Named Finalist for 2023 MHI Innovation Award - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzk3NDQxLXBhY2tzaXplcy14NS1lcmVjdGVkLWJveC1zeXN0ZW0tbmFtZWQtZmluYWxpc3QtZm9yLTIwMjMtbWhpLWlubm92YXRpb24tYXdhcmTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzk3NDQxLXBhY2tzaXplcy14NS1lcmVjdGVkLWJveC1zeXN0ZW0tbmFtZWQtZmluYWxpc3QtZm9yLTIwMjMtbWhpLWlubm92YXRpb24tYXdhcmTSAQA?oc=5","id":"CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzk3NDQxLXBhY2tzaXplcy14NS1lcmVjdGVkLWJveC1zeXN0ZW0tbmFtZWQtZmluYWxpc3QtZm9yLTIwMjMtbWhpLWlubm92YXRpb24tYXdhcmTSAQA","guidislink":false,"published":"Fri, 17 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=76, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzk3NDQxLXBhY2tzaXplcy14NS1lcmVjdGVkLWJveC1zeXN0ZW0tbmFtZWQtZmluYWxpc3QtZm9yLTIwMjMtbWhpLWlubm92YXRpb24tYXdhcmTSAQA?oc=5\" target=\"_blank\">Packsize's X5 Erected Box System Named Finalist for 2023 MHI Innovation Award<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Packsize's X5 Erected Box System Named Finalist for 2023 MHI Innovation Award - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzk3NDQxLXBhY2tzaXplcy14NS1lcmVjdGVkLWJveC1zeXN0ZW0tbmFtZWQtZmluYWxpc3QtZm9yLTIwMjMtbWhpLWlubm92YXRpb24tYXdhcmTSAQA?oc=5\" target=\"_blank\">Packsize's X5 Erected Box System Named Finalist for 2023 MHI Innovation Award<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Design for recycling\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Packsize®, the market leader in sustainable, right-sized, on-demand packaging, has announced that its new X5® solution is a finalist for the 2023 MHI Innovation Award for Best New Innovation. The X5 is the world’s first fully-automated erected box system and the most advanced, flexible, efficient and sustainable platform available for the e-commerce industry. MHI is an international trade association representing the material handling, logistics and supply chain industries since 1945. The association sponsors the ProMat expo to showcase its member companies' products and services and educate manufacturing and supply chain professionals. The MHI Innovation Award highlights the latest manufacturing and supply chain products and services. “We are truly honored to be recognized by MHI for our newly launched X5 solution,” said Rod Gallaway, CEO of Packsize. “Our innovations with the X5 enable manufacturers to navigate various challenges concerning packaging, labor and customer demand, and environmental impact mitigate while providing increased throughput by automating previously time-consuming processes. We are thankful for the opportunity to share these benefits with our industry colleagues at ProMat. We strive to support them in achieving their sustainability goals and business objectives with our efficient, industry-leading, right-sized packaging solution.” The Packsize X5 solution produces ready-to-pack, right-sized erected boxes at an industry-leading speed of up to 600 boxes per hour. The new X5 machine significantly enhances e-commerce providers’ and manufacturers’ ability to meet customer demand, while addressing labor shortages, associated costs, and waste concerns. Like all Packsize solutions, the X5 reduces packaging waste caused by boxes that are, on average, 40 percent oversized. Right-sizing boxes also eliminates the need for void fillers like plastic air pillows, reduces shipping emissions, and improves the end-consumer's overall experience by providing a perfectly sized box, every time. In addition, companies can minimize their costs and environmental impact associated with extraneous and unneeded corrugated boxes and filler, while improving parcel logistics, fitting 66% more boxes on freight and delivery carrier vehicles. On March 20, finalists will present their unique solutions to a panel of independent judges at ProMat 2023 in Chicago. MHI will announce the winners on March 22. Packsize will exhibit at booth #S3547 during ProMat, March 20-23, where you can speak to a Packsize representative about the new X5 machine. To learn more about Packsize, please visit www.packsize.com.","filter_flag":1}
