{"title":"Leading Light Wind Submits Offshore Wind Project Bid in New Jersey, Expands American-Led Vision to Chart a Clean ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlYWRpbmctbGlnaHQtd2luZC1zdWJtaXRzLW9mZnNob3JlLXdpbmQtcHJvamVjdC1iaWQtaW4tbmV3LWplcnNleS1leHBhbmRzLWFtZXJpY2FuLWxlZC12aXNpb24tdG8tY2hhcnQtYS1jbGVhbi1lbmVyZ3ktZnV0dXJlLTMwMTg5Mzk5NS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlYWRpbmctbGlnaHQtd2luZC1zdWJtaXRzLW9mZnNob3JlLXdpbmQtcHJvamVjdC1iaWQtaW4tbmV3LWplcnNleS1leHBhbmRzLWFtZXJpY2FuLWxlZC12aXNpb24tdG8tY2hhcnQtYS1jbGVhbi1lbmVyZ3ktZnV0dXJlLTMwMTg5Mzk5NS5odG1s0gEA?oc=5","id":"CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlYWRpbmctbGlnaHQtd2luZC1zdWJtaXRzLW9mZnNob3JlLXdpbmQtcHJvamVjdC1iaWQtaW4tbmV3LWplcnNleS1leHBhbmRzLWFtZXJpY2FuLWxlZC12aXNpb24tdG8tY2hhcnQtYS1jbGVhbi1lbmVyZ3ktZnV0dXJlLTMwMTg5Mzk5NS5odG1s0gEA","guidislink":false,"published":"Fri, 04 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=216, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlYWRpbmctbGlnaHQtd2luZC1zdWJtaXRzLW9mZnNob3JlLXdpbmQtcHJvamVjdC1iaWQtaW4tbmV3LWplcnNleS1leHBhbmRzLWFtZXJpY2FuLWxlZC12aXNpb24tdG8tY2hhcnQtYS1jbGVhbi1lbmVyZ3ktZnV0dXJlLTMwMTg5Mzk5NS5odG1s0gEA?oc=5\" target=\"_blank\">Leading Light Wind Submits Offshore Wind Project Bid in New Jersey, Expands American-Led Vision to Chart a Clean ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Leading Light Wind Submits Offshore Wind Project Bid in New Jersey, Expands American-Led Vision to Chart a Clean ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xlYWRpbmctbGlnaHQtd2luZC1zdWJtaXRzLW9mZnNob3JlLXdpbmQtcHJvamVjdC1iaWQtaW4tbmV3LWplcnNleS1leHBhbmRzLWFtZXJpY2FuLWxlZC12aXNpb24tdG8tY2hhcnQtYS1jbGVhbi1lbmVyZ3ktZnV0dXJlLTMwMTg5Mzk5NS5odG1s0gEA?oc=5\" target=\"_blank\">Leading Light Wind Submits Offshore Wind Project Bid in New Jersey, Expands American-Led Vision to Chart a Clean ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Leading Light Wind is a bold proposal to help meet New Jersey's energy goals and advance a domestic offshore wind industry. The project will sit more than 40 miles off the coast. It will power up to 1 million New Jersey homes and improve health outcomes by offsetting over 4 million tons of carbon dioxide annually during its operation. Leading Light Wind will also support thousands of family-sustaining jobs over its operational life and represents over $3 billion in economic development benefits for the Garden State, including transformational offshore wind infrastructure and supply chain investments. Leading Light Wind is a partnership between lead developer Invenergy and co-developer energyRe. \"Leading Light Wind exemplifies Invenergy's dedication to American-led energy innovation and our unmatched ability to increase U.S. competitiveness in the offshore wind market,\" said Bryan Schueler, Senior Executive Vice President, and Construction Business Leader for Invenergy. \"With strong partners in New Jersey, we are committed to delivering the benefits of the clean energy economy to Garden State residents for generations to come.\" \"Leading Light Wind is ready to build out a world-leading domestic offshore wind industry with American-led ingenuity and expertise,\" said Ryan Brown, Chief Operating Officer for energyRe. \"Our proposal for New Jersey represents critical investments in energy infrastructure, local resiliency, and a just transition to a green economy. energyRe is proud to help chart a clean energy future for the Garden State.\" Leading Light Wind is proposing supply chain and infrastructure investments that include localizing a wind turbine generator (WTG) tower manufacturing facility and performing marshalling activities at the New Jersey Wind Port; the expansion of the EEW American Offshore Structures monopile manufacturing facility; and development of an in-state operations and maintenance port. The proposal also includes a battery storage option that would provide 253 MW of advanced energy storage to facilitate grid and ratepayer benefits, advancing New Jersey's ambitious 2 GW energy storage target. To support local workforce development, Leading Light Wind signed a Memorandum of Understanding (MOU) with five New Jersey labor unions that prioritizes union construction for the project and supports lifelong career opportunities in the offshore wind sector. The MOU also endorses hiring and training practices to promote a diverse, next-generation workforce. As a part of Leading Light Wind's larger community benefits program, the project has also formed strategic partnerships with several educational, career, and workforce institutions across the Garden State. If awarded, Leading Light Wind is committed to building an equitable offshore wind industry in New Jersey, and will establish a statewide community benefits program with up to $150 million in funding to empower local communities, build an inclusive workforce, accelerate the domestic offshore wind supply chain, and pioneer industry-leading and collaborative environmental research. The community benefits program features 25 initial partnership and program opportunities including the following key initiatives: Energy Equity Credit: To reduce energy burden across the state, Leading Light Wind is proposing an innovative program that would lower the electricity bills for more than 200,000 low-income households in New Jersey . To reduce energy burden across the state, Leading Light Wind is proposing an innovative program that would lower the electricity bills for more than 200,000 low-income households in . Waves to Wind: To prepare small businesses for success in New Jersey's growing offshore wind sector, Leading Light Wind will create the Waves to Wind (W2W) program, a catalytic training program focused on capacity-building and technical training to position existing Small, Minority, Woman, and Veteran-owned Business Enterprises ( SMWVBEs ) in New Jersey for success in the state's growing offshore wind sector. SMWVBEs Leading Light Wind Fisheries Accelerator Fund: This fund is uniquely designed to directly benefit the fisheries community by providing financial assistance to support emerging technologies, and initiatives that have the potential to improve the efficiency, sustainability, or economic vitality of the fishing industry. Community-Based Partnerships: Leading Light Wind is also pursuing partnerships with local community-based organizations and institutions such as the Liberty Science Center, Rowan University , Rutgers University , New Jersey Institute of Technology , Waterfront Alliance, Gotham Whale, Boys & Girls Clubs of Monmouth County, Zeem Solutions and more. Leading Light Wind recognizes that meaningful, robust, and ongoing engagement with regulators, Tribal Nations, and stakeholders is critical to New Jersey's offshore wind program. As a committed industry partner and good neighbor, Leading Light Wind will prioritize stakeholder engagement throughout every stage of the project and is engaging with critical marine and fisheries stakeholders to ensure a burgeoning offshore wind industry can thrive alongside existing marine economies and resources. Leading Light Wind builds upon Invenergy and energyRe's record of proven partnership, including the development of Clean Path NY – a landmark clean energy infrastructure project combining a new 175-mile state-of-the-art 1,300 MW HVDC underground transmission line with more than 3,800 MW of new wind and solar power in New York. Additionally, Invenergy is the only American-led company currently developing a multi-project portfolio of offshore wind across U.S. coasts following its recent acquisition of an offshore wind lease from the U.S. Bureau of Ocean Energy Management (BOEM) off the coast of central California. A word from our partners: \"We fully support Leading Light Wind and are committed to working alongside them as they invest in the health and resiliency of New Jersey's most vulnerable and overburdened communities,\" said John E. Harmon, Sr., IOM, founder, President and CEO of the African American Chamber of Commerce of New Jersey. \"Through their Waves to Wind program, Leading Light Wind will build an equitable offshore wind industry that prioritizes community-focused investments and critical technical assistance programs for SMWVBEs.\" \"The Statewide Hispanic Chamber of Commerce of New Jersey is thrilled to support Leading Light Wind's clean energy solutions and mission to diversify the green energy workforce. Through critical investments in New Jersey's small businesses through their Waves 2 Wind program, Leading Light Wind will be an invaluable partner to our economic and workforce development goals and the communities we support,\" said Dr. Jairo Borja, Vice President, Corporate & Entrepreneurial Programs from the Statewide Hispanic Chamber of Commerce New Jersey. \"IBEW is proud to be a partner of Leading Light Wind, working together to advance clean energy solutions and create a brighter future for New Jersey,\" said Ed Hill Jr., International Representative of International Brotherhood of Electrical Workers. \"Our highly trained and skilled electricians are eager to contribute their expertise in integrating renewable energy into the grid, powering homes and businesses with reliable and sustainable electricity.\" \"We are excited to partner with American-led Leading Light Wind in support of their bid into New Jersey's third offshore wind solicitation which, if successful, will enable EEW AOS's Paulsboro monopile facility expansion,\" said Lee Laurendeau, CEO of EEW-AOS. \"This will create significant family-sustaining jobs and economic opportunity for New Jerseyans. I thank Leading Light Wind for prioritizing domestic manufacturing as we work hand in hand to make New Jersey the cornerstone of this important new industry.\" \"With the inclusion of the Energy Equity Credit in their proposal, Leading Light Wind has demonstrated a commitment to the families that New Jersey SHARES works to serve every day and we look forward to learning more about Leading Light Wind's innovative Energy Equity Credit as one more tool to support energy-burdened New Jersey families,\" said Cheryl Stowell from New Jersey SHARES. \"Environmental equality and STEM education go hand in hand as we try to create a more equitable, clean energy future for all,\" said Douglas Eagles, Chief Executive Officer of the Boys & Girls Clubs of Monmouth County. \"Our partnership with Leading Light Wind will provide funding to support our STEM education programs for youth in many of the communities we serve including Asbury Park, Red Bank, Neptune, and Long Branch and enable parents to participate in workforce training programs. It is crucial to ensure that local communities have access to resources, education, and opportunities in the clean energy transition.\" \"Fostering a longstanding industry to reliably meet New Jersey's clean energy needs begins with coordinated investments in job training and education,\" said Anthony Lowman, Provost and Senior Vice President of Academic Affairs for Rowan University. \"With the support of Leading Light Wind, we have the critical opportunity to advance research partnerships and construction management programs across the State.\" \"Rowan College of South Jersey is proud to work with Leading Light Wind to drive innovation in offshore wind technology and training through our wind turbine technician program,\" said Brenden Rickards, Ph.D., Vice President and Provost of Rowan College of South Jersey. \"Leading Light Wind's support will help foster our mission to expand access to green workforce and clean energy educational opportunities across South Jersey.\" \"A partnership with NJIT demonstrates Leading Light Wind's commitment to comprehensive supply chain and research opportunities that will support the long-term sustainability of offshore wind. As New Jersey's only public polytechnic research university, NJIT offers vast resources to educate the next generation of offshore wind engineers, innovators, and leaders,\" said Dr. Teik C. Lim, President of New Jersey Institute of Technology. \"We're proud to collaborate with Leading Light Wind as we further our longstanding commitment to increasing access to rewarding and productive STEM careers.\" \"New Jersey's bold clean energy goals create a historic opportunity to advance access to family-supporting jobs and careers. New Jersey's Community Colleges, through our Center of Workforce Innovation for Offshore Wind, are committed to partnering with Leading Light Wind and the entire industry to build an inclusive, skilled workforce for the thousands of future job opportunities,\" said Catherine F. Starghill, Esq., Executive Director from New Jersey Community College Consortium for Workforce and Economic Development. \"Leading Light Wind will bring wide-ranging, long-term economic benefits throughout South Jersey and beyond,\" said Christina Renna, President & CEO of the Chamber of Commerce Southern New Jersey. \"We fully support this project and are excited to support the expansion of a sustainable, reliable offshore wind industry driven by the contributions of our South Jersey small and mid-sized businesses.\" \"The New Jersey Chamber of Commerce is proud to support Leading Light Wind, a project that will bring wide-ranging, long-term investment and opportunities for New Jersey businesses and communities,\" said Michael Egenton, EVP, Government Relations, New Jersey Chamber of Commerce. \"We fully support this project and New Jersey offshore wind as a whole, as a transformative opportunity for New Jersey businesses to grow to support this new industry.\" \"Newlab is focused on accelerating critical technologies to market by helping to break down barriers deep-tech companies face. We are excited to partner with Leading Light Wind to establish a platform focused on advancing early-stage offshore wind-related technologies through real-world testing and collaborative projects that bring together startups and key players across the offshore wind value chain to derisk new technologies and commercial models,\" said Liz Keen, Chief Business Officer, Newlab. \"Leading Light Wind was a presenting partner in our New Jersey Clean Energy DEIJ Day and New Jersey Environmental Justice Bus Tour. Activations such as these showcase stakeholders like Leading Light Wind who are advancing offshore wind supplier diversity, workforce development, and community investments that benefit New Jersey residents and businesses across the state,\" says lifelong New Jersey resident Brian Moore, Supply Chain + Economic Development Manager for economic development and social equity development firm MRV Group. \"We congratulate Leading Light Wind for their state submission to the BPU and are excited for the future of New Jersey for a just and equitable clean energy transition for all.\" \"Waterfront Alliance's partnership with Leading Light Wind will establish a grant program that allows us to provide customized solutions to revitalize and sustain waterfronts in the region including maritime activation to better connect people to their local waterfront,\" said Cortney Koenig Worrall, President and CEO, Waterfront Alliance. \"Environmental justice communities in New Jersey are deserving of smart plans for maritime activation, public access, resilience, and economic development through funding small-scale planning projects. We are excited to partner with Leading Light Wind to advance responsible offshore wind development that brings waterfront benefits to environmental justice communities and boosts resiliency in local communities as we transition to a clean energy future. We are proud that Leading Light Wind has committed to designing port facilities that adhere to Waterfront Alliance's rigorous Waterfront Edge Design Guidelines (WEDG) standards for ecology and mitigating climate impacts to coastal infrastructure. This commitment ensures that Waterfront Alliance can verify the resilience, ecological, and public access benefits in communities where waterfront operations take place.\" \"Gotham Whale's partnership with Leading Light Wind allows us to increase our funding of ongoing marine mammal data collection, citizen science efforts, and youth education programs. We are dedicated to improving the health of the marine environment in the New York Bight through education, advocacy, and science – so we are thrilled to be a Leading Light Wind community partner because they have shown their commitment to including marine stakeholders in their project and ensuring environmentally responsible offshore wind development,\" said Paul L. Sieswerda, Executive Director, Gotham Whale. \"Partnering with Leading Light Wind will allow us to expand professional development trainings for teachers in New Jersey, bring experiential environmental programming to schools, and cultivate workforce pathways in green careers for rising high school seniors,\" said Tara Stafford Ocansey, Executive Director, Children's Environmental Literacy Foundation. \"The Children's Environmental Literacy Foundation is committed to establishing sustainability as an integral part of every child's K-12 learning experience, and this partnership underscores the importance of youth STEM education to build a sustainable clean energy future.\" \"Our partnership with Leading Light Wind will help drive the electrification of New Jersey's commercial fleets, reduce harmful fossil fuel emissions and air pollution, and make a positive impact on the environment and the health of communities in the region,\" said Paul Gioupis of Zeem Solutions. \"We are dedicated to advancing clean mobility projects in the state, and together with Leading Light Wind, we are committed to improving air quality in overburdened communities. This collaboration is a significant milestone towards a sustainable future for New Jersey.\" About Leading Light Wind Leading Light Wind is an American-led offshore wind project that will bring locally sourced, renewable energy to the East Coast. A partnership between lead developer Invenergy and co-developer energyRe, we believe in empowering the communities where we live and work. Leading Light Wind will build on our track record of impactful community engagement and innovation in sustainable American infrastructure to advance public health, create good-paying jobs, and support our local supply chain. Learn more at leadinglightwind.com. About Invenergy Invenergy drives innovation in energy. Invenergy and its affiliated companies develop, own, and operate large-scale renewable and other clean energy generation and storage facilities in the Americas, Europe, and Asia. Invenergy's home office is located in Chicago, and it has regional development offices in the United States, Canada, Mexico, Spain, Japan, Poland, and Scotland. Invenergy and its affiliated companies have successfully developed more than 30,000 megawatts of projects that are in operation, construction, or contracted, including wind, solar, transmission infrastructure and natural gas power generation and advanced energy storage projects. Learn about Invenergy at Invenergy.com. About energyRe energyRe, LLC is a leading independent energy company focused on solving complex sustainability challenges and providing clean energy solutions in utility-scale offshore and onshore wind and solar generation, energy storage, transmission, and distributed generation. Guided by the principles of innovation and partnership and backed by expertise and experience, energyRe is committed to creating a reliable, renewable energy future for all. energyRe has offices in New York, Houston, Indianapolis, and Charleston. For more information about energyRe, visit www.energyre.com. SOURCE Leading Light Wind","filter_flag":1}
{"title":"Indian auto industry is driving sustainable mobility through 6 initiatives - Business Standard","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s0gGSAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s0gGSAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s?oc=5","id":"CBMijgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s0gGSAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s","guidislink":false,"published":"Tue, 01 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=213, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s0gGSAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s?oc=5\" target=\"_blank\">Indian auto industry is driving sustainable mobility through 6 initiatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Standard<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Indian auto industry is driving sustainable mobility through 6 initiatives - Business Standard","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s0gGSAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvaW5kdXN0cnkvYXV0by9pbmRpYW4tYXV0by1pbmR1c3RyeS1pcy1kcml2aW5nLXN1c3RhaW5hYmxlLW1vYmlsaXR5LXRocm91Z2gtNi1pbml0aWF0aXZlcy0xMjMwODAxMDAzMjhfMS5odG1s?oc=5\" target=\"_blank\">Indian auto industry is driving sustainable mobility through 6 initiatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Standard<\/font>","source.href":"https:\/\/www.business-standard.com","source.title":"Business Standard","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"As India shifts gears to meet its net-zero target by 2070, the transition towards clean energy and multiple decarbonisation initiatives will optimise the use of the country's energy mix and reduce the proportion of fossil fuels over the long run. Since the Indian automotive industry has always been a key indicator of the nation’s economic growth, contributing to approximately 6.5 per cent of India’s overall gross domestic product; 40 per cent of its manufacturing GDP and supporting about 30 million direct and indirect jobs, the growth of this industry should be in sync with the government’s vision of ‘green growth’. The clear roadmap laid down by the government to ultimately reach the target of net zero by 2070 as outlined in ‘Panchamrit’, announced by the Prime Minister during COP 26 held in Glasgow in 2021, would be the guiding factor for the industry. ‘Panchamrit’ also has short-term and mid-term goals for the country. including reduction in carbon intensity. Clean-energy solutions in the transportation sector would play an important role in achieving these goals, as our new vehicles continue to become increasingly carbon benign. In order to align with these government targets, the auto industry adopted BS VI Phase 2 Emission Norms from April 2023, just three years after transiting to BS VI Emission norms in 2020. The industry graduated to the next stage of fuel efficiency norms, for passenger vehicles, from 2022 and is meeting the new fuel efficiency regulations for commercial vehicles from April 2023. These have resulted in the introduction of new products in the market ranging from electric vehicles, hybrid vehicles, CNG \/ LNG vehicles and vehicles capable of operating on petrol blended with up to 20 per cent of ethanol. Going forward, the industry would need to continue to build on a strong foundation of sustainability, environmental consciousness and safety. Hence, a range of initiatives have been introduced by the Indian automobile industry under the aegis of the Society of Indian Automobile Manufacturers (SIAM). The six key initiatives being pursued are as follows: The first is biofuels. Through a campaign called ‘Javik Pahal’, the industry promotes biofuels produced from renewable biological materials. Alternative fuels can play a pivotal role to power vehicles, reducing the reliance on petroleum imports, lowering greenhouse gas emissions and also improving farmer incomes. The second relates to the focus on electrification via the initiative of ‘Vidyutikaran’ that aims to promote alternatives to fossil fuels by powering vehicles with electric batteries, fuel cells and hybrid or plug-in hybrid technologies. The third pertains to ‘Chakriyata’, an initiative focusing on recycling and the circular economy. This will minimise waste and ensure that resources are used efficiently and sustainably. The Indian automobile industry will steadfastly support the recycling of end-of-life vehicles and material circularity across different types of power trains to foster environmental sustainability. The fourth initiative is linked to encouraging adoption of gas-based fuels through a campaign of ‘Gas Gatisheelta’, which retains the focus on CNG and LNG-based mobility, especially for passenger vehicles, three-wheelers, buses and trucks. The fifth is the focus on hydrogen mobility through an initiative called ‘Harit Hydrogen’ in alignment with the recently announced Green Hydrogen Mission of the government. The sixth and final initiative is associated with road safety through a campaign on ‘Surakshit Safar’ (Safe Journey). Safety is the prime pillar in this initiative as India accounts for the highest number of road fatalities worldwide at 11 per cent, despite having only 1 per cent of the world’s vehicles. To address this concern, the Indian automobile industry is working with multiple stakeholders to execute the ‘4 Es’ of Road Safety: Education, engineering, enforcement, and emergency care. To support this, Indian OEMs have upgraded their vehicles’ engineering standards in tandem with the UN norms for new and advanced safety features. Moreover, the government is continuously expanding the pan-India network of high-quality roads and highways, which calls for more focus on the entire narrative of ‘Surakshit Safar’. The auto industry did demonstrate its commitment to the government’s overall ‘Green Growth’ agenda during Auto Expo – The Motor Show 2023 in Greater Noida. What clearly stood out at the show was an excellent showcase of vehicles using different types of power-train technologies ranging from gaseous fuels like a CNG \/ LNG, to bio fuels like ethanol or flex fuel vehicles, to electric vehicles including Battery Electric & Hybrid, to even hydrogen vehicles. This demonstrated the direction the Indian automobile industry has taken to move towards sustainable mobility and de-carbonisation. As the Indian economy further strengthens in spite of global geo-political and economic headwinds, there is no doubt the Indian automobile industry will be instrumental in steering the path towards greater green growth and market buoyancy. The writer is president, SIAM, and MD & CEO, Volvo Eicher Commercial Vehicles Ltd. These are the personal opinions of the writer. They do not necessarily reflect the views of www.business-standard.com or the 'Business Standard' newspaper","filter_flag":1}
{"title":"TCL Kicks Off #OurBeautifulGame Campaign and Recognizes Inspiring Women During World's Largest Women's ... - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL3RjbC1raWNrcy1vZmYtb3VyYmVhdXRpZnVsZ2FtZS1jYW1wYWlnbi1hbmQtcmVjb2duaXplcy1pbnNwaXJpbmctd29tZW4tZHVyaW5nLXdvcmxkLXMtbGFyZ2VzdC13b21lbi1zLWZvb3RiYWxsLWV2ZW50LTg0OTM5ODYyMC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL3RjbC1raWNrcy1vZmYtb3VyYmVhdXRpZnVsZ2FtZS1jYW1wYWlnbi1hbmQtcmVjb2duaXplcy1pbnNwaXJpbmctd29tZW4tZHVyaW5nLXdvcmxkLXMtbGFyZ2VzdC13b21lbi1zLWZvb3RiYWxsLWV2ZW50LTg0OTM5ODYyMC5odG1s0gEA?oc=5","id":"CBMiqQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL3RjbC1raWNrcy1vZmYtb3VyYmVhdXRpZnVsZ2FtZS1jYW1wYWlnbi1hbmQtcmVjb2duaXplcy1pbnNwaXJpbmctd29tZW4tZHVyaW5nLXdvcmxkLXMtbGFyZ2VzdC13b21lbi1zLWZvb3RiYWxsLWV2ZW50LTg0OTM5ODYyMC5odG1s0gEA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL3RjbC1raWNrcy1vZmYtb3VyYmVhdXRpZnVsZ2FtZS1jYW1wYWlnbi1hbmQtcmVjb2duaXplcy1pbnNwaXJpbmctd29tZW4tZHVyaW5nLXdvcmxkLXMtbGFyZ2VzdC13b21lbi1zLWZvb3RiYWxsLWV2ZW50LTg0OTM5ODYyMC5odG1s0gEA?oc=5\" target=\"_blank\">TCL Kicks Off #OurBeautifulGame Campaign and Recognizes Inspiring Women During World's Largest Women's ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TCL Kicks Off #OurBeautifulGame Campaign and Recognizes Inspiring Women During World's Largest Women's ... - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL3RjbC1raWNrcy1vZmYtb3VyYmVhdXRpZnVsZ2FtZS1jYW1wYWlnbi1hbmQtcmVjb2duaXplcy1pbnNwaXJpbmctd29tZW4tZHVyaW5nLXdvcmxkLXMtbGFyZ2VzdC13b21lbi1zLWZvb3RiYWxsLWV2ZW50LTg0OTM5ODYyMC5odG1s0gEA?oc=5\" target=\"_blank\">TCL Kicks Off #OurBeautifulGame Campaign and Recognizes Inspiring Women During World's Largest Women's ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"SHENZHEN, China, Aug. 17, 2023 \/CNW\/ -- TCL, a leading global intelligent technology company, is recognizing inspiring women who are forging new standards and creating new rules in the beautiful game of football in its latest global campaign, #OurBeautifulGame, an extension of the flagship #TCLforHer initiative which aims to inspire and encourage girls and women from around the world to redefine greatness on their own terms. TCL unites women in the beautiful game of football with Warner Bros. Discovery In collaboration with Warner Bros. Discovery (WBD), a leading global media and entertainment enterprise, TCL has launched #OurBeautifulGame, an integrated creative marketing campaign celebrating the beauty of football, amidst one of the most watched women's sporting events of the year. \"For years, TCL has been empowering girls and women worldwide through our innovative technology and far-reaching initiatives and campaigns that embrace education and sport,\" said Yuki Wei, Vice President of TCL Technology and Chairman of the TCL Charity Foundation. \"With #OurBeautifulGame, we are excited to connect customers and fans with three trailblazers in women's football and inspire them to nurture their own greatness.\" Spotlighting Geyse Ferreria, Brazilian professional football player; Chan Yuen Ting, head coach of Jiangsu L.F.C and the first woman to lead a top-tier men's team in a professional championship; as well as Victoria Haydn, professional photographer known for her work with Manchester City, the campaign is featured in multiple brands under WBD, including Eurosport, Bleacher Report and Vox media. \"To me, the beautiful game means passion, emotion and a sense of belonging. Having women in the game of football is beneficial. It brings new ideas and different perspectives. You have to live it and breathe it, then it becomes part of your soul and part of personal greatness,\" said Victoria Haydn. TCL demonstrates unwavering commitment to empowering women TCL has a longstanding commitment towards supporting girls and women on their journey to greatness through a wide variety of global initiatives under #TCLforHer. Inspired by the principles of beauty, courage, tenacity, wisdom and loving, the company sets out to utilize technology to unleash every girl and woman's true potential and empower them to drive change. Since its launch in 2020, #TCLforHer has spotlighted many female figures who are breaking boundaries and challenging stereotypes, celebrating their stories in a bid to encourage fellow women to live their lives to the fullest as they learn from the perspectives of others and gain valuable insights. In 2022, TCL elevated the campaign to a wider audience by introducing stories and accounts from women about navigating their own path and staying true to their goals and values. Meanwhile, through Huameng Foundation, which funds various female-focused programs and educational initiatives, TCL has enabled close to 1,000 young women from underprivileged families to complete high school and tertiary studies. In line with promoting the empowerment and personal development of girls and women, TCL is also supporting the Brazil women's national football team in the biggest international tournament yet, taking place from July 20 to August 20 in Australia and New Zealand. TCL redefines greatness in every aspect of life TCL believes technology can be a great equalizer in our society, with the potential to challenge unfair biases about girls and women, raise expectations and inspire greatness. To TCL, greatness can be found at every touchpoint in life and in all walks of life. Sports, in particular, has an undeniable impact on the hearts and lives of people from all corners of the world. With that in mind, in addition to supporting some of world's best global sports events, TCL is making sports viewing at home more enjoyable and entertaining than ever with its full portfolio of quality TV products. Equipped with Mini LED local dimming and unparalleled 144Hz refresh rate, TCL C835 Series provides an ultra-smooth viewing experience without annoying tearing and stuttering. Its professional ONKYO sound system with Dolby Atmos promises crisp sound that will travel around you. TCL C635 Series, another 4K TV, boasts outstanding image quality and excellent audio effect with the help of Quantum Dot and ONKYO sound system. With pre-installed Google TV system, users can enjoy a faster, easier and more convenient entertainment experience. Featuring brighter colors, higher refresh rate and more immersive audio, TCL's TV lineup is enabling fans everywhere to enjoy the beautiful game of football and witness greatness as achieved by some of the world's best female football players on the field. Through #TCLforHer, TCL continues to harness the power of technology and sports to inspire and empower girls and women around the world as they pursue and redefine greatness in different aspects of their lives. About TCL TCL is a leading global intelligent technology company with a mission to \"Inspire Greatness\". As a leading technology company, TCL provides diversified consumer electronics covering TVs, smartphones, audio and smart home products, as well as display technology and clean energy solutions. TCL is committed to bringing smart technology experiences and healthy lifestyles to consumers around the world. SOURCE TCL Jade Dong, [email protected]","filter_flag":1}
{"title":"SSE opens two ultra-rapid hubs - transportandenergy - Transport + Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA4LzE3L3NzZS1vcGVucy10d28tdWx0cmEtcmFwaWQtaHVicy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA4LzE3L3NzZS1vcGVucy10d28tdWx0cmEtcmFwaWQtaHVicy_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA4LzE3L3NzZS1vcGVucy10d28tdWx0cmEtcmFwaWQtaHVicy_SAQA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA4LzE3L3NzZS1vcGVucy10d28tdWx0cmEtcmFwaWQtaHVicy_SAQA?oc=5\" target=\"_blank\">SSE opens two ultra-rapid hubs - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SSE opens two ultra-rapid hubs - transportandenergy - Transport + Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA4LzE3L3NzZS1vcGVucy10d28tdWx0cmEtcmFwaWQtaHVicy_SAQA?oc=5\" target=\"_blank\">SSE opens two ultra-rapid hubs - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","source.href":"https:\/\/transportandenergy.com","source.title":"Transport + Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"SSE Energy Solutions has opened two new publicly accessible ultra-rapid hubs in the past week as the construction of charging facilities accelerates. A 10-bay EV charging hub has been opened at its Spa Road depot in Melksham, increasing the number of ultra-rapid chargers in the area tenfold, and another in conjuction with M7 Real Estate in Great Yarmouth. As well as being available for public use, the 5 Dual Head ultra-rapid 150kW chargers across 10 EV Charging bays, will service SSE’s local fleet of electric vehicles at Melksham. The high-powered charging units have the potential to allow drivers to resume their journey in just a few minutes . SSE plans to build 500 ultra-rapid EV charging hubs powered by traceable, renewable energy in the UK and Ireland by 2030 with several sites already open or under construction including those in Glasgow and Dundee. Simon Gray, head of fleet for SSE, said: “SSE is putting its money where its mouth is. As part of our Net Zero Acceleration Plan, we’re investing £10 million a day to unleash the low-carbon infrastructure that the UK needs for its net zero transition as part of our commitment to invest £12.5 billion in clean energy solutions by 2026. “The installation of charging hubs based on our own sites where SSE Fleet vehicles operate will assist us greatly as we transition over 2,500 vehicles to zero emissions by 2030. With the added benefit of opening-up these charging facilities to the public where possible, we can provide even more support to local communities and fleets to help reduce harmful emissions from transport.” The news follows the first of SSE’s ultra-rapid electric vehicle charging hubs being built in conjunction with M7 Real Estate opened by former cabinet minister and local MP, Sir Brandon Lewis CBE. The 10-bay hub at Gapton Hall Retail Park in Great Yarmouth features 150kW charge units which have the potential to allow drivers to resume their journey in just a few minutes , as well as a 22kW charger meaning users have a choice of how to charge when visiting the site. The hub is the first of a potential 50 charging stations installed on sites managed by M7 Real Estate (M7). Kevin Welstead, EV sector director at SSE Energy Solutions said: “Gapton Hall is a great example of the sort of hubs that cater to the everyday EV driver, perfectly located to make charging your car straightforward and convenient. “We’re pressing ahead with our ambitious EV charging infrastructure plans and I look forward to delivering hubs to people right across the UK, both in conjunction with M7 but also with the 500 hubs we plan to build ourselves over the next seven years.” Image courtesy of SSE Energy Solutions Share this: LinkedIn Twitter Facebook Email ","filter_flag":1}
{"title":"Mosaic Names Patrick Moore CEO; Founder Billy Parish to Become Executive Chair of the Board - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vc2FpYy1uYW1lcy1wYXRyaWNrLW1vb3JlLWNlby1mb3VuZGVyLWJpbGx5LXBhcmlzaC10by1iZWNvbWUtZXhlY3V0aXZlLWNoYWlyLW9mLXRoZS1ib2FyZC0zMDE4OTA2MTUuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vc2FpYy1uYW1lcy1wYXRyaWNrLW1vb3JlLWNlby1mb3VuZGVyLWJpbGx5LXBhcmlzaC10by1iZWNvbWUtZXhlY3V0aXZlLWNoYWlyLW9mLXRoZS1ib2FyZC0zMDE4OTA2MTUuaHRtbNIBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vc2FpYy1uYW1lcy1wYXRyaWNrLW1vb3JlLWNlby1mb3VuZGVyLWJpbGx5LXBhcmlzaC10by1iZWNvbWUtZXhlY3V0aXZlLWNoYWlyLW9mLXRoZS1ib2FyZC0zMDE4OTA2MTUuaHRtbNIBAA","guidislink":false,"published":"Tue, 01 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=213, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vc2FpYy1uYW1lcy1wYXRyaWNrLW1vb3JlLWNlby1mb3VuZGVyLWJpbGx5LXBhcmlzaC10by1iZWNvbWUtZXhlY3V0aXZlLWNoYWlyLW9mLXRoZS1ib2FyZC0zMDE4OTA2MTUuaHRtbNIBAA?oc=5\" target=\"_blank\">Mosaic Names Patrick Moore CEO; Founder Billy Parish to Become Executive Chair of the Board<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mosaic Names Patrick Moore CEO; Founder Billy Parish to Become Executive Chair of the Board - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vc2FpYy1uYW1lcy1wYXRyaWNrLW1vb3JlLWNlby1mb3VuZGVyLWJpbGx5LXBhcmlzaC10by1iZWNvbWUtZXhlY3V0aXZlLWNoYWlyLW9mLXRoZS1ib2FyZC0zMDE4OTA2MTUuaHRtbNIBAA?oc=5\" target=\"_blank\">Mosaic Names Patrick Moore CEO; Founder Billy Parish to Become Executive Chair of the Board<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Daniel Budington joins as Chief Financial Officer OAKLAND, Calif., Aug. 1, 2023 \/PRNewswire\/ -- Mosaic , a leading fintech platform for U.S. residential solar and energy-efficient home improvements, today announced that President and Chief Operating Officer Patrick Moore has been named Chief Executive Officer. After leading the company for 13 years and serving as CEO since 2015, founder Billy Parish will become Executive Chair of the Board. Patrick Moore, Chief Executive Officer, Mosaic Billy Parish, Executive Chair of the Board, Mosaic Additionally, Daniel Budington will be joining the company as Chief Financial Officer. He joins from Santander, where he spent nearly a decade in various strategy, corporate development and finance roles, including most recently serving as Chief Strategy Officer and previously as Head of Financial Planning and Analysis. Outgoing CFO Melissa Ballenger will become a senior advisor to the board and will continue to consult for the company. In his new role as Executive Chair, Parish will focus on strategy, major partnerships and policy work to advance Mosaic's vision of 100% clean energy for all and accelerate the growth of residential clean energy solutions. Parish, who founded the company more than a decade ago, will continue to play a key role at both Mosaic and with industry coalitions. Incoming CEO Moore has been Mosaic's President and COO since November 2017. He has more than 30 years of experience in consumer lending and operations, having previously served as COO of Renovate America, Genesis Financial Solutions and Toyota F.S.B., in addition to over seven years at Capital One and serving as an officer in the U.S. Navy. In each of his COO positions, Moore launched and scaled successful point of purchase financing businesses. Incoming CFO Budington brings deep expertise in balance sheet and capital management, financial planning and analysis, pricing, funding and capital markets. Prior to Santander, he was a financial institutions investment banker with Guggenheim Partners, Deutsche Bank, and Merrill Lynch. Mosaic founder and Executive Chair Billy Parish said, \"Patrick has been an invaluable part of Mosaic's success during his six years as President and COO. As Mosaic enters its next phase of growth, his operational and consumer lending skills will be more important than ever. We will continue to work in complementary ways to increase the awareness and accessibility of sustainable home improvements.\" Mosaic CEO Patrick Moore said, \"Billy isn't just the founder of Mosaic; he's the founder of the modern residential solar lending industry. Billy has been working to fight climate change for two decades as an activist, political influencer, author and entrepreneur. I'm honored to build on the work he has done to help millions of homeowners, contractors and capital providers benefit from the shift to clean energy.\" Moore added, \"As Mosaic grows through new products and partnerships, we're thrilled to bring on Dan's expertise in strategic finance and capital markets. With his experience at some of the world's most respected financial institutions, Dan is the perfect person to add to the work Melissa has done to transform our finance department, building the company's strategic and operational acumen and creating the strongest finance, capital markets and accounting function in the industry.\" Parish co-founded Mosaic in 2010 as a crowdfunding platform for community-scale solar projects. In 2014, the company shifted from crowdfunding to providing finance options for residential solar projects, later expanding to finance a broad array of sustainable home improvements. The company created the industry's first 20-year and 25-year solar loans, first battery-only loan, and the first solar loan option with no payments for 18 months. To date, Mosaic has funded $14 billion in loans for residential solar and sustainable home improvements. About Mosaic Mosaic is an industry-leading fintech platform for sustainable home improvements. With deep, strategic partnerships and a network of thousands of contractors nationwide, we empower homeowners to unlock greater savings, resilience and value in their homes. Founded in 2010, Mosaic is a pioneer in clean energy lending and continues to provide innovative solutions for financing solar, battery storage, heat pumps and more. We doubled our funding volume in 2022 and have funded $14 billion in loans to date, helping more than 370,000 households make their homes more sustainable and save money on their utility bills. Our financing options unlock billions of dollars of capital annually into high-quality ESG assets. Join us in our vision of 100% clean energy for all at joinmosaic.com SOURCE Mosaic","filter_flag":1}
{"title":"Brown Venture Group Invests in Big Navajo Energy - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYnJvd24tdmVudHVyZS1ncm91cC1pbnZlc3RzLWluLWJpZy1uYXZham8tZW5lcmd5LTMwMTkxMjc3My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYnJvd24tdmVudHVyZS1ncm91cC1pbnZlc3RzLWluLWJpZy1uYXZham8tZW5lcmd5LTMwMTkxMjc3My5odG1s0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYnJvd24tdmVudHVyZS1ncm91cC1pbnZlc3RzLWluLWJpZy1uYXZham8tZW5lcmd5LTMwMTkxMjc3My5odG1s0gEA","guidislink":false,"published":"Tue, 29 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=241, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYnJvd24tdmVudHVyZS1ncm91cC1pbnZlc3RzLWluLWJpZy1uYXZham8tZW5lcmd5LTMwMTkxMjc3My5odG1s0gEA?oc=5\" target=\"_blank\">Brown Venture Group Invests in Big Navajo Energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Brown Venture Group Invests in Big Navajo Energy - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYnJvd24tdmVudHVyZS1ncm91cC1pbnZlc3RzLWluLWJpZy1uYXZham8tZW5lcmd5LTMwMTkxMjc3My5odG1s0gEA?oc=5\" target=\"_blank\">Brown Venture Group Invests in Big Navajo Energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Company Focused on the Production of Clean Renewable Energy for Tribal Communities & Beyond MINNEAPOLIS, Aug. 29, 2023 \/PRNewswire\/ -- Brown Venture Group LLC , a Black-owned venture capital firm formed to fund Indigenous, Black, and Latinx technology entrepreneurs, has committed significant financial resources to foster the growth of Big Navajo Energy, which is a Navajo-owned and operated company focused on the development and deployment of clean and renewable energy solutions for tribal and rural communities. \"Big Navajo Energy has spent the past decade bringing clean energy solutions to tribal communities throughout North America and this investment by Brown Venture Group will assist us in continuing to build that self-sufficient ecosystem in order to address energy challenges faced not only by our communities but by rural areas overall,\" said Dory Peters, president and CEO of Big Navajo Energy. Post this Dr. Paul Campbell co-founder and managing partner of Brown Venture Group, Derrick Watchman, chairman of the National Center of American Indian Enterprise Development, Dory Peters, president and CEO of Big Navajo Energy, and Chris Dykstra, partner at Brown Venture Group in front of the Fuel Cell Hydrogen Energy Plant in Long Beach California. Big Navajo Energy , which was founded in 2012, is currently expanding its ability to capture and produce hydrogen from sustainable natural resources on native lands which they will then transport to its customers on and off tribal land and rural communities as an alternative clean fuel of our future. \"Big Navajo Energy has spent the past decade bringing clean energy solutions to tribal communities throughout North America and this investment by Brown Venture Group will assist us in continuing to build that self-sufficient ecosystem in order to address energy challenges faced not only by our communities but by rural areas overall,\" said Dory Peters, president and CEO of Big Navajo Energy. Since launching in 2018, Brown Venture Group has forged important inclusive collaborations with tribal governments nationwide, NASA, and the United States Patent and Trademark Office (a partnership driven by the Pro Bono Advisory Council). In addition, the venture capital fund has invested in more than 30 technology startups in various industries including clean energy, fintech, health, tech, and software. \"Indigenous nations are one of the most underfunded communities with the most upside potential of any group of contributors in America and Brown Venture Group is excited to support the innovations of Big Navajo Energy,\" said Paul Campbell, co-founder and managing partner of Brown Venture Group. According to a recent Olin Brookings Commission report, in 2021, a mere 0.013% of venture dollars were directed to Native Americans, even though they represent 2.09% of the population (Crunchbase, n.d.). \"While venture capital investment in minority communities remains small, it is practically nonexistent in tribal communities,\" said Campbell. \"This is not because there are not good deals in Indian Country. It is because most non-diverse investors lack the relational networks into Tribal communities, and therefore, miss out on differentiated deal flow that is often found in diverse-led innovative businesses.\" About Brown Venture Group Launched in 2018, Brown Venture Group, LLC, is a venture capital firm exclusively for Black, Latinx, and Indigenous technology startups. Brown Venture Group is writing a new playbook for those interested in launching a minority-owned technology startup and those interested in investing in new technologies. For more information go to brownventuregroup.com. SOURCE Brown Venture Group","filter_flag":1}
{"title":"BayWa r.e. Solar Trade Marks Brazilian Market Entry with Acquisition of Ribeiro Solar - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JheXdhLXJlLXNvbGFyLXRyYWRlLW1hcmtzLWJyYXppbGlhbi1tYXJrZXQtZW50cnktd2l0aC1hY3F1aXNpdGlvbi1vZi1yaWJlaXJvLXNvbGFyLTMwMTkxMDY0Ny5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JheXdhLXJlLXNvbGFyLXRyYWRlLW1hcmtzLWJyYXppbGlhbi1tYXJrZXQtZW50cnktd2l0aC1hY3F1aXNpdGlvbi1vZi1yaWJlaXJvLXNvbGFyLTMwMTkxMDY0Ny5odG1s0gEA?oc=5","id":"CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JheXdhLXJlLXNvbGFyLXRyYWRlLW1hcmtzLWJyYXppbGlhbi1tYXJrZXQtZW50cnktd2l0aC1hY3F1aXNpdGlvbi1vZi1yaWJlaXJvLXNvbGFyLTMwMTkxMDY0Ny5odG1s0gEA","guidislink":false,"published":"Mon, 28 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=240, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JheXdhLXJlLXNvbGFyLXRyYWRlLW1hcmtzLWJyYXppbGlhbi1tYXJrZXQtZW50cnktd2l0aC1hY3F1aXNpdGlvbi1vZi1yaWJlaXJvLXNvbGFyLTMwMTkxMDY0Ny5odG1s0gEA?oc=5\" target=\"_blank\">BayWa r.e. Solar Trade Marks Brazilian Market Entry with Acquisition of Ribeiro Solar<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BayWa r.e. Solar Trade Marks Brazilian Market Entry with Acquisition of Ribeiro Solar - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JheXdhLXJlLXNvbGFyLXRyYWRlLW1hcmtzLWJyYXppbGlhbi1tYXJrZXQtZW50cnktd2l0aC1hY3F1aXNpdGlvbi1vZi1yaWJlaXJvLXNvbGFyLTMwMTkxMDY0Ny5odG1s0gEA?oc=5\" target=\"_blank\">BayWa r.e. Solar Trade Marks Brazilian Market Entry with Acquisition of Ribeiro Solar<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"In the weeks ahead, BayWa r.e. Solar Trade and Ribeiro Solar will finalize the acquisition process, enabling BayWa r.e. Solar Trade to extend an expanded offering to the Brazilian market. CURITIBA, Brazil, Aug. 28, 2023 \/PRNewswire\/ -- Today, BayWa r.e. Solar Trade announced the signing of an agreement to acquire Ribeiro Solar, a solar distribution company operating exclusively in Brazil. This move solidifies BayWa r.e. Solar Trade's foothold in the Brazilian solar energy market, while also strengthening its existing solar distribution operations throughout the Americas, encompassing the United States, Canada, and Mexico. In the weeks ahead, BayWa r.e. Solar Trade and Ribeiro Solar will finalize the acquisition process. Post this L - R Liciany Ribeiro, CEO of Ribeiro Solar; Frank Jessel, Global Director of the Solar Trade division at BayWa r.e.; and Daniel Marino, Director of Solar Trade in the Americas at BayWa r.e. The three leaders shake hands to celebrate BayWa r.e. Solar Trade announcing the signing of an agreement to acquire Ribeiro Solar, a solar distribution company operating exclusively in Brazil. With a shared commitment to clean energy and empowering solar installers, BayWa r.e. Solar Trade and Ribeiro Solar are strategically aligning their expertise to drive the adoption of clean energy solutions. By leveraging Ribeiro Solar's deep market knowledge and extensive installer network within the Brazilian solar industry, alongside BayWa r.e.'s global solar distribution capabilities, the collaboration aims to support solar installers with high-quality products, comprehensive training, and a strong service record. This integration combines Ribeiro Solar's established presence and expertise with BayWa r.e. Solar Trade's track record of serving over 17,000 solar contractor customers worldwide. Ribeiro Solar is headquartered in greater Curitiba in the south of Paraná with warehouse distribution hubs in Paraná, Rio Grande do Sul e Pernambuco, allowing for efficient storage, inventory management, and timely delivery of solar products to customers across Brazil. BayWa r.e.'s global supply chain reach will enable Ribeiro Solar to benefit from global scale while continuing to provide best in class support to installers in Brazil. \"The expansion of BayWa r.e. into the Brazilian market compliments the company's continued growth into the Americas,\" said Daniel Marino, Director of Solar Trade in the Americas at BayWa r.e. \"Ribeiro Solar's deep-rooted expertise and strong market presence will be instrumental in driving our success in Brazil, and we look forward to combining our strengths to accelerate the adoption of solar energy across the country.\" \"We are very grateful for this opportunity to be a part of the BayWa r.e. team, a respected global player in the solar market. This partnership reflects our shared commitment to growth, innovation, and technical excellence, which in turn will benefit our valued clients. Together, we will make a greater impact in the renewable energy market, delivering enhanced value and sustainable solutions,\" said Liciany Ribeiro, CEO of Ribeiro Solar. As one of the world's largest distributors of solar components, BayWa r.e. Solar Trade has a strong track record of delivering high-quality products and services to its customers. Building on its international presence in more than 30 countries, the company provides integrated solutions to installers and technical companies for residential, commercial, and industrial-scale PV projects. About BayWa r.e. At BayWa r.e. we r.e.think energy -- how it is produced, stored and can be best used to enable the global renewable energy transition that is essential to the future of our planet. We are a leading global developer, service supplier, distributor and solutions provider and have brought over 5.5 GW of energy online and manage over 10 GW of assets. We are also an Independent Power Producer with an expanding energy trading business. BayWa r.e. works with businesses worldwide to provide tailored renewable solutions. Operating 100% carbon neutral, we are also committed to our own sustainability journey. About Ribeiro Solar In 2024, Ribeiro will commemorate its 50th anniversary, marking a half-century of excellence in the industry. The Solar unit, spearheaded by Liciany Ribeiro, was established in 2015, bringing tried-and-true Ribeiro values into an unexplored market. Since then, Ribeiro Solar has garnered a prominent reputation within Brazil's dynamic and ever-evolving renewable energy scene. The company excels in delivering innovative solutions and cutting-edge technology to its clients. With a steadfast commitment to sustainability and a customer-centric approach, Ribeiro Solar continues to drive advancements in the renewable energy landscape. SOURCE BayWa r.e. USA LLC","filter_flag":1}
