{"title":"Under the sustainable sea(weeds): gimme Seaweed talks eco-friendly and organic snacks - FoodNavigator-USA.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI0L1VuZGVyLXRoZS1zdXN0YWluYWJsZS1zZWEtd2VlZHMtZ2ltbWUtU2Vhd2VlZC10YWxrcy1lY28tZnJpZW5kbHktYW5kLW9yZ2FuaWMtc25hY2tz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI0L1VuZGVyLXRoZS1zdXN0YWluYWJsZS1zZWEtd2VlZHMtZ2ltbWUtU2Vhd2VlZC10YWxrcy1lY28tZnJpZW5kbHktYW5kLW9yZ2FuaWMtc25hY2tz0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI0L1VuZGVyLXRoZS1zdXN0YWluYWJsZS1zZWEtd2VlZHMtZ2ltbWUtU2Vhd2VlZC10YWxrcy1lY28tZnJpZW5kbHktYW5kLW9yZ2FuaWMtc25hY2tz0gEA","guidislink":false,"published":"Mon, 24 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=114, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI0L1VuZGVyLXRoZS1zdXN0YWluYWJsZS1zZWEtd2VlZHMtZ2ltbWUtU2Vhd2VlZC10YWxrcy1lY28tZnJpZW5kbHktYW5kLW9yZ2FuaWMtc25hY2tz0gEA?oc=5\" target=\"_blank\">Under the sustainable sea(weeds): gimme Seaweed talks eco-friendly and organic snacks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-USA.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Under the sustainable sea(weeds): gimme Seaweed talks eco-friendly and organic snacks - FoodNavigator-USA.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLXVzYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI0L1VuZGVyLXRoZS1zdXN0YWluYWJsZS1zZWEtd2VlZHMtZ2ltbWUtU2Vhd2VlZC10YWxrcy1lY28tZnJpZW5kbHktYW5kLW9yZ2FuaWMtc25hY2tz0gEA?oc=5\" target=\"_blank\">Under the sustainable sea(weeds): gimme Seaweed talks eco-friendly and organic snacks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-USA.com<\/font>","source.href":"https:\/\/www.foodnavigator-usa.com","source.title":"FoodNavigator-USA.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Production\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"What’s particularly notable about gimme Seaweed’​s rise into the plant-based category, explained Diego Norris, CMO, gimme Seaweed, is its partnerships with Korean farmers and the Korean National Federation of Fisheries to implement the production of sustainable, organic and non-GMO seaweed. “We were the first company to offer USDA organic, non-GMO certified seaweed. It actually didn’t exist before then. One of the co-founders, Annie Chun, worked closely with the seaweed farmers in South Korea and the Korean government to create the standard – and that’s the standard that’s widely used to today across the industry.”​ Seaweed is a regenerative crop requiring no fertilizer, pesticides, water or land while simultaneously absorbing carbon dioxide. Norris explained that the CO2 absorption makes a tremendous impact on the environment. He detailed: “We use about 250 tons of dry seaweed a year. For every gram of dried seaweed, it takes 10 grams of wet seaweed to produce that one gram – so we actually use 2,500 tons of wet seaweed and that absorbs an excess of 4,250 tons of CO2 a year; so roughly 57 tons of CO2 per hectare per year of wet seafood production, which is equivalent to 2,500 plus roundtrip flights from New York to London every year.\"​ Based on FMI – The Food Industry Association’s Power of Plant-Based Foods and Beverages​ report, 27% of plant-based consumers look for claims referencing ethical practices, highlighting the need for plant-based brands to develop sustainable initiatives and certifications. Simplifying packaging and diversifying distribution​ Moving from ocean to land, Norris elaborated on the brand's new Grab & Go line which is a slimmer package without the standard plastic tray, enhancing convenience for consumers and kids. “In addition to making them more environmentally friendly, they’re convenient. You can take them with you on the go. They fit easily in lunch boxes, bags or even back pockets.”​ One of the challenges consumers have with plant-based foods is time-intensive preparations. With snacks, the convenience factor lies in ready-to-go packaging and variety in different distribution channels. Norris explained that by simplifying packaging and diversifying distribution strategies (from Amazon or club stores to convenience stores) products are more available and convenient for consumers. Going bold with flavor and nutrition ​ According to the FMI report, 31% of shoppers are looking for high nutrition content from their plant-based products. A rich source of iodine, iron, calcium, B12 and omega-3 fats, seaweed’s nutrient-dense content, plus its briny, umami flavor opens an opportunity for brands to capture eco and health-conscious consumers. gimme Seaweed’s current flavor line up include wasabi, sea salt, teriyaki and sesame, and it contains 40 mg of sodium (2% of DV). The brand's recent 2022 launches include chili lime and white cheddar made of non-dairy white cheddar. He explained that the brand is “looking for popular flavors that our consumers are looking for. This way we are able to give these nutrient-rich superfood snacks…that are cravable.”​ Within plant-based foods, bold flavors that include herbs and spices (in place of salt) capture the significant number of consumers who prioritize taste and texture – 71% of shoppers prefer knowing about taste and texture prior to purchasing based on data from the Plant Based Foods Association. Further, more than half (54%) believe plant-based foods are healthy but are concerned that these products contain hidden ingredients like added sodium or additives – a crucial opportunity for plant-based food developers to get creative with better-for-you flavor formulas.","filter_flag":1}
{"title":"Wheat replacement: South Korea partners with local food brands to intensify rice flour NPD - FoodNavigator-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3ItYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI2L3NvdXRoLWtvcmVhLXBhcnRuZXJzLXdpdGgtbG9jYWwtZm9vZC1icmFuZHMtdG8taW50ZW5zaWZ5LXJpY2UtZmxvdXItbnBk0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3ItYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI2L3NvdXRoLWtvcmVhLXBhcnRuZXJzLXdpdGgtbG9jYWwtZm9vZC1icmFuZHMtdG8taW50ZW5zaWZ5LXJpY2UtZmxvdXItbnBk0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3ItYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI2L3NvdXRoLWtvcmVhLXBhcnRuZXJzLXdpdGgtbG9jYWwtZm9vZC1icmFuZHMtdG8taW50ZW5zaWZ5LXJpY2UtZmxvdXItbnBk0gEA","guidislink":false,"published":"Wed, 26 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=116, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3ItYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI2L3NvdXRoLWtvcmVhLXBhcnRuZXJzLXdpdGgtbG9jYWwtZm9vZC1icmFuZHMtdG8taW50ZW5zaWZ5LXJpY2UtZmxvdXItbnBk0gEA?oc=5\" target=\"_blank\">Wheat replacement: South Korea partners with local food brands to intensify rice flour NPD<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Wheat replacement: South Korea partners with local food brands to intensify rice flour NPD - FoodNavigator-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3ItYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzA0LzI2L3NvdXRoLWtvcmVhLXBhcnRuZXJzLXdpdGgtbG9jYWwtZm9vZC1icmFuZHMtdG8taW50ZW5zaWZ5LXJpY2UtZmxvdXItbnBk0gEA?oc=5\" target=\"_blank\">Wheat replacement: South Korea partners with local food brands to intensify rice flour NPD<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","source.href":"https:\/\/www.foodnavigator-asia.com","source.title":"FoodNavigator-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Production\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"In September last year, South Korea had already indicated plans to utilise rice flour as a substitute for wheat flour​, primarily motivated by the Russia-Ukraine crisis which hit supplies of the latter. The Ministry of Agriculture, Food and Rural Affairs (MAFRA) has now moved to the next step of its national ‘Rice Product Development Project’ in collaboration with 15 major local food and beverage firms expected to create 19 new rice-based products this year. “The use of powdered rice (a form of glutinous rice flour) as a new food ingredient is key for South Korea to achieve food sovereignty and address the supply-demand balance of rice,”​ MAFRA Minister Jeong Hwang-geun said via a formal statement. “MAFRA has selected 15 companies to work with on this national project, based on the potential of the products and the product development capabilities of the companies – prototype development and consumer testing is expected to be completed within the year.”​ Amongst these, Nongshim will be testing the production of rice-based noodles and bread crumbs for frying; Samyang Foods will be making jjajang ramen and ramen snacks; Mideum will be making rice-based bread; and Pulmuone will be creating high-protein snacks amongst others. A total of four types of noodles, five types of bakery products, seven types of snacks and three other products are in development. “Powdered rice can be produced via dry-milling with no soaking in water involved, making environmentally-friendly production on a large scale possible at a relatively low cost,”​ MAFRA added. Rice crisis aversion​ In addition to wheat supply shortage in the country, the overproduction of rice in South Korea has also led to rice prices dropping significantly since 2022, with the local sector commonly described as in a ‘state of crisis’​. MAFRA data has also indicated that the annual per capita rice consumption of Korean consumers has also significantly decreased over the years, estimated to have plummeted some 40% since the year 2000. “Rice is currently already being overproduced in South Korea, so this project [can help to solve two issues simultaneously] and lead the growth of the local food industry as well,”​ MAFRA Food Policy DG Jeong Han-yeong added. “[The idea is to] expand the use of powdered rice as an ingredient for more familiar food products within the food industry so consumers get more comfortable, and at the same time spread the use of these products in accordance with consumer demand.”​ In accordance with these more forward-looking product stratgeies, other ongoing projects in collaboration with academic institutions are a low-carbohydrate rice flour involving Shinsegae Food, and an anti-ageing rice flour ingredient involving CJ Cheiljedang. “These research and development projects aim to increase the utilisation of powdered rice as food ingredients separately from processed product development,”​ the ministry added. “This is targeted to expand the consumption base of powdered rice by going beyond the limits of the existing processed foods market for rice-based products.”​","filter_flag":1}
