{"title":"Enhancing waste resource efficiency: circular economy for sustainability and energy conversion - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5\" target=\"_blank\">Enhancing waste resource efficiency: circular economy for sustainability and energy conversion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Enhancing waste resource efficiency: circular economy for sustainability and energy conversion - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5\" target=\"_blank\">Enhancing waste resource efficiency: circular economy for sustainability and energy conversion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"This study explores optimizing waste resource efficiency through the Circular Economy (CE) framework. Motivated by the imperative to enhance resource efficiency and mitigate waste’s environmental impact, we examine the CE concept’s extension of product life cycles, while minimizing waste. We conduct a comprehensive review to explore the core CE principles across all stages of the product lifecycle and provide an in-depth analysis of waste treatment practices in Poland, emphasizing potential energy conversion methods like biogas production and incineration. Our findings underscore the importance of prioritizing waste incineration plant design for quicker payback, aligning with circular rational economic practices. Strategies such as improving biogas production, establishing solid bio-waste fermentation facilities, promoting sortable packaging, and incentivizing sustainable sorting emerge to optimize waste management. These findings highlight the pivotal role of economic, environmental, and energy considerations in shaping sustainable waste management strategies. Introduction The concept of a circular economy (CE) has gained remarkable traction in recent years, presenting a compelling vision of our Earth as a closed-system spaceship where resources efficiently circulate. Within this grand metaphor, our global society, encompassing economic, environmental, social, and cultural facets, plays a pivotal role in maintaining equilibrium. One of the core tenets of CE, as advocated by the EU CE Strategy (EU COM\/2015\/0614), underscores the significance of waste management in achieving optimal environmental outcomes and reintroducing valuable materials into the economy to maintain sustainability. This article meticulously explores the waste management component within this celestial circular system. Despite the prolific discussions surrounding CE, a universally accepted definition remains elusive, with over 200 variations scattered throughout scientific literature (Adamczak, 2022). CE, an evolutionary concept rooted in traditional waste management, holds relevance in both municipal and industrial domains. While scholarly discourse revolves around solid and liquid waste management, focusing on processing technologies, selective collection, and disposal methods, broader CE discussions, including the ambitious goal of achieving zero waste, often originate from the influential work of the Ellen MacArthur Foundation. Curiously, amid these discussions, a significant research gap exists—the role of urban energy self-sufficiency within the CE framework. This research void has recently gained prominence, partly due to geopolitical events such as the Russia-Ukraine conflict, which cast a spotlight on concerns surrounding energy supply (Gabon et al., 2023; Apostu et al., 2023). Moreover, rapid economic and population growth over the past half-century has led to the excessive consumption of global resources, surpassing the Earth’s regenerative capacity (Popescu et al., 2022). Urbanization and population expansion have significantly escalated global material consumption, straining both individual and planetary resources. Remarkably, a mere 1% reduction in material and energy consumption across all sectors could generate an economy-boosting value of PLN 19.5 billion, underscoring the urgency of sustainable resource management (Deloitte, 2018). The extraction of raw materials, which has tripled from 1970 to 2017, now stands at a staggering 60 billion tons annually, equivalent to 22 kg per person daily (Fiksel, 2006). In the European Union alone, 2.2 billion tonnes of waste are generated annually, with municipal waste accounting for 27% of this total (Haglung, 2011). Alarmingly, resource extraction is responsible for 50% of human-generated carbon emissions and 90% of biodiversity impacts, with projections indicating a doubling of these impacts by 2060, according to the UN International Resource Panel (UN IRP) (Kamiński, 2020). The central question arises: How can more reusable or recyclable fractions be extracted from this challenging mixed waste? Traditional solutions like increasing public education, while viable, may require substantial time for meaningful impact. Additionally, legal and financial restrictions may expedite educational efforts but could lead to social resistance and electoral consequences. These observations underscore the importance of redefining waste within the CE concept, emphasizing its potential as a valuable raw material (D’Admo et al., 2022; Luttenberger, 2020; Khan et al., 2023). This article endeavors to bridge the gaps in waste management strategies within the broader context of the CE, with a specific focus on the potential for achieving energy self-sufficiency in cities. We assert that pursuing 100% recycling and reuse of all waste fractions is economically unwarranted. Instead, specific waste fractions, when transformed into biogas or incinerated for heat and electricity production, represent more effective waste management practices. Furthermore, the carbon dioxide emissions generated by combustion can be mitigated through urban transformation into green cities, where increased vegetation assists in absorbing carbon dioxide from the air. To address these issues, we provide a comprehensive review focusing on the core principles of the CE and elucidating strategies for managing specific waste fractions. Our theoretical review provides a holistic perspective on the CE’s evolving discourse. Within this review, we delve into the multifaceted dimensions of the CE, dissecting its theoretical foundations, including principles of waste reduction, resource reuse, and the extraction of value from waste materials. This theoretical contribution enables a deeper understanding of the CE’s conceptual framework, offering valuable insights for researchers and policymakers engaged in sustainable waste management within this dynamic paradigm. To illustrate the multifaceted dynamics of waste management within the context of CE principles, we present the Orli Staw installation plan, a municipal waste treatment facility in Poland serving 23 municipalities with 350,000 residents. This case exemplifies the innovative potential of the CE by harnessing kitchen and garden biowaste to produce biogas, thereby reducing waste, promoting resource reuse, and achieving local energy self-sufficiency. By focusing on bio-waste and employing a fermentation module for biogas generation, the plant redefines waste as a valuable resource. This groundbreaking approach not only aligns with CE principles but also addresses critical challenges related to resource scarcity and environmental sustainability. The Orli Staw plant’s transformation of waste into a valuable energy source offers a pioneering model for sustainable waste management, making it a significant case study with implications for circular economies worldwide. The primary contribution of this article is the synthesis of insights into the role of waste management in achieving energy self-sufficiency within the CE framework. By highlighting waste management’s vital role in urban energy self-sufficiency, we emphasize the importance of a balanced approach to waste management and resource utilization. This synthesis provides practical insights into the integration of waste management strategies into the broader context of sustainable urban development, offering a nuanced perspective on this critical aspect of CE implementation. In summary, our fundamental conclusion underscores the imperative for waste management to waste perceive as a dual asset: firstly, as a valuable raw material that can be reintegrated into the economy, and secondly, as a potent energy resource capable of enhancing the energy portfolio of cities. This dual perspective on waste not only aligns with the principles of CE but also offers a pragmatic solution to address contemporary challenges related to resource utilization and urban energy self-sufficiency. The remainder of this paper unfolds as follows: In Section 2, we embark on a theoretical exploration, offering a comprehensive review of waste management within the context of the CE framework. Section 3 takes a deep dive into the practical realm, focusing on the Orli Staw case study in Poland, where we substantiate the concept of waste as a valuable resource for energy transformation with empirical evidence. Finally, Section 4 serves as the culmination of our discourse, where we draw our key findings, and articulate our conclusive remarks. Theoretical framework of CE The view mentioned in the introduction that our planet is basically a huge spaceship speeding through space, recharged by solar energy and equipped with closed-circuit systems is becoming more and more popular in human society. There are many ways to understand and define the CE. One such definition defines the CE as a production and consumption model that involves sharing, borrowing, reusing, repairing, refurbishing and recycling existing materials and products for as long as possible. This extends the product life cycle. In practice, this means minimizing waste. When a product’s life cycle comes to an end, the raw materials and waste that comes from it should stay in the economy through recycling. They can be successfully reused, thus creating additional value. 1United Nations forecasts [based on the Food and Agriculture Organization (FAO) and the World Water Council] assume that by 2050 the world population will increase by 1\/3, which will translate into the pace of moving to cities and a 50% increase in demand for water and energy during this period (Lasecki et al., 2021). Circular fashion has been present in the literature since the late 1960s. The concept of Circural Fashion appeared in 2014 and is currently one of the most popular concepts of sustainable development in fashion (Global Fashion Agenda’s 2020 Circural Fashion System Commitment was signed by 90 fashion brands). The phrases “spaceship Earth” (1960), “stocks for processing” (1966), The Closing Circle (1971), closed-loop economy (1981) alluded to CE (Meadows et al., 1973). The CE paradigm began to develop in the early 1970s, when scientists, politicians and recruits gathered around the Club of Rome began research on the future of the earth’s natural environment, its limited raw material resources and the place occupied by humans in the ecosystem. The result of this research was the first report prepared for the Club of Rome entitled “Limits to Growth” (The Limits to Growth 1972). It was in this report that the idea of a CE emerged, where the authors of the report stated that: “Natural ecosystems can absorb many waste products of human activity and process them into substances useable, or at least harmless to other forms of life”. However, when a waste product is released in large quantities, natural absorption mechanisms can become saturated. The waste products of human civilization can accumulate in a given environment until they finally become visible, annoying and even harmful. Therefore, larger consuming countries can learn how to recover and regenerate used materials. They can develop new methods to increase the durability of products made from scarce raw materials. They can introduce social and economic patterns of behavior that would meet needs while minimizing (rather than maximizing) use and dissipation of irreplaceable substances that man currently possesses (Niutanen and Korhonen, 2003). CE is an economic concept in which products, materials and raw materials should remain in the economy if possible, and the generation of waste should be minimized as much as possible (Oberle et al., 2019). This idea considers all stages of the product life cycle, starting from its design, through production, consumption, collection as waste, to its management. CE is a model of economic development in which–while maintaining the condition of efficiency–the following basic assumptions are met: 1) the added value of raw materials\/resources, materials and products is maximized or the amount of waste generated is minimized, and the resulting waste is managed in accordance with the hierarchy of waste management methods (waste prevention, preparation for re-use, recycling, other recovery methods, disposal) (Pagotto and Halog, 2015)2. The Ellen MacArthur Foundation3 states that the CE is based on three principles: 1) limit waste and pollution; 2) circulate products and materials (at their highest value)and 3) regenerate nature. The first principle of the CE is to eliminate waste and pollution. Currently, our economy works in a take-make-waste system. We take raw materials from the Earth, we make products from them, and eventually we throw them away as waste. Much of this waste ends up in landfills or incinerators and is lost. This system cannot work in the long term because the resources on our planet are finite. The second principle of the CE is to circulate products and materials at their highest value. This means keeping materials in use, either as a product or, when that can no longer be used, as components or raw materials. This way, nothing becomes waste and the intrinsic value of products and materials are retained. The third principle of the CE is to regenerate nature. By moving from a take-make-waste linear economy to a CE, we support natural processes and leave more room for nature to thrive4. The CE system diagram, known as the butterfly diagram illustrates the continuous flow of materials in a CE.5There are two main cycles–the technical cycle and the biological cycle. In the technical cycle, products and materials are kept in circulation through processes such as reuse, repair, remanufacture and recycling. In the biological cycle, the nutrients from biodegradable materials are returned to the Earth to regenerate nature5. According to the Ellen MacArthur Foundation on the left-hand side of the butterfly diagram is the biological cycle, which is for materials that can biodegrade and safely return to the earth. 6This cycle mainly concerns products that are consumed, such as food. However, some other biodegradable materials, such as cotton or wood, may eventually make their way from the technical cycle into the biological cycle once they have degraded to a point where they can no longer be used to make new products. At the heart of the biological cycle is the concept of regeneration. It is the third principle of the CE. Instead of continuously degrading nature, as we do in the linear economy, in the CE we build natural capital. Once food is harvested and consumed, the nutrients in organic waste streams can be collected, and returned to the soil via processes like composting and anaerobic digestion. If nutrients are not returned, soil becomes depleted, meaning farmers are forced to rely increasingly on chemical fertilisers to keep farmland productive. On the right-hand side of the butterfly diagram is the technical cycle, relevant for products that are used rather than consumed. The diagram shows that smaller inner loops are surrounded by the larger outer loops. These inner loops are where most value can be captured because they retain more of the embedded value of a product by keeping it whole. Take a smartphone, for example,–a working phone is worth more than the sum of its parts because the time and energy that went into making it is not lost. Therefore, inner loops like sharing, maintaining, and reusing should be prioritized above the outer loops that see the product broken down and remade. These loops also represent a cost saving to customers and businesses as they make use of products and materials already in circulation, rather than investing in making them new. 7The approach to CE is changing around the world. Not only as a problem to solve, but also as a business opportunity. For example, in Denmark, cooperation within the CE framework between business and industry is proposed in order to change the approach to production and consumption, creating new businesses and new jobs to make the lifestyle more sustainable (Luttenberger, 2020). Individual economic sectors are taking the essence of CE more and more seriously. One such example is the transformation from a linear to a circular approach in the food production industry in Australia. M. Pagotto and A. Halog (Pagotto and Halog 2015) present recommendations for this industry, based on the research of other scientists, which, among other things, are to improve environmental sustainability: “Our first recommendation is the implementation of a “sustainable resource management” (SRM) for the entire Australian agri-food industry chain. SRM is an integrated approach that manages materials\/resource life cycles aiming to achieve economic efficiency and environmental sustainability (Fiksel, 2006). Implementing SRM will support the Australian food producers and suppliers in identifying inefficiencies in the production processes, reducing production and waste costs, increasing competitiveness and improving the producers. The second recommendation involves the implementation of integrated waste management, energy, and fertilizer production in large centralized (regional) units or smaller decentralized local units, such as farm scale or industrial districts (Niutanen and Korhonen 2003). This strategy can transform the current linear production system utilized in the Australian food industry to a roundput production system where the organic food wastes and wastewater are treated to produce energy, recycled water, and fertilizer, which are later returned as valuable inputs (Niutanen and Korhonen 2003). The third recommendation proposes the increase of biofuel\/bioenergy production in Australia using available, nonfood biomass by-products generated by the agri-food industry. The Australian government should distribute financial incentives for constructing biorefineries. These biorefineries will transform organic materials, such as agricultural residues and food wastes, into valuable biofuels and chemicals (Pagotto and Halog, 2015). The last recommendation suggests that the Australian government should invest in research, professional training, and dissemination of the “mixed farming system” (MFS). This system will minimize the costs and emissions generated by transportation of feedstock that is required to feed the livestock raised in feedlots system (Pagotto and Halog, 2015).” The diagram and its description present the essence of the CE in a nutshell. The practical application of this idea encounters some resistance in the societies of various countries. According to one of the laws of harmony presented by Karol Adamiecki: “The Law of Inertia of Habits and the Law of Contradiction,” any undertakings involving the introduction of specific innovations or improvements in the company evoke a certain resistance in the employee teams aimed at rejecting this change and restoring the current state. Therefore, it is of great importance to properly prepare changes, train employees and participate in the process of implementing improvements, limiting the scale of this resistance. 8,9The quoted law of inertia of habits and the law of contradiction can be applied not only to the employees of a given enterprise, but also to individual governments or population groups. One such exception is the Japanese city of Kamikatsu, where a special recycling center has been set up, where over 30 waste fractions are sorted. Thanks to such solutions, as much as 80 percent waste produced by the local community is reused, recycled or composted. Only 20 percent goes to landfills. Kamikatsu inspires other cities, including Turkey and San Diego, where a plan was announced to reduce landfilled waste by 75% by 2030. By 2040, it would become completely zero waste. New York has similarly ambitious plans—it wants to reduce the amount of garbage to zero in the next 15 years10. Other examples of the transformation of waste management towards CE exemplified in Europe. Sweden use of heat generated in wastewater fermentation processes in heat pump systems. According to Gunnar Haglung, Haglung, 2011 about 80% of the heat in the Swedish district heating network, i.e. 40% of all heat, comes from energy sources that in many other countries of the world are not used at all but literally wasted. G. Haglung proposes that cities with up to 20,000 inhabitants residents invested in biomass-fired heating plants. In turn, cities with a population of 20,000 inhabitants up to 100 thousand inhabitants should invest in biomass-fired CHP plants, and in cities with more than 100,000 inhabitants, municipal waste should be managed on site, among others in incineration plants in cogeneration with the use of biomass. In addition, Sweden also introduced a tax on CO 2 and for incineration plants operating without cogeneration in the generation of heat and electricity. Segregation at source popularized in Poland by Eng. Andrzej Bartoszkiewicz. In addition, since 2005, a full ban on landfilling has been in force, which was widely consulted with the Swedish society. Heat in Swedish cities equipped with district heating is supplied in addition to incineration plants, biogas, geothermal energy, heat pumps or fossil fuels from industrial heat waste. The Swedish example described shows the country’s determination towards CE and the pursuit of energy independence. The entire economic mechanism is that energy is produced from waste delivered to, e.g., incineration plants, the cost of which is lower compared to coal or gas. Those who deliver waste must pay for it, which on the one hand, as mentioned, reduces the costs of energy production, and on the other hand, in a way, stimulates society to produce less waste, for the collection of which they also must pay. Swedish society has agreed to this transformation. Other societies are slower to adopt similar solutions. Due to the extensive discussion taking place on increasing the efficiency of the use of waste resources and thus converting energy, it is worth analyzing the possibilities of biogas production in solid waste processing installations. The presented case study concerns one of the most dynamically developing installations in Poland, which sorts waste, both municipal and industrial, for the recovery of the so-called commercial fractions and biodegradable waste for biogas production. Therefore, it seems that this example is worth disseminating where the preference is still mainly to store waste without considering it as a source of commercial products on the one hand, and on the other hand, the possibility of achieving energy independence first of all for a given installation, and then of other municipal entities or farms. homework. In Poland, the first installations producing biogas from municipal waste were built in 2010-2017. Most of them use a biofraction separated from mixed\/residual waste. Currently, most of them plan to change the input to selectively collected bio-waste. Some of them have undertaken investment activities in this area. Biogas produced from mixed waste is characterized by a high content of H 2 S reaching 2,000 ppm and a high content of silicon compounds (siloxanes), which requires its cleaning and makes it difficult to operate cogeneration engines. The average biogas productivity in such installations is in the range of 80–120 m3\/Mg (source: Szewczyk’s own survey). So far, in Poland there is no installation producing biomethane from biogas, injected into the grid or used to drive means of transport in the form of bioCNG or bioLNG. This is due to the lack of favorable legislation enabling the injection of biomethane into the grid. Powering vehicles with biomethane is also at the planning stage. In all installations operating in Poland that process solid waste, the generated electricity and heat is used for its own needs, and surplus electricity is sold to the grid. One of the installations operates in the trigeneration mode and has a bromolite absorption refrigeration system. This system generates cold from the waste heat, which is used for air-conditioning the rooms. Currently, in Poland, approximately 200,000 Mg\/year of bio-waste is managed in operating fermentation installations. Generally, it is estimated that the amount of biowaste generated in Poland exceeds 2,000,000 Mg\/year. With a conservative estimated average productivity of operating installations of approx. 100 m (Fiksel, 2006)\/Mg, this gives a potential biogas production capacity of approx. 200 million m (Fiksel, 2006)\/year. This biogas has a methane content of 50%–60%. These installations also have the ability to co-digestate other types of waste, not only from municipal sources, but also from trade, catering and agri-food processing, which can significantly increase Poland’s potential in this area. The advantage of this type of installation is their territorial dispersion as well as the stability and predictability of energy production, as well as its controllability, which, unlike other RES (wind, sun), stabilizes the power grid, reducing the need for its expansion. Case studies In many societies processes like Kamikatsu proceed relatively slowly. This is illustrated by the example of the Municipal Waste Treatment Plant Orli Staw (ZUOK). This plant serves 23 municipalities with a population of approximately 350,000. These inhabitants produce approx. 120,000 Mg\/year of municipal waste. All generated municipal waste goes to the ZUOK. This stream also includes selectively collected kitchen and garden biowaste. The installation in Orli Staw, as in other installations in Poland, the level of recycling and its structure are presented in Table 1. TABLE 1 TABLE 1. Practical possibilities of achieving recycling levels on the example of the installation in Orli Staw. The data presented in Table 1 shows that the efficiency of waste segregation in some European societies is low. The so-called mixed waste (unsegregated) from 50%–80% in the structure of waste collected from residents. From a practical point of view, this waste is basically the easiest to landfill or burn to obtain electricity and heat. However, the question is how can more reusable or recyclable fractions be obtained from this mixed waste? The first answer that comes to mind is to increase the level of education of the inhabitants. This process may take many years. Legal and financial restrictions can also be applied, which theoretically should accelerate the education process, or trigger social protests, which then translate into the results of elections to central or local authorities. Generally, the idea of CE is to define waste not as waste, but as a raw material. In the Orli Staw plant, the focus is now on the energy use of bio-waste by installing a module for obtaining biogas from this waste (fermentation module). This module uses both green and kitchen waste. The technology used is so universal that it produces biogas even from contaminated biodegradable fractions. This biogas is then used to produce electricity and heat for the plant, and surpluses are stored for resale. From the residues of these wastes after the fermentation and composting process, solid and liquid fertilizer is obtained. According to P. Szewczyk, the solution used for selectively collected municipal bio-waste is better than in the case of rural biogas plants, which require a more stable and clean material input. The fermentation installation at ZUOK Orli Staw was built in 2021-2022 and commissioned in 2023. After the first stage of implementation, it has the capacity to process 15,000 Mg\/year. The input to the installation is mainly selectively collected municipal bio-waste. Since 2017, when the implementation of selective collection was successively started, their number has been gradually increasing. In addition, the fermentation charge can also be expired food and expired food products from trade and gastronomy. It is also possible to manage liquid waste from the agri-food industry and agriculture. The amount of delivered bio-waste is gradually increasing. In 2016, there were 4,122 Mg, in 2017–5,372 Mg, in 2018 already 6,332 Mg, in 2019–7,836 Mg. In 2020, the amount of biowaste supplied increased significantly to 14,442 Mg, a year later to 17,548, and in 2022 to 18,528 Mg. This phenomenon is shown in Figure 1. FIGURE 1 FIGURE 1. Delivery of selectively collected municipal bio-waste to ZUOK (Orli Staw) in 2016-2022 Source: own study based on data from ZUOK (Orli Staw). In the period from 1 March 2023 to 31 May 2023, during the start-up of the fermentation installation, the average biogas productivity was 98.96 m (Fiksel, 2006)\/Mg of feedstock. At that time, after the injection of the inoculum and the start of the process, the amount of fed waste gradually increased, reaching the target value of approx. 41 Mg\/day. This amount was corrected based on the analysis of parameters and the course of the fermentation process. The produced biogas has an average methane content of 60.17%. This content ranges from 59% to 62.2%. The produced biogas has an H 2 S content of approx. 200 ppm. Before being directed to the cogeneration engine, the biogas is purified in a biological column and\/or in columns filled with activated carbon. Biogas is also dried in refrigeration dryers. The cogeneration unit with a peak power of 550 kW operates with variable power depending on the current energy needs of the plant. The heat energy recovered from the cooling of the cogeneration engine and the cooling of exhaust gases is directed to the in-house network. It is used for the technological needs of the fermentation installation, mainly for heating the fermenter, heating the premises of the plant and producing hot water. The role of energy storage in the form of biogas is performed by a double-layer biogas tank with a capacity of approx. 2,500 m (Fiksel, 2006). After the fermentation process, the digestate goes to the dewatering section consisting of two screw presses and one decanter centrifuge. The solid fraction goes to the aerobic process and then is a substrate to produce a natural organic fertilizer. The liquid fraction is directed to a buffer tank and then used in agricultural fields as an organic fertilizer. The fermentation installation at the ZUOK, after extension with a second fermenter with a capacity of approx. 15,000 Mg\/year, is planned to operate as a biomethane production installation in the form of bioCNG or bioLNG. It will be the fuel used to propel own means of transport and possibly also used as fuel for the needs of companies cooperating with the ZUOK collecting waste from residents. Another possibility of energy use of waste are wastewater treatment plants where biogas is also obtained. An example is the treatment plant in Tychy in Silesia, where biodegradable industrial waste is added to municipal sewage, which improves the amount of biogas obtained. From this biogas, electricity and heat are obtained in such quantities that, apart from the wastewater treatment plant’s own consumption, electricity and heat are used to operate the municipal aqua park, and surplus electricity is sold to the power grid. The uniqueness of this solution lies in the fact that in the vast majority of sewage treatment plants energy and heat are used only for their own purposes. Possibilities of improving the efficiency of the CE The motivation of this paper stems from the use of CE in practice in the context of waste management. This concept is becoming more and more popular. Waste is no longer treated as unnecessary garbage, but as raw materials from which new goods can be produced or transformed, for example, into heat or electricity. Biogas can be obtained from other waste, which in turn can be used to power engines or produce electricity and heat. The transformation of many economies, including European ones, towards CE also seems to be a necessity due to the ongoing Ukrainian-Russian conflict, which has disrupted the established economic order consisting in, among other things, purchasing cheap energy carriers from Russia. This conflict thus highlighted the risk of energy carriers supplied from one or a few places. This also includes the potential risk of interrupting the supply of plutonium or uranium ore to nuclear power plants from their current mining sites. Using the potential of waste and popularizing the opportunities offered by broadly understood CE seems to be invaluable. In addition, experience in implementing CE solutions may be useful for planned space travel. The example from Orle Staw shows dynamic changes in the approach to waste in Poland. From a financial point of view, the installation from Orly Staw generates profit, which is then transferred to the development of this company towards CE. More and more cities in Poland are starting to transform their installations in a similar way. It is a slow but steady process. Based on the example from Orle Staw and other examples described in the literature review, the following actions are recommended. 1. The design of incineration plants should assume the shortest possible payback period for investment outlays. In Sweden, for example, the payback period for the construction of a waste incineration plant is approximately 4–5 years, in Poland it is 20–30 years. This proves a more rational approach to the CE in this country from an economic point of view. 2. Such incineration plants should be built not only to dispose of waste while generating electricity and heat, but also as cement plants. The combustion temperature in a cement plant is higher than in an incinerator, which provides greater opportunities for environmentally safe disposal of hazardous waste, which may even be present in municipal waste. Moreover, the current Ukrainian-Russian war will end 1 day and the demand for cement will certainly increase, which rationally justifies the construction of such combined plants. In this way, flammable waste fractions can be used more effectively. 3. It is postulated to reconstruct each wastewater treatment plant so that it produces a larger amount of biogas than its own needs, also using industrial bio-waste. 4. Fermentation plants for the production of biogas from solid bio-waste should be built at each waste collection facility. This biogas would be used to produce heat and electricity for own needs and for sale, including as biofuel for engines. 5. Packaging should consist of materials that can be easily sorted. The effort here is also on the side of packaging manufacturers. In societies less convinced of such segregation at source, economic incentives to donate such packaging should be introduced. It would be worth applying an additional waste management hierarchy, i.e., separating cost-effective waste fractions such as aluminum, other metals, glass, waste paper, biodegradable and other economically viable fractions, and those that should only be treated as combustible material. 6. Collection points for such packaging should be located in places frequented by residents, e.g., shops, so that the resident does not feel the inconvenience of such a delivery of used packaging. 7. The logistics of collecting used packaging from such points should be improved. For example, each of the 14 distribution centers of one of the largest retail chains in Poland sends around 200 vehicles daily to deliver supplies to its retail outlets. These vehicles return to the city center lightly loaded or empty, covering around 20,000 km on the way back. Annually, this gives one center (assuming only 300 days of operation per year) 6,000,000 km, and for the entire network: 90,000,000 km. Fuel used when running empty: 20,700,000 L 22If those delivering products to stores collected used packaging at the same time, i.e., they would also provide collection services for such selected waste fractions, the number of so-called waste collections could be reduced. empty runs. 8. Disseminate the so-called sorting at source using efficient logistics. The solution proposed, among others, by A. Bartoszkiewicz assumes the employment of people in the so-called houses—sorting rooms located in multi-family buildings. These people would perform additional sorting of mixed waste on site. Separated materials would be collected, for example, by vehicles delivering products to nearby stores, in order to avoid empty journeys and reduce transport costs. You can also consider running a deposit system by the operators of such a sorting house. The presented recommendations and examples, including the example of the Orle Staw installation, may constitute a model or anchor for improving the efficiency of the economy thanks to the CE concept. It is not a problem to transform the linear economy into a circular one by spending huge sums of money. The challenge and logical path is to do this while improving the economic efficiency of given industries or enterprises. One such example, apart from others mentioned in the article, is the constant transformation of the Orli Staw installation, which is slowly becoming an enterprise stimulating the effective management of solid waste. In the future, new activities in the CE area may appear at this installation based on economic calculations, involving even various social and business groups in conducting these activities, which will also allow for the expansion of the CE idea in Polish society. Data availability statement The original contributions presented in the study are included in the article\/supplementary material, further inquiries can be directed to the corresponding author. Author contributions HE: Conceptualization, Investigation, Methodology, Project administration, Supervision, Writing–review and editing. GZ: Conceptualization, Data curation, Formal Analysis, Methodology, Writing–original draft. W-CA: Project administration, Writing–review and editing. SP: Data curation, Investigation, Resources, Writing–original draft. Funding The author(s) declare that no financial support was received for the research, authorship, and\/or publication of this article. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Footnotes 1Circular Economy: Definition, Meaning and Benefits (Video) | News | European Parliament (europa.eu). 2https:\/\/www.gov.pl\/web\/Rozwoju-technologia\/Gospodarka-o-ogu-zamknietym 3https:\/\/www.ellenmacarthurfoundation.org\/circular-economy\/concept 4What is a circular economy? | Ellen MacArthur Foundation 5The Butterfly Diagram: Visualizing the Circular Economy (ellenmacarthurfoundation.org) 6The biological cycle of the butterfly diagram (ellenmacarthurfoundation.org) 7The technical cycle of the butterfly diagram (ellenmacarthurfoundation.org) 8One Earth is not enough for us. We would use up five planets in a year - Forsal.pl 9Karol Adamiecki – Management Encyclopedia (mfiles.pl) 10https:\/\/smoglab.pl\/miasteczka-zero-waste-first-dziala-w-japonii-kolejne-powzanie-w-turcji\/ References Adamczak, J. (2022). Restructuring a municipal enterprise towards a circular economy on the example of the waste management industry. Warsaw: Oficyna Wydawnicza SGH. Google Scholar Apostu, S. A., Gigauri, I., Panait, M., and Martín-Cervantes, P. A. (2023). Is Europe on the way to sustainable development? Compatibility of green environment, economic growth, and circular economy issues. Int. J. Environ. Res. Public Health 20 (2), 1078. doi:10.3390\/ijerph20021078 PubMed Abstract | CrossRef Full Text | Google Scholar Deloitte (2018). Closed loop – open opportunities, prospects for the development of the circular economy in Poland. Report: Closed loop - open opportunities | Deloitte Polska, entry date September 26, 2023). Google Scholar Gabor, M. R., López–Malest, A., and Panait, M. C. (2023). The transition journey of EU vs. NON-EU countries for waste management. Environ. Sci. Pollut. Res. 30 (21), 60326–60342. doi:10.1007\/s11356-023-26686-y CrossRef Full Text | Google Scholar Haglung, G. (2011). Ecologically efficient economy in Sweden, conference materials. Google Scholar Kamiński, A. (2020). The impact of the circular economy on refinery operations. Pol. J. Sustain. Dev. 24 (2). Google Scholar Khan, S. A. R., Zia-Ul-Haq, H. M., Ponce, P., and Janjua, L. (2023). Re-investigating the impact of non-renewable and renewable energy on environmental quality: a roadmap towards sustainable development. Resour. Policy 81, 103411. doi:10.1016\/j.resourpol.2023.103411 CrossRef Full Text | Google Scholar J. Kulczycka (Editor) (2019). “Circular economy in policy and scientific research,” Institute of mineral resources and energy management of the polish academy of sciences (Kraków). 978-83-955544-5-2. 978-83-956380-0-8. Google Scholar T. Lasecki, T. Tamecki, M. Biernat-Kopczyńska, and R. Maruszkin (Editors) (2021). Circular Economy. Guide for small and medium-sized entrepreneurs (Warsaw: Polish Agency for Enterprise Development). Google Scholar Luttenberger, L. R. (2020). Waste management challenges in transition to circular economy–case of Croatia. J. Clean. Prod. 256, 120495. doi:10.1016\/j.jclepro.2020.120495 CrossRef Full Text | Google Scholar Meadows, D. H., Meadows, D. L., Randers, , and Behrens, W. W. (1973). The Limits of growth. Warsaw: National Economic Publishing House. Google Scholar Niutanen, V., and Korhonen, J. (2003). Industrial ecology flows of agriculture and food industry in Finland: utilizing by-products and wastes. Int. J. Sustain. Dev. World Ecol. 10 (2), 133–147. doi:10.1080\/13504500309469792 CrossRef Full Text | Google Scholar Oberle, B., Bringezu, S., Hatfield-Dodds, S., Hellweg, S., Schandl, H., and Clement, J. (2019). Global resources outlook 2019. Natural resources for the future we want. United Nations Environment Programme. International Resource Panel. 978-92-807-3741- 7 DTI\/2226\/NA UNEP 252. Google Scholar Pagotto, M., and Halog, A. (2015). Towards a circular economy in Australian agri-food industry an application of input-output oriented approaches for analyzing resource efficiency and competitiveness potential. J. Industrial Ecol. 20, 1176–1184. Number 5, Yale University. doi:10.1111\/jiec.12373 CrossRef Full Text | Google Scholar Popescu, C., Hysa, E., Kruja, A., and Mansi, E. (2022). Social innovation, circularity and energy transition for environmental, social and governance (ESG) practices—a comprehensive review. Energies 15 (23), 9028. doi:10.3390\/en15239028 CrossRef Full Text | Google Scholar Szewczyk, P. (2023). Waste treatment system in the light of the implementation of legal requirements and their energy use case study - Orli Staw - conference materials: challenges and opportunities for the national municipal waste management system. Webinar Organ. by Finance Inst. Warsaw Sch. Econ. on June 6. Google Scholar The business of a circular future (2021). How business models can accelerate the transition to a circular economy. WHITE PAPERS FOR A GREEN TRANSITION. Version 1.0. Google Scholar","filter_flag":1}
{"title":"Supply chain sustainability: Teaming up with suppliers to protect people and the planet - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5","id":"CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA","guidislink":false,"published":"Thu, 26 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=299, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5\" target=\"_blank\">Supply chain sustainability: Teaming up with suppliers to protect people and the planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Supply chain sustainability: Teaming up with suppliers to protect people and the planet - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzEwMjYtc3VwcGx5LWNoYWluLXN1c3RhaW5hYmlsaXR5LXRlYW1pbmctdXAtd2l0aC1zdXBwbGllcnMtdG8tcHJvdGVjdC1wZW9wbGUtYW5kLXRoZS1wbGFuZXQuaHRtbNIBAA?oc=5\" target=\"_blank\">Supply chain sustainability: Teaming up with suppliers to protect people and the planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Beyond auditing – driving continuous improvement in supplier sustainability At Philips, our purpose to improve people’s lives extends beyond our innovative products, systems and services to our supply chain. Philips’ Supplier Sustainability Performance (SSP) program replaces the traditional approach of supplier auditing, which had been shown to be insufficient in driving sustainable improvements and often leads to audit fatigue. “One of the most important behaviors we’re trying to drive is the focus on continuous improvement,” explains Bob Ruers, Philips Supplier Sustainability Director. He says this means identifying and tackling the root cause of process issues. With the SSP program, the focus is on ensuring structural, proactive improvement in social and environmental performance, rather than simply reacting to issues that arise. “If something's not right, you need to take time and analyze the problem,” he says. “There's no point in keeping the train running on a broken track. We need to normalize fixing the root cause.” By lending expertise to suppliers, Philips helps them grow their skills in many areas, including assessment of supplier sustainability performance, management of regulated substances, greening the supply chain, improvement of working conditions, and responsible sourcing. “Our SSP approach is long-term and relationship-driven,” says Bob. “We explain the reasoning behind the plan. At the beginning it may be, ‘I have a policy,’ but the larger aim is to build mature and sustainable supplier management.” Bob says implementing sustainable, people-centered practices in a company’s supply chain takes an all-hands-on-deck approach. “We invest in suppliers who provide a safe working environment, treat workers with respect, and work in an environmentally sound way. When problematic practices surface, that’s okay. Because identifying an issue is the first step towards making an improvement – and we do that together.” ","filter_flag":1}
{"title":"A-Gas authorised as R448A\/R449A reclaimer - Cooling Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL2EtZ2FzLWF1dGhvcmlzZWQtYXMtcjQ0OGEtcjQ0OWEtcmVjbGFpbWVyL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL2EtZ2FzLWF1dGhvcmlzZWQtYXMtcjQ0OGEtcjQ0OWEtcmVjbGFpbWVyL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL2EtZ2FzLWF1dGhvcmlzZWQtYXMtcjQ0OGEtcjQ0OWEtcmVjbGFpbWVyL9IBAA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL2EtZ2FzLWF1dGhvcmlzZWQtYXMtcjQ0OGEtcjQ0OWEtcmVjbGFpbWVyL9IBAA?oc=5\" target=\"_blank\">A-Gas authorised as R448A\/R449A reclaimer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cooling Post<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A-Gas authorised as R448A\/R449A reclaimer - Cooling Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmNvb2xpbmdwb3N0LmNvbS93b3JsZC1uZXdzL2EtZ2FzLWF1dGhvcmlzZWQtYXMtcjQ0OGEtcjQ0OWEtcmVjbGFpbWVyL9IBAA?oc=5\" target=\"_blank\">A-Gas authorised as R448A\/R449A reclaimer<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cooling Post<\/font>","source.href":"https:\/\/www.coolingpost.com","source.title":"Cooling Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"UK: A-Gas has been authorised by Chemours as a reclaimer of the lower GWP HFC\/HFO blend refrigerants R448A and R449A in the UK and Europe. The two refrigerants were developed and patented by Chemours and Honeywell as replacements for R404A and R507 in existing equipment. Both are blends of four refrigerants – R32, R125, R134a and R1234yf in slightly different proportions with R448A also containing a small amount (7%) of R1234ze(E). R448A was developed marketed by Honeywell and has a GWP of 1273, while Chemours’ R449A has a GWP of 1397. In November, the rival manufacturers, who cross license the two gases, announced a pilot scheme to authorise qualified companies to carry out recycling and reclamation of their patented refrigerants. Chemours Thermal and Specialised Solutions president Joe Martinko said, “Working with A-Gas enables the safe recovery, reclaim, and reuse of R448A and R449A, maximising resource efficiency, reducing waste, and lowering emissions.” A-Gas is a world leader in the supply and lifecycle management of refrigerants and associated products and services, offering a complete solution from its extensive fleet of dedicated recovery cylinders to its Rapid Recovery on-site refrigerant recovery services. Related stories: Chemours and Honeywell in reclaim pact – 16 November 2022 USA: Rival refrigerant manufacturers Chemours and Honeywell have announced a new pilot scheme to “enable” qualified companies to recycle and reclaim their R404A replacement gases R448A and R449A. Read more…","filter_flag":1}
{"title":"Study stirs controversy over the benefits of biodegradable plastics - The National","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnRoZW5hdGlvbmFsbmV3cy5jb20vd29ybGQvMjAyMy8xMC8xMC9zdHVkeS1zdGlycy1jb250cm92ZXJzeS1vdmVyLXRoZS1iZW5lZml0cy1vZi1iaW9kZWdyYWRhYmxlLXBsYXN0aWNzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnRoZW5hdGlvbmFsbmV3cy5jb20vd29ybGQvMjAyMy8xMC8xMC9zdHVkeS1zdGlycy1jb250cm92ZXJzeS1vdmVyLXRoZS1iZW5lZml0cy1vZi1iaW9kZWdyYWRhYmxlLXBsYXN0aWNzL9IBAA?oc=5","id":"CBMidWh0dHBzOi8vd3d3LnRoZW5hdGlvbmFsbmV3cy5jb20vd29ybGQvMjAyMy8xMC8xMC9zdHVkeS1zdGlycy1jb250cm92ZXJzeS1vdmVyLXRoZS1iZW5lZml0cy1vZi1iaW9kZWdyYWRhYmxlLXBsYXN0aWNzL9IBAA","guidislink":false,"published":"Tue, 10 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=283, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnRoZW5hdGlvbmFsbmV3cy5jb20vd29ybGQvMjAyMy8xMC8xMC9zdHVkeS1zdGlycy1jb250cm92ZXJzeS1vdmVyLXRoZS1iZW5lZml0cy1vZi1iaW9kZWdyYWRhYmxlLXBsYXN0aWNzL9IBAA?oc=5\" target=\"_blank\">Study stirs controversy over the benefits of biodegradable plastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The National<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Study stirs controversy over the benefits of biodegradable plastics - The National","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LnRoZW5hdGlvbmFsbmV3cy5jb20vd29ybGQvMjAyMy8xMC8xMC9zdHVkeS1zdGlycy1jb250cm92ZXJzeS1vdmVyLXRoZS1iZW5lZml0cy1vZi1iaW9kZWdyYWRhYmxlLXBsYXN0aWNzL9IBAA?oc=5\" target=\"_blank\">Study stirs controversy over the benefits of biodegradable plastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The National<\/font>","source.href":"https:\/\/www.thenationalnews.com","source.title":"The National","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Controversy has been sparked by a study that appears to show that when they break down, compostable plastic bags release more toxins into the environment than conventional plastic bags do. European Bioplastics, which represents companies that produce various types of biodegradable plastics, has branded the research \"scientifically questionable\" and suggested that it does not replicate how plastics degrade in the real world. The dispute highlights concerns over biodegradable plastics. To some, they are the answer to the world’s acute problem of plastic waste, but to others these materials are a distraction from what they see as the true answer – simply using less plastic. A new study has raised questions on the benefits of compostable plastic bags. What did the study find? Carried out by scientists in Spain and released in the Journal of Hazardous Materials, the study involved testing the breakdown products of various types of plastic bag on zebrafish cells grown in the laboratory. The researchers looked at compostable bags, which are a type of biodegradable plastic bag designed to break down under specific conditions, and compared them to conventional plastic bags. It found that extracts of compostable bags decreased the viability of the cells, an effect that was made stronger if the bag had been exposed to ultraviolet light or had been composted. However, similar remains from conventional plastic bags did not have the same toxic effect on the cells. \"These findings highlight the importance of investigating the effects of degradation mechanisms such as sunlight and composting on the toxicity of bioplastics,\" the researchers wrote in the Journal of Hazardous Materials. \"It is also crucial to investigate the composition of newly developed formulations for bioplastics, as they may be more harmful than conventional ones.\" What criticism has been levelled at the study? To extract chemicals from the plastics before they were tested on the zebrafish cells, the scientists used methanol, a type of alcohol. In a statement issued this week, European Bioplastics said that there was no evidence in the study that the methanol did not change the chemical structure of the samples. As a result, the study, they suggested, may not reflect how these plastics behave in the real world. Claims made by the Institute of Environmental Assessment and Water Research, one of the organisations behind the study, \"are not supported by the scientific evidence\", according to European Bioplastics. \"The study, including the test methods, and the sample-taking procedures, should be completely reassessed on their scientific correctness,\" the organisation stated. According to Dr Costas Velis, a lecturer in resource efficiency systems at Leeds University in the UK who was not connected to the new study, \"we need to understand better\" what the degradation products from biodegradable plastics are. \"That’s a core takeaway message,\" he said. \"I’ve seen [research] papers in that direction, but we need to start scrutinising the degradation products.\" What are biodegradable plastics and are they the answer to the problem of plastic pollution? Biodegradable plastics, such as packaging, cutlery, bottles and plates, can be made out of a wide variety of materials, including plant fibres (cellulose), starch (such as from sugar cane or corn) and agricultural waste. Additional substances may be added to the starch, for example, to confer useful properties like resistance to the growth of microorganisms. Biodegradable plastics are those that can be decomposed by living organisms, such as bacteria, and some are compostable, meaning that they can be turned into a substance that is rich in nutrients. Conventional plastics, which are usually made from fossil fuels, may, by contrast, linger in the environment for hundreds of years, harming wildlife and often breaking down physically to leave behind tiny microplastic particles. Typically, compostable substances break down into compost only under specific conditions. A Greenpeace report indicated that most must be industrially composted with particular humidity levels and temperatures above 50°C. Prof Phil Purnell of the University of Leeds said just because something is marked as compostable doesn't mean you can just throw it away anywhere. Photo: University of Leeds \"Just because it’s marked as compostable, it doesn’t mean if you throw it outside, it will rot down in the same way as an apple core,\" Prof Phil Purnell, a professor of materials and structures at the University of Leeds in the UK, said. Just as being marked as recyclable does not guarantee that something will be recycled, so being compostable does not mean, Prof Purnell said, that material will get composted. \"You have to have the hard infrastructure in terms of industrial composting facilities and soft infrastructure in terms of these things being collected and local systems in place, and these things being separated out,\" he said. Are biodegradable plastics a match for conventional plastics in terms of what they can do? According to Dr Velis, while the plastics sector is undergoing \"a huge wave of innovation\", not all new products have had solely positive effects. He said that, for example, there is a concern that biodegradable plastic bottles made from polylactic acid or PLA could complicate recycling systems set up to deal with non-biodegradable bottles made from polyethylene terephthalate or PET. \"It’s very hard to distinguish them with the naked eye,\" he said. \"With recycling systems, they have the ability to disrupt and destroy the flows of recycling materials.\" Read More How a Dubai hotel saved more than a million plastic bottles from going to landfill Some environmental groups, including Greenpeace, have raised concerns that biodegradable plastics take attention away from what they see as the key solution, namely using less plastic. Dr Velis said that with biodegradable plastics, there was not as wide a range of colours and textures when compared to conventional plastics. \"We haven’t seen this development of equivalent solutions of plant-based or degradable functional materials,\" he said.","filter_flag":1}
{"title":"From gadget to garbage - newagebd.net","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5","id":"CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA","guidislink":false,"published":"Sat, 14 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=287, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5\" target=\"_blank\">From gadget to garbage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">newagebd.net<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"From gadget to garbage - newagebd.net","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5\" target=\"_blank\">From gadget to garbage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">newagebd.net<\/font>","source.href":"https:\/\/www.newagebd.net","source.title":"newagebd.net","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"— TechWorldBD24 Bangladesh generates about 2.7 million tonnes of e-waste annually, which is expected to double by 2030. The rapid urbanisation and growing population, coupled with a high demand for e-products, make the country more susceptible to the adverse impacts of e-waste, writes Md Zahurul Al Mamun IN OUR technology-driven world, electronic devices have become ubiquitous, driven by technological advancements, rising incomes and global accessibility. Innovation and trade have made electronics affordable and accessible in every corner of the planet. However, this convenience comes at a cost — electronic waste or e-waste. The exponential growth of e-waste generation globally is driven by rapid technological advancements, planned obsolescence, lack of repairability and reusability options and the insatiable demand for the latest gadgets. According to the Global E-waste Monitor 2020, the world produced 53.6 million tonnes of e-waste in 2019, equivalent to the weight of 7,300 Eiffel Towers. It also predicts that the global e-waste generation will reach 74.7 million tonnes by 2030 and about 120 million tonnes by 2050, making it the fastest-growing waste stream globally. Bangladesh is not immune to the problem of e-waste. According to a study by the Department of Environment, Centre for Environmental and Resource Management and Bangladesh University of Engineering and Technology, Bangladesh generates about 2.7 million tonnes of e-waste annually, which is expected to double by 2030. The rapid urbanisation and growing population, coupled with a high demand for e-products, make the country more susceptible to the adverse impacts of e-waste. On International E-Waste Day today, let’s delve into this issue, explore its multifaceted impacts and discuss potential solutions. What is e-waste? ELECTRONIC waste or e-waste is the term that refers to any electrical or electronic devices that have been discarded as waste without any intention of reusing them, are unwanted by their owner or have reached the end of their useful life or become obsolete. E-waste covers a wide range of discarded electronic devices and gadgets, such as computers, mobile phones, TVs, refrigerators, air conditioners, fluorescent lamps, batteries and more. These devices contain valuable materials, including rare earth materials, gold, silver, copper, platinum, palladium, lithium, ceramic, metals, plastics and glass. However, the current linear model for production and consumption contributes to the growing e-waste problem. Most e-products are not designed to last long or to be repaired easily, and they are becoming more complex and challenging to repair. At the same time, products have also become cheaper, making it attractive for consumers to buy new and discard used ones. All these factors combined lead to more e-waste. The Global E-waste Monitor 2020 report shows that only 17.4 per cent of the e-waste generated in 2019 was collected and recycled properly, while the rest was either dumped in landfills or burned in informal settings. Hidden threat of e-waste On environment: E-waste poses a severe threat to environmental and human health due to the presence of toxic and hazardous materials and improper disposal practices. E-waste contains not only valuable materials but also hazardous substances such as lead, mercury, cadmium, zinc, yttrium, chromium, beryllium, nickel, arsenic, antimony trioxide, tin, polyvinyl chloride, Halogenated and brominated flame retardants. Toxic chemicals can leach into the soil and affect its quality and fertility when e-waste is dumped in landfills to decay. This can make the soil less suitable for growing plants and crops, polluting the entire value chain and reducing the biodiversity of soil organisms, like bacteria, fungi and worms, crucial for nutrient cycling and decomposition. According to a report by UNEP, e-waste is responsible for 70 per cent of the toxic chemicals found in landfills, which can contaminate the soil and groundwater and threaten food security and livelihoods. Water pollution is another major issue caused by e-waste. When e-waste is exposed to rain or floods, it can release toxic substances such as heavy metals, organic pollutants and pathogens into surface and groundwater sources, reducing water quality and availability for drinking, irrigation, and supporting aquatic life. This pollution can also increase freshwater scarcity and the risk of waterborne diseases. Lastly, air pollution is another significant concern from e-waste. Burning or incinerating e-waste releases toxic and harmful gases and particulate matter into the atmosphere, which can cause respiratory and cardiovascular diseases. Burning e-waste can produce ground-level ozone. This occurs when volatile organic compounds, polycyclic aromatic hydrocarbons, dioxins and furans react with sunlight, causing acid rain and smog. Handling and inhaling toxic substances from e-waste can pose significant health risks and increase mortality. On humans: E-waste is a serious health problem affecting millions worldwide due to its toxic substances. The World Health Organisation has estimated that exposure to e-waste can result in a multitude of health problems, including respiratory infections, skin diseases, eye irritation, headaches, nausea, fatigue, an increased risk of cancer and neurological disorders. These health risks are particularly pronounced for informal workers who handle e-waste without proper equipment, training and protection and use primitive methods like breaking or burning to extract valuable materials. These workers often work in dangerous conditions and are exposed to dangerous chemicals, heavy metals and toxic air to retrieve precious metals to support their families. Children and pregnant women working in this sector are especially more vulnerable to the effects of e-waste exposure, which can impair their growth development cognitive abilities. On climate change: Electronic waste is a significant environmental issue that has far-reaching implications for climate change. E-waste releases greenhouse gases such as carbon dioxide, methane, nitrous oxide, and hydrofluorocarbons when burned or dumped in landfills. These emissions contribute to the increasing frequency of natural disasters and heat waves. E-waste plays a vital role in GHG emissions during production, use and disposal. E-products require considerable energy and resources to extract and process raw materials. This generates CO2 and other GHG emissions during production. For instance, one laptop emits over 220 kilogram of carbon dioxide during manufacturing. Additionally, e-products consume electricity to run, which also generates emissions depending on the energy source. According to a report by the International Energy Agency, the global electricity consumption of information and communication technologies was 1,100 terawatt-hours in 2018, accounting for about 3.7 per cent of global CO2 emissions. Finally, the disposal of e-waste can release GHG when burned or dumped in landfills. In 2019, e-waste contributed to a global carbon footprint of 98 million tonnes of CO2-equivalents, similar to Belgium’s annual emissions, according to the Global E-waste Monitor 2020 report. Resource depletion: E-waste is a goldmine of secondary raw materials, including precious metals like gold, copper, nickel and rare materials like indium and palladium, which have strategic value. These materials can be repurposed and recycled to create new products, reducing the need for mining, saving energy and water, and generating income and employment. A 2016 study by the United Nations University estimated that e-waste contained 7.7 per cent of the global gold supply, equivalent to 112.3 tonnes of gold. However, improper e-waste disposal leads to the loss of valuable materials and increased environmental and social problems. Wasting these resources also increases the demand for raw material extraction and production, which can negatively impact deforestation, land degradation, biodiversity loss, water scarcity and human rights violations. Challenges in e-waste landscape BANGLADESH is grappling with a surge in e-waste generation due to population growth, urbanisation, consumer behaviour, freelancing and internet access. Despite various policies and regulatory frameworks introduced to manage this issue, a comprehensive and integrated approach to the e-waste situation is lacking. Inadequate infrastructure, lack of effective multi-stakeholder engagement and insufficient investment make it even more difficult. Regulatory shortcomings: The current law on e-waste management, the Hazardous Waste (e-waste) Management Rules 2021 under the Bangladesh Environmental Protection Act, 1995, is inadequate and poorly enforced. It does not cover all aspects of e-waste management. They lack specific methods and standards for e-waste collection, transportation, storage, recycling and disposal. It also does not define the roles and responsibilities of different stakeholders, such as government agencies, producers, importers, retailers, collectors, recyclers and consumers. There is also a lack of coordination among different stakeholders and a lack of transparency and accountability in the system, which could lead to inconsistency, inefficiency and non-compliance among stakeholders involved in e-waste management. Lack of producer responsibility: The producers, assemblers, importers or exporters of e-products have no incentives or mechanisms to adopt eco-design principles or extended producer responsibility schemes in Bangladesh. Extended producer responsibility is a policy approach that requires producers to take responsibility for their products at end-of-life by paying for the collection or treatment of their products or providing information or guidance to consumers on how to dispose of them. Extended producer responsibility also encourages producers to design more durable, repairable, reusable and recyclable products. However, producer responsibility is virtually non-existent in Bangladesh. Producers, assemblers, importers or exporters face no consequences or rewards for their products at end-of-life. They have no obligation to pay for the collection or treatment of their products, provide information or guidance to consumers on how to dispose of them or design durable, repairable, reusable and recyclable products. Inadequate recycling facilities: Bangladesh also faces a significant challenge in managing e-waste due to the lack of adequate facilities for collecting, transporting, storing, treating and recycling it. There are no set standards or criteria for e-waste recycling or disposal facilities. Most of the existing facilities are informal and unregulated. Furthermore, there are no specific requirements or guidelines on how these facilities should operate, what technologies they should use, what outputs they should produce or what emissions they should control. This lack of proper safety measures or waste management practices increases the risk of pollution and accidents, further compounding the problem. Informal e-waste sector: The informal e-waste management sector in Bangladesh is a significant challenge for environmental and social sustainability. This sector handles about 80 per cent of the e-waste generated in the country but operates without legal recognition or regulation. The informal workers, mostly poor and uneducated, collect, dismantle, repair, refurbish or trade e-waste using primitive methods and tools. They are unaware of the health and environmental risks posed by the toxic and hazardous materials present in e-waste. They also lack proper equipment, training or protection to handle e-waste safely and efficiently. As a result, they expose themselves and their communities to various diseases and injuries and pollute the soil, water, and air with e-waste contaminants. Consumer engagement: Consumers or end-users of e-products play a vital role in e-waste management, but they are often neglected or uninformed. According to current rules and regulations, consumers should return their discarded or unused products to authorised traders, sellers or collection centres, but they are not given any guidance, education or motivation. Consumers also have no economic incentive to recycle their e-waste, as they do not receive any compensation or reward for their participation. Many consumers are unaware of the environmental and health impacts of e-waste and the benefits of recycling. They also lack information on how and where to dispose of their e-waste properly. They often throw away their e-waste with other household waste or sell it to informal collectors without realising they are contributing to environmental pollution and health hazards. What can be done? A data-driven roadmap: Bangladesh must adopt a data-driven approach to tackle the growing e-waste problem and avoid future catastrophes. This approach should be based on a comprehensive assessment of the country’s current and projected e-waste generation and management, aligning with international standards and best practices. A national inventory and database should be established to track e-waste generation, collection, transportation, recycling and disposal. A comprehensive legal framework should also be developed to regulate all aspects of e-waste management. The framework should clearly define the roles and responsibilities of stakeholders, such as government agencies, producers, importers, retailers, collectors, recyclers and consumers, to ensure transparency and accountability. As part of this, producers, importers, retailers, collectors and recyclers should register with authorities and report their activities. Clear and measurable targets for e-waste collection and recycling are essential for tracking e-waste movement and disposal, ensuring compliance with environmental standards and best practices. Additionally, they can provide valuable data and information on e-waste generation and management that can be used for planning and decision-making. Investing in infrastructure and technology for safe and efficient e-waste collection, transportation, recycling and disposal is crucial to address this issue effectively. Extended producer responsibility: Extended Producer Responsibility is a practical solution to reduce the environmental impact of production and consumption. It requires producers and importers to collect and recycle their products at the end of their life cycle, incentivising companies to design durable, repairable and recyclable products. Producer responsibility can take many forms, such as mandatory take-back schemes, deposit-refund systems, advance disposal fees or eco-labels. The decision by the EU to switch from a proprietary port to a USB C is a great example of extended producer responsibility. As a result, Apple introduced USB C ports in their iPhone 15 model, which reduces the burden on consumers and the government in managing e-waste. Another solution that could be implemented is a green tax or fee system that charges producers based on the environmental performance of their products. The green tax or fee system could use a rating system that evaluates the products according to various criteria, like energy consumption, hazardous substance content, recyclability, repairability, etc. The higher the rating, the lower the tax or fee. The revenue from the green tax or fee system could be used to fund e-waste management activities or support green innovation. A common platform for producers, importers, retailers and consumers could enable seamless collection, recycling and safe disposal of electronic devices. This could help create a market for recycled materials and stimulate innovation in product design and recycling technology. Circular economy: To tackle the growing e-waste problem, we must adopt a circular economy approach that prioritises resource efficiency and minimisation. E-waste recycling can be a sustainable way to create green jobs, promote a circular economy and reduce waste. This approach involves using products, parts and materials for as long as possible and viewing waste as a valuable resource. The circular economy model for electronics offers numerous benefits, including resource conservation, environmental impact reduction, value recovery and climate change mitigation. Implementing a circular economy for e-waste could lower GHG emissions, conserve natural resources, create new jobs, enhance competitiveness, generate income, promote social equity, and reduce health risks. A World Bank study estimated that implementing a circular economy for e-waste could generate an annual net benefit of $62 billion for Bangladesh by 2050 compared to the current development path. Recycling facilities: A potential solution to address the issue of e-waste in Bangladesh is to establish a certification system for e-waste recycling or disposal facilities. This system would require facilities to meet minimum standards and criteria for operation, technology, output and emission. The government should establish clear procedures for granting environmental clearance certificates based on compliance with environmental and occupational health and safety standards. According to a report by the Bangladesh Environmental Lawyers Association, only 10 per cent of the e-waste facilities in Bangladesh have environmental clearance certificates from the Department of Environment, while the rest operate without legal authorisation or monitoring. The system should ensure adequate equipment and technology to handle hazardous substances safely and separate or recover different materials. The government should also conduct regular inspections and audits to ensure proper operation and performance and impose penalties or sanctions for non-compliance or violations. This system can ensure the quality and safety of e-waste facilities, prevent pollution or accidents, and protect workers’ rights. The certification system could follow international best practices and standards, such as the e-Stewards or R2 standards for e-waste recyclers. Informal sector: Recognising and integrating the informal sector workers into the formal e-waste management system is crucial. They should receive incentives, training, certification and support. Enhancing the capacity and safety of both formal and informal e-waste recyclers by providing them with technical assistance, financial incentives and protective equipment is also important. This can help them improve their practices, reduce health and environmental risks and increase income and social status. Developing formal sector facilities for safe and efficient collection, transportation, dismantling and recycling of e-waste, complying with environmental standards and providing decent employment opportunities can reduce the reliance on informal sector workers and increase the recovery rate of valuable materials from e-waste. Consumers: A nationwide campaign on e-waste awareness and action targeting consumers or end-users could be launched to address the gap in e-waste management. Through awareness campaigns, incentive schemes, convenient collection systems and feedback mechanisms, consumers should be empowered. The campaign could use various media channels to educate consumers about the environmental and health impacts of improper e-waste disposal and the benefits of reducing, reusing and recycling electronic devices. This can encourage consumers to adopt eco-friendly practices like buying energy-efficient products, extending device lifespan, donating or selling old devices and disposing of e-waste at authorised collection points. Consumers should also be given economic incentives or rewards for returning their discarded or unused products to authorised traders, sellers, or collection centres. A survey by the Bangladesh Institute of ICT in Development found that 74 per cent of the consumers in Bangladesh were unaware of the proper disposal methods of e-waste, and 64 per cent were willing to participate in e-waste awareness campaigns. Public-private partnership: Promoting public-private partnerships and multi-stakeholder collaboration among government agencies, producers, importers, retailers, collectors, recyclers, NGOs and consumers to establish a sustainable and inclusive system of e-waste management is another solution. This can help to create a shared vision and responsibility, mobilise resources and expertise and ensure transparency and accountability. Strengthening regional and international cooperation on e-waste management to share knowledge, experiences, resources and solutions is also beneficial. Research and innovation: To improve data collection, develop technology and add value to e-waste, we must encourage research and innovation in e-waste management. This will help us better understand the e-waste situation in Bangladesh, find the best practices and solutions for managing e-waste and create new economic and social development opportunities. We can also work towards a zero-carbon economy focusing on climate change education, research and innovation by encouraging innovation and research on new products, processes and business models that reduce e-waste generation and enhance resource recovery. Conclusion E-WASTE management is not just an environmental concern; it’s an economic opportunity and a matter of social justice. E-waste is a global problem that requires local solutions. A comprehensive approach founded on data, technology, regulation, research and innovation is essential for a sustainable and prosperous zero-carbon future where e-waste is managed responsibly. In doing so, Bangladesh can contribute to several Sustainable Development Goals, primarily SDG 12 (Responsible Consumption and Production) and SDG 13 (Climate Action), while creating a world where climate action is evidence-based and tailored to local needs. Together, we can build a future where the adverse impacts of e-waste are minimised, benefiting both people and the planet. Md Zahurul Al Mamun is an independent climate researcher.","filter_flag":1}
{"title":"Why Tissue Paper is THE SMART CHOICE for a Sustainable World - Mixerplanet","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm1peGVycGxhbmV0LmNvbS9icmFuZC1wb3N0LzIxODk4NC93aHktdGlzc3VlLXBhcGVyLWlzLXRoZS1zbWFydC1jaG9pY2UtZm9yLWEtc3VzdGFpbmFibGUtd29ybGQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm1peGVycGxhbmV0LmNvbS9icmFuZC1wb3N0LzIxODk4NC93aHktdGlzc3VlLXBhcGVyLWlzLXRoZS1zbWFydC1jaG9pY2UtZm9yLWEtc3VzdGFpbmFibGUtd29ybGQuaHRtbNIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3Lm1peGVycGxhbmV0LmNvbS9icmFuZC1wb3N0LzIxODk4NC93aHktdGlzc3VlLXBhcGVyLWlzLXRoZS1zbWFydC1jaG9pY2UtZm9yLWEtc3VzdGFpbmFibGUtd29ybGQuaHRtbNIBAA","guidislink":false,"published":"Fri, 27 Oct 2023 16:26:32 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=27, tm_hour=16, tm_min=26, tm_sec=32, tm_wday=4, tm_yday=300, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm1peGVycGxhbmV0LmNvbS9icmFuZC1wb3N0LzIxODk4NC93aHktdGlzc3VlLXBhcGVyLWlzLXRoZS1zbWFydC1jaG9pY2UtZm9yLWEtc3VzdGFpbmFibGUtd29ybGQuaHRtbNIBAA?oc=5\" target=\"_blank\">Why Tissue Paper is THE SMART CHOICE for a Sustainable World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mixerplanet<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Tissue Paper is THE SMART CHOICE for a Sustainable World - Mixerplanet","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm1peGVycGxhbmV0LmNvbS9icmFuZC1wb3N0LzIxODk4NC93aHktdGlzc3VlLXBhcGVyLWlzLXRoZS1zbWFydC1jaG9pY2UtZm9yLWEtc3VzdGFpbmFibGUtd29ybGQuaHRtbNIBAA?oc=5\" target=\"_blank\">Why Tissue Paper is THE SMART CHOICE for a Sustainable World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mixerplanet<\/font>","source.href":"https:\/\/www.mixerplanet.com","source.title":"Mixerplanet","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"tableware 31 Ottobre 2023 Why Tissue Paper is THE SMART CHOICE for a Sustainable World Trees are positively beneficial for our planet. They capture and store billons of tonnes of carbon dioxide while at the same time providing the earth with much needed oxygen. They emit particularly large quantities of oxygen during the growing phase, hence underlining the importance of continually replanting trees. Trees play a crucial role in the earth’s eco-system and paper boasts first-class environmental credentials : It is natural, biodegradable, and comes from a renewable resource. Too much of what is produced on our planet is made from non-renewable materials. No material can be reused or recycled forever as losses and degradation will always take place and virgin material will be needed in the loops. In the case of paper, the raw material is renewable and supplied to the loops in line with the principles of a circular economy . Through sustainable forestry practices the tissue paper industry regrows and regenerates its raw material and provides a sustainable resource. The paper sector is also signatory to the Legal Logging Code of Conduct which condemns illegal logging . The EU timber regulation furthermore upholds industry standards and ensures that only products from legally sourced wood are sold within the EU. Some 11% of timber felled in the world is used to make paper, and 83% of Europe’s paper mills are certified by an environmental management system. Some tissue producers have chosen to carry labels on their products in order to show their high environmental credentials – such as the EU Ecolabel, the FSC and PEFC labels and regional labels including Nordic Swan and Blue Angel. Third-party certification is one of the best ways to ensure that suppliers meet recognised standards. It lends credibility to the sector and offers reassurance to both customers and consumers. Most tissue producers support the different international and national forest certification schemes and over 80% of the forests owned by paper and lumber companies in Europe are certified . ETS is committed to driving sustainable practices throughout the industry. It is also looking to increase sustainability across the supply chain – from water and energy through to transport and recovery. Tissue paper production also ensures that every part of the raw material – trees – is put to good use . It uses mainly bark and twigs from the lumber industry which are made into pulp that is the basis of tissue paper. SUPPORTING THE EU AND UN GOALS Tissue paper producers are active supporters of the EU Circular Economy Action Plan – a key building block of the European Green Deal, which has a number of sustainability targets including transforming the EU into a modern and competitive economy. The goal of the Action Plan is sustainable growth and it lays special focus on resource efficiency with more waste prevention, reuse and recycling and the phasing out of wasteful practices like landfill. This goal of enabling sustainable consumption and production is also reflected in the United Nations Sustainable Development Goal 12: Responsible consumption and production. Tissue products have an important role to play here. They are essential for people’s health and hygiene. While paper is the most recycled material in Europe, with recycling rates of over 70%, tissue paper, because of its applications in toilet paper, tissues etc, is usually a single-use product which typically goes to waste after use. Tissue products nevertheless fit neatly into existing waste management schemes and can in many cases provide a benefit such as incineration with energy recovery or composting. DRIVING CIRCULARITY UP AND DOWN THE VALUE CHAIN Many tissue paper producers are supporting the development of new, circular business models using innovation to create closed-loop products and processes. This will serve to increase product recovery and minimise waste. There is a focus on reducing greenhouse gas emissions, transferring to renewable energy and decreasing water use. Some 58% of the Europe’s pulp and paper industry’s energy consumption already comes from renewable biomass, and it is proud to be the largest single user and producer of bio-energy in Europe. The sector also continues to work on reducing its impact on water consumption and is an active partner in the development of water stewardship. Paper making machines have reduced water consumption by 30% over the past 10 years as a result of more efficient water circulation and the amount of water needed to produce one ton of pulp has fallen five-fold since 1970. Many individual producers are promoting zero waste to landfill, eliminating waste, reducing packaging weight and fostering recyclable packaging and the use of recycled content. They are also exploring innovation in product design and development. In the area of ‘reduce’, the industry is seeing the emergence of new products that use less material for the same functionality. It is also witnessing new sustainable products that use fresh, wood-based fibre, recycled fibres and alternative fibres. It is important to promote circularity in this regard in order to increase the availability of paper for recycling as a secondary raw material. Recycling plays an important role in the sustainability of the paper cycle. Paper recycling rates rise every year and currently stand at 71% in Europe.³ Tissue paper producers are working together with their packaging suppliers to turn waste into a resource through collection, sorting and recycling. 2 Kemira, 3 https:\/\/www.paperforrecycling.eu\/ PLACING THE CUSTOMER AT THE CENTER Key to driving a more sustainable and circular tissue paper industry is placing customers at the centre and ensuring that they are kept informed. Many tissue paper producers provide easy-to-understand information about sustainable production and consumption, proper waste disposal and anti-littering. It is provided to both consumers and professional customers to keep them up-to-speed and encourage them to play their part in driving circularity. Sustainability is often described as having three pillars – environmental, economic and societal. Tissue paper products play an essential role here too. Tissue is a material that makes our world better. Tissue products are essential for people’s health and hygiene and reduce the risk of infection while upholding cleanliness. Tissue paper product from toilet tissue and handkerchiefs to paper towels and kitchen roll will continue to offer a sustainable, hygienic and practical solution both inside and outside the home in the years to come.","filter_flag":1}
{"title":"The important role played by plant growth regulators - Turf & Rec","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnR1cmZhbmRyZWMuY29tL3RoZS1pbXBvcnRhbnQtcm9sZS1wbGF5ZWQtYnktcGxhbnQtZ3Jvd3RoLXJlZ3VsYXRvcnMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnR1cmZhbmRyZWMuY29tL3RoZS1pbXBvcnRhbnQtcm9sZS1wbGF5ZWQtYnktcGxhbnQtZ3Jvd3RoLXJlZ3VsYXRvcnMv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vd3d3LnR1cmZhbmRyZWMuY29tL3RoZS1pbXBvcnRhbnQtcm9sZS1wbGF5ZWQtYnktcGxhbnQtZ3Jvd3RoLXJlZ3VsYXRvcnMv0gEA","guidislink":false,"published":"Tue, 17 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=290, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnR1cmZhbmRyZWMuY29tL3RoZS1pbXBvcnRhbnQtcm9sZS1wbGF5ZWQtYnktcGxhbnQtZ3Jvd3RoLXJlZ3VsYXRvcnMv0gEA?oc=5\" target=\"_blank\">The important role played by plant growth regulators<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Turf & Rec<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The important role played by plant growth regulators - Turf & Rec","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnR1cmZhbmRyZWMuY29tL3RoZS1pbXBvcnRhbnQtcm9sZS1wbGF5ZWQtYnktcGxhbnQtZ3Jvd3RoLXJlZ3VsYXRvcnMv0gEA?oc=5\" target=\"_blank\">The important role played by plant growth regulators<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Turf & Rec<\/font>","source.href":"https:\/\/www.turfandrec.com","source.title":"Turf & Rec","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Efficiency\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Turfgrass management has evolved significantly over the years, with an increasing focus on sustainability and resource conservation. Among the tools that have revolutionized turf management practices are plant growth regulators (PGRs). PGRs are synthetic or naturally occurring compounds that regulate plant growth and development. PGRs can influence various physiological processes in plants, ultimately altering their growth and development. These compounds can be broadly classified into five categories: auxins, cytokinins, gibberellins, abscisic acid, and ethylene. Each PGR has specific effects on plant growth, which can be harnessed to optimize turfgrass management practices. There are three big reasons why PGRs can improve environmental sustainability of turfgrass management. Reduced mowing frequency Trinexapac-ethyl (TE) and flurprimidol (FLP) are two widely used PGRs that inhibit the production of gibberellins, a group of plant hormones responsible for cell elongation. By suppressing gibberellin production, these PGRs effectively reduce vertical growth in turfgrass, resulting in a more compact and uniform turf canopy. Paclobutrazol (PAC) also inhibits gibberellin biosynthesis while also reducing cytokinin levels. This dual action decreases vertical growth and encourages tillering in turfgrass, resulting in a denser turf stand. Prohexadione-calcium (PHC) inhibits gibberellin and prevents lodging, which is important for seed production. Advertisement The reduction in turf growth rate is typically quantified by measuring the weight of clippings. Interestingly, a recent study at the University of Georgia suggests that cultivars of creeping bentgrass responded differently to TE, with V-8 exhibiting the lowest response rate compared to Penncross, L-93, 007, and Tour Pro (Henry et al. 2022). This suggests that the efficacy of other PGRs might also vary by cultivar. Overall, reducing the turf growth rate will reduce the frequency of mowing which in turn cuts down on labour, emissions, and equipment wear-and-tear. Improving stress tolerance Abscisic acid (AA) is a naturally occurring plant hormone that plays a vital role in stress responses, including drought tolerance. Applying ABA-based PGRs can enhance the plants’ ability to survive through hot and dry summer conditions. Advertisement If applied before drought stress, the application of AA can mean that the turf stays lush and green for longer than the untreated control. In fact, the use of AA or TE on Kentucky bluegrass and creeping bentgrass resulted in higher soil volumetric water content, leaf water content, and improved growth rates throughout drought stress (McCann and Huang, 2008). ABA is currently used in the production of grapes and other fruit crops, but a commercial product has not been developed for turf. In general, the reduction in vertical growth due to this PGR translates to lower water use and improved photosynthetic efficiency. Nitrogen use efficiency Turfgrass often receives significant nitrogen inputs to maintain a lush green appearance and density. PGRs can improve nutrient use efficiency and reduce the need for nutrient inputs. In a three-year study in New York, the application of TE to a creeping bentgrass green reduced vertical growth, which then reduced mowing frequency, which thus reduced nutrient loss by clipping removal. This trickle-down effect meant that the putting green needed 25¬–50 per cent less nitrogen (Kreuser and Soldat, 2012). This is great news for environmental sustainability and your budget. Although the price of fertilizer has leveled out, we are still seeing nitrogen prices higher than pre-pandemic years. Can PGRs be used on turf in Canada? Prohexadione-calcium = approved In the recent environmental assessment required by Health Canada for product registration, PHC was deemed unlikely to cause risk to the environment. The health effects seen in animals from PHC only occurred when doses were 100 times higher than that of the label rate. In addition, the amount of transfer was drastically reduced when the spray residues are dry. Due to these factors, PHC was approved for use on golf courses, sod farms, sports fields, municipal sites, and cemeteries. Trinexapac-ethyl = limited use In 2022, TE was approved for use only on golf courses, sod farms, and to produce perennial ryegrass seeds. Unfortunately, according to the toxicology studies, exposure to TE can result in neurological symptoms, chronic toxicity, and damage to kidneys, and loss of pregnancy for rats. The use of TE on turf in residential areas (lawns, parks, playing fields, etc.) is prohibited due to the risk to children and pregnant women. If you are using this product, please refer to the label for proper protective equipment, especially when mixing and loading. Flurprimidol, Paclobutrazol= no FLP is not yet registered for use in Canada, but PAC has been registered for greenhouse use on ornamentals in containers. Abscisic Acid = ? This naturally occurring plant hormone has been known in the world of plant sciences for many years, but a commercial product containing AA has yet to be marketed for turf. Plants will naturally produce AA in response to drought or freezing conditions to survive through stress. Perhaps this is the next frontier of PGRs? At the Guelph Turfgrass Institute, a study by Dr. Eric Lyons and John Watson confirmed that Anuew (PHC) and Primo Maxx (TE) can both effectively reduce creeping bentgrass growth rate on a putting green without causing stress symptoms such as yellowing and etiolation. When comparing a calendar schedule (four weeks) to a Growing Degree Model schedule (300 GDDs), the GDD schedule recommended five applications of the PGRs between June 4 and Aug. 6. The calendar method resulted in four applications. Between the two schedules, timing applications using GDD resulted in more consistent growth suppression (Lyons and Watson, 2021). In conclusion, plant growth regulators have become indispensable tools in modern turfgrass management, offering sustainable solutions to improve turf quality and resource efficiency. Supported by scientific research, the proper application of PGRs can lead to water conservation, reduced nutrient inputs, enhanced stress tolerance, and overall improved environmental turfgrass management. Turf managers and the public should continue to advocate for alternative management options, to encourage innovative companies to develop and register new products in response. The future of grass is looking greener! You can contact the Guelph Turfgrass Institute at GTI@uoguelph.ca or follow @GuelphTurf on social media. Works cited: Henry, G. M., M. Moore, K. A. Tucker. 2022. Response of creeping bentgrass (Agrostis stolonifera) and weed species to plant growth regulators. International Turfgrass Society Research Journal 14(1): 791–796. Henry, G. M., M. Moore, K. A. Tucker. 2022. Response of creeping bentgrass (Agrostis stolonifera) and weed species to plant growth regulators. International Turfgrass Society Research Journal 14(1): 791–796. Kreuser, W. C., D. J. Soldat. 2012. Frequent trinexapac-ethyl applications reduce nitrogen requirements of creeping bentgrass golf putting greens. Crop Science 52: 1348–1357. Lyons, E., J. Watson. 2021. Comparing plant growth regulators: Anuew, Primo Maxx and an experimental on a USGA putting green. GTI Research Report: 1–14. McCann, S. E., B. Huang. 2008. Drought responses of Kentucky bluegrass and creeping bentgrass as affected by abscisic acid and trinexapac-ethyl. Journal of the American Society for Horticultural Science 133(1): 20¬–26. Dr. Sara Stricker is the communications and outreach co-ordinator at the Guelph Turfgrass Institute.","filter_flag":1}
