{"title":"Consumer Products Manufacturing: Made in the USA - Assembly Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg4Ni1jb25zdW1lci1wcm9kdWN0cy1tYW51ZmFjdHVyaW5nLW1hZGUtaW4tdGhlLXVzYdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg4Ni1jb25zdW1lci1wcm9kdWN0cy1tYW51ZmFjdHVyaW5nLW1hZGUtaW4tdGhlLXVzYdIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg4Ni1jb25zdW1lci1wcm9kdWN0cy1tYW51ZmFjdHVyaW5nLW1hZGUtaW4tdGhlLXVzYdIBAA","guidislink":false,"published":"Fri, 07 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=188, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg4Ni1jb25zdW1lci1wcm9kdWN0cy1tYW51ZmFjdHVyaW5nLW1hZGUtaW4tdGhlLXVzYdIBAA?oc=5\" target=\"_blank\">Consumer Products Manufacturing: Made in the USA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Consumer Products Manufacturing: Made in the USA - Assembly Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg4Ni1jb25zdW1lci1wcm9kdWN0cy1tYW51ZmFjdHVyaW5nLW1hZGUtaW4tdGhlLXVzYdIBAA?oc=5\" target=\"_blank\">Consumer Products Manufacturing: Made in the USA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","source.href":"https:\/\/www.assemblymag.com","source.title":"Assembly Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Many consumer goods are still made in the United States, including brushes, flashlights, jewelry, lighters, knives, markers, padlocks, pens, razors, scissors and watches. Those items are typically found in traditional brick-and-mortar stores such as Ace, Home Depot, Kroger, Staples, Target, Walgreens and Wal-Mart, as well as Amazon and other online websites. Supply chain lessons learned during the coronavirus pandemic have spurred demand for products labeled “Made in USA.” In fact, the Alliance of American Manufacturing (AAM) claims that 75 percent of American consumers would prefer to purchase items that are made in the United States. However, one-third say they rarely or never see America-made products while shopping. Many consumers want to buy products that are made in the United States. Photo courtesy Home Depot Inc. “Americans want to shop Made in USA,” claims Scott Paul, AAM’s president. “Retailers are missing out by not doing more to promote American-made [products] in their marketing and store displays. I am truly optimistic that the United States can still do big things, and that includes building a Made in America future.” “Today, more manufacturers are reevaluating where they assemble products, because of the risk of losing China and Taiwan as a supply source due to recent adversarial conditions,” adds Harry Moser, founder and president of the Reshoring Initiative. “Destabilizing geopolitical and climate forces have brought to light supply chain vulnerabilities and the need to address them. “COVID also was a wake-up call to American manufacturers and consumers,” explains Moser, author of ASSEMBLY’s “Moser on Manufacturing” column. “It opened their eyes and made them more sensitive to the risk or probability of disruption.” Consumer Goods Are Different Most consumer products are different than other types of mass-produced items such as cars, appliances, medical devices or furniture. “There are many unique aspects about manufacturing consumer goods that need to be taken into consideration, starting with the product’s form factor,” says Jeff Cavanaugh, senior vice president of global business units at Jabil Inc., a contract manufacturer that works with a variety of companies in different industries. “Many consumer products represent small form factors manufactured in large volumes, with millions of units produced annually. “For that reason, consumer products often are manufactured in centralized locations, mostly in China or other parts of Asia, and then shipped to the rest of the world at low cost from a logistics standpoint,” explains Cavanaugh. “The production of larger consumer goods, however, such as refrigerators, washers and dryers, typically is regionalized, driven in part by the costs of final assembly and distribution. “Another important distinction is the reality of shorter product lifecycles, with 12- to 24-month refresh rates and continuous competitive pressures that accelerate product design, development and delivery,” Cavanaugh points out. “Consumer goods companies must move with speed and agility in bringing products to market, which includes ramping production volumes to maximize capacity, while optimizing productivity and efficiency. Consumer goods manufacturers must move with speed and agility to bring new products to market. Photo courtesy Target Corp. “There’s a lot of focus on new product introduction, as every opportunity to expedite the path to commercialization requires seamless collaboration with manufacturing partners to reduce complexities through the use of best-practices and proven processes,” adds Cavanaugh. As a result, digital manufacturing technology is becoming increasingly critical as companies seek to leverage automated production, improve quality and increase value, while lowering production costs. According to a recent McKinsey & Co analysis, automation, digitization and the drive for greater sustainability are changing the way that American manufacturers assemble their products. These factors are also encouraging CEOs to take a fresh look at where manufacturing is done. For companies that supply U.S. markets, the evolution of factor costs has significantly eroded the comparative advantage of global production locations and supplier networks. When organizations expand their definition of value to take account of sustainability issues and supply chain risks, the gap can narrow even further. Benefits of Domestic Production Making consumer goods in the U.S. makes sense for some manufacturers. One of the biggest advantages is the ability to respond quickly. Companies can adjust swiftly to issues that may arise regarding production schedules, supply chain issues or staffing changes. “Responding to a supply chain crisis quickly can save a company millions of dollars,” says Izzy Galicia, president and CEO of the Incito Consulting Group. “In addition, having employees close by to handle a problem can’t be understated. “You are also able to get a product to market quicker,” notes Galicia. “Offshore production can lead to delays that eventually will be costly. While it might be cheaper to sometimes produce overseas, the potential for more problems does arise because of location and how long it may take to solve a supply chain issue.” “When manufacturers produce consumer goods in the U.S., they have complete control over their supply chain,” adds Ryan McMartin, product marketing manager at Parsec Automation Corp. “[It] means not having to worry about trans-ocean shipping costs, currency exchange rates, tariffs or international trade agreements. “Another benefit is related to basic geographic simplicity,” says McMartin. “It takes far less time to procure materials when you operate within U.S. borders. This relative logistical ease also means manufacturers don’t have to carry as much inventory. With faster delivery and just-in-time fulfillment, manufacturers gain the tremendous benefit of nimbler operations. “We have seen an increased push for domestic production and Made in USA consumer goods,” claims McMartin. “American consumers tend to embody a sense of supporting the little guy when it comes to manufactured goods. “When you consider the escalating political climate around China and Russia, it’s easy to see why Americans may have a sense of national pride and a preference for shopping locally,” McMartin points out. “Geopolitical factors aside, I think the Covid-19 pandemic also encouraged consumers to support domestic businesses with more of a homegrown story, even if it means paying slightly more.” Domestic production enables manufacturers to respond quickly to customer needs. Photo courtesy Gordon Brush Co. What Does ‘Made in USA’ Mean? Designating a product “Made in USA” involves more than just slapping a sticker of an American flag on a package. In fact, what constitutes the claim is somewhat confusing and subject to debate. There’s no law that requires most products sold in the U.S. to be marked or labeled Made in USA or have any other disclosure about the amount of U.S. content that they contain. However, manufacturers that choose to make claims about the amount of U.S. content in their products must comply with rules and policy adopted by the Federal Trade Commission (FTC). The FTC monitors and enforces various claims, with violators subject to large fines. Its most recent Made in USA Labeling Rule went into effect Aug. 13, 2021. Traditionally, the FTC has required that a product advertised as Made in USA be “all or virtually all” made in the United States. “All or virtually all” means that all significant parts and processing that go into the product must be of U.S. origin. That is, the product should contain no—or negligible—foreign content. When a manufacturer makes an unqualified claim that a product is “Made in USA,” it should have “reasonable basis” to support the claim at the time it is made. This means the company needs competent and reliable evidence to back up the claim that its product is “all or virtually all” made in the United States. When claiming a product is assembled in the U.S., manufacturers should be able to prove that the item is “substantially transformed in the U.S., its principal assembly takes place in the U.S. and U.S. assembly operations are substantial.” The product’s final assembly or processing must take place in the United States. The FTC then considers other factors, including how much of the product’s total manufacturing costs can be assigned to U.S. parts and processing, and how far removed any foreign content is from the finished product. In some instances, only a small portion of the total manufacturing costs are attributable to foreign processing, but that processing represents a significant amount of the product’s overall processing. A product that includes foreign components may be called “Assembled in USA” without qualification when its principal assembly takes place in the U.S. and the assembly is substantial. For the “assembly” claim to be valid, the product’s last “substantial transformation” also should have occurred in the United States. Senator Tammy Baldwin (D-WI) has introduced bipartisan legislation to fix outdated labeling laws to inform Americans shopping online about where products are made, and to help U.S. manufacturers selling their goods through online retailers. “Regardless of whether shopping online or in a store, Americans have a right to know whether the products they buy are being made right here in America, by American workers,” says Baldwin. “With more and more consumers buying their goods online, we must ensure online retailers are being just as transparent as brick-and-mortar stores.” ‘Locking’ In Customers Pacific Lock Co. (Paclock) is a family-owned firm based in Valencia, CA, that specializes in padlocks. It produces multiple types of locks that are used to secure everything from garden sheds to gates and job boxes to trailer doors. Paclock’s customers include homeowners, locksmiths and the U.S. military, plus leading manufacturers such as Boeing and Mercedes-Benz. Products are available in a variety of shapes and sizes for numerous light-and heavy-duty applications. The company also produces padlocks out of several materials, such as aluminum, brass and stainless steel. Options include traditional solid and laminated body padlocks, plus hidden shackle and hockey puck-style locks. Other variations include cylinder type, shackle diameter and shackle height. While most of Paclock’s products are marketed through distributors, it has also sold padlocks in traditional retail settings, such as Home Depot, and online retailers such as Amazon. The company sells direct to large commercial customers like Disney and the U.S. Army. “Our manufacturing capabilities allow us to manage and successfully produce large volumes,” says Greg Waugh, president and CEO of Paclock. “As the exclusive supplier of padlocks to Public Storage, for instance, we have delivered millions of the world’s best disc padlock without a single return for defects, while maintaining a near 100 percent on-time delivery rate. This retail display encourages consumers to purchase padlocks that are manufactured domestically. Photo courtesy Pacific Lock Co. “We engineer, machine, assemble and test a majority of our product line in the United States, which is our key differentiating factor,” explains Waugh. “Because we manufacture in the U.S., we can control quality, production capacity and quickly develop new, innovative products in a matter of weeks, not months or years.\" According to Waugh, that gives his company a unique advantage vs. larger firms that dominate the market. “Our biggest competitor makes components in the U.S., but does final assembly in Mexico,” he explains. “When I first joined the company in 2005, all of our components were made overseas. Since then, we’ve steadily onshored production. But, we’ve always done all of our assembly here. “We have to use a few components that come from overseas, such as shackles and cylinders, because of cost,” laments Waugh. “That’s why our packaging says ‘Made in USA with global components.’ “We are limited by certain price points in the market,” Waugh points out. “But, as we continue to develop more expensive, value-added products, we continue looking for ways to make more components domestically. We recently received a U.S. government contract for a high-security padlock, so we make its cylinder here. “Innovation and quality are two of the biggest advantages of making products domestically,” claims Waugh. “By producing in the states, we can control our lead times. However, there’s also a lot of pride in U.S. manufacturing. That’s why we include an American flag on all of our packaging. “Producing the bulk of our products here gives us the ability to make small runs of new items to solve unique customer problems without taking a big risk,” says Waugh. “There are a lot of unique needs that we cater to. For instance, we make custom padlocks for Disney World. \"Our competitors typically require at least a year to introduce a new product,” claims Waugh. “In contrast, we can have a new item ready to go in just a few weeks.” High quality goes hand in hand with a domestic production strategy. Photo courtesy Pacific Lock Co. High quality also goes hand in hand with Paclock’s domestic production strategy. “We control quality,” explains Waugh. “Other lock manufacturers outsource production and pay Chinese or Taiwanese factories to make their products. “In addition, our proprietary machining practices give us unprecedented manufacturing flexibility that leads to short runs, fast turnaround times, almost zero waste and cost savings,” claims Waugh. “We use American-made Haas Automation CNC machines to produce lock bodies, the most important component of a padlock. That enables us to maintain a 0.003-inch tolerance on all of our machining operations. “To succeed, we have to be a jack of all trades,” says Waugh. “If a customer wants something unique, such as a custom color or a special engraving, we’ll find a way to make it. “The only bad things about making products in the U.S. is the fact that finding skilled and competent workers is far more challenging today than it was in the past,” adds Waugh. “Regulations enforced by EPA and OSHA also make it challenging for domestic manufacturers to thrive. For instance, it’s becoming harder to find local vendors that specialize in anodizing and plating. With less competition out there, prices go up.” The ‘Write’ Way to Manufacture The Pen Company of America (PCA) is another family-owned firm that’s bullish on domestic manufacturing. The Garwood, NJ, company has been in business since 1928. Today, it mass-produces a wide variety of writing instruments, including pens and industrial markers, in a 50,000-square-foot factory that’s highly automated. “We have never manufactured products outside the United States,” claims Colleen Shea, vice president of sales at PCA, who runs the company along with her father and two brothers. Automation enables U.S. manufacturers to go head to head with offshore competition. Photo courtesy Pen Company of America “As a fourth-generation writing instrument manufacturer, we have always worked hard to keep all our production domestic,” explains Shea. “Many of our pens are customized for the promotional industry. “In that arena, we are the only manufacturer whose entire line of metal and plastic pens is domestically made,” explains Shea. “While others moved offshore over the last few decades, we have dedicated our time, energy and resources to find creative ways to keep manufacturing in America.” The company produces around 30 different styles of pens and markers. In addition, it makes internal metal components for other companies, such as Fisher Space Pen Co., which assembles its specialty products in Boulder City, NV. PCA also molds plastic parts that a medical device firm uses to produce surgical skin markers. “The majority of our business involves custom-made pens that are used for promotional purposes,” says Shea. “They contain unique customer names, logos, colors and designs. We supply everyone from large banks to small mom-and-pop coffee shops. “We are vertically integrated,” Shea points out. “We do all of our plastic-injection molding in-house, in addition to making the metal writing cartridges. We also do all printing, laser engraving and decorating ourselves. We even make our own springs, and we produce our own heat-transfer film, which is used for decorating pen barrels.” PCA operates three assembly lines that mass-produce an average of 30,000 pens a shift or as many as 300,000 units a week. “All our metal pens have ‘USA’ embossed in them,” says Shea. “All our plastic pens have ‘USA’ molded into them. Our standard, gift and executive boxes all indicate ‘Made in the USA.’ Even the boxes themselves are made domestically.” A typical plastic pen consists of six main components, including the barrel, writing cartridge, a plunger and ratchet mechanism, a spring, a tip and a clip. Metal pens are more complex and contain up to 14 components. “All of our production processes are automated, including robots for assembly and pick-and-place applications,” says Shea. “Automation plays an important role in keeping our pricing stable and constant. That’s the only way we can compete with imported products. The writing instrument industry is very competitive, because pens are a commodity product. Photo courtesy Pen Company of America “The writing instrument industry is very competitive, because pens are a commodity product,” explains Shea. “We pride ourselves on high quality and fast delivery times. “A lot of metal pen companies have moved production offshore, including our biggest competitor,” notes Shea. “Unlike those companies, most of our products are delivered within seven to 10 business days. “Another thing that sets us apart is customer service,” claims Shea. “Many small companies in our industry have been bought up by larger firms that moved customer service offshore. We are more nimble and have a definite advantage in that regard. “With domestic production, we can react quickly to customers’ needs,” says Shea. “When a customer needs 100,000 custom pens in a few weeks or a specially molded pen, we have the ability to fulfill these orders much quicker than the imported products. The disruption in the supply chain over the past several years has given us a unique competitive advantage. To succeed, domestic consumer products manufacturers must excel at customer service, delivery and quality. Photo courtesy Pen Company of America “It’s not difficult for us to compete against offshore manufacturers,” adds Shea. “Even if we’re a little more expensive, we excel at customer service, delivery and quality. However, we have to be creative and stay one step ahead in terms of finding ways to improve our costs. “Overall, this is a good time to be an American manufacturer, because the COVID pandemic exposed a lot of supply chain gaps and deficiencies,” concludes Shea. “We have seen a resurgence and appreciation for U.S. manufacturing.” ‘Brushing’ Away the Competition Gordon Brush Manufacturing Co. is another firm that’s proud of its Made in USA business philosophy. The company has a rich heritage as an American manufacturer of brooms and brushes. In fact, two of its 12 brands date back to 1855 and 1897. Gordon has even trademarked the term “Proud to be an American Manufacturer.” Today, the company mass-produces more than 17,000 standard and specialty items. Gordon’s diverse customer base includes NASA and the U.S. Bureau of Engraving and Printing, plus artists, bakers, chimney sweeps, doctors and janitors. Its products are used to clean everything from accordions to zoos and tanks to telescopes. Gordon’s extensive product list includes brooms and brushes made out of a wide variety of materials, such as natural fibers, synthetic fibers and wire. Handles are made out of metal, plastic and wood. “As the demand for American-made products increases, we are proud to be at the forefront of that movement,” says Ken Rakusin, president and CEO of Gordon Brush Manufacturing Co. “We never offshored anything and are proud that we’ve been able to dramatically grow over our 72 years in business. Finding skilled and competent workers is far more challenging today than it was in the past. Photo courtesy Pacific Lock Co. “We are dedicated to maintaining American jobs and continuing the tradition of great American manufacturers, while creating the highest quality [products],” Rakusin points out. “Other than a small amount of hand assembly that is done by our team of people in Mexico, we never explored moving production overseas. We value our American employees and never have had a situation where we would have needed to terminate them because we tried to save a buck.” Most of Gordon’s products are manufactured in a state-of-the-art 183,000-square-foot factory in City of Industry, CA, that is ISO 9001:2015 certified. The company also operates a 66,000-square-foot factory in Hattiesburg, MS, that mass-produces brushes for automotive and marine applications. In addition, Gordon recently acquired Justman Brush Co. and its 45,000-square-foot facility in Omaha, NE. “The last several years have been a challenge, especially sourcing raw materials and labor,” says Rakusin. “For a while during the pandemic, our lead times [doubled], but things are much better now. “We’ve invested and are investing millions of dollars in new equipment to make us more efficient and productive,” explains Rakusin. “It seems like the more we invest, the more our business grows and the more people we need. “We continue to invest a significant amount in new machinery and we have a couple of machines that use robotics,” adds Rakusin. “Our diverse product offering makes it challenging in most areas to have automated production lines, so we tend to invest in better, faster equipment. “Our products are [primarily] not sold in a retail environment, so packaging isn’t critical,” notes Rakusin. “However, labels state that our products are ‘Made in the USA with global materials,’ as many of our raw materials are not available in the states.”","filter_flag":1}
{"title":"China to hold first forum on sustainability in the cosmetics industry - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jaGluYS10by1ob2xkLWZpcnN0LWZvcnVtLW9uLDIyMjkx0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jaGluYS10by1ob2xkLWZpcnN0LWZvcnVtLW9uLDIyMjkx0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jaGluYS10by1ob2xkLWZpcnN0LWZvcnVtLW9uLDIyMjkx0gEA","guidislink":false,"published":"Tue, 04 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=185, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jaGluYS10by1ob2xkLWZpcnN0LWZvcnVtLW9uLDIyMjkx0gEA?oc=5\" target=\"_blank\">China to hold first forum on sustainability in the cosmetics industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"China to hold first forum on sustainability in the cosmetics industry - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jaGluYS10by1ob2xkLWZpcnN0LWZvcnVtLW9uLDIyMjkx0gEA?oc=5\" target=\"_blank\">China to hold first forum on sustainability in the cosmetics industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"As the environment footprint of human activities is becoming a growing global concern, China will hold the first International Forum on Beauty Economy and Green Innovation, together with the Conference on High Quality Development of China Cosmetics and Household Chemicals Industries. The event will take place on July 11th and 12th, 2023 in Beijing, China. Under the guidance of the Solid Waste and Chemicals Management Technology Center of the Ministry of Ecology and Environment (MEE) of China, the Forum will be jointly held by the China Health Care Association and the China Chemical Industry Environmental Protection Association. CE, ACA, FEBEA, NATRUE, and CTFAS are co-organizing the event. The organizers will also invite Chinese and foreign government departments and relevant research institutions, such as the Delegation of the European Union to China, the French Embassy in China, the United Nations Environment Development Program, the Ministry of Industry and Information Technology of the People’s Republic of China, the National Medical Products Administration, the Department of Solid Wastes and Chemicals of MEE, Ecological Environment Research Center of Chinese Academy of Sciences (CAS), the Nanjing Institute of Environmental Sciences of MEE, the South China Institute of Environmental Sciences of MEE, etc. Other international industry associations will also be invited, such as DUCC, A.I.S.E and CTPA; and international companies, such as L’Oréal, Unilever, CDP, Kao, Givaudan, Lubrizol, etc. will also join. According to the organizers, the Forum will focus on the European Green Deal, focusing on hot-topics, including: the environmental management of chemicals; green materials; bio-manufacturing; ecodesign and green manufacturing; green packaging; microplastics; green products; clean beauty; biodiversity protection; ESG; or alternatives to animal testing. The Forum strives to build an efficient, convenient, and shared international exchange platform throughout the entire industry chain. “With the aim of dealing with doubts and building consensus, it will explore relevant policies, regulations, technologies, and the development direction of the industry. The Forum wishes to lead industry innovation to the promote green transformation of the industry,” said the organizers. Those interested in registering or providing support (sponsorship), can contact: info@cachca.org.cn.","filter_flag":1}
{"title":"Manufacturing and the Circular Economy | ASSEMBLY - Assembly Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg3NC1tYW51ZmFjdHVyaW5nLWFuZC10aGUtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg3NC1tYW51ZmFjdHVyaW5nLWFuZC10aGUtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg3NC1tYW51ZmFjdHVyaW5nLWFuZC10aGUtY2lyY3VsYXItZWNvbm9tedIBAA","guidislink":false,"published":"Sat, 01 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=182, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg3NC1tYW51ZmFjdHVyaW5nLWFuZC10aGUtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5\" target=\"_blank\">Manufacturing and the Circular Economy | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Manufacturing and the Circular Economy | ASSEMBLY - Assembly Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmFzc2VtYmx5bWFnLmNvbS9hcnRpY2xlcy85Nzg3NC1tYW51ZmFjdHVyaW5nLWFuZC10aGUtY2lyY3VsYXItZWNvbm9tedIBAA?oc=5\" target=\"_blank\">Manufacturing and the Circular Economy | ASSEMBLY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Assembly Magazine<\/font>","source.href":"https:\/\/www.assemblymag.com","source.title":"Assembly Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"One company at the forefront of sustainability is the BMW Group. In April, the German carmaker announced that it will head up a new project to explore the circular economy in automotive manufacturing. BMW is joining forces with representatives from the recycling industry, commodity processors and academia to work on ways to improve the quality of secondary raw materials obtained from recycling end-of-life vehicles. Backed by $7 million from the Federal Ministry for Economic Affairs and Climate Action in Germany, the Car2Car project will focus specifically on improving the quality and availability of recycled aluminum, steel, glass, copper and plastic. In the future, innovative dismantling and automated sorting methods will generate far greater quantities of these resources to be recovered from end-of-life vehicles than has so far been the case. This project also includes an end-to-end evaluation of both the ecological and economic impacts of closed-loop recycling of these materials. “The successful transformation of vehicle manufacturers and suppliers is crucial for Germany as a business location,” says Michael Kellner, parliamentary state secretary at Germany’s Federal Ministry for Economic Affairs and Climate Action. “A stronger circular economy that conserves and reuses resources is a key step towards climate neutrality and safeguards supply chains at the same time. [The goal is] to make the automotive industry less dependent on raw material imports and ensure a long-term supply of raw materials for the economy, thereby boosting industrial value creation.” BMW has set a goal of increasing the proportion of secondary materials in its brands’ new models from around 30 percent to 50 percent. To help achieve this, the recyclability of materials is taken into account during the design process for new models. Rethinking how materials are recovered from vehicles at the end of their life is also important. The raw materials obtained from recycling can only be used if they also satisfy the carmaker’s quality standards. The BMW Group is supplying 500 end-of-life vehicles for the project, including BMW, MINI and Rolls-Royce vehicles. Vehicles with combustion engines, plug-in hybrid systems and all-electric drive units will be recycled to produce a representative spectrum of materials. Consortium partners will look for ways to improve the quality and quantity of the recovered materials. The consortium is working out the optimum balance between the dismantling process and post-shredder technologies from a qualitative, economic and ecological perspective to retain as much of the value initially invested in the manufacturing of a car as possible. Today’s recycling processes involve a high degree of manual effort and result in a loss of material purity, meaning they are only economically viable for a small number of vehicle components. The Car2Car project hopes to improve on that. Digital technology and artificial intelligence will be used to automate and speed up recycling processes that have previously been performed manually. For instance, the dismantling process could be partly or even highly automated with the help of robotics. Vision systems, assisted by AI, could be used to sort reusable materials after shredding, thereby improving the quality and purity of aluminum, steel, glass, copper and plastic materials. To achieve this, the consortium will need to develop new technologies, such as AI-enhanced spectroscopy, that can identify different steel and aluminum alloys. This will enable suppliers to obtain raw materials with a higher degree of purity, so less processing work will be required to turn scrap into reusable raw materials. BMW is also leading another consortium project called Future Sustainable Car Materials (FSCM). Under its lead, research institutes and companies are working together on innovative process routes and material concepts for sustainable use of secondary materials and for reducing the carbon footprint of raw materials such as steel and aluminum. The use of secondary aluminum is a prime example of how consistent use of recycled material can cut greenhouse gas emissions. BMW is also carrying out important groundwork when it comes to the actual recycling of vehicles at the end of their life. The company is the only carmaker to run its own recycling center, which has been in operation since 1994. Up to 10,000 vehicles a year are processed at the Recycling and Dismantling Centre in Unterschleißheim near Munich. We hope manufacturers in other industries are inspired by BMW’s efforts. Assemblers of many large, complex products, such as white goods, tractors and aircraft, could certainly benefit from a more circular economy.","filter_flag":1}
{"title":"Bringing sustainable supply chain practices to Africa - Businessday","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvb3Bpbmlvbi9hcnRpY2xlL2JyaW5naW5nLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbi1wcmFjdGljZXMtdG8tYWZyaWNhL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvb3Bpbmlvbi9hcnRpY2xlL2JyaW5naW5nLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbi1wcmFjdGljZXMtdG8tYWZyaWNhL9IBAA?oc=5","id":"CBMiXWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvb3Bpbmlvbi9hcnRpY2xlL2JyaW5naW5nLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbi1wcmFjdGljZXMtdG8tYWZyaWNhL9IBAA","guidislink":false,"published":"Wed, 19 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=200, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvb3Bpbmlvbi9hcnRpY2xlL2JyaW5naW5nLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbi1wcmFjdGljZXMtdG8tYWZyaWNhL9IBAA?oc=5\" target=\"_blank\">Bringing sustainable supply chain practices to Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Businessday<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bringing sustainable supply chain practices to Africa - Businessday","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vYnVzaW5lc3NkYXkubmcvb3Bpbmlvbi9hcnRpY2xlL2JyaW5naW5nLXN1c3RhaW5hYmxlLXN1cHBseS1jaGFpbi1wcmFjdGljZXMtdG8tYWZyaWNhL9IBAA?oc=5\" target=\"_blank\">Bringing sustainable supply chain practices to Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Businessday<\/font>","source.href":"https:\/\/businessday.ng","source.title":"Businessday","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"It is essential to implement “sustainable” practices throughout the supply chain process so that the environment does not suffer from complex logistics systems that convert raw materials into finished products. The United Nations Global Compact echoed this sentiment, and even the United States Environmental Protection Agency (EPA) confirms that greenhouse gas emissions have increased by nearly 90 percent since 1970, much to the detriment of the global community. We can halt this rapid advancement of environmental and social degradation with sustainable supply chain practices. A sustainable supply chain can be defined as one that employs environmentally and socially sustainable practices across the entire gamut of the supply chain process. These environmental and socially sustainable practices are done with the intention of cutting down carbon dioxide (CO2) emissions and other air pollutants that are the primary greenhouse gas emissions responsible for global warming, thereby protecting people and the environment. Use of more efficient packaging allows manufacturers to layer more products onto one another, thereby reducing costs, improving supply chain efficiency, and ultimately reducing greenhouse gas emissions The depletion of resources, deforestation, greenhouse gas emissions, water security pollution, and loss of biological diversity all contribute to a shortfall in the ecological balance, so companies must, as a matter of necessity, develop ethical, logistical processes that ensure the environment is sustained. A company’s supply chain practices must incorporate environmentally ethical practices such as green purchasing, green manufacturing, green warehousing, green packaging, and green transportation. A significant portion of sustainable supply chain practices are based on sustainable environmental practices. However, social standards are also integral to sustainable supply chain practices. These social standards cover issues such as forced labour, health and safety conditions, working conditions, and fair labour practices. Consequently, a comprehensive sustainable supply chain should include a process that yields immense environmental benefits as well as long-term benefits for workers and communities. Ecological and socially responsible supply chain practices Let’s look at some environmentally and socially sustainable supply chain practices that companies and other critical stakeholders may employ in the supply chain. 1. Rethinking intricate material components Material components are all the inputs a company uses to create and deliver its product in a supply chain lifecycle. A fair assessment of material components includes both human and material efforts. In a supply chain process, raw materials and energy expenditure can all be classified as “material components.” Companies can shift towards sustainable supply chain practices by revamping the material components they employ in the supply chain process. For instance, the office supply retailer, Staples, saved $3 million in fuel annually simply by directing its drivers to drive more slowly. It was eventually realized that by limiting the company’s delivery speed to sixty miles per hour, Staples reduced its transport fleet’s fuel consumption from 8.5 miles per gallon (mpg) to 10.4 miles per gallon, thereby utilizing 20 percent less fuel in the supply chain process and altogether reducing its CO2 emissions. Seemingly ‘little’ tweaks like the one from Staples have therefore shown that companies can rethink the components of their supply chain inputs, altogether reducing their carbon footprints and incorporating sustainable supply chain processes. 2) Using recycled materials to reduce plastic pollution A significant detriment to environmental sustainability is plastic pollution. Scientists confirm that excessive plastic in the global environment can result in “plastic bio-accumulation.” Sorely, about 8 million plastic waste escapes into the oceans from coastal nations every year. Meanwhile, plastic production is expected to double by 2050, having crossed more than 448 million tons by 2015. Using recycled materials during the supply chain process can significantly reduce the plastic footprint in the global environment. Manufacturers can reprocess plastic and other materials like steel, glass, and cardboard. The advantages of recycled materials are cross-cutting. Recycled materials do not only save energy—since recycling materials ‌require less energy than refining petroleum into virgin plastic, crushing and smelting iron ores, or transforming pulp wood into cardboard—they also save money. Supply chain enthusiasts have noted that it is now possible to convert waste plastic into “3D printing filament”, a product manufacturers can use to create new products at a lower cost than plastic. 3) Improving product packaging Closely related to the urgent need to reduce overall plastic footprint is the imperative for manufacturers to streamline and improve their product’s packaging as they carry out the supply chain process. It is possible to save manufacturers money and benefit the environment by switching to streamlined packaging that uses fewer materials. The use of more efficient packaging allows manufacturers to layer more products onto one another, thereby reducing costs, improving supply chain efficiency, and ultimately reducing greenhouse gas emissions. Streamlined packaging can also lead to significant improvements in supply chain efficiency. In effect, streamlined packaging can help manufacturers reduce transport costs, optimize inventory management, improve customer experience, enhance sustainability efforts, and improve overall supply chain efficiency. 4) Communicating sustainable supply chain initiatives to consumers Manufacturers must not think that customers are not emotionally invested in a sustainable supply chain process. A Boston Consulting Group (BCG) survey found that 70 percent of customers are willing to pay a 5 percent price premium for sustainable goods. The US Small Business Association also found that four in five consumers buy environmentally friendly products and services. Manufacturers must inform customers about their sustainable supply chain initiatives in order to achieve this goal. As a result of this extended PR campaign, customers, communities, and manufacturers can build a self-fulfilling loop in which they can maintain the trust of their customers that products are environmentally friendly and that their business objectives are aligned with the environment. Conclusion A sustainable supply chain is achieved through a variety of means and methods, both from an environmental and social perspective. Nevertheless, manufacturers must take responsibility for ensuring the environmental safety of the products that arrive through the supply chain process since the goal is to balance profitability with sustainability.","filter_flag":1}
{"title":"Zouk Launches Flagship Store at Nexus Seawoods, Mumbai - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5","id":"CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA","guidislink":false,"published":"Wed, 05 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=186, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5\" target=\"_blank\">Zouk Launches Flagship Store at Nexus Seawoods, Mumbai<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Zouk Launches Flagship Store at Nexus Seawoods, Mumbai - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L2Zhc2hpb24tYWNjZXNzb3JpZXMvem91ay1sYXVuY2hlcy1mbGFnc2hpcC1zdG9yZS1uZXh1cy1zZWF3b29kcy1tdW1iYWnSAQA?oc=5\" target=\"_blank\">Zouk Launches Flagship Store at Nexus Seawoods, Mumbai<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Manufacturing\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Year Ender: How India is embracing New-Age Beauty and Personal Care Brands With the eventful year of 2022 coming to an end, every Indian can be seen to rejoice and prep for the new year as the same is happening after a pandemic-struck hiatus of 2 long years. With festivities around the corner, there has been a significant surge in demand in the markets which are flooded with consumers. Every industry is witnessing the surge, and Beauty and Personal Care is not behind. However, the stiff competition for customers between online and offline brands has become more prominent than ever. To understand the commotion among the brands this season, these brands give us an insight into their 2022 journey and their 2023 growth plans. SUGAR Cosmetics This year SUGAR Cosmetics touched larger milestones, becoming one of the select few brands that have launched 120+ of their own stores in retail, reaching a total of 45000+ retail touchpoints across 550+ cities. SUGAR’s IG page garnered 2.4M+ followers, becoming the largest consumer brand in India on the platform, along with our experiment into gamified AR filters that hit virality on platforms like Instagram and Moj. The brand’s #ShukarHaiSUGARHai Campaign with campaign ambassadors Ranveer Singh and Tamannaah Bhatia was also a huge viral success allowing the brand to receive support from impactful investors namely LCatterton and Ranveer Singh. “At SUGAR in 2022, we managed to almost double our sales over the previous year, achieved the target of being one of the Top 3 brands in color cosmetics in India, and are looking at another year of massive growth,” said Vineeta Singh, Co-founder, and CEO, SUGAR Cosmetics. She further added, “Our plans for 2023 include targeting and achieving a 100 percent Y-O-Y revenue growth over last year, expansion to more than 60,000 retail outlets, making our D2C platform base stronger and larger, and growing our team size to 3,000 employees.” Keeping its audience in mind, SUGAR is looking forward to tapping into different categories of the beauty industry. The brand will also focus on creating solid content to keep educating and engaging its community across all platforms–digital and others. The Body Shop \"We at The Body Shop are embarking upon a new strategy of ‘Change Making Beauty’, which means that we aim to empower customers, employees, and partners to drive positive change for the world through our channels, our products, and our activism,\" stated Vishal Chaturvedi, Vice President, The Body Shop, South Asia. With this vision, the brand is aligned to reach its goal of 25 new stores in 2022 at various locations. Currently, having 200 highly visible and accessible stores all over India, including Tier I and II cities, with the latest additions in Itanagar, Surat, and Indore. The brand's current product portfolio is already over 60 percent Vegan, aiming to become 100 percent Vegan by 2023. This aim is the natural next step forward for the brand's Cruelty-Free commitment, including reformulating all our core products from 100 percent Vegetarian to 100 percent Vegan, while focusing on making its product packaging 100 percent recyclable thus reducing its environmental impact. \"We are strengthening our retail and e-commerce channels by opening more workshop stores and launching new digital experiences. We are expanding our retail footprint with a clear focus on smaller cities and towns. Rolling out the new Workshop store format in as many stores as possible: 30+ new ACTIVIST Workshop stores per year, every year till 2025 bringing the brand to people where they love to shop,\" added Chaturvedi. Plum Plum would be closing the financial year at over 2x the revenue of the previous FY, complemented by the 44 percent growth seen in its overall customer base with a 96.54 percent increase in repeat buyers which is a great win in the D2C space. “We raised $35 million (Rs 270 crore) in a Series C round in March 2022 totaling our funding to over $50 million. With this, our efforts have been towards bringing in more salient brand communication, growing our omnichannel presence and onboarding high-quality talent with a focus on investments in marketing and technology,” said Shankar Prasad, Founder & CEO, Plum Having launched over 8 exclusive brand outlets in the last year across cities, the brand plans to scale this up to 50 in the coming year. Furthermore, Plum onboarded Rashmika Mandanna and Mithila Palkar as its brand ambassadors for the Plum skincare range and Ananya Panday for the Plum Body Lovin’ fragrance range. “We would be expanding our makeup range aggressively with a host of innovative product formats in the coming year. We would also be launching a line of products in the essentials and advanced ranges under both skincare and haircare categories,” added Prasad. Colorbar The post-pandemic period has witnessed a radical shift in consumer behavior and expectations. As per research, the total retail sale is expected to reach $5.5 trillion by 2027 with online sales making up 30 percent of the market. The retail industry has been largely shadowed by challenges across the supply chain, economic uncertainty, and geo-political factors. I feel that going forward, the only way for retailers to sail through is by exhibiting strong levels of adaptability, agility, and flexibility. \"As we graduate into the next year, we can expect a renewed focus on enhancing the customer shopping journey by providing a seamless experience for hybrid shopping. Re-invention of physical store designs along with a robust omnichannel strategy would, however, emerge as a top priority. Many companies will be seen adding features to support new shopping initiatives while integrating technologies supporting AR\/VR advancements. We are aligned to lead the change and have a strong conviction that our strategy would create benchmarks of excellence in 2023,” stated Samir Kumaar Modi, Founder, and Managing Director, Colorbar Cosmetics. Kapiva “We have been relentlessly working towards improving the health and wellness quotient of Indians with Ayurveda. Recently, we expanded in the US and UAE to enable this for the global audience as well. Our focus this year was on increasing the effectiveness of our products. We’ve moved the needle on that front by successfully conducting a clinical trial for our Dia Free Juice. It has also proven to be effective in decreasing HbA1c to an extent of 11 percent and increasing insulin production in the body by up to 25-30 percent. However, the highlight of the year was definitely the recognition by Honorable PM Modi,” said Ameve Sharma, Founder, Kapiva. In the upcoming year, Kapiva aims to double down, concurrently increasing brand awareness and recall to become a household name. Modern consumers are less concerned with outward appearance than they once were, and are more concerned with their complete well-being, which encompasses physical, mental, and emotional health. In order to capitalize on this trend, Kapiva is constantly creating consumer awareness by keeping the emphasis on the paramount importance of Ayurveda and how it can enable people to live a holistic lifestyle. Earth Rhythm 2022 was a favorable year for Earth Rhythm, as it brought in a lot of positive changes in terms of organization, growth, and product. At an organizational level, the brand was able to double the size of the team with its customer base growing 4x times compared to the previous financial year. The brand also went offline with the launch of its exclusive kiosks at 12 different locations across India. “We are expanding our makeup category which will go on to strengthen Earth Rhythm’s wide-ranging portfolio, we have also been intensifying the existing categories. True to our digital-first identity, it was also a natural step for us to continue investing in technology in a bid to further streamline operations and give our customers every convenience they desire. We successfully launched our very own mobile App for both Android and iOS platforms this year and have been gaining steady traction on it. Next year, we plan to further build our portfolio by deepening the makeup category launched in 2022. We reckon 2x growth over FY 2021-22,” said Harini Sivakumar, Founder, and CEO, Earth Rhythm. In keeping with this shift in the consumer’s preference, the brand aims to reinforce its multifunctional product range in both makeup and personal care (face, body, hair), aimed at eliminating the need for and use of multiple products in everyday makeup and skincare routines. ARATA This year at Arata launched over 20 products and 30 offline stores across India, steadily growing 10 percent month on month with respect to GMV. “In the upcoming year, we will go full throttle to bridge the gaps in our product line and be a one-stop shop for all hair care needs. We have already begun our groundwork and have set processes to create formulas in the anti-hair fall, hair colorants, and hair styling segments,” said Dhruv Madhok, Co-Founder, ARATA. BlushBee 2022 has been the year of the first full-fledged operations for Blushbee. Beginning with just three products and later expanding to 10 categories with 64 unique SKUs, the brand has witnessed massive organic growth in its customer base. BlushBee as a cosmetics line is a product of careful decisions in choosing what it wants, the other advantage is that being a clean and green beauty brand which is an important factor in the value proposition. “We hope to grow into a one-stop shop for all things related to color cosmetics, so we are actively looking into introducing new products like foundations, gloss, and so on. We have also discussed extending our horizons beyond just the realm of color cosmetics very soon,” stated Shobana and Navneethan, Founders, BlushBee Organic Beauty Brand. Crazy Owl - Your Skin Co The brand was launched in 2022 with the mindset of embracing the true self and exploring the crazy side. The brand is PETA and IFRA certified, FDA approved, and currently provides the best possible sensorial experience in Hair Care with India's First Date Seed Oil Shampoo, Conditioner, and Hair Oil. “In the short term, we are working towards expanding on two fronts- launching more affordable luxury products across categories in which we operate. With the right set of team, products, and marketing strategy we were able to launch our brand, and today, 6 months post the launch we are happy to serve more than 2000+ households,” commented Damanjit Kohli and Karishma Sahni, Founders, Crazy Owl - Your Skin Co. Increasing its touchpoint and interaction with the product, currently, Crazy Owl has signed up on all major marketplace platforms – Amazon Launchpad, Flipkart Propel Program, Purple, Snapdeal, Tata 1 mg, First cry, Myntra, Nykaa, Bigbasket and will be launching itself on Blink it, Paytm, Pharmeasy and Shopperstop planning to grow its channel every month. Pilgrim “As one of the fastest growing personal care brands in India, we have seen significant growth in the last 12 months and clocked a sale of Rs 10 crore per month along with a growth of 6X. With the trust that the brand has built throughout, we have had some great partnerships this year for our campaigns. Celebrity shout-outs from personalities like Soha Ali Khan, and Vidya Balan, and association with Kalki Koechlin in our most recent commercial have been one of the key highlights,” said Anurag, Co-Founder and CEO, Pilgrim. With a strong consumer base of 1 million, the brand aims to improve its interaction and thus upgraded its technology. Along with updating its technology, the brand is also using innovative ways to reach its target audience. Pilgrim aims to be a Rs 1,000 crore brand in the next 3-4 years by facilitating new product and category launches and exploring newer international markets like the Middle East. Moreover, planning to double down on its R&D capabilities and increase brand investments by bringing in global experiences for its customers, both online and offline. Along with establishing its presence internationally, Pilgrim aims to achieve an annualized run rate of Rs 500 crore by December 2023. iluvia Professional As a new-age, self-care brand pioneering product-driven innovation and technology, during the course of the year iluvia witnessed growth across different channels, and new launches, and hit several milestones. The organization has grown 25x in revenue between October 2021 and 2022 along with a 20x growth in its online consumer base, currently present across key marketplaces and in over 1800 salons in India across 70+ cities. “It is a very exciting time for us as we are working on introducing new patented treatment technologies and new launches in the haircare category. We also expect a positive growth trajectory of 6x to 7x in the coming year,” stated Nishant Gupta and Palash Pandey, Directors, Renaura Wellness Pvt. Ltd. Beauty and Skincare, as a category, has burst forth since the onset of the pandemic in late 2019. The D2C space, especially, has seen remarkable growth which we expect will continue in 2023 and beyond. Moreover, The Indian beauty and personal care segment, which stood above Rs 54,500 crore only two years ago, is expected to grow at a CAGR of 11 percent over the next five years.","filter_flag":1}
