{"title":"More of young India aspires for luxury cars, reports Spinny Max - ETAuto","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDPSAYMBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDM?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDPSAYMBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDM?oc=5","id":"CBMif2h0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDPSAYMBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDM","guidislink":false,"published":"Mon, 06 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=37, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDPSAYMBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDM?oc=5\" target=\"_blank\">More of young India aspires for luxury cars, reports Spinny Max<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"More of young India aspires for luxury cars, reports Spinny Max - ETAuto","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMif2h0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDPSAYMBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvaW5kdXN0cnkvbW9yZS1vZi15b3VuZy1pbmRpYS1hc3BpcmVzLWZvci1sdXh1cnktY2Fycy1yZXBvcnRzLXNwaW5ueS1tYXgvOTc2NDA5MDM?oc=5\" target=\"_blank\">More of young India aspires for luxury cars, reports Spinny Max<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","source.href":"https:\/\/auto.economictimes.indiatimes.com","source.title":"ETAuto","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Advt Advt EY selects Australian battery group as preferred bidder for Britishvolt EY's restructuring arm EY-Parthenon were appointed administrators of Britishvolt in January after the company struggled to raise funds for a major electric vehicle battery factory in northern England and stay afloat. See More Details Join the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETAuto App Get Realtime updates Save your favourite articles Scan to download App New Delhi: The substantial increase in disposable income is inspiring the younger generation to explore the luxury car segment in a big way. In its analysis of the discernible trends in 2022, Spinny Max , the used luxury car segment of Spinny, attribute the rising aspirations of the young customers for luxury cars to the frequent launches of new products, increased options and transparency for the buyers, easier availability of finance, insurance, servicing, warranty options, and better awareness.Spinny Max provides pan-India delivery home service across 250 cities and has physical hubs in Delhi NCR, Bangalore & Mumbai.According to the year-end report 2022 by Spinny Max, BMW, Audi, and Mercedes-Benz were the most preferred brands of the consumers. Audi Q3, Mercedes-Benz C-Class, and BMW 3 series were the hot favourites. JLR and Volvo also were in demand. White, grey, and black, specifically in that order, were the favourite colours of the Spinny Max buyers. Gurugram, Delhi, Bengaluru, and Mumbai had the maximum number of buyers for luxury car brands, the report said.Niraj Singh, founder and CEO of Spinny, said,“ Used luxury cars saw a massive uptick in 2022. The market emerged as great value for money as it allows accessible luxury. In addition, used luxury vehicles in the pre-owned market tend to have a lower average age compared to non luxury brands, making them an attractive option. Each car is thoroughly vetted and test drives and ownership, with an option of extended warranty are designed with highest levels of quality and support keeping customer delight and simplicity at the forefront.”“We realized that with the rise in disposable incomes, professionals in the age group of 30-40 are increasingly aspiring to own luxury cars. As a result, there is a surge in demand for used luxury cars in metros as well as tier-1 cities. Interestingly, even tier 2 and 3 cities are now experiencing substantial traction in this segment, thanks to organized retail platforms that offer premium experience and services.”, he added.Approx 5000 people test-drove Spinny cars with a C-Sat score of 93% & 70% were first-time luxury buyers, the report said.Besides its core markets, Spinny Max shipped more than 50 cars across India to such places as Nanded (Maharashtra), Patna, Nasik, Shimla, Kozhikode. The report said that to ensure the optimum quality of products, Spinny MAX sources its stocks largely from individuals.","filter_flag":1}
{"title":"Best Luxury Hotels In Pittsburgh, Pennsylvania, USA 2024 - The Luxury Editor","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vdGhlbHV4dXJ5ZWRpdG9yLmNvbS9iZXN0LWx1eHVyeS1ob3RlbHMtaW4tcGl0dHNidXJnaC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vdGhlbHV4dXJ5ZWRpdG9yLmNvbS9iZXN0LWx1eHVyeS1ob3RlbHMtaW4tcGl0dHNidXJnaC_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vdGhlbHV4dXJ5ZWRpdG9yLmNvbS9iZXN0LWx1eHVyeS1ob3RlbHMtaW4tcGl0dHNidXJnaC_SAQA","guidislink":false,"published":"Mon, 06 Feb 2023 10:24:25 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=6, tm_hour=10, tm_min=24, tm_sec=25, tm_wday=0, tm_yday=37, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vdGhlbHV4dXJ5ZWRpdG9yLmNvbS9iZXN0LWx1eHVyeS1ob3RlbHMtaW4tcGl0dHNidXJnaC_SAQA?oc=5\" target=\"_blank\">Best Luxury Hotels In Pittsburgh, Pennsylvania, USA 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Luxury Editor<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best Luxury Hotels In Pittsburgh, Pennsylvania, USA 2024 - The Luxury Editor","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vdGhlbHV4dXJ5ZWRpdG9yLmNvbS9iZXN0LWx1eHVyeS1ob3RlbHMtaW4tcGl0dHNidXJnaC_SAQA?oc=5\" target=\"_blank\">Best Luxury Hotels In Pittsburgh, Pennsylvania, USA 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Luxury Editor<\/font>","source.href":"https:\/\/theluxuryeditor.com","source.title":"The Luxury Editor","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Where the Allegheny and the Monongahela rivers converge to form the Ohio River, you’ll find Pittsburgh, a city of two nicknames. It was dubbed “the Steel City” for its role in the early-20th-century rise of the steel industry and the “City of Bridges” as it has 446. Discover more of Pittsburgh’s Golden Era heritage at the Carnegie Museum of Natural History, the Carnegie Museum of Art and the Phipps Conservatory and check out the regional flora and fauna at the Botanical Gardens. Sports fans meanwhile, can head to the Heinz Field football stadium and PNC Park baseball stadium, and pop art lovers, to the Andy Warhol Museum. Fairmont Pittsburgh Make the Fairmont your base during your time in Pensylvania. The skyscraper building is close to the Cultural Quarter. It accommodates 185 bedrooms (one bedroom suites and the Fairmont Room are accessible), with floor-to-ceiling windows maximising its elevated outlook and four-fixture bathrooms as standard. For the most premium experience, book out the Presidential Suite on the 23rd floor; this has both north and south-facing aspects, can be set with up to four bedrooms and caters for dinner parties with as many as 20 guests. There’s a health club and spa onsite, as well as a Starbucks and second floor restaurant. Check Availability & Prices Kimpton Hotel Monaco Pittsburgh This design-forward property is part of an international pet-friendly collection, yet offers plenty of nods to local culture in its decor. 248 guest rooms include statement pieces, such as oversized tufted Kelly green headboards, bedside chandeliers encased in golden birdcages and ceramic penguin desk lamps, plus Atelier Bloem Bath products and Frette linens. The Commoner is the Kimpton Monaco’s industrial-chic US-tavern-style eatery and the Biergarten is its seasonal rooftop haunt. There’s a fitness centre, loaner bikes for guest use and Mini Me Milk Fridges for nursing mums available on request. Check Availability & Prices The Oaklander Hotel, Autograph Collection If you prefer a more suburban setting, choose this Autograph Collection hotel, named after its district (Oakland). It may be a little further away from the city’s nucleus, but is the briefest of strolls from neighbourhood bars, restaurants, the Cathedral of Learning and Heinz Memorial Chapel. A maritime blue colour scheme prevails throughout, with elements of monochrome in bathrooms and public spaces. 167 bedrooms have blackout drapes, laptop-friendly workspaces and eco-friendly practices (such as LED bulbs, recycling and environmentally-friendly cleaning products). Spirits & Tales is the hotel’s restaurant and there’s an in-house library. Check Availability & Prices","filter_flag":1}
{"title":"Where to find green small business grants - Small Business UK - http:\/\/smallbusiness.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA","guidislink":false,"published":"Wed, 15 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=46, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5\" target=\"_blank\">Where to find green small business grants - Small Business UK<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">http:\/\/smallbusiness.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Where to find green small business grants - Small Business UK - http:\/\/smallbusiness.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5\" target=\"_blank\">Where to find green small business grants - Small Business UK<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">http:\/\/smallbusiness.co.uk<\/font>","source.href":"https:\/\/smallbusiness.co.uk","source.title":"http:\/\/smallbusiness.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"UPDATED: Many entrepreneurs are looking to eco small business grants to help them fund environmental projects, adopt green technologies and become more sustainable. Funding comes under the following categories and are often distributed by local authorities: Renewable energy business grants Sustainability grants Energy efficiency grants Sustainable innovation Green jobs The green business grants below have been divided according to where they are in the UK and contain a link to the application page which will give you more information. UK-wide For start-ups developing sustainability-focused products or recycling technologies that help to keep materials circulating. It’s a three-month equity-free programme supporting early stage start-ups that have a positive impact on the environment. There are two separate tracks for two separate cohorts: one for sustainability focused products and one for recycling technologies. The funding part of the package includes a £10,000 grant, £500 Sponsored Amazon Advertising Credits and US$25,000 AWS Activate Credits. You’ll also receive specialised mentorship and a tailored curriculum of workshops, bootcamps and expert speakers. Apply here to sign up for this year’s cohort. Entries must be submitted by March 17, 2023. The fund is currently in its round two phase. We’ll award grants of £75,000 to £200,000 to organisations working to reduce reliance on: Soy-based animal or fish feed And\/or synthetic fertilisers If you are eligible, you will: Be running a project that reduces UK farmers’ reliance on soy-based animal or fish feed and\/or synthetic fertilisers; Have evidence that a pilot of your work has been completed (you do not have to need to have completed this yourselves); Be legally constituted, have a bank account in your organisation’s legal name, and at least two unconnected (unrelated and not married) people on your board or management committee; Have evidence that your project will reduce greenhouse gas emissions; Have proof this project will not lead solely to a private gain; Commit to open-source sharing of information, processes and learnings; Demonstrate collaboration and\/or co-operation within your project, and; Carry out your project in the UK Co-op suppliers are also welcome to apply for this funding and we’ve ringfenced £100,000 for a supplier applicant. We may also be able to connect successful non-supplier applicants with some of our suppliers working in the same area as a means of support. We’ll explain more about how this will work in our webinar. Applications are being accepted until midday on February 28, 2023. The Zero emission vessel and infrastructure (ZEVI) competition is part of a suite of interventions being launched by the UK Shipping Office for Reducing Emissions (UK SHORE), part of DfT. They aim to transform the UK into a global leader in the design and manufacturing of clean maritime technologies. The aim of this competition is to fund: 100 per cent battery electric vessels Alternative fuel vessels Vessel energy efficiency technology, such as wind assistance Vessel charging infrastructure Shore power and corresponding vessel technology Alternative fuel refuelling infrastructure for vessels Alternative fuel electric hybrid vessels are within scope. “Alternative fuels” in this competition refer to fossil fuel alternatives such as hydrogen, ammonia and methanol. Your proposal must build, deploy and operate novel clean maritime technologies focussed on on-vessel technologies and related shoreside infrastructure including at ports, harbours and offshore. Your demonstration must include the zero emission vessel and infrastructure being used in a representative real world operational environment for a period of three years. It is your responsibility to ensure you submit your application to the correct strand for your project. You will not be able to transfer your application and it will not be sent for assessment if it is out of scope. Your project must cost between £3m and £40m. The total grant can’t exceed £20m. The competition closes at 11am UK time on April 19, 2023. The Workplace Charging Scheme (WCS) is a voucher-based scheme that provides eligible applicants with support towards the upfront costs of the purchase and installation of electric vehicle (EV) chargepoints. It is available in England, Wales, Scotland and Northern Ireland, but not in the Channel Islands or Isle of Man. The grant covers up to 75 per cent of the total costs of the purchase and installation of EV chargepoints (inclusive of VAT), capped at a maximum of: £350 per socket 40 sockets across all sites per applicant – for instance, if you would like to install them in 40 sites, you will have one socket available per site After applying using the online application form, successful applicants are issued with a unique identification voucher code by email, which can then be given to any OZEV-authorised commercial chargepoint installer. Grants are available for private and social landlords to support retrofit property improvements to reduce carbon emissions across housing stock. The aim of this fund is to contribute to the reduction of carbon emissions from social and private housing via the provision of full retrofitting services or direct funding to help landlords reduce capital expenditure on eco-friendly housing improvements. Eligible costs include: Stock overview to identify potential retrofit measures and current EPC rating Internal wall, Room in Roof and under floor insulation installation Central heating and electric storage heater installation EV charging station installation England Receive a maximum of £30,000 per project for creating a woodland. The purpose of these eco business grants is to invest in equipment that cuts down on carbon emissions within your business. Warwickshire District Council will fund up to 40 per cent, providing eco business grants of up to £100,000. The grants are for installing energy efficient equipment like LED controls and renewable technologies. Worcestershire County are providing free energy and resource efficiency reviews as well funding for projects up to £20,000. The intervention rate is 40 per cent. They’re available to SMEs throughout Worcestershire, Herefordshire, Telford and Wrekin and Shropshire. Low Carbon Workspaces is supplying match-funded eco business grants between £1,000 and £6,750 for businesses to take on green initiatives like double glazing, LED lighting and smart heating. It’s open to SMEs in Hertfordshire, Buckinghamshire, Bedfordshire, Berkshire, Milton Keynes and Northamptonshire. There are now two grant schemes available under the Howardian Hills umbrella. This one is a Yorkshire-based grant for community infrastructure projects and countryside conservation work in the Howardian Hills Area of Natural Beauty (AONB). Assistance normally sits in the 30-75 per cent range but with this scheme you may be funded 100 per cent of your project. The Farming in Protected Landscapes scheme supports farmers and land managers along with people who work and live in these areas. The scheme will run until March 2025. The support is for farmers and land managers who are carrying out projects to mitigate climate change, provide opportunities for people to discover, enjoy and understand the landscape and cultural heritage or support nature-friendly and sustainable farm shop businesses. The programme will fund a portion of your costs – the amount will depend on how much the project will benefit your business. Your project must end by March 2025. Energy for Business has grants up to £10,000. They’re aimed at businesses in Nottinghamshire, Derbyshire or Leicestershire who improve energy, reduce emissions or are introducing sustainable technologies. The organisation will fund 40 per cent, up to £10,000. You’ve got a few conditions to bear in mind. The minimum project cost must be £2,500 and the maximum £24,999 – you’ll be given the grant once the work is completed. This is a page detailing several grants and funding opportunities for farmers and land managers. Pig, beef and dairy farmers whose farming systems produce slurry are able to apply for a grant which will allow them to build new slurry stores, replace slurry stores and expand existing slurry stores. You can apply for a grant between £25,000 and £250,000 for six months of storage. You can also apply for money to improve tree health and for grants from the Farming and Innovation Programme. Click on the link above to find out more about this grant and others for farmers and land managers. This one’s open to businesses in the green tech, low carbon and renewable energy sectors, with grants starting from £10,000 available. Your aim should be to increase productivity, skills and employment. You can use the money in the following areas: Launch a new business Modernise, expand or re-organise an existing business Upgrade a business by introducing innovative new technology or processes Take a new product from development to production An SME may apply for a grant between £200-£1000 to cover a maximum 40 per cent of the total value of their energy efficiency project through the Sustainable Business Partnership CIC. The grant is available to any business, social enterprise or charity that: Has fewer than 250 full time equivalent employees Has a turnover less than £44m Is not owned by a group or company that does not meet the above two criteria To apply for a grant the SME must also have: A premises in East Sussex (excluding Brighton & Hove) where the energy efficiency project will be installed Received an Energy Audit to identify energy saving measures; provided through the LoCASE project, or through a similar scheme or a private supplier. Public sector organisations and schools are not eligible for funding. Download Application Form You can download your application form using the link above. To apply for the grant please email your completed application form and supporting documents to info@sustainablebusiness.org.uk. SMEs in Greater Manchester may be eligible for grants between £2,000 and £25,000 (before VAT) and the grant would be funded up to 50 per cent of the cost of your energy efficiency improvements, up to a maximum grant of £12,500. The grants are available for a limited time on a first-come-first-served basis and can go towards, for example: A new LED lighting system for your premises Heating equipment upgrades Replacement drives or motors Process efficiency investments If you’re eligible, fill out the form in the link above. This grant helps businesses who are seeking to transition technologies that contribute to a lower carbon economy. The project you propose must cost no less than £5,000 and no more than £24,999. It will be 50 per cent match-funded in Cheshire and Warrington, Greater Manchester and the Halton district of the Liverpool region. Grants are awarded on a 60 per cent match basis for businesses based in Lancashire, Cumbria and majority Liverpool region. Businesses will need to demonstrate that they can fund the remaining project costs. This £10.05m grant scheme aims to help SMEs within the West Midlands region to meet European standards. You must have been trading for more than 12 months and own or lease heavy goods vehicles or light good vehicles that are not complaint with Clean Air Zone emission standards. You must also be able to demonstrate your use of clean air zones through your commercial operations. The total grant package for each business is up to £180,000 – that’s up to £15,000 per heavy goods vehicle and up to 35 per cent of the maximum cost of an upgrade up at a maximum of £4,000 for each light goods vehicle. This programme offers free renewable energy\/low carbon innovation assessments along with grants to SMEs in Worcestershire (and grants only to SMEs in Shropshire). SMEs will be encouraged and enabled to adopt lower carbon technologies – or the grant can help businesses in the clean innovation or those developing low carbon solutions alongside their normal business operations. Some sectors such as primary agriculture and finance are not eligible. Low Carbon SMEs helps businesses gain access to capital grants that will help them make green improvements to their operations. Eligibility is based on the ability to demonstrate sufficient energy savings. The maximum intervention rate is 50 per cent. Low carbon investment initiatives include: Voltage Optimisation System – to assist the company in lowering its carbon footprint and energy costs. Power factor correction equipment Variable speed air compressor with integral air dryer This scheme is to help small businesses in West Yorkshire to deal with rising energy costs. It offers 50 per cent funding up to £5,000 as well as providing practical support such as help to buy a more efficient boiler or help installing new low-energy lighting. The grants are open to businesses with 50 or fewer employees of all sectors. With this scheme, you can get a grant to cover part of the cost of replacing fossil fuel heating systems with a heat pump or biomass boiler. You’re eligible if: Own the property you’re applying for (including if it’s a business, a second home or a property you rent out to tenants) Have installed your new heating system on or after April 1, 2022 Be replacing fossil fuel heating systems (such as oil, gas or electric) You’re still eligible if you’ve already had funding to make your property more energy efficient, for example by insulating it. Community Solar Accelerator is a European Regional Development Fund (ERDF) funded, SME support project, delivered by Brighton Energy Co-op. Community Solar Accelerator will enable SMEs to reduce CO2 emissions by match funded grants of up to £25,000 towards either: Solar PV arrays Solar PV arrays & electric vehicle charging points Grants are available at up to 40 per cent of total eligible costs and are paid once the work is done and paid for. Match funding of 60 per cent of the project cost will come from the SME and loans, investments, savings and company reserves can be used. However, please note your time can’t be included as match funding. The Community Solar Accelerator programme will run until June 30, 2023. LoCASE is closing in June 2023. Funding is still available in many of the regions that the programme covers: Hampshire, Surrey, West Sussex, East Sussex, Greater Essex, Kent and Medway. This can be standard SMEs in the region who are looking at ‘green’ projects or LCREE\/EGSS firms seeking grant funding for business development purposes, especially pertinent through Covid-19 adaptation. Maximum 40 per cent ERDF grant contributions will remain at a limit of £10,000 with the minimum grant of £1,000 for qualifying projects. The LoCASE Programme brings together three key requirements for the growth of a low carbon economy – “Stimulating Demand”, “Supporting Supply” and “Transferring Knowledge”. This work will offer focused, individual support to SMEs (including social enterprises) improving competitiveness and creating jobs through increased energy efficiency and new low carbon business predominantly across the Local Enterprise Partnership (LEP) areas of South East (SELEP), Solent, Coast 2 Capital and Enterprise M3. This is a grant fund to help businesses, organisations communities and individuals interested in developing skills in the green economy and investing in green energy and carbon reduction schemes. The green entrepreneurs fund, which is being run in collaboration with the University of Derby, is made up of three funding streams: Green entrepreneurs small grant fund Grants of between £6,000 to £20,000 are available for proposals for alternative energy, clean fuel and carbon reduction projects. To be eligible, projects must have a minimum spend of £15,000 and there is a maximum intervention rate of 40 per cent. A total of £500,000 has been set aside for this fund. Green entrepreneurs demonstrator grant fund £1.2m has been earmarked for a small number of high-quality, larger scale carbon-cutting projects in Derbyshire. This fund is open to larger scale projects that are designed to encourage solutions beyond the mainstream of current thinking. The maximum grant available through this fund is £200,000. Green entrepreneurs scholarship fund This fund will support individuals to retrain with skills to enable them to enter the field of low carbon, green energy. Individuals can access up to £1,500 for training costs. £100,000 has been set aside for this fund. The scholarship grants will allow individuals to study around their existing responsibilities. It will enable them to obtain the skills and qualifications they need to change their career or progress in employment. The study can take place either online or face to face or a combination of both. Applicants are encouraged to contact the careers service and discuss their plans before applying for a green entrepreneur programme scholarship grant. The Sustainability in Enterprise project helps small and medium-sized enterprises (SMEs) in Greater Nottingham on their journey to Net Zero. Part-funded by the European Regional Development Fund (ERDF), we help businesses fully understand their current carbon emissions and identify effective carbon reduction measures. Financial support is available to help SMEs take action. Free, practical support is also available from specialists in sustainable business operations, building management, product design and employee engagement. Carbon grants and recruitment grants are available. Benefit from up to £25,000 financial support to help meet the costs of workplace travel improvements such as electric vehicle charge points, cycle parking, showers, pool bikes, car sharing and car parking management. You’re eligible if your business is inside the Nottingham City boundary. Take a look on the webpage for what the grant will and won’t support. The Green Heat Network Fund (GHNF) is a three-year £288m capital grant fund that will support: The commercialisation and construction of new low and zero carbon (LZC) heat networks (including the supply of cooling) The retrofitting and expansion of existing heat networks There will be a series of quarterly application rounds until the scheme closes in 2025. Individuals, households and sole traders cannot apply. Scotland NESTRANS supports development of travel plans in Aberdeen City and Shire. Applicants can bid for up to £10,000 in matched funding to support sustainable transport initiatives. This scheme is focused on providing financial support for businesses involved in the creation of either new woodland spaces or the sustainable management of existing woodlands. It is managed by the Scottish Rural Payments and Services agency and Scottish Forestry. If you’re looking to grow your Scottish manufacturing business through developing low carbon products, processes or services, you can apply for the LCMCF grant. Your project can use pure Research and Development (R&D), capital investment or environmental aid support in its effort to speed-up the transition to a low carbon economy in manufacturing. There’s a minimum value grant of £150,000 available. The LCMCF doesn’t provide 100 per cent of funding towards eligible project costs. The level of grant support will be determined dependent upon project activity, the size of your company and the location of the project. Once an amount has been allocated, you’ll be required to fund the rest of the project independently. Grants with a minimum value of £150,000 are available to cover eligible costs. You’ll have the chance to discuss the full details with your advisor. Your idea can include, but is not limited to: The development of a new product, service or technology that will reduce emissions, energy consumption, waste production and decrease the use of raw materials in the manufacture, and\/or end use, of the existing alternative The development of new business models based on the principles of a circular economy. Through circular supplies, resource recovery, product life extension or use of sharing platforms, for example. The challenge applies to companies based in Scotland. Maybe yours is a Scottish company working in isolation (a single company project), or one of a group of multiple companies working in collaboration – as long as at least one is based in Scotland, you’re eligible to apply. It’s important to consider the following: An assessment of your company or project eligibility will be made once we’ve received your fully completed expression of interest form All companies must follow Fair Work practices Funding will be available until March 31, 2026. Scottish Enterprise and Transport Scotland have developed ZEMIF to support Scottish based businesses to scale the manufacture of prototype zero emission niche and HDV components, systems and vehicles through R&D activities. The fund will encourage collaboration and clustering of innovation activity as projects move towards low-volume manufacturing. Successful project outcomes will be commercialised to fuel the decarbonisation of niche and HDVs in Scotland and across the globe. The fund has two main strands. These are: Innovation2Manufacture – for R&D projects focused on enabling the manufacture of prototype zero emission vehicles, components and systems, through to small scale manufacturing Innovation2Deployment – for R&D projects aimed at the rapid testing of new transport ideas using technology, business model, software and financial innovation This is a discretionary fund with a grant value assigned to your project on an individual basis. It doesn’t provide 100 per cent of funding towards eligible project costs. The level of grant support will be determined dependent upon project activity and the size of your company. Once an amount has been allocated, you’ll be required to fund the rest of the project independently. If your project can help speed up the transition to zero emission niche and HDVs, we’d like to hear from you. You can apply to the fund if you are: A company of any size based in Scotland Ready to scale the manufacturing of a prototype, or trial existing technologies in new ways Working alone or in collaboration with others All applicants are subject to a check on ownership and finances. It’s important to consider the following: An assessment of your company or project eligibility will be made once we’ve received your fully completed expression of interest form All companies must follow Fair Work practices The application length varies but is typically between four and twelve weeks, depending on the size and scale of your project. The aim of this challenge is to support Research and Development (R&D) to assist companies in developing technology that will lead to new commercial uses for CO2, and the creation of jobs, as part of our journey to a low carbon economy. The challenge will support projects to develop and test products and to enable infrastructure developments at emissions sources for use in your project. However, projects with a strong focus on carbon capture technology are out of scope, as are projects which do not involve CO2 transformation – using CO2 as a solvent or working fluid, for example. The challenge grants are contributory covering up to 50 per cent of incurred eligible costs following submission of evidence of the successful applicant’s expenditure and are expected to be in the region of £150,000 – £500,000. Larger grants may be available for exceptional projects. The grant is only available to companies based in Scotland, or those with the goal of establishing a presence within Scotland to carry out research and development and create jobs. To secure an R&D grant, companies will be legally obligated to create and\/or safeguard jobs throughout the project and maintain these positions for a period of up to 24 months after the project is completed. Funding is available to 31 March, 2024. Funding will be available to companies across Scotland until March 2026 and can be accessed in various ways, including: Grant funding – open to applications at all times, support is available for large-scale company R&D and capital investment projects focused on innovation in the crucial areas of green heat. Feasibility studies – these competitive funding calls help Scotland-based businesses develop innovative green heat solutions, focusing on technology readiness levels five to seven. The first of these calls is expected to launch in early 2023. CAN DO Innovation Challenges – using the Scotland CAN-DO approach, this route supports public sector innovation challenges. It provides innovators with 100 per cent funding via R&D service contracts through a competitive procurement process to fund the development of solutions. Its end goal is the deployment of commercial products and a contract with a challenge sponsor. It’s expected two CAN DO Innovation Challenges will be launched as part of the programme – the first by end of June 2023. European funding, through the Clean Energy Transition Partnership – a new transformative research, development and innovation programme which will support transnational collaborative projects designed to accelerate the energy transition. The programme has now launched, is open to organisations based in Scotland, and is delivered by Scottish Enterprise. More details about each type of funding can be found on the Scottish Enterprise link above. Energy Saving Trust is offering micro businesses and sole traders, with an operating site within 20km of Scotland’s low emission zones, a grant towards the safe disposal of non-compliant vehicles. The Low Emission Zone Support Fund, funded by Transport Scotland and administered by Energy Saving Trust, offers an incentive for eligible businesses to take their older, more polluting vehicles off the road. Grants of £2,000 are available to micro businesses with nine or fewer full-time employees and sole traders. Successful applicants will be required to dispose of their vehicle at a Scottish authorised treatment facility. A grant offer must be in place prior to vehicle disposal. Following vehicle disposal and successful receipt of the fund, eligible businesses will be offered an additional £1,000 towards the purchase of a cargo or electric cargo bike option through Travel Better Fund for businesses. The Glasgow City Council Green Business Grant will help businesses in Glasgow address both the cost of living and climate crises through measures such as energy efficiency, renewables, active travel and waste management. The Green Business Grant is a non-repayable grant of up to £10,000, which will cover up to 50 per cent of the total cost of a project. Projects can include anything that helps businesses reduce their energy bills and make progress towards achieving net zero carbon emissions. To be eligible for the grant, your business must: Be a small or medium-sized enterprise (as defined in the Companies Act 2006) Have been trading for at least six months Own its own premises in Glasgow or have written permission from your landlord to make changes to the premises and seek planning permissions from Glasgow City Council Planning Division to implement the works detailed in your application Have a Glasgow postcode and pay non-domestic rates in Glasgow Be headquartered in Glasgow Premises of an organisation based outside Glasgow will not be considered. Businesses whose main base is within the city boundary cannot use the grant to improve premises or create jobs outside Glasgow. Businesses that are owned by another business with more than a 25 per cent stake are not eligible. The grant will cover up to 50 per cent of the total cost of a project, to a maximum of £10,000. Businesses must be prepared to cover the rest of the cost from other sources. The grant will close to new applications on June 30, 2023 or when the budget is fully allocated, whichever is earlier. All projects must be completed by December 31, 2023. You will be contacted within 10 working days of submitting your completed online application. Through the Green Recovery Capital Development Grant, Perth and Kinross Council has made funding of up to £25,000 available for businesses that were financially affected by Covid-19 and now want to make capital investments in the Perth and Kinross area. This fund offers grants of up to £25,000 to cover up to 50 per cent of eligible costs. Projects must involve a minimum spend of £10,000, which means that businesses must match the funding with at least £5,000. Preference will be given to projects that involve green initiatives which will reduce your business’ carbon footprint. The grant will not be awarded upfront immediately after approval – instead, you will receive payment after you make your purchases and submit receipts or invoices. This means that initially you must be able to afford the project’s full cost until you are refunded. Priority will be given to projects that reduce the carbon footprint of your business. Applications must be submitted before February 28, 2023. To support the use of electric vehicles across Scotland, Transport Scotland offers grant funding to help organisations install electric vehicle (EV) charging infrastructure on their premises. The funding is distributed by Energy Saving Trust and is currently available for chargepoints that will only be used by occupiers, staff and visitors. Grants to cover up to 50 per cent of the costs of purchasing and installing electric vehicle chargepoints are available to rural businesses and property factors who manage communal property areas, including parking, and other organisations that manage communal parking for residential properties, such as private landlords. Grants to cover up to 75 per cent of the costs of purchasing and installing electric vehicle chargepoints are available to third sector organisations. SMEs in rural areas of Scotland are eligible. Property factors who manage communal property areas, including parking, and other organisations that manage communal parking for residential properties, such as private landlords, are also eligible. IBioIC has various funding programmes to help you progress your R&D, find collaborators and build your business. The Midlothian Council LACER Fund provides grants to businesses to support green projects, social enterprises to support start up and growth and aims to develop a network of local business associations to encourage collaboration. Available funds are: Social Enterprise Fund Grants of up to £4,000 are available to support the development of locally based social enterprises, helping them to start up and grow. Green Transition Fund Supports businesses to implement a project that helps them be more environmentally friendly and progresses Scotland’s transition to Net Zero. A grant of 70 per cent of project costs up to £20,000 is available to help with the green transition. Business Association Fund A £1,500 grant is available to help businesses come together to deliver local projects collaboratively as part of a Business Association. The LACER funds are available for Midlothian based businesses only. To find out more about the funds and how to apply, email bg@midlothian.gov.uk The SBA Get to Zero Grant provides funding for businesses in East Renfrewshire that wish to diversify and invest in sustainable measures to help their business become more efficient, in order to reduce carbon emissions and energy loss. Businesses can receive a 50 per cent match-funded grant of up to £5,000. Measures could include: Low energy heating and lighting systems Improved insulation for roof and building Solar, ground or air source heat or solar thermal technology Waste management or recycling Equipment that demonstrates a significant energy saving through its installation The Business Recovery and Growth Fund (BRGF) is targeted at new and existing businesses based in North Lanarkshire to support their strategic, longer term sustainability and growth. BRGF grants will cover 50 per cent of eligible project costs, up to £50,000, to fund specific activities to help businesses recover, adapt and diversify their operations. You are eligible if your business: Is based in North Lanarkshire Is a micro, small or medium-sized enterprise (up to 250 employees) Expects its turnover to reach a minimum level of £85,000 within 12 months of the date of the application Does not operate in an ineligible sector: gambling and betting or drinking places (bars or public houses) Is not a ratepayer of a business in the retail sector operating in premises with a rateable value of £51,001 or over Has not incurred any project-related expenditure until after a formal decision on the grant application has been received Owns the business premises or has more than 12 months remaining on a commercial lease at the date of application Is not connected to a tax haven, as set out in the Coronavirus (Scotland) (No. 2) Act 2020 Home-based businesses must be trading (not incorporated) for more than 12 months and will only be considered for support in exceptional cases. The fund can provide grants to cover up to 50 per cent of your project costs, with a maximum of £10,000 per grant. The minimum grant value is £1,000, which means your project must cost at least £2,000. The fund can be used to make changes to business premises and business operations to reduce their carbon footprint from energy consumption. This might include: Changing to a low carbon heating system Installation of low and zero carbon generating technologies, such as solar PV, biomass and micro-wind Building fabric upgrades such as insulation, energy-efficient lighting, draught-proofing, double or triple glazing Before you begin your application, you will need a record of: The trading name of the business The number of employees, your turnover and export sales (where applicable) The proposed expenditure Your business bank details The rateable value of your premises – this can be found on www.saa.gov.uk A copy of your lease if you are paying non-domestic rates for the premise Your latest set of accounts and management accounts, as well as a business plan (or mini business plan) Two quotes for each item being purchased A calculation of your baseline carbon footprint The projected emissions reduction from this investment The East Ayrshire Net Zero Grant provides up to 50 per cent funding, up to £3,000, to support local businesses to transition towards net zero carbon emissions and also help offset the current rises in energy costs. The fund is intended to help small to medium-sized businesses (SMEs) to implement energy and resource efficiency improvements. It can be used for: The purchase of equipment that would contribute to energy saving Green skills training Renewable energy installations (for example, solar, ground or air source heat pumps) Waste management or recycling Lighting systems Roof and building insulation Low energy heating To be eligible, a business must: Have been trading for at least 12 months Employ between three and 49 people Be working with Business Energy Scotland or the University of Strathclyde Have completed a business energy efficiency audit and created a carbon reduction plan The Low Carbon\/Energy Efficiency Grant is for West Lothian businesses that are looking to: Overcome barriers to reducing their carbon emissions Implement new business processes that will help reduce carbon emissions Implement strategic changes identified through consultancy support Promote their green credentials Enter a new market in the net zero landscape Your business must also: Have at least five employees Have been trading for at least one year Have growth potential over the next three years Wales Small Grants – Woodland Creation is a scheme aimed at farmers and other land managers to encourage planting of small areas of trees on land which is agriculturally improved or low environmental value in Wales. Funding is available for tree planting to create shelterwoods, alongside watercourses, and in field corners or small fields for stock shelter, biodiversity and woodfuel. Small Grants – Woodland Creation also offers 12 years of payments for Maintenance and Premium payment in respect of the new planting. This application window will open on February 13, 2023 and close on March 24, 2023. The budget allocation for this application window is £3m. All of the elements are laid out in a series of digital booklets. Find out how to apply in this booklet. The fund will provide capital support to businesses towards the purchase of renewable energy systems for their business premises. Grants available are between £1,000 and £10,000 towards the cost of the renewable energy system, which will make up no more than 50 per cent of eligible costs. Your business must either: Own the freehold, or Hold a lease with a seven-year minimum period remaining after the final grant payment date. You will need to secure your landlord’s written consent for the proposed works. The business premises must be registered on Carmarthenshire County Council’s Non-Domestic Rates register. All expenditure associated to the grant must be completed within four months of the date of approval letter. Applicants will be treated on a first come, first served basis until the allocated fund has been used up. The Sustainability Development Fund offers project grants, management grants to support staff costs or development grants to act as a catalyst for new action or partnerships. It normally provides 50 per cent of total project costs but up to 75 per cent is available for eligible voluntary sector projects. Applicants are expected to contribute at least 25 per cent of total project costs either from their own reserves or from other sources such as European funds, National Lottery funding or ‘in kind’ contributions. The private sector and individuals can apply, but the project has to be in the wider public interest to be eligible. The fund supports projects which will: Conserve and enhance the natural beauty of the AONB, including the built environment Promote sustainable forms of social and economic development Promote the economic and social well-being of local communities Promote quiet enjoyment of the AONB Priority is given to projects which: Involve local communities and young people Lever in contributions from other sources in cash or in kind Overcome barriers to sustainability and promote a wider understanding of sustainability Promote sustainable forms of social and economic development or add value to existing sustainability projects Raise awareness of the AONB and generate jobs or income for communities, without damaging the landscape Demonstrate innovation or best practice Contact Ceri Lloyd at Loggerheads Country Park on 01824 712757 for more information. Led by Cadwyn Clwyd and Denbighshire Voluntary Services Council (DVSC), the £600,000 Community Innovation Denbighshire project will focus on encouraging micro firms, community groups and social enterprises in rural and urban areas to put forward proposals that will deliver regional and environmental benefits. Supported by Denbighshire County Council and part-funded by the UK Government through the £220m UK Community Renewal Fund, support is available for 25 organisations or individuals who can apply for a £5,000 grant they will match-fund to trial new products, systems and services. Business Wales will also be on hand with guidance and advice throughout the process. For more information, email admin@cadwynclwyd.co.uk or call 01490 340500. This is the same as the Boiler Upgrade Scheme, but it’s available in Wales as well as England. With this scheme, you can get a grant to cover part of the cost of replacing fossil fuel heating systems with a heat pump or biomass boiler. You’re eligible if: Own the property you’re applying for (including if it’s a business, a second home or a property you rent out to tenants) Have installed your new heating system on or after April 1, 2022 Be replacing fossil fuel heating systems (such as oil, gas or electric) You’re still eligible if you’ve already had funding to make your property more energy efficient, for example by insulating it. Northern Ireland The Department of Agriculture, Environment and Rural Affairs is a government department in the Northern Ireland Executive. This page lists environmental grants along with other business support. If you can’t find any suitable eco business grants in the list above, take a look at the government’s finance and business support round-up or your local authority’s website. Just be aware that some of the grants listed on the government’s website have expired. Finally, support may be available in other forms for green improvements you want to make – this could be advice, mentoring, energy assessments or something else entirely. Read more 150 UK small business grants to apply for right now","filter_flag":1}
{"title":"'It's All in Hettich' campaign unlocks inspiring possibilities for architects and designers - Architecture and Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2hldHRpY2gtYXVzdHJhbGlhL2hldHRpY2gtY2FtcGFpZ24tdW5sb2Nrcy1pbnNwaXJpbmctcG9zc2liaWxpdGllc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2hldHRpY2gtYXVzdHJhbGlhL2hldHRpY2gtY2FtcGFpZ24tdW5sb2Nrcy1pbnNwaXJpbmctcG9zc2liaWxpdGllc9IBAA?oc=5","id":"CBMidWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2hldHRpY2gtYXVzdHJhbGlhL2hldHRpY2gtY2FtcGFpZ24tdW5sb2Nrcy1pbnNwaXJpbmctcG9zc2liaWxpdGllc9IBAA","guidislink":false,"published":"Sat, 11 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=42, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2hldHRpY2gtYXVzdHJhbGlhL2hldHRpY2gtY2FtcGFpZ24tdW5sb2Nrcy1pbnNwaXJpbmctcG9zc2liaWxpdGllc9IBAA?oc=5\" target=\"_blank\">'It's All in Hettich' campaign unlocks inspiring possibilities for architects and designers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"'It's All in Hettich' campaign unlocks inspiring possibilities for architects and designers - Architecture and Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyZWFuZGRlc2lnbi5jb20uYXUvc3VwcGxpZXJzL2hldHRpY2gtYXVzdHJhbGlhL2hldHRpY2gtY2FtcGFpZ24tdW5sb2Nrcy1pbnNwaXJpbmctcG9zc2liaWxpdGllc9IBAA?oc=5\" target=\"_blank\">'It's All in Hettich' campaign unlocks inspiring possibilities for architects and designers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture and Design<\/font>","source.href":"https:\/\/www.architectureanddesign.com.au","source.title":"Architecture and Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Hettich, a leading provider of cabinetry hardware fittings and hardware solutions, has launched a dynamic brand evolution campaign, ‘It’s All in Hettich’. This transformation encompasses a renewed commitment to innovation, trendsetting designs, and collaborative partnerships. In an era defined by rapid change, Hettich recognises the evolving needs and desires of both professionals and individuals seeking exceptional cabinetry solutions. The ‘It’s All in Hettich’ campaign signifies our dedication to addressing these demands, delivering products that are not only functional but also visually stunning, sustainable, and tailored to the unique preferences of our customers. For architects and designers, ‘It’s All in Hettich’ means unlocking a world of limitless possibilities. We understand that your projects require not only impeccable functionality but also extraordinary design aesthetics. Hettich empowers you to bring your creative visions to life by offering an extensive range of cutting-edge furniture fittings and hardware. From innovative drawers, hinges and storage solutions to seamlessly integrated lighting systems, our products are designed to elevate the functionality and visual appeal of any space. By collaborating closely with you, we ensure that our solutions perfectly align with your project requirements and help you leave a lasting impression on your clients. At Hettich, we believe that the home is more than just objects; it’s an expression of your unique style and a reflection of your lifestyle. With ‘It’s All in Hettich,’ we invite end consumers to embark on a journey of discovery, where exceptional design meets unmatched functionality. Our wide range of products offers a perfect blend of form and function, allowing you to create personalised living spaces that inspire and enhance your daily life. Whether you are looking for seamless cabinet systems, innovative drawer solutions, or ergonomic handles, Hettich ensures that every detail of your project is carefully crafted to meet your needs and exceed your expectations. Embrace the freedom of choice, quality, and sustainability that ‘It’s All in Hettich’ brings to your home. With a strong commitment to sustainability, Hettich incorporates eco-friendly practices throughout its product development and manufacturing processes. We believe in creating solutions that not only enhance living spaces but also contribute to a greener future. Explore the possibilities of ‘It’s All in Hettich’ by visiting our showroom or contact one of our partners that can help bring your project to life. Discover how our innovative products can transform your projects and elevate your living spaces. Let Hettich be your trusted brand in creating exceptional environments that inspire, innovate, and delight.","filter_flag":1}
{"title":"8 out of 10 Indians Experience a Shift in Buying Behavior - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3JldGFpbC1idXNpbmVzcy9jb25zdW1lci10cmVuZHMvOC1vdXQtMTAtaW5kaWFucy1leHBlcmllbmNlLXNoaWZ0LWJ1eWluZy1iZWhhdmlvctIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3JldGFpbC1idXNpbmVzcy9jb25zdW1lci10cmVuZHMvOC1vdXQtMTAtaW5kaWFucy1leHBlcmllbmNlLXNoaWZ0LWJ1eWluZy1iZWhhdmlvctIBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3JldGFpbC1idXNpbmVzcy9jb25zdW1lci10cmVuZHMvOC1vdXQtMTAtaW5kaWFucy1leHBlcmllbmNlLXNoaWZ0LWJ1eWluZy1iZWhhdmlvctIBAA","guidislink":false,"published":"Thu, 16 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=47, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3JldGFpbC1idXNpbmVzcy9jb25zdW1lci10cmVuZHMvOC1vdXQtMTAtaW5kaWFucy1leHBlcmllbmNlLXNoaWZ0LWJ1eWluZy1iZWhhdmlvctIBAA?oc=5\" target=\"_blank\">8 out of 10 Indians Experience a Shift in Buying Behavior<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"8 out of 10 Indians Experience a Shift in Buying Behavior - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3JldGFpbC1idXNpbmVzcy9jb25zdW1lci10cmVuZHMvOC1vdXQtMTAtaW5kaWFucy1leHBlcmllbmNlLXNoaWZ0LWJ1eWluZy1iZWhhdmlvctIBAA?oc=5\" target=\"_blank\">8 out of 10 Indians Experience a Shift in Buying Behavior<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Top 10 Luxury Watch Brands in India: How to Make the Right Choice Did you know that Sylvester Stallone, the legendary Hollywood action star, is actually auctioning off the 11th feature of his famous movie \"Rocky\"? And guess what's included in this exciting sale? The Patek Philippe Grandmaster Chime, valued at a staggering Rs 62 crore! This collection is a showcase of rare timepieces that have been carefully curated over the course of several decades. Luxury watches have come a long way from being mere timekeeping machines. They have evolved into symbols of artistry, social status, and incredible history. These killer accessories are not just about looking stylish; they represent a legacy of precision, innovation, and sheer elegance. In India, where culture is a vibrant fusion of all things amazing, luxury watches are wholeheartedly embraced as icons of style and heritage. Among the top watch brands in India, these timepieces epitomize elegance and sophistication. When you delve into the world of luxury watch brands in India, you'll discover a perfect blend of tradition and modernity that truly resonates with watch enthusiasts. The aim of this combination of system and user prompts is to enhance the assistant's ability to refine the text into a more natural, human-like version while remaining true to the original content's intent and factual accuracy. Top 10 Watch Brands in India Here are the 10 most-rated luxury watch brands in India: 1. Rolex : Top Watch Brands in India When it comes to luxury watch brands in India, there's no match for Rolex. It's the epitome of style, success, and timeless elegance. Rolex has gone beyond being just a timekeeper and has become a symbol of status and sophistication. The Rolex Oyster Perpetual and Datejust models are more than just watches; they're heritage pieces that tell stories of achievement and refinement. Known for their impeccable quality and enduring designs, Rolex watches are the definition of luxury that lasts for generations. Here are some key details about Rolex: Established Year: 1905 Founders: Hans Wilsdorf and Alfred Davis Headquarters: Geneva, Switzerland Products: They offer a range of luxury watches, including popular models like the Submariner, Daytona, and Explorer. Store Outlets in India: You can find authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: Rolex has been a pioneer in the industry, introducing the first waterproof wristwatch (Oyster), the first watch with an automatically changing date on the dial (Datejust), and the first wristwatch to show two time zones at once (GMT-Master). Awards and Recognition: Rolex is renowned for its precision, with many of their models certified as Superlative Chronometers. Each Rolex timepiece is crafted with utmost care, ensuring precision and durability. Whether you prefer the sporty Submariner or the elegant Day-Date, Rolex has a wide range of models to suit every taste. The brand's commitment to excellence is evident in their rigorous testing and use of top-notch materials. When you invest in a Rolex, you're not just getting a watch; you're acquiring a piece of history that will be cherished for years to come. 2. Franck Muller : Best Watch Brands in India When it comes to luxury watch brands in India, Franck Muller is a name that really stands out for aficionados of exquisite timepieces. They're known for their innovative designs and intricate complications, which have earned them a special place in the world of high-end watches. Here are some key details about Franck Muller: Established Year: 1991 Founder: Franck Muller and Vartan Sirmakes Headquarters: Genthod, Switzerland Products: They offer a range of top-tier luxury watches, including the iconic Crazy Hours, Vanguard, and Long Island collections. Store Outlets in India: You can find their watches at select luxury watch retailers in major cities like Mumbai, Delhi, and Bangalore. Innovations: Franck Muller is renowned for introducing unique complications like the Crazy Hours, which features a non-linear arrangement of the hour markers, and the Master Banker, designed specifically for international business travelers. Awards and Recognition: Their timepieces have gained widespread acclaim for their distinctive designs and mechanical sophistication. Franck Muller watches are more than just accessories; they're true masterpieces that seamlessly blend artistry with mechanical precision. The brand's unwavering commitment to excellence is evident in every meticulous detail and the use of only the finest materials. Not only are Franck Muller watches visually striking, but they also offer exceptional performance, making them the go-to choice for discerning watch enthusiasts in India. Whether you prefer the bold and striking Vanguard collection or the whimsical and unconventional Crazy Hours, Franck Muller watches are guaranteed to leave a lasting impression on both enthusiasts and collectors alike. 3. Omega Omega stands out in the world of luxury watches with its rich heritage and association with precision timekeeping. Known for its role in space exploration and sports timing, Omega watches are a blend of innovation and timeless elegance. Established Year: 1848 Founder: Louis Brandt Headquarters: Biel\/Bienne, Switzerland Products: Luxury watches, including the iconic Speedmaster, Seamaster, and Constellation collections Store Outlets in India: Multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: First watch worn on the moon (Speedmaster), co-axial escapement technology, and official timekeeper of the Olympic Games Awards and Recognition: Known for precision, many models are certified as Master Chronometers, meeting rigorous standards set by the Swiss Federal Institute of Metrology (METAS) Omega watches are celebrated for their robust performance and elegant designs. The Speedmaster, famously known as the \"Moonwatch,\" has been a part of all six lunar missions, while the Seamaster is renowned for its association with James Bond. Omega’s dedication to precision is evident in their stringent testing processes and use of innovative materials. For those seeking the top watch brands in India, Omega offers a perfect blend of history, technology, and style. Whether you're exploring the depths of the ocean with a Seamaster or timing a race with a Speedmaster, Omega watches are among the top 10 watch brands in India built to perform and impress. 4. Breguet Breguet is a distinguished name in the world of horology, known for its rich history and remarkable precision. As one of the oldest and most prestigious watchmakers, Breguet has been a symbol of innovation and excellence since its founding. Established Year: 1775 Founder: Abraham-Louis Breguet Headquarters: L'Abbaye, Switzerland Products: Luxury watches, including the Classique, Marine, Tradition, and Reine de Naples collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Inventor of the tourbillon, Breguet hands, and the first wristwatch Awards and Recognition: Known for its technical advancements and elegant designs Breguet watches are more than just timepieces; they are masterpieces that reflect over two centuries of expertise. Each watch is made with meticulous attention to detail, featuring detailed dials, fine engravings, and complex mechanisms that showcase the brand's dedication to quality. For those seeking the best watch brands in India, Breguet stands out with its blend of tradition and technology. Whether you prefer classic designs or contemporary innovations, Breguet offers a diverse range of models to suit various tastes. From the refined Classique collection to the maritime-inspired Marine series, Breguet's watches are a testament to the brand's enduring legacy. Among watch brands in India, Breguet holds a distinguished place, offering pieces that are both sophisticated and historically significant. 5. Tag Heuer TAG Heuer is a prominent name among the best watch brands in India, known for its sporty designs and precision engineering. Renowned for its association with motorsports and high-performance timekeeping, TAG Heuer has made a significant mark in the world of horology. When it comes to luxury watch brands in India, TAG Heuer stands out with its blend of innovation and style, making it a favorite among enthusiasts. Among the various watch brands in India, TAG Heuer offers a diverse range of models that cater to different tastes and preferences. Established Year: 1860 Founder: Edouard Heuer Headquarters: La Chaux-de-Fonds, Switzerland Products: Luxury watches, including the Carrera, Monaco, and Aquaracer collections Store Outlets in India: Available at multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Introduced the first oscillating pinion for chronographs, the Monaco, which was the first square water-resistant watch, and the Mikrograph, capable of measuring 1\/100th of a second Awards and Recognition: Celebrated for its contributions to sports timing and precision engineering TAG Heuer watches are known for their robust performance and contemporary designs. The Carrera collection, inspired by the world of racing, offers a blend of style and functionality, making it a favorite among enthusiasts. The Monaco, with its distinctive square case, has become an icon of modern watch design. The Aquaracer series is tailored for those who seek adventure, offering water resistance and durability. For those seeking the best watch brands in India, TAG Heuer provides a perfect blend of innovation and elegance. Each timepiece reflects the brand’s commitment to precision and quality. TAG Heuer's watches are not just accessories but reliable companions that enhance both style and performance. Among watch brands in India, TAG Heuer is a preferred choice for those who value heritage and cutting-edge technology. 6. Hublot : Best Watch Brands in India Hublot is definitely one of the coolest watch brands in India. They're known for their badass designs and innovative use of materials. As a top luxury watch brand in India, Hublot has built a reputation for fusing traditional Swiss watchmaking with a modern twist. When it comes to watch brands in India, Hublot offers a killer combo of craftsmanship and cutting-edge technology that really appeals to all the watch enthusiasts out there. Let's get down to the facts: Established Year: 1980 Founder: Carlo Crocco Headquarters: Nyon, Switzerland Products: They've got a whole range of luxury watches, including the iconic Big Bang, the classy Classic Fusion, and the bold Spirit of Big Bang collections. Where to Find Them: You can get your hands on Hublot watches at authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: These guys have pioneered the \"Art of Fusion\" concept, which means they mix materials like gold and rubber to create some seriously cool watches. They even came up with the first scratch-resistant 18K gold, known as Magic Gold! Awards and Recognition: Hublot has been praised for their innovative designs and their use of fancy materials. Now let's talk about the watches themselves. Hublot timepieces are all about style and cutting-edge technology. The Big Bang collection is a total showstopper, with its bold and dynamic design that really captures the brand's innovative spirit. On the other hand, the Classic Fusion line is all about understated elegance. They take traditional watchmaking techniques and give them a modern twist with some seriously cool materials. And let's not forget about the Spirit of Big Bang series, which stands out with its unique barrel-shaped case and intricate details. If you're on the hunt for the best watch brands in India, Hublot is definitely a name to remember. They bring together innovation, luxury, and style in the most perfect way. Each Hublot watch is a true testament to their commitment to quality and creativity. Whether you're into the bold and badass vibes of the Big Bang or the refined elegance of the Classic Fusion, Hublot watches are made to make a statement. When it comes to watch brands in India, Hublot is the top choice for those who appreciate a blend of heritage and contemporary flair. So go ahead, rock that wrist bling with confidence! 7. Breitling : Top Watch Brands in India Breitling is all about adventure and precision, which is why it's a favorite among aviators and explorers. As one of the top watch brands in India, Breitling is known for its tough and functional designs that cater to professionals and enthusiasts alike. When it comes to watch brands in India, Breitling really stands out because they're all about creating timepieces that are both stylish and super practical. Here are some key details about Breitling: Established Year: 1884 Founder: Léon Breitling Headquarters: Grenchen, Switzerland Products: They make luxury watches, including the awesome Navitimer, Chronomat, and Superocean collections Store Outlets in India: You can find them at lots of authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Breitling is the genius behind the first chronograph pushers, they even made a watch with a distress beacon, and they pioneered the slide rule bezel Awards and Recognition: People love Breitling for being super precise and durable, especially professionals in aviation and diving Let's talk about the Navitimer series for a sec. These watches are a nod to Breitling's aviation roots and have that cool slide rule bezel. They're not just watches, they're like precision instruments that can track time as accurately as an experienced pilot. It really shows how committed Breitling is to being excellent and reliable. The Chronomat series is a great mix of toughness and sophistication, while the Superocean line is perfect for deep-sea adventurers. So basically, no matter what you're into, Breitling has got you covered. If you're on the lookout for the best watch brands in India, you can't go wrong with Breitling. They've got innovation, durability, and style all rolled into one. Each Breitling watch is made to the highest quality standards, so you know it's gonna perform flawlessly in any situation. Whether you're a pilot, a diver, or just someone who appreciates a finely crafted timepiece, Breitling definitely stands out among watch brands in India as the top choice. They've got a rich heritage and their performance is second to none. 8. Chopard Chopard stands out not only for its exquisite watches but also for its commitment to ethical craftsmanship. As one of the best watch brands in India, Chopard is renowned for its luxurious designs and sustainable practices. Among watch brands in India, Chopard offers a unique blend of elegance and responsibility, making it a top choice for discerning buyers. Established Year: 1860 Founder: Louis-Ulysse Chopard Headquarters: Geneva, Switzerland Products: Luxury watches, including the L.U.C., Happy Diamonds, and Mille Miglia collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Use of fair-mined gold in the L.U.C. line, introduction of the Happy Diamonds collection with free-moving diamonds, and advanced in-house movements Awards and Recognition: Celebrated for its contributions to ethical luxury and its innovative designs The Chopard L.U.C. line, crafted from fair-mined gold, represents the brand’s dedication to sustainability without compromising on elegance. This collection embodies Chopard's commitment to responsible luxury, appealing to those who seek to balance sophistication with ethical values. The Happy Diamonds series is another iconic collection, featuring free-moving diamonds that create a playful and luxurious aesthetic. A Chopard watch is a statement of moral sophistication, appealing to those who seek to balance luxury with responsibility. For those looking for luxury watch brands in India, Chopard offers timepieces that are not only beautifully designed but also crafted with a conscience. Each watch reflects the brand's dedication to quality, innovation, and ethical practices. Among watch brands in India, Chopard stands out for its unique combination of style, history, and sustainability, making it a preferred choice for those who value both elegance and ethical production. 9. Longines With a heritage dating back to the 19th century, Longines continues to captivate watch enthusiasts with its timeless designs. From the athletic sophistication of the HydroConquest to the classic elegance of the Master Collection, Longines offers a range of styles to suit different preferences. A Longines watch is a graceful blend of tradition and modernity, making it a timeless accessory that transcends trends. 10. Bell & Ross Founded by a team of designers and aviation experts, Bell & Ross creates watches that are both functional instruments and works of art. The brand’s iconic square-cased models are inspired by aviation control panels, making them popular among those who appreciate precision and style. A Bell & Ross watch is for the adventurous and the discerning, embodying a dedication to accuracy and a flair for design. Ways to Choose Right Watch Brand? Choosing the right luxury watch brand in India involves considering various factors such as personal style, functionality, and the brand’s heritage. Here are some tips to help you make the right choice: Understand Your Style Luxury watches come in various styles, from classic and elegant to sporty and modern. Determine your personal style and choose a brand that complements it. For instance, if you prefer timeless elegance, brands like Rolex and Breguet might be ideal. If you lean towards a modern and bold aesthetic, Hublot and Bell & Ross could be more suitable. Consider the Functionality Different watch brands offer various functionalities tailored to specific needs. If you are an adventurer or sports enthusiast, brands like Tag Heuer and Breitling, known for their precision and durability, would be excellent choices. For those who prioritize ethical craftsmanship, Chopard offers luxurious timepieces with a commitment to sustainability. Brand Heritage and Reputation A watch is not just a timekeeping device; it is a statement of identity and prestige. Consider the heritage and reputation of the brand. Rolex, for instance, is renowned for its legacy of excellence and is often associated with success and sophistication. Omega’s association with space exploration adds a layer of historical significance to its timepieces. Budget Considerations Luxury watches come with varying price tags. Establish your budget and explore brands that offer the best value within your range. While some brands like Rolex and Omega are known for their high-end luxury, others like Longines provide a balance of elegance and affordability. Visit Authorized Retailers To ensure the authenticity and quality of your purchase, always buy from authorized retailers. Visiting a showroom allows you to experience the watch firsthand, understand its features, and make an informed decision. In Mumbai, Time Avenue is a premier destination for luxury watches, offering an extensive collection of top-tier brands like Rolex, Omega, and Hublot. Longevity Properly cared for, a luxury watch will last for several decades (or longer). Check out any of the major watch auctions (Phillips, Christie’s, etc.) and you will find ready evidence of this. Worn regularly over years or decades, a watch becomes intimately associated with its owner. A luxury watch’s ability to stand the test of time means it can be passed down to future generations. It can serve as a meaningful heirloom, rite of passage or long-lasting memento. FAQ’s on Luxury Watch Brands in India What are the best luxury watch brands available in India? Many luxury watch brands are available in India, including Rolex, Omega, TAG Heuer, Patek Philippe, Audemars Piguet, and more. The choice often depends on personal taste, budget, and desired features. Where can I buy authentic luxury watches in India? Authorized dealers and boutiques of luxury watch brands are the best places to buy authentic watches. Some well-known retailers in India include Ethos Watches, Kapoor Watch Co., and The Prime - Luxury Watch Boutique. What is the price range for luxury watches in India? Luxury watches in India can range widely in price depending on the brand, model, and materials used. Entry-level luxury watches might start around Rs 1 lakh, while high-end models can go up to several crore. Do luxury watches come with international warranties in India? Yes, most luxury watch brands provide international warranties that are valid in India. It's essential to purchase from authorized dealers to ensure your warranty is honoured. Are luxury watches a good investment in India? Luxury watches can be a good investment as they often retain or appreciate in value over time, particularly limited-edition models or those from prestigious brands. However, it's essential to research and buy wisely to ensure a return on investment. Conclusion Best watch brands in India are more than just timepieces; they are symbols of craftsmanship, heritage, and personal style. The market offers a diverse range of brands and models to suit different tastes and budgets, from classic designs to avant-garde complications. Purchasing a luxury watch is not just a transaction but an investment in a piece of artistry and history. It's a decision that reflects an appreciation for quality and an understanding of the value of time. As the luxury watch market in India continues to evolve, consumers can expect to see more innovation, exclusivity, and personalized service from brands and retailers. Whether as a personal indulgence or an investment opportunity, luxury watches remain a timeless choice for discerning individuals in India who appreciate the finer things in life.","filter_flag":1}
{"title":"IVECO and Plus begin public road testing of autonomous trucks in Germany - ETAuto","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2NvbW1lcmNpYWwtdmVoaWNsZS9pdmVjby1hbmQtcGx1cy1iZWdpbi1wdWJsaWMtcm9hZC10ZXN0aW5nLW9mLWF1dG9ub21vdXMtdHJ1Y2tzLWluLWdlcm1hbnkvOTc1NzQ0OTbSAZcBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvY29tbWVyY2lhbC12ZWhpY2xlL2l2ZWNvLWFuZC1wbHVzLWJlZ2luLXB1YmxpYy1yb2FkLXRlc3Rpbmctb2YtYXV0b25vbW91cy10cnVja3MtaW4tZ2VybWFueS85NzU3NDQ5Ng?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2NvbW1lcmNpYWwtdmVoaWNsZS9pdmVjby1hbmQtcGx1cy1iZWdpbi1wdWJsaWMtcm9hZC10ZXN0aW5nLW9mLWF1dG9ub21vdXMtdHJ1Y2tzLWluLWdlcm1hbnkvOTc1NzQ0OTbSAZcBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvY29tbWVyY2lhbC12ZWhpY2xlL2l2ZWNvLWFuZC1wbHVzLWJlZ2luLXB1YmxpYy1yb2FkLXRlc3Rpbmctb2YtYXV0b25vbW91cy10cnVja3MtaW4tZ2VybWFueS85NzU3NDQ5Ng?oc=5","id":"CBMikwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2NvbW1lcmNpYWwtdmVoaWNsZS9pdmVjby1hbmQtcGx1cy1iZWdpbi1wdWJsaWMtcm9hZC10ZXN0aW5nLW9mLWF1dG9ub21vdXMtdHJ1Y2tzLWluLWdlcm1hbnkvOTc1NzQ0OTbSAZcBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvY29tbWVyY2lhbC12ZWhpY2xlL2l2ZWNvLWFuZC1wbHVzLWJlZ2luLXB1YmxpYy1yb2FkLXRlc3Rpbmctb2YtYXV0b25vbW91cy10cnVja3MtaW4tZ2VybWFueS85NzU3NDQ5Ng","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2NvbW1lcmNpYWwtdmVoaWNsZS9pdmVjby1hbmQtcGx1cy1iZWdpbi1wdWJsaWMtcm9hZC10ZXN0aW5nLW9mLWF1dG9ub21vdXMtdHJ1Y2tzLWluLWdlcm1hbnkvOTc1NzQ0OTbSAZcBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvY29tbWVyY2lhbC12ZWhpY2xlL2l2ZWNvLWFuZC1wbHVzLWJlZ2luLXB1YmxpYy1yb2FkLXRlc3Rpbmctb2YtYXV0b25vbW91cy10cnVja3MtaW4tZ2VybWFueS85NzU3NDQ5Ng?oc=5\" target=\"_blank\">IVECO and Plus begin public road testing of autonomous trucks in Germany<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IVECO and Plus begin public road testing of autonomous trucks in Germany - ETAuto","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2NvbW1lcmNpYWwtdmVoaWNsZS9pdmVjby1hbmQtcGx1cy1iZWdpbi1wdWJsaWMtcm9hZC10ZXN0aW5nLW9mLWF1dG9ub21vdXMtdHJ1Y2tzLWluLWdlcm1hbnkvOTc1NzQ0OTbSAZcBaHR0cHM6Ly9hdXRvLmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vYW1wL25ld3MvY29tbWVyY2lhbC12ZWhpY2xlL2l2ZWNvLWFuZC1wbHVzLWJlZ2luLXB1YmxpYy1yb2FkLXRlc3Rpbmctb2YtYXV0b25vbW91cy10cnVja3MtaW4tZ2VybWFueS85NzU3NDQ5Ng?oc=5\" target=\"_blank\">IVECO and Plus begin public road testing of autonomous trucks in Germany<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","source.href":"https:\/\/auto.economictimes.indiatimes.com","source.title":"ETAuto","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Advt Ashok Leyland to focus capex on alternative fuel products Dheeraj Hinduja, executive chairman, Ashok Leyland, said, “We are looking at the development of new products with alternative fuels and most of the future capex will go towards that but diesel isn’t going away anytime soon and we will be ready with our range of products and do efficient resource allocation.” See More Details Join the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETAuto App Get Realtime updates Save your favourite articles Scan to download App Italian multinational transport vehicle manufacturing company, IVECO , and American autonomous trucking technology company , Plus are beginning public-road testing of their jointly developed next-generation automated trucks in Germany.In order to confirm the operations of their autonomous truck and begin creating the possible factory production model, the companies will gather road data as part of the testing process. The IVECO S-WAY truck with PlusDrive is intended to enhance driver enjoyment, safety, and efficiency while giving fleets a more environmentally friendly alternative.In the next months, the public road testing will begin in Germany and then spread to Austria, Italy, and Switzerland. The truck will be exposed to a wide variety of terrains, road slopes, weather conditions, and driving situations due to the various roads and driving circumstances found in each nation, which will assist to continually develop the features and capabilities of Plus's autonomous driving technology.“Real-world experience is an invaluable part of the testing and validation of our technology as we prepare our autonomous driving product for commercial deployment ,” Shawn Kerrigan, COO and co-founder of Plus, said. “Given that Germany alone faces a shortage of 60,000 truck drivers, [PlusDrive] will help improve road safety, sustainability, and driver recruitment and retention issues confronting fleets in the region,” he added.","filter_flag":1}
{"title":"Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5\" target=\"_blank\">Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5\" target=\"_blank\">Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Year Ender: How India is embracing New-Age Beauty and Personal Care Brands With the eventful year of 2022 coming to an end, every Indian can be seen to rejoice and prep for the new year as the same is happening after a pandemic-struck hiatus of 2 long years. With festivities around the corner, there has been a significant surge in demand in the markets which are flooded with consumers. Every industry is witnessing the surge, and Beauty and Personal Care is not behind. However, the stiff competition for customers between online and offline brands has become more prominent than ever. To understand the commotion among the brands this season, these brands give us an insight into their 2022 journey and their 2023 growth plans. SUGAR Cosmetics This year SUGAR Cosmetics touched larger milestones, becoming one of the select few brands that have launched 120+ of their own stores in retail, reaching a total of 45000+ retail touchpoints across 550+ cities. SUGAR’s IG page garnered 2.4M+ followers, becoming the largest consumer brand in India on the platform, along with our experiment into gamified AR filters that hit virality on platforms like Instagram and Moj. The brand’s #ShukarHaiSUGARHai Campaign with campaign ambassadors Ranveer Singh and Tamannaah Bhatia was also a huge viral success allowing the brand to receive support from impactful investors namely LCatterton and Ranveer Singh. “At SUGAR in 2022, we managed to almost double our sales over the previous year, achieved the target of being one of the Top 3 brands in color cosmetics in India, and are looking at another year of massive growth,” said Vineeta Singh, Co-founder, and CEO, SUGAR Cosmetics. She further added, “Our plans for 2023 include targeting and achieving a 100 percent Y-O-Y revenue growth over last year, expansion to more than 60,000 retail outlets, making our D2C platform base stronger and larger, and growing our team size to 3,000 employees.” Keeping its audience in mind, SUGAR is looking forward to tapping into different categories of the beauty industry. The brand will also focus on creating solid content to keep educating and engaging its community across all platforms–digital and others. The Body Shop \"We at The Body Shop are embarking upon a new strategy of ‘Change Making Beauty’, which means that we aim to empower customers, employees, and partners to drive positive change for the world through our channels, our products, and our activism,\" stated Vishal Chaturvedi, Vice President, The Body Shop, South Asia. With this vision, the brand is aligned to reach its goal of 25 new stores in 2022 at various locations. Currently, having 200 highly visible and accessible stores all over India, including Tier I and II cities, with the latest additions in Itanagar, Surat, and Indore. The brand's current product portfolio is already over 60 percent Vegan, aiming to become 100 percent Vegan by 2023. This aim is the natural next step forward for the brand's Cruelty-Free commitment, including reformulating all our core products from 100 percent Vegetarian to 100 percent Vegan, while focusing on making its product packaging 100 percent recyclable thus reducing its environmental impact. \"We are strengthening our retail and e-commerce channels by opening more workshop stores and launching new digital experiences. We are expanding our retail footprint with a clear focus on smaller cities and towns. Rolling out the new Workshop store format in as many stores as possible: 30+ new ACTIVIST Workshop stores per year, every year till 2025 bringing the brand to people where they love to shop,\" added Chaturvedi. Plum Plum would be closing the financial year at over 2x the revenue of the previous FY, complemented by the 44 percent growth seen in its overall customer base with a 96.54 percent increase in repeat buyers which is a great win in the D2C space. “We raised $35 million (Rs 270 crore) in a Series C round in March 2022 totaling our funding to over $50 million. With this, our efforts have been towards bringing in more salient brand communication, growing our omnichannel presence and onboarding high-quality talent with a focus on investments in marketing and technology,” said Shankar Prasad, Founder & CEO, Plum Having launched over 8 exclusive brand outlets in the last year across cities, the brand plans to scale this up to 50 in the coming year. Furthermore, Plum onboarded Rashmika Mandanna and Mithila Palkar as its brand ambassadors for the Plum skincare range and Ananya Panday for the Plum Body Lovin’ fragrance range. “We would be expanding our makeup range aggressively with a host of innovative product formats in the coming year. We would also be launching a line of products in the essentials and advanced ranges under both skincare and haircare categories,” added Prasad. Colorbar The post-pandemic period has witnessed a radical shift in consumer behavior and expectations. As per research, the total retail sale is expected to reach $5.5 trillion by 2027 with online sales making up 30 percent of the market. The retail industry has been largely shadowed by challenges across the supply chain, economic uncertainty, and geo-political factors. I feel that going forward, the only way for retailers to sail through is by exhibiting strong levels of adaptability, agility, and flexibility. \"As we graduate into the next year, we can expect a renewed focus on enhancing the customer shopping journey by providing a seamless experience for hybrid shopping. Re-invention of physical store designs along with a robust omnichannel strategy would, however, emerge as a top priority. Many companies will be seen adding features to support new shopping initiatives while integrating technologies supporting AR\/VR advancements. We are aligned to lead the change and have a strong conviction that our strategy would create benchmarks of excellence in 2023,” stated Samir Kumaar Modi, Founder, and Managing Director, Colorbar Cosmetics. Kapiva “We have been relentlessly working towards improving the health and wellness quotient of Indians with Ayurveda. Recently, we expanded in the US and UAE to enable this for the global audience as well. Our focus this year was on increasing the effectiveness of our products. We’ve moved the needle on that front by successfully conducting a clinical trial for our Dia Free Juice. It has also proven to be effective in decreasing HbA1c to an extent of 11 percent and increasing insulin production in the body by up to 25-30 percent. However, the highlight of the year was definitely the recognition by Honorable PM Modi,” said Ameve Sharma, Founder, Kapiva. In the upcoming year, Kapiva aims to double down, concurrently increasing brand awareness and recall to become a household name. Modern consumers are less concerned with outward appearance than they once were, and are more concerned with their complete well-being, which encompasses physical, mental, and emotional health. In order to capitalize on this trend, Kapiva is constantly creating consumer awareness by keeping the emphasis on the paramount importance of Ayurveda and how it can enable people to live a holistic lifestyle. Earth Rhythm 2022 was a favorable year for Earth Rhythm, as it brought in a lot of positive changes in terms of organization, growth, and product. At an organizational level, the brand was able to double the size of the team with its customer base growing 4x times compared to the previous financial year. The brand also went offline with the launch of its exclusive kiosks at 12 different locations across India. “We are expanding our makeup category which will go on to strengthen Earth Rhythm’s wide-ranging portfolio, we have also been intensifying the existing categories. True to our digital-first identity, it was also a natural step for us to continue investing in technology in a bid to further streamline operations and give our customers every convenience they desire. We successfully launched our very own mobile App for both Android and iOS platforms this year and have been gaining steady traction on it. Next year, we plan to further build our portfolio by deepening the makeup category launched in 2022. We reckon 2x growth over FY 2021-22,” said Harini Sivakumar, Founder, and CEO, Earth Rhythm. In keeping with this shift in the consumer’s preference, the brand aims to reinforce its multifunctional product range in both makeup and personal care (face, body, hair), aimed at eliminating the need for and use of multiple products in everyday makeup and skincare routines. ARATA This year at Arata launched over 20 products and 30 offline stores across India, steadily growing 10 percent month on month with respect to GMV. “In the upcoming year, we will go full throttle to bridge the gaps in our product line and be a one-stop shop for all hair care needs. We have already begun our groundwork and have set processes to create formulas in the anti-hair fall, hair colorants, and hair styling segments,” said Dhruv Madhok, Co-Founder, ARATA. BlushBee 2022 has been the year of the first full-fledged operations for Blushbee. Beginning with just three products and later expanding to 10 categories with 64 unique SKUs, the brand has witnessed massive organic growth in its customer base. BlushBee as a cosmetics line is a product of careful decisions in choosing what it wants, the other advantage is that being a clean and green beauty brand which is an important factor in the value proposition. “We hope to grow into a one-stop shop for all things related to color cosmetics, so we are actively looking into introducing new products like foundations, gloss, and so on. We have also discussed extending our horizons beyond just the realm of color cosmetics very soon,” stated Shobana and Navneethan, Founders, BlushBee Organic Beauty Brand. Crazy Owl - Your Skin Co The brand was launched in 2022 with the mindset of embracing the true self and exploring the crazy side. The brand is PETA and IFRA certified, FDA approved, and currently provides the best possible sensorial experience in Hair Care with India's First Date Seed Oil Shampoo, Conditioner, and Hair Oil. “In the short term, we are working towards expanding on two fronts- launching more affordable luxury products across categories in which we operate. With the right set of team, products, and marketing strategy we were able to launch our brand, and today, 6 months post the launch we are happy to serve more than 2000+ households,” commented Damanjit Kohli and Karishma Sahni, Founders, Crazy Owl - Your Skin Co. Increasing its touchpoint and interaction with the product, currently, Crazy Owl has signed up on all major marketplace platforms – Amazon Launchpad, Flipkart Propel Program, Purple, Snapdeal, Tata 1 mg, First cry, Myntra, Nykaa, Bigbasket and will be launching itself on Blink it, Paytm, Pharmeasy and Shopperstop planning to grow its channel every month. Pilgrim “As one of the fastest growing personal care brands in India, we have seen significant growth in the last 12 months and clocked a sale of Rs 10 crore per month along with a growth of 6X. With the trust that the brand has built throughout, we have had some great partnerships this year for our campaigns. Celebrity shout-outs from personalities like Soha Ali Khan, and Vidya Balan, and association with Kalki Koechlin in our most recent commercial have been one of the key highlights,” said Anurag, Co-Founder and CEO, Pilgrim. With a strong consumer base of 1 million, the brand aims to improve its interaction and thus upgraded its technology. Along with updating its technology, the brand is also using innovative ways to reach its target audience. Pilgrim aims to be a Rs 1,000 crore brand in the next 3-4 years by facilitating new product and category launches and exploring newer international markets like the Middle East. Moreover, planning to double down on its R&D capabilities and increase brand investments by bringing in global experiences for its customers, both online and offline. Along with establishing its presence internationally, Pilgrim aims to achieve an annualized run rate of Rs 500 crore by December 2023. iluvia Professional As a new-age, self-care brand pioneering product-driven innovation and technology, during the course of the year iluvia witnessed growth across different channels, and new launches, and hit several milestones. The organization has grown 25x in revenue between October 2021 and 2022 along with a 20x growth in its online consumer base, currently present across key marketplaces and in over 1800 salons in India across 70+ cities. “It is a very exciting time for us as we are working on introducing new patented treatment technologies and new launches in the haircare category. We also expect a positive growth trajectory of 6x to 7x in the coming year,” stated Nishant Gupta and Palash Pandey, Directors, Renaura Wellness Pvt. Ltd. Beauty and Skincare, as a category, has burst forth since the onset of the pandemic in late 2019. The D2C space, especially, has seen remarkable growth which we expect will continue in 2023 and beyond. Moreover, The Indian beauty and personal care segment, which stood above Rs 54,500 crore only two years ago, is expected to grow at a CAGR of 11 percent over the next five years.","filter_flag":1}
{"title":"Motherson to acquire SAS Autosystemtechnik from Faurecia - ETAuto","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG8tY29tcG9uZW50cy9tb3RoZXJzb24tdG8tYWNxdWlyZS1zYXMtYXV0b3N5c3RlbXRlY2huaWstZnJvbS1mYXVyZWNpYS85ODA3NjQxN9IBhAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy9hdXRvLWNvbXBvbmVudHMvbW90aGVyc29uLXRvLWFjcXVpcmUtc2FzLWF1dG9zeXN0ZW10ZWNobmlrLWZyb20tZmF1cmVjaWEvOTgwNzY0MTc?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG8tY29tcG9uZW50cy9tb3RoZXJzb24tdG8tYWNxdWlyZS1zYXMtYXV0b3N5c3RlbXRlY2huaWstZnJvbS1mYXVyZWNpYS85ODA3NjQxN9IBhAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy9hdXRvLWNvbXBvbmVudHMvbW90aGVyc29uLXRvLWFjcXVpcmUtc2FzLWF1dG9zeXN0ZW10ZWNobmlrLWZyb20tZmF1cmVjaWEvOTgwNzY0MTc?oc=5","id":"CBMigAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG8tY29tcG9uZW50cy9tb3RoZXJzb24tdG8tYWNxdWlyZS1zYXMtYXV0b3N5c3RlbXRlY2huaWstZnJvbS1mYXVyZWNpYS85ODA3NjQxN9IBhAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy9hdXRvLWNvbXBvbmVudHMvbW90aGVyc29uLXRvLWFjcXVpcmUtc2FzLWF1dG9zeXN0ZW10ZWNobmlrLWZyb20tZmF1cmVjaWEvOTgwNzY0MTc","guidislink":false,"published":"Mon, 20 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=51, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG8tY29tcG9uZW50cy9tb3RoZXJzb24tdG8tYWNxdWlyZS1zYXMtYXV0b3N5c3RlbXRlY2huaWstZnJvbS1mYXVyZWNpYS85ODA3NjQxN9IBhAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy9hdXRvLWNvbXBvbmVudHMvbW90aGVyc29uLXRvLWFjcXVpcmUtc2FzLWF1dG9zeXN0ZW10ZWNobmlrLWZyb20tZmF1cmVjaWEvOTgwNzY0MTc?oc=5\" target=\"_blank\">Motherson to acquire SAS Autosystemtechnik from Faurecia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Motherson to acquire SAS Autosystemtechnik from Faurecia - ETAuto","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL2F1dG8tY29tcG9uZW50cy9tb3RoZXJzb24tdG8tYWNxdWlyZS1zYXMtYXV0b3N5c3RlbXRlY2huaWstZnJvbS1mYXVyZWNpYS85ODA3NjQxN9IBhAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy9hdXRvLWNvbXBvbmVudHMvbW90aGVyc29uLXRvLWFjcXVpcmUtc2FzLWF1dG9zeXN0ZW10ZWNobmlrLWZyb20tZmF1cmVjaWEvOTgwNzY0MTc?oc=5\" target=\"_blank\">Motherson to acquire SAS Autosystemtechnik from Faurecia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","source.href":"https:\/\/auto.economictimes.indiatimes.com","source.title":"ETAuto","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Advt Advt Join the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETAuto App Get Realtime updates Save your favourite articles Scan to download App New Delhi: Automotive supplier Motherson Group on Sunday said it has entered into an agreement to acquire 100% of the stake in SAS Autosystemtechnik (Germany) from Faurecia, a company of the Forvia Group.The enterprise value of the business is Euro 540 million, and the transaction will be funded by a mix of debt and internal accruals.The transaction remains subject to information from or consultation with employee representatives. The proposed transaction is expected to close in Q2 FY24 (July-September 23), subject to customary regulatory approvals. Vivek Chaand Sehgal , Chairman, Motherson, said, \"We have always added new products and technologies to closely serve our customers in a more cohesive way. The acquisition of SAS is an important step in this direction. By adding complementing capabilities which SAS brings, we will be able to further enhance our Tier 0.5 position with our customers.\"\"With this acquisition, we will be even more diversified in our customer base and products. This acquisition will transform Motherson Group to be a leading assembler of cockpit modules globally, with a special focus on EV models . We look forward to welcoming over 5,000 new members into the Motherson Family,\" he said.SAS was established in 1996 and, in 2020, was acquired by Faurecia, a company of the Forvia Group. The company has 24 facilities across 12 countries (Argentina, Brazil, China, the Czech Republic, France, Germany, Mexico, Portugal, Slovakia, Spain, Turkey, and the USA).The company is a global provider of assembly and logistics services for the automotive industry. It has customer relationships with European and American OEMs , some of which span almost three decades. The company’s gross revenues were about EUR 4.4 billion on a principal basis, with net revenues (IFRS) of EUR 896 million for the year ended December 31, 2022, with almost half of it contributed by EV programs.","filter_flag":1}
{"title":"Yulu, Bajaj Auto launch new 2Ws Miracle GR, DeX GR to suit Indian and global urban mobility needs - ETAuto","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL3R3by13aGVlbGVycy95dWx1LWJhamFqLWF1dG8tbGF1bmNoLW5ldy0yd3MtbWlyYWNsZS1nci1kZXgtZ3ItdG8tc3VpdC1pbmRpYW4tYW5kLWdsb2JhbC11cmJhbi1tb2JpbGl0eS1uZWVkcy85ODI3MDU1NtIBqAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy90d28td2hlZWxlcnMveXVsdS1iYWphai1hdXRvLWxhdW5jaC1uZXctMndzLW1pcmFjbGUtZ3ItZGV4LWdyLXRvLXN1aXQtaW5kaWFuLWFuZC1nbG9iYWwtdXJiYW4tbW9iaWxpdHktbmVlZHMvOTgyNzA1NTY?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL3R3by13aGVlbGVycy95dWx1LWJhamFqLWF1dG8tbGF1bmNoLW5ldy0yd3MtbWlyYWNsZS1nci1kZXgtZ3ItdG8tc3VpdC1pbmRpYW4tYW5kLWdsb2JhbC11cmJhbi1tb2JpbGl0eS1uZWVkcy85ODI3MDU1NtIBqAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy90d28td2hlZWxlcnMveXVsdS1iYWphai1hdXRvLWxhdW5jaC1uZXctMndzLW1pcmFjbGUtZ3ItZGV4LWdyLXRvLXN1aXQtaW5kaWFuLWFuZC1nbG9iYWwtdXJiYW4tbW9iaWxpdHktbmVlZHMvOTgyNzA1NTY?oc=5","id":"CBMipAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL3R3by13aGVlbGVycy95dWx1LWJhamFqLWF1dG8tbGF1bmNoLW5ldy0yd3MtbWlyYWNsZS1nci1kZXgtZ3ItdG8tc3VpdC1pbmRpYW4tYW5kLWdsb2JhbC11cmJhbi1tb2JpbGl0eS1uZWVkcy85ODI3MDU1NtIBqAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy90d28td2hlZWxlcnMveXVsdS1iYWphai1hdXRvLWxhdW5jaC1uZXctMndzLW1pcmFjbGUtZ3ItZGV4LWdyLXRvLXN1aXQtaW5kaWFuLWFuZC1nbG9iYWwtdXJiYW4tbW9iaWxpdHktbmVlZHMvOTgyNzA1NTY","guidislink":false,"published":"Mon, 27 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=58, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL3R3by13aGVlbGVycy95dWx1LWJhamFqLWF1dG8tbGF1bmNoLW5ldy0yd3MtbWlyYWNsZS1nci1kZXgtZ3ItdG8tc3VpdC1pbmRpYW4tYW5kLWdsb2JhbC11cmJhbi1tb2JpbGl0eS1uZWVkcy85ODI3MDU1NtIBqAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy90d28td2hlZWxlcnMveXVsdS1iYWphai1hdXRvLWxhdW5jaC1uZXctMndzLW1pcmFjbGUtZ3ItZGV4LWdyLXRvLXN1aXQtaW5kaWFuLWFuZC1nbG9iYWwtdXJiYW4tbW9iaWxpdHktbmVlZHMvOTgyNzA1NTY?oc=5\" target=\"_blank\">Yulu, Bajaj Auto launch new 2Ws Miracle GR, DeX GR to suit Indian and global urban mobility needs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Yulu, Bajaj Auto launch new 2Ws Miracle GR, DeX GR to suit Indian and global urban mobility needs - ETAuto","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9uZXdzL3R3by13aGVlbGVycy95dWx1LWJhamFqLWF1dG8tbGF1bmNoLW5ldy0yd3MtbWlyYWNsZS1nci1kZXgtZ3ItdG8tc3VpdC1pbmRpYW4tYW5kLWdsb2JhbC11cmJhbi1tb2JpbGl0eS1uZWVkcy85ODI3MDU1NtIBqAFodHRwczovL2F1dG8uZWNvbm9taWN0aW1lcy5pbmRpYXRpbWVzLmNvbS9hbXAvbmV3cy90d28td2hlZWxlcnMveXVsdS1iYWphai1hdXRvLWxhdW5jaC1uZXctMndzLW1pcmFjbGUtZ3ItZGV4LWdyLXRvLXN1aXQtaW5kaWFuLWFuZC1nbG9iYWwtdXJiYW4tbW9iaWxpdHktbmVlZHMvOTgyNzA1NTY?oc=5\" target=\"_blank\">Yulu, Bajaj Auto launch new 2Ws Miracle GR, DeX GR to suit Indian and global urban mobility needs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","source.href":"https:\/\/auto.economictimes.indiatimes.com","source.title":"ETAuto","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Practices\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Advt Advt Join the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETAuto App Get Realtime updates Save your favourite articles Scan to download App Mumbai: Yulu, a leading shared and micro electric mobility player , and Bajaj Auto, launched on Monday new generation two-wheelers Miracle GR , and DeX GR. They are developed on a purpose-built platform for electric 2-wheelers for the Indian consumers, climate and road conditions. Yulu and Bajaj have plans to take their mobility service to the international markets with the new products by tapping Bajaj Auto's overseas markets, the companies said.According to S Ravikumar, President -- Business Development, Bajaj Auto, “The new products are the first ones among the many to come.\"With their unique form-factor, ergonomic design and tech-powered utility, Miracle GR and DeX GR are set to offer a superlative experience to customers along with higher operational efficiency, improving Yulu’s overall financial metrics, the company said in a media release.Globally a first-of-its-kind, this partnership between a mobility tech company and a leading 2-wheeler OEM is built on the common vision to transform mobility through smart, shared, sustainable, and safe electric vehicles, the release said.Powered by Yulu's AI-led technology stack, and exclusively manufactured by Bajaj Auto, Miracle GR, and DeX GR are made in India, for the world. They are being rolled out by Chetak Technology Ltd (a fully-owned subsidiary of Bajaj Auto).“Together with Bajaj Auto, we are setting a new benchmark in urban mobility by ensuring affordable access to the best-in-class ride, while taking pioneering steps towards green commuting”, Amit Gupta - Co-founder & CEO, Yulu, said.Having doubled its fleet in the past 3 months, Yulu is poised to put 100K vehicles on the road across major cities in India and is targeting more than 10x growth in revenues by the end of the year. Now 15,000 Yulu bikes are on the road. About 65% of the trips in India are less than 5km. Yulu plans to add 7,000 to 8,000 two-wheelers every month, he added.“Mobility needs and customer expectations are rapidly changing and traditional ownership models are being disrupted. As a leader in shared mobility, we understand the criticality of curating purpose-built vehicles and robust energy infrastructure to create long-term value. Our partnership with Bajaj Auto was born out of this common vision and this launch will further solidify our position as a market leader in the shared mobility space, while reinforcing our commitment to sustainably solve the problems of traffic congestion and air pollution for daily commute and last-mile deliveries,” he added.“Going electric is a key strategic priority at Bajaj, and Yulu is an integral part of this strategy. Yulu’s deep expertise in EV technology and market knowledge coupled with Bajaj Auto’s strong, world-class R&D and manufacturing capabilities, make a powerful force that is shaping India’s future of mobility. These next-generation made-for-India vehicles with their intelligence, strong engineering underpinnings and sophisticated design aesthetics are a milestone not just for us, but for the entire electric mobility category,” Ravikumar said.Being manufactured by Bajaj, Yulu expects significant cost reductions and meaningful improvements in operating metrics and overall financials, owing to locally sourced parts and assembly, superior production quality and optimized economies of scale, the release said.","filter_flag":1}
