{"title":"5 Ways Tech Companies Can Improve Their Sustainability - Entrepreneur","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA","guidislink":false,"published":"Mon, 12 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=163, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5\" target=\"_blank\">5 Ways Tech Companies Can Improve Their Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrepreneur<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 Ways Tech Companies Can Improve Their Sustainability - Entrepreneur","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5\" target=\"_blank\">5 Ways Tech Companies Can Improve Their Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrepreneur<\/font>","source.href":"https:\/\/www.entrepreneur.com","source.title":"Entrepreneur","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Initiatives\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Opinions expressed by Entrepreneur contributors are their own. In an era where environmental concerns have reached unprecedented levels, businesses across all industries face the imperative of adopting sustainable practices. Among the various industries around the globe, the technology sector has emerged as a prominent player, recognizing the pressing need to prioritize green initiatives. With growing consumer awareness and demand for eco-friendly solutions, tech companies have realized that sustainability is no longer a mere trend but a critical driver of success that has a significant impact on their bottom line. According to research conducted by Deutsche Bank, companies with high ratings for environmental, social, and governance (ESG) have a lower cost of debt and equity. These findings were corroborated by MSCI in 2020. Additionally, the findings show that companies with high ESG ratings outperform the market in the medium and long term. Further, by implementing stewardship-focused programs, companies have not only seen growth in their financials but also in brand awareness. By adopting circular economic models, implementing waste reduction programs, and increasing their focus on extended life cycles of their assets, companies are creating a shift toward doing business from an eco-friendly perspective. This shift has created the need for companies that specialize in helping large organizations develop sustainability plans, operate with a focus on being eco-friendly, reduce waste, and implement strong stewardship practices. Here are five strategies that tech companies around the globe are using to level up their green credentials while decreasing their negative impact. Related: This Is Why Your Business Should Prioritize Environmental Efforts 1. Embrace the circular economy The circular economy model is an economic framework that aims to minimize waste and maximize the efficient use of resources. In contrast to the conventional linear economy, circular economy promotes a closed-loop system where materials and products are continuously reused, repaired, remanufactured, or recycled to create new value. According to McKinsey, the European circular economy market size for electronics is expected to grow from €60 to €95 billion by 2030. Additionally, resource productivity is estimated to grow by 3 percent, which will generate cost savings of around €600 billion as well as €1.8 trillion in other economic benefits annually. For businesses, one of the most important resources they have at their hands is technology, be it software or hardware. Often, the largest and most impactful investments an organization makes are technology-related. With computer hardware accounting for around 30% of overall IT budgets, hardware spending is the largest portion of overall tech spending. Consequently, hardware products, such as laptops, tablets, and smartphones, are often at the top of the list in both cost and volume. The circular economy is based on the principles of designing for longevity and efficiency while minimizing waste and pollution. This is achieved by keeping assets and materials, such as smartphones or laptops, in use for as long as possible. Additionally, efforts are made to regenerate natural systems. In 2021, ATRenew reduced emissions by a total of 464,000 metric tons through re-commercializing pre-owned phones. This is equivalent to the carbon sink of about 1,533 square kilometers of urban forests in one year. 2. Invest in eco-friendly products and manufacturing One of the key benefits of the implementation of a circular economy model is the reduction in waste. By prioritizing the reusing, repairing, and recycling of resources, the circular economy model minimizes the amount of waste that ends up in landfills or incinerators. According to the European Environment Agency, waste management, industrial processes, and product use account for over 12% of greenhouse gas emissions in the EU. Consequently, a circular economy model reduces the environmental impacts associated with waste disposal and mitigates pollution and greenhouse gas emissions during manufacturing. Investing in eco-friendly manufacturing processes and products is crucial for minimizing environmental impact. According to the Ellen MacArthur Foundation, 80% of a product's environmental impact is decided in the initial design stages. Companies can increase their green credentials by using sustainable materials, reducing energy consumption, and minimizing waste. Further, sustainable practices attract environmentally conscious customers, positioning sustainable businesses as leaders in a competitive marketplace. In other words, embracing sustainability is both a moral and strategic imperative for the long-term success of any business. Related: How to Overcome the Shortage of Tech Talent in the US 3. Encourage and facilitate recycling Recycling plays a crucial role in reducing electronic waste (e-waste), so encouraging it is important in promoting and advancing a sustainable approach to technology. With technological advancements continuing to happen at an astonishing rate, it is becoming increasingly important for tech companies to take responsibility for the lifecycle of their products. Companies can help reduce e-waste and minimize their environmental impact by implementing effective strategies, such as trade-in programs or recycling events that incentivize consumers to recycle their old devices. For example, tech companies can establish partnerships or in-house programs that allow consumers to trade in their used devices in exchange for credit toward a new purchase. Not only does this encourage the recycling of devices, but it also promotes brand loyalty and customer satisfaction. Education and awareness campaigns can also be powerful tools, especially considering that many electronic devices contain valuable and limited resources. Materials like lead, silver, copper and gold are essential for manufacturing new technology, making recycling even more attractive. Related: The U.S. Has a Huge E-Waste Problem. But There Is Money To Make in Its Disposal. 4. Extend the lifecycle of devices Extending the lifespan of electronic devices offers both financial and environmental benefits. By offering repair services, manufacturers and third-party providers can help consumers prolong the lifespan of their electronic devices. Not only is this often cheaper than buying a new device, but it also reduces e-waste and minimizes the environmental impact of manufacturing a new device. Another approach businesses can take to extend the lifecycle of electronic devices is to sell their used devices. By selling thoroughly tested and repaired used devices at a reduced price with a warranty, consumers bask in a vibrant array of choices, extending beyond the realm of brand-new products. According to Counterpoint Research, the demand for refurbished smartphones continues to grow. In 2022, the global secondary smartphone market saw growth of 5% year-over-year, with refurbished iPhone sales growing by 16%. Additionally, the secondary market of refurbished devices also creates new opportunities for businesses and consumers to get some of their investments back, reducing the overall cost of ownership and making affordable technology more accessible. Manufacturers can also support the environment by making affordable replacement parts available and providing repair guides or tutorials. Companies can extend the lifespan of their products and foster customer loyalty simultaneously by embracing repairability and sustainability. 5. Foster a culture of sustainability Promoting sustainability within the company culture is essential for sustainable organizations aiming to make a positive environmental impact. Integrating sustainability into a company's core values, practices, and decision-making processes becomes a shared responsibility and commitment among employees, consumers, and stakeholders. This commitment then leads to a range of benefits for all involved parties, as well as the environment. Weaving a strong sustainability policy into a company's foundation as well as educating and engaging employees, sets a whole new standard that also comes with numerous benefits. Not only do sustainable organizations attract quality employees and sustainability-focused customers, but they also benefit financially. For example, after successfully defining and implementing a stewardship plan focusing on sustainability, REI now has one of the most successful circular commerce programs of any outdoor retail brand, taking in around 100,000 outdoor-related items to be traded or resold in their store locations in 2022. By integrating sustainability into all operations, tech companies can drive change and contribute to a more sustainable future. Related: 3 Ways You Can Bring Sustainability to Your Workplace","filter_flag":1}
{"title":"Strengthening Sustainable Building Operations | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA","guidislink":false,"published":"Fri, 23 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=174, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5\" target=\"_blank\">Strengthening Sustainable Building Operations | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Strengthening Sustainable Building Operations | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc3RyZW5ndGhlbmluZy1zdXN0YWluYWJsZS1idWlsZGluZy1vcGVyYXRpb25z0gEA?oc=5\" target=\"_blank\">Strengthening Sustainable Building Operations | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Initiatives\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Full abatement of a country’s building operations emissions will require a combination of these technologies. Global players need to customize their decarbonization pathway in individual regions by considering a tapestry of local factors. These include climate, regulation, infrastructure, tenant receptivity to technology, the current energy efficiency of the building stock, and the type of technologies already in use. For example, whereas district heating is emerging as a leading solution in Germany, the short-term potential to use this technology to heat commercial and residential buildings is far more limited in the US due to a lack of infrastructure. At the same time, governments are also taking action: by implementing tougher regulations paired with more generous incentives, they are increasing the pressure on stakeholders to adopt levers that decarbonize building operations. For example, the US has set aside $9 billion in incentives for heat pumps and homeowner retrofit rebates in the Inflation Reduction Act. Germany is providing $6.5 billion in incentives for energy efficiency measures via its COVID-19 recovery and emergency gas programs. Four Stakeholders That Are Critical for Success Four stakeholders have a significant influence on building operations and thus can play a key role in tackling emissions at this crucial stage in the building life cycle. These stakeholders—asset owners, OEMs, utility players, and local regulators—must act decisively if the building sector is to reach net zero. All four can gain significant benefits by doing so. For example, stakeholders can strengthen their license to operate, lock up early access to low-carbon power supplies, expand into new high-growth markets, and drive increased market valuations. We have found that companies with best-in-class sustainability metrics enjoy a premium of 10% to 15% in their valuations. And because about 60% of employees worldwide factor sustainability into their choice of job, building stakeholders can attract much-needed talent. None of the four stakeholders can solve the building sector’s huge decarbonization challenge alone. Historically, industry players have been slow to collaborate—in part because of a fragmented value chain. But stakeholders will need to cooperate and join forces if decarbonization initiatives are to be effective. Stakeholders will need to cooperate and join forces if decarbonization initiatives are to be effective. Nevertheless, each of the four stakeholders has a unique role to play to enable the building sector to reach net zero. By embracing this role, they can seize new opportunities but will also need to tackle critical challenges. Asset Owners Role. As the key decision makers on how buildings are constructed, equipped, and renovated, asset owners will play a leading decarbonization role. Unlike other stakeholders, asset owners are ultimately responsible for ensuring that their buildings achieve net zero, and these owners face the prospect of penalties if they fail to comply with low-emissions regulations or meet green targets. By driving the demand side of green solutions, asset owners will set the pace on adoption rates and the sector’s transition to net zero. Opportunities and Challenges. Assets owners have an opportunity to capture operational savings from more cost-effective technologies and potentially to command a rent premium for more attractive, sustainable buildings. By adopting decarbonization measures now, they can also gain reputation benefits, leverage green sources of capital, and mitigate the impact of future carbon taxes. But they will need to develop capabilities in several areas: measuring the existing CO 2 emissions baseline of assets, determining the feasibility of different green solutions so they can allocate capital more effectively, and implementing solutions in both new and existing buildings. Asset owners will also have to explore the optimal combination and sequencing of green solutions for their buildings. Once they have developed these capabilities, they can offer them as a service to other asset owners, thus establishing new green ventures beyond their core business. OEMs Role. OEMs need to provide the green technologies and services that are fundamental for the decarbonization of building operations. Their ability to innovate and market energy-efficient solutions and maintain them over the life cycle not only generates customer value but also significantly reduces CO 2 emissions. Opportunities and Challenges. Although some OEMs must deal with the challenge of declining legacy technology (such as oil and gas heating in Europe), most have a promising future driven by an ever-increasing customer appetite for energy-efficient products. The potential for OEMs to differentiate themselves from competitors has historically been based on classical buying criteria like quality, price, and availability. In recent years, this has shifted to a focus on adding capabilities such as the capacity to combine different technologies into a single solution that adds customer value (for example, sector coupling of electricity-based heating with distributed solar photovoltaic) or the ability to offer superior control on the back of IoT-enabled cloud-edge connectivity (such as smart control and optimization of electricity consumption via home or building energy management systems). In the long term, however, these players face uncertainty about the pace of the green transition, the resilience of their established go-to-market networks, and how incentives and regulations will evolve. Furthermore, it remains unclear whether the regional nature of the green building technology markets will persist. It is likely that global competition will intensify and offer Asian mass producers an even stronger inroad to Western markets. For example, in the market for air-to-air heat pumps, players like Daikin and Mitsubishi are starting to gain share over regional incumbents in Europe. To sustain an advantage, incumbents may need to invest (in expanding their footprint, for instance), forge partnership ecosystems, or consider strategic M&A. Market access and scale will be increasingly important as green building technologies evolve along the maturity curve. The US firm Carrier Global’s acquisition of the climate solution business of Germany’s Viessmann is a good example of strategic thinking in that regard, if approved by regulators. Utility Companies Role. Utility providers need to supply the green electricity that will enable the building sector to reach net zero. And they will have to deliver a lot more of it as buildings increasingly electrify and demand skyrockets. Opportunities and Challenges. Utility players have an opportunity to capture a share of the growing green electricity market and, in doing so, mitigate their own Scope 3 emissions. They can also establish new business lines, such as installing and servicing green solutions, leveraging their existing field staff and deep, data-driven understanding of customers’ energy usage and requirements. Utility companies will be able to offer large asset owners a one-stop-shopping solution that combines renewable energy services with heat pumps and other green technologies such as district heating. But utility operators also face uncertainty about the potential trajectory of green solutions as well as challenges in anticipating the future demand for green electricity—and they may lose customers if they do not navigate the energy transition smoothly. In addition, they will need to motivate and forge strong partnerships with independent technical installers. Furthermore, the grid infrastructure in some countries needs upgrading to support renewable energy. Still, many utility companies have seen windfall profits over the past year from higher energy bills. By investing some of this money in the building value chain (for example, in installation services), they can play an important role in the sector’s decarbonization journey. Local Regulators Role. These players need to drastically simplify the local regulations that planners must comply with, as these requirements often impede the adoption of green building technologies. At the same time, local regulators should increase sustainability requirements for building approvals and extend incentives for green solutions. Opportunities and Challenges. Local regulators have an opportunity to significantly accelerate building decarbonization and promote effective green technologies. To do so successfully, they will need to develop new capabilities for assessing and prioritizing green solutions and evaluating building plans that contain new technologies. They must also avoid creating further regulatory complexity that impedes change. Regulators should prioritize introducing new requirements for the highest-emitting sources and segments and should deploy financial incentives to help players with high upfront investment costs. Given the size of building sector emissions, key stakeholders must act to help mitigate the global climate crisis. Although steps are needed across the building life cycle and from all players, decarbonizing the operations phase by using the dual levers of energy efficiency and fuel switching\/electrification will have the greatest impact. While a lot still has to be done, the pieces are in place for the building sector to succeed. Cost-efficient decarbonization technologies already exist, governments are setting tougher targets and providing more generous incentives, and players—faced with higher energy costs—are recognizing the importance of taking action. Building stakeholders must now grasp the challenge and accelerate the push to net zero.","filter_flag":1}
{"title":"Is the Skincare Industry Recession Proof? - Happi","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmhhcHBpLmNvbS9leGNsdXNpdmVzL2lzLXRoZS1za2luY2FyZS1pbmR1c3RyeS1yZWNlc3Npb24tcHJvb2Yv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmhhcHBpLmNvbS9leGNsdXNpdmVzL2lzLXRoZS1za2luY2FyZS1pbmR1c3RyeS1yZWNlc3Npb24tcHJvb2Yv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmhhcHBpLmNvbS9leGNsdXNpdmVzL2lzLXRoZS1za2luY2FyZS1pbmR1c3RyeS1yZWNlc3Npb24tcHJvb2Yv0gEA","guidislink":false,"published":"Sun, 25 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=176, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmhhcHBpLmNvbS9leGNsdXNpdmVzL2lzLXRoZS1za2luY2FyZS1pbmR1c3RyeS1yZWNlc3Npb24tcHJvb2Yv0gEA?oc=5\" target=\"_blank\">Is the Skincare Industry Recession Proof?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Is the Skincare Industry Recession Proof? - Happi","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmhhcHBpLmNvbS9leGNsdXNpdmVzL2lzLXRoZS1za2luY2FyZS1pbmR1c3RyeS1yZWNlc3Npb24tcHJvb2Yv0gEA?oc=5\" target=\"_blank\">Is the Skincare Industry Recession Proof?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","source.href":"https:\/\/www.happi.com","source.title":"Happi","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Initiatives\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Rising inflation has affected all sectors of the market, and consumers are noticing the prices at the register. As prices continue to rise, many skincare brands wonder what it will take to maintain their relationships with their loyal client base. Provoke Insights, a full-service market research firm and brand consultancy, sought to answer this question. The agency fielded a survey among 1,500 Americans to help understand trends in consumer purchasing. The research explores the impact of inflation on skincare products and provides insight through research on consumers attitudes toward the current market and rising inflation. Inflation and Consumer Habits There's been a rebound in skincare sales. There's been a rebound in skincare sales. Who Is Buying Skincare? For skincare brands, the Northeast is where the action is… For skincare brands, the Northeast is where the action is… The Shopping Experience Skincare product shoppers are concerned about quality. Skincare product shoppers are concerned about quality. Shoppers are noticing price increases…especially in department stores and drug stores. Shoppers are noticing price increases…especially in department stores and drug stores. Skincare is an essential purchase for many shoppers. Skincare is an essential purchase for many shoppers. Marketing Skincare to the Target Audience Skincare buyers also enjoy targeted advertising and take it into consideration when shopping (23%). They also report that advertisements help them choose what products to purchase (24%). These consumers also expect advertising to be creative and entertaining (38%) significantly more than non-skincare shoppers (30%). Influencer advertising could also be beneficial when advertising skincare products, as some shoppers report social influencers as a guide for selecting products they want to purchase (21% vs. 13%). Advertising plays a critical role in educating and entertaining skincare shoppers. Advertising plays a critical role in educating and entertaining skincare shoppers. Recommendations for Beauty Brand Owners Methodology It’s no surprise that economic uncertainty is directly affecting shopping habits across all industries including skincare. In fact, out of all current day worries, over half of consumers reported that inflation (63%) and the economy (61%) are their biggest concerns. To compound these worries, consumers say they have noticed price increases in stores such as department stores (63%), drug stores (62%) and superstores\/big box stores (56%)—establishments where skincare is sold. As a result, almost two-thirds of consumers are more budget conscious (62%) than they were six months ago.Despite consumer purchasing concerns during this time of rising inflation, consumers will not hold off on skincare purchases. As a matter of fact, Americans are buying skincare more than in the previous year, with a 12% increase in sales since Fall 2022. About half (44%) of consumers are planning on purchasing skincare in the next three months.The sales jump may have to do with several factors, including the industry introducing more CBD products, consumers prioritizing skincare routines, and Americans returning to more social routines and events out of the home as the uptick of Covid has subsided.Compared to fourteen other consumer-facing categories, more Americans care about the quality of skincare (72%) over the price (28%) than any other industry. These industries include sectors such as beauty supplies, fine jewelry, furniture, apparel and electronics.So why is this good news for the skincare industry? Consumers would not substitute these products for a lower-cost version, even during economic uncertainty. The passion for these products is evident, as consumers are also more likely to purchase skincare products at the same rate (47%) even if a recession occurs. This is more than double other industries (25%). These loyal shoppers tend to have a higher household income and are of the older generations.So, who are today's overall skincare shoppers? Female Millennials living in the Northeast are the most likely to purchase skincare in the next month. There is also a distinct subset of these purchasers who place an emphasis on quality. These consumers are in affluent households, parents, live in the West and urban areas, and are more optimistic. However, skincare shoppers who are more price-conscious are living in more rural areas. They are older, have a lower household income and tend to be males that live in the Midwest. This could be important in understanding the differences in consumer priorities for marketing different products.Overall, skincare shoppers enjoy the experience of purchasing items. However, skincare shoppers are still invested in sticking to familiar brands (46%), which may be one of the reasons why the interest in purchasing quality skincare has not decreased. As this cohort is younger, they do prefer shopping online (32%). However, this doesn't mean they dislike browsing in-store. There is an opportunity to focus on point-of-purchase advertising for this audience; they prefer browsing through store aisles (49%) more than those who do not purchase (35%).Brands should note that DEI and sustainability values are important to these shoppers. Skincare shoppers are invested in switching brands if they do not align with their values (35%) more than non-skincare shoppers (28%). They are also more likely to pay more for sustainable products (27% vs. 20%). When consumers see a brand reflecting their values, they bond more closely with those products.Skincare shoppers do not have a strong preference for shopping small businesses. This could be attributed to the importance of quality skincare and the hesitation to purchase something that is not absolutely sure to be safe for the skin. Shopping online is a priority for them (32% vs. 23%), which could be helpful in avoiding upcharges.Since consumer worries about inflation do not appear to be decreasing in the foreseeable future, skincare brands should be focusing on how to keep their customers loyal and happy, despite rising prices. Consumers feel that purchasing skincare products is essential despite their cost, and skincare brands should take advantage of this information.Marketing skincare products as not only a high-end luxury product, but an everyday luxury product would keep consumers interested in purchasing at the high volume that they are currently. Initiatives such as targeted entertaining advertisements and influencers can support these initiatives. Brands should also keep in mind that skincare consumers are invested in supporting DEI in brands and sustainably sourced products. Communication efforts that promote a brand’s DEI or green initiatives can further increase conversion and loyalty.Provoke Insights conducted a 15-minute online survey among 1,500 Americans between 21 and 65. The study was fielded in April 2023. A random stratified sample methodology was used to ensure a high degree of representation of the US population (household income, age, gender, geography, ethnicity and parental status). Results based on this sample have a maximum margin of sampling error of +\/- 2.5% at a 95% confidence level. Statistical differences between subgroups indicated in this research were tested at a 95% confidence level. Check out Provoke Insights for the latest skincare research. Email: [email protected]","filter_flag":1}
{"title":"The Nasdaq-100: How innovation is powering your cup of coffee - Invesco","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmludmVzY28uY29tL3FxcS1ldGYvZW4vZXRmLWluc2lnaHRzL3RoZS1uYXNkYXEtMTAwLWhvdy1pbm5vdmF0aW9uLWlzLXBvd2VyaW5nLXlvdXItY3VwLW9mLWNvZmZlZS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmludmVzY28uY29tL3FxcS1ldGYvZW4vZXRmLWluc2lnaHRzL3RoZS1uYXNkYXEtMTAwLWhvdy1pbm5vdmF0aW9uLWlzLXBvd2VyaW5nLXlvdXItY3VwLW9mLWNvZmZlZS5odG1s0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LmludmVzY28uY29tL3FxcS1ldGYvZW4vZXRmLWluc2lnaHRzL3RoZS1uYXNkYXEtMTAwLWhvdy1pbm5vdmF0aW9uLWlzLXBvd2VyaW5nLXlvdXItY3VwLW9mLWNvZmZlZS5odG1s0gEA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmludmVzY28uY29tL3FxcS1ldGYvZW4vZXRmLWluc2lnaHRzL3RoZS1uYXNkYXEtMTAwLWhvdy1pbm5vdmF0aW9uLWlzLXBvd2VyaW5nLXlvdXItY3VwLW9mLWNvZmZlZS5odG1s0gEA?oc=5\" target=\"_blank\">The Nasdaq-100: How innovation is powering your cup of coffee<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Invesco<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Nasdaq-100: How innovation is powering your cup of coffee - Invesco","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmludmVzY28uY29tL3FxcS1ldGYvZW4vZXRmLWluc2lnaHRzL3RoZS1uYXNkYXEtMTAwLWhvdy1pbm5vdmF0aW9uLWlzLXBvd2VyaW5nLXlvdXItY3VwLW9mLWNvZmZlZS5odG1s0gEA?oc=5\" target=\"_blank\">The Nasdaq-100: How innovation is powering your cup of coffee<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Invesco<\/font>","source.href":"https:\/\/www.invesco.com","source.title":"Invesco","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Initiatives\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Technology has disrupted just about everything, including the fuel that drives much of the world’s productivity. We speak of course of coffee, the centuries-old beverage that we enjoy in our homes, workplaces and restaurants. The stories below demonstrate how innovation is driving how three companies have changed the way they produce, market and distribute this iconic beverage. More broadly, these examples illustrate how even non-tech companies in the Nasdaq-100® Index, which Invesco QQQ tracks, are leveraging cutting-edge technology such as e-commerce initiatives, data science and artificial intelligence (AI) to help drive growth.","filter_flag":1}
{"title":"Sustainable Technology Solutions: How Tech Giants Have Adopted Green Initiatives - ABP Live","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMtIBpQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMi9hbXA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMtIBpQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMi9hbXA?oc=5","id":"CBMioQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMtIBpQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMi9hbXA","guidislink":false,"published":"Wed, 28 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=179, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMtIBpQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMi9hbXA?oc=5\" target=\"_blank\">Sustainable Technology Solutions: How Tech Giants Have Adopted Green Initiatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABP Live<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable Technology Solutions: How Tech Giants Have Adopted Green Initiatives - ABP Live","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMtIBpQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdGVjaG5vbG9neS9zdXN0YWluYWJsZS10ZWNobm9sb2d5LXNvbHV0aW9ucy1ob3ctdGVjaC1naWFudHMtaGF2ZS1hZG9wdGVkLWdyZWVuLWluaXRpYXRpdmVzLWFwcGxlLWdvb2dsZS1zYWxlc2ZvcmNlLWludGVsLWhwLWRlbGwtMTYxMjAzMi9hbXA?oc=5\" target=\"_blank\">Sustainable Technology Solutions: How Tech Giants Have Adopted Green Initiatives<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABP Live<\/font>","source.href":"https:\/\/news.abplive.com","source.title":"ABP Live","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Initiatives\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"By Tejaswini Gupta Sustainable technologies, also known as clean technologies or green technologies, are innovations and practices that aim to minimise negative environmental impacts while promoting sustainable development. These technologies are designed to conserve resources, reduce pollution and greenhouse gas emissions, and enhance the overall efficiency of various sectors, including energy, transportation, agriculture, waste management, and construction. Many companies across the globe are increasingly realising the importance of sustainable technology and the need to incorporate it into their operations. There are several reasons driving this realisation: Environmental Awareness Growing concerns about climate change, resource scarcity, and environmental degradation have raised awareness among companies and the general public about the need for more sustainable practices. Companies recognise that they have a responsibility to minimise their environmental footprint and contribute to a more sustainable future. Regulatory Pressure Governments worldwide are implementing stricter environmental regulations and incentives to encourage sustainable practices. This regulatory environment pushes companies to adopt sustainable technologies to comply with laws and avoid penalties, ensuring their long-term viability. Consumer Demand Consumers are becoming more conscious of the environmental impact of the products and services they purchase. Many individuals prefer to support companies that demonstrate a commitment to sustainability. As a result, companies recognise the importance of incorporating sustainable technologies to meet consumer expectations and maintain their market share. Cost Savings & Efficiency Sustainable technologies, such as energy-efficient systems and renewable energy sources, can often lead to cost savings in the long run. By reducing energy consumption, optimising processes, and minimising waste, companies can improve their operational efficiency and save on resources, which can translate into financial benefits. Innovation & Competitive Advantage Embracing sustainable technologies can foster innovation within companies. It encourages them to develop new products, services, and business models that are more aligned with sustainable principles. By embracing sustainability, companies can gain a competitive advantage by differentiating themselves in the market and appealing to environmentally conscious consumers. As a result of these factors, an increasing number of companies are integrating sustainable technologies into their operations, supply chains, and product offerings. They are investing in research and development, collaborating with sustainable technology providers, and adopting sustainable practices to reduce their environmental impact and contribute to a more sustainable future. Sustainable Technologies In IT Sustainable technologies in the field of information technology (IT) focus on minimising the environmental impact of digital systems, improving energy efficiency, reducing electronic waste, and promoting responsible use of resources. IT companies are developing and promoting energy-efficient hardware components, such as servers, storage devices, and networking equipment. These devices are designed to consume less power while maintaining performance, reducing energy consumption and greenhouse gas emissions. Virtualisation technologies enable the consolidation of multiple servers onto a single physical server, optimising resource utilisation and reducing energy consumption. Cloud computing allows organisations to access computing resources on demand, reducing the need for individual servers. IT companies are implementing e-waste management strategies to ensure responsible disposal and recycling of electronic equipment. This includes partnering with certified e-waste recyclers and implementing take-back programs to collect and recycle end-of-life devices. These are just a few examples of how sustainable technologies are being implemented in the IT sector. The focus is on reducing energy consumption, minimising waste, and promoting responsible use of resources to make IT operations more sustainable. Green Initiatives In Tech Industry In 2014, Unilever CEO Paul Polman told the world that only climate-related disasters are costing Unilever $300 million a year. Turing green is not only beneficial to the environment but will also help in cost-cutting in different ways. Having a green alternative to the way we use to work is easy to implement and many tech companies have taken it as their mission to do so. Here are some ways different tech giants have adopted a green initiative: Apple Apple has made significant strides in environmental sustainability. The company aims to power its operations with 100 per cent renewable energy and has achieved this goal for its data centres, offices, and retail stores. Apple also emphasises recycling and uses recycled materials in its products. It has made progress in reducing carbon emissions throughout its supply chain. Google Google has been a leader in renewable energy procurement. The company has made substantial investments in renewable energy projects, such as wind and solar farms, to power its data centres. Google is also committed to achieving carbon neutrality for its operations and supports initiatives to promote energy efficiency and renewable energy adoption. Microsoft Microsoft is actively pursuing sustainability goals. The company has pledged to be carbon negative by 2030 and aims to remove all the carbon it has emitted since its founding by 2050. Microsoft is investing in renewable energy projects, implementing energy-efficient technologies, and promoting sustainable practices in its operations and products. Amazon Amazon has made commitments to renewable energy and sustainability. The company aims to power its global infrastructure with 100 per cent renewable energy by 2025 and has launched several renewable energy projects. Amazon has also implemented sustainable packaging initiatives and is working towards achieving carbon neutrality for its operations. Intel Intel has a strong focus on sustainability. The company has set ambitious goals to reduce its greenhouse gas emissions, conserve water, and achieve zero waste to landfill. Intel invests in energy-efficient technologies and renewable energy procurement. It also collaborates with suppliers to promote sustainable practices throughout the supply chain. Dell Dell has made sustainability a core aspect of its business strategy. The company is committed to achieving its 2030 moonshot goals, which include using 100 per cent recycled or renewable materials in its products and ensuring that more than half of its product packaging is made from recycled or renewable materials. Dell also promotes responsible recycling and e-waste management. Salesforce Salesforce is dedicated to sustainability and has set ambitious goals to achieve 100 per cent renewable energy, carbon neutrality, and zero waste. The company invests in renewable energy projects and promotes energy efficiency in its operations. Salesforce also focuses on sustainability in its products and services, offering cloud-based solutions that help organisations reduce their environmental impact. HP HP has a strong commitment to sustainability across its operations. The company aims to use 100 per cent renewable electricity in its global operations and has made significant progress in reducing the carbon footprint of its products. HP also promotes responsible recycling of electronic waste and has implemented sustainable design practices to minimise environmental impact. The green initiatives in the tech industry also contribute to a positive societal impact. By embracing sustainability, companies are not only reducing their environmental impact but also meeting the growing demand for eco-friendly products and services. They are influencing consumer behaviour, inspiring other industries to adopt sustainable practices, and fostering a culture of environmental responsibility. In conclusion, sustainable technology solutions and green initiatives in the tech industry are essential for addressing environmental challenges, reducing carbon emissions, and promoting responsible resource management. The commitment of leading tech companies to sustainability serves as an inspiration for the entire industry and beyond. By prioritising sustainability, the tech industry is making significant strides towards creating a more sustainable and environmentally conscious future.","filter_flag":1}
{"title":"Autel Energy Holds Partner Summit in Amsterdam - AftermarketNews.com (AMN)","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vYXV0ZWwtZW5lcmd5LWhvbGRzLXBhcnRuZXItc3VtbWl0LWluLWFtc3RlcmRhbS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vYXV0ZWwtZW5lcmd5LWhvbGRzLXBhcnRuZXItc3VtbWl0LWluLWFtc3RlcmRhbS_SAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vYXV0ZWwtZW5lcmd5LWhvbGRzLXBhcnRuZXItc3VtbWl0LWluLWFtc3RlcmRhbS_SAQA","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vYXV0ZWwtZW5lcmd5LWhvbGRzLXBhcnRuZXItc3VtbWl0LWluLWFtc3RlcmRhbS_SAQA?oc=5\" target=\"_blank\">Autel Energy Holds Partner Summit in Amsterdam<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AftermarketNews.com (AMN)<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Autel Energy Holds Partner Summit in Amsterdam - AftermarketNews.com (AMN)","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LmFmdGVybWFya2V0bmV3cy5jb20vYXV0ZWwtZW5lcmd5LWhvbGRzLXBhcnRuZXItc3VtbWl0LWluLWFtc3RlcmRhbS_SAQA?oc=5\" target=\"_blank\">Autel Energy Holds Partner Summit in Amsterdam<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AftermarketNews.com (AMN)<\/font>","source.href":"https:\/\/www.aftermarketnews.com","source.title":"AftermarketNews.com (AMN)","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Initiatives\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Autel Energy, provider of EV charging products and services, announced it hosted the Autel Partner Summit at Muziekgebouw in Amsterdam, May 31 to June 1, 2023. The event not only showcased Autel’s Europe strategy for the next two years, but also provided partners with opportunities to gain insights into the company’s vision, and learn about Autel’s new products, the company says. Autel Energy adds the Partner Summit helped it strengthen partnerships in Europe and highlighted its collaborations with key clients. Notable partners in attendance included, Maxicharger AC clients, Sevadis and Deta, as well as Maxicharger DC clients, Floading, Gasgas, and eWays. The company also partnered with CPO clients like Fastway and Powerdo, as well as energy companies like Enefit. On May 31, the event kicked off with a keynote address introducing Autel Energy and its vision for the future, followed by a new product launch and a series of case studies. Attendees also participated in sessions on cloud services and solutions, an awards ceremony and one-on-one sales meetings. The next day, participants had the opportunity to explore Amsterdam’s logistical infrastructure. To conclude the event, Autel Energy invited partners to dine on Oceandiva Futura, a sustainable event ship, providing a memorable boat tour that highlighted Autel’s commitment to green initiatives, energy sustainability, as well as environmental, social, and governance (ESG) principles, the company says. “We are thrilled to invite our valued partners to the Autel Energy Partner Summit and share our Europe strategy for the next two years,” said Ting Cai, CEO of Autel Europe. “This summit represents our unwavering commitment to EV charging solutions and mutually beneficial partnerships.”","filter_flag":1}
{"title":"MT Interview: Stuart Mustoe, CEO TrustFord - Motor Trader","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lm1vdG9ydHJhZGVyLmNvbS9tb3Rvci10cmFkZXItbmV3cy9hdXRvbW90aXZlLW5ld3MvbXQtaW50ZXJ2aWV3LXN0dWFydC1tdXN0b2UtY2VvLXRydXN0Zm9yZC0yMy0wNi0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lm1vdG9ydHJhZGVyLmNvbS9tb3Rvci10cmFkZXItbmV3cy9hdXRvbW90aXZlLW5ld3MvbXQtaW50ZXJ2aWV3LXN0dWFydC1tdXN0b2UtY2VvLXRydXN0Zm9yZC0yMy0wNi0yMDIz0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3Lm1vdG9ydHJhZGVyLmNvbS9tb3Rvci10cmFkZXItbmV3cy9hdXRvbW90aXZlLW5ld3MvbXQtaW50ZXJ2aWV3LXN0dWFydC1tdXN0b2UtY2VvLXRydXN0Zm9yZC0yMy0wNi0yMDIz0gEA","guidislink":false,"published":"Fri, 23 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=174, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lm1vdG9ydHJhZGVyLmNvbS9tb3Rvci10cmFkZXItbmV3cy9hdXRvbW90aXZlLW5ld3MvbXQtaW50ZXJ2aWV3LXN0dWFydC1tdXN0b2UtY2VvLXRydXN0Zm9yZC0yMy0wNi0yMDIz0gEA?oc=5\" target=\"_blank\">MT Interview: Stuart Mustoe, CEO TrustFord<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Motor Trader<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"MT Interview: Stuart Mustoe, CEO TrustFord - Motor Trader","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lm1vdG9ydHJhZGVyLmNvbS9tb3Rvci10cmFkZXItbmV3cy9hdXRvbW90aXZlLW5ld3MvbXQtaW50ZXJ2aWV3LXN0dWFydC1tdXN0b2UtY2VvLXRydXN0Zm9yZC0yMy0wNi0yMDIz0gEA?oc=5\" target=\"_blank\">MT Interview: Stuart Mustoe, CEO TrustFord<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Motor Trader<\/font>","source.href":"https:\/\/www.motortrader.com","source.title":"Motor Trader","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Initiatives\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"In March 2023 TrustFord announced changes to its senior leadership team, including the appointment of a new CEO. Stuart Mustoe, who previously held the position of finance director and had been acting chair and CEO since the retirement of the late Stuart Foulds in February 2022, took up the role. Mustoe is a long-standing figure at TrustFord having joined what was then Ford Retail as a trainee accountant in 1997 before moving into the role of accountant for the Truck Division & Uxbridge, a position that he held from 1999-2003. He subsequently held several positions within the group, including financial controller for Surrey, West London & Alperton from 2003-2006 and regional financial controller positions from 2006 onwards. He was appointed finance director in November 2013, when he joined the board. The factory owned Group turned in record pre-tax profits of £29.4m on turnover of £1.8bn in the year to December 2021. It said commercial vehicle sales were ‘exceptionally high’ in 2021 and were the main contributor to the increase in turnover. It has also been expanding its coverage north, with the opening of a dealership in Carlisle joining its existing Parts Plus business on Kingstown Industrial Estate. The existing site, which has seen an extensive redevelopment – representing an investment of £500,000, will offer an enlarged, enhanced, and relaxed showroom space. Motor Trader spoke to Mustoe as he begins his tenure as CEO to find out what TrustFord’s focus is going forward, how it is handling changes to the automotive workplace, and how Ford’s evolving model line-up will affect the business. TrustFord was recently recognised as one of the 2023 Best Workplaces in the UK by Great Place to Work, ranked 40 in the Super Large Organisation category. The accreditation follows a culture audit and confidential employee survey that looked at several areas, including what key qualities makes TrustFord a great place to work, how colleagues are supported in reaching their highest potential, and the organisation’s values and guiding principles. Mustoe mentioned this achievement as one of his recent highlights with the group. He said: “The highlights to date, certainly from my perspective, revolve around the people who work for us and our company culture. It was great to be recognised as a Great Place to Work by an independent organisation. Integral to our company culture is our PPA, which stands for our Purpose, Principles, and Ambition. Our purpose is to drive the standard in Customer Care, and that involves everyone in the organisation driving that customer experience. It is around making sure we’re positive, caring, respectful and enjoying ourselves while investing, innovating, and growing the best people to share in our success together. “I’ve worked for the company for 26 years, graduating from university and working my way through the organisation and as a company, we pride ourselves on succession planning. We’ve had a lot of success stories over the last 12-15 months around internal promotions and colleagues being given the opportunity to push on within the organisation and fulfil their career ambitions.” TrustFord is also trying to accommodate new working practices such as hybrid working, although in a largely customer facing industry this can be a challenge. On this, Mustoe said: “We try to listen to our colleagues, and everyone in relevant roles has now been introduced to hybrid working. We have 2,800 colleagues across the organisation. We were quite specific that certain job roles could be on a hybrid work pattern in the traditional office roles such as finance, sales, admin, marketing, and HR etc. While we have a hybrid policy for those roles, clearly the rest of the organisation is here to serve our customers and as we are a retail organisation it’s more difficult to be flexible on that model – however, we do offer flexible working hours for all roles. “I’ll be honest, I think those front-line colleagues understand that approach. Ultimately where our customers choose to transact on our premises, then clearly, we need colleagues to be present at their place of work, but we’re always happy to listen to colleagues and applicants about flexible working proposals. We’ve also been encouraging lot of job-sharing opportunities over the last couple of years.” When it comes to group strategy, Mustoe talked on TrustFord’s northern expansion, with the new Carlisle dealership to be the first of several openings in the next 12 months. Mustoe said: “We’ve broken it down into key areas. There is our dealership footprint, which is there to serve the next generation of automotive buyers. We already have a strong presence in the metropolitan areas such as London, Birmingham, Belfast, Bristol, Manchester and across Yorkshire. We’re expanding and now going into the north of England and pushing further into Scotland. We are about to open three brand new sites in the next 12 months. We start with Carlisle in Q3 this year. We then go to Aberdeen at the end of the year and then Glasgow around March\/April next year. So, within 12 months we’ll have national coverage and a fixed footprint in northern England and Scotland to complement our already extensive coverage. “Then there’s our national fleet operation that covers the breadth of the UK, delivering commercial vehicle excellence and a strong track record in commercial vehicle sales. We also operate our Parts Plus wholesale business and a national mobile service van operation.” Sustainable future TrustFord was recently presented with a green dealer of the year award at the NFDA Spring Ball. TrustFord won the Green Dealer Award (over 10 sites). The group has been working on its green credentials for a few years, but Mustoe said that it has picked up its efforts considering government legislation. He added: “We’ve set ourselves a target to be carbon neutral by 2035. The product line-up and the Ford Motor Company is going to play a huge part in that sustainability journey. But from a TrustFord perspective, we’ve refreshed our estate with LED lighting and started installing solar panels. We’ve also really doubled down on behaviours; every site has an energy champion, someone that is responsible at the dealership to work with the management team to make sure that the various green initiatives are being upheld such as recycling or monitoring consumption wastage. “We also run a competition across the dealerships. From the first of October to the end of March we challenged our dealerships to reduce their consumption. There was a four-to-five percent overall consumption reduction across the group. Not only does it support our green credentials, but it also has an impact on offsetting the additional costs of electricity and gas in the current market. Our costs are up substantially year on year but the consumption coming down as certainly helped with that. There is a big strategy around carbon neutrality by 2035, and we have a way to go to achieve that. But we’re in a good place and we pride ourselves on making good progress and setting goals along the way.” Ford has been continuing its roll-out of EVs, with a target by 2035 of having all vehicle sales 100% all-electric and for its entire operation to be carbon neutral across Europe. It already has the Mustang Mach-e and the E-Transit but has said that it will be adding ten more models by 2024. Mustoe said: “It’s an exciting time to be with Ford. Ford is now fully committed to its electric vehicle strategy. You’re seeing a lot of new vehicles come to market. We’ve got the Mustang Mach-e and the E-Transit already in the marketplace, which have been very popular with customers, but we need to expand from that base. We have the Explorer that was announced earlier on in the year, and we’ll start to see that model on the ground by the end of this year. The Transit Custom will get a fully electric model with a good range and payload and all the features you expect from that very successful vehicle. Ford will be using the iconic brand names that like Explorer, Mustang and Transit, to really electrify its products. “For EV, it really is about awareness and education. We’ve tackled it from a couple of angles. We’ve partnered with the NFDA and been part of its EVA accreditation programme. We found that super helpful in getting our teams skilled to a level and then we then complement that with the Ford of Britain training that is mainly delivered from the Ford college in Daventry; this involves a combination of eLearning and physical time as certain products come through. So, we really are embracing the EV journey. “We have also kept a balance as we still sell a substantial number of ICE vehicles. It really is about checking in with the teams and making sure they’re upskilled in both and have the product knowledge both for the sales and the workshop facilities.” The agency question Ford recently outlined its plans to roll out the agency model across Europe to dealers attending the Bring On Tomorrow Live event in Copenhagen, Denmark. Ford has already introduced transparent pricing in the Netherlands and plans to do the same across Europe. It said that it wanted to make discovering, testing, buying and owning its products simpler and more satisfying, starting with Ford EVs. On the prospect of agency, Mustoe seemed unphased and emphasised that what is ultimately most important is the customer. He said: “Our automotive model is changing. If we think about the agency model, which is just another distribution model, it has already been around for several years. Ford currently operates within the parts wholesaling business under an agency model. So, it’s not completely new to TrustFord from that perspective. In the meantime, we are building on a strategy that’s built around our guest experience, EV, connected vehicles and the iconic brand that taps into the history of Ford and its American heritage. “The key to success is to focus on the experience of all guests interacting with Ford and to achieve the best possible outcomes for our customers and colleagues. So, we will bring these products to market in the best way we possibly can, alongside, I’m sure, our dealer partners. I have no dates of when the agency model may be coming to the UK, but I will continue to work with Ford and keep engaging in constructive dialogue. In the meantime, we will keep focused on our current agreement and driving the standard in customer care. “In my opinion a combined bricks and clicks model is absolutely the way forward and we’ve all worked hard to get our ‘clicks’ processes in place and we are all invested in the corporate identity from a physical perspective. I truly believe that is still the way. Ultimately our customers will tell us what they want. From what we know today, they want to do the research online, but then want to come down to the dealership and test drive and talk to the product expert. We’ll see how a potential agency model fits into that approach in the future.” Looking at TrustFord’s year so far and to the future, Mustoe said that in his experience the supply of new vehicles is starting to get better in 2023. He added: “We still have some congestion around logistics, but we are working hard to resolve what we can as quickly as we can. Certainly 2023 started a lot better than the previous couple of years and every month I’m seeing ongoing improvement. “Looking ahead, I think the highlights for the rest of the year will be the expansion into Carlisle, Aberdeen, and Glasgow. That really is an opportunity nationally to expand the business. There are also a lot of new products to look forward to – we’re going to see 10 new products landing in the next two years. “Our challenges include inflationary cost pressures, which are still a concern along with interest rates. Electricity and gas come under that inflationary pressure and that is also on our minds. But we will work hard to achieve our half year goals; we had a solid Q1 and are looking to continue the momentum into Q2. We will push on for the second half of the year and keep that momentum up. “There will always be challenges in the industry, but we have a great team around us that will do everything they can to seek out every opportunity.”","filter_flag":1}
