{"title":"New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5","id":"CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA","guidislink":false,"published":"Mon, 28 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=240, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5\" target=\"_blank\">New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1ob2xsYW5kLWFncmljdWx0dXJlLXB1YmxpY2x5LWxhdW5jaGVzLXRoZS1pbmR1c3RyeXMtZmlyc3QtYWxsLWVsZWN0cmljLXV0aWxpdHktdHJhY3Rvci13aXRoLWF1dG9ub21vdXMtZmVhdHVyZXMtLXRoZS1yZXZvbHV0aW9uYXJ5LXQ0LWVsZWN0cmljLXBvd2VyLXRyYWN0b3ItMzAxOTEwNTczLmh0bWzSAQA?oc=5\" target=\"_blank\">New Holland Agriculture Publicly Launches the Industry's First All-Electric Utility Tractor with Autonomous Features ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Low energy demand\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"New Holland introduces a new tractor class in the market, the Utility Electric, and paves a new chapter in sustainable zero emission farming with its first all-electric utility tractor with autonomous features. Better performance than diesel, the T4 Electric Power offers powerful, emission-free and silent energy power with high torque and fast response achieved at the lowest speeds, promoting a new level of driving experience . The pioneering and innovative New Holland tractor is launching for 2024 and will be on display at the 2023 Farm Progress Show in Decatur, Illinois . NEW HOLLAND, Pa., Aug. 28, 2023 \/PRNewswire\/ -- The future is here, and it just got more electric. For 2024, New Holland Agriculture is introducing the first all-electric utility tractor with autonomous features: the T4 Electric Power. This cutting-edge tractor opens a new class in the market, the Utility Electric, focused on offering solutions for more efficient field operations. The T4 Electric Power addresses current farming challenges, such as increased total cost ownership and labor shortage, while delivering upon New Holland's unwavering commitment to help customers build more sustainable agriculture for this generation and beyond. The new T4 Electric Power from New Holland is the first all-electric utility tractor with autonomous features. Post this The new T4 Electric Power from New Holland is the first all-electric utility tractor with autonomous features. The T4 Electric Power is a game-changing innovation that ushers in a new era of modern agriculture. An ideal solution for lower horsepower field operations, it is suitable for multiple applications, such as mixed farm, hay and forage, dairy, livestock, municipality, greenhouse and specialty crops (vegetable and orchard). The tractor is the latest development in New Holland's strategic plan for electrification and the newest addition to the brand's lineup of alternative energy sources powered equipments, like the T7 Methane Power LNG (Liquified Natural Gas) and the T6.180 Methane Power. Equipped with a state-of-the-art lithium-ion battery pack, the T4 Electric Power delivers gradual power and continuous torque achieved at the lowest speeds, ensuring a completely new driving experience and seamless operation during loader work cycle and daily farm routines. \"This tractor is a significant step forward for growers, producers and municipalities. The T4 Electric Power addresses a number of challenges they are facing everyday on their operations,\" states Lena Bioni, product marketing manager for New Holland Agriculture North America. \"What New Holland is bringing to our farmers is a convergence of technology – electric propulsion, autonomous features, better performance – in the body of a utility tractor that's setting the stage for a more efficient, sustainable and resilient future our customers are striving for.\" Performance and Battery Technology Redefined Under the hood of the T4 Electric Power lies a state-of-the-art battery system partnered with a fully electrified drivetrain that's proven to deliver relentless power and productivity. Featuring a 110-kWh maximum energy storage capacity in a 400V nominal high-voltage circuit, it provides 74 hp (55 kW) rated power and 65 hp (48 kW) PTO power. Using an efficient high voltage powertrain with integrated cooling features in the single devices from established mass production vendors, as well as material currently in production, makes this tractor a pioneering and revolutionary solution. Compared to its diesel-powered counterparts, the T4 Electric Power delivers superior performance. It offers 4-wheel drive, a proven 12x12 transmission, clutch-less electronic power shuttle reverser and all the regular power outputs of a traditional diesel utility. This includes rear electro-hydraulic PTO, drawbar, multiple rear remotes, mid-mount valves and a robust, and complete, 725LU mechanical self-leveling front loader with 3rd function and 84'' bucket included. Due to the greater control, enhanced precision and faster responsiveness, the tractor boosts the field capacity by reducing the applications cycle time. The tractor's electrified drivetrain promotes silent power with high torque and fast response achieved at the lowest speeds. These two intrinsic electric motor's characteristics, combined with the 12x12 electronic power shuttle transmission, means that even an inexperienced operator can run the implements during the applications without the need for precise gear selection and throttle control. Meanwhile, experienced operators will have infinite speed adjustments just by controlling motor RPM. Smooth and gradual delivery of power at low speeds and constant delivery in high speeds increase control and precision during field operations. \"The T4 Electric Power's quiet electric motor is definitely a big advantage and important tool in noise sensitive areas,\" Bioni explains. \"Outside, the tractor omits less noise and vibrations compared to diesel ones. Take for example, operating within equestrian barns or on college campuses running mowers and plowing snow alongside dorms.\" The T4 Electric Power was designed by CNH Industrial engineering in the United States (Burr Ridge, Ill., Detroit) and Italy (Modena) with state-of-the-art features and components aimed at durability, long service life and improved uptime. In general, considering light, medium and heavy-duty applications over its daily task routines, it's estimated the tractor can provide 4 hours of average runtime. However, this can easily be extended up to 8 working hours for low energy demand applications. In fact, its extended runtime empowers operators to tackle a variety of jobs without the need for frequent recharging, enhancing even more the overall productivity and reducing operational downtime. The tractor can be recharged by multiple energy sources such as regular grids, solar panels, biodigesters and wind power in both Alternate Current (AC) and Direct Current (DC). Operating in DC, it takes just one hour to reach 100% power when using commercially available fast charging systems. In addition, the T4 Electric Power can provide power availability wherever and whenever a customer needs it. This is the main goal of the practical and convenient Exportable Power feature. Equipped with common 110V and 220V outlets used in workshops and farmyard electrical installations, the tractor can serve as a power source for electric power tools such as welding, drilling and cutting machines. Technology Drives Productivity Smart autonomous features and creative driver assistance modes are part of the T4 Electric Power tractor's innovative character to improve daily farming operations with Precision Solutions & Telematics (PS&T), safety, diagnostics and service. With the design focused on addressing current farming challenges, such as increased total cost ownership, these outstanding features make the T4 Electric Power even more unique in the market. Driver-assisted features – Follow Me Mode, the Invisible Bucket and 360 Degree Awareness – are complemented by other fully digital and connected functions like Over the Air Updates, Live View and Map Maker, which make this tractor the first of its kind in the world. The tractor utilizes cameras and sensors in the Smart Roof, while modes are activated via a modern touchscreen display. The result is improved performance and safety both inside and outside of the cab full-time. A Bold New Blue A tractor as innovative as the T4 Electric Power requires its styling to match. The new Clean Blue paint scheme denotes a New Holland tractor that's powered by an alternative fuel source. First debuted on the New Holland T7 Methane Power LNG tractor, this head-turning shade of blue compliments the CNH grey decals, while an all-new hood design sports powerful LED headlights and worklights with illuminated accents. \"You're looking at the style of sustainability. Along with the head-turning paint scheme, customers can expect the T4 Electric Power tractor to redefine operating comfort with in-cab ergonomics, a new digital instrument cluster and a color touchscreen additional display,\" Bioni adds. The T4 Electric Power Tractor Being Introduced at Farm Progress Show The T4 Electric Power tractor will make its public debut at the 2023 Farm Progress Show, August 29-31, 2023, in Decatur, Illinois. It will be on display at the New Holland booth #967 in the northwest quadrant of the show grounds. The tractor is anticipated to be commercially available in North America with select dealers in early 2024. To explore the T4 Electric Power tractor and learn more about New Holland's Clean Energy Leader strategy, visit agriculture.newholland.com. Imagery and additional resources Images and additional product resources for the T4 Electric Power tractor can be downloaded here and used for publication purposes. New Holland Agriculture's reputation is built on the success of our customers, cash crop producers, livestock farmers, contractors, vineyards, or grounds care professionals. They can count on the widest offering of innovative products and services: a full line of equipment, from tractors to harvesting, material handling equipment, complemented by tailored financial services from a specialist in agriculture. A highly professional global dealer network and New Holland's commitment to excellence guarantees the ultimate customer experience for every customer. For more information on New Holland visit www.newholland.com New Holland Agriculture is a brand of CNH Industrial N.V. (NYSE: CNHI \/MI: CNHI) a global leader in the capital goods sector with established industrial experience, a wide range of products and a worldwide presence. More information about CNH Industrial can be found online at www.cnhindustrial.com For the latest press releases from New Holland brand on the CNH Industrial Newsroom visit: AMEA & ANZ I EUROPE I NORTH AMERICA I SOUTH AMERICA SOURCE New Holland Agriculture North America","filter_flag":1}
