{"title":"Switzerland's citizens want a circular economy, but not to share products - Phys.org","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuaHRtbNIBUGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuYW1w?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuaHRtbNIBUGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuYW1w?oc=5","id":"CBMiUWh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuaHRtbNIBUGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuYW1w","guidislink":false,"published":"Thu, 02 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=61, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuaHRtbNIBUGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuYW1w?oc=5\" target=\"_blank\">Switzerland's citizens want a circular economy, but not to share products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Phys.org<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Switzerland's citizens want a circular economy, but not to share products - Phys.org","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuaHRtbNIBUGh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAzLXN3aXR6ZXJsYW5kLWNpdGl6ZW5zLWNpcmN1bGFyLWVjb25vbXktcHJvZHVjdHMuYW1w?oc=5\" target=\"_blank\">Switzerland's citizens want a circular economy, but not to share products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Phys.org<\/font>","source.href":"https:\/\/phys.org","source.title":"Phys.org","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: Thanks to second-hand shops, we buy a modest amount of used clothes—most other consumers prefer to buy new. Credit: Keystone \/ Christian Beutler Reuse, share, collect and recycle—in times of faltering supply chains, circular economies are in great demand. When products and materials circulate in closed material flows, it saves resources and avoids waste. Whether this succeeds also depends heavily on the attitudes and behavior of consumers, who use, repair, buy second-hand or share products for as long as possible. Political scientists from ETH Zurich, together with the Federal Office of the Environment (FOEN), have now examined how the Swiss people feel about the circular economy. Their representative survey of more than 6,000 people shows that Swiss people think highly of the circular economy and are aware of its advantages, but rarely implement it in their everyday lives. \"There is a clear gap between supporting it in principle and practical behaviors,\" says ETH professor Thomas Bernauer, who led the study. Majority in favor of support measures According to the study, a clear majority of the population think that circular economy measures would have a beneficial effect on the Swiss economy. Those polled assume that the production of more durable products from more recycled materials will make Switzerland more competitive and less dependent on energy and raw material imports without affecting the labor market. Accordingly, many respondents strongly support political measures that promote a circular economy, including a duty to repair for retailers, a repairability label, a mandatory declaration of air transport and service life, or a mandatory percentage of recycled material in packaging. Prefer to buy new instead of sharing The majority of the respondents say that they are environmentally conscious. For the four products which the study considered in detail—smartphones, vacuum cleaners, washing machines and clothing—two thirds stated that they had sold or given away used products in the last 12 months. This shows that it is mainly clothing and smartphones that are given away second-hand. In contrast, however, far fewer respondents were willing to purchase used products themselves. Thanks to charity shops and second-hand shops, a certain amount of second-hand clothes are purchased—but rarely vacuum cleaners, smartphones and washing machines. \"There is a much greater inclination to sell or give away used items than there is to acquire them oneself,\" says Franziska Quoss, project coordinator of Bernauer's group. Supply and demand are thus in an unfavorable relationship. The reasons for this, according to those polled, are that it doesn't make financial sense for them to buy smartphones or clothing second-hand or have them repaired. They are also concerned about reduced quality in used goods. However, many simply state that they themselves prefer to buy and own new products. Little inclination to share Overall, the Swiss population displays weak circular behavior. Whether clothing, mobile phones, drills or vacuum cleaners—Swiss consumers appear very reluctant to share consumer goods with other people, to rent, to get things repaired or to buy second-hand. \"The frequently invoked sharing economy is still a long way off,\" Bernauer comments. Interestingly, this finding is relatively independent of how expensive certain goods are—even with cars and washing machines, renting and sharing play a lesser role. In the case of washing machines and cars, the discrepancy between supporting the idea in principle and practical implementation is somewhat smaller because these more expensive products are more likely to be repaired and recycled. In addition, decision-making experiments in the study show that the willingness to pay for goods with circular benefits is quite limited. When purchasing a product, consumers focus much more on price and service life than characteristics like repairability or recyclability. Room for maneuver for policymakers Despite the sobering overall picture, the study also provides multiple starting points for policymakers. Governmental regulations such as a duty to repair for retailers, an obligation to declare the service life or a ban on unsold products have a good chance of having majority appeal. \"A repairability label that indicates how easy a product is to repair would, however, be of limited use, especially for inexpensive goods, if repairability per se is not a decisive factor in purchasing and purchased goods are rarely repaired,\" Bernauer points out. It would probably make more sense to strengthen the demand for used goods in a targeted way, for example through financial incentives and information campaigns to emphasize the advantages for one's own wallet and the environment, adds Quoss. In this way, the sharing economy could help to save resources and costs. However, its full potential can only be realized when sharing becomes chic and buying second-hand becomes cool. More information: (In Swedish) Schweizer Umweltpanel. Achte Erhebungswelle: Kreislaufwirtschaft: Befragungszeitraum: Dezember 2021—Februar 2022, ETH Zurich (2023). DOI: 10.3929\/ethz-b-000590736","filter_flag":1}
{"title":"Circular economy: the rule of the three R's... or seven? - CEPSA.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNlcHNhLmNvbS9lbi9wbGFuZXQtZW5lcmd5LzIwMzAtZ29hbHMvY2lyY3VsYXItZWNvbm9teS10aGUtcnVsZS1vZi10aGUtcnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNlcHNhLmNvbS9lbi9wbGFuZXQtZW5lcmd5LzIwMzAtZ29hbHMvY2lyY3VsYXItZWNvbm9teS10aGUtcnVsZS1vZi10aGUtcnPSAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmNlcHNhLmNvbS9lbi9wbGFuZXQtZW5lcmd5LzIwMzAtZ29hbHMvY2lyY3VsYXItZWNvbm9teS10aGUtcnVsZS1vZi10aGUtcnPSAQA","guidislink":false,"published":"Thu, 30 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=89, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNlcHNhLmNvbS9lbi9wbGFuZXQtZW5lcmd5LzIwMzAtZ29hbHMvY2lyY3VsYXItZWNvbm9teS10aGUtcnVsZS1vZi10aGUtcnPSAQA?oc=5\" target=\"_blank\">Circular economy: the rule of the three R's... or seven?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CEPSA.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular economy: the rule of the three R's... or seven? - CEPSA.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNlcHNhLmNvbS9lbi9wbGFuZXQtZW5lcmd5LzIwMzAtZ29hbHMvY2lyY3VsYXItZWNvbm9teS10aGUtcnVsZS1vZi10aGUtcnPSAQA?oc=5\" target=\"_blank\">Circular economy: the rule of the three R's... or seven?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CEPSA.com<\/font>","source.href":"https:\/\/www.cepsa.com","source.title":"CEPSA.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"We answer some key questions to understand this production model, its implications for society and its benefits for the environment and sustainable development. In recent times, a concept that is on everyone's lips has appeared; the circular economy. However, do we really know what it’s about? This economic and production model means curtailing the use of raw materials, water and energy in the production of goods and services while minimizing waste. Unlike the linear model —based on take, make, dispose—, this system aims to maintain the value of resources in the economy, extending their useful life and using them as raw material to produce new products, thus reducing the amount of waste going to landfill and the use of natural resources, as well as saving money, promoting job creation and fostering innovation. From the consumer's point of view, the so-called seven R's rule has become popular, an evolution of the three traditional rules of the circular economy —reduce, reuse and recycle— to which four new actions have been added: redesign products through eco-design; repair, to extend the useful life of damaged products; renew products so that they have a second use; and recover waste so that it can be reused in the production process. The circular economy can be implemented at all stages of the production process. Thus, in contrast to linear models, the use of raw materials is based on other raw materials of residual origin, which are used to produce biofuels. In this way, we can obtain renewable diesel or sustainable aviation fuels (SAF) from cooking oils and agricultural waste. These are production models that companies have already implemented to promote the decarbonization of transportation. In addition, the circular economy advocates the use of renewable energies and minimizing the consumption of natural resources. One example is the use of wastewater to produce molecules such as green hydrogen, a clean energy that will play a key role in the energy transition. Circular production processes also have a special incidence on recycling, the optimization of each phase, the approach to an efficient distribution and collection system, and the development of responsible consumption habits. Waste hierarchy: from reducing consumption to energy production If, in spite of everything, waste is generated, the key is to apply hierarchical criteria for its correct management. This classification establishes an order of priority for the different alternatives that can be applied in waste management, in order to minimize the impact on the planet. First and foremost, and as the basis of the circular economy model, is the principle of reducing the amount of waste we generate or, if it is produced, avoiding the use of harmful substances during the manufacturing process. On the other hand, if these products can have a second life, they can be reused or repaired to fulfill the same purpose for which they were originally made. If we are faced with waste that cannot be used as manufactured, recycling comes into play. In this way, they are transformed into raw materials that will be used to create other products. Finally, before waste ends up in the landfill, we can opt for energy recovery, a process that converts waste that cannot be recycled into sustainable sources of energy for domestic or industrial use, either electrical or in the form of biofuels. At the governmental level, in the case of Spain, in order to deal with the large volume of waste still produced in our country (according to the National Statistics Institute (INE), in 2021 we will generate four kilograms of waste per inhabitant), the Council of Ministers approved the Law on Waste and Contaminated Soil for a Circular Economy, with the aim of \"minimizing the negative effects of waste generation and management\" and \"making efficient use of resources\". This standard, and all the initiatives put in place to address the situation, are intended to drive the transition to a circular economy model that will reduce carbon emissions and energy consumption.","filter_flag":1}
{"title":"The extent to which circular economy principles have been applied in the design of medical devices for low-resource ... - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA3OTY4NdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA3OTY4NdIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA3OTY4NdIBAA","guidislink":false,"published":"Fri, 31 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=90, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA3OTY4NdIBAA?oc=5\" target=\"_blank\">The extent to which circular economy principles have been applied in the design of medical devices for low-resource ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The extent to which circular economy principles have been applied in the design of medical devices for low-resource ... - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2Zyc3VzLjIwMjMuMTA3OTY4NdIBAA?oc=5\" target=\"_blank\">The extent to which circular economy principles have been applied in the design of medical devices for low-resource ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Healthcare facilities in low-resource settings in Sub-Saharan Africa are plagued with issues of non-functional and obsolete medical devices, which ultimately end up prematurely disposed of as waste. With increasing healthcare demands, stopping medical device disposal is imperative. One way to achieve this is to leverage circular economy principles in designing medical devices. Circular economy principles aim to retain products and their constituent materials to be reused over time in the economic system. However, to what extent this has been applied in designing medical devices specifically for low-resource settings in Sub-Saharan Africa is missing in literature. Based on a systematic review of 29 out of 1,799 screened scientific papers, we identified the use of circular economy principles of durability, maintenance, repair, and upgrade in designing medical devices for this setting. Whether these principles were intentionally applied from a circular economy approach could not be inferred in this study. The motivational basis for using these principles was to ensure medical device longevity to providing healthcare. No attention was given to the circular economy principles of refurbishment, remanufacturing, and recycling, ensuring that device components and constituent materials are recovered. These study findings serve as a launchpad for exploring how circular principles can be used to support the design of medical devices for low-resource settings in Sub-Saharan Africa. Academicians and designers of medical devices can leverage this research to contribute towards developing medical devices that support access to healthcare for people in low-resource settings and preserve earth's finite resources. 1. Introduction To provide healthcare for all, medical devices are highly needed. This need is significantly felt in low-resource settings (LRS) in Sub-Saharan Africa (SSA), which are areas with limited infrastructure, materials, supplies and human resources (Anyangwe and Mtonga, 2007; Masum et al., 2010; Aranda Jan et al., 2016). According to the World Health Organization (WHO), this region suffers from most of the world's diseases and medical devices are highly needed to overcome this burden (World Health Organization, 2017). So far, the need for medical devices in this region has primarily been met through international donations or by importing medical devices from high-income countries (Piaggio et al., 2019; Ssekitoleko et al., 2021). These devices donated or imported with the best intentions towards providing healthcare are usually not optimised to work in the LRS healthcare system (Howitt et al., 2012). Once installed, they face context-specific challenges in LRS, such as a lack of spare parts, repair or maintenance services, accessories, and consumables, which render them obsolete (Richards-Kortum and Oden, 2013; Di Pietro et al., 2020). Estimates suggest that 30–40% of medical devices in LRS are non-functional due to these context-specific challenges (Perry and Malkin, 2011; Ssekitoleko et al., 2021), resulting in their premature disposal as waste (Miesen, 2013). Apart from the fact that non-functioning devices do not contribute to improving access to healthcare, their disposal contributes to the 282,447 tonnes of waste generated by the healthcare sector in Africa each year (Udofia et al., 2015; Chisholm et al., 2021). These medical devices, which are prematurely disposed of as waste, still contain valuable parts and materials that could be reused or recycled. Given the increasing healthcare demands and population growth in SSA (United Nations Department of Economic and Social Affairs, 2017; Bigna and Noubiap, 2019), it is imperative to slow down or stop the disposal of medical devices. One of the ways to slow down or stop the disposal of medical devices is to leverage the concept of circular economy (CE). The goal of CE is to preserve the economic and environmental value of products and their constituent materials as long as possible (Bakker and Poppelaars, 2018). CE is vital for moving away from the current global linear economy. In a linear economy, materials are taken from the Earth, made into products, and eventually, at some point, thrown away as waste (Sariatli, 2017). In contrast, CE aims to eliminate “waste”. This means that products and their constituent materials that enter CE must always remain accountable. To achieve this, rethinking the design of products is critical (Hapuwatte and Jawahir, 2021). Rethinking the design of products from a CE perspective will mean first designing products to remain in their original state or as close as possible to their original state by leveraging on CE principles of physical durability and product maintenance, repair and upgrade (den Hollander, 2018). In the event that products and their constituent material reach their lifespan, they can be recovered by leveraging CE principles of recontextualisation, refurbishment, and remanufacturing. When these products cannot be recovered, they can be disintegrated and returned to their material form through the CE principle of recycling. Note that though product design is vital, it is but one factor in the transition to CE. A successful transition will require other factors such as changes in business models, government policies, rules, and regulations. However, this paper focuses only on the aspect of design. CE in the medical device design domain is not yet a distinct field. Efforts from the scientific community toward integrating CE and medical device design are only starting to emerge (Kane et al., 2018). For example, frameworks advocating for the design of medical devices for LRS to have extended lifespans are now being seen in literature (Piaggio et al., 2021b). Though this framework does not explicitly stem from the CE mindset, it, however, advocates for the extension of product lifespans which is idiosyncratic to CE. Medical devices with extended lifespans can remain functional and available to provide health care for people in need. At the industry level, Koninklijke Philips is demonstrating the use of CE principle in the design of their high-value Diamond Select X-Ray machines. These devices are designed to be reliable, durable, and can be maintained and repaired (Jensen et al., 2019; Oturu et al., 2021). The modular design of these X-ray machines allows for future upgrades, refurbishing, and remanufacturing activities to be performed, so that they can remain in use over time (Jensen et al., 2019; Oturu et al., 2021). Designing the X-ray machines while considering matters of long and extended use, recovery, and recycling, start to drive sustainable practises in the medical device domain. However, it is worth noting that such a device is an exception and is backed by financial support for several research and development iterations, not available to other medical devices. Even though the integration of CE and medical device design is still in the nascent stage, other domains and industries have gone ahead to make use of CE. For example, in Europe, a mobile phone company is leveraging on CE principles of durability, and reuse and recycling to ensure a mobile phones have multiple life cycles and consequently contribute to a positive social and environmental impact (Mestre and Cooper, 2017). Similarly, China 4.0 plan, also known as “Made-in-China 2025”, emphasises the use of CE to minimise resource input, maximise economic output, lessen the influence on the natural environment and improve resource recycling efficiency. Kenya, Uganda and Rwanda's implementation of a ban on plastic bags has attracted widespread praise from global circular economy and environmental leadership (Behuria, 2021). This ban advocated for a transition from single-use plastic disposable packaging to reusable alternatives (Ncube et al., 2021; Oberoi and Garg, 2021). Single-use plastics negatively impact the environment aesthetically and pose serious health challenges (Andrady, 2011; Stoler et al., 2012; Adam et al., 2020) and transitioning into reusable alternatives as in CE was essential. Particularly to LRS in SSA, several studies have identified CE practises. For example, the Ellen MacArthur Foundation found that in Nigeria and Ghana, repair and refurbishing of electronics for reuse, the harvesting of components for reuse in the manufacturing of new products are common place (Ellen MacArthur Foundation, 2022a). In another example, Suame Magazine Automotive Centre in Ghana leverages CE principles of repair and refurbishment in the automotive industry to keep vehicles in use over time (Ellen MacArthur Foundation, 2022a). These CE principles are used to restore and retain the value of goods and materials for as long as possible to be reused. In other cases, it is a frugal way of approaching daily life to ensure product longevity due to resource scarcity. We expect to find similar principles when looking at medical device design, such as durable and repairable designs that can ensure products are used over time. This is the starting point of this study and aims to answer the following research question: to what extent have CE principles been applied in the design of medical devices specifically for use in LRS in SSA? The answer to this question will contribute to literature on CE in Africa by showing the extent to which CE principles have been incorporated in the domain of medical device design for LRS in SSA. Similarly, this research contributes to the CE discourse in Africa by showing the gaps that need to be addressed when designing future medical devices for LRS in SSA while considering sustainability. 2. Theoretical background 2.1. Circular economy Several schools of thought have defined circular economy (CE) since its inception in the 1970s (Ellen MacArthur Foundation, 2013). The definition adopted in this paper stems from the field of industrial ecology and defines CE from a material flow perspective (Ayres, 1994; Stahel, 1994, 2010; Lifset and Graedel, 2002). That is, CE aims to preserve the economic and environmental value of products and their constituent materials as long as possible by lengthening their lifespan or looping them back into the system to be reused (Bakker and Poppelaars, 2018; Kane et al., 2018). Fundamentally, CE seeks to eliminate the notion of “waste” and ensure products and their materials re-enter the economic system at the end of their use (Kane et al., 2018; Sikdar, 2019). Although there will always be a certain amount of unavoidable “waste” (Ciacci et al., 2015), a CE intends to work towards a closed loop (Prendeville et al., 2014; Bourguignon, 2016; Hapuwatte and Jawahir, 2021). In this closed loop, resources that have entered the CE must always remain accounted for (den Hollander et al., 2017; Haupt et al., 2017). The notion of CE aims to support the shift from the “take-make-waste” linear economy (Webster, 2015; Bocken et al., 2016). In a CE, “waste” should not exist as products and materials are reused as long as possible over time. The mechanism by which products become “waste” in a linear economy is “obsolescence”—defined as a loss of perceived value of the product, which leads to it being discarded as waste (den Hollander, 2018). According to the core principles of a CE, obsolescence should not lead to waste. Instead, CE activities of “recovery”—defined as any operation with the primary aim of reversing obsolescence, should be performed (den Hollander et al., 2017). With CE activities of recovery, products and materials can be removed from their obsolete state and their perceived value restored and returned to the economic system for reuse. Recovery activities in CE can be ranked according to the “inertia” principle proposed by Walter Stahel: “Do not repair what is not broken, do not remanufacture something that can be repaired, do not recycle a product that can be remanufactured. Replace or treat only the smallest possible part in order to maintain the existing economic value of the technical system” (Stahel, 2010, p. 195). As such, keeping a product in its original state or as close as possible to the original state is at the core of CE. In product design terms, this is considered the maximisation of “product integrity”—defined as the extent to which a product remains identical to its original state over time (den Hollander, 2018). Based on the inertia principle and the concept of product integrity, product design in CE should first prevent a product from becoming obsolete. That is, designed for long and extended use. Designing products for prolonged use can be achieved by creating products with high physical and emotional durability (den Hollander, 2018). Designing products for extended use can be achieved by providing opportunities for product maintenance (also known as preventive maintenance), repair (also known as corrective maintenance) and upgrade. Secondly, design in a CE should ensure that products that have reached obsolescence can be recovered with the highest level of integrity and put back in the system for reuse. This means creating products that can be recontextualised (also known as repurposing), refurbished and remanufactured. These first two guiding principles are aimed at preserving product integrity. But, at some point, products will reach their lifetime. Product lifetime is the period that starts when a product is released for use after manufacture and ends at the moment a product becomes obsolete beyond recovery at the product level (Cooper, 1994, 2010; Babbitt et al., 2009; Brouillat, 2015). When products reach their lifetime in a CE, the last resort of recycling is needed. Recycling involves the dismantling and disintegration of a product and its constituent components and the subsequent reprocessing of the product's materials. This process is the least preferred option in CE since it destroys a product's integrity. However, it ensures that product materials are captured and looped back into the economic system for reuse. Figure 1 shows an overview of these CE principles that underpin product design with a focus on tangible durable consumer products proposed by den Hollander (2018). FIGURE 1 Figure 1. Guiding principles that underpin product design for a CE (den Hollander, 2018). 2.2. Circular economy design principles in the field of medical device design Medical devices must comply with stringent safety standards before use. Safety standards, for instance, include the safe functioning of medical devices before they are used on patients. In other cases, safety standards require medical device cleaning or reprocessing before use. The cleaning or reprocessing of medical devices involves disinfection and sterilisation processes to render a contaminated medical device hygienically safe before reuse (Großkopf and Jäkel, 2008). The disinfection or sterilisation required to render a product clean is determined by the Spaulding scale (Rutala and Weber, 2008; McDonnell and Burke, 2011). This scale categorises products according to hygiene criticality and describes the requirement for reprocessing medical devices for reuse. That is, “Critical items” (e.g., surgical devices) are those which enter tissue or the vascular system. These devices must be sterilised (all organic material removed) by high pressure or steam. “Semi-critical items” (e.g., respiratory therapy and anaesthetic equipment) come in contact with the mucus membrane and require high-level chemical disinfection before reuse. Lastly, “Non-critical items” (e.g., stethoscopes and tables) are those that do not enter the body and may be lightly disinfected before reuse. These hygienic safety standards are pertinent and must be considered during medical device design. This means that applying circular product design principles in medical device design must also comply with these safety standards and thus ensure patients' health is not endangered. So far, the aforementioned CE principles that underpin product design (as in Figure 1) have focused on consumer products, not specific on medical devices. For example, the CE principle of physical durability only considers how product performance over time degrades slower than comparable consumer products (den Hollander et al., 2017). But in the healthcare domain, medical devices designed for physical durability must withstand degradation after reprocessing over their intended lifespan (Medicare.gov, 2022). In another example, the CE principle of emotional durability concerns consumer-product relationships of attachment and how this attachment influences product replacement decisions (Page, 2014; den Hollander et al., 2017). However, a medical device's function, use or reuse is not determined by consumer-product relationships of attachment. Instead, medical devices are designed to be functional under stringent safety and regulatory standards for improving health outcomes. This CE principle of emotional durability is applicable for consumer products; however, out of scope in the medical device design domain. Table 1 shows definitions of CE design principles from a medical device perspective as derived from the literature. TABLE 1 Table 1. Circular economy design principles from a medical device perspective as inferred in literature. The definitions in Table 1 are derived from literature published by medical device regulatory and authorisation bodies. For example, Food and Drug Administration (FDA), World Health Organization (WHO) Medical Devices. These authorities are in charge with the task of defining what constitutes a medical device, its safety requirement, and its effective use or reuse (Kramer et al., 2012). As such, these are key sources to use in generating definitions on CE principles pertaining to the domain of medical devices as seen in Table 1. The CE definitions in Table 1 explicitly consider stringent safety standards that are required in the medical domain. These safety standards ensure patients' health is not put at risk in the process of improving health outcomes. The emphasis on the safety concerns in the definitions in Table 1 makes them different from CE definitions in other fields since issues of safety in improving patients' health outcomes are not required. These safety issues are critical in the medical device domain and thus important in this study that seeks to understand the extent to which CE principles have been applied in the design of medical devices for LRS in SSA. 3. Method To understand to what extent circular economy (CE) principles have been applied in the design of medical devices specifically for low-resource settings (LRS) in Sub-Saharan Africa (SSA), a systematic review was performed. Below, the review steps are outlined and graphically summarised in Figure 2. FIGURE 2 Figure 2. Summary of the systematic review process. Acronyms LRS and SSA are low-resource settings and Sub-Saharan Africa, respectively. Studies were searched in databases such as Google Scholar, Pubmed, Scopus, and IEEE Xplore. Using logical operators AND or OR, the key terms medical, device, equipment, use, design, frugal, low cost, development, implementation, low-resource settings, Sub-Saharan Africa, Africa, developing countries, low and middle-income countries, remanufacturing, repair, refurbishing, remanufacturing, recycling, circular economy, sustainability were combined and searched. The search resulted in a total of 1,799 scientific papers that mention the design of medical devices. Only studies in English were included. Next, studies were screened by title, abstract and scan reading of the text body by two reviewers according to the following criteria. 1. The study must refer to a medical device as per this research scope. That is, a medical device is “any instrument, apparatus, or appliance, manufactured specifically to be used for diagnosis, prevention, monitoring, and alleviation of disease or treatment of the human body, that are not solely pharmaceutical goods” (Moultrie et al., 2015; Aranda Jan et al., 2016; Medical Device Regulation (EU) 2017\/745, 2017). Due to our interest in hardware design for hospitals in LRS, medicines, devices for home care, vaccines, in-vitro, mHealth or eHealth, and other telecommunication systems in healthcare were out of scope in this research. 2. The study must focus on designing new medical devices or adapting existing ones specifically for use in LRS in SSA. Studies that described misuse or unintended use of medical devices in LRS in SSA were excluded. As a result, 246 studies fulfilled the above criteria. Subsequently, studies included in the full-text analysis were selected based on the third and fourth eligibility criteria. 3. The study must refer to and outline the design process of the described medical device. This criterion ensured that the medical device being described could be examined for content relating to the application of circular economy principles. 4. Lastly, the described device must have been through a prototyping stage. Consequently, 29 studies met the third and fourth inclusion criteria and were entered in MAXQDA 2020 for analysis. In MAXQDA, the 29 studies were analysed to identify CE principles (see Table 1) applied in the design of medical devices for LRS in SSA. The analysis was done by descriptive coding. During descriptive coding, a text fragment was highlighted and assigned a code (Rädiker and Kuckartz, 2020; Saldana, 2021) whenever a CE principle was mentioned (see Table 2). These text fragments that explained CE principles were identified in the selected studies by code recording units (see Table 2). A recording unit is a portion of text, sentence, word or word meanings to which an evaluator applies a code (Weber, 1990). The recording units were established in two stages. In stage one, recording units were compiled from preliminary reading through the 29 selected studies and recording keywords, text, and sentences that explained the respective CE principles as in Table 1. For example, design for “robustness” is a word that described the CE principle of “design for durability”. This process continued until the repetition of compiled recording units began to emerge. In stage two, the compiled recording units were examined by two experts with expertise in CE and medical device design. These experts examined the compiled recordings units to ensure other possible recording units were not omitted. None of the experts proposed the removal of any recording unit. Similarly, no new recording unit was proposed by the experts. TABLE 2 Table 2. Circular economy principles, codes and their respective recording units used in the coding process. Using the established codes and recording unit, the analysis of the 29 studies by descriptive coding was performed by two persons. This was done to avoid confusion or misalignment of terms and definitions during the coding process. After the first coding round, a second and third iteration was conducted and finalised (see Supplementary material 1 for the coded segments). The outcome of the systematic review produced an overview of the different CE principles applied in the design of medical devices for LRS, as detailed in the results section. 4. Results Seeking to understand the extent to which circular economy (CE) principles have been applied in the design of medical devices specifically for use in low-resource settings (LRS) in Sub-Saharan Africa (SSA), a systematic review was performed. This review analysed 29 scientific papers. These studies were published between 2006 and 2021 and described the design of 45 medical devices with different hygienic criticality and value (see Table 3). Examples of these 45 devices included a surgical suction pump, wrist flexion contracture, phototherapy unit, blood salvage device, custom-designed implants, a vest for treating jaundice, bubble continuous positive airway pressure—(bCPAP), low field MRI, electrosurgical unit, mechanically powered wound-pump, oxygen delivery system and many others. See Table 3 for the complete list of medical devices. Overall, 55.6% (25) of the devices were electromechanical (i.e., comprised electrical and mechanical parts), and 44.4% (20) were purely mechanical (i.e., had no electronic components). All 45 devices were designed for reuse. None of the devices was designed for single use (i.e., disposable). TABLE 3 Table 3. The CE principles applied in the design of medical devices for LRS in SSA as pinpointed in the literature. The review revealed two key findings. Firstly, medical device design for LRS in SSA significantly took into account CE principles aimed at ensuring medical device longevity. As noticed in Table 3, all 29 studies reviewed in this study made use of design for long use by ensuring product durability. Design for extending device use through maintenance was identified in 18 studies, repair in 12, and upgrade in 10. Whether these principles were intentionally applied from a CE thinking approach could not be inferred in this study. We observe that these principles aimed at product longevity were intended to ensure that medical devices are available to provide healthcare. This is, for example, demonstrated in one of the studies reviewed in this study whereby an electrosurgical unit which is often lacking in LRS, is designed to be durable, repairable, upgradable, and reusable over time even in conditions of electrical failures (Oosting et al., 2020). In the event of electrical failures, this electrosurgical unit can be repaired and upgraded by using local foot-paddle power technology to keep it functioning and thus provide surgical healthcare service for people in LRS in SSA. In another example, we observe the adaptation of existing medical devices for use in LRS. For instance, the 3D printing of components or spare parts in rural Kenya to ensure obsolete medical devices can remain functional towards providing healthcare in LRS. Secondly and most remarkably, the CE principle of recovery through recontextualisation (repurposing) could be inferred in five of the 29 studies used (see Table 3). CE principles of recovery through refurbishment, remanufacturing and recycling could not be identified in any of the studies. The reason why these recovery and recycling principles were not considered could not be inferred in this study. 5. Discussion The starting point for our study was the observation that principles of circular economy (CE) can be instrumental in ensuring medical devices designed for low-resource settings (LRS) in Sub-Saharan Africa (SSA) do not end up as waste. However, to what extent these principles have been applied in designing medical devices for LRS was missing in literature. We performed a systematic review to fill this gap. As expected, we observed that the design of medical devices for LRS in SSA significantly took into account CE principles aimed at ensuring medical device longevity. The motivational basis for using these principles aimed at medical device longevity is different from the environmental or resource conservation motivations implicitly assumed in the current academic literature on CE. The reason is to ensure that medical devices are available, functional, and used over time to provide access to healthcare, a fundamental human need. Moreover, in so doing so, we see the use of CE design principles such as durability, maintenance, repair, upgrade and recontextualisation that also aim at resource conservation and retaining products to be used over time. Whether these principles were intentionally applied from a CE thinking approach could not be inferred in this study. Other studies have noticed similar patterns in LRS in SSA where the unavailability of resources has led to CE practises aimed at retaining or restoring the value of goods for as long as possible without necessarily linking them to the term “CE”. For example, Korsunova and colleagues noticed resource scarcity in LRS that resulted in “necessity-driven CE” practises such as “repair” and “reuse” to retain the goods in circulation for as long as possible (Korsunova et al., 2022). This necessity-driven CE practise adopts a mindset that looks at the long-term functionality of goods and materials that are often unavailable. As expected, this was also seen in this study whereby in providing medical devices that are often unavailable, CE principles that retain the product to be used over time are taken into account. Designing medical devices for LRS to remain in use over a long time is certainly valuable. This can ensure that healthcare facilities in this region have access to medical devices to provide healthcare. On the other hand, what happens when these medical devices reach their end of life or become obsolete? Besides, a product can be declared obsolete prematurely though still functional. For example, a product can be declared obsolete if outperformed by a newer product (i.e., technological obsolescence) (Clay Whybark, 2007; Kane et al., 2018) or no longer legal to be used (i.e., regulatory obsolescence). In another case, a product might become obsolete when its use is no longer profitable (i.e., economic obsolescence) (Kane et al., 2018). These different forms of obsolescence might push medical devices designed for longevity to be obsolete and end up disposed of as waste. As such, it is important to consider processes that ensure medical devices that become obsolete or reach end of life can be recovered and put back in the economic system for reuse. For example, recovery through refurbishment, remanufacturing, or recycling of medical devices. Products designed to be recovered and recycled can continue circulating in the economic system at the highest value and not end up disposed of as waste (Mangers et al., 2021; Ellen MacArthur Foundation, 2022b). Most remarkably, this study revealed that CE principles ensuring medical devices can be recovered through refurbishment, remanufacturing, and recycling could not be inferred in any of the studies reviewed. Refurbishment and remanufacturing may have value for medical devices. For example, refurbishment and remanufacturing activities can ensure that medical devices can be recovered and rejuvenated and used again (Steinhilper and Weiland, 2015; Oturu et al., 2022). Similarly, refurbishment and remanufacturing processes can ensure essential product components are brought back to the original condition (Eze et al., 2019, 2020; Boorsma et al., 2021; Oturu et al., 2022) to be reused again. Refurbishment and remanufacturing activities are already happening in LRS in SSA for other electronic devices. For example, the Otigba computer village in Nigeria, a hub for new and used imported computers, and refurbished devices, has over 2,500 daily sales, including assembling, repairing, and refurbishing units for computers (Zeng, 2008). In Accra and Lagos alone, the repair, refurbishment and remanufacture sector generates income for more than 30,000 people (Schluep et al., 2012). Refurbishment and remanufacturing present a real economic opportunity for LRS in SSA though barriers remain. Specific to LRS in SSA, Oturu et al. (2022) described some barriers regarding refurbishment and remanufacturing of medical devices. Among these barriers, are the lack of legislation and infrastructure to support the remanufacturing of medical devices (Oturu et al., 2022). Similarly, the lack of established medical device Original Equipment Manufacturers (OEM) in SSA that can provide refurbishment or remanufacturing services (Oturu et al., 2022). However, this review could not identify whether these barriers were the reasons for not considering the CE principles of refurbishment or remanufacturing. Also, the type of medical devices which are most commonly refurbished or remanufactured are devices that are of high value (e.g., Magnetic resonance imaging machine) (Dremed, 2015; Kane et al., 2018; Guzzo et al., 2020). In other cases, small and medium-valued equipment is refurbished by replacing specific components (Kruger, 2008). Based on this rationale, we can speculate that some of the devices designed for longevity, as per this study (see Table 3), can also benefit from refurbishment and remanufacturing processes. For example, the high-value devices mentioned in Table 3. However, another factor influencing whether a device can be refurbished or remanufactured includes financial considerations (Guzzo et al., 2020). That is, whether it is financially viable to recover the product or to discard and replace it. Similarly, hygienic criticality is another factor frequently considered when recovering medical devices. High-criticality devices must be hygienically recovered to be refurbished or remanufactured using more aggressive chemical decontamination or sterilisation processes than low- or medium-criticality devices (Kane et al., 2018). This will mean designing devices with materials which can withstand such chemical decontamination or sterilisation processes (Kane et al., 2018). The CE principle of recycling in design is also critical to ensure that medical devices and their constituent material are conserved in the economic system. Though none of the studies reviewed mentioned the use of this principle in designing medical devices for LRS in SSA, it is essential to consider them in the future. This is because recycling which is the last resort for resource conservation can ensure a product's constituent materials stay in the economic system and do not end up as waste (Allwood, 2014; Mangers et al., 2021; Ellen MacArthur Foundation, 2022b). For example, recycling electronics allows for precious and unique metals to be recovered and thus reducing the environmental impact associated with electronic manufacturing from raw materials (Namias, 2013). In essence, all the devices identified in this study (see Table 3) could benefit from recycling processes. Recycling processes and infrastructure are present in LRS in SSA (Korsunova et al., 2022) and can support recycling of medical and other electronic devices. For example, the WEEE centre (Ongondo, 2013; Vanegas et al., 2014; WEEE Centre, n.d.) in Kenya provides electronic waste recycling services in East and Central Africa and the Hinckley recycling centre in Lagos, Nigeria, provides recycling of electronic services in West Africa (Nnorom and Odeyingbo, 2020; Hinckley Associates, 2022). These recycling services include collection, sorting and separating electronic waste to be reused or broken down into raw material form. Similarly, the company Mr. Green Africa provides plastic recycling services in East and Central Africa (Mr. Green Africa, 2022). Its services include collecting, sorting, pelletising, trading and reprocessing recycled plastics into high-quality products (Mr. Green Africa, 2022). With such recycling infrastructures, capturing medical devices' material value is possible in LRS in SSA. The limitation of our study is that it only investigates the extent to which CE principles have been applied in the design of medical devices for LRS from a scientific literature review perspective. CE design principles could also be implemented at the industry level and has yet to make its way into scientific literature. We speculate that investigating the same topic using industry case inquiry methods can reveal new findings on the extent to which CE has been applied in designing medical devices for LRS in SSA. 6. Conclusion This study is an endeavour to understand to what extent Circular Economy (CE) principles have been applied in the design of medical devices, specifically for low-resource settings (LRS) in Sub-Saharan Africa (SSA). Based on a systematic review and as expected, this study shows that CE principles of durability, repair, maintenance, and upgrade and medical device longevity can be inferred in the domain of medical device design for LRS in SSA. Whether these principles were intentionally applied from a CE approach could not be inferred in this study. The motivation for using these principles is to ensure medical devices are available to provide access to healthcare in LRS as opposed to the environmental or material flow motivation often found in CE literature. The motivational basis towards providing healthcare for people should remain a core aspect when designing medical devices for LRS in SSA. This research further revealed that other CE principles that ensure medical devices and constituent materials are recovered (i.e., through refurbishment and remanufacturing) and recycled were hardly taken into account. Underlying reasons for this could not be established in this review. This, therefore, presents an opportunity for further research. It is vital to understand why CE principles of refurbishment, remanufacturing, and recycling are not considered when designing medical devices for LRS. And what needs to be in place if these CE principles were considered in medical device design? The findings in this study are intended to be used as a starting point to explore how CE principles can be used to support the design of medical devices for LRS in SSA. This study now provides insights into the extent to which CE has inadvertently been applied in designing medical devices for LRS in SSA. It further shows the gaps in the lack of attention to recovery and recycling considerations when designing medical devices for LRS in SSA. Designers of medical devices can leverage this research to contribute towards developing medical devices that support access to healthcare for people in LRS and preserve earth's finite resources. 6.1. Implications of this research to academicians and practicians This study shows CE design principles are incorporated in medical device design for LRS, and a firm grasp of the concept can be instrumental and ensure that medical devices continue to be designed for longevity and do not end up disposed of as waste into the environment. Academicians and medical device designers can explore how CE as a concept can be integrated in the design of medical devices that can remain used over time to provide healthcare for people in LRS. For example, developing methods or approaches that can guide medical device design while explicitly considering CE aspects that benefit people in LRS and the environment. Established medical device design frameworks for LRS could also be updated to explicitly take into account these CE aspects. For example, A Framework for Designing Medical Devices Resilient to Low-Resource Settings (Piaggio et al., 2021b) and Towards A Framework for Holistic Contextual Design for Low-Resource Settings (Aranda Jan et al., 2016). Design is only one factor that can ensure CE is implemented in the domain of medical device design. Other factors such as policies and regulations are equally needed to for example incentivise a CE thinking approach in the design and use of medical devices in LRS in SSA. Academicians and policymakers can put forward policies and regulations that support the design of medical devices that can remain used over time in LRS to save lives while preserving the environment. For example, regulations that incentivise the remanufacturing, refurbishment, and recycling of medical devices. So far, these CE principles are yet to be implemented in the design of medical devices for LRS as per this study. Author contributions KS determined the overall structure of the article, wrote the manuscript, and managed co-author inputs from RO, CB, and JCD. All authors reviewed the research design and interpretation and provided recommendations for critical content. All authors read and approved the final manuscript. Acknowledgments We thank the Faculty of Industrial Design Engineering at the Delft University of Technology for their support in conducting this research. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https:\/\/www.frontiersin.org\/articles\/10.3389\/frsus.2023.1079685\/full#supplementary-material References Abu-Zaineh, R., and Gershenson, J. (2020). “Medical device spare part pricing strategy analysis for developing nations,” in 2020 IEEE Global Humanitarian Technology Conference (GHTC) (Seattle, WA), 1–5. doi: 10.1109\/GHTC46280.2020.9342869 CrossRef Full Text | Google Scholar Adam, I., Walker, T. R., Bezerra, J. C., and Clayton, A. (2020). Policies to reduce single-use plastic marine pollution in West Africa. Marine Policy 116, 103928. doi: 10.1016\/j.marpol.2020.103928 CrossRef Full Text | Google Scholar Agbana, T., Oladepo, O., Vdovin, G., Oyibo, W., Van, G.-Y., and Diehl, J. C. (2019). “Schistoscope: towards a locally producible smart diagnostic device for Schistosomiasis in Nigeria,” in 2019 IEEE Global Humanitarian Technology Conference (Seattle, WA). Google Scholar Allwood, J. M. (2014). “Chapter 30 - squaring the circular economy: the role of recycling within a hierarchy of material management strategies,” in Handbook of Recycling, eds E. Worrell, and M. A. Reuter (Boston, MA: Elsevier), 445–477. Google Scholar Anyangwe, S. C. E., and Mtonga, C. (2007). Inequities in the global health workforce: the greatest impediment to health in sub-Saharan Africa. Int. J. Environ. Res. Public Health 4, 93–100. doi: 10.3390\/ijerph2007040002 PubMed Abstract | CrossRef Full Text | Google Scholar Aranda Jan, C. B., Jagtap, S., and Moultrie, J. (2016). Towards a framework for holistic contextual design for low-resource settings. Int. J. Design 10, 43–63. doi: 10.17863\/CAM.7254 CrossRef Full Text | Google Scholar Ayah, R., Ong'ech, J., Mbugua, E. M., Kosgei, R. C., Waller, K., and Gathara, D. (2020). Responding to maternal, neonatal and child health equipment needs in Kenya: a model for an innovation ecosystem leveraging on collaborations and partnerships. BMJ Innovat. 6, 391. doi: 10.1136\/bmjinnov-2019-000391 PubMed Abstract | CrossRef Full Text | Google Scholar Ayres, R. U. (1994). Industrial Metabolism: Theory and Policy. The Greening of Industrial Ecosystems. Washington, DC: National Academy Press, 23–37. Google Scholar Babbitt, C. W., Kahhat, R., Williams, E., and Babbitt, G. A. (2009). Evolution of product lifespan and implications for environmental assessment and management: a case study of personal computers in higher education. Environ. Sci. Technol. 43, 5106–5112. doi: 10.1021\/es803568p PubMed Abstract | CrossRef Full Text | Google Scholar Bakker, C., and Poppelaars, R. (2018). Design for product integrity in a circular economy. Design. Circ. Econ. 148–156. doi: 10.4324\/9781315113067-14 CrossRef Full Text | Google Scholar Battinelli, E., Holmquest, K., Musso, J., Singh, P., and Dougherty, E. (2012). “Low cost, low power 12VDC surgical suction device for use in developing countries,” in 2012 IEEE Global Humanitarian Technology Conference (Seattle, WA), 342–344. doi: 10.1109\/GHTC.2012.51 CrossRef Full Text | Google Scholar Behuria, P. (2021). Ban the (plastic) bag? Explaining variation in the implementation of plastic bag bans in Rwanda, Kenya and Uganda. Environ. Plann. C Polit. Space 39, 1791–1808. doi: 10.1177\/2399654421994836 CrossRef Full Text | Google Scholar Berges, A. J., Callanan, M., Zawicki, V., Shi, R., Athey, T., Ayyappan, V., et al. (2020). A novel intermediate attachment to reduce contamination in reusable core needle biopsy devices. J. Med. Devices Transact. ASME 14, 1. doi: 10.1115\/1.4045967 CrossRef Full Text | Google Scholar Boorsma, N., Balkenende, R., Bakker, C., Tsui, T., and Peck, D. (2021). Incorporating design for remanufacturing in the early design stage: a design management perspective. J. Remanufact. 11, 25–48. doi: 10.1007\/s13243-020-00090-y CrossRef Full Text | Google Scholar Booysen, G. J., van der Merwe, A. F., and de Beer, D. J. (2019). Additive manufacturing for sustainable custom-designed implants. South Afr. J. Ind. Eng. 30, 21–31. doi: 10.7166\/30-3-2266 CrossRef Full Text | Google Scholar Bourguignon, D. (2016). Closing the Loop: New Circular Economy Package. Google Scholar Bradley, B., Cheng, Y.-L., Peel, D., Mullally, S., and Howie, S. (2011). “Assessment of power availability and development of a low-cost battery-powered medical oxygen delivery system: for use in low-resource health facilities in developing countries,” in 2011 IEEE Global Humanitarian Technology Conference (Seattle, WA), 148–153. doi: 10.1109\/GHTC.2011.25 CrossRef Full Text | Google Scholar Brouillat, E. (2015). Live fast, die young? Investigating product life spans and obsolescence in an agent-based model. J. Evol. Econ. 25, 447–473. doi: 10.1007\/s00191-014-0385-1 CrossRef Full Text | Google Scholar Brown, J., Machen, H., Kawaza, K., Mwanza, Z., Iniguez, S., Lang, H., et al. (2013). A high-value, low-cost bubble continuous positive airway pressure system for low-resource settings: technical assessment and initial case reports. PLoS ONE 8, e53622. doi: 10.1371\/journal.pone.0053622 PubMed Abstract | CrossRef Full Text | Google Scholar Chisholm, J. M., Zamani, R., Negm, A. M., Said, N., Abdel daiem, M. M., Dibaj, M., et al. (2021). Sustainable waste management of medical waste in African developing countries: a narrative review. Waste Manag. Res. 39, 1149–1163. doi: 10.1177\/0734242X211029175 PubMed Abstract | CrossRef Full Text | Google Scholar Cooper, T. (1994). Beyond Recycling: The Longer Life Option. London: New Economics Foundation. Google Scholar Cooper, T. (2010). “The significance of product longevity,” in Longer Lasting Products: Alternatives to the Throwaway Society, ed T. Cooper (Surrey: Gower Publishing), 3–36. Google Scholar den Hollander, M. C. (2018). Design for Managing Obsolescence: A Design Methodology for Preserving Product Integrity in a Circular Economy. Delft: Delft University of Technology. doi: 10.4233\/uuid:3f2b2c52-7774-4384-a2fd-7201688237af CrossRef Full Text | Google Scholar den Hollander, M. C., Bakker, C. A., and Hultink, E. J. (2017). Product design in a circular economy: development of a typology of key concepts and terms. J. Ind. Ecol. 21, 517–525. doi: 10.1111\/jiec.12610 CrossRef Full Text | Google Scholar Di Pietro, L., Piaggio, D., Oronti, I., Maccaro, A., Houessouvo, R. C., Medenou, D., et al. (2020). A framework for assessing healthcare facilities in low-resource settings: field studies in Benin and Uganda. J. Med. Biol. Eng. 40, 526–534. doi: 10.1007\/s40846-020-00546-3 CrossRef Full Text | Google Scholar Diehl, J. C., van Doesum, F., Bakker, M., van Gijzen, M., O'Reilly, T., Muhumuza, I., et al. (2020). “The embodiment of low-field MRI for the diagnosis of infant hydrocephalus in Uganda,” in 2020 IEEE Global Humanitarian Technology Conference (GHTC) (Seattle, WA), 1–8. doi: 10.1109\/GHTC46280.2020.9342879 CrossRef Full Text | Google Scholar Ditai, J., Barry, A., Burgoine, K., Mbonye, A. K., Wandabwa, J. N., Watt, P., et al. (2021). The babysaver: design of a new device for neonatal resuscitation at birth with intact placental circulation. Children 8. doi: 10.3390\/children8060526 PubMed Abstract | CrossRef Full Text | Google Scholar Dremed (2015). Refurbished Medical Equipment Options for Healthcare Facilities. Available online at: https:\/\/www.dremed.com\/catalog\/index.php\/cPath\/45_674 (accessed September 23, 2022). Ellen MacArthur Foundation (2013). Towards the circular economy. J. Ind. Ecol. 2, 23–44. Ellen MacArthur Foundation (2022a). Circular Economy in Africa: Examples and Opportunities. Available online at: https:\/\/ellenmacarthurfoundation.org\/circular-economy-in-africa\/overview (accessed September 21, 2022). Ellen MacArthur Foundation (2022b). Circular Economy Introduction. Available online at: https:\/\/ellenmacarthurfoundation.org\/topics\/circular-economy-introduction\/overview (accessed August 5, 2022). Google Scholar Eze, S., Ijomah, W., and Wong, T. C. (2019). Accessing medical equipment in developing countries through remanufacturing. J. Remanufactur. 9, 207–233. doi: 10.1007\/s13243-018-0065-7 CrossRef Full Text | Google Scholar Eze, S., Ijomah, W., and Wong, T. C. (2020). Remanufacturing: a potential sustainable solution for increasing medical equipment availability. J. Remanufactur. 10, 141–159. doi: 10.1007\/s13243-020-00080-0 CrossRef Full Text | Google Scholar Food and Drug Administration (2019). FDA Report on the Quality, Safety, and Effectiveness of Servicing of Medical Devices. Google Scholar Großkopf, V., and Jäkel, C. (2008). Legal framework conditions for the reprocessing of medical devices. GMS Krankenhhyg Interdiszip 3, Doc24. PubMed Abstract | Google Scholar Guzzo, D., Carvalho, M. M., Balkenende, R., and Mascarenhas, J. (2020). Circular business models in the medical device industry: paths towards sustainable healthcare. Resour. Conserv. Recycl. 160, 104904. doi: 10.1016\/j.resconrec.2020.104904 CrossRef Full Text | Google Scholar Haupt, M., Vadenbo, C., and Hellweg, S. (2017). Do we have the right performance indicators for the circular economy?: Insight into the swiss waste management system. J. Ind. Ecol. 21, 615–627. doi: 10.1111\/jiec.12506 CrossRef Full Text | Google Scholar Hinckley Associates (2022). Collect & Recycle Service. HP Service Center, Lagos - Nigeria. Available at: https:\/\/hinckley.com.ng\/collect-and-recycle-service\/ (accessed August 17, 2022). Kenney, M., Ramirez, K., alibbala, Ackers,, L., and Ssekitoleko, R. (2019). Prosthetics Services in Uganda -A Series of Studies to Inform the Design of a Low Cost, but Fit-for-Purpose, Body-Powered Prosthesis. Geneva: World Health Organization. Available online at: https:\/\/usir.salford.ac.uk\/id\/eprint\/52174 Google Scholar Korsunova, A., Halme, M., Kourula, A., Levänen, J., and Lima-Toivanen, M. (2022). Necessity-driven circular economy in low-income contexts: how informal sector practices retain value for circularity. Global Environ. Change 76, 102573. doi: 10.1016\/j.gloenvcha.2022.102573 CrossRef Full Text | Google Scholar Kruger, C. M. (2008). Processing single-use medical devices for use in surgery-importance, status quo and potential. GMS Krankenhhyg Interdisziplinar 3. PubMed Abstract | Google Scholar Lawn, J., Wyatt, J., Woods, D., Bezuidenhout, H., Lawn, J., Wyatt, J., et al. (2006). “Poster 3: are you blue yet? Developing low cost, alternative powered pulse oximetry for ill babies and children,” in 2006 The 4th Institution of Engineering and Technology Seminar on Appropriate Healthcare Technologies for Developing Countries (London), 83–88. Google Scholar Lifset, R., and Graedel, T. E. (2002). “Industrial ecology: goals and definitions,” in A Handbook of Industrial Ecology (Elgar Online from Edward Elgar Publishing), 3–15. doi: 10.4337\/9781843765479.00009 CrossRef Full Text | Google Scholar Mangers, J., Minoufekr, M., Plapper, P., and Kolla, S. (2021). An innovative strategy allowing a holistic system change towards circular economy within supply-chains. Energies 14, 4375. doi: 10.3390\/en14144375 CrossRef Full Text | Google Scholar Medical Device Act 2012 (Act 737) M. of H. Malaysia (n.d.). GRPMD - Medical Device Authority (MDA). Available online at: https:\/\/www.mda.gov.my\/announcement\/275-grpmd.html (accessed October 10 2022). Medical Device Regulation (EU) 2017\/745. (2017). Regulation (EU) 2017\/745 of the European Parliament and of the Council of 5 April 2017 on medical devices, amending Directive 2001\/83\/EC, Regulation (EC) No 178\/2002 and Regulation (EC) No 1223\/2009 and repealing Council Directives 90\/385\/EEC and 93\/42\/EEC (Text with EEA relevance). Available online at: https:\/\/eur-lex.europa.eu\/eli\/reg\/2017\/745\/oj (accessed March 9, 2022). Google Scholar Medicare.gov (2022). Durable Medical Equipment Coverage. Available online at: https:\/\/www.medicare.gov\/coverage\/durable-medical-equipment-dme-coverage (accessed May 9, 2022). Google Scholar Mestre, A., and Cooper, T. (2017). Circular product design. A multiple loops life cycle design approach for the circular economy. Design J. 20, S1620–S1635. doi: 10.1080\/14606925.2017.1352686 CrossRef Full Text | Google Scholar Miesen, M. (2013). The Inadequacy of Donating Medical Devices to Africa. The Atlantic. Available at: https:\/\/www.theatlantic.com\/international\/archive\/2013\/09\/the-inadequacy-of-donating-medical-devices-to-africa\/279855\/ (accessed December 2 2021). Google Scholar Mody, G. N., Mutabazi, V., Zurovcik, D. R., Bitega, J. P., Nsanzimana, S., Harward, S. H., et al. (2015). Design, testing, and scale-up of medical devices for global health: negative pressure wound therapy and non-surgical male circumcision in Rwanda. Global. Health 11, 20. doi: 10.1186\/s12992-015-0101-4 PubMed Abstract | CrossRef Full Text | Google Scholar Moultrie, J., Sutcliffe, L., and Maier, A. (2015). Exploratory study of the state of environmentally conscious design in the medical device industry. J. Clean. Prod. 108, 363–376. doi: 10.1016\/j.jclepro.2015.06.014 CrossRef Full Text | Google Scholar Mr. Green Africa (2022). Mr. Green Africa| Plastic Recycling. Kenya. mrgreenafrica. Available online at: https:\/\/www.mrgreenafrica.com (accessed October 11, 2022). Mucha, A., Dubbink, J. H., Persaud, S., Athiban, A. S., and Diehl, J. C. (2021). “Improving the use of surgical suction pumps in Sierra Leone,” in 2021 IEEE Global Humanitarian Technology Conference (GHTC) (Seattle, WA), 119–126. doi: 10.1109\/GHTC53159.2021.9612501 CrossRef Full Text | Google Scholar Namias, J. (2013). The Future of Electronic Waste Recycling in the United States: Obstacles and Domestic Solutions. Columbia University. Google Scholar Nnorom, I. C., and Odeyingbo, O. A. (2020). “14 - Electronic waste management practices in Nigeria,” in Handbook of Electronic Waste Management, eds M. N. V. Prasad, M. Vithanage, and A. Borthakur (Oxford: Butterworth-Heinemann), 323–354. Google Scholar Oberoi, G., and Garg, A. (2021). Single-use plastics: a roadmap for sustainability? Supremo Amicus 24, 585. Google Scholar Ongondo, F. O. (2013). Trends, Challenges and Innovation in Management of WEEE in Kenya. Available online at: https:\/\/eprints.soton.ac.uk\/358484\/ (accessed August 5, 2022). Google Scholar Oosting, R. M., Ouweltjes, K., Hoeboer, M. D. B., Hesselink, L., Madete, J., Diehl, J., et al. (2020). A context-specific design of an electrosurgical unit and monopolar handheld to enhance global access to surgical care: a design approach based on contextual factors. J. Med. Device. 14, 12. doi: 10.1115\/1.4045966 CrossRef Full Text | Google Scholar Oturu, K., Ijomah, W., Broeksmit, A., Reig, D. H., Millar, M., Peacock, C., et al. (2021). Investigation of remanufacturing technologies for medical equipment in the UK and context in which technology can be exported in the developing world. J. Remanufactur. 11, 227–242. doi: 10.1007\/s13243-021-00102-5 CrossRef Full Text | Google Scholar Oturu, K., Ijomah, W., Orr, A., Verpeaux, L., Broadfoot, B., Clark, S., et al. (2022). Remanufacturing of single-use medical devices: a case study on cross-border collaboration between the UK and Nigeria. Health Technol. 12, 273–283. doi: 10.1007\/s12553-022-00641-2 PubMed Abstract | CrossRef Full Text | Google Scholar Perry, L., and Malkin, R. (2011). Effectiveness of medical equipment donations to improve health systems: how much medical equipment is broken in the developing world? Med. Biol. Eng. Comput. 49, 719–722. doi: 10.1007\/s11517-011-0786-3 PubMed Abstract | CrossRef Full Text | Google Scholar Piaggio, D., Andellini, M., Taher, M., and Pecchia, L. (2021a). “A vest for treating jaundice in low-resource settings,” in 2021 IEEE International Workshop on Metrology for Industry 4.0 IoT (MetroInd4.0 IoT) (Rome), 122–127. doi: 10.1109\/MetroInd4.0IoT51437.2021.9488431 CrossRef Full Text | Google Scholar Piaggio, D., Medenou, D., Houessouvo, R. C., and Pecchia, L. (2019). “Donation of medical devices in low-income countries : preliminary results from field studies,” in IFMBE Proceedings (Banja Luka: International Federation for Medical and Biological Engineering), 423–427. Google Scholar Prendeville, S., Sanders, C., Sherry, J., and Costa, F. (2014). Circular Economy: Is It Enough. Wales: EcoDesign Centre, 21. Google Scholar Pretorius, H. S., and Ferreira, N. (2021). Orthopedic implant design from concept to final tested product: a design surgeon's experience. J. Limb Length. Reconstruct. 7, 45. doi: 10.4103\/jllr.jllr_2_21 CrossRef Full Text | Google Scholar Rädiker, S., and Kuckartz, U. (2020). Focused Analysis of Qualitative Interviews With MAXQDA. Berlin: MAXQDA Press. Google Scholar Rutala, W. A., and Weber, D. J. (2008). Guideline for disinfection and sterilization in healthcare facilities. Centre for Disease Control and Prevention (CDC). PubMed Abstract | Google Scholar Saldana, J. (2021). The Coding Manual for Qualitative Researchers. London: SAGE. Google Scholar Sariatli, F. (2017). Linear economy versus circular economy: a comparative and analyzer study for optimization of economy for sustainability. Visegrad J. Bioecon. Sustain. Dev. 6, 31–34. doi: 10.1515\/vjbsd-2017-0005 CrossRef Full Text | Google Scholar Schluep, M., Terekhova, T., Manhart, A., Muller, E., Rochat, D., and Osibanjo, O. (2012). Where are WEEE in Africa? Berlin: IEEE. Google Scholar Schopman, S., Kalchthaler, K., Malthern, R., Mehta, K., and Butler, P. (2013). Ruggedising biomedical devices for field-testing in resource-constrained environments: context, issues and solutions. J. Human. Eng. 2, 17–26. doi: 10.36479\/jhe.v2i1.17 CrossRef Full Text | Google Scholar Sikdar, S. (2019). Circular economy: is there anything new in this concept? Clean. Technol. Environ. Policy 21, 1173–1175. doi: 10.1007\/s10098-019-01722-z CrossRef Full Text | Google Scholar Sluiter, M., Onasanya, A., Oladepo, O., van Engelen, J., Keshinro, M., Agbana, T., et al. (2020). “Target product profiles for devices to diagnose urinary schistosomiasis in Nigeria,” in 2020 IEEE Global Humanitarian Technology Conference (GHTC) (Seattle, WA), 1–8. doi: 10.1109\/GHTC46280.2020.9342953 CrossRef Full Text | Google Scholar Ssekitoleko, R. T., Arinda, B. N., Oshabahebwa, S., Namuli, L. K., Mugaga, J., Namayega, C., et al. (2021). The status of medical devices and their utilization in 9 tertiary hospitals and 5 research institutions in Uganda. GlobalCE 4, 15–25. doi: 10.31354\/globalce.v4i3.127 CrossRef Full Text | Google Scholar Stahel, W. R. (1994). The Utilization-Focused Service Economy: Resource Efficiency and Product-Life Extension. The Greening of Industrial Ecosystems (Washington, DC: National Academy Press), 178–190. Google Scholar Stahel, W. R. (2010). The Performance Economy. London: Palgrave Macmillan UK. Google Scholar Steinhilper, R., and Weiland, F. (2015). Exploring new horizons for remanufacturing an up-to-date overview of industries, products and technologies. Pro. CIRP 29, 769–773. doi: 10.1016\/j.procir.2015.02.041 CrossRef Full Text | Google Scholar United Nations and Department of Economic and Social Affairs (2017). World Population Prospects: The 2017 Revision, Key Findings and Advance Tables. Working Paper No. ESA\/P\/WP\/248 ed. Department of Economics and Social Affairs PD. New York, NY. Google Scholar Vanegas, P., Peeters, J. R., Plessers, F., Cattrysse, D., and Duflou, J. R. (2014). Synergizing industrialized and developing countries to improve resource recovery for e–waste: case study Belgium–Kenya. Proc. CIRP 15, 283–288. doi: 10.1016\/j.procir.2014.06.089 CrossRef Full Text | Google Scholar Vargas, J., Mayegga, E., Nuwas, E., Ellegala, D. B., Kucia, E. J., and Nicholas, J. (2013). Brain surgery in the bush: adapting techniques and technology to fit the developing world. World Neurosurg. 80, E91–E94. doi: 10.1016\/j.wneu.2012.01.033 PubMed Abstract | CrossRef Full Text | Google Scholar Weber, R. P. (1990). Basic Content Analysis. Newbury Park, CA: Sage. Google Scholar Webster, K. (2015). The Circular Economy. A Wealth of Flows. Cowes: Ellen MacArthur Foundation Publishing, 16. PubMed Abstract | Google Scholar WEEE Centre (n.d.). WEEE Centre. Waste Electrical Electronic Equipment Centre. Weeecentre. Available online at: https:\/\/weeecentre.com\/ (accessed August 17 2022). World Health Organization (2011). Medical Equipment Maintenance Programme Overview. Geneva. Google Scholar World Health Organization (2017). Leave No One Behind: Strengthening Health Systems for UHC and the SDGs in Africa. Geneva. Google Scholar","filter_flag":1}
{"title":"The circular cement value chain: Decarbonizing cement - McKinsey","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5tY2tpbnNleS5jb20vaW5kdXN0cmllcy9lbmdpbmVlcmluZy1jb25zdHJ1Y3Rpb24tYW5kLWJ1aWxkaW5nLW1hdGVyaWFscy9vdXItaW5zaWdodHMvdGhlLWNpcmN1bGFyLWNlbWVudC12YWx1ZS1jaGFpbi1zdXN0YWluYWJsZS1hbmQtcHJvZml0YWJsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5tY2tpbnNleS5jb20vaW5kdXN0cmllcy9lbmdpbmVlcmluZy1jb25zdHJ1Y3Rpb24tYW5kLWJ1aWxkaW5nLW1hdGVyaWFscy9vdXItaW5zaWdodHMvdGhlLWNpcmN1bGFyLWNlbWVudC12YWx1ZS1jaGFpbi1zdXN0YWluYWJsZS1hbmQtcHJvZml0YWJsZdIBAA?oc=5","id":"CBMimwFodHRwczovL3d3dy5tY2tpbnNleS5jb20vaW5kdXN0cmllcy9lbmdpbmVlcmluZy1jb25zdHJ1Y3Rpb24tYW5kLWJ1aWxkaW5nLW1hdGVyaWFscy9vdXItaW5zaWdodHMvdGhlLWNpcmN1bGFyLWNlbWVudC12YWx1ZS1jaGFpbi1zdXN0YWluYWJsZS1hbmQtcHJvZml0YWJsZdIBAA","guidislink":false,"published":"Mon, 06 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=65, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5tY2tpbnNleS5jb20vaW5kdXN0cmllcy9lbmdpbmVlcmluZy1jb25zdHJ1Y3Rpb24tYW5kLWJ1aWxkaW5nLW1hdGVyaWFscy9vdXItaW5zaWdodHMvdGhlLWNpcmN1bGFyLWNlbWVudC12YWx1ZS1jaGFpbi1zdXN0YWluYWJsZS1hbmQtcHJvZml0YWJsZdIBAA?oc=5\" target=\"_blank\">The circular cement value chain: Decarbonizing cement<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The circular cement value chain: Decarbonizing cement - McKinsey","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5tY2tpbnNleS5jb20vaW5kdXN0cmllcy9lbmdpbmVlcmluZy1jb25zdHJ1Y3Rpb24tYW5kLWJ1aWxkaW5nLW1hdGVyaWFscy9vdXItaW5zaWdodHMvdGhlLWNpcmN1bGFyLWNlbWVudC12YWx1ZS1jaGFpbi1zdXN0YWluYWJsZS1hbmQtcHJvZml0YWJsZdIBAA?oc=5\" target=\"_blank\">The circular cement value chain: Decarbonizing cement<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","source.href":"https:\/\/www.mckinsey.com","source.title":"McKinsey","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Cement and concrete are the linchpins of the built environment. Its global demand has nearly tripled over the past 20 years. Yet despite cement’s ubiquity, its surrounding economy is a major contributor to global carbon dioxide emissions. Furthermore, 30 to 40 percent of today’s solid waste is created through the construction and maintenance of the built environment. With a growing number of industries and sectors moving toward net-zero emissions, a significant amount of value is at stake in cement. General EU Emissions Trading System (ETS) carbon prices have reached nearly €100 per metric ton of carbon dioxide, a level that could become the norm by 2030. At the same time, the cost of landfill from construction and demolition waste (CDW) affects the entire building ecosystem, exceeding €100 per metric ton. Combined, the total value at risk from carbon dioxide and landfill could reach approximately €210 billion by 2050. The demand for cement in the upcoming decades will likely remain consistent, which means there will be no additional value created from traditional approaches to cement production. As a result, players across the built environment must act now and explore alternative options to decrease both costs and carbon dioxide emissions. Circular technologies, such as alternative fuels, carbon curing, recarbonation, and carbon capture and storage (CCS), will be much more than niche solutions for decarbonizing the built environment. In fact, our research shows that they could help to decarbonize roughly 80 percent of total cement and concrete emissions by 2050. This article shows how the recirculation of carbon dioxide, materials and minerals, and energy can add €110 billion of annual net value gain to the built environment by 2050, therefore mitigating almost half of the stated value at risk. Moving forward, stakeholders across the value chain can seize the opportunity by engaging in circular business building and using circular technologies to react to evolving financial risks. How circularity can work in cement The cement value chain is well positioned to create closed loops, or automatically regulated systems, for carbon dioxide, materials and minerals, and energy (see sidebar “Three categories of circular technologies in cement”). This entails circular economies, which are based on the principles of eliminating waste and pollution, circulating products and materials, and regenerating nature (Exhibit 1). 1 Three categories of circular technologies in cement Three categories of circular technologies can help generate profit for cement players: energy, carbon dioxide, and materials and minerals. Energy. This category comprises the use of alternative fuels from waste material and the recovery of energy and heat throughout cement and concrete production. The Global Cement and Concrete Association (GCCA) industry road map for net-zero cement forecasts the global average share of alternative fuels to reach 43 percent by 2050. Carbon dioxide. Carbon dioxide emissions from cement and concrete production or other nearby industrial production sites can be reinserted into the value chain. Key technologies in this field include the enhanced recarbonation of construction and demolition waste (CDW), the mineralization of aggregates from concrete waste or other waste material, and carbon capture and storage (CCS). Materials and minerals. This category includes the recirculation of waste material—for example, by directly reusing entire structures or recycling waste into gravel for road construction, aggregates for concrete, replacement for clinker, or limestone as a raw material. Waste material can come directly from CDW or other industries (for example, metal slags). With these points in mind, circularity can work jointly with reducing carbon emissions in cement production because circular technologies follow the paradigm of three crucial decarbonization strategies: redesign, reduce, and repurpose. To begin, addressing the total volume of materials needed—or redesigning materials, buildings, and infrastructure—can play a critical role in changing how industry leaders approach projects. Next, shifting from fossil to alternative fuels can help reduce emissions of materials. Finally, repurposing, repairing, and refurbishing existing assets and infrastructure can help limit the need for new products by utilizing captured carbon dioxide emissions and reinserting them into the value chain. According to our estimates, and expected carbon prices, each of these circularity technologies will be value-positive by 2050, with some already more profitable than today’s business-as-usual solutions. That said, a few solutions were not factored into our analysis despite being critical to reaching net-zero emissions, including the reduction of clinker in cement through substitutes and low binder intensity, the reduction of cement in concrete through less overspecification by design, and the overall reduction of concrete in the built environment through alternative building materials. Thus, these solutions should be considered part of a broader definition of circularity. Circularity in cement is an opportunity to create additional value by 2050 Our estimates show that an increased adoption of circular technologies could be linked to the emergence of new financial net-value pools worth up to roughly €110 billion by 2050, providing a new growth avenue for cement players that would otherwise face shrinking demand for their core business and significant external costs (Exhibit 2). Adopting circularity is required to mitigate at least 50 percent of this value at risk. Emerging new technologies and business models will create additional value to mitigate the residual value at risk. 2 The annual net impact of recirculating carbon is estimated at €6 billion on a global average by 2050 (estimated at 2022 prices, disregarding inflation). This is driven mainly by the growing importance of global carbon markets, with expected carbon dioxide prices either mitigating or outweighing the costs of technology. In fact, our research shows that technologies utilizing carbon dioxide, such as curing ready-mix or precast concrete, can create positive economic value at carbon prices of approximately €80 per metric ton of carbon dioxide. It’s likely that technologies offering high carbon dioxide offtake will be implemented first in regions with rapid growth in carbon pricing mechanisms, such as Europe and North America. Recirculating materials and minerals will be the largest driver of financial impact, reaching nearly €80 billion of annual EBITDA added to the industry by 2050. This includes the use of CDW as aggregates for concrete production, thus avoiding landfill costs, which are estimated at €20 per metric ton in 2050, and the costs of virgin material. In addition, CDW can be processed through Smartcrushing, which extracts unhydrated cement “fines” and helps reduce the amount of virgin cement needed for concrete. Reusing concrete modules and structures is the second-largest value driver, at an estimated €24 billion by 2050. Finally, the greatest value potential for energy—specifically alternative fuels from waste material—arises in countries and regions with high availability and high landfill costs. In addition, cement and concrete production can provide an offtake opportunity for waste material, which could be supplied for free or even at a negative cost by the producing industries. The total annual net value gain from recirculating energy is expected to be €24 billion by 2050. Cement emissions can be reduced or mitigated by 80 percent, though local differences apply Based on the financial attractiveness of circular technologies in cement, there is significant potential for carbon dioxide abatement through circularity over the next 20 years. In fact, our estimates show that roughly two billion metric tons of carbon dioxide emissions could be avoided or mitigated through the application of these technologies by 2050 (Exhibit 3). 3 External factors, especially carbon dioxide prices, decarbonization subsidies, and costs of landfill, can potentially accelerate the time it takes to unlock the value of circular technologies. Therefore, the uptake of these technologies will differ from region to region. For example, mineralization for carbon reinsertion technologies is driven by regions with high carbon dioxide prices, such as Europe or North America (see sidebar “The case for circularity in Europe”). The case for circularity in Europe There is significant potential for Europe to rapidly evolve its uptake of circular technologies by 2050. For example, prices for carbon dioxide could reach up to €130 per metric ton of carbon dioxide in Europe by 2030. In addition, prices for landfill disposal or treatment could average €25 per metric ton of construction and demolition waste (CDW) by 2030 and €35 per metric ton of CDW by 2050, and the value of the built-environment value chain could increase by as much as €3.7 billion by 2030 and €28 billion by 2050. Deviating from the global average scenario, our analysis of Europe shows that value generated from technologies recirculating carbon dioxide, especially mineralization technologies and carbon capture and storage (CCS) or carbon dioxide offtake in other industries, could over-haul other circular technologies and be the main value driver by 2050, accounting for 45 percent of the stated value by 2030 and 54 percent by 2050. Given the high carbon dioxide offtake potential, the financial impact of technologies utilizing carbon dioxide could significantly increase with higher regulatory carbon dioxide prices. Furthermore, the high technological standard and infrastructure potential in Europe means this transition could happen relatively quickly and result in the assumption that by 2050, 100 percent of total CDW created in Europe will be recycled, up to 35 percent of which is likely to be used to produce carbon dioxide–enriched aggregates. These regional cost differences illustrate the importance and impact of regulatory frameworks, which can facilitate circularity in the built environment from two angles: financial incentives and standardization. For financial incentives, regulators directly influence the cost benefit of abated carbon dioxide emissions through carbon dioxide pricing schemes, such as the EU ETS. Further incentives, such as carbon-credit systems and permits that allow owners to emit certain levels of carbon dioxide or other greenhouse gases, can stimulate players to lower their emission levels. In the same manner, pricing of CDW through landfill taxation can drive opportunity costs and therefore make the recycling of waste materials even more attractive. In fact, our calculations show that an increase of landfill tax by €5 per metric ton of CDW can reduce the carbon dioxide abatement cost of technologies that use CDW as feedstock by up to 60 percent. New business models for all players in the built environment are expected to evolve from actions that facilitate circularity along the value chain. For standardization, regulations directly affect the amount of waste material that can be used in the cement and concrete mix. As an example, the draft version of the cement standard addition in European countries, EN197-6, limits the use of recycled-concrete fines in cement to 20 percent. What stakeholders can do to seize the opportunity Cement players and other ecosystem players should double down on circularity now to secure a stake in untapped value pools. Winning will require stakeholders to think along two dimensions: engaging in circular business building and using circular technologies to react to evolving financial risks. Engage in circular business building New business models for all players in the built environment—not only cement and concrete manufacturers—are expected to evolve from actions that facilitate circularity along the value chain as well as actions that deliver the value of circularity to consumers. Consider recycling, repairing, or supply chain services. Construction companies, waste providers, new players, and building materials manufacturers alike can consider digital marketplaces for waste materials. At the same time, technologies that facilitate design and standardization are expected to increase potential value pools even further, enabling technology providers and designers to secure a significant stake in the overall value pools. Pursue new opportunities for building green businesses. Increasing customer centricity will likely create new opportunities across the built environment. For example, a growing number of people—including construction players and building residents—are increasingly interested in affordable housing or structures that have “housing flexibility,” which allows residents to participate in the design of their homes. Precast building modules can also be provided to customers in a lease-like mechanism, which can be facilitated either directly by cement and concrete players or through construction companies that have direct offtake agreements with materials producers. Build new business models related to carbon dioxide offtake. Reducing carbon dioxide emissions while creating value pools can be accomplished by exploring carbon dioxide offtake opportunities in other industries. Captured and concentrated carbon dioxide can be transported—by pipeline or by trucks—to places where it can be used as an input. For example, carbon dioxide can be used as a feedstock for processes in the plastics and chemicals industry or in hydrogen production. The challenge is to create viable business models for both the cement industry and offtakers, which highlights the need for increased collaboration across industries. Use circular technologies to react to the evolving financial risks Given local and strategic constraints, different stakeholders will have different approaches to adopting and implementing circular technologies to respond to risks in the built environment. Build a cost-benefit position with existing carbon dioxide prices, landfill costs, and regulatory frameworks. Individually assessing externalities and selecting the most beneficial technologies by region and location of plants will secure a cost-benefit position. Starting with technologies with the lowest carbon dioxide abatement cost on a global average, players can assess the impact of the selection of technologies based on region and the location of plants on their individual business case and identify the most easily adoptable solutions. Determine if sufficient waste material for recirculation is available and accessible. Availability refers to the amount of waste material created by one region. For example, in countries with high waste leakage, such as most parts of Asia (China, India, Indonesia, Thailand, and Vietnam account for about 85 percent of mismanaged plastic waste globally), the cement and concrete value chain can serve as a real offtake opportunity for other industries even today. In terms of accessibility, circularity is already feasible in developed countries and could be in other parts of the world by 2050. Thus, players across the entire building and construction value chain can accelerate this transition by planning to locate facilities together in industrial hubs. Ensure offtake agreements for circular products. Offtake agreements for low-carbon building materials will likely soon become available across the world. In fact, more than 100 small and medium-size construction companies across ten countries joined the Race to Zero campaign by the United Nations Framework Convention on Climate Change. In addition, the Paris 2024 Olympics recently announced that building materials used in its construction must meet sustainable criteria. In the long term, new value pools could arise by shifting from selling cement not as a material but as a sustainable solution and service. This approach requires a customer-centric posture to explore new opportunities for green-business building, especially as builders and house owners increasingly request sustainable, affordable, durable, and flexible structures rather than focusing on cement and concrete as a standard material.","filter_flag":1}
{"title":"Platinum recycling and the circular economy - CME Group","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9hcnRpY2xlcy8yMDIzL3BsYXRpbnVtLXJlY3ljbGluZy1hbmQtdGhlLWNpcmN1bGFyLWVjb25vbXkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9hcnRpY2xlcy8yMDIzL3BsYXRpbnVtLXJlY3ljbGluZy1hbmQtdGhlLWNpcmN1bGFyLWVjb25vbXkuaHRtbNIBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9hcnRpY2xlcy8yMDIzL3BsYXRpbnVtLXJlY3ljbGluZy1hbmQtdGhlLWNpcmN1bGFyLWVjb25vbXkuaHRtbNIBAA","guidislink":false,"published":"Tue, 28 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=87, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9hcnRpY2xlcy8yMDIzL3BsYXRpbnVtLXJlY3ljbGluZy1hbmQtdGhlLWNpcmN1bGFyLWVjb25vbXkuaHRtbNIBAA?oc=5\" target=\"_blank\">Platinum recycling and the circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CME Group<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Platinum recycling and the circular economy - CME Group","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9hcnRpY2xlcy8yMDIzL3BsYXRpbnVtLXJlY3ljbGluZy1hbmQtdGhlLWNpcmN1bGFyLWVjb25vbXkuaHRtbNIBAA?oc=5\" target=\"_blank\">Platinum recycling and the circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CME Group<\/font>","source.href":"https:\/\/www.cmegroup.com","source.title":"CME Group","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"IMPORTANT NOTICE AND DISCLAIMER: This publication is general and solely for educational purposes. The publisher, The World Platinum Investment Council, has been formed by the world’s leading platinum producers to develop the market for platinum investment demand. Its mission is to stimulate investor demand for physical platinum through both actionable insights and targeted development, providing investors with the information to support informed decisions regarding platinum and working with financial institutions and market participants to develop products and channels that investors need. The research for the period since 2019 attributed to Metals Focus in the publication is © Metals Focus Copyright reserved. All copyright and other intellectual property rights in the data and commentary contained in this report and attributed to Metals Focus, remain the property of Metals Focus, one of our third-party content providers, and no person other than Metals Focus shall be entitled to register any intellectual property rights in that information, or data herein. The analysis, data and other information attributed to Metals Focus reflect Metals Focus’ judgment as of the date of the document and are subject to change without notice. No part of the Metals Focus data or commentary shall be used for the specific purpose of accessing capital markets (fundraising) without the written permission of Metals Focus. The research for the period prior to 2019 attributed to SFA in the publication is © SFA Copyright reserved. This publication is not, and should not be construed to be, an offer to sell or a solicitation of an offer to buy any security. With this publication, neither the publisher nor its content providers intend to transmit any order for, arrange for, advise on, act as agent in relation to, or otherwise facilitate any transaction involving securities or commodities regardless of whether such are otherwise referenced in it. This publication is not intended to provide tax, legal, or investment advice and nothing in it should be construed as a recommendation to buy, sell, or hold any investment or security or to engage in any investment strategy or transaction. Neither the publisher nor its content providers are, or purports to be, a broker-dealer, a registered investment advisor, or otherwise registered under the laws of the United States or the United Kingdom, including under the Financial Services and Markets Act 2000 or Senior Managers and Certifications Regime or by the Financial Conduct Authority. This publication is not, and should not be construed to be, personalized investment advice directed to or appropriate for any particular investor. Any investment should be made only after consulting a professional investment advisor. You are solely responsible for determining whether any investment, investment strategy, security or related transaction is appropriate for you based on your investment objectives, financial circumstances, and risk tolerance. You should consult your business, legal, tax or accounting advisors regarding your specific business, legal or tax situation or circumstances. The information on which this publication is based is believed to be reliable. Nevertheless, neither the publisher nor its content providers can guarantee the accuracy or completeness of the information. This publication contains forward-looking statements, including statements regarding expected continual growth of the industry. The publisher and Metals Focus note that statements contained in the publication that look forward in time, which include everything other than historical information, involve risks and uncertainties that may affect actual results and neither the publisher nor its content providers accept any liability whatsoever for any loss or damage suffered by any person in reliance on the information in the publication. The logos, services marks and trademarks of the World Platinum Investment Council are owned exclusively by it. All other trademarks used in this publication are the property of their respective trademark holders. The publisher is not affiliated, connected, or associated with, and is not sponsored, approved, or originated by, the trademark holders unless otherwise stated. No claim is made by the publisher to any rights in any third-party trademarks. © 2022 World Platinum Investment Council Limited. All rights reserved. The World Platinum Investment Council name and logo and WPIC are registered trademarks of World Platinum Investment Council Limited. No part of this report may be reproduced or distributed in any manner without attribution to the publisher, The World Platinum Investment Council, and the authors.","filter_flag":1}
{"title":"Creating less new stuff could greatly help Earth's climate - Science News Explores","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnNuZXhwbG9yZXMub3JnL2FydGljbGUvY3JlYXRpbmctY29uc3VtaW5nLWxlc3MtbmV3LXN0dWZmLWNhbi1oZWxwLWNsaW1hdGUtc3VzdGFpbmFiaWxpdHktcmV1c2UtcmVwYWlyLXJlbWFrZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnNuZXhwbG9yZXMub3JnL2FydGljbGUvY3JlYXRpbmctY29uc3VtaW5nLWxlc3MtbmV3LXN0dWZmLWNhbi1oZWxwLWNsaW1hdGUtc3VzdGFpbmFiaWxpdHktcmV1c2UtcmVwYWlyLXJlbWFrZdIBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnNuZXhwbG9yZXMub3JnL2FydGljbGUvY3JlYXRpbmctY29uc3VtaW5nLWxlc3MtbmV3LXN0dWZmLWNhbi1oZWxwLWNsaW1hdGUtc3VzdGFpbmFiaWxpdHktcmV1c2UtcmVwYWlyLXJlbWFrZdIBAA","guidislink":false,"published":"Thu, 16 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=75, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnNuZXhwbG9yZXMub3JnL2FydGljbGUvY3JlYXRpbmctY29uc3VtaW5nLWxlc3MtbmV3LXN0dWZmLWNhbi1oZWxwLWNsaW1hdGUtc3VzdGFpbmFiaWxpdHktcmV1c2UtcmVwYWlyLXJlbWFrZdIBAA?oc=5\" target=\"_blank\">Creating less new stuff could greatly help Earth's climate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Science News Explores<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Creating less new stuff could greatly help Earth's climate - Science News Explores","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnNuZXhwbG9yZXMub3JnL2FydGljbGUvY3JlYXRpbmctY29uc3VtaW5nLWxlc3MtbmV3LXN0dWZmLWNhbi1oZWxwLWNsaW1hdGUtc3VzdGFpbmFiaWxpdHktcmV1c2UtcmVwYWlyLXJlbWFrZdIBAA?oc=5\" target=\"_blank\">Creating less new stuff could greatly help Earth's climate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Science News Explores<\/font>","source.href":"https:\/\/www.snexplores.org","source.title":"Science News Explores","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"This is another in our series of stories identifying new technologies and actions that can slow climate change, reduce its impacts or help communities cope with a rapidly changing world. Cows wandered in the distance as Rukayya Ibrahim Muazu and her colleagues set up a stand with information about plastic milk jugs. It was a sunny spring day in 2019 at Our Cow Molly farm in Sheffield, England. Milk jugs and all the things we use daily have secret stories, Muazu knew. These are the stories of where the items came from before we got them and where they will go when we are done with them. At the time, Muazu worked at the University of Sheffield. A researcher with expertise in chemical and environmental engineering, she was studying such stories. Take a plastic milk jug. To get it, drills must first pull crude oil from the Earth. Factories turn the oil into petroleum and then plastic. Other factories form the plastic into jugs. Trucks deliver those jugs to farms, where they get filled with milk. Later, a truck will carry the full jugs to nearby stores and cafés, including one at Muazu’s school. After students like her stir all the milk into their tea or coffee, the café gets rid of the jugs. About half will get recycled. The rest head to landfills. Our Cow Molly, a farm in Sheffield, England, is working toward a more sustainable future. Together with some of its customers, the farm is reusing metal milk jugs (pictured center) instead of using disposable plastic ones. University of Sheffield This process is quite typical today. Things get used up or break or we simply don’t want them anymore. So, we throw most of these into the trash. “There is so much waste,” says Muazu. Having completed her degree, she now works at the University of Surrey. It’s in Guildford, England. Amelie Côté agrees. People “take, make, consume and throw away,” she says. She’s an analyst in Canada at Équiterre. It’s an organization in Montreal, Quebec, that seeks solutions to environmental problems. One of those problems is that too many people — especially those in the industrialized world — use and discard far more stuff than they should. This is called overconsumption. Consuming too much stuff drains resources. It can harm ecosystems — even people, especially those in low-income countries. It also worsens climate change. According to the Global Footprint Network, last year people used 75 percent more resources than Earth can sustainably supply. Simply put, we’re asking Earth to give us more than nature can replenish. That sets up a problem: We have only one Earth from which to get those resources. “Our patterns of consumption are in a large part driving the climate crisis,” says Sandra Goldmark. She’s an expert in sustainability at Barnard College and Columbia University’s Climate School in New York City. The pollutants that worsen climate change come from power plants, factories and vehicles. Most of these are running to supply people with stuff and services. In general, the more stuff we buy and use, the more pollution we emit. Educators and Parents, Sign Up for The Cheat Sheet Weekly updates to help you use Science News Explores in the learning environment Client key* E-mail Address* Go Thank you for signing up! There was a problem signing you up. The opposite of consuming too much is living sustainably. A sustainable product or process uses no more resources than the planet can supply now — and in the future. Living sustainably limits harm to the environment. When Earth had fewer people and no factories churning out cheap or disposable items, it could deal with our wasteful ways. But not anymore. Now that there are 8 billion of us, we need to learn to consume in a way that doesn’t destroy the planet. And that’s what experts like Muazu, Côté, Goldmark and others are working toward. Goldmark even wrote a book about it called Fixation: How to Have Stuff Without Breaking the Planet. Our goal, such experts say, is to turn the line of take-make-use-toss into a circle of reduce-reuse-repair-recycle-remake. They also call this a circular economy, where resources become goods, which become resources again. To support this cycle, people must change the way they make and use things. “It takes a lot of energy to produce goods,” says Côté. “We want to make the most out of them.” How do we stop consuming too much? We can form a more circular economy. That means reducing, reusing, recycling and remaking stuff as much as possible. That way, fewer new things need to be made in the first place. © Institut EDDEC in collaboration with RECYC-QUEBEC. The life of stuff — from cradle to grave Eddie Andrew is a farmer at Our Cow Molly. He had invited Muazu and her colleagues to visit after he got an idea. What if his farm replaced plastic jugs with glass bottles or large metal cans called churns? His workers could pick up empty containers, then wash and refill them. It seemed like it should be more sustainable, says Muazu. “One option uses a lot of plastic. The other uses less.” However, confirming the advantage of moving away from plastic wasn’t as simple as it may sound. Producing one bulky metal or glass container uses up more resources and energy than producing one lightweight plastic jug. Also, reusable containers have to be washed with water and cleaning chemicals. Reusing milk containers might “solve one problem while creating another,” Muazu says. Thankfully, engineers have a tool they can use to compare the different options. It’s called a life-cycle assessment, or LCA. It looks at the entire life of a product or process — from “cradle to grave.” LCA analyses will reveal something’s environmental impacts, often in ways that allow comparisons between products. Many steps go into making the things you use every day. For example, a cotton T-shirt starts as fluff growing inside a boll on a cotton plant. “Cotton comes from the Earth,” explains Danielle Azoulay. She’s an expert in sustainability at Columbia University in New York City. Once cotton is picked, a factory turns it into lint. Another factory then spins those fibers into yarn. Next, the yarn gets woven into fabric and dyed. This all happens, Azoulay explains, “before it even gets to the factory to be made into a shirt.” Finally, the shirt gets shipped to a store. Someone drives to the store to go shopping. Or they order online and have a truck bring the shirt to their house. Finally, someone gets to wear the shirt. When it gets dirty, they wash it. Eventually, they’ll throw the shirt away. University of Sheffield A metal milk jug can save 1,000 single-use plastic jugs from being made and tossed. Reusable metal water bottles and straws can also save energy and reduce waste — if you use them for long enough. You must use a metal straw at least 100 times before the carbon footprint of making it and washing it is lower than the impact of 100 use-and-toss plastic straws. Each step in this process impacts the environment. An LCA asks and answers questions about every single step. These include where it happened, how much electricity it used, what the source of that electricity was, how far vehicles had to travel, what other resources were used and so on. One of the most common reasons to do such a life-cycle analysis is to calculate what’s called a carbon footprint. That’s a measure of how much a product or process impacts Earth’s climate over its lifetime. According to one 2020 estimate, more than 70 percent of the carbon footprint of a piece of clothing comes from making it. A much smaller portion comes from washing, wearing and disposing of it. Such LCA data helps people understand the harm of fast fashion. To lower the climate impact of fashion, people can keep and use clothing longer or buy more used clothing. What about milk containers? Muazu’s team found that per liter (quart) of milk delivered, plastic jugs have a carbon footprint equivalent to 90 grams of carbon dioxide equivalent (CO 2 e). (Comparing things to CO 2 is a way of using a single number to account for a mix of climate-altering pollutants). These jugs get used once. Afterward, only about half will get recycled. Metal churns, on the other hand, can be reused 1,000 times. Over their lifetime, they have a footprint of just 30 grams of CO 2 e per liter of milk. The metal churns do use up more water overall than do the plastic jugs. But that tradeoff seemed worth it to Our Cow Molly. They now use metal churns to deliver milk to several local cafés. Getting stuff fixed Reuse is one important part of a more circular cycle for products. However, you can only keep reusing things as long as they still function. What if something breaks? Sadly, it’s often easier and cheaper to go online and order a new thing than to find a way to fix the old one. Sandra Goldmark and the repair people at Fixup’s shops worked on all kinds of odd things, including this stuffed lobster. “It’s very satisfying to repair something,” says Goldmark. “It’s a little gift for a person.” S. Goldmark In 2022, Côté and her team surveyed Canadians about their appliances and electronics. Almost two in every three — 63 percent — reported that at least one of their appliances or electronic devices had broken during the past two years. Yet only 19 percent — less than one third of these people — said they had gotten their broken product fixed. Broken things typically end up in the trash. Back in 2013, Sandra Goldmark decided to do something about this problem. “So many things broke that seemed like they should be fixable,” she remembers thinking. She already had some repair skills. As a designer for a theater, she had made and repaired lots of costumes and scenery. So, she got together with some colleagues and opened a pop-up repair shop in New York City. They called it Fixup. A pop-up shop stays open for a short period and then closes. The first one was such a success that the team spent the next seven years operating similar shops and events. They repaired more than 2,000 items. As a result, some 2,000 new things didn’t have to get made. Sadly, many things couldn’t be fixed. Again and again, Goldmark and her team encountered flimsy plastic parts, pesky glue or screws that no ordinary screwdriver could undo. Côté found the same sorts of issues in her survey. Respondents thought their broken appliances and electronics were not repairable, she says. Also, the process to diagnose a problem, get the right parts and fix the item would take more time and money than people were willing to spend. Flimsy or tough-to-fix products are not an accident. Many companies intentionally design things not to last. Why? They want you to have to buy a new one in the not-too-distant future. Another approach is to hype up a new item while making old items seem old-fashioned or obsolete. Both approaches are examples of “planned obsolescence.” Companies with these practices “want us on this treadmill where we buy more products from them regularly,” says Kyle Wiens. Wiens is the founder of the website ifixit.com, based in San Luis Obispo, Calif. It provides manuals and instructions for repairing everything from iPhones to hospital ventilators. “We want to make it easier to fix things than to buy new things,” he says. In October 2022, iFixit hosted a repair café in San Luis Obispo, Calif. Among the items people brought in for repair were this suitcase, seven pieces of clothing, 23 small appliances, six electronic devices and one bike. All: iFixit Making stuff fixable A “right to repair” movement is fighting to make repair an easier option for everyone. Ifixit.com scores items on how easy they are to repair. People can use these scores to choose among new items, finding ones that should last longer. In 2022, New York State enacted a new law — the first of its kind in the United States. It says companies must make available to the public repair manuals for their electronics — along with parts and tools. This type of law isn’t bad for business, say Goldmark and Wiens. We can all adapt to a more circular way of using stuff. For example, companies can make money doing repairs. Or they can take back used items for resale to others. Some companies are already taking these steps. Patagonia, which sells outdoor gear and clothing, offers repairs in its stores and through a mail-in program. In 2011, the company ran an ad on Black Friday — the most popular shopping day of the year. In big, bold, letters, it said: “Don’t buy this jacket.” According to the ad, the carbon emissions generated while making the jacket weighed 24 times more than the jacket itself. “We ask you to buy less and to reflect before you spend a dime on this jacket or anything else,” the ad said. This young man is fixing a cell phone at his dining room table. Repairing the phone rather than tossing it extends its life. A 2020 report concluded that if every American kept their smartphone an extra year, the climate impact would equal taking 636,000 cars off the road. EThamPhoto\/Corbis\/Getty Images Plus Caring about the environment is becoming trendy among companies. IKEA has committed to becoming a circular company by 2030. Target aims to do that by 2040. “I think there’s a lot to be hopeful about,” says Azoulay. She has worked with several major fashion and beauty companies to help them lessen their impacts on the environment. Companies and customers should change their thinking when it comes to repair and reuse, she says. “New to me can still be exciting,” she says. When you buy a jacket that someone else has worn, she says, you could think about how many mountains it may have been to the top of. You can think, “I’m going to take this jacket on more adventures.” One of Fixup’s projects was a shop that repaired household items while also offering sustainable new and used items for sale. The art on the wall contains a saying to help guide people interested in a more sustainable lifestyle: “Have good stuff. Not too much. Mostly reclaimed.” S. Goldmark Another interesting idea is to change how ownership works. Goldmark asks, what if people rented large items such as sofas instead of buying them? Then, when the item broke or the person was done with it, it would go back to the company that made it. If this were required by law, says Goldmark, companies would instantly start designing more durable products — ones they also could easily maintain, repair and resell. A more sustainable world The final stage of a more circular product cycle is what happens when things can’t be repaired or reused any longer. Ideally, the materials would be recycled and remade into new things. Sadly, most of what we put into recycling bins today never actually gets recycled. The process is just too costly. When it comes to electronics, recycling also can be dangerous. That’s because circuit boards and batteries contain toxic and flammable materials. Yet failing to recycle electronics means trashing precious metals — including copper, platinum and gold. Already, “the amount of gold that is essentially thrown away every year in electronics in the U.S. could be equivalent to the amount of gold that is mined in the country,” said Peng Peng. He’s a sustainability expert at Lawrence Berkeley National Laboratory in California. He also coauthored a study about the importance of improving electronics recycling. It appeared in the January 2023 Nature Sustainability. What if electronics and other items were designed from the start to be easy to take apart? That would make both repair and recycling much easier, says Wiens. Kyle Wiens has had the same laptop for more than 10 years. “I’ve taken it apart and fixed it maybe 30 times,” he says. Here, Wiens repairs another computer. Repair avoids the costs — including climate impacts — of getting all the raw materials needed to make a new device. K. Wiens One farm changing the milk container it uses won’t stop climate change or save the planet. Neither will a few pop-up fix-it shops, or a few companies going circular. We need a cultural shift, notes Goldmark. “We should spend money on people, not stuff,” she says. She means we should pay people fair wages to make products. People who clean, maintain, fix and recycle products deserve better pay as well. These types of changes will likely mean paying more for products than we do now. But the products themselves will last longer. So, we won’t need to buy as many. In the end, everything should even out. At least as importantly, the planet — including our climate — will be better off. Companies and governments are the ones ultimately responsible for changing the way we make and use stuff. But every single person, including you, has a role to play. “You’re a really influential piece of the puzzle,” says Azoulay. Individuals can help by learning about sustainability and changing how they shop. It also helps to talk about these issues with friends, family and lawmakers. All of our small changes, when added together, could bend the harmful arrow of take-make-toss into a sustainable, long-lasting circle.","filter_flag":1}
{"title":"Finding the Sustainable Advantage in Chemicals - Bain & Company","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2ZpbmRpbmctdGhlLXN1c3RhaW5hYmxlLWFkdmFudGFnZS1pbi1jaGVtaWNhbHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2ZpbmRpbmctdGhlLXN1c3RhaW5hYmxlLWFkdmFudGFnZS1pbi1jaGVtaWNhbHMv0gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2ZpbmRpbmctdGhlLXN1c3RhaW5hYmxlLWFkdmFudGFnZS1pbi1jaGVtaWNhbHMv0gEA","guidislink":false,"published":"Fri, 10 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=69, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2ZpbmRpbmctdGhlLXN1c3RhaW5hYmxlLWFkdmFudGFnZS1pbi1jaGVtaWNhbHMv0gEA?oc=5\" target=\"_blank\">Finding the Sustainable Advantage in Chemicals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Finding the Sustainable Advantage in Chemicals - Bain & Company","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2ZpbmRpbmctdGhlLXN1c3RhaW5hYmxlLWFkdmFudGFnZS1pbi1jaGVtaWNhbHMv0gEA?oc=5\" target=\"_blank\">Finding the Sustainable Advantage in Chemicals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","source.href":"https:\/\/www.bain.com","source.title":"Bain & Company","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"The global chemical sector is an essential centerpiece of modern economies, touching everything from fertilizers and fuels to petrochemicals and plastics. But the sector is increasingly under pressure for its large environmental footprint, being a heavy user of oil, gas, and other energy, and emitting more than 2 gigatons of greenhouse gases each year. Consumers, regulators, investors, and others are asking if it’s possible to reap the same benefits from the sector, only with a lighter, more sustainable impact. Across the broad and diverse chemical sector, every company will respond to this shift in its own way, depending on market position, portfolio, capabilities, and ambitions. Some companies may take a more defensive stance, adapting their operations and business just enough to comply with new regulations and customer demands. Others may see the shift as an opportunity for growth in new markets and existing product lines. Many of these companies are already responding with bold and innovative approaches to new products and new ways to operate. Greener production: Reduce scope 1 and 2 emissions by switching to clean or renewable energy. Design products that use less materials—for example, rethinking packages to use less plastic. Reduce scope 1 and 2 emissions by switching to clean or renewable energy. Design products that use less materials—for example, rethinking packages to use less plastic. Greener supply chain: Reduce scope 3 emissions by encouraging suppliers to decarbonize their own inputs and operations and making changes to how employees and downstream users of products operate. Reduce scope 3 emissions by encouraging suppliers to decarbonize their own inputs and operations and making changes to how employees and downstream users of products operate. Green products: Switch to biobased or recycled feedstock and design more circular products (biodegradable or recyclable) to reduce environmental impacts. Switch to biobased or recycled feedstock and design more circular products (biodegradable or recyclable) to reduce environmental impacts. Green enablers: Support the energy transition and broader sustainability goals to reduce overall impact, even if specific products are not themselves greener. For example, providing chemicals for batteries may not change a company’s scope 1 footprint, but it supports the broader transition to electric vehicles. Support the energy transition and broader sustainability goals to reduce overall impact, even if specific products are not themselves greener. For example, providing chemicals for batteries may not change a company’s scope 1 footprint, but it supports the broader transition to electric vehicles. New business models: Companies may discover they are particularly good at some aspect of sustainability and begin to offer that service to others. For example, some industrial companies have developed unique skills in the management of fresh water and wastewater, and they have set up separate businesses around those capabilities. While many companies are investing in sustainability, not all are capturing new value from these efforts. The leaders making these investments pay off define their ambitions clearly, gain a deep understanding of their customers’ needs, and form partnerships that help put their plans into action. Setting the ambition Each company starts from a unique point. A clear understanding of market trends and costs helps to shape their ambition and investment levels. Along the value chain, companies like Neste have faced an existential crisis to their entire portfolio and have made large bets to shift to biobased alternatives. Others, including some major plastic resin manufacturers, see a future in which green chemicals live side by side with their legacy products for years while they build out sustainable value chains. The products in a company’s portfolio, its customers’ needs, the relative cost position of alternatives today and in the future, and the regulatory landscape are all important factors in deciding whether to invest in green solutions as an industry leader, fast follower, or somewhere in the middle. Clarity and alignment on these issues help executives decide how much to invest over time and how far from the core business those investments may be. How will customers value sustainability? Once the ambition is set, the next step is for companies to get a better understanding of their customers and how they value sustainability. Specifically, what problems are their customers trying to solve, how will the new sustainable products help, and will they pay a green premium for it (or buy more of it)? Whole segments of customers may value sustainability differently: One segment may be more interested in carbon neutrality while another segment values a product that is all natural—and the perceived value determines the willingness to pay a premium greater than the actual value. Chemical producers can tap into several different veins of opportunity here to address customers’ needs. Environmental impact: Some customers focus on reducing industry impact by limiting greenhouse gas emissions or stopping deforestation. Unilever is exploring alternatives to palm kernel oil to ensure a traceable, deforestation-free supply of material to grow its surfactants business. Some customers focus on reducing industry impact by limiting greenhouse gas emissions or stopping deforestation. Unilever is exploring alternatives to palm kernel oil to ensure a traceable, deforestation-free supply of material to grow its surfactants business. Natural products: Other companies will focus on natural products that are good for the environment and consumers. Many personal care and consumer product companies want to produce and market more natural products. Lululemon, for instance, has partnered with biochemical company Genomatica to bring plant-based nylon to market, which could allow it to market athletic clothing that doesn’t rely on petrochemicals. Other companies will focus on natural products that are good for the environment and consumers. Many personal care and consumer product companies want to produce and market more natural products. Lululemon, for instance, has partnered with biochemical company Genomatica to bring plant-based nylon to market, which could allow it to market athletic clothing that doesn’t rely on petrochemicals. Recycling: Some will make products that are biodegradable or easier to recycle, or they’ll make products from recycled material. Patagonia’s NetPlus brand makes clothing from recycled fish nets, and it also uses recycled wool and polyester in its products. Some will make products that are biodegradable or easier to recycle, or they’ll make products from recycled material. Patagonia’s NetPlus brand makes clothing from recycled fish nets, and it also uses recycled wool and polyester in its products. Energy transition: Opportunities also exist in selling products and services to customers affected by the global energy transition, including automakers, battery manufacturers, and battery material providers. Customers will pay more for products that solve more of their own issues. Offering a sustainable product that makes up only a small part of a customer’s solution will be worth less than one that solves most or all of a customer’s issue. Consider the palm kernel oil example: It may make up only around 10% or so of a customer’s soap product, but if it addresses the customer’s concerns about deforestation, then it may be worth a lot. Implementing the plan Most new solutions require collaborations across the supply chain to help improve traceability, use alternative feedstocks, and develop new ways of processing materials. Partnerships also help share the significant financial risks that come with the development of new processes and products. Having a strong partnership strategy can drastically increase the speed of adoption, likelihood of success, and economic risk sharing with new investments. A good example is the Houston Recycling Collaboration, a joint effort of industry (Cyclyx, ExxonMobil, FCC Environmental Services, and LyondellBasell) and the city to increase Houston’s plastics recycling while ensuring a steady pipeline of end-of-life materials that can be used in producing recycled plastic. Exxon and LyondellBasell have pledged $100 million for a sorting and processing facility, and Cyclyx will provide the sorting and processing technology. Once operational, the facility could produce 150,000 metric tons of plastic feedstock annually in different blends to create recycled plastics. This partnership approach increases the availability of high-quality feedstock, shares risk between partners while leveraging the unique capabilities of each, and solves a wide range of other sustainability and business issues for all three partners. In Chicago, Dow and WM (formerly Waste Management) are piloting a curbside recycling program for plastic films (including bags and wrapping) that are not included in standard plastic recycling. The companies hope to scale up the program to capture 120,000 metric tons of plastic film by 2025, providing Dow with a stable supply of recycled feedstock to use in its products. Other new capabilities also may be required. Commodity chemical and plastic producers may excel at operations, but they might not be as good at developing keen insights about the customer’s business, which is essential for understanding how customers may value the sustainable chemicals that often come with a premium. Of course, significant change at this level can’t succeed without a sustained effort and orchestrated push by senior management. Companies that are doing well in their transition get four things right: Segment customers, and price to value. Understand which customers put the greatest value on your products. When chemical companies understand the customers’ business, they can tailor products and price them according to the value they can bring, or demonstrate how a new solution might help them create a new premium product. Understand which customers put the greatest value on your products. When chemical companies understand the customers’ business, they can tailor products and price them according to the value they can bring, or demonstrate how a new solution might help them create a new premium product. Upgrade sales approach and tools. Pitching new products may require new tools (such as models that demonstrate how a product reduces a customer’s Scope 3 emissions) and incentives (such as higher commissions for new products). Some companies will set up a separate sales team to focus on new product lines. Pitching new products may require new tools (such as models that demonstrate how a product reduces a customer’s Scope 3 emissions) and incentives (such as higher commissions for new products). Some companies will set up a separate sales team to focus on new product lines. Build a future-proof business. The pace of scaling up will vary from one company to another, determined largely by ambition, customer needs, and regulatory conditions. Use established core capabilities to grow a new business that can supplement and surpass the existing one. The pace of scaling up will vary from one company to another, determined largely by ambition, customer needs, and regulatory conditions. Use established core capabilities to grow a new business that can supplement and surpass the existing one. Monitor the regulatory climate. Most executives would prefer not to wade into regulatory advocacy, but it’s increasingly important to understand what regulators are considering to get out in front of big changes. As plastic bans become more common, the industry can position itself as an advocate of fiscally responsible, gradual change that avoids placing unrealistic cost burdens on customers and end-users. Leading chemical producers already see tremendous opportunities in riding the green wave. Developing a deep understanding of the customer’s business—in particular, their sustainability needs and goals—is the key step that informs the initiative. Other steps are important, too: Learning how to sell a premium green product, making the necessary partnerships, and pricing according to value are also essential for building new, more sustainable chemical businesses that may ultimately compete with and supplant their legacy operations.","filter_flag":1}
{"title":"Revisiting Circular Economy in 2023 - United Nations Development Programme","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnVuZHAub3JnL3BhY2lmaWMvYmxvZy9yZXZpc2l0aW5nLWNpcmN1bGFyLWVjb25vbXktMjAyM9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnVuZHAub3JnL3BhY2lmaWMvYmxvZy9yZXZpc2l0aW5nLWNpcmN1bGFyLWVjb25vbXktMjAyM9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LnVuZHAub3JnL3BhY2lmaWMvYmxvZy9yZXZpc2l0aW5nLWNpcmN1bGFyLWVjb25vbXktMjAyM9IBAA","guidislink":false,"published":"Tue, 21 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=80, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnVuZHAub3JnL3BhY2lmaWMvYmxvZy9yZXZpc2l0aW5nLWNpcmN1bGFyLWVjb25vbXktMjAyM9IBAA?oc=5\" target=\"_blank\">Revisiting Circular Economy in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">United Nations Development Programme<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Revisiting Circular Economy in 2023 - United Nations Development Programme","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnVuZHAub3JnL3BhY2lmaWMvYmxvZy9yZXZpc2l0aW5nLWNpcmN1bGFyLWVjb25vbXktMjAyM9IBAA?oc=5\" target=\"_blank\">Revisiting Circular Economy in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">United Nations Development Programme<\/font>","source.href":"https:\/\/www.undp.org","source.title":"United Nations Development Programme","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"In recent years, the severity of the plastics pollution crisis has become increasingly prominent, and the urgent need for the design and implementation of solutions to curb this crisis is fast gaining priority in the global development agenda. The Circular Economy experiments implemented by the Accelerator Lab of the United Nations Development Programme (UNDP) Pacific Office in Fiji is an opportunity to strengthen waste management, reduce plastic pollution and create more economic opportunities in Fiji. Plastic pollution is especially problematic for island nations in the Pacific Ocean due to its vast expanse and the sheer amount of plastic being leaked from coastal areas or carried via ocean currents. By shifting towards a circular economy model, countries in the Pacific can create more sustainable pathways for tackling the plastic waste problem and reap the economic benefits associated with this model. At the heart of circular economies are efforts to end resource waste, reduce environmental impact and increase efficiency. The move to a circular economy reduces the negative environmental consequences of our current ‘take-make-waste’ system, and encourages more reuse, repair, and recycle initiatives to counterbalance energy and material consumption from natural resources. The Pacific region is especially vulnerable to the issues caused by single-use plastics, as the pollution that comes from the production and use of these materials are a serious threat to the fragile and beautiful ocean environments, fishing grounds, and marine ecosystems which Pacific islanders are dependent on for food, transportation, and livelihood. In Fiji, UNDP is creating and supporting multiple local initiatives and projects, working directly with local communities and partners to tackle plastic pollution. These initiatives range from creating awareness and education programs, to piloting the collection of post-consumer plastic waste and repurposing it into new products and materials, thereby promoting circular economies that are improving plastic waste management. The circular economy model is one that is essential to promoting sustainable efforts in Fiji and other nations. The way that circular approaches to the economy look to re-use, repair, and recycle processes and materials, of all types, is invaluable. Particularly in the matter of plastics, the reuse of these materials through traditional and innovative strategies can significantly reduce the amount of harmful waste found in the ecosystems or town boundaries. It is therefore crucial that town councils in Fiji are involved in the conversation around this, and work to implement, circular economic strategies especially in their day-to-day functions in managing council duties. This can be done through effective education, regulation as in fees or fines, and investment of these bodies, and the effective adoption of a circular economy in Fiji can be realized. These were the sentiments of Ms. Setaita Qalilawa, the Assistant Health Inspector for Nausori Town Council.","filter_flag":1}
{"title":"Sustainable food industry solutions for the future - The Washington Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jcmVhdGl2ZWdyb3VwL3RldHJhLXBhay9zdXN0YWluYWJsZS1mb29kLWluZHVzdHJ5LXNvbHV0aW9ucy1mb3ItdGhlLWZ1dHVyZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jcmVhdGl2ZWdyb3VwL3RldHJhLXBhay9zdXN0YWluYWJsZS1mb29kLWluZHVzdHJ5LXNvbHV0aW9ucy1mb3ItdGhlLWZ1dHVyZS_SAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jcmVhdGl2ZWdyb3VwL3RldHJhLXBhay9zdXN0YWluYWJsZS1mb29kLWluZHVzdHJ5LXNvbHV0aW9ucy1mb3ItdGhlLWZ1dHVyZS_SAQA","guidislink":false,"published":"Tue, 07 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=66, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jcmVhdGl2ZWdyb3VwL3RldHJhLXBhay9zdXN0YWluYWJsZS1mb29kLWluZHVzdHJ5LXNvbHV0aW9ucy1mb3ItdGhlLWZ1dHVyZS_SAQA?oc=5\" target=\"_blank\">Sustainable food industry solutions for the future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Washington Post<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable food industry solutions for the future - The Washington Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jcmVhdGl2ZWdyb3VwL3RldHJhLXBhay9zdXN0YWluYWJsZS1mb29kLWluZHVzdHJ5LXNvbHV0aW9ucy1mb3ItdGhlLWZ1dHVyZS_SAQA?oc=5\" target=\"_blank\">Sustainable food industry solutions for the future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Washington Post<\/font>","source.href":"https:\/\/www.washingtonpost.com","source.title":"The Washington Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Sustainable food industry solutions for the future A package should save more than it costs. Discover how Tetra Pak is working towards a circular economy in the food packaging industry. By WP Creative Group Around one third of food produced for human consumption is either lost or wasted. Responsible production and consumption is a major global challenge—but consumers and companies are rising to face it head on. “35 percent of consumers say they’re choosing brands based on their sustainability credentials more now than they did before the pandemic,” Tetra Pak food technology specialist Randi Phinney said outlining the growing consumer commitment to sustainability. To keep up with demand, companies have reimagined their production capabilities. From input to output, new products and materials need improved sustainable properties that can withstand everyday applications at a commercial scale—and continually circle within a production and consumption economy rather than exiting as waste or pollution. This concept of the “circular economy” is key to finding sustainable food industry solutions today—and Tetra Pak takes it one step further. In their commitment to a low-carbon circular economy, Tetra Pak works towards implementing manufacturing processes that not only reuse and recycle materials, but also take into account the climate impact of raw materials and the manufacturing value chain. Every day across the world, Tetra Pak packaging protects billions of liters of liquid foods for safe consumption, work the company cannot do alone. A core tenant at Tetra Pak is that the circular economy demands collaboration, which explains the company’s deep commitment to strategic partnerships. “You want to amplify your capability to innovate,” Paolo Scarabelli, Tetra Pak’s automation and digital director, said of the benefits of external cooperation. Hear food technology specialist Randi Phinney expand on the low carbon circular economy. 0:00\/0:00 Discover three examples of Tetra Pak’s collaboration with other players from different sectors in the food industry to learn how they represent the company’s future efforts towards a sustainable circular economy. Exploring new materials for packaging As part of the journey to create the world’s most sustainable food package, Tetra Pak is exploring how graphene composites can be used to make the next generation of equipment lighter and more energy efficient to reduce costs and energy consumption. Hear strategic partnership manager Mats Qvarford outline Tetra Pak’s most important strategic goal. 0:00\/0:00 Known for being one of the thinnest and strongest materials available in the industry, graphene has been identified as one of the most important future materials within commercial application. The European Graphene Flagship is a coordinated research consortium that gathers nearly 170 academic and industrial partners from 22 countries to explore different aspects of graphene and related materials. As the exclusive representative from the food and beverage packaging industry, Tetra Pak is leading research and development within the sector to explore graphene. “We are exploring specific properties of graphene to see how that can support our type of packaging,” Tetra Pak strategic partnership manager Mats Qvarford said of the work the company is able to tackle by leveraging the consortium’s research centers, experts, Nobel prize laureates and producers. While Qvarford caveated that “there is a lot of work to be done,” graphene-based electronics and sensors have the potential to significantly impact the future of smart packaging. Ultra-thin flexible sensors made with graphene are smaller, lighter and less expensive than traditional sensors, and provide important data throughout production, retail and consumption. Exploring new food sources for the future Enzymes are naturally occurring, non-toxic biological molecules that have the potential to replicate and improve the roles normally played by energy intensive, chemical catalysts in food production. “Enzymes can also be used to turn food that is normally wasted into added value ingredients, thereby making food production processes more sustainable,” Phinney said. But enzymes are unstable and unpredictable, and harnessing their power to make food processing more sustainable has always been a challenge—at least until EnginZyme came along. Hear food technology specialist Randi Phinney speak to Tetra Pak’s philosophy behind partnerships. 0:00\/0:00 Tetra Pak’s collaboration with the Swedish startup began in 2019. EnginZyme had already begun to make significant progress in developing technology for increased sustainability of production processes, and turned to Tetra Pak to test and develop its technology with the food and drink industry’s needs in mind. “By combining Tetra Pak’s food processing expertise with EnginZyme’s innovative enzyme technology, we are together expanding the applicability of enzymes in food processing,” Phinney said. “We’re exploring more sustainable ways to create added value ingredients from food that is normally wasted.” One such added value ingredient could come from the conversion of the large volumes of acid whey produced from fresh cheese. With the help of EnginZyme’s smart enzymes, this huge amount of food normally wasted can be turned into fiber. Through this ability to make sustainable use of acid whey while managing and manipulating the process, Tetra Pak sees the possibility of a future circular economy in food. A shared interest in human-machine interaction Collaboration between industry and academia provide an opportunity to connect research to work and marketplace challenges, and Tetra Pak has several long-standing relationships with universities and world-class research groups. “To drive the development of sustainable food system and packaging, we must be on the forefront of research development that is relevant for our products and services,” Qvarford said. “What you in the past developed on your own…will now require cutting edge research.” Research that is being conducted at academic institutions. One of Tetra Pak’s most valuable collaborations is with AlmageLab at the University of Modena and Reggio Emilia (UNIMORE). Research at the lab focuses on topics surrounding human-machine interaction like computer vision, pattern recognition, machine learning and artificial intelligence. Hear automation and digital director Paolo Scarabelli explain how Tetra Pak is working to improve human-machine interaction. 0:00\/0:00 In one core project, researchers from Tetra Pak and AlmageLab use cameras, wearable inertial sensors and AI driven 3D-modeling technology to get a clearer understanding of machine operators’ physical movements when working with different equipment. This information is then analyzed using advanced AI techniques to identify potentially unsafe or inefficient scenarios, or even those that could cause unnecessary strain. This research supports the design of machinery that is better tailored to the needs of human operators. The Tetra Pak-UNIMORE collaboration has the potential to inform future generations of food processing machinery. Still, the ultimate goal of the work, according to Scarabelli, is “to make our product better for the people who choose our products.” Beyond better product, Tetra Pak aims to make the world better. “Tetra Pak would like people all over the world to have access to safe food of the highest quality,” Phinney said. And the company will continue to innovate, collaborate and work toward that ambition. Learn more about how Tetra Pak is improving our global food supply chains of the future. Credits: By WP Creative Group","filter_flag":1}
{"title":"In a first, textiles ministry to give platform to showcase circular items - Business Standard","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9lY29ub215LXBvbGljeS9pbi1hLWZpcnN0LXRleHRpbGVzLW1pbmlzdHJ5LXRvLWdpdmUtcGxhdGZvcm0tdG8tc2hvd2Nhc2UtY2lyY3VsYXItaXRlbXMtMTIzMDMwMzAxMzE0XzEuaHRtbNIBmQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL2FydGljbGUvZWNvbm9teS1wb2xpY3kvaW4tYS1maXJzdC10ZXh0aWxlcy1taW5pc3RyeS10by1naXZlLXBsYXRmb3JtLXRvLXNob3djYXNlLWNpcmN1bGFyLWl0ZW1zLTEyMzAzMDMwMTMxNF8xLmh0bWw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9lY29ub215LXBvbGljeS9pbi1hLWZpcnN0LXRleHRpbGVzLW1pbmlzdHJ5LXRvLWdpdmUtcGxhdGZvcm0tdG8tc2hvd2Nhc2UtY2lyY3VsYXItaXRlbXMtMTIzMDMwMzAxMzE0XzEuaHRtbNIBmQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL2FydGljbGUvZWNvbm9teS1wb2xpY3kvaW4tYS1maXJzdC10ZXh0aWxlcy1taW5pc3RyeS10by1naXZlLXBsYXRmb3JtLXRvLXNob3djYXNlLWNpcmN1bGFyLWl0ZW1zLTEyMzAzMDMwMTMxNF8xLmh0bWw?oc=5","id":"CBMilQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9lY29ub215LXBvbGljeS9pbi1hLWZpcnN0LXRleHRpbGVzLW1pbmlzdHJ5LXRvLWdpdmUtcGxhdGZvcm0tdG8tc2hvd2Nhc2UtY2lyY3VsYXItaXRlbXMtMTIzMDMwMzAxMzE0XzEuaHRtbNIBmQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL2FydGljbGUvZWNvbm9teS1wb2xpY3kvaW4tYS1maXJzdC10ZXh0aWxlcy1taW5pc3RyeS10by1naXZlLXBsYXRmb3JtLXRvLXNob3djYXNlLWNpcmN1bGFyLWl0ZW1zLTEyMzAzMDMwMTMxNF8xLmh0bWw","guidislink":false,"published":"Fri, 03 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=62, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9lY29ub215LXBvbGljeS9pbi1hLWZpcnN0LXRleHRpbGVzLW1pbmlzdHJ5LXRvLWdpdmUtcGxhdGZvcm0tdG8tc2hvd2Nhc2UtY2lyY3VsYXItaXRlbXMtMTIzMDMwMzAxMzE0XzEuaHRtbNIBmQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL2FydGljbGUvZWNvbm9teS1wb2xpY3kvaW4tYS1maXJzdC10ZXh0aWxlcy1taW5pc3RyeS10by1naXZlLXBsYXRmb3JtLXRvLXNob3djYXNlLWNpcmN1bGFyLWl0ZW1zLTEyMzAzMDMwMTMxNF8xLmh0bWw?oc=5\" target=\"_blank\">In a first, textiles ministry to give platform to showcase circular items<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Standard<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"In a first, textiles ministry to give platform to showcase circular items - Business Standard","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9lY29ub215LXBvbGljeS9pbi1hLWZpcnN0LXRleHRpbGVzLW1pbmlzdHJ5LXRvLWdpdmUtcGxhdGZvcm0tdG8tc2hvd2Nhc2UtY2lyY3VsYXItaXRlbXMtMTIzMDMwMzAxMzE0XzEuaHRtbNIBmQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL2FydGljbGUvZWNvbm9teS1wb2xpY3kvaW4tYS1maXJzdC10ZXh0aWxlcy1taW5pc3RyeS10by1naXZlLXBsYXRmb3JtLXRvLXNob3djYXNlLWNpcmN1bGFyLWl0ZW1zLTEyMzAzMDMwMTMxNF8xLmh0bWw?oc=5\" target=\"_blank\">In a first, textiles ministry to give platform to showcase circular items<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Standard<\/font>","source.href":"https:\/\/www.business-standard.com","source.title":"Business Standard","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"For the first time, the textiles ministry will provide a platform to women-led startups to showcase circular products -- which are largely based on textile waste -- pre or post consumption-- at an exhibition next week. As part of the International Women's Day celebration, the ministry of textiles is organising a week-long celebratory programme at Handloom Haat, Janpath, New Delhi. \"As the consumers especially in developed markets are becoming more and more discerning and conscious of their carbon footprint and the environmental impact as an industry, we would also have to gear up,\" textiles secretary Rachna Shah said. Another textile ministry official observed that internationally there is a movement towards circular economy and lifestyle. Circularity in textiles is also catching up especially with new regulations coming in from the EU and US. \"Most of our export obligations are covered by circularity. We find that many women-led startups have ventured into schemes where they take post consumer waste and try and convert it into new products so waste gets back into production cycle and we retain the value of the product for a longer time,\" said the official. She added that based on the new trend the ministry is looking at women-led startups and giving them an opportunity through the exhibition to showcase their products. \"This is the first time that the ministry is venturing into giving a platform for circular products which are largely based on textile waste - pre or post consumer,\" said the official. EU has already declared its roadmap for circular textiles and it is going to kick in from 2025. In this 75th year of India's independence, 75 stalls will be put up by women handloom weavers, craft persons, entrepreneurs, designers. Many of these are master craft persons and national awardees and women-founded\/led organisations. Circularity in textiles aims to shift from the take-make-dispose linear value chain into a circular system where value is retained for a longer period. Circularity in fashion underlines a major gender narrative by including women at the centre of the transformation. \"To honour and motivate such change makers across the value chain, special focus is on circular strategies, processes and end products that go beyond the traditional linear model and focus on extending the life of the product,\" an official statement said. \"Invitees are women-founded\/led organisations who are focused on reducing waste in the value stream by employing different circular strategies like recycle, repair, reuse\/remanufacture, rental and resale,\" it added.","filter_flag":1}
{"title":"Recycling project builds a thirst for sustainable housing - Media Statements","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vc3RhdGVtZW50cy5xbGQuZ292LmF1L3N0YXRlbWVudHMvOTc0NzHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vc3RhdGVtZW50cy5xbGQuZ292LmF1L3N0YXRlbWVudHMvOTc0NzHSAQA?oc=5","id":"CBMiLmh0dHBzOi8vc3RhdGVtZW50cy5xbGQuZ292LmF1L3N0YXRlbWVudHMvOTc0NzHSAQA","guidislink":false,"published":"Thu, 30 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=89, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vc3RhdGVtZW50cy5xbGQuZ292LmF1L3N0YXRlbWVudHMvOTc0NzHSAQA?oc=5\" target=\"_blank\">Recycling project builds a thirst for sustainable housing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Media Statements<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycling project builds a thirst for sustainable housing - Media Statements","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vc3RhdGVtZW50cy5xbGQuZ292LmF1L3N0YXRlbWVudHMvOTc0NzHSAQA?oc=5\" target=\"_blank\">Recycling project builds a thirst for sustainable housing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Media Statements<\/font>","source.href":"https:\/\/statements.qld.gov.au","source.title":"Media Statements","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Sustainable building materials manufacturer saveBOARD will establish a new facility on the Gold Coast as part of the Federal and State governments’ $40 million Queensland Recycling Modernisation Fund (QRMF) It means containers collected from Queensland’s popular Containers for Change Program together with other packaging waste will soon be turned into building boards for construction The Federal and Queensland Labor Governments have announced saveBOARD will establish its first Queensland facility on the Gold Coast, thanks to more than $1.7 million in grant funding from the QRMF. saveBOARD’s project will transform waste, including coffee cups, used beverage cartons, such as juice poppers, and soft plastics into high-performance building materials. QRMF supports new projects diverting waste plastics, glass, paper and cardboard and tyres to manufacture into new commercial products. It is a joint initiative of the Federal and Queensland Governments with a combined investment of $40 million. Queensland industries involved in the initiative contribute at least half of project costs, delivering in excess of $80 million in new investment for Queensland. Quotes attributable to Federal Minister for the Environment Tanya Plibersek: “The Government’s Recycling Modernisation Fund is turbocharging Australia’s circular economy so that instead of sending waste to landfill, we give it a valuable second life. “To power Queensland’s circular economy, we need cutting edge waste management and recycling like this new facility which will remanufacture packaging into building materials. “That’s why the Federal and Queensland Labor governments are co-investing $40 million to create new or expanded facilities, employ Queenslanders and increase manufacturing using recycled materials.” Quotes attributable to Queensland Minister for the Environment Meaghan Scanlon: “More than 150,000 tonnes of waste will be kept out of landfill annually through the Queensland Recycling Modernisation Fund and channelled into increasing the amount of recycled content in manufacturing. “With this funding, saveBOARD in particular expects to divert 3,250 tonnes of waste away from landfill each year. “Their new facility will divert used beverage cartons collected through the Container Exchange refund points, soft plastics and other mixed fibre materials such as coffee cups into low-carbon building products that are substitutes for plaster board, particle board and plywood. “By supporting re-using, recycling and remanufacturing here in Queensland, it’ll help achieve our goal to divert 80 per cent of waste from landfill and hit 65 per cent recycling by 2030. “We want to stop as much waste as possible from ending up landfill, and in turn increase recycling, create new products and drive down the impact we have on the environment. These new projects certainly tick these boxes. “Once operational, all projects under the RMF are expected to create a total of more than 300 good, new recycling industry jobs.” Quotes attributable to Senator for Queensland, Murray Watt: “The new facility will reduce landfill and create a stable domestic end-market for waste that could be recycled into sustainable products for building houses. “Not only are there obvious environmental benefits, but once operational, 12 full-time jobs will be created at their new Queensland facility. “saveBOARD already has operational facilities in New Zealand and Western Sydney, so we know they have a track record of success.” “It’s great to see the Gold Coast being next cab off the rank for these important investments.” Quotes attributable to saveBOARD CEO Paul Charteris: “This project is providing an opportunity for Queenslanders to help transform the construction industry. “saveBOARD, backed by our industry partners Tetra Pak, SIG Combibloc, Freightways and Closed Loop, will transform common packaging waste into high-performance building materials and reduce waste to landfill. “This partnership will create a stable domestic end market for used beverage cartons, soft plastics and coffee cups and grow the circular economy. “The more support we get, the bigger the impact with larger amounts of packaging waste diverted from landfill. “Our Queensland facility will be making high-performance low carbon building materials from everyday packaging waste. “Not only is it a functional building product, it looks great as well.” Background information: The QRMF will fund projects across Queensland including Far North Queensland, Rockhampton, Moreton Bay Region, Toowoomba Region, Brisbane and Logan City and aims to divert waste from landfill and create new products. QRMF is helping to deliver on actions in the Queensland Resource Recovery Industries 10-year Roadmap and Action Plan. ENDS Media contact: Francis Dela Cruz - 0420 592 078","filter_flag":1}
{"title":"E-waste: Turning a challenge into a sustainable advantage - The Times of India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZvaWNlcy9lLXdhc3RlLXR1cm5pbmctYS1jaGFsbGVuZ2UtaW50by1hLXN1c3RhaW5hYmxlLWFkdmFudGFnZS_SAWpodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvZS13YXN0ZS10dXJuaW5nLWEtY2hhbGxlbmdlLWludG8tYS1zdXN0YWluYWJsZS1hZHZhbnRhZ2Uv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZvaWNlcy9lLXdhc3RlLXR1cm5pbmctYS1jaGFsbGVuZ2UtaW50by1hLXN1c3RhaW5hYmxlLWFkdmFudGFnZS_SAWpodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvZS13YXN0ZS10dXJuaW5nLWEtY2hhbGxlbmdlLWludG8tYS1zdXN0YWluYWJsZS1hZHZhbnRhZ2Uv?oc=5","id":"CBMiamh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZvaWNlcy9lLXdhc3RlLXR1cm5pbmctYS1jaGFsbGVuZ2UtaW50by1hLXN1c3RhaW5hYmxlLWFkdmFudGFnZS_SAWpodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvZS13YXN0ZS10dXJuaW5nLWEtY2hhbGxlbmdlLWludG8tYS1zdXN0YWluYWJsZS1hZHZhbnRhZ2Uv","guidislink":false,"published":"Thu, 30 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=89, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZvaWNlcy9lLXdhc3RlLXR1cm5pbmctYS1jaGFsbGVuZ2UtaW50by1hLXN1c3RhaW5hYmxlLWFkdmFudGFnZS_SAWpodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvZS13YXN0ZS10dXJuaW5nLWEtY2hhbGxlbmdlLWludG8tYS1zdXN0YWluYWJsZS1hZHZhbnRhZ2Uv?oc=5\" target=\"_blank\">E-waste: Turning a challenge into a sustainable advantage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"E-waste: Turning a challenge into a sustainable advantage - The Times of India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2Jsb2dzL3ZvaWNlcy9lLXdhc3RlLXR1cm5pbmctYS1jaGFsbGVuZ2UtaW50by1hLXN1c3RhaW5hYmxlLWFkdmFudGFnZS_SAWpodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvZS13YXN0ZS10dXJuaW5nLWEtY2hhbGxlbmdlLWludG8tYS1zdXN0YWluYWJsZS1hZHZhbnRhZ2Uv?oc=5\" target=\"_blank\">E-waste: Turning a challenge into a sustainable advantage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","source.href":"https:\/\/timesofindia.indiatimes.com","source.title":"The Times of India","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"As India continues to grow and develop, so does its use of electronic devices. These devices have become essential tools for communication, entertainment, and education, from smartphones to computers to televisions. However, with the rapid pace of technological advancement comes an increasing amount of electronic waste or e-waste. E-waste is a serious problem that requires immediate attention and action. In this article, we will explore how India can build a circular economy for e-waste, and what steps are needed to make this a reality. The problem of E-waste in India India is one of the fastest-growing economies in the world, and with this growth comes an increasing amount of electronic devices. The problem is that many of these devices are not disposed of properly, which leads to a growing amount of e-waste. According to a report by the Ministry of Environment, Forest, and Climate Change, India generates 3.2 million metric tons of e-waste per year, and this number is only expected to grow. The problem with e-waste is that it contains hazardous materials that can harm both human health and the environment. These materials include lead, mercury, and cadmium, which can cause respiratory problems, neurological damage, and other health issues. E-waste also contributes to pollution and greenhouse gas emissions, which can exacerbate climate change. Unorganized recycling sector: the “kabadiwala” impact The informal recycling of e-waste in India is usually done without proper safety equipment or training, which exposes workers to hazardous materials such as lead, mercury, and cadmium. This can cause serious health problems, such as respiratory issues, neurological damage, and skin diseases. Moreover, the uncontrolled burning of e-waste releases toxic chemicals into the air, soil, and water, which can cause pollution and contamination of the surrounding environment. Another problem with the unorganized recycling of e-waste in India is the loss of valuable resources. The informal sector often focuses on recovering precious metals, such as gold and silver, while ignoring other useful materials. This leads to a significant loss of resources that could be recycled and reused, reducing the need for new raw materials and minimizing waste. Building a circular economy for E-waste in India A circular economy is an economic system that prioritizes sustainability and reusability, with waste minimized or eliminated. In the case of e-waste, a circular economy means designing products and processes that prioritize sustainability and reusability and promoting practices such as recycling, repurposing, and regenerating materials. Some potential steps that India could take to build a circular economy for e-waste: Develop a comprehensive e-waste management system The first step to building a circular economy for e-waste is to develop a comprehensive e-waste management system. This system should include policies and regulations that govern the collection, transportation, and disposal of e-waste, as well as guidelines for the recycling and repurposing of electronic devices. Increase public awareness about e-waste Another important step is to increase public awareness about the dangers of e-waste and the importance of proper disposal. This can be done through education campaigns, community outreach programs, and other initiatives that engage the public and promote responsible behaviour. Encourage the development of e-waste recycling and repurposing facilities To promote a circular economy for e-waste, it is important to encourage the development of e-waste recycling and repurposing facilities. These facilities can take old electronic devices and turn them into new products, reducing the amount of waste that is sent to landfills and promoting sustainable production practices. Promote product design for sustainability Another important step is to promote product design for sustainability. This means designing products that are built to last, are easy to repair, and are made with recyclable or biodegradable materials. By promoting sustainable product design, India can reduce the amount of e-waste that is generated in the first place. Building a circular economy for e-waste is a complex task that requires a multifaceted approach. It requires the development of policies and regulations, the promotion of sustainable behaviour, the establishment of recycling and repurposing facilities, and the promotion of sustainable product design. By taking these steps, India can reduce the amount of e-waste that is generated, protect human health and the environment, and promote sustainable economic development. It is time for India to take action and build a circular economy for e-waste. While there are some efforts to manage e-waste in India, the recycling of electronic waste is primarily done by the informal sector. This unorganized recycling practice is often done by individuals and small businesses who collect e-waste, dismantle it manually, and sell the recovered materials to scrap dealers. Unfortunately, this practice is often dangerous and harmful to both human health and the environment. Facebook Twitter Linkedin Email Disclaimer Views expressed above are the author's own.","filter_flag":1}
{"title":"Could waste plastic become a useful fuel source? - BBC","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL2J1c2luZXNzLTY0NzAzOTc20gEwaHR0cHM6Ly93d3cuYmJjLmNvLnVrL25ld3MvYnVzaW5lc3MtNjQ3MDM5NzYuYW1w?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL2J1c2luZXNzLTY0NzAzOTc20gEwaHR0cHM6Ly93d3cuYmJjLmNvLnVrL25ld3MvYnVzaW5lc3MtNjQ3MDM5NzYuYW1w?oc=5","id":"CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL2J1c2luZXNzLTY0NzAzOTc20gEwaHR0cHM6Ly93d3cuYmJjLmNvLnVrL25ld3MvYnVzaW5lc3MtNjQ3MDM5NzYuYW1w","guidislink":false,"published":"Tue, 14 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=73, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL2J1c2luZXNzLTY0NzAzOTc20gEwaHR0cHM6Ly93d3cuYmJjLmNvLnVrL25ld3MvYnVzaW5lc3MtNjQ3MDM5NzYuYW1w?oc=5\" target=\"_blank\">Could waste plastic become a useful fuel source?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BBC<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Could waste plastic become a useful fuel source? - BBC","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL2J1c2luZXNzLTY0NzAzOTc20gEwaHR0cHM6Ly93d3cuYmJjLmNvLnVrL25ld3MvYnVzaW5lc3MtNjQ3MDM5NzYuYW1w?oc=5\" target=\"_blank\">Could waste plastic become a useful fuel source?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BBC<\/font>","source.href":"https:\/\/www.bbc.co.uk","source.title":"BBC","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Plastic waste dumps, says Prof Erwin Reisner, could be the oil fields of the future. \"Effectively, plastic is another form of fossil fuel,\" says Prof Reisner, who is professor of energy and sustainability at the University of Cambridge. \"It's rich in energy and in chemical composition, which we want to unlock.\" But the chemical bonds that make up plastics are made to last, external and, of the seven billion tonnes ever created, less than 10% has been recycled. Dilyana Mihaylova, plastics programme manager for the Ellen MacArthur Foundation, says: \"Our extractive, take-make-waste economy [means] billions of dollars' worth of valuable materials are lost.\" Worldwide, more than 400 million tonnes of plastic, external is produced every year - roughly the same weight as all of humanity, external. Today, around 85% ends up in landfill, external or is lost to the environment where it will stay for hundreds, perhaps thousands, of years, external. Now the race is on to find the best way to break those chemical bonds and reclaim the Earth's precious resources locked into plastic. Mechanical recycling, where waste plastic is washed, shredded, melted and reformed, degrades plastic over time, external and can result in inconsistent quality products. The plastics industry is keen on chemical recycling, external, where additives are used to alter the chemical structure of waste plastic, turning it back into substances that can be used as raw materials, perhaps for making fuel like petrol and diesel. But that approach is currently costly and inefficient, external and has been criticised by environmental groups, external. \"So,\" says Ms Mihaylova, \"just as we can't recycle our way out of the plastics pollution crisis, we can't rely on plastics-to-fuel processes to solve the problem either.\" Could a new solar-powered system show the way forward?","filter_flag":1}
{"title":"World Recycling Day: Recycler hungry for Australia's stinky old shoes - SBS News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnNicy5jb20uYXUvbmV3cy9hcnRpY2xlL3BsYW5uaW5nLXRvLWNodWNrLXlvdXItb2xkLXN0aW5reS1zaG9lcy1pbi10aGUtYmluLWRvbnQtdGhleXJlLWluLWhvdC1kZW1hbmQvY2txaTN3NmJu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnNicy5jb20uYXUvbmV3cy9hcnRpY2xlL3BsYW5uaW5nLXRvLWNodWNrLXlvdXItb2xkLXN0aW5reS1zaG9lcy1pbi10aGUtYmluLWRvbnQtdGhleXJlLWluLWhvdC1kZW1hbmQvY2txaTN3NmJu0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LnNicy5jb20uYXUvbmV3cy9hcnRpY2xlL3BsYW5uaW5nLXRvLWNodWNrLXlvdXItb2xkLXN0aW5reS1zaG9lcy1pbi10aGUtYmluLWRvbnQtdGhleXJlLWluLWhvdC1kZW1hbmQvY2txaTN3NmJu0gEA","guidislink":false,"published":"Sun, 19 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=78, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnNicy5jb20uYXUvbmV3cy9hcnRpY2xlL3BsYW5uaW5nLXRvLWNodWNrLXlvdXItb2xkLXN0aW5reS1zaG9lcy1pbi10aGUtYmluLWRvbnQtdGhleXJlLWluLWhvdC1kZW1hbmQvY2txaTN3NmJu0gEA?oc=5\" target=\"_blank\">World Recycling Day: Recycler hungry for Australia's stinky old shoes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SBS News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"World Recycling Day: Recycler hungry for Australia's stinky old shoes - SBS News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnNicy5jb20uYXUvbmV3cy9hcnRpY2xlL3BsYW5uaW5nLXRvLWNodWNrLXlvdXItb2xkLXN0aW5reS1zaG9lcy1pbi10aGUtYmluLWRvbnQtdGhleXJlLWluLWhvdC1kZW1hbmQvY2txaTN3NmJu0gEA?oc=5\" target=\"_blank\">World Recycling Day: Recycler hungry for Australia's stinky old shoes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SBS News<\/font>","source.href":"https:\/\/www.sbs.com.au","source.title":"SBS News","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Key Points Australia imports 25 million sports shoes every year. Old shoes can be remade into new products including gym mats and flooring. Save Our Soles has already recycled more than 600,000 pairs of shoes. Sweat-stained running shoes, double-pluggers that have blown out, work boots that smell so bad they could kill a cat at 20 paces. They're pure gold to recyclers and Australians are being urged to surrender them. As the nation looks towards creating a more sustainable, circular economy, more and more niche recycling programs are popping up and shoes are no exception. The TreadLightly program, backed by the Australian Sporting Goods Association and recycler Save Our Soles, has already recycled more than 600,000 pairs of shoes. But that's a drop in the ocean, with the association saying 25 million sports shoes are imported into Australia every year. Australia's recycling problem Australia's record when it comes to recycling shows it still has a long way to go. Around 2.44 million of the 4.9 million tonnes of materials sent to landfill each year are either recyclable or compostable, according to environmental organisation Planet Ark. And only up to 18 per cent of the material in council-provided waste bins is recyclable, while just over half could be composted. Plastic is the prime concern, with Australians using 3.5 million tonnes of it in the 2018-2019 financial year with a recycling rate of just 13 per cent, Planet Ark says. The nation's major supermarkets have also been under fire, following the collapse of the REDCycle scheme. Grocery giants Coles and Woolworths were partners in the REDcycle scheme which urged consumers to return plastic from supermarket and other household products for reuse. REDcycle abruptly halted operations in November and has since admitted it was stockpiling plastic, with 32 stashes totalling 12,393 tonnes found in NSW, Victoria, and South Australia. READ MORE Your soft plastics may not end up in landfill after all, after supermarkets intervened What products are old shoes being transformed into? Australian Sporting Goods Association executive director Shaun Bajada says Australians should know eligible shoes - including most sports shoes, school shoes, thongs, slides and even gumboots, can be remade into new products including gym mats and flooring. \"Shoes can be recycled, no matter how dirty or over-worn they are.\" A network of retailers across Australia act as collection points for old shoes, which are then sent to Save our Soles, which shreds them. Various components such as metals and textile fluff are extracted and separated, with shoe waste blended with rubber from recycled tyres to make new products. ","filter_flag":1}
{"title":"BINGO focus on alternative fuel - Waste Management Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9iaW5nby1mb2N1cy1vbi1hbHRlcm5hdGl2ZS1mdWVsL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9iaW5nby1mb2N1cy1vbi1hbHRlcm5hdGl2ZS1mdWVsL9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9iaW5nby1mb2N1cy1vbi1hbHRlcm5hdGl2ZS1mdWVsL9IBAA","guidislink":false,"published":"Tue, 14 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=73, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9iaW5nby1mb2N1cy1vbi1hbHRlcm5hdGl2ZS1mdWVsL9IBAA?oc=5\" target=\"_blank\">BINGO focus on alternative fuel<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BINGO focus on alternative fuel - Waste Management Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd2FzdGVtYW5hZ2VtZW50cmV2aWV3LmNvbS5hdS9iaW5nby1mb2N1cy1vbi1hbHRlcm5hdGl2ZS1mdWVsL9IBAA?oc=5\" target=\"_blank\">BINGO focus on alternative fuel<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Waste Management Review<\/font>","source.href":"https:\/\/wastemanagementreview.com.au","source.title":"Waste Management Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Simon Sherwood, BINGO Industries General Manager of Operational Development, says the new division is finding a solution to divert the company’s last 20 per cent of waste from landfill. Bingo Industries is opening the gateway to the alternative fuel market with new green technology that will push its material recovery rate towards 90 per cent. Waste will play a critical role in supporting the clean energy transition, says Simon Sherwood, BINGO Industries General Manager of Operational Development. As the world transitions away from traditional energy sources, Simon says the value of residual waste as fuel is being identified and unlocked. And as heavy industries move to reduce their emissions profile because of sustainability concerns, resource preservation and increased costs – waste is at the forefront as an alternate green fuel source with a circular economy benefit. In collaboration with FOCUS Enviro, BINGO has taken delivery of an UNTHA XR3000C shredding system to develop new alternative fuel products from waste. Simon describes it as conquering the last mile – finding a solution to divert a substantial component of the company’s last 20 per cent of waste from landfill. “We have a vision for a waste-free Australia and are passionate about leading the change,” he says. “We are actively driving for a circular economy by further increasing our recovery rates as well as the quality of recovered products. “By increasing diversion of our residual waste stream from landfill, we can produce significant economic, environmental and carbon benefits.” Simon has 17 years’ experience within the waste industry and has expertise in optimising recovery from a broad variety of waste streams. He moved straight into a leadership role at a young age, supervising a family-owned steel recycling yard and small waste transfer station in the UK. As the business expanded, he operationalised a new organics processing facility that is now a successful anaerobic digestion enterprise. Simon arrived in Australia in 2011 for a working holiday and was quickly sponsored by a waste management company. Working his way into a site operation managers role he oversaw operations of BINGO’s Eastern Creek Recycling Ecology Park, which can accept up to two million tonnes of waste per year. As part of a BINGO acquisition of Dial-A-Dump Industries in 2019, he moved into the General Manager Resource Recovery role, overseeing all 10 New South Wales sites – a mixture of transfer stations, resource recovery facilities and landfills. He now helps lead BINGO’s major recycling projects, including the recent end-to-end delivery of BINGO’s Material Processing Centre 2, a $150 million, 300 tonne per hour construction and demolition and commercial and industrial recycling facility, capable of achieving a more than 80 per cent diversion from landfill and the largest C&D advanced recycling facility in the southern hemisphere. Playing a part in the initial design stages and leading the commissioning, Simon says the project was particularly challenging as the plant was installed and commissioned through the COVID-19 pandemic. He’s excited by the next challenge – developing a new division for BINGO that he says will improve recovery rates to more than 90 per cent. BINGO diverts more than two million tonnes per annum of construction and demolition (C&D) and commercial and industrial (C&I) waste from landfill, by producing clean separated materials and recycled products that are then sold to large-scale developments and infrastructure projects to close the loop. Simon says BINGO achieves an industry-leading recovery rate of circa 80 per cent through its advanced recycling facility, MPC 2, resulting in about 20 per cent of the company’s entire waste network ending up as residual waste in landfill. With operations along the entire East Coast, it’s this 20 per cent the new division will target, converting it into Refuse Derived Fuel (RDF). RDF is residual waste that has undergone processing and shredding to ensure it satisfies industry specifications. Many heavy industries including cement kilns, power stations, paper mills, steel manufacturing, sugar mills and energy-from-waste facilities (EfW) can use RDF as a substitute for coal to meet their emission reduction targets. Simon says BINGO’s foray into alternative fuels has been in the pipeline for several years, but the project has been restricted by an inability to supply locally. That changed in 2022, when opportunities to supply alternative fuel to heavy industries arose. “Dealing with this volume is the perfect introduction for BINGO to ensure it can meet all the quality standards required,” Simon says. “There are very strict specifications around the materials that can and can’t be used.” When it comes to processing those materials, BINGO is working with specialist waste and recycling equipment provider FOCUS Enviro. “We’re committed to enhancing diversion of waste from landfill through creating sustainable products from problematic waste streams,” Simon says. “I have worked with (State Manager) John McGuinness and the team from FOCUS Enviro for many years. When the opportunity to enter the alternative fuels market was on the horizon I knew John had the experience and processing technology to match. “Following a trial of the machine on site we knew straight away that the UNTHA was the right machine that could process our material into the specification required and the business would benefit from the unique low operating costs this machine delivers.” When manufacturing biomass-based fuel BINGO was previously processing wood using multiple shredding steps – slow speed into high-speed systems to try and achieve the fraction size – but this was not commercially viable long-term. The machine breaks down and operational downtime due to tramp material in the feedstock was part of daily routine. “The switch to a single-step electric drive mobile shredder from UNTHA means BINGO can now transform about 30 tonnes of wood waste per hour with less than six per cent fines and 20 per cent more uptime,” John says. Simon adds: “We are recovering a further 16 tonnes of clean metals from the magnet belt per week for recycling and resale. The combination of UNTHA’s shredding, backed by FOCUS Enviro’s service, make this the perfect machine to assist BINGO enter new markets.” FOCUS Enviro only works with experienced manufacturers and suppliers that specialise in the waste industries and understand the challenges of processing material in these sectors. John says that as a growing number of opportunities for the manufacture and supply of alternative fuels into local markets become a reality in Australia, he is not surprised to see Simon and the team at BINGO at the front of the pack. “Previous attempts to produce a specified size piece from hard to shred materials using a diesel-driven mobile shredder was outdated. “This switch to an electric-driven alternative design, proven in these applications, reduced energy consumption by more than 60 per cent and cost savings of about $185,000 a year,” he says. “The ongoing journey with BINGO and FOCUS Enviro in commissioning the new shredding system is proof that much more efficient and profitable solutions can be delivered while at the same time adhering to the high environmentally conscious principles that are part of the culture at BINGO. “It has been a pleasure to work with Simon and we are honoured that we have been selected to work on these projects.” Simon says when he first started working in Australia’s waste industry it was like “stepping back in time”. The standards were well below those of Europe and the UK. Over the years he’s seen Australia close the gap with the rest of the world, driven by legislation aimed at reducing waste to landfill and achieving a circular economy. He says it’s rewarding to have contributed to BINGO’s journey in developing new products that are now being sold to customers as alternatives to virgin materials such as BINGO’s Eco-Product range comprising recycled mulches, aggregate and sands. “Our RDF will assist us in solving for the last mile.” For more information, visit: www.focusenviro.com.au","filter_flag":1}
{"title":"Recycling project to transform waste into building products - Build Australia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmJ1aWxkYXVzdHJhbGlhLmNvbS5hdS9uZXdzX2FydGljbGUvcmVjeWNsaW5nLXByb2plY3QtdG8tdHJhbnNmb3JtLXdhc3RlLWludG8tYnVpbGRpbmctcHJvZHVjdHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmJ1aWxkYXVzdHJhbGlhLmNvbS5hdS9uZXdzX2FydGljbGUvcmVjeWNsaW5nLXByb2plY3QtdG8tdHJhbnNmb3JtLXdhc3RlLWludG8tYnVpbGRpbmctcHJvZHVjdHMv0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmJ1aWxkYXVzdHJhbGlhLmNvbS5hdS9uZXdzX2FydGljbGUvcmVjeWNsaW5nLXByb2plY3QtdG8tdHJhbnNmb3JtLXdhc3RlLWludG8tYnVpbGRpbmctcHJvZHVjdHMv0gEA","guidislink":false,"published":"Thu, 30 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=89, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmJ1aWxkYXVzdHJhbGlhLmNvbS5hdS9uZXdzX2FydGljbGUvcmVjeWNsaW5nLXByb2plY3QtdG8tdHJhbnNmb3JtLXdhc3RlLWludG8tYnVpbGRpbmctcHJvZHVjdHMv0gEA?oc=5\" target=\"_blank\">Recycling project to transform waste into building products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Build Australia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycling project to transform waste into building products - Build Australia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmJ1aWxkYXVzdHJhbGlhLmNvbS5hdS9uZXdzX2FydGljbGUvcmVjeWNsaW5nLXByb2plY3QtdG8tdHJhbnNmb3JtLXdhc3RlLWludG8tYnVpbGRpbmctcHJvZHVjdHMv0gEA?oc=5\" target=\"_blank\">Recycling project to transform waste into building products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Build Australia<\/font>","source.href":"https:\/\/www.buildaustralia.com.au","source.title":"Build Australia","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Queensland’s Gold Coast will be the host of a project which will transform waste, including coffee cups, used beverage cartons, such as juice poppers, and soft plastics into high-performance building materials. saveBOARD’s project has received more than $1.7 million in grant funding from the QRMF which supports new projects diverting waste plastics, glass, paper and cardboard and tyres to manufacture into new commercial products. The QRMF is a joint initiative of the Federal and Queensland Governments with a combined investment of $40 million. Queensland industries involved in the initiative contribute at least half of project costs, delivering in excess of $80 million in new investment for Queensland. Federal Minister for the Environment Tanya Plibersek said the Government’s Recycling Modernisation Fund is turbocharging Australia’s circular economy to divert waste from landfill. “To power Queensland’s circular economy, we need cutting edge waste management and recycling like this new facility which will remanufacture packaging into building materials. Queensland Minister for the Environment Meaghan Scanlon said more than 150,000 tonnes of waste will be kept out of landfill annually through the Queensland Recycling Modernisation Fund and channelled into increasing the amount of recycled content in manufacturing. “With this funding, saveBOARD in particular expects to divert 3,250 tonnes of waste away from landfill each year. “Their new facility will divert used beverage cartons collected through the Container Exchange refund points, soft plastics and other mixed fibre materials such as coffee cups into low-carbon building products that are substitutes for plaster board, particle board and plywood. “By supporting re-using, recycling and remanufacturing here in Queensland, it’ll help achieve our goal to divert 80 per cent of waste from landfill and hit 65 per cent recycling by 2030. “We want to stop as much waste as possible from ending up landfill, and in turn increase recycling, create new products and drive down the impact we have on the environment. These new projects certainly tick these boxes. “Once operational, all projects under the QRMF are expected to create a total of more than 300 good, new recycling industry jobs.”","filter_flag":1}
{"title":"Secondhand Clothing: A New Trend? - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU5NS9zZWNvbmRoYW5kLWNsb3RoaW5nLWEtbmV3LXRyZW5k0gFcaHR0cHM6Ly93d3cuZmlicmUyZmFzaGlvbi5jb20vaW5kdXN0cnktYXJ0aWNsZS85NTk1L3NlY29uZGhhbmQtY2xvdGhpbmctYS1uZXctdHJlbmQ_YW1wPXRydWU?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU5NS9zZWNvbmRoYW5kLWNsb3RoaW5nLWEtbmV3LXRyZW5k0gFcaHR0cHM6Ly93d3cuZmlicmUyZmFzaGlvbi5jb20vaW5kdXN0cnktYXJ0aWNsZS85NTk1L3NlY29uZGhhbmQtY2xvdGhpbmctYS1uZXctdHJlbmQ_YW1wPXRydWU?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU5NS9zZWNvbmRoYW5kLWNsb3RoaW5nLWEtbmV3LXRyZW5k0gFcaHR0cHM6Ly93d3cuZmlicmUyZmFzaGlvbi5jb20vaW5kdXN0cnktYXJ0aWNsZS85NTk1L3NlY29uZGhhbmQtY2xvdGhpbmctYS1uZXctdHJlbmQ_YW1wPXRydWU","guidislink":false,"published":"Thu, 16 Mar 2023 09:59:40 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=16, tm_hour=9, tm_min=59, tm_sec=40, tm_wday=3, tm_yday=75, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU5NS9zZWNvbmRoYW5kLWNsb3RoaW5nLWEtbmV3LXRyZW5k0gFcaHR0cHM6Ly93d3cuZmlicmUyZmFzaGlvbi5jb20vaW5kdXN0cnktYXJ0aWNsZS85NTk1L3NlY29uZGhhbmQtY2xvdGhpbmctYS1uZXctdHJlbmQ_YW1wPXRydWU?oc=5\" target=\"_blank\">Secondhand Clothing: A New Trend?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Secondhand Clothing: A New Trend? - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU5NS9zZWNvbmRoYW5kLWNsb3RoaW5nLWEtbmV3LXRyZW5k0gFcaHR0cHM6Ly93d3cuZmlicmUyZmFzaGlvbi5jb20vaW5kdXN0cnktYXJ0aWNsZS85NTk1L3NlY29uZGhhbmQtY2xvdGhpbmctYS1uZXctdHJlbmQ_YW1wPXRydWU?oc=5\" target=\"_blank\">Secondhand Clothing: A New Trend?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"The world is poised to see a revolution of a new kind in fashion consumption with consumers lapping up used clothing and apparel for varied reasons. This feature decodes the trend. Secondhand clothing market constitutes a slice of a larger pie – the resale market. The resale or re-commerce, as often addressed, is the retail of used items. While few years ago, secondhand items used to be traded mainly on flea markets and in thrift shops, today much of the trading has shifted to online platforms. Both fashion industry and non-fashion businesses have been pioneering resale models over recent years. The trend has even caught up with giants in the game with furniture retailer IKEA launching a take-back offering as well as a pilot secondhand pop-up store two years back. It is estimated that the resale industry will grow more than 10x times faster than traditional retail till 2025. So much so that by 2030, nearly one in five items in people’s closets will be secondhand. Talking of fashion, Boston Consulting Group (BCG) estimates the secondhand and luxury market, including apparel, footwear and accessories resale, to be worth $100 billion to $120 billion worldwide, which is growing fast and has nearly tripled in size since 2020. BCG observes that though buyers generally enter the secondhand market through bags before switching to apparel and ultimately to jewellery, the demand for the secondhand market is clear with preowned clothing making up 25 per cent of the average secondhand consumer’s wardrobe. So, what is driving consumers to secondhand purchase? Consumer Perspective Half of the respondents in a Vestiaire Collective-BCG collaborated consumer survey—to find out their perspective on the secondhand market—cited affordability and value as the number one reason for buying secondhand items. Product variety also remains important and emerged as the second biggest driver behind secondhand consumption, powered by the increasing popularity of resale apps. Among others, sustainability is an increasingly popular driving force for purchasing secondhand clothing, as is the thrill of the hunt and the opportunity to barter with resellers. Findings further suggested that the threat of recession could result in a reversal of the affordability trend, just as the cost-of-living crisis might motivate people to turn their wardrobe as an additional source of income. The online segment has also seen considerable advancements in privacy and product-authentication protocols, which make it easier and safer for individuals to resell their goods online. In addition, secondhand fashion appeals to the shoppers’ desire for exclusivity. In recent times, it has attracted many celebrity supporters such as Zendaya, who has regularly appeared with vintage clothes on the red carpet, and singers Lorde and Rihanna who are also fans of the secondhand trend. This raises another pertinent question – what makes people trade used products? Used Products Trending Buying secondhand products is no more considered a taboo, rather young people are proud to buy them. The key reason for this trend – such products come cheaper and greener. They are cheaper since they can be purchased for a fraction of the retail price though not all resale models sit in low price brackets. In fact, recent years have seen an unprecedented rise in luxury fashion resale too. Renowned brands like Burberry and Gucci are partnering with consignment services like The RealReal to collect and resell their pre-owned products. The consumers can also directly sell used luxury goods to their peers on platforms such as Vestiaire Collective. At the same time, like buyers, private sellers are often driven by financial motives while cleaning out their closets. Saving money is not the only incentive in resale but extending a product’s lifecycle provides additional environmental benefits— reducing the economy’s draw on natural resources and delaying creation of waste. Sustainable-Circular Design With planetary crises such as climate change, pollution and loss of biodiversity rising to the top of consumers’ agendas, companies are now gearing to adapt their business models pertaining to secondhand clothing. Despite the increased emission due to the logistics of circulating used products among new owners, resale models overall outperform traditional ‘take, make, waste’ models on most environmental metrics. Resale models incentivise businesses to design more long-lasting products. The durability of products stands as a necessary pre-condition for resale models since a longer product lifecycle allows the new owner to resell more often. This has set new goal with implications for product design to last longer, compelling clothes to be made of durable garments. The technology involved in the process is required to follow a modular design which allows the reselling business to easily repair and replace components. Focusing on design for resale has fostered innovation and led to better product quality. France: A Case-In-Point France has come up with anti-waste regulations that aim to encourage design for circularity. It has an Extended Producer Responsibility (EPR) scheme for clothing which mandates companies producing and selling clothing in the country to pay a fee covering the management and treatment of the end-of-life of their products. This fee increases significantly when low-quality, less durable garments are being used. The law is considered a prime example of a financial reward-penalty system and is expected to expand to other countries and sectors. During the COVID-19 pandemic phase there was a fear that consumers might withdraw from buying used items for hygienic reasons. On the contrary, the opposite happened in France if one goes by numbers. The online platforms for secondhand clothing with over 12.5 million users in the country reported a significant growth during the containment (between March and May 2021) phase. It was found that individuals cleaned out their wardrobes twice as often as before the pandemic. While retail sector in general shrank by 15 per cent, the web-based fashion resale is said to have grown 69 per cent in 2021 compared to 2019. The nation is contributing to resale revolution with secondhand trade booming in recent years. Statista Global Consumer Survey conducted there in 2022 found that 29 per cent of consumers surveyed had bought secondhand clothing in the past 12 months either online or in-person. Even French hypermarket chain Auchan – one of country’s largest food retailers, had to install secondhand clothing department in its stores in 2021. Supplied by the e-commerce platform Patatam from its 3,500 sq metre warehouse in Hastingues, in the Landes region of France, the dresses, pants and other secondhand clothes went on sale in five Auchan hypermarkets initially before expanding to over 100 Auchan hypermarkets by spring of 2021. Other supermarkets such as Super U, Carrefour, Leclerc and Cora soon followed. No wonder then that the fashion companies too are strategically catching up with the resale trend. Smart Approach Some companies are adopting a special approach to implement their resale business models. Many traditional companies which started engaging in resale business initially launched pilots and spin-off solutions that kept the main business separate but allowed the company to have lighthouse projects where they could learn how to cope with a new but different business. Both H&M and Zalando introduced independent platforms for selling quality-controlled pre-owned fashion – H&M’s Sellpy and Zalando’s Zirkle. Players like Lulumelon, Cos and Isabel Marant also claim to have seen success selling collections on their websites and in their stores, aided by in-house capabilities or white-label solutions. In fact, Isabel Marant reported that two-third of its secondhand buyers became its new direct clients within one year of launching its vintage resale arm. In retail, responding to shifting demands with more sustainable offerings can attract new customers and also improve customer loyalty. Resale business models can also help in creating a so-called lock-in pattern. For example, in exchange for used products, some companies offer their customers vouchers that can only be used in-store. This helps the customers gain new value from used assets and the sales loop stays closed within the retailer business ecosystem, also generating new revenue streams for the resellers. Role of Retailers BCG consumer survey also found that while consumers are generally comfortable buying secondhand online, the fears of counterfeit or poor-quality goods can prove to be a major deterrent. As much as 10 per cent of branded goods sold are counterfeit and an estimated 80 per cent of consumers have handled fake or falsified goods, knowingly or unknowingly. This sets the premise for the retailers entering the resale space to help mitigate consumers’ fear of counterfeiting. Such attempt requires brands and retailers to devise and implement innovative resale business models that should be trust-inspiring and confidence-building among consumers. As the competition in resale market, and online platforms in particular, is increasing, the companies must remain relevant to their existing audiences and develop tactics that will increase their reach to new audience as well. Additionally, steps to mitigate risk and protect their reputation must also be taken. Once implemented, the resale business model must also allow the companies to retain control of their brand and pricing structure and still make the optimum margin on the same garment. In case of online, the additional insights gained can be utilised to stay ahead of a fast-changing game. For instance, the brands can enrich the data they hold for first-time purchases and use it effectively in retargeting campaigns and formulating CRM (customer relationship management) strategies. Despite the mentioned advantages, this approach also has drawbacks. It can be resource intensive, cause inventory issues in situation of sales being underwhelming, and risk product cannibalisation, with consumers getting lured away from the brand or retailer’s new products. Resale Models In real world, not every fashion player has the resources to implement and manage its own resale operation. This makes partnering with a resale platform a good option. Such a partnership offers a mutually beneficial solution wherein the platform handles the logistics, payment processing and product validation i.e., performing quality and authentication checks, and the fashion partner provides additional traffic, promotion and credibility owing to its brand pull. Through this way, the brands and retailers, for their part, can resell products, boost recognition and cheaply acquire new customers without having to actually run the resale operation. They can source products from individual sellers in exchange for store credit, which in turn can build customer loyalty. The luxury retailer Mytheresa partnering with Vestiaire collective, and Burberry partnering with The RealReal operate under this model. The other model involves the fashion companies to explore opportunities that come with growing their business through resale without making a significant investment or long-term commitment. Under this model, the options for brands and retailers include giving third-party resale platforms a modestly sized space in stores and developing discount-and-incentive schemes for customers who sell their secondhand clothing back. This also helps in increasing footfall and audience reach, besides allowing the players to participate in circular economy while mitigating the risk that comes with counterfeit goods. Secondhand in Australia In addition to the US and Europe, Australia is also on the growth curve with an increasing demand for pre-owned clothing and other items. The continent-nation is witnessing mushrooming of secondhand retail avenues – online as well as offline, with concentration in Melbourne and Sydney. The Australian fashion industry is the second biggest consumer of textile and clothing in the world according to a 2021 study by secondhand outlet Reluv. This leads to each Australian sending about 23 kilograms of clothing to landfill annually, totalling over 800,000 tonnes of clothes going to waste every year. Another study by YouGov – a knowledge sharing portal, shows that at least 24 per cent of Aussies have worn an item only once before throwing it out. Reluv study further claimed that at least 72 per cent of Australians purchased a secondhand item in the previous 12 months. At least 52 per cent of shoppers bought clothes from shops like Vinnies, 33 per cent used online platforms and 15 per cent thrifted at markets or dedicated vintage stores. The Australian market is seeing many entrepreneurs, even immigrants, entering the secondhand space as is the case of Swapup – a Sydney-based online secondhand store started by Alifa in 2018 when she moved to Australia and wanted to buy secondhand for her wardrobe and home but struggled to get it easily. She set up Swapup – a thrift and consignment store that delivers a stylish and current secondhand collection of women’s and kids’ fashion sourced from Aussie’s wardrobes. There are many established as well as budding names which are shaping Australian secondhand market – Vinnies, Savers, Salvos Stores, Goodbyes, Out of Closet (OTC Vintage), Hunter Markets and Retrostar to name a few. Key Secondhand Players in Other Markets Swap: Swap is an online consignment and thrift store that offers apparel and accessories for women, maternity, men, children and babies at up to 90 per cent off retail prices. It is headquartered in Downers Grove, IL and has offices in Chicago (US) and Helsinki (Finland). Launched in 2012, the online store began its journey from a 6,000 sq feet warehouse in 2013 and expanded to 360,000 sq feet by 2015, adding women’s clothes and accessories before including men’s clothes and accessories a year later. Initially called ‘swap.com online consignment’ it was rechristened swap.com in 2017. As of today, it has over 2 million unique products with an average order size of $55 with orders ranging for $7 to $360 and nearly 20,000 new listed items added daily. It offers free shipping on orders over $75 and 30 per cent off to new customers on their first order. The marketplace enables a community of thrifters to find affordable, quality secondhand apparel for the whole family. Its brands portfolio is rich and boasts of having every brand name beginning from all 26 letters of English alphabet. Its best sellers are fashion-forward items that have been in the mall or department stores in the previous three years. Swap has well defined dedicated acceptance criteria for clothing, shoes, accessories, rejected as well as recalled items, clearly displayed on its site to help sellers select the in-demand items that its customers search for. However, the prevalent acceptance criteria are subject to frequently changing fashion. Additionally, it runs a Swap-affiliate programme that involves 5 per cent commission per order. Thredup: Thredup is an online store that offers women’s and kids’ secondhand clothing, shoes and accessories. Thredup has changed the way consumers shop by ushering in a more sustainable future for the fashion industry. By extending the lifecycle of millions of garments through its scalable resale business model, it has emerged as a solution to the fashion industry’s wastefulness. To date, it has processed 137 million unique items across 100 categories besides displacing 637 million lbs of CO 2 by empowering consumers to buy and sell secondhand. In the process, it has helped its buyers save an estimated $4.1 billion off retail price. Founded in 2009 by James Reinhart – its present CEO and Co-founder, it added women’s resale in 2013 to its kids’ business that soon surpassed the later. The designer fashion with curated pieces from high-end brands was included the next year, followed by its first distribution centre with automation opening in 2015; an office for a team of its engineers and data scientists opening in Kiev, Ukraine in 2016; and its pop-up stores popping up in Texas and California in 2017. The Thredup selling process starts with a Clean Out Kit – a giant polka dot bag for the givers who can fill it with clothes on its accepted brands list and ship it for free. Upon receiving, the items are professionally photographed on mannequins to help interested shoppers see how they fit. Once sold, the money can be kept, used as store credit or used at other sustainable retailers like Reformation via their Upcycle programme. Anything that is not accepted is either returned to the giver or recycled responsibly. If the giver mandates to forego a profit, a Donation Kit is ordered and instead of giving the giver a percentage of the sale earnings, Thredup donates $5 to any charity of giver’s choice. Besides keeping clothes in circulation, it does more to combat fast fashion via its Circular Fashion Fund – a 501(c)3 non-profit status pending organisation. As a managed marketplace, Thredup delivers shoppers great brands at great prices in an ever-changing assortment. Each item undergoes quality inspection enabling buyers shop value, premium and luxury brands all in one place, at up to 90 per cent off estimated retail price. The platform has Resale-as-a-Service (RaaS) that enables even brands like Walmart, GAP and Reformation to deliver modern resale to their customers. Technically speaking, Thredup is a custom-built operating platform with ability to process more than 100,000 unique items per day. Built for ‘single SKU’ logistics, the platform consists of distributed processing infrastructure, proprietary software and data science expertise, whose technology includes machine learning and artificial intelligence. These technologies enable visual recognition, multi-layered algorithms to determine resale prices and automatic photography that can produce hundreds of thousands of photos a day. Beyond Retro: UK-based Beyond Retro was born in 2002 as its first store in Cheshire Street. Since then, it has grown to a global business with 15 stores across the UK and Nordics with Helsinki joining more recently. It offers an interesting model that thrives on fast fashion originals. It sources products up to six months in advance, aided by sophisticated information management system that gives constant internal trend updates. It has a network of trained treasure pickers who work in warehouses of global sorting facilities literally scaling mountains of secondhand clothes to find the vintage ‘diamonds’ matching retailer’s trends. The pickers look at colour, size, fit, quality and label to meet their buyers’ needs. The painstaking effort results only 1 in a 1,000 making the cut. Once thousands of these finds are saved from reaching landfills or shredders, they are shipped to the company’s warehouses in London and Sweden. Specially developed software tracks the crucial fashion statistics of each unique item: trend, decade, size, style and source among others. Multiple shipping containers are processed per week wherein product experts examine each box for quality control before hanging items for pricing. With thousands of new pieces added to Beyond Retro shop floors and online every week, it is ensured that there’s fresh vintage drops every time the shoppers shop. This is how the women’s and men’s online thrift store is able to boast a boho fashionistas’ dream by offering everything from the 1960s to the 90s. Additionally, it has a Reworked Vintage range for upcycled clothing. Over the years, Beyond Retro has developed an expert eye for rare print, shape and embellishment that fuels its ‘Design Archive’ – a reference and inspiration source for product development across all markets and genders. With over 6,000 original garments and 10,000 print swatches available on-site, Beyond Retro’s collection offers a remarkably rich and varied selection tracing the evolution of fashion history from the Victorian era through to more recent times. It stocks exquisite 19th century tailoring that includes 1930s-era tea dresses, mid-century denim and even military items, while a plenty of original print swatches cover every pattern, motif and theme from florals to paisleys, geos and more. Vestiaire Collective: The European social commerce app for desirable pre-loved fashion Vestiaire Collective was launched in 2009 in Paris by Fanny Moizant after being a mother to 2 kids. She founded the site with five business partners after realising that many of her friends had closets full of designer clothes that they no longer wore. She launched the platform with 3,000 pieces and the commitment that all items could be authenticated. As a practice, the platform does not disclose its turnover or profitability, despite that the company achieved a valuation of $1.7 billion in September 2021. As of today, it is a certified B Corporation that meets the highest verified standards of social and environmental performance, transparency and accountability. It has offices in Paris, New York, Los Angeles, Hong Kong, Seoul, Singapore and tech hub in Berlin. Since its inception, Vestiaire Collective has been building a planet friendly alternative to fast fashion and is dedicated to transforming the fashion industry for a more sustainable future by promoting the circular fashion movement as an alternative to overproduction and overconsumption, and the wasteful practices of the fashion industry. It allows the customers to buy and sell ‘authenticated’ pre-owned luxury fashion wherein sellers can either list the item themselves or ask Vestiaire to do it for them. The platform is unique thanks to its highly engaged community and its rare, desirable inventory of 3 million items. A survey of secondhand apparel shop users was conducted in the UK in 2022 to evaluate Vestiaire Collective platform on five metrics – brand awareness, its popularity, usage, consumer loyalty and buzz around the brand in the market. Statista reports that while 22 per cent of the respondents were aware of the platform, it was popular only among 4 per cent; only 3 per cent admitted having used it with 2 per cent each confessing their loyalty to the platform and hearing about it in the media, on social media or in advertising over the past three months. There were another 9 per cent who felt there was little or no buzz around the Vestiaire Collective, suggesting a long catching up for the brand to do in the UK market. Depop: Depop is a P2P (peer-to-peer) social e-commerce company based in London with offices in Manchester, Milan and New York City. It was founded by co-founder of PIG (People in Groove) magazine and Retro Super Future sunglasses, Simon Beckerman, originally as a social network where PIG’s readers could buy items featured in the magazine. After realising a need for a selling function, the app was re-envisioned as a global marketplace where one could see what one’s friends and people inspiring oneself were liking, buying and selling. This helped Depop become a global channel of connection through m-commerce, connecting cultures, designs and creative communities around the world. It became a wholly-owned subsidiary of Etsy – the global marketplace for unique and creative goods, but continues to operate as a standalone company. It is a home to 30 million plus stylists, designers, artists, collectors, vintage sellers, sneakerheads and more. Poshmark: Beginning January 2023, Naver Corporation – South Korea’s largest internet company, acquired California-headquartered Poshmark – a social marketplace for new as well as secondhand style for women, men, kids, pets and home. The acquisition has created a global player in online fashion re-commerce. While Poshmark will accelerate Naver’s strategy to build a global e-commerce community portfolio to capture growth in large untapped markets around the world, Poshmark, in turn, will benefit from Naver’s technology, expertise in Asia, and successful track record of backing e-commerce platforms globally. Together, they will increase purchase conversion rates, deepen user engagement, create an industry leader in livestreaming commerce, and enhance the unique relationship and discovery-based experiences that are driving fast-growing re-commerce market. The transaction resulted in delisting of Poshmark on NASDAQ which will, otherwise, continue to operate in its existing form. Poshmark boasts of 80 million registered users across the US, Canada and Australia and offers 200 million plus items for sale in these markets. It makes one sale every second in the US. Poshmark connects people and allows them to easily shop closets and boutiques. The listing of items on the site reportedly takes less than 60 seconds. The marketplace conducts Posh Parties which are virtual buying and selling events that happen in the app. People can browse, buy, and even list together with their friends. Additionally, the shipping is made easy. When a sale is made on Poshmark, seller is provided with a pre-paid, pre-addressed label ready to be put on the box. Once the sale has been packaged, it can be dropped off at a USPS (the US postal service) mailbox or even have it picked up for free from seller’s home. Goodfair: Another American online thrift store is Goodfair that encourages the customers to go beyond shopping secondhand and become full-fledged conscious consumers. Its mission “No New Things” cuts down on the need for low wage factories and combats clothing waste and pollution that are the result of fast fashion. Goodfair’s thrifted clothing, accessories and home goods come at a fraction of the cost of buying new. When order is received, its team hand-selects each piece into a one-of-a-kind bundle. As an online thrift store with no physical location, Goodfair works directly with the textile recycling companies and other partners to purchase its preloved clothes before they are exported, the majority of which end up in landfills overseas. It purchases product categories of thrifted items that arrive at its warehouse in large bales, weighing 1 ton or more. These bales are opened and then graded into three buckets: 1. Good to go; 2. Damaged, printed with inappropriate content or stained beyond help (these are repurposed as best as they can be); and 3. Surface stains that can likely be soaked or washed out (these are sent for laundering and then they are re-evaluated for sale). Each piece of used clothing is resized according to Goodfair True Size Standards and then folded, counted and stored to be packed by its pickers on receiving the orders. Worn Wear: Worn Wear by Patagonia (an American retailer of outdoor clothing) is a hub for keeping gear in play, i.e., to trade in and buy used Patagonia items – all clean, functional and backed by guarantee. Patagonia’s durable gear last long and after giving most on their part they are bought back against Patagonia credit for others to use them. The used Patagonia gear are sold online and in select stores. Patagonia also offers trade-in credit for its items which the consumers no longer use, shares online guides for DIY repair and care, and recycles garments at the end of their useful lives. Worn Wear aims at cutting down on consumption and getting more use out of stuff that is already owned. Refashioner: Although many players are trading secondhand, there is Refashioner from US which has unique vintage fashion to offer – ‘owned’ not ‘pre-owned’ clothes. Founded by a fashionista Kate Sekules in 2011, the site sells the designer pieces and exceptional vintage from private collections, organised by owners themselves and come complete with stories. Take the case of Marie Rottler – a grandmother of nine, who kept four decades of her outfits pristine, complete with memory notes. One of her granddaughters revived her collection when she noticed that, not only had Marie kept her outfits from all decades pristine, but had also written notes to remind herself where she had worn them. Likewise, the site invites the people who love their clothes too much to discard or ‘soullessly’ sell them. Though the site generally bears the names of these recognisable owners there are few which operate by pseudonyms for privacy. These prominent people believe in a highly personal clothes trade. There is option of private shopping by appointment offering a small fraction of pieces in addition to facilitating personal shopping, sourcing, styling and incorporating vintage into buyers’ look. Its services include closet clearing and redistribution of surplus too. The Way Forward Currently, the secondhand market occupies small share in the overall fashion sector but is expected to grow immensely in future, depending on macroeconomic conditions. Regardless of global economic challenges and how it effects on the way individuals buy and sell their clothes, this segment will continue to play a major role in consumers’ lives. The affordability trend under stressed global economy, advent of secondhand retail as innovative format, acceptance and increased demand for vintage fashion, globalisation, and scaled up recycling and reusing efforts to contain negative impact of fashion on global environment will remain key drivers of this market.","filter_flag":1}
{"title":"How damaged, discontinued and returned goods are being saved from landfill - Nine Shows","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovLzlub3cubmluZS5jb20uYXUvYS1jdXJyZW50LWFmZmFpci9jaXJjb25vbXktZGFtYWdlZC1kaXNjb250aW51ZWQtcmV0dXJuZWQtcmV0YWlsLWdvb2RzLXNhdmVkLWxhbmRmaWxsLWF1c3RyYWxpYS8xZjc0NDBmYS1iNzI0LTQ1OTktODhiMy03YWFlNTAyN2UyZDjSAURodHRwczovL2FtcC5uaW5lLmNvbS5hdS9hcnRpY2xlLzFmNzQ0MGZhLWI3MjQtNDU5OS04OGIzLTdhYWU1MDI3ZTJkOA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovLzlub3cubmluZS5jb20uYXUvYS1jdXJyZW50LWFmZmFpci9jaXJjb25vbXktZGFtYWdlZC1kaXNjb250aW51ZWQtcmV0dXJuZWQtcmV0YWlsLWdvb2RzLXNhdmVkLWxhbmRmaWxsLWF1c3RyYWxpYS8xZjc0NDBmYS1iNzI0LTQ1OTktODhiMy03YWFlNTAyN2UyZDjSAURodHRwczovL2FtcC5uaW5lLmNvbS5hdS9hcnRpY2xlLzFmNzQ0MGZhLWI3MjQtNDU5OS04OGIzLTdhYWU1MDI3ZTJkOA?oc=5","id":"CBMinAFodHRwczovLzlub3cubmluZS5jb20uYXUvYS1jdXJyZW50LWFmZmFpci9jaXJjb25vbXktZGFtYWdlZC1kaXNjb250aW51ZWQtcmV0dXJuZWQtcmV0YWlsLWdvb2RzLXNhdmVkLWxhbmRmaWxsLWF1c3RyYWxpYS8xZjc0NDBmYS1iNzI0LTQ1OTktODhiMy03YWFlNTAyN2UyZDjSAURodHRwczovL2FtcC5uaW5lLmNvbS5hdS9hcnRpY2xlLzFmNzQ0MGZhLWI3MjQtNDU5OS04OGIzLTdhYWU1MDI3ZTJkOA","guidislink":false,"published":"Fri, 03 Mar 2023 08:07:02 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=3, tm_hour=8, tm_min=7, tm_sec=2, tm_wday=4, tm_yday=62, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovLzlub3cubmluZS5jb20uYXUvYS1jdXJyZW50LWFmZmFpci9jaXJjb25vbXktZGFtYWdlZC1kaXNjb250aW51ZWQtcmV0dXJuZWQtcmV0YWlsLWdvb2RzLXNhdmVkLWxhbmRmaWxsLWF1c3RyYWxpYS8xZjc0NDBmYS1iNzI0LTQ1OTktODhiMy03YWFlNTAyN2UyZDjSAURodHRwczovL2FtcC5uaW5lLmNvbS5hdS9hcnRpY2xlLzFmNzQ0MGZhLWI3MjQtNDU5OS04OGIzLTdhYWU1MDI3ZTJkOA?oc=5\" target=\"_blank\">How damaged, discontinued and returned goods are being saved from landfill<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nine Shows<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How damaged, discontinued and returned goods are being saved from landfill - Nine Shows","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovLzlub3cubmluZS5jb20uYXUvYS1jdXJyZW50LWFmZmFpci9jaXJjb25vbXktZGFtYWdlZC1kaXNjb250aW51ZWQtcmV0dXJuZWQtcmV0YWlsLWdvb2RzLXNhdmVkLWxhbmRmaWxsLWF1c3RyYWxpYS8xZjc0NDBmYS1iNzI0LTQ1OTktODhiMy03YWFlNTAyN2UyZDjSAURodHRwczovL2FtcC5uaW5lLmNvbS5hdS9hcnRpY2xlLzFmNzQ0MGZhLWI3MjQtNDU5OS04OGIzLTdhYWU1MDI3ZTJkOA?oc=5\" target=\"_blank\">How damaged, discontinued and returned goods are being saved from landfill<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nine Shows<\/font>","source.href":"https:\/\/9now.nine.com.au","source.title":"Nine Shows","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Millions of kilograms of damaged, discontinued and returned goods are being saved from landfill, thanks to a little bit of TLC. A new social enterprise called Circonomy has sprung up in Melbourne and Brisbane, offering new products for half the price. \"Our message to Australians is really shop seconds first,\" Circonomy CEO Ryan Swenson said. A new social enterprise called Circonomy has sprung up in Melbourne and Brisbane, offering new products for half the price. (A Current Affair) Circonomy CEO Ryan Swenson. (A Current Affair) READ MORE: Lismore locals surprised by donation as they relive incredible stories of survival﻿ \"Right across Australia there's millions of dormant goods sitting idle in warehouses and so we're working with major brands and retailers to get them out of the warehouses and into the community. \"So it's anything from new items, to clearance products, or excess stock, or things like customer returns that get sent back or damaged or imperfect products.\" Circonomy is Australia's first-ever green circular economy for retail. Circonomy's team refurbishes the items stores can't offload and would otherwise get binned, and sells them for up to 70 per cent off. (A Current Affair) Circonomy is Australia's first-ever green circular economy for retail. (A Current Affair) READ MORE: ﻿'She speaks to me': Olivia Newton-John's family open up to Ally Langdon in emotional interview It's kicking off with big brand names like Catch, David Jones and Officeworks on board. Circonomy's team refurbishes the items stores can't offload and would otherwise get binned, and sells them for up to 70 per cent off. Swenson said Circonomy has even been able to salvage water-damaged clothes from containers. \"We actually just saved a whole container load of clothes that were going to be sent to landfill ... and they're now being sent to the Kimberley to support flood-affected communities,\" Swenson said.","filter_flag":1}
{"title":"ASUS India Expands Offline Presence with ‘Select Store' for Refurbished PCs - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2FzdXMtaW5kaWEtZXhwYW5kcy1vZmZsaW5lLXByZXNlbmNlLXNlbGVjdC1zdG9yZS1yZWZ1cmJpc2hlZC1wY3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2FzdXMtaW5kaWEtZXhwYW5kcy1vZmZsaW5lLXByZXNlbmNlLXNlbGVjdC1zdG9yZS1yZWZ1cmJpc2hlZC1wY3PSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2FzdXMtaW5kaWEtZXhwYW5kcy1vZmZsaW5lLXByZXNlbmNlLXNlbGVjdC1zdG9yZS1yZWZ1cmJpc2hlZC1wY3PSAQA","guidislink":false,"published":"Fri, 31 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=90, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2FzdXMtaW5kaWEtZXhwYW5kcy1vZmZsaW5lLXByZXNlbmNlLXNlbGVjdC1zdG9yZS1yZWZ1cmJpc2hlZC1wY3PSAQA?oc=5\" target=\"_blank\">ASUS India Expands Offline Presence with ‘Select Store' for Refurbished PCs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ASUS India Expands Offline Presence with ‘Select Store' for Refurbished PCs - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2FzdXMtaW5kaWEtZXhwYW5kcy1vZmZsaW5lLXByZXNlbmNlLXNlbGVjdC1zdG9yZS1yZWZ1cmJpc2hlZC1wY3PSAQA?oc=5\" target=\"_blank\">ASUS India Expands Offline Presence with ‘Select Store' for Refurbished PCs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"ASUS has announced the opening of its first 'Select Store' in the country for refurbished personal computers (PCs). This new store will offer customers access to high-quality refurbished PCs that have been meticulously inspected and restored to excellent condition at an affordable price. Located at Nehru Place in New Delhi, the ASUS Select Store boasts a modern design and a spacious, comfortable layout that encourages customers to explore and browse the refurbished products on display. The store will feature a wide range of products, including consumer laptops, gaming PCs, creator series laptops, desktops, and more. All products have been thoroughly tested, restored, and certified by ASUS to meet the same high standards as brand-new products and come with a 1-year company warranty. The ASUS Select Store aims to enhance the immersive journey for consumers by providing them with first-hand knowledge and improving the customer experience when purchasing refurbished PCs. Arnold Su, Business Head, Consumer and Gaming PC, System Business Group, ASUS India said, “Asian countries are witnessing exponential growth in demand for refurbished products. With the growing focus on sustainability and circular economy, refurbished products are driving a new trend in almost every business territory. At ASUS, we are committed to sustainability and reducing our environmental impact. By launching first Select Store for refurbished PCs, we are providing customers with a more affordable options for their computing needs.” He added, “Nehru Place, widely regarded as the largest electronics market in India, has been selected as the site for our Select store, considering the high volume of customers who visit the market seeking to purchase new or refurbished computing devices. Keeping this in mind, we have chosen this location and have kept the pricing of the high-end product units with an attractive discount offering of 20 percent - 30 percent on retail price. As part of our expansion plans, we aim to establish additional Select stores across the country and look forward to having at least one store in each division of West, East, and South India. Further, ASUS incorporates cutting-edge technology in all its retail outlets for a smooth and safe shopping experience.” The ASUS Select Store represents a significant stride towards a sustainable future, offering customers a chance to acquire superior quality products at accessible prices. The company leverages technological advancements to promote sustainability across its operations, encompassing a range of eco-conscious practices such as carbon footprint reduction, incorporation of eco-friendly packaging, and collaborations with recycling companies to ensure proper disposal of e-waste.","filter_flag":1}
