{"title":"The Inefficiencies of the Latest Energy Code - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2Jsb2cvaW5lZmZpY2llbmNpZXMtbGF0ZXN0LWVuZXJneS1jb2RlLTIwMjEtaWVjY9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2Jsb2cvaW5lZmZpY2llbmNpZXMtbGF0ZXN0LWVuZXJneS1jb2RlLTIwMjEtaWVjY9IBAA?oc=5","id":"CBMiS2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2Jsb2cvaW5lZmZpY2llbmNpZXMtbGF0ZXN0LWVuZXJneS1jb2RlLTIwMjEtaWVjY9IBAA","guidislink":false,"published":"Sat, 03 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=154, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2Jsb2cvaW5lZmZpY2llbmNpZXMtbGF0ZXN0LWVuZXJneS1jb2RlLTIwMjEtaWVjY9IBAA?oc=5\" target=\"_blank\">The Inefficiencies of the Latest Energy Code<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Inefficiencies of the Latest Energy Code - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2Jsb2cvaW5lZmZpY2llbmNpZXMtbGF0ZXN0LWVuZXJneS1jb2RlLTIwMjEtaWVjY9IBAA?oc=5\" target=\"_blank\">The Inefficiencies of the Latest Energy Code<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"It’s no secret that homes built to contemporary energy codes are considerably more energy efficient than older homes, especially those built before the turn of the century. But as building codes become increasingly more stringent with each new code cycle, in some cases the returns on the margins aren't yielding an energy-savings benefit that justifies the higher construction costs. The International Code Council (ICC) established the International Energy Conservation Code (IECC) in 2000 to improve energy conservation in new buildings. Early editions of the IECC helped new homes achieve much higher levels of energy performance. But the 2021 IECC has yielded some inefficient outcomes. An analysis of the code's costs conducted by Home Innovation Research Labs (Home Innovation)* indicates some unreasonable returns on investment (ROI) or payback for consumers that likely extend for decades, well past the lifespan of the requirement. In some cases, it would take well over 100 years to achieve a savings in energy costs commensurate with the increased cost to comply with the code. RELATED Examples of IECC Overreach and Long Paybacks One example of an unreasonable payback period is the requirement for minimum R-49 ceiling insulation. The analysis indicated average energy savings of $0.67 per month in Climate Zone 2 (see map below) and $0.92 per month in Climate Zone 3 for a standard 2,500 square-foot single-family house, yet it costs roughly $1,366 to achieve that level of insulation. Thus, for a typical single-family home in Phoenix, the payback period for that investment in additional ceiling insulation would be about 170 years—far longer than the homeowner's 30-year mortgage. Another example is continuous wall insulation. Looking at Climate Zone 4, Home Innovation’s analysis finds that the 2021 IECC provision costs $4,970 for a 2,500 square foot house, resulting in a payback period for the homeowners as high as 100 years. An Uphill Battle, but Not a Lost One The Inflation Reduction Act (IRA) of August 2022 set aside nearly $1 billion to incentivize state and local governments to adopt the 2021 IECC Residential Code, hindering the effectiveness of political and industry push-back against certain provisions that will drive up housing costs while delivering negligible savings in energy use or expenses. It is critical that the U.S. Department of Energy (DOE) develops clear and transparent energy equivalency criteria for the 2021 IECC for achieving compliance with the IRA funding requirements. The equivalency criteria should be developed for both prescriptive and performance energy code paths. By offering equivalent compliance options that achieve the same or better energy performance increases the number and variety of energy measures available to designers and builders, improves cost-effectiveness for consumers, and maximizes the overall energy savings envisioned by Congress in the IRA. The National Association of Home Builders (NAHB), along with other stakeholders, expect the 2024 IECC standard to be even more stringent; in fact, the most stringent yet in terms of energy performance. But NAHB is working within the framework of the 2024 IECC to make sure designers and builders have the flexibility necessary to meet the more stringent standard in the most cost-effective way possible. * To evaluate the cost effectiveness of the 2021 IECC changes, Home Innovation determined incremental construction costs and energy use costs using a Standard Reference House with multiple configurations and in multiple locations, constructed in accordance with the prescriptive compliance requirements of the 2018 IECC and 2021 IECC Residential Provisions. The results provided a basis for estimating energy use savings and cost effectiveness of individual measures. Annual energy use costs were developed using the U.S. Department of Energy’s BEopt simulation software and energy prices came from the U.S. Energy Information Agency.","filter_flag":1}
{"title":"Global Advanced Phase Change Materials (PCM) Strategic Analysis Report 2023: Growing Demand for Energy ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNi8yMC8yNjkwODM4LzI4MTI0L2VuL0dsb2JhbC1BZHZhbmNlZC1QaGFzZS1DaGFuZ2UtTWF0ZXJpYWxzLVBDTS1TdHJhdGVnaWMtQW5hbHlzaXMtUmVwb3J0LTIwMjMtR3Jvd2luZy1EZW1hbmQtZm9yLUVuZXJneS1FZmZpY2llbnQtVGVjaG5vbG9neS1SaXNpbmctRW1waGFzaXMtb24tRW5lcmd5LUNvbnNlcnZhdGlvbi1Ecml2ZS1Gb2N1cy1vbnRvLUFQQy5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNi8yMC8yNjkwODM4LzI4MTI0L2VuL0dsb2JhbC1BZHZhbmNlZC1QaGFzZS1DaGFuZ2UtTWF0ZXJpYWxzLVBDTS1TdHJhdGVnaWMtQW5hbHlzaXMtUmVwb3J0LTIwMjMtR3Jvd2luZy1EZW1hbmQtZm9yLUVuZXJneS1FZmZpY2llbnQtVGVjaG5vbG9neS1SaXNpbmctRW1waGFzaXMtb24tRW5lcmd5LUNvbnNlcnZhdGlvbi1Ecml2ZS1Gb2N1cy1vbnRvLUFQQy5odG1s0gEA?oc=5","id":"CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNi8yMC8yNjkwODM4LzI4MTI0L2VuL0dsb2JhbC1BZHZhbmNlZC1QaGFzZS1DaGFuZ2UtTWF0ZXJpYWxzLVBDTS1TdHJhdGVnaWMtQW5hbHlzaXMtUmVwb3J0LTIwMjMtR3Jvd2luZy1EZW1hbmQtZm9yLUVuZXJneS1FZmZpY2llbnQtVGVjaG5vbG9neS1SaXNpbmctRW1waGFzaXMtb24tRW5lcmd5LUNvbnNlcnZhdGlvbi1Ecml2ZS1Gb2N1cy1vbnRvLUFQQy5odG1s0gEA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNi8yMC8yNjkwODM4LzI4MTI0L2VuL0dsb2JhbC1BZHZhbmNlZC1QaGFzZS1DaGFuZ2UtTWF0ZXJpYWxzLVBDTS1TdHJhdGVnaWMtQW5hbHlzaXMtUmVwb3J0LTIwMjMtR3Jvd2luZy1EZW1hbmQtZm9yLUVuZXJneS1FZmZpY2llbnQtVGVjaG5vbG9neS1SaXNpbmctRW1waGFzaXMtb24tRW5lcmd5LUNvbnNlcnZhdGlvbi1Ecml2ZS1Gb2N1cy1vbnRvLUFQQy5odG1s0gEA?oc=5\" target=\"_blank\">Global Advanced Phase Change Materials (PCM) Strategic Analysis Report 2023: Growing Demand for Energy ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Advanced Phase Change Materials (PCM) Strategic Analysis Report 2023: Growing Demand for Energy ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNi8yMC8yNjkwODM4LzI4MTI0L2VuL0dsb2JhbC1BZHZhbmNlZC1QaGFzZS1DaGFuZ2UtTWF0ZXJpYWxzLVBDTS1TdHJhdGVnaWMtQW5hbHlzaXMtUmVwb3J0LTIwMjMtR3Jvd2luZy1EZW1hbmQtZm9yLUVuZXJneS1FZmZpY2llbnQtVGVjaG5vbG9neS1SaXNpbmctRW1waGFzaXMtb24tRW5lcmd5LUNvbnNlcnZhdGlvbi1Ecml2ZS1Gb2N1cy1vbnRvLUFQQy5odG1s0gEA?oc=5\" target=\"_blank\">Global Advanced Phase Change Materials (PCM) Strategic Analysis Report 2023: Growing Demand for Energy ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Dublin, June 20, 2023 (GLOBE NEWSWIRE) -- The \"Advanced Phase Change Materials (PCM): Global Strategic Business Report\" report has been added to ResearchAndMarkets.com's offering. Global Advanced Phase Change Materials (PCM) Market to Reach $6.3 Billion by 2030 The global market for Advanced Phase Change Materials (PCM) estimated at US$1.5 Billion in the year 2022, is projected to reach a revised size of US$6.3 Billion by 2030, growing at a CAGR of 19.8% over the analysis period 2022-2030. Organic, one of the segments analyzed in the report, is projected to record 18.1% CAGR and reach US$2 Billion by the end of the analysis period. Taking into account the ongoing post pandemic recovery, growth in the Inorganic segment is readjusted to a revised 20.7% CAGR for the next 8-year period. The U.S. Market is Estimated at $501.8 Million, While China is Forecast to Grow at 21.2% CAGR The Advanced Phase Change Materials (PCM) market in the U.S. is estimated at US$501.8 Million in the year 2022. China, the world's second largest economy, is forecast to reach a projected market size of US$812 Million by the year 2030 trailing a CAGR of 21.2% over the analysis period 2022 to 2030. Among the other noteworthy geographic markets are Japan and Canada, each forecast to grow at 16.2% and 18.9% respectively over the 2022-2030 period. Within Europe, Germany is forecast to grow at approximately 17.9% CAGR. Looking Ahead to 2023 Lower capital expenditure is in the offing as companies go slow on investments, held back by inflation worries and weaker demand. With slower growth and high inflation, developed markets seem primed to enter into a recession. Fears of new COVID outbreaks and China's already uncertain post-pandemic path poses a real risk of the world experiencing more acute supply chain pain and manufacturing disruptions this year. Volatile financial markets, growing trade tensions, stricter regulatory environment and pressure to mainstream climate change into economic decisions will compound the complexity of challenges faced. Year 2023 is expected to be tough year for most markets, investors and consumers. Nevertheless, there is always opportunity for businesses and their leaders who can chart a path forward with resilience and adaptability. What`s New for 2023? Special coverage on Russia-Ukraine war; global inflation; easing of zero-Covid policy in China and its `bumpy` reopening; supply chain disruptions, global trade tensions; and risk of recession. Global competitiveness and key competitor percentage market shares Market presence across multiple geographies - Strong\/Active\/Niche\/Trivial Online interactive peer-to-peer collaborative bespoke updates Access to digital archives and Research Platform Complimentary updates for one year Key Attributes: Report Attribute Details No. of Pages 385 Forecast Period 2022 - 2030 Estimated Market Value (USD) in 2022 $1.5 Billion Forecasted Market Value (USD) by 2030 $6.3 Billion Compound Annual Growth Rate 19.6% Regions Covered Global MARKET OVERVIEW Advanced Phase Change Materials (PCM) - Global Key Competitors Percentage Market Share in 2022 (E) Competitive Market Presence - Strong\/Active\/Niche\/Trivial for Players Worldwide in 2022 (E) Pandemic Impacts Growth in Advanced Phase Change Materials (PCM) Market An Introduction to Advanced Phase Change Materials (PCM) Types of Advanced Phase Change Materials Comparison of Characteristics of Bio-based PCM, Paraffin PCM and Salt Hydrate PCM Key features of Various PCM Types Global Market Prospects & Outlook Inorganic Advanced PCMs Lead Global Market Building & Construction: The Leading Application Market Developed Regions Lead, Developing Economies Promise Growth Competition Recent Market Activity MARKET TRENDS & DRIVERS Growing Demand for Energy Efficient Technology & Rising Emphasis on Energy Conservation Drive Focus onto APCM Regulations to Reduce Greenhouse Gas Emissions: Opportunity for Advanced PCMs Market Global CO2 Emissions in Billion Metric Tons of CO2 Per Year Domestic Targets for Greenhouse Gas Emissions of Select Regions\/ Countries Building & Construction: A Major Application Market for Advanced Phase Change Materials Composition, Melting temperature and Melting Heat of PCMs in Building Applications How Buildings Contribute Towards Climate Change Emphasis on Energy-Efficient, Green, LEED Buildings Builds Fertile Environment for Advanced PCM Market Growing Relevance of Zero Energy Building Constructions to Propel Demand for Advanced PCMs Building Energy Efficiency Codes & Standards, Efficiency Improvement Targets, Incentives & Supporting Polices Lay the Foundation for Growth Energy Efficiency Codes & Standards for Existing Buildings Government Measures to Support Migration to Net Zero Energy Buildings How the Construction Industry is Impacted by the Pandemic & What's the New Normal? Transportation Of Temperature-Sensitive Goods Drives Demand for Advanced PCMs in Shipping & Transportation Need for Cold Chain Logistics Propels Outlook for Advanced PCMs Vaccines Make Cold Chain Highly Relevant in Pharmaceutical Logistics Demand for Efficient Thermal Insulation Materials in HVAC and Refrigeration Applications Propels Growth Global Heating, Ventilation and Air conditioning (HVAC) Systems Market Size (in US$ Million) by Region\/Country for 2019 and 2024 Rising Significance of Advanced Phase Change Materials for Thermal Energy Storage Systems Despite Competition from Latent Heat Storage, Sensible Heat Technology Sustains Dominance Various Thermal Storage Technologies: Brief Details of Efficiency, Storage Time, Power and Capacity PCM Systems Poised for High Growth in Thermal Energy Storage Market Need for Improved Energy Management and Resultant Importance of TES Systems to Drive Market Gains Growing Investments in Renewable Energy Fuel Demand for TES Solutions Bio-Based PCMs Emerge for TES Applications Expanding Applications of Advanced Phase Change Materials (PCM) in Textile Industry Pandemic's Impact on Textile Industry Affects Market Prospects Robust Growth in Smart Textiles Industry to Drive Demand for Advanced PCM Advanced PCMs Find Growing Use of Electronics Equipment & Components Benefits of Advanced PCMs for Electronic Devices PCM Applications in Electronics Industry PCMs Help in Thermal Management of Electronic Devices Pandemic Causes Significant Disruption to Electrical & Electronics Equipment Market Global Electrical & Electronics Equipment Market Growth Outlook (In %) for Years 2019 through 2025 Technological Developments in Advanced PCM Market to Boost Market Prospects Bio-Based PCM Poised for High Growth Microencapsulated PCM Regulate Temperature in Building & Construction, Textile Applications Expanding Population and Urbanization Trend Boost Market Outlook Major Challenges Facing Advanced PCMs Market FOCUS ON SELECT PLAYERS (Total 55 Featured) Climator SWEDEN AB Cold Chain Technologies, Inc. Croda International Plc Cryopak Industries, Inc. Henkel AG & Co.KGaA Honeywell International Inc. Microtek Laboratories, Inc. PCM Products Ltd. Phase Change Solutions, Inc. Pluss Advanced Technologies Pvt. Ltd. PureTemp LLC Rubitherm Technologies GmbH Sasol Limited For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/nyashe About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"Chijet Motor Company Listed on NASDAQ - Yahoo Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGlqZXQtbW90b3ItY29tcGFueS1saXN0ZWQtbmFzZGFxLTE5MDEwMDMyNS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGlqZXQtbW90b3ItY29tcGFueS1saXN0ZWQtbmFzZGFxLTE5MDEwMDMyNS5odG1s0gEA?oc=5","id":"CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGlqZXQtbW90b3ItY29tcGFueS1saXN0ZWQtbmFzZGFxLTE5MDEwMDMyNS5odG1s0gEA","guidislink":false,"published":"Fri, 02 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=153, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGlqZXQtbW90b3ItY29tcGFueS1saXN0ZWQtbmFzZGFxLTE5MDEwMDMyNS5odG1s0gEA?oc=5\" target=\"_blank\">Chijet Motor Company Listed on NASDAQ<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chijet Motor Company Listed on NASDAQ - Yahoo Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGlqZXQtbW90b3ItY29tcGFueS1saXN0ZWQtbmFzZGFxLTE5MDEwMDMyNS5odG1s0gEA?oc=5\" target=\"_blank\">Chijet Motor Company Listed on NASDAQ<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","source.href":"https:\/\/finance.yahoo.com","source.title":"Yahoo Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Chijet Management at the Nasdaq MarketSite in Times Square Chijet Management at the Nasdaq MarketSite in Times Square Chijet Motor Production Models Chijet Motor Production Models NEW YORK, June 02, 2023 (GLOBE NEWSWIRE) -- Chijet Motor Company, Inc. (the \"Company\" or \"Chijet\"), a developer of next-generation electric vehicles, was officially listed on NASDAQ on June 2, 2023 under the ticker symbol “CJET.” Chijet Management at the Nasdaq MarketSite in Times Square Chijet is a new energy vehicle group company with main operating entities of Shandong Baoya New Energy Vehicle Co., Ltd. and its holding subsidiary, FAW Jilin Automobile Co., Ltd. The Company combines the innovative vitality of new car-making design and engineering forces with mature scale vehicle production capacity, and is committed to building Chijet into a scenario-driven, technology-led and, experience-based, new energy vehicle enterprise with global market operation capability. The Company’s vision is to provide high quality and cost-effective new energy vehicle products and services to more than 80% of mass consumers in China, as well as in the future to consumers in Southeast Asia, America, GCC and other developing countries, and provide an easy and pleasant driving experience to general consumers in the intelligent era. Chijet will integrate high quality R&D and engineering resources to form a China-led and globally linked international product creation system to continuously meet the R&D needs of passenger cars, commercial vehicles, advanced technologies and key components. The Company has established strategic partnerships and has built R&D teams with outstanding research institutions, domestically and internationally, in the application of advanced technologies, such as solid-state batteries, second-generation power-shunt hybrid systems, third-generation high-performance controllers (SiC-based chips), low and medium voltage hydrogen fuel power cell systems and other substantial innovations. Chijet Motor Production Models The listing on Nasdaq is an important milestone in the Company’s development history, which will further contribute to the rapid and healthy development of Chijet’s new energy vehicles and enhance its position in the global market. At the same time, the Company attaches great importance to its social responsibility, and is always committed to improving the technical level and manufacturing level of new energy vehicles, while making contributions to global energy conservation and low carbon environment protection. In the next few years, with the launch of its FB77, a cost-effective pure electric sedan, and its R9 PHEV hybrid SUV, Chijet’s plans include development of more than a dozen new products including its FV20, FB21 and FB31 vehicles, among others. These products cover both commercial and passenger areas, with various power types such as pure electric, hybrid and hydrogen fuel, to meet diversified needs under various scenarios of the public in the context of new energy and intelligent era, in order to provide a comprehensive and multi-dimensional driving experience to consumers. Story continues About Chijet Motor Company, Inc. The primary business of Chijet is the development, manufacture, sales, and service of traditional fuel vehicles and electric vehicles. State-of-the-art manufacturing systems and stable supply chain management enable the Company to provide consumers with products of high performance at reasonable prices. The factory in Yantai, China, will be dedicated to EV production, and the Company's headquarters will be also located at the planned Yantai factory. Chijet has a management team of industry veterans with decades of experience in engineering and design, management, financing, industrial production, and financial management. For additional information about Chijet, please visit www.chijetmotors.com . Chijet Contact: 2888 Donshan Street Gaoxin Automobile Industrial Park Jilin City, JL. P.R.China 400-606-8888 EMAIL: info@chijetmotors.com Investor Relations Contact: Skyline Corporate Communications Group, LLC Scott Powell, President One Rockefeller Plaza, 11th Floor New York, NY 10020 Office: (646) 893-5835 x2 Email:info@skylineccg.com Forward-Looking Statements This press release contains “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. Chijet’s actual results may differ from its expectations, estimates and projections and consequently, you should not rely on these forward-looking statements as predictions of future events. Words such as “expect,” “estimate,” “project,” “budget,” “forecast,” “anticipate,” “intend,” “plan,” “may,” “will,” “could,” “should,” “believes,” “predicts,” “potential,” “might” and “continues,” and similar expressions are intended to identify such forward-looking statements. These forward-looking statements include, without limitation, statements regarding Chijet’s leadership team, Chijet’s continued growth and financial and operational improvements, along with those other risks described under the heading “Risk Factors” in the prospectus Chijet filed with the Securities and Exchange Commission (the “SEC”) on March 30, 2023, and those that are included in any of Chijet’s future filings with the SEC. These forward-looking statements involve significant risks and uncertainties that could cause actual results to differ materially from expected results. Most of these factors are outside of the control of Chijet and are difficult to predict. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated or anticipated by such forward-looking statements. Readers are cautioned not to place undue reliance upon any forward-looking statements, which speak only as of the date made. Chijet undertakes no obligation to update forward-looking statements to reflect events or circumstances after the date they were made except as required by law or applicable regulation. Attachments ","filter_flag":1}
{"title":"ITC SWOT Analysis (2024) - Business Model Analyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5","id":"CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA","guidislink":false,"published":"Sun, 04 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=155, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5\" target=\"_blank\">ITC SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ITC SWOT Analysis (2024) - Business Model Analyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5\" target=\"_blank\">ITC SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","source.href":"https:\/\/businessmodelanalyst.com","source.title":"Business Model Analyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"ITC SWOT Analysis encompasses a comprehensive assessment that examines the strengths, weaknesses, opportunities, and threats faced by ITC Ltd, a leading Indian conglomerate that operates in diverse sectors. The company was formerly known as the Imperial Tobacco Company of India Limited. It is based in India, and it has established itself as a powerhouse in multiple industries by being a significant player in sectors, such as fast-moving consumer goods (FMCG), agribusiness, hotels, paperboard, and information technology. ITC Ltd’s operations span across India and extend to various international markets. In India, the company has a widespread presence, with manufacturing units, offices, and distribution networks strategically located across the country. ITC’s international footprint includes a global agribusiness presence, with exports of agricultural commodities to numerous countries. Additionally, ITC Hotels cater to both domestic and international tourists, offering unparalleled hospitality experiences. ITC Ltd traces its origins back to 1910 when it was incorporated as the Imperial Tobacco Company of India Limited. At the time, its primary focus was on manufacturing and marketing cigarettes, catering to the growing demand in the Indian market. The company established its first manufacturing facility in Munger, Bihar, and quickly gained a reputation for producing high-quality tobacco products. Recognizing the need to diversify its operations and reduce dependence on a single industry, ITC Ltd embarked on a journey of expansion into new businesses. This strategic move aimed to leverage its resources, expertise, and brand equity to venture into sectors with promising growth potential. Over the years, ITC Ltd successfully entered several industries, expanding its footprint and establishing itself as a diversified conglomerate. One of the key areas where ITC Ltd made significant strides is the fast-moving consumer goods (FMCG) sector. In the 1970s, the company ventured beyond tobacco and entered the FMCG market with the launch of its personal care products under the brand name “Essenza Di Wills.” This foray marked the beginning of ITC’s journey into non-tobacco consumer goods. In subsequent years, ITC Ltd expanded its FMCG portfolio, introducing a range of products across categories such as food and beverages, personal care, education stationery, and safety matches. The company’s FMCG division witnessed exponential growth, fueled by its commitment to quality, innovation, and consumer-centric strategies. Today, ITC Ltd’s FMCG brands, including Aashirvaad, Sunfeast, Bingo!, and Yippee!, are household names in India and enjoy a significant market share. ITC Ltd recognized the importance of building a robust supply chain and ensuring sustainable sourcing practices. In the early 1980s, the company entered the agribusiness sector, focusing on agricultural commodities such as wheat, rice, leaf tobacco, and coffee. With a vision to create a more inclusive and sustainable agricultural ecosystem, ITC Ltd implemented farmer empowerment programs, promoting responsible farming practices, and enhancing the livelihoods of farmers across the country. The company’s agribusiness division handles the sourcing, processing, and exporting of agricultural commodities. ITC Ltd’s efforts in this sector have not only strengthened its supply chain, but also contributed to rural development and the overall growth of the agricultural industry in India. In the late 1970s, ITC Ltd made its entry into the hospitality industry with the launch of its first luxury hotel, the ITC Maurya, in New Delhi. This marked the inception of ITC Hotels, a chain known for its opulence, exceptional service, and commitment to sustainability. Over the years, ITC Hotels expanded its presence across major cities and tourist destinations in India, offering a unique blend of traditional Indian hospitality and contemporary luxury. ITC Hotels has been a pioneer in sustainable practices, emphasizing environmental stewardship and social responsibility. The chain has received numerous accolades for its initiatives in energy conservation, water management, and community development, making it a preferred choice for environmentally conscious travelers. From its humble beginnings as a tobacco company, ITC Ltd has transformed into a diverse conglomerate with a remarkable presence in various industries. In this article, we will be examining the internal factors that empower ITC and the external elements that pose challenges. This SWOT analysis will help to shed light on the company’s current standing, growth potential, and strategic implications, allowing stakeholders to gain valuable insights into its prospects. SWOT Analysis of ITC ITC Strengths The following are the strengths that have helped ITC remain in business for over a century: Diversified Portfolio In the highly competitive business landscape, companies that possess a diversified portfolio enjoy a distinct advantage. ITC has strategically ventured into multiple industries, including fast-moving consumer goods (FMCG), agribusiness, hotels, paperboard, and information technology. This diversification has proven to be a pillar of strength for the company. ITC Ltd’s diversified portfolio provides a buffer against market fluctuations that may affect individual sectors. By operating in multiple industries, the company can mitigate the impact of adverse conditions in any one sector. Diversification reduces ITC Ltd’s reliance on any single industry, particularly its historical association with tobacco. Strong Brand Equity Brand equity plays a pivotal role in the success and sustainability of any business. For ITC Ltd, a conglomerate operating in various industries, solid brand equity is undeniably a significant strength. ITC Ltd’s substantial brand equity fosters a high level of consumer trust and loyalty. Through consistent delivery of quality products and services, the company has cultivated a positive reputation among its target audience. It also provides the company with a competitive advantage in the market and helps the company to differentiate itself from competitors. Finally, during times of crisis or challenging situations, robust brand equity acts as a protective shield for ITC Ltd. Extensive Distribution Network An extensive distribution network is often a critical factor that can propel a company to success. ITC Ltd possesses an extensive distribution network that spans urban and rural areas in India. This enables the company to reach a vast and diverse consumer base. By establishing a strong foothold across different regions and markets, ITC Ltd can tap into a wide range of customers with varied preferences and purchasing power. ITC Ltd’s extensive distribution network also provides a competitive advantage when launching new products or expanding into new markets. When introducing a new product, the company can leverage its established distribution channels to reach a broad audience quickly. Sustainable Practices Companies are increasingly realizing the importance of adopting sustainable practices, as the business landscape changes rapidly. By integrating sustainability into its operations, ITC has shown its deep commitment to environmental stewardship, social responsibility, and ethical governance. The company has implemented numerous initiatives to reduce its ecological footprint and promote conservation. These include energy-efficient operations, waste management programs, water conservation measures, and the use of renewable energy sources. Sustainable practices adopted by ITC Ltd often result in cost savings and improved operational efficiency. Embracing sustainability drives innovation and product differentiation for ITC Ltd. In conclusion, ITC’s sustainable practices not only enhance its brand reputation but also positions the company for long-term success in a rapidly evolving business landscape. Strong Research and Development (R&D) Capabilities ITC stands out for its strong research and development (R&D) capabilities that help it stay ahead of the curve. The company’s R&D capabilities serve as a driving force behind product innovation. The company invests heavily in R&D activities to develop cutting-edge technologies, novel product formulations, and unique solutions that meet evolving customer needs. Through its strong R&D capabilities, ITC Ltd focuses on enhancing the quality and performance of its products and services. Also, the company invests in patents, trademarks, copyrights, and trade secrets to protect its innovative technologies, processes, and formulations. In conclusion, ITC’s strong R&D capabilities foster market differentiation, nurture collaborative partnerships, and future-proof its business. ITC Weaknesses The following are the weaknesses that pose challenges to ITC’s growth and development: Dependence on Cigarette Business While ITC Ltd has established itself as a diversified conglomerate with interests spanning various sectors, its significant reliance on the cigarette industry poses challenges and vulnerabilities. The cigarette market is highly saturated and fiercely competitive. ITC Ltd faces intense competition from both domestic and international tobacco companies. The market dominance of established players, coupled with the challenges of brand loyalty and consumer preferences, makes it difficult for ITC Ltd to expand its market share significantly. Also, the cigarette industry is subject to stringent regulations and increasing scrutiny worldwide. Governments are implementing stricter regulations, including higher taxes, graphic health warnings, advertising restrictions, and bans on smoking in public places. Geographic Concentration Despite the advantages of ITC’s domestic market, it also exposes the company to vulnerabilities and limitations. Geographic concentration restricts ITC Ltd’s exposure to a single market, namely India. While the Indian market is vast and offers tremendous growth potential, over-reliance on a single market limits the company’s ability to diversify its revenue streams. Market fluctuations, economic downturns, or regulatory changes specific to India can have a significant impact on ITC Ltd’s overall financial performance. Also, operating primarily in the Indian market exposes ITC Ltd to intense competition from domestic and regional players. Slow Adoption of E-commerce In an era marked by rapid digital transformation and changing consumer preferences, the slow adoption of e-commerce poses a serious challenge to ITC. The slow adoption of e-commerce means that ITC Ltd needs to fully tap into the potential revenue and growth opportunities offered by online retail channels. With the increasing popularity of online shopping, consumers are seeking convenience, broader product selections, and competitive pricing. By not fully embracing e-commerce, ITC Ltd may miss out on a significant portion of the market and potential customers who prefer online purchasing. Also, by not actively participating in e-commerce, ITC Ltd risks falling behind in terms of industry trends and customer expectations. High Debt Levels While ITC operates across diverse sectors and has achieved considerable success, its burden of substantial debt can hinder its growth potential and financial stability. High levels of debt restrict ITC Ltd’s financial flexibility and limit its ability to allocate resources efficiently. The company’s cash flow and profitability may be impacted by the need to service debt obligations, including interest payments and debt repayments. This financial strain can constrain the company’s ability to pursue new growth opportunities, invest in research and development, undertake strategic acquisitions, or respond effectively to market fluctuations. In conclusion, ITC’s high debt levels lead to financial constraints, increased interest costs, limitations on capital expenditure, ratings downgrades, reduced investor confidence, and restricted strategic agility. Vulnerability to Commodity Price Volatility ITC Ltd heavily relies on commodities as raw materials for its products; therefore, fluctuations in commodity prices can significantly impact the company’s profitability, supply chain, and overall financial performance. Commodity price volatility exposes ITC Ltd to cost pressures that can directly affect its profitability. Sudden price increases in essential commodities used in manufacturing processes, such as agricultural products, metals, or energy sources, can lead to higher production costs. These increased costs may not be easily passed on to consumers, especially in competitive markets, resulting in squeezed profit margins. Also, commodity price volatility can disrupt ITC Ltd’s supply chain, leading to potential shortages or delays in raw material availability. ITC Opportunities The following are opportunities for ITC’s growth and development: Growing FMCG Market ITC Ltd has the potential to capitalize on the expanding Fast-Moving Consumer Goods (FMCG) market. The growing FMCG market offers ITC Ltd an opportunity to diversify its revenue streams beyond its core businesses. While the company has a strong presence in sectors such as tobacco, hotels, paperboard, and agribusiness, the FMCG market provides a new avenue for expansion. The FMCG market thrives on innovation and new product development, providing ITC Ltd with an opportunity to showcase its research and development capabilities. The company can leverage its expertise in product development, packaging, and formulation to introduce innovative and value-added FMCG products. In conclusion, ITC Ltd’s diverse portfolio of businesses can create synergies and cross-promotional opportunities within the FMCG market. Expansion into Emerging Markets ITC Ltd has the potential to leverage its capabilities and resources to tap into the growing economies of emerging markets. Emerging markets offer ITC Ltd access to a large and relatively untapped consumer base. A growing middle class, rising disposable incomes, and increasing consumer spending power characterize these markets. By expanding its presence into emerging markets, ITC Ltd can target a new set of consumers who are eager to explore and adopt new products and brands. By strategically entering and expanding in emerging markets, ITC Ltd can position itself for long-term growth, enhanced profitability, and sustainable business performance. Focus on Health and Wellness ITC Ltd can leverage the growing consumer demand for health and wellness products and services. There is a global shift towards health consciousness, with consumers increasingly prioritizing their well-being and seeking healthier lifestyle choices. This presents a significant opportunity for ITC Ltd to align its product portfolio with the growing demand for health and wellness products. By leveraging its existing resources, research and development capabilities, and consumer insights, ITC Ltd can introduce a range of health-focused products that cater to the evolving needs of health-conscious consumers. By aligning its business strategy with the health and wellness trend, ITC Ltd can capture market share, enhance consumer loyalty, and drive long-term growth. Acquisitions and partnerships Through strategic acquisitions and partnerships, ITC can fuel its growth, expand its market presence, and enhance its competitive advantage. Acquisitions and partnerships offer ITC Ltd an opportunity to expand its market presence and diversify its business portfolio. By acquiring businesses in related or complementary sectors, ITC Ltd can enter new markets, gain access to new customer segments, and broaden its product offerings. These strategic moves allow the company to reduce its reliance on specific sectors, mitigate risks associated with market fluctuations, and create a more balanced revenue stream. Adoption of E-commerce The growing popularity of e-commerce platforms and other digital channels can help ITC to enhance its market reach, improve customer experience, and drive revenue growth. The adoption of e-commerce allows ITC Ltd to expand its customer reach beyond traditional brick-and-mortar stores. By establishing a strong online presence, the company can tap into a larger customer base, including those who prefer the convenience of shopping online. E-commerce enables ITC Ltd to reach customers in remote areas, international markets, and underserved regions, thereby increasing its market penetration and potential revenue streams. ITC Threat The following are some of the threats that ITC faces: Intense Competition ITC Ltd faces fierce competition from both domestic and international players across its business segments. Intense competition often leads to price wars as companies strive to capture market share. Price-based competition can result in reduced profit margins for ITC Ltd, as it may be forced to lower prices to remain competitive. This can impact the company’s profitability and financial performance, making it challenging to maintain sustainable growth and invest in innovation and expansion. Also, intense competition can lead to market saturation, impacting ITC’s brand loyalty. Changing Regulatory Landscape ITC Ltd is subject to a wide range of regulations and policies imposed by governments and regulatory bodies. The evolving regulatory landscape often brings about increased compliance costs and regulatory burdens for companies. New regulations, amendments to existing laws, or stringent enforcement can necessitate changes in processes, systems, and operations. Compliance with these regulations may require significant investments in technology, infrastructure, training, and monitoring systems. Such costs can impact ITC Ltd’s profitability and financial resources, diverting funds from growth initiatives and hindering the company’s ability to compete effectively. Rising Input Costs ITC Ltd is reliant on various inputs such as raw materials, energy, labor, and other resources to produce its goods and services. Higher input costs can put ITC Ltd at a competitive disadvantage compared to its rivals. If competitors can procure inputs at lower costs, they may be able to offer products at more competitive prices, potentially capturing market share from ITC Ltd. Also, rising input costs necessitate a focus on operational efficiency and cost management within ITC Ltd. Higher input costs can limit ITC Ltd’s ability to invest in innovation and research and development (R&D). Rapid Technological Advancements ITC Ltd has existed for over a century and is now operating in an era of unprecedented technological disruption. Rapid technological advancements can render existing products and services obsolete. Also, it often comes with a significant cost of implementation, such as investing in new technologies, upgrading infrastructure, and training employees. As new technologies emerge, customer preferences and demands change accordingly. ITC Ltd may face the challenge of maintaining the relevance and competitiveness of its offerings in the face of disruptive technologies. Failure to keep pace with technological advancements can result in a loss of market share to more innovative competitors offering superior and technologically advanced products and services. Also, these rapid technological advancements can outpace existing regulatory frameworks. Environmental Factors Despite being a diversified conglomerate operating in various sectors, ITC Ltd is subject to the growing scrutiny and impact of environmental issues. Environmental factors, including climate change and the increasing frequency and intensity of natural disasters, pose a threat to ITC Ltd. Climate change can lead to disruptions in the availability and quality of resources, affecting the company’s operations and supply chains. Natural disasters such as floods, hurricanes, or droughts can damage infrastructure, interrupt production processes, and impact distribution networks. Negative publicity related to environmental damage, pollution incidents, or unsustainable practices can erode customer trust, investor confidence, and brand value. In addition, environmental factors can disrupt global and domestic supply chains, impacting the availability and quality of inputs. For ITC Ltd, this can lead to challenges in sourcing sustainable and ethically produced raw materials, as well as disruptions in logistics and transportation. Conclusion In conclusion, ITC Ltd’s diverse portfolio, strong brand presence, and strong distribution network position it as a market leader in multiple sectors. However, weaknesses such as heavy dependence on the tobacco business and limited international presence warrant attention. To navigate the dynamic business landscape and position itself for sustainable growth and success in the future, ITC has to leverage its strengths, address its weaknesses, capitalize on opportunities, and mitigate threats.","filter_flag":1}
{"title":"Neochem Technologies: Driving Sustainable Innovations in the Textile Industry - The Textile Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9uZW9jaGVtLXRlY2hub2xvZ2llcy1kcml2aW5nLXN1c3RhaW5hYmxlLWlubm92YXRpb25zLWluLXRoZS10ZXh0aWxlLWluZHVzdHJ5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9uZW9jaGVtLXRlY2hub2xvZ2llcy1kcml2aW5nLXN1c3RhaW5hYmxlLWlubm92YXRpb25zLWluLXRoZS10ZXh0aWxlLWluZHVzdHJ5L9IBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9uZW9jaGVtLXRlY2hub2xvZ2llcy1kcml2aW5nLXN1c3RhaW5hYmxlLWlubm92YXRpb25zLWluLXRoZS10ZXh0aWxlLWluZHVzdHJ5L9IBAA","guidislink":false,"published":"Sun, 11 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=162, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9uZW9jaGVtLXRlY2hub2xvZ2llcy1kcml2aW5nLXN1c3RhaW5hYmxlLWlubm92YXRpb25zLWluLXRoZS10ZXh0aWxlLWluZHVzdHJ5L9IBAA?oc=5\" target=\"_blank\">Neochem Technologies: Driving Sustainable Innovations in the Textile Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Neochem Technologies: Driving Sustainable Innovations in the Textile Industry - The Textile Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9uZW9jaGVtLXRlY2hub2xvZ2llcy1kcml2aW5nLXN1c3RhaW5hYmxlLWlubm92YXRpb25zLWluLXRoZS10ZXh0aWxlLWluZHVzdHJ5L9IBAA?oc=5\" target=\"_blank\">Neochem Technologies: Driving Sustainable Innovations in the Textile Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","source.href":"https:\/\/www.indiantextilemagazine.in","source.title":"The Textile Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Neochem Technologies, a company fuelled by ambition and driven by sustainability, has achieved substantial growth, expanded into new regions and countries, and successfully attracted a diverse customer base in India and around the world. Their success can be attributed to their commitment to leveraging innovative technologies and offering sustainable solutions. Hitesh Wadher, Vice President of International Business & B2B, Head of Marketing, Neochem Technologies In an exclusive interview with The Textile Magazine, Mr. Hitesh Wadher, Vice President of International Business & B2B, Head of Marketing at Neochem Technologies Private Limited, shared the company’s future plans and insights into its participation at ITMA Milan 2023. As a versatile and diverse chemical company, Neochem Technologies caters to various industries with a wide range of solutions. However, their primary focus lies in the textile industry, where they provide comprehensive solutions across different stages of the textile processing. Their product range includes offerings for pre-treatment, dyeing, printing, finishing, coatings, and enzymes. By prioritizing sustainability, they deliver value to their customers by offering eco-friendly alternatives that contribute to water and energy conservation while reducing costs. On the company’s expansion plans, Mr. Hitesh Wadher said, “Neochem Technologies believes in expanding its reach across all segments of the textile industry, recognizing the unique opportunities each segment presents. With an expansion phase underway, we view the entire world as our potential market, allowing us to tap into various textile segments and leverage global growth opportunities.” The company takes great pride in its commitment to sustainable solutions and constantly seeks to provide alternatives to conventional processes and chemicals. Among their notable innovations are natural and biobased fabric softeners derived from exquisite plant-based derivatives, a natural clay-based all-in-one preparation agent, and a sustainable replacement for Acetic acid. They have also developed solutions that eliminate the need for certain processes, like reduction clearing of polyester, resulting in significant savings in water, energy, time, and costs. Other innovations include anti-tinting cum washing off agents that reduce water consumption and save time, shade enhancers and deepening agents that help reduce dye consumption, and a single bath wash-off solution for Polyester-Cotton dyeing, offering substantial savings in time, energy, water, and labour. Participation @ ITMA 2023 The year 2023 holds great significance for Neochem Technologies as they make their debut at ITMA, a renowned textile industry event. Speaking about the company’s participation at ITMA, Mr. Hitesh Wadher said, “At the show, we are excited to unveil our ‘Natural and Plant-based Ester Quats fabric softeners’ and showcase our comprehensive range of sustainable chemistries. In addition to introducing the new products and technologies, the event provides us with a valuable opportunity to listen, learn, and gain insights into the diverse challenges faced by our customers. Armed with this knowledge, Neochem Technologies aims to innovate further and develop new sustainable solutions, strengthening our commitment to creating a more environmentally friendly future.” Focus on Sustainability Sustainability has become a buzzword in textile manufacturing, but for Neochem Technologies, it is a core value that drives their manufacturing practices. “We ensure sustainable manufacturing through various measures, including the development of eco-friendly and biodegradable products, prioritizing resource efficiency to reduce water and energy consumption, actively seeking alternative materials and chemicals that are less harmful to the environment, and promoting transparency and ethical practices in their supply chain and sourcing. These initiatives reflect our commitment to delivering sustainable products and technologies,” Mr. Hitesh Wadher added. In a highly competitive market with numerous options available, Neochem Technologies stands out by offering several strengths and advantages. Firstly, they are a research and development-driven company with an unwavering commitment to sustainability. Their eco-friendly and biodegradable solutions enable customers to achieve their sustainability goals. The company’s backward-integrated chemistries and comprehensive range of products cater to diverse needs in the textile industry. Neochem differentiates itself through flexibility, speed, and customization capabilities, staying ahead of industry trends and continuously developing sustainable alternatives. Additionally, the company’s strong focus on customer satisfaction and support ensures a seamless experience for customers, adds Mr. Hitesh Wadher. Looking ahead, Mr. Hitesh Wadher expects the growth of the textile industry in 2023 to be influenced by economic conditions, consumer demand, industry innovations, and global market dynamics. As manufacturing shifts to different regions, potential growth opportunities arise. The recovery of the global economy and increased consumer spending could further drive growth. Sustainability and innovation will remain pivotal in shaping the industry’s future, with collaboration and the adoption of new technologies driving growth and transformation. For more information on Neochem and its sustainable products, Mr. Hitesh Wadher can be reached out on hitesh.wadher@neochem.in","filter_flag":1}
{"title":"Blue Tree Phuket drives ESG Initiatives, Reinforces its Sustainable Entertainment Hub Status - Khaosodenglish","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5raGFvc29kZW5nbGlzaC5jb20vc3BvbnNvcmVkLzIwMjMvMDYvMDEvYmx1ZS10cmVlLXBodWtldC1kcml2ZXMtZXNnLWluaXRpYXRpdmVzLXJlaW5mb3JjZXMtaXRzLXN1c3RhaW5hYmxlLWVudGVydGFpbm1lbnQtaHViLXN0YXR1cy_SAZQBaHR0cHM6Ly93d3cua2hhb3NvZGVuZ2xpc2guY29tL3Nwb25zb3JlZC8yMDIzLzA2LzAxL2JsdWUtdHJlZS1waHVrZXQtZHJpdmVzLWVzZy1pbml0aWF0aXZlcy1yZWluZm9yY2VzLWl0cy1zdXN0YWluYWJsZS1lbnRlcnRhaW5tZW50LWh1Yi1zdGF0dXMvYW1wLw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5raGFvc29kZW5nbGlzaC5jb20vc3BvbnNvcmVkLzIwMjMvMDYvMDEvYmx1ZS10cmVlLXBodWtldC1kcml2ZXMtZXNnLWluaXRpYXRpdmVzLXJlaW5mb3JjZXMtaXRzLXN1c3RhaW5hYmxlLWVudGVydGFpbm1lbnQtaHViLXN0YXR1cy_SAZQBaHR0cHM6Ly93d3cua2hhb3NvZGVuZ2xpc2guY29tL3Nwb25zb3JlZC8yMDIzLzA2LzAxL2JsdWUtdHJlZS1waHVrZXQtZHJpdmVzLWVzZy1pbml0aWF0aXZlcy1yZWluZm9yY2VzLWl0cy1zdXN0YWluYWJsZS1lbnRlcnRhaW5tZW50LWh1Yi1zdGF0dXMvYW1wLw?oc=5","id":"CBMikAFodHRwczovL3d3dy5raGFvc29kZW5nbGlzaC5jb20vc3BvbnNvcmVkLzIwMjMvMDYvMDEvYmx1ZS10cmVlLXBodWtldC1kcml2ZXMtZXNnLWluaXRpYXRpdmVzLXJlaW5mb3JjZXMtaXRzLXN1c3RhaW5hYmxlLWVudGVydGFpbm1lbnQtaHViLXN0YXR1cy_SAZQBaHR0cHM6Ly93d3cua2hhb3NvZGVuZ2xpc2guY29tL3Nwb25zb3JlZC8yMDIzLzA2LzAxL2JsdWUtdHJlZS1waHVrZXQtZHJpdmVzLWVzZy1pbml0aWF0aXZlcy1yZWluZm9yY2VzLWl0cy1zdXN0YWluYWJsZS1lbnRlcnRhaW5tZW50LWh1Yi1zdGF0dXMvYW1wLw","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5raGFvc29kZW5nbGlzaC5jb20vc3BvbnNvcmVkLzIwMjMvMDYvMDEvYmx1ZS10cmVlLXBodWtldC1kcml2ZXMtZXNnLWluaXRpYXRpdmVzLXJlaW5mb3JjZXMtaXRzLXN1c3RhaW5hYmxlLWVudGVydGFpbm1lbnQtaHViLXN0YXR1cy_SAZQBaHR0cHM6Ly93d3cua2hhb3NvZGVuZ2xpc2guY29tL3Nwb25zb3JlZC8yMDIzLzA2LzAxL2JsdWUtdHJlZS1waHVrZXQtZHJpdmVzLWVzZy1pbml0aWF0aXZlcy1yZWluZm9yY2VzLWl0cy1zdXN0YWluYWJsZS1lbnRlcnRhaW5tZW50LWh1Yi1zdGF0dXMvYW1wLw?oc=5\" target=\"_blank\">Blue Tree Phuket drives ESG Initiatives, Reinforces its Sustainable Entertainment Hub Status<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Khaosodenglish<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Blue Tree Phuket drives ESG Initiatives, Reinforces its Sustainable Entertainment Hub Status - Khaosodenglish","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5raGFvc29kZW5nbGlzaC5jb20vc3BvbnNvcmVkLzIwMjMvMDYvMDEvYmx1ZS10cmVlLXBodWtldC1kcml2ZXMtZXNnLWluaXRpYXRpdmVzLXJlaW5mb3JjZXMtaXRzLXN1c3RhaW5hYmxlLWVudGVydGFpbm1lbnQtaHViLXN0YXR1cy_SAZQBaHR0cHM6Ly93d3cua2hhb3NvZGVuZ2xpc2guY29tL3Nwb25zb3JlZC8yMDIzLzA2LzAxL2JsdWUtdHJlZS1waHVrZXQtZHJpdmVzLWVzZy1pbml0aWF0aXZlcy1yZWluZm9yY2VzLWl0cy1zdXN0YWluYWJsZS1lbnRlcnRhaW5tZW50LWh1Yi1zdGF0dXMvYW1wLw?oc=5\" target=\"_blank\">Blue Tree Phuket drives ESG Initiatives, Reinforces its Sustainable Entertainment Hub Status<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Khaosodenglish<\/font>","source.href":"https:\/\/www.khaosodenglish.com","source.title":"Khaosodenglish","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"To underline the importance of World Environment Day on June 5, Blue Tree Phuket – a comprehensive entertainment destination – reaffirms its commitment as one of many leading organizations to promote the ESG (Environment, Social, Governance) standard in its business operations. This is aimed at sustainable organizational development under three main pillars: Energy – efficient energy usage and conservation, including the transition from fossil fuels to renewable electric power; Water – water management technologies to reduce resource consumption and ensure chemical safety; and Waste – waste segregation, recycling, single-use plastic reduction, as well as community outreach on pollution and plastic waste management. The world is currently facing all sorts of crises including the escalating effects of global warming. This year is one of the 8th hottest years in human history*, leading to rising sea levels and extreme ocean temperatures. Land, water sources and the Earth’s atmosphere are also being affected due to rising greenhouse gas emissions. Advertisement We are confronted with a climate emergency, loss of nature and diversity, and social inequality. The ESG standard is thus crucial for every company, serving as a framework to prioritize and implement long-term business development. Blue Tree Phuket is a comprehensive entertainment hub spanning approximately 140 rai (equivalent to 226,624 square meters), operating under the slogan “Entertainment Hub, Thrill & Chill, Day & Night.” Among the prominent highlights are the Blue Tree Lagoon, which covers an area of over 17,000 square meters, and a green space of about 180,000 square meters. Recognizing the importance of the environment and sustainability, Blue Tree Phuket has incorporated the ESG concept into its business operations to contribute to the country’s long-term sustainability. Mr.Johan Wallen, General Manager of Blue Tree Phuket, stated, “At Blue Tree, environmental care is our priority from the very beginning. It starts with infrastructure systems including the use of renewable energy, water management technologies, waste segregation, and single-use plastic reduction. We allocate resources internally and provide knowledge so that our employees and the surrounding communities take part in fostering sustainable growth. By aligning our organization with the principles of ESG, we reinforce our position as a new entertainment landmark in Phuket, focusing on three main pillars of sustainable development: Energy – efficient energy usage and the transition from fossil fuels to renewable electric power from fossil fuels, Water – water management technologies to reduce resource consumption and ensure chemical safety, and Waste – waste segregation, recycling, single-use plastic reduction, as well as community outreach on pollution and plastic waste management.” Energy – Efficient Energy Usage and Transition from Fossil Fuels to Renewable Electric Power We have initiated an internal campaign to promote energy conservation and efficient energy usage. This includes the installation of a 185-megawatt solar panel system on the roofs of buildings in the Lifestyle Village zone, accounting for 8.5% of the total energy consumption and we are planning additional installations in the near future. Electric Tuk-Tuk vehicles (EVs) are used for customer transportation, and electric rick shaw are run inside the project so as to reduce air pollution and minimize the use of fossil fuels. Blue Tree Phuket also plans to install electric vehicle charging stations in the parking lot of the Lifestyle Village within 2023. Water – Water Management Technologies to Reduce Resource Consumption and Ensure Chemical Safety Another highlight of Blue Tree Phuket is the Blue Tree Lagoon, which covers an area of over 17,000 square meters. It utilizes state-of-the-art technologies such as underwater cleaning robots, in line with sustainable principles. This approach reduces the human workforce and is environmentally friendly. The Lagoon also features a highly efficient water treatment system, using up to 100 times fewer chemicals as in traditional pools, as well as an energy-saving filtration system (Crystal Lagoon Technology) that is over 98% more efficient than conventional systems. In terms of water-saving devices, Blue Tree Phuket uses sensor-based faucets and handwashing stations in order to reduce water consumption. Additionally, the project has its own rainwater reservoirs to collect water for watering plants in all green areas. Waste – Sorting, Recycling, and Reducing Single-Use Plastics Blue Tree Phuket has a genuine commitment to waste separation, providing designated public areas for sorting waste into two categories: recyclable and general waste. Recyclable waste is sold, and the proceeds are returned to employees annually. Blue Tree Phuket also utilizes biodegradable food packaging such as food containers and straws made from sugarcane as well as wooden cutlery. Plastic water bottles are discouraged in the dining areas, and left-over food is sent to animal farms for feed. There are plans to compost the food scraps for making fertilizer in the future. Additionally, Blue Tree Phuket supports the creation of plastic-free boats in collaboration with Oceans For All to collect marine debris around Phuket’s islands. Furthermore, Blue Tree Phuket implements the Precious Plastic project, which transforms unused plastic such as recycled bottle caps into valuable new products, including glass coasters, keychains, and various woven bags made from upcycled vinyl. The project aims to educate the community and tourists about the pollution caused by plastic and its environmental impacts, and promote environmental care and sustainability both within and outside the organization. Blue Tree Phuket conducts regular training and activities for its staff on environmental awareness and sustainability. Employees are provided with reusable cloth bags and water bottles to refill instead of using single-use plastic. Regular clean-up activities involving the local community are organized both within and outside the resort premises. Thanks to its emphasis on waste separation, Blue Tree Phuket has been recognized by the Low Emission Support Scheme (LESS) of the Ministry of Natural Resources and Environment, with a carbon dioxide reduction equivalent to 38,315 tons through “Waste Separation for Recycling.” Blue Tree Phuket also participates in the “Establish Thailand as a Sustainable Tourism Destination” project by the Tourism Authority of Thailand (TAT), which aims to plan future carbon footprint reduction. ”In addition to waste separation, Blue Tree Phuket prioritizes the use of natural materials. Bamboo is a primary material in the decoration of almost all areas including buildings, beach chairs, and relaxation spots. The design also focuses on open spaces to enhance ventilation and improve air circulation, resulting in significant electricity savings. This also contributes to the local economy as the Phuket-Phang Nga-Krabi area is known for bamboo cultivation. Another community activity, “Wansao Picnic in the Park”, which is held every Saturday, provides an opportunity for locals to open their shops, exchange experiences, and knowledge. These initiatives reiterate our ESG principles in supporting sustainable community development,” Mr. Wallen added. All these factors are evidence that Blue Tree Phuket is actively striving for ESG initiatives, taking small steps to drive the organization and the community towards a better and more sustainable future. For more information, please call 076-602435 or click www.bluetree.fun\/ #บลูทรี #ภูเก็ต #บลูทรีภูเก็ต #BlueTree #Phuket #BlueTreePhuket Advertisement #Entertainmenthub #ThrillandChill #DayandNight #ESG #วันสิ่งแวดล้อมโลก #WorldEnvironmentDay *Source: The State of the Global Climate Report by World Meteorological Organization (WMO), disclosed on 21 April 2023","filter_flag":1}
{"title":"Drowning in plastic: Over 75% of plastic produced between 1950 to 2017 become waste – How big a monster have we created? - The Financial Express","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L9IBrwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L2xpdGUv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L9IBrwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L2xpdGUv?oc=5","id":"CBMiqgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L9IBrwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L2xpdGUv","guidislink":false,"published":"Sun, 18 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=169, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L9IBrwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L2xpdGUv?oc=5\" target=\"_blank\">Drowning in plastic: Over 75% of plastic produced between 1950 to 2017 become waste – How big a monster have we created?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Financial Express<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Drowning in plastic: Over 75% of plastic produced between 1950 to 2017 become waste – How big a monster have we created? - The Financial Express","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L9IBrwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlL3NjaWVuY2UtZHJvd25pbmctaW4tcGxhc3RpYy1vdmVyLTc1LW9mLXBsYXN0aWMtcHJvZHVjZWQtYmV0d2Vlbi0xOTUwLXRvLTIwMTctYmVjb21lLXdhc3RlLWhvdy1iaWctYS1tb25zdGVyLWhhdmUtd2UtY3JlYXRlZC0zMTMwMzA3L2xpdGUv?oc=5\" target=\"_blank\">Drowning in plastic: Over 75% of plastic produced between 1950 to 2017 become waste – How big a monster have we created?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Financial Express<\/font>","source.href":"https:\/\/www.financialexpress.com","source.title":"The Financial Express","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Plastic pollution is a global menace. Every minute, the equivalent of one garbage truck of plastic is dumped into our oceans. Approximately, 7 billion of the 9.2 billion tonne of plastic produced from 1950 to 2017 became plastic waste, ending up in landfills or dumped, as per the United Nations Environment Programme (UNEP). The situation in India is no less better. The country is now among the top five polluters in the world, generating a staggering 3.4 million tonne (MT) of plastic waste every year, of which only 30% is recycled, as per a report by Marico Innovation Foundation prepared in association with the Indian Institute of Science (IISc) and Praxis Global Alliance, released earlier this year. Also read: Climate Change: How modern lifestyle is adding to rise in pollution and carbon emissions Also Read Ram Setu from space! European Space Agency shares stunning satellite image China makes history! Becomes first country to bring back samples from Moon’s far side NASA warns against 88-ft airplane-sized asteroid speeding towards Earth – All you need to know International day of forests: Collaborative effort to help save our forests Interestingly, global brands, often identified as the top plastic polluters, are taking steps towards recycling, upcycling and a circular economy. But are the efforts efficient enough? Enter circular economy If you are someone who is concerned about plastic ending up in the environment, then you may have heard about a possible solution—the circular economy. “The concept essentially revolves around recycling, repurposing and reusing waste products to enable effective waste management and suitable resource recovery,” explains Anjali Taneja, senior policy specialist and group head of cross-sectoral initiatives, Centre for Study of Science, Technology and Policy (CSTEP), a think tank based in Bengaluru. “It blocks the leakage of plastic material into the environment,” adds Anu Pavithran V, a marine biologist who has done extensive research on microplastics. Although the concept has been around since the 1970s, it has gained attention in recent years, says Taneja. This increased focus is a “good thing” as people the world over are becoming aware of the detrimental impact of waste on the environment, well-being and resources. “Where, at one point in time, waste used to be simply disposed of in landfills or largely operated by the informal market, the circular economy could in fact guarantee that this waste is either reused or re-manufactured for greater social, environmental and economic gains,” the expert adds. While a circular economy can be challenging to achieve, Pavithran says “promoting the same would create more efficient and sustainable products, help reduce energy, save money and resource consumption”. The UNEP, in a recent report, batted for the circular economy, saying that global plastic pollution can be brought down by 80% by 2040 if countries and companies shift to a circular economy, along with making deep policy and market shifts. NITI Aayog, the Centre’s think tank, also sees huge potential. “With a growing population, rapid urbanisation, climate change and environmental pollution, India must move towards a circular economy,” it had said in 2021. “A circular economy path adopted by India could bring in substantial annual benefits, along with a significant reduction in congestion and pollution, which would consequently have a snowball effect on the economy,” it added. Upcycling the waste Although the real, long-term impact of a circular economy is yet to be seen, there are several companies that are working to manage plastic waste. In November last year, soft drink behemoth Coca-Cola joined hands with quick-service platform Zepto to launch the ‘Return and Recycle’ initiative for PET bottles. Under it, once a consumer completes her checkout on Zepto, she just has to tap on the designated touch-point on the app. The delivery partner then receives the notification, who then collects the PET bottles from the consumer, and deposits them in designated bins installed by Coca-Cola, after which the authorised recycler takes over and completes the further processing. Also read: El Niño: Drought, thundershower and more – How India will see extreme weather now Based on the “success” of the two-month pilot programme launched in Mumbai, the company decided to expand the initiative, and are now operational in 10 cities, says Abhishek Gupta, chief customer officer, Coca-Cola India and Southwest Asia. For Zepto, the initiative has a positive impact on the business as it increases customer engagement and aligns with their purpose to contribute to something meaningful in their engagement with us,” says Zepto’s COO Vinay Dhanani. Speaking on the partnership, he adds, “It started with the intent to create a circular economy for plastic by connecting all stakeholders to the recycling value chain.” By 2025, Coca-Cola aims to make all its primary consumer packaging recyclable and use 50% recycled material in its packaging by 2030, as per Gupta. “Additionally, we strive to collect and recycle a bottle or can for every one we sell by 2030 and bring people together to support a healthy, debris-free environment,” he adds. Earlier this month, the company launched new bottles made from 100% recycled PET plastic material (rPET) in Andhra Pradesh. It launched the new rPET packaging for its packaged drinking water brand Kinley in 1-litre bottles. “We are proud to be the first beverage company in India to offer our consumers a sustainable choice of packaging by launching Kinley bottles made from 100% recycled PET,” Enrique Ackermann, vice president, technical and innovation, Coca-Cola India and Southwest Asia, had said at the launch. Similarly, Bisleri International’s ‘Bottles for Change’ initiative aims to educate people about the responsible disposal of used plastic and provide enabling systems to facilitate recycling, says CEO Angelo George. Under this, the company, widely known for its bottled water, follows a three-step process of educating people to clean the used plastic, segregate it at the source, and send it directly for recycling through registered collection partners. “We also provide transport infrastructure to ensure used plastic reaches recyclers directly. The post-consumer plastic is sorted by the collection partners and sold to recyclers, who convert it into new products,” adds George. Upcycling involves transforming waste material into products that can be reused. “The used plastic is upcycled into utility items like bags, shoes, apparel and paving blocks, furniture, etc,” George explains. Earlier this year, Hindustan Unilever (HUL), which has brands like Close Up, Clinic Plus, Dove, Horlicks, Sunsilk, Vaseline, etc, and uses plastic in its packaging, joined hands with the UNEP to jointly launch the ‘Inclusive Circular Economy’ project. “These campaigns are aimed at driving the importance of waste segregation at source at the household level. Once the waste is segregated at the source, collection of the segregated waste is important, which helps recycle the material at the Material Recovery Facilities (MRFs) set up in partnership with UNDP in Mumbai, thereby building an innovative and scalable model,” a company spokesperson explains. The company might consider scaling up the initiative once the current pilot projects are fully established, the spokesperson adds. Companies like ITC and Amway India, too, said last year that they had become plastic-neutral. The question mark All of these can be seen as steps in the right direction, but questions remain on their efficacy. “It is important to note that these initiatives alone are not sufficient to address the issue of plastic pollution caused by these companies. Companies like Coca-Cola and Bisleri India are indeed among the biggest plastic polluters, and their initiatives to recycle or upcycle PET bottles are just one aspect of their overall sustainability efforts. While it is positive to see these companies taking steps to address their environmental impact, they need to do much more to reduce their plastic footprint,” says PK Joshi, professor at School of Environmental Sciences, Jawaharlal Nehru University, New Delhi. Notably, Coca-Cola has been the top plastic polluter globally for the fifth year in a row, as per the 2022 Brand Audit by Break Free From Plastic, a global movement that works for a future free of plastic pollution. Interestingly, Coca-Cola is the official corporate sponsor of COP27 in Egypt. In India, PepsiCo was the biggest plastic polluter in 2022 followed by CG Foods India, as per the report released in November last year. Touted as among the prominent ways of plastic waste management, the concept of recycling plastic has been around for a long time. According to Plastics for Change, a Bengaluru-based organisation that works for plastic recycling and in the process creating jobs for the marginalised, PET is the most recycled plastic. Recycling has its share of benefits like there’s no need for raw materials, reduced water use and energy conservation, apart from the fact that the discarded plastic does not end up in landfills. “But it is not a single solution to tackle plastic pollution,” says marine biologist Pavithran. For instance, plastic recycling may lead to the creation of microplastics. “Many studies have observed that mechanical abrasion and shredding of plastics during recycling in the facility may lead to microplastics in the environment. It also becomes a potential part of microplastic pollution,” says Pavithran. Not just environmental impact, but plastic recycling may pose a risk to human health too, especially to those working in the industry. “Plastic products contain toxic chemical additives that can cause serious health problems,” wrote Human Rights Watch in a report last year. “Plastic recycling releases those toxins into the local environment, threatening the health of those working in the industry and living nearby recycling facilities,” it added. Among the life-long health conditions, the toxic fumes increase the risk of cancer and reproductive system harm, the report noted. Calling out the plastic industry that has “championed recycling as a way to manage waste from their products,” the New York-based NGO said it has made “few efforts to minimise the amount of plastic in their products”. Although upcycling plastic to make clothing, accessories and other products can be a creative way to give discarded materials a new life and reduce plastic waste, it is not a complete solution to the problem of plastic pollution, as per Joshi of JNU. “Once the plastic is upcycled into a new product, it may still release microplastics when washed or eventually break down into smaller particles that can still pollute the environment.” “Upcycling initiatives can only address a small portion of the overall plastic waste generated each year, and they do not address the root causes of plastic pollution, such as overconsumption and lack of proper waste management,” Joshi adds. Amsterdam-based independent global network Greenpeace, too, warns against circular economy in a recent report. “Plastics are inherently incompatible with a circular economy,” it says, adding that recycled plastic is more toxic than the original and contributes significantly to microplastic pollution. The recycled plastic often contains higher levels of harmful chemicals such as benzene, toxic flame retardants, carcinogens and environmental pollutants, the report adds. The way forward All said and done, for companies, affordability remains a prominent factor. “In packaging, the choice between materials is governed by the affordability of the solution for the consumer, the overall carbon footprint and the impact on resources across the entire value chain,” says Bisleri International’s George. “While alternatives to PET are being explored, the production of substitute materials may require more energy and resources, and their disposal also has environmental implications. Hence, a complete replacement of plastic\/ PET is not feasible now,” he adds. In the current scenario, while exploring eco-friendly plastic alternatives is underway, eliminating plastic completely appears unfeasible. In such a situation, proper handling of discarded plastic is essential. “While recycling has a lot of disadvantages, proper collection and segregation methods, waste management strategies and avoiding single-use plastics may help to improve the management of discarded plastics,” says Pavithran. Joshi, too, points out the need for companies to explore alternatives to plastic packaging, among other steps, “to truly make a difference”. Some alternatives include glass, aluminum and paper. “Every change takes time,” says Ashish Agarwal, secretary of Recycle India Foundation, an NGO that works towards recycling plastic and e-waste. “It has hardly been four to five years since most brands have become aware of the importance of tackling the plastic waste problem,” he adds. MICROPLASTIC MENACE While plastic is preferred for its durability and resistance to decay, the same properties lead to another menace— microplastics. These are tiny pieces of plastic, smaller than 5 mm. These are generated when larger plastic debris breaks down into smaller pieces. However, a type of microplastic, called microbeads, is also manufactured and added to several health and beauty products as exfoliants, such as in cleansers and toothpaste. Worryingly, a recent peer-reviewed study in the United Kingdom suggested that recycling, the strategy devised to get rid of waste, may be contributing to microplastics. Since these are extremely small particles, they can travel far and wide and have been found at places as divergent as the Antarctic snow and even the human bloodstream. Until now, these have been found in the human lungs, livers, spleens, kidneys, and even the placentas of newborn babies. Although their impact on health is currently unclear, research has shown that plastic-associated chemicals such as plasticisers, methyl mercury and flame retardants, which can enter the body, can be a cause of concern for human health.","filter_flag":1}
{"title":"Swaraj launches 'Target' range of light tractors aimed at the growing horticulture segment - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9zd2FyYWotbGF1bmNoZXMtdGFyZ2V0LXJhbmdlLW9mLWxpZ2h0LXRyYWN0b3JzLWFpbWVkLWF0LXRoZS1ncm93aW5nLWhvcnRpY3VsdHVyZS1zZWdtZW50LTExNTMwNNIBhAFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3Mvc3dhcmFqLWxhdW5jaGVzLXRhcmdldC1yYW5nZS1vZi1saWdodC10cmFjdG9ycy1haW1lZC1hdC10aGUtZ3Jvd2luZy1ob3J0aWN1bHR1cmUtc2VnbWVudC0xMTUzMDQ_YW1wPTE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9zd2FyYWotbGF1bmNoZXMtdGFyZ2V0LXJhbmdlLW9mLWxpZ2h0LXRyYWN0b3JzLWFpbWVkLWF0LXRoZS1ncm93aW5nLWhvcnRpY3VsdHVyZS1zZWdtZW50LTExNTMwNNIBhAFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3Mvc3dhcmFqLWxhdW5jaGVzLXRhcmdldC1yYW5nZS1vZi1saWdodC10cmFjdG9ycy1haW1lZC1hdC10aGUtZ3Jvd2luZy1ob3J0aWN1bHR1cmUtc2VnbWVudC0xMTUzMDQ_YW1wPTE?oc=5","id":"CBMifmh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9zd2FyYWotbGF1bmNoZXMtdGFyZ2V0LXJhbmdlLW9mLWxpZ2h0LXRyYWN0b3JzLWFpbWVkLWF0LXRoZS1ncm93aW5nLWhvcnRpY3VsdHVyZS1zZWdtZW50LTExNTMwNNIBhAFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3Mvc3dhcmFqLWxhdW5jaGVzLXRhcmdldC1yYW5nZS1vZi1saWdodC10cmFjdG9ycy1haW1lZC1hdC10aGUtZ3Jvd2luZy1ob3J0aWN1bHR1cmUtc2VnbWVudC0xMTUzMDQ_YW1wPTE","guidislink":false,"published":"Fri, 02 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=153, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9zd2FyYWotbGF1bmNoZXMtdGFyZ2V0LXJhbmdlLW9mLWxpZ2h0LXRyYWN0b3JzLWFpbWVkLWF0LXRoZS1ncm93aW5nLWhvcnRpY3VsdHVyZS1zZWdtZW50LTExNTMwNNIBhAFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3Mvc3dhcmFqLWxhdW5jaGVzLXRhcmdldC1yYW5nZS1vZi1saWdodC10cmFjdG9ycy1haW1lZC1hdC10aGUtZ3Jvd2luZy1ob3J0aWN1bHR1cmUtc2VnbWVudC0xMTUzMDQ_YW1wPTE?oc=5\" target=\"_blank\">Swaraj launches 'Target' range of light tractors aimed at the growing horticulture segment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Swaraj launches 'Target' range of light tractors aimed at the growing horticulture segment - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy9zd2FyYWotbGF1bmNoZXMtdGFyZ2V0LXJhbmdlLW9mLWxpZ2h0LXRyYWN0b3JzLWFpbWVkLWF0LXRoZS1ncm93aW5nLWhvcnRpY3VsdHVyZS1zZWdtZW50LTExNTMwNNIBhAFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3Mvc3dhcmFqLWxhdW5jaGVzLXRhcmdldC1yYW5nZS1vZi1saWdodC10cmFjdG9ycy1haW1lZC1hdC10aGUtZ3Jvd2luZy1ob3J0aWN1bHR1cmUtc2VnbWVudC0xMTUzMDQ_YW1wPTE?oc=5\" target=\"_blank\">Swaraj launches 'Target' range of light tractors aimed at the growing horticulture segment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Conservation\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The Swaraj Target 630 model will first be available through its extensive dealer network in Maharashtra and Karnataka, starting from Rs 5.35 lakh ex-showroom. In a bid to participate in the fastest-growing horticulture space, Swaraj Tractors, the country's second-largest tractor maker which is a part of the Mahindra Group, has launched a new range of 20-30 horsepower under the brand Target. The introduction of Target is part of a major product revamp at Swaraj, which is likely to witness five new platforms catering to multiple categories including electric and autonomous tractors. Apart from expanding the product range, the company is also in the process of setting up its third manufacturing facility, which will go on stream in the next couple of quarters. Hemant Sikka, president of Farm Equipment Business at Mahindra & Mahindra says Swaraj has been the fastest growing brand in the last decade and the plan to introduce this new range of tractors is to sustain the outperformance and grow the share. \"It is a white space for us, so this new range of tractors will bring in incremental sales. While India is a large cereal-consuming nation, the horticulture space has been significantly outpacing the market. With the crop area of just 18%, horticulture accounts for 30% of agri-GDP, it is a very important segment that Swaraj aims to participate in with new products,\" added Sikka. This new range of compact lightweight tractors has been developed after taking feedback from over 1,500 prospective buyers. Its narrowest track width and low turning radius allow farmers to navigate tight spaces effortlessly, significantly increasing productivity and minimizing crop damage, claimed the company. Mahender Singh Dhoni - Former Indian Cricket Team Captain has been using Swaraj Tractors on his 40 acres farm in Ranchi. The company is likely to use Dhoni as its brand ambassador in the future. Swaraj Tractors will initially debut two models in the 25 and 29 HP (14.91 – 22.37kW) categories under the Swaraj Target range. Around 50,000 units are sold annually in the 20-30 HP segment. The Swaraj Target 630 model will first be available through Swaraj's extensive dealer network in Maharashtra and Karnataka, with a competitive price starting from Rs 5.35 lakh ex-showroom. The market introduction of Swaraj Target 625 has already been actioned. In a market of 8.27 lakh units in FY-23, Swaraj Tractors sold 1.28 lakh units registering a growth of over 23%. During the last fiscal year, its market share grew by 189 basis points to 15.55% from 13.65%. As against a 6% compounded annual growth rate in the overall tractor market, the 20-30 horsepower range has been growing at 18%, thereby enabling the company to continue its outperformance. The company is targeting about 27-30% market share in the 20-30 horsepower segment. Rajesh Jejurikar, ED and CEO, Automotive and Farm Equipment Sector at Mahindra & Mahindra said, \"Swaraj has a core DNA of power and dependability, we need to inject some more modernity and make the brand more aspirational. We need to see how the farming segment is evolving and we will cater to their needs. Newer, younger people are coming into farming, newer professionals are getting into farming during covid.\" (With inputs from Manobhava Baruah)","filter_flag":1}
