{"title":"Schneider Electric's new research shows that digital and electric solutions can cut carbon emissions in office buildings ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpY3MtbmV3LXJlc2VhcmNoLXNob3dzLXRoYXQtZGlnaXRhbC1hbmQtZWxlY3RyaWMtc29sdXRpb25zLWNhbi1jdXQtY2FyYm9uLWVtaXNzaW9ucy1pbi1vZmZpY2UtYnVpbGRpbmdzLWJ5LXVwLXRvLTcwLTMwMTkzMjk1MS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpY3MtbmV3LXJlc2VhcmNoLXNob3dzLXRoYXQtZGlnaXRhbC1hbmQtZWxlY3RyaWMtc29sdXRpb25zLWNhbi1jdXQtY2FyYm9uLWVtaXNzaW9ucy1pbi1vZmZpY2UtYnVpbGRpbmdzLWJ5LXVwLXRvLTcwLTMwMTkzMjk1MS5odG1s0gEA?oc=5","id":"CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpY3MtbmV3LXJlc2VhcmNoLXNob3dzLXRoYXQtZGlnaXRhbC1hbmQtZWxlY3RyaWMtc29sdXRpb25zLWNhbi1jdXQtY2FyYm9uLWVtaXNzaW9ucy1pbi1vZmZpY2UtYnVpbGRpbmdzLWJ5LXVwLXRvLTcwLTMwMTkzMjk1MS5odG1s0gEA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpY3MtbmV3LXJlc2VhcmNoLXNob3dzLXRoYXQtZGlnaXRhbC1hbmQtZWxlY3RyaWMtc29sdXRpb25zLWNhbi1jdXQtY2FyYm9uLWVtaXNzaW9ucy1pbi1vZmZpY2UtYnVpbGRpbmdzLWJ5LXVwLXRvLTcwLTMwMTkzMjk1MS5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric's new research shows that digital and electric solutions can cut carbon emissions in office buildings ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Schneider Electric's new research shows that digital and electric solutions can cut carbon emissions in office buildings ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpY3MtbmV3LXJlc2VhcmNoLXNob3dzLXRoYXQtZGlnaXRhbC1hbmQtZWxlY3RyaWMtc29sdXRpb25zLWNhbi1jdXQtY2FyYm9uLWVtaXNzaW9ucy1pbi1vZmZpY2UtYnVpbGRpbmdzLWJ5LXVwLXRvLTcwLTMwMTkzMjk1MS5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric's new research shows that digital and electric solutions can cut carbon emissions in office buildings ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Decarbonization\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Study quantifies impact of technology upgrades on energy performance and carbon reduction in office buildings Research finds retrofitting buildings using a digital-first approach is best pathway to decarbonization NEW YORK, Sept. 20, 2023 \/PRNewswire\/ -- Retrofitting buildings using a digital-first approach is the best pathway to decarbonization, according to new research from Schneider Electric, the leader in the digital transformation of energy management and automation. Buildings represent an estimated 37% of global carbon emissionsi, and as about half of today's buildings are still likely to be in use in 2050 ii , the sector must urgently reduce operational carbon emissions, by making buildings more energy efficient. Schneider Electric's research shows digital and electric solutions can cut emissions in office buildings by up to 70% Post this The research findings show that deploying Schneider Electric's digital building and power management solutionsiii in existing office buildings could reduce their operational carbon emissions by up to 42% with a payback period of less than three years. If fossil fuel-powered heating technologies are replaced with electric-powered alternatives, and a microgrid with local renewable energy sources is installed, all-electric, all-digital buildings will see an additional 28% reduction in operational carbon emissions resulting in a total reduction of up to 70%. Mike Kazmierczak, Vice President of the Digital Energy Decarbonization Office, the team leading the science-based research and product innovation to accelerate the energy transition within Schneider Electric's Digital Energy division, explained that, \"Tackling operational emissions is the number-one lever to decarbonize existing buildings at scale and achieve net-zero emissions targets by 2050. This breakthrough research reveals that reducing carbon emissions by up to 70% is feasible if we transform our existing building stock into energy-efficient, fully-electrified and digitized assets.\" The research, carried out with the global design firm WSP, is based on modeling the energy performance and carbon emissions of a large office building built in the early 2000s across various U.S. Climate Zonesiv. This digital approach to building renovations is, however, applicable to all building types and climates, and is, therefore, the most effective building decarbonization strategy, yielding fast results with lower 'upfront carbon'v. Renovating through the deployment of digital technologies is not only less disruptive to daily operations, but also more effective from a lifecycle carbon perspective. Failing to rapidly decarbonize buildings could also result in stranded assets that lose value and are unattractive to both investors and tenants. Furthermore, recent research from the Boston University Institute for Global Sustainability and the Schneider Electric Sustainability Research Institute estimates that there is a sizable potential to create new jobs through the transition to low-carbon buildings. Schneider Electric is widely recognized as an impact company and a leader in decarbonization. Its connected products, software and sustainability services help drive operational efficiency, eliminate energy waste, and provide strategies for carbon reduction in buildings, factories, data centers, infrastructure, and homes. Schneider Electric's research and decarbonization scenarios offer immediate, practical solutions to help organizations navigate the complexities of the energy transition. To learn more about the findings of Schneider's research and three step process (strategize, digitize, decarbonize) to accelerate the path to net-zero buildings, visit here. Related resources: About Schneider Electric Schneider's purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On. Our mission is to be your digital partner for Sustainability and Efficiency. We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries. We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values. www.se.com Discover Life Is On | Follow us on: Twitter | Facebook | LinkedIn | YouTube | Instagram | Blog Discover the newest perspectives shaping sustainability, electricity 4.0, and next generation automation on Schneider Electric Insights. Hashtags: #ClimateWeekNYC #CREtechNewYork2023 #Buildings of the Future i Tracking Clean Energy Progress (International Energy Agency 2022). ii Energy Technology Perspectives (International Energy Agency 2020). iii Schneider Electric solutions include EcoStruxure Building Operation, EcoStruxure Building Advisor, Connected Room Solutions, Accusine power factor correction and harmonic filtering, PowerLogic submetering iv Using the ASHRAE (American Society of Heating, Refrigerating and Air-Conditioning Engineers) 90.1-2004 baseline for large offices (12-stories, 46728 m2). v Upfront carbon refers to the emissions primarily related to the extraction and production of building products and materials SOURCE Schneider Electric","filter_flag":1}
