{"title":"Drapers investigates: how fashion retail is carbon offsetting - Drapers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA","guidislink":false,"published":"Tue, 14 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=45, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5\" target=\"_blank\">Drapers investigates: how fashion retail is carbon offsetting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Drapers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Drapers investigates: how fashion retail is carbon offsetting - Drapers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmRyYXBlcnNvbmxpbmUuY29tL2luc2lnaHQvYW5hbHlzaXMvZHJhcGVycy1pbnZlc3RpZ2F0ZXMtaG93LWZhc2hpb24tcmV0YWlsLWlzLWNhcmJvbi1vZmZzZXR0aW5n0gEA?oc=5\" target=\"_blank\">Drapers investigates: how fashion retail is carbon offsetting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Drapers<\/font>","source.href":"https:\/\/www.drapersonline.com","source.title":"Drapers","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"At last October's United Nations Climate Change Conference, COP27, scientists predicted 2022 global carbon dioxide emissions from burning fossil fuel would increase 1% on 2021, to 36.6 billion tonnes of carbon dioxide CO2, driven primarily by an increase in global travel as Covid-19 restrictions eased. Scientists warn this will make it harder for the world to avoid disastrous levels of climate change: with the UN’s Intergovernmental Panel on Climate Change (IPCC) – an intergovernmental body tasked with advancing knowledge about climate change caused by human activities – says greenhouse gas emissions, which are mainly CO2, must decrease 43% by 2030 to limit global warming to 1.5 degrees Celsius in accordance with the 2015 Paris Agreement and escape its most severe impacts. Amid this spiralling carbon crisis, many fashion businesses acknowledge they must play a part in reducing emissions. Estimates vary, but the fashion industry is thought to contribute between 2% and 8% of annual global carbon emissions, according to various reports and estimates – from the raw materials used, transportation, manufacturing, product use (washing and drying by the wearer) to end of life, when many items are incinerated or sent to landfill rather than recycled. For companies with long, complex supply chains, businesses built on manufacturing and selling new products, reducing emissions is not simple. One of the ways many – including Aldo and Kering Group-owned Gucci, Saint Laurent and Balenciaga – do so is by carbon offsetting (see box): purchasing reductions in or the removal of carbon dioxide from the atmosphere from third parties to compensate for emissions generated by the business. While this does have some impact on reducing carbon levels, offsets are controversial, critics say they are an apologia for emitting and mean that businesses do not have to change their behaviour, and fraught with challenges. Those wanting to use them should consider a range of factors before doing so, say brands, activists and carbon reduction experts. Read more: Drapers Sustainable Fashion Conference 2023 Read more: Why Ganni is investing in carbon insetting Read more: What's next for sustainability in 2023? Many fashion businesses have been carbon offsetting for years. As the climate crisis has climbed higher up the global agenda, the business case for reducing emissions has become clearer, and standards such as B Corp certification – for which businesses must prove high standards of social and environmental performance – more coveted. For example, Marks & Spencer purchased 2 million tonnes of carbon offsets for an undisclosed sum between 2012 and 2017 as part of its Plan A sustainability plan, through programmes such as Unicef’s carbon-offset project, which funded 40,000 fuel-efficient cooking stoves in Bangladesh in 2014, as well as creating more than 150 new jobs for local people who were trained to manufacture, market and install the stoves. Global footwear brand Aldo purchases offsets from clean energy projects in India and China, as well as a forest conservation project in the Amazon. Advertisement Prices and projects vary. Nature-based projects are at the higher end, charging an average of $14.40 (£11.73) per tonne of carbon, while industrial gas destruction projects, which destroy emissions so they are not released into the atmosphere, are among the cheapest. Projects on the lower end of the market can charge less than $1-2 (80p - £1.61) per tonne. Others have started carbon insetting: financing carbon-reducing projects in their own supply chains (see box), such as premium Danish fashion brand Ganni and British luxury label Burberry – which set up its regeneration fund in 2020 to invest in both carbon offsetting and insetting projects, such as regenerative farming, which can help sequester (remove from the atmosphere) carbon (see box) with wool producers in Australia. Since 2021, M&S has not used offsets to maintain its carbon-neutral status, which it achieved in 2012, instead redirecting funds that would have been invested in offsets into its Climate Innovation Fund set up in June 2022 to support projects in its supply chain and operations. Edzard van der Wyck is co-founder and CEO of British brand Sheep Inc, which sells merino wool knitwear globally, direct to consumer via its website. It is a carbon negative business rather than just carbon neutral(see box), through ensuring products are biodegradable, minimising the carbon footprint of its manufacturing process, and allocating 5% of all revenues to biodiversity projects, with investments vetted by an independent advisory panel of climate change experts. Van der Wyck says offsetting can play a part in the battle against emissions, but warns businesses to be conscientious in which programmes they select. “Carbon offsetting definitely has a place in the market,” he tells Drapers. “It has to, while [the fashion industry is] still figuring out trying to improve, and industries have to evolve, because things can't simply change [overnight]. The second you carbon offset, [businesses] are immediately vilified [by industry and climate crisis observers], but there has to be a nuanced conversation about it. It’s not black and white – carbon offsetting is a grey area.” Advertisement However, van der Wyck notes that carbon offsetting is “a bit of a cowboy market”, pointing to some treeplanting schemes as an example of projects that can sometimes do more environmental harm than good: “It’s an uncomfortable reality. In New Zealand there are tree-planting exercises happening where farmers just plant a certain type of tree in these vast areas, and it's destroying the natural mix [of the environment].” He says this type of project is easy to sell to businesses because the idea of planting trees is straightforward and appealing, and simple to communicate to fashion customers: “But these are just saplings. They're tiny trees that take years to grow [into mature trees that will sequester large amounts of carbon]. “It's also getting harder and harder to verify all these projects. Sometimes they happen in faraway countries, or where maybe the auditing is not as strict as it should be or they don't audit it that often. Projects can kind of fall into disarray. It's very hard to know you're actually having a proper impact. You have to actually look at the data that sits behind it. It’s really important to understand the impact of projects that you're investing in.” Ganni’s sustainability director, Lauren Bartley, agrees, telling Drapers that carbon offsetting is an “opaque” approach offering businesses limited visibility and control over the schemes from which they purchase offsets. Because of this the Danish brand announced in February 2022 that it was no longer offsetting, and began carbon insetting later that year. She says: “Through insetting, we can forge stronger partnerships with our suppliers and be the lead investor in our own projects. This gives us full visibility of projects and their impact.” Swiss sneaker and sportswear brand On is stocked in the UK by retailers such Office, JD Sport, Selfridges and Harrods, and opened its first UK store on 10 February, on London's Regent Street. It has a keen focus on manufacturing products with as low a carbon footprint as possible. Ilmarin Heitz, On’s global head of innovation, says that reducing emissions in a business’s own supply chain is essential: “Lowering our carbon footprint is an important goal. However, it encompasses much more than carbon offsetting. At On, we believe innovation and sustainability go hand-in-hand. As we envision a future where every On product is fossil-free and is engineered for circularity, sustainability has become a main driver when designing a product.” As well as purchasing carbon offsets from projects developing fibre-to-fibre recycling techniques – turning textile waste into new fibers for clothing – it has reduced the use of airfreight from 39% of products shipped in 2019 to 12% in 2020 and continued to hold it at 12% in 2021, and works with its factories in its supply chain to reduce waste and be more energy efficient. The brand is also researching the use of carbon emissions to create a primary raw material for a shoe’s midsole. In September 2022, On revealed the first-ever shoe made from carbon emissions, called Cloudprime. The shoe is made from CleanCloud EVA (ethylene-vinyl acetate) foam that uses carbon emissions as a raw material. Heitz says: “The beauty of this project is that we capture harmful emissions before they enter the atmosphere, and at the same time we are moving away from [using] fossil feedstock [fuel or raw material for manufacturing made from fossilised carbon products, such as crude oil].” For Tamara Cincik, founder and CEO of Fashion Roundtable – a thinktank dedicated to driving greater responsibility in the fashion industry – like Van der Wyck, urges businesses to be wary of ineffective offsetting projects: “Carbon credits are a relatively new market and in a consumerist landscape, there is a danger of carbon offsetting and its schemes being used to meet KPIs while bolstering ‘green’ credentials. “There are many fashion initiatives that claim to offset a company’s carbon through planting trees – an example is where a tree is planted for every order placed. The same trees will be planted in one place at mass. This is known to decrease nutrients from the soil and also impact on the diversity of bacteria that are critical to the balance of soil. “This [emissions reduction] requires long-term thinking and our research points to the fact that much of the work around carbon offsetting is short-termist. Take the example of Microsoft’s efforts to offset its carbon, by planting trees, which later burned down in a forest fire [in August 2021, in Washington and Oregon, US, a fire destroyed forestry projects used by companies including BP and Microsoft to offset their carbon emissions].” Cincik urges fashion businesses to consider investing in regenerative farming as “something which goes beyond soil health and instead looks at improving the land instead of causing harm”. She adds: “This ultimately leads to healthier soil with the capabilities of working towards healthier communities.” Footwear brand Allbirds uses offsets to reduce its carbon emissions, as well as using ocean liner shipping instead of air, working with third-party factories in its supply chain to increase renewable energy use, and using low-carbon materials – plant leathers with 40 times less carbon impact than traditional leather, and avoiding petroleum-based synthetics, for example. “It’s an ‘and’ strategy, not an ‘either\/or’ strategy,” Hana Kajimura, head of sustainability, tells Drapers, of the combination of Allbirds’ offsetting and work on its own emissions. “We've been a carbon-neutral company since 2019 [certified by Climate Neutral, a non-profit organisation that measures the impact of the carbon dioxide equivalent that brands measure, remove, avoid, and reduce]. We tax ourselves for every tonne of CO2 that we emit, and all of that money goes into a pool. And at the end of the year, we invest in projects that reduce or avoid emissions, to find out what our footprint was in the air. And that's all in addition to very aggressive reduction targets. “In terms of the specific projects we fund, the first thing we do is purchase renewable energy credits against all of our electricity footprints [more than 40% of energy-related CO2 emissions are caused by the burning of fossil fuels for electricity generation], to match like for like with that part. And then with what's remaining, we do a combination of projects, but try to invest in nature-based projects as much as possible.” Renewable energy credits generate one MW\/hour of electricity from a renewable energy source for use elsewhere. Allbirds also funds projects in renewable energy and lower carbon farming, such as the Capricorn Ridge Wind initiative, a wind farm in Texas. Kajimura says: “Like anything in the climate crisis, there's no perfect solution. So, yes, you can find companies that are just planting trees and continuing to pollute not doing anything to reduce their footprint. You can find offset projects that aren't doing what they say they should. Of course, there are flaws. But there's also a lot of good. \"My fear is that we throw out all the good with the bad by painting offsets with a broad brush. It's just making sure that all of the projects that we do invest in one are certified to best in class, third party standards, ensuring that the developers of the project have gone through all the hoops to prove that it's going to be well managed and that there are mechanisms in place to control for challenges. And then Climate Neutral is an additional check on top of that offset certification to make sure that we're doing this all responsibly. We're always going to be doing both reducing [carbon emissions] and some form of offsetting. We will just have to buy fewer and fewer offsets.” Margaret Kim, CEO of Gold Standard – a certification programme for emission reductions – agrees with Kajimura that verification is critical: “If carbon markets are to be an effective tool [in reducing global emissions], buyers need to be assured that each credit they purchase is really removing 1 tonne of carbon from the atmosphere. “Some project types are not eligible under the Gold Standard carbon crediting issuance, such as those that could prolong or expand the use of fossil fuels, large hydro restrictions, and avoided deforestation (REDD+) [protecting forests that would otherwise be cleared for use] projects. The reasons vary, but the general rule is that there are too many shortcomings and uncertainties be confident of their impact, and therefore we do not believe these projects should be funded by carbon credits. Credits created from such projects are like the ‘fast fashion’ of the carbon market: lower quality, produced quickly and with uncertain impacts.” Kim points to projects seeking to make vehicle engines more efficient as an example of those that, while certainly reducing emissions, may have the \"perverse effect of extending the life of the vehicle and incentivise further use of fossil fuel\" - hence Gold Standard does not support them. While carbon offsetting should not be dismissed, fashion businesses wanting to use offsets must thoroughly research programmes if they are to have a genuine impact on emissions, and to avoid doing more damage to the environment or investing in sham projects. They must also simultaneously invest directly into reducing emissions within their own supply chains: the climate crisis will not wait.","filter_flag":1}
{"title":"Govt to buy up €3 million worth of carbon credits from Slovakia to meet climate targets - TheJournal.ie","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZ292ZXJubWVudC1idXktY2FyYm9uLWNyZWRpdHMtc2xvdmFraWEtNTk5NTU5OC1GZWIyMDIzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZ292ZXJubWVudC1idXktY2FyYm9uLWNyZWRpdHMtc2xvdmFraWEtNTk5NTU5OC1GZWIyMDIzL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZ292ZXJubWVudC1idXktY2FyYm9uLWNyZWRpdHMtc2xvdmFraWEtNTk5NTU5OC1GZWIyMDIzL9IBAA","guidislink":false,"published":"Tue, 14 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=45, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZ292ZXJubWVudC1idXktY2FyYm9uLWNyZWRpdHMtc2xvdmFraWEtNTk5NTU5OC1GZWIyMDIzL9IBAA?oc=5\" target=\"_blank\">Govt to buy up €3 million worth of carbon credits from Slovakia to meet climate targets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheJournal.ie<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Govt to buy up €3 million worth of carbon credits from Slovakia to meet climate targets - TheJournal.ie","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZ292ZXJubWVudC1idXktY2FyYm9uLWNyZWRpdHMtc2xvdmFraWEtNTk5NTU5OC1GZWIyMDIzL9IBAA?oc=5\" target=\"_blank\">Govt to buy up €3 million worth of carbon credits from Slovakia to meet climate targets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheJournal.ie<\/font>","source.href":"https:\/\/www.thejournal.ie","source.title":"TheJournal.ie","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"THE GOVERNMENT IS due to buy up almost €3 million worth of carbon credits from Slovakia ahead of an EU deadline for emission target compliance. Environment Minister, Eamon Ryan, received Cabinet approval today to buy the credits to help comply with 2020 emission targets, with the deadline for compliance being 17 February. The agreement will see Ireland purchase over 4.1 million credits from Slovakia to help meet the 2020 target, at a cost of €2.9 million. Additionally, Ireland had over 2.9 million credits on hand from previous transactions that were carried out by the National Treasury Management Agency (NTMA). The credits are being bought to comply with emission targets within specific sectors of the economy, particularly buildings, transport, agriculture, waste, and some sections of industry. Advertisement EU regulations required Ireland to cut emissions within these sectors by 20% compared to 2005 levels. Under the Effort Sharing Decision, EU member states are required to limit greenhouse gas emissions but there is flexibility on how these targets are met. In particular, the regulations allow for EU states to sell or buy carbon credits from other countries as well as allowing them to carry forward a 5% emission allocation to the next year. Between 2013 and 2019, Ireland had met the Effort Sharing Decision targets and need to comply with the targets by Friday 17 February. The decision to purchase credits from Slovakia comes after both EU member states and politicians reached an agreement to reform the bloc’s carbon market. The plan aims to accelerate emissions cuts, phase out free allowances to industries and targets fuel emissions from the building and road transport sectors, according to a European Parliament statement.","filter_flag":1}
{"title":"Using blockchain to rethink systems and society - Delano.lu","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vZGVsYW5vLmx1L2FydGljbGUvdXNpbmctYmxvY2tjaGFpbi10by1yZXRoaW5rLXN50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vZGVsYW5vLmx1L2FydGljbGUvdXNpbmctYmxvY2tjaGFpbi10by1yZXRoaW5rLXN50gEA?oc=5","id":"CBMiOGh0dHBzOi8vZGVsYW5vLmx1L2FydGljbGUvdXNpbmctYmxvY2tjaGFpbi10by1yZXRoaW5rLXN50gEA","guidislink":false,"published":"Tue, 28 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=59, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vZGVsYW5vLmx1L2FydGljbGUvdXNpbmctYmxvY2tjaGFpbi10by1yZXRoaW5rLXN50gEA?oc=5\" target=\"_blank\">Using blockchain to rethink systems and society<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Delano.lu<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Using blockchain to rethink systems and society - Delano.lu","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vZGVsYW5vLmx1L2FydGljbGUvdXNpbmctYmxvY2tjaGFpbi10by1yZXRoaW5rLXN50gEA?oc=5\" target=\"_blank\">Using blockchain to rethink systems and society<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Delano.lu<\/font>","source.href":"https:\/\/delano.lu","source.title":"Delano.lu","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The bigger the idea, the madder it can sound--but futures, for better or worse, are built on mad ideas. Survcoin, Food For Future and Nash FintechX are run by entrepreneurs who have mobilised blockchain technology in order to tackle entire systems such as food production or money itself, their ultimate aim being to address the climate crisis. Survcoin To what extent is conventional money keeping us addicted to fossil fuels? That’s a question posed by Jean Lasar, founder of Survcoin, a cryptocurrency that rewards decarbonisation efforts. “I believe we need to really interrogate some basics about how society works,” he says, arguing that change at a systemic level is necessary to properly fight climate change. “Decarbonising might well be become much easier if we were able to use other forms of currency--if we were able to organise transactions in a different way.” Part of problem with traditional money, Lasar explains, is that prices don’t contain much information. “Prices only tell you that someone hopes to earn money by selling you this at that price.” Value creation in this context happens simply when a company manages to make money from a manufacturing or commercial process. But Lasar, a former journalist, dreams bigger: his new currency, survcoins, are earned when you can prove that you have reduced your carbon footprint. How does that work? For now, Survcoin is devoted to soft mobility, or trying to incentivise people to use bikes, scooters, trains, buses, etc. instead of cars. Companies, shops or organisations can match the value of something they have--a sweatshirt, a painting, a day off for an employee--to an amount of carbon that travelling sustainably manages to save. Survcoin comes in by verifying that amount of carbon and handling the transaction, using a digital ledger for traceability and transparency. In effect, this enables individual organisations to invest in behaviour rather than more tangible things like technologies or products. Lasar believes that Survcoin is competitive against current decarbonisation incentives like subsidies for green vehicles. “We reward usage and behaviour rather than ownership,” he points out. Purchases are one-offs, whereas behaviour is ongoing. Asked to clarify whether the concept relies on the organisation to act out of goodwill, Lasar explains: “There are monetary benefits which an organisation can obtain from using survcoins. A commune can gain a better Climate Pact ranking, for instance, which will result in increased subsidies. An employer who manages to induce more active mobility among their staff will benefit from their enhanced health and assiduity.” There is potential marketing value as well, he adds: “If you look at how companies rush these days to obtain any kind of green credentials they can get, it makes sense to me that demonstrably stimulating soft mobility among their personnel with the help of a dedicated currency could easily be heralded as a way of assuming climate responsibility.” The startup is currently running a pilot project (“MobiDiff”) in the commune of Differdange, where city employees can earn survcoins if they commute in a sustainable way. With a team of two and about 30 users, Survcoin is still in its beta phase, having incorporated in 2022 as a Société d’impact societal (societal impact company or “SIS”). One of the next goals, for Lasar, is to get enough users to create critical mass in Luxembourg and check the organisation’s proof-of-concept. Food For Future “No company on its own--no fund on its own--is going to be able to do this. It’s a lot of people that are going to have to do it.” The “it” here refers, in the broadest possible terms, to solving the climate crisis. More specifically, the speaker is talking about fixing systemic problems in the global food production industry. That speaker is Eduardo Gramuglia, CIO of a new Luxembourg entity called Food For Future. The company’s founder and CEO, Rushank Bardolia, draws attention to the extreme divide between rich and poor regions: in the global north, the discourse revolves around high-tech solutions and wealthy investors; in the global south, there are farmers who don’t even have reliable electricity, let alone access to innovative technologies or financial backing. Gramuglia’s comment also gets at the ethos of the company, which is to empower farmers and their communities rather than (per se) to sell a technological product. “We are an agriculture company that uses technology,” says Bardolia. “We are not a technology company that is used by agriculture. That is very important for us.” The company’s ambition is big. Its ultimate goal is to change the climate finance narrative by creating an asset class around regenerative agriculture (as a way to diversify climate funds). Abhimanyu Singh, COO, points out that smallholder farmers are currently completely cut off from the global food industry. How can such a goal be met? Most immediately, Food For Future is seeking to bring innovative technologies to farmers in places like Ghana, where a pilot project is currently underway, in order to digitise the first mile of the food supply chain. This farm-to-factory phase is, in Singh’s phrasing, “where the sustainability number game is won or lost”. The transparency offered by blockchain, for instance, will help fight local corruption and secure records of where crops originated. Eventually, it will also enable a platform on which farmers can sell carbon credits on top of their agricultural output. At the same time, the firm wants to bring precision farming to these communities in order to enable regenerative agriculture practices on a large scale, a goal that will involve IoT sensors in the soil, drones and other data solutions. (Precision farming is the practice of using farmland more strategically with the help of analytical tools; regenerative agriculture is a farming practice in which land degradation is prevented and carbon neutrality\/negativity becomes possible.) Realising this vision will take time, however. Bardolia has already been living in Ghana for five years, building trust in the community and getting the early phases of the project off the ground. “Imagine,” he says, “…people are wanting to take blockchain to [Ghana]. But 60% of Africa does not have internet.” “Digitally, [the farmers] don’t exist,” adds Singh, pointing out that documentation and records are lacking in Africa. “What we are doing differently,” Bardolia continues, “is understanding what is missing on the ground--then bringing the technology to make it actually scalable, usable and affordable.” The project in Ghana is called Green Earth Agro, which began as a startup geared towards responsibly producing and selling palm oil but which, now as a project under the Food For Future holding company, has broadened in scope. Although in the longer term the company wants to take its expertise to countries all over the global south, right now it is still establishing itself in Ghana. Currently, it pays farmers to implement good farming practices that can be tracked on blockchain. “Once that is verified, and we sell that produce,” explains Singh, “we give them part of the profits back, enabling a circular economy--and the money goes directly into their crypto-wallets.” Once the farmers start to make more money than before, their trust will strengthen. “Change happens at the rate of trust,” says Singh. The idea is that eventually they will qualify for micro-financing loans with the record of tangible assets they will build. The project is gaining ground, and in the most literal way: it encompasses 1,000 acres of land as of now, with plans to extend to 5,000 in the next couple of years. In Luxembourg, the holding company is currently in its capital-raising stage and is run by just three people: Bardolia, Gramuglia and Singh. Nash FintechX Greenwashing, lack of transparency, lack of awareness, lack of trust, the double-counting of carbon credits… these are problems that blockchain technology is well-suited to tackling, says Nash FintechX CEO and founder Nida Khan. For instance, companies make claims related to sustainability efforts all the time. Imagine, says Khan, if these claims were put on a blockchain. “There [would be] a legal proof against them in case they go back on the claim or try to deny it,” she says in an interview. Tampering with the data is hard or impossible, which also makes things like government audits much easier. Khan’s idea is therefore a blockchain-based carbon market. “It’s not an easy task,” she says, explaining that her team needed to build the necessary code from scratch, since providers were not ultimately reliable for such a product. In fact, according to Khan, the whole project is novel: “What I’m trying to do is completely new. It has not been done before.” There are six other companies worldwide, to her knowledge, who have similar ambitions with carbon markets and distributed ledgers, but Nash FintechX differs in its approach. Whereas her competitors are building new business products (e.g. crypto-tokens) that a corporate client would have to adapt to, Khan explains that her ambition is to integrate those existing processes into the product so as to ease the process. To that end, Nash FintechX works with PDFs rather than tokens. Currently, the norm for businesses is to circulate a certificate of carbon credit as a PDF, so Khan wants to create an NFT of that PDF. “We can also break the NFT into different pieces,” she adds. “You can sell each individual part [of it].” That would be useful if a company wanted to resell a carbon credit to two or more buyers; without an NFT, you wouldn’t be able to break it up. The startup has a team of three, plus an advisory panel. It launched in 2020 as a consultancy firm but has since switched to software-as-a-service, and has recently been selected for the EuraTechnologies incubation programme in Lille. Its carbon offset marketplace CNet0, a platform where you can store your carbon offset certificates as NFTs, has recently gone live.","filter_flag":1}
{"title":"55 Women-Owned Businesses That Give Back & Do Good - Good Good Good","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5","id":"CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA","guidislink":false,"published":"Tue, 28 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=59, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5\" target=\"_blank\">55 Women-Owned Businesses That Give Back & Do Good<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Good Good Good<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"55 Women-Owned Businesses That Give Back & Do Good - Good Good Good","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5\" target=\"_blank\">55 Women-Owned Businesses That Give Back & Do Good<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Good Good Good<\/font>","source.href":"https:\/\/www.goodgoodgood.co","source.title":"Good Good Good","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"When it comes to making ethical and intentional purchases, it’s important to consider our carbon footprints, the labor practices of a company — and who owns and operates that company. And women-owned and operated businesses are often at the forefront of ethical consumption. It’s a theory that has even threatened women’s success: Women have greater moral reservations about ethical compromises in business. And you know what? We’re simply thrilled that many women business owners are strong in their convictions for a more ethical, just economy. Of course, gender is a complex, personal socially constructed concept, but it has very real implications on how we live, work, and thrive in our society. The systems that keep women from succeeding are the same systems that raise boys and men to prioritize capital over compassion — and we’re here to celebrate the people who are paving the way to the end of the patriarchy. According to the World Economic Forum, women started 49% of all new businesses in the U.S. in 2021, up 28% from just two years prior. More women are becoming entrepreneurs than ever before — and businesses owned by Black women represent the highest rate of growth in the number of total women-owned businesses. However, in the U.S., men still outnumber women two to one when it comes to business ownership. We’re here to remind you that you don’t need an excuse like Women’s History Month or International Women’s Day to support a woman-owned business. In fact, we’ve made it even easier to shop from diverse, women-run companies and social enterprises that make the world a better place year-round. Here is the ultimate guide to women-owned businesses — in fashion, home goods, health and beauty, food, lifestyle, pets, and media — that give back and do good. By the way, some of the links in this article are affiliate links, which means if you make a purchase after clicking a link, we may earn a commission at no extra cost to you. Thank you! ‍ The best women-owned and women-led businesses that make a difference Clothing & Accessories wearwell Co-founders: Erin Houston & Emily Kenney What’s good: wearwell is an ethical and sustainable clothing and accessory brand, carrying products specifically aligned with values of secondhand shopping, size inclusivity, vegan values, and uplifting women- and Black-owned businesses. 1% of every wearwell purchase is donated to a nonprofit of the customer’s choice, like FABSCRAP, Black Girl Ventures, and Holler Health Justice. → Shop wearwell ‍ Girlfriend Collective Co-founder & creative director: Ellie Dinh What’s good: Girlfriend Collective makes apparel and underwear made with 80% recycled plastic bottles (RPET). The brand also has a recycling program (the ReGirlfriend program) to help end the waste produced by clothing and contribute to a circular economy. → Shop Girlfriend Collective ‍ For Days Co-founders: Kristy Caylor & Mary Saunders What’s good: For Days accepts your pre-loved clothes and gives you $20 in Closet Cash toward your next purchase in the brand’s online shop, where you can buy new sustainable items and contribute to a new model of circular fashion. Also, 1% of every For Days purchase is donated to a nonprofit of your choice, like The Loveland Foundation or Every Body Texas. → Shop For Days ‍ Subset Co-founders: Cayla O’Connell & Lauren Sagadore What’s good: Subset (formerly Knickey) is a sustainable underwear brand that prioritizes the use of low-impact materials for an eco-friendly and ethical production cycle. The brand also has a recycling program and has recycled over 750,000 items. → Shop Subset ‍ INK & ALLOY Founder & CEO: Gretchen Hollingsworth What’s good: INK+ALLOY is an accessory brand selling colorful, bold handmade products like jewelry, keychains, and purses. The company donates 5% of all proceeds to the education of girls in India. → Shop INK & ALLOY ‍ Lisa Says Gah Founder: Lisa Bühler What’s good: Lisa Says Gah is a clothing and accessory brand dedicated to slow, sustainable, and ethical manufacturing. With a history of charitable giving, the brand has contributed thousands of funds to organizations like The Loveland Foundation, Black Mamas Matter Alliance, Transition Projects, and more. → Shop Lisa Says Gah ‍ Richer Poorer Co-founder & CEO: Iva Pawling What’s good: Richer Poorer makes sustainable essential clothing items, made with recycled or ethically sourced materials. The brand gives back through the Carbon Fund, as well as Dress For Success Worldwide West, and a number of voting rights organizations. → Shop Richer Poorer ‍ Birdy Grey Co-founders: Grace Lee & Monica Ashauer What’s good: Birdy Grey is a bridesmaid dress and wedding essentials company that partners with The Princess Project to provide pre-loved dresses and accessories to girls in need for prom and other special events. → Shop Birdy Grey ‍ TomboyX Co-founders: Fran Dunaway & Naomi Gonzalez What’s good: TomboyX makes underwear, bras, swimwear and other essentials that are made to be comfortable for everyone, regardless of where they fall on the size or gender spectrum. A certified B Corp, TomboyX is ethical and eco-friendly and has a long history of charitable contributions to LGBTQ+ and social justice organizations. → Shop TomboyX ‍ Mejuri Co-founder & CEO: Noura Sakkijha What’s good: Mejuri is a sustainable luxury jewelry company that focuses on traceability and transparency in its craftsmanship, with over 80% of its gold coming from recycled sources. Mejuri also created the Empowerment Fund, which provides women and non-binary people with broader financial and educational resources to empower themselves. → Shop Mejuri ‍ Wildfang Co-founders: Emma Mcilroy, Taralyn Thuot, & Julia Parsley What’s good: Wildfang creates fun, gender-free clothing with inclusivity and sustainability in mind. The brand is Climate Neutral certified and gives back 1% of its annual revenue to causes that matter, sharing funds with organizations like Planned Parenthood, RAICES, ProjectQ, and more. → Shop Wildfang ‍ Home Goods Parachute Home Founder & CEO: Ariel Kaye What’s good: Parachute is a Climate Neutral certified home goods company that prioritizes ethics and responsibility. Investing in both environmental and social justice, Parachute leads carbon offset projects around the globe and has created the Home for Dreams initiative, which supports Black-owned businesses with capital, advisory meetings, and brand amplification. → Shop Parachute Pssst… Check out our sustainable bedding guide for more great options like Parachute! ‍ TUSHY Founder: Miki Agrawal What’s good: TUSHY is a bidet company fighting for clean butts and a clean planet. By helping to remove our dependence on toilet paper and water, TUSHY aims to create a more hygienic and sustainable bathroom experience. Plus, a portion of TUSHY profits goes to building community toilets in areas around the globe, fostering a revolution of “dignified defecation.” → Shop TUSHY ‍ Mustard Made Co-founders: Jess & Becca Stern What’s good: Mustard Made is a colorful and playful home organization brand made by and for moms. Based in the UK (but with offices and products in the U.S.), Mustard Made donates £5 from every order to Beam, which supports people experiencing homelessness to find secure housing, jobs, and training opportunities. → Shop Mustard Made ‍ Jungalow Founder: Justina Blakeney What’s good: Jungalow carries all kinds of unique home goods, decor items, and wallpaper that all start as hand-painted designs by founder Justina Blakeney. Aside from prioritizing sustainable materials and thoughtful manufacturing, Jungalow also plants two trees for every one product purchased. The brand also supports a number of charitable partners like Girls Who Code, The Rainforest Alliance, Southern Poverty Law Center, and more. → Shop Jungalow ‍ Our Place Co-founder & co-CEO: Shiza Shahid What’s good: Our Place sells kitchenware and home goods like pans, glassware, and more, all designed to bring people together around food and honor the traditions of immigrants and BIPOC communities. Many of Our Place’s items are made with partially recycled materials and every order is packaged 100% plastic-free. Additionally, Our Place works with nonprofits like Feeding America to make good food more accessible to all. → Shop Our Place Pssst… check out our shopping guide to recycled glassware, too! ‍ Baloo Living Founder & CEO: Elizabeth Grojean What’s good: Baloo Living is a weighted blanket company that embraces the comforts of deep pressure stimulation without compromising its eco-friendly values. Baloo is a member of the NYC Fair Trade Coalition and Ethical Brand Directory and practices carbon neutrality through a partnership with Sea Trees by Sustainable Surf (which replants mangrove forests!). Baloo also donates a portion of profits to Pajama Program, which supports children facing adversity by providing the means to a healthy bedtime. → Shop Baloo Living ‍ Lorena Canals Founder & designer: Lorena Canals What’s good: Lorena Canals rugs, designed by none other than Lorena Canals, use no chemicals in its production process. The company also created a “RUGCYCLED” collection that uses cotton leftovers and scraps from their other products to maintain a zero-waste status. The Lorena Canals factory is in India, where more than 170 artisans make each of the pieces by hand under fair trade practices. This is also home to the brand’s Sakûla Project, which provides food and education to low-income children in India. → Shop Lorena Canals Pssst… Check out our guide to sustainable rugs for more! ‍ MINNIDIP Founder: Emily Vaca What’s good: MINNIDIP is a designer inflatable pool brand to help everyone have a pool party! MINNIDIP regularly donates to charitable partners in areas of environmental conservation, animal rights, childhood cancer and homelessness, and social justice. → Shop MINNIDIP ‍ Health & Beauty BLK & GRN Founder: Dr. Kristian Edwards What’s good: BLK & GRN was created out of a desire to normalize access to non-toxic beauty products for Black women and to fund Black women entrepreneurs who care about the planet and the products they use every day. All products offered by BLK & GRN are ethically sourced and are made by over 136 Black artisans. These personal care items are safe for people and the planet and cultivate the Black community with every dollar spent. → Shop BLK & GRN Pssst… Check out our guide to Amazon alternatives for more! ‍ OUI The People Founder: Karen Young What’s good: Personal care brand OUI The People creates sustainable skincare products and stainless steel razors that “go against the grain.” By prioritizing transparency from product to packaging, OUI The People makes bodycare cool for the planet. → Shop OUI The People ‍ Hero Cosmetics Co-founder & CEO: Ju Rhyu What’s good: Hero Cosmetics is a skincare brand (and home of the Mighty Patch). Designed to create effective solutions for acne, rosacea, and dark spots, Hero aims to remove the stigma of skin conditions — and treat them with care. The brand also works with Carbon Fund to reach full product carbon neutrality. → Shop Hero Cosmetics ‍ Megababe Founder: Katie Sturino What’s good: Megababe creates innovative products for normal body discomforts like boob sweat, chafing, and underarm bumps. Free of toxic chemicals and made with vegan ingredients, Megababe is good for you and the planet, all while embracing our beautiful bodies just as they are. → Shop Megababe ‍ Supergoop! Founder: Holly Thaggard, CEO: Amanda Baldwin What’s good: Holly Thaggard started Supergoop by working to make sunscreen available in schools in Texas. In addition to protecting its customers from the sun, Supergoop continues to donate SPF pumps to schools across the country through their Ounce by Ounce program. → Shop Supergoop ‍ RÓEN Beauty Founder & CEO: Tiffany Thurston Scott What’s good: Founded by clean makeup enthusiast Tiffany Thurston Scott, RÓEN Beauty creates makeup and beauty products formulated with ingredients that are vegan, gluten, and cruelty-free. The brand is also part of the Responsible Mice Initiative, which ensures that any mica used in makeup products is carefully selected from raw material manufacturers and 100% ethically sourced. The brand also partners with TerraCycle to help customers recycle their outer makeup packaging. → Shop RÓEN Beauty ‍ maude Founder & CEO: Éva Goicochea What’s good: maude makes body-safe sexual wellness essentials that are inclusive to all and made sustainably. The brand furthers its mission of accessible and inclusive sexual wellness by working closely with organizations like Advocates for Youth and SIECUS (Sexuality Information and Education Council of the United States)! → Shop maude → Explore our full reviews of all maude sex toys, maude lubes, and other maude products ‍ Pink Moon Founder & CEO: Lin Chen What’s good: Pink Moon is a skincare and wellness brand founded on the owner’s long-held practices of Traditional Chinese Medicine, Reiki, and Astrology. By partnering with EcoCart to provide carbon-neutral shipping, Pink Moon has offset over 334,000 pounds of carbon while providing its signature eco-conscious products. Pink Moon also donates 1% of every purchase to a nonprofit of your choice, like Animal Haven and Womankind. → Shop Pink Moon ‍ SAALT Co-founder & CEO: Cherie Hoeger What’s good: SAALT is on a mission to “bring periods out of the dark ages” by creating reusable, safe menstrual products for all. With menstrual discs and cups, as well as period underwear, the brand aims to make having a period better for the planet — and in general! A certified B Corp, SAALT also donates 2% of its revenue to provide period care to regions with the most need, and help fund initiatives in menstrual health, education, and sustainability. The brand has donated over 52,000 period products, cleaned up over 78,000 pounds of trash, and funded over 373,000 days of school for girls around the globe. → Shop SAALT ‍ Rael Co-founders: Yanghee Paik, Aness An & Binna Won CEO: Yanghee Paik What’s good: Rael is a holistic wellness brand that promotes full-cycle care (so they have goods for periods and skincare!), using cruelty-free and eco-conscious ingredients. Embracing Korean beauty science, Rael aims to provide high-performing period care across the globe. Rael is also on a mission to spread menstrual dignity to all, working with charitable partners like #HappyPeriod and I Support The Girls. → Shop Rael ‍ Ritual Founder & CEO: Katerina Schneider What’s good: Ritual was created when founder Katerina Schneider couldn’t find a prenatal vitamin she felt she could trust — so she set out to make her own. Ritual creates vitamins with completely traceable ingredients, from farms and suppliers that use regenerative agriculture practices. A certified B Corp, Ritual is also committed to its sustainability goals, aiming to have 100% sustainable packaging by 2025 and reach net zero emissions this year. → Shop Ritual ‍ Food Seattle Chocolate Co. Owner & CEO: Jean Thompson What’s good: Eating sweets has never been so good. Seattle Chocolate Co, and its sister company jcoco, make up an ethical chocolate umbrella that gives back. The company’s origin chocolate is directly sourced from small Peruvian Farms and it uses Rainforest Alliance Certified cocoa in its large line of products. As of 2022, the brand is also certified carbon neutral! Best of all, Seattle Chocolate Co. donates 10% of its net profits to Girls Inc, and jcoco donates fresh servings of food to those in need with every purchase. Partnering with food banks in Washington, California, and New York, the company has donated nearly 4 million servings of food. → Shop Seattle Chocolate Co. ‍ Sips By Founder & CEO: Staci Brinkman What’s good: A top-rated tea club and subscription service, Sips By works with hundreds of tea brands across the globe to bring people together over a steamy mug of tea. Sips By partners include other women-owned brands, as well as BIPOC-owned, AAPI-owned, and LGBTQ+-owned small businesses that practice ethical and sustainable sourcing. → Shop Sips By ‍ Fly By Jing Founder & CEO: Jing Gao What’s good: Fly By Jing creates spicy Schezwan sauces, spices, and dumplings inspired by the flavors of founder Jing Gao’s hometown of Chengdu. With bold, soulful tastes and bright design, Fly By Jing highlights the personal cultural histories of its founder — and the AAPI community. Adding a little spice to the fundraising scene, Fly By Jing has also worked with charitable partners like St. Jude Children’s Hospital and BeChinatown. → Shop Fly By Jing ‍ Diaspora Co. Founder & CEO: Sana Javeri Kadri What’s good: Sana Javeri Kadri started Diaspora Co. when she was 23 in 2017, selling just one item: Pragati Turmeric. Her desire was to create a radically new, equitable spice trade. Today, Diaspora Co. sources 30 single-origin spices from 150 farms across India and Sri Lanka, paying farm partners an average of over six times above the commodity price, investing in land stewardship, climate resistance, and delicious food systems. Part of this work is through the company’s Farm Worker Fund, which invests in the social and economic well-being of over 850 farm workers in South Asia. Diaspora Co. has also provided healthcare access to 25 women in the farm community. → Shop Diaspora Co. ‍ Women’s Bean Project Founder: Jossy Eyre, CEO: Tamra Ryan What’s good: The Women’s Bean Project is a nonprofit social enterprise that provides transitional employment and self-sufficiency to women experiencing poverty. Making nourishing products while nourishing the community, Women’s Bean Project now sells products through over 1,000 retailers, and has helped to keep 95% of their program graduates employed a year after completing their program. → Shop Women’s Bean Project ‍ Omsom Co-founders: Vanessa Pham & Kim Pham What’s good: Sisters Vanessa and Kim Pham created Omsom to offer sauce packets and starters that celebrate the multitudes of Asian flavors, stories, and communities. While opening up diverse flavor profiles and having conversations about big topics like xenophobia and the “ethnic aisle” in the grocery store, Omsom doesn’t shy away from being loud and proud. Through their brand, the duo has also worked to give back to the AAPI community, donating to Heart of Dinner, to feed AAPI elders in New York City. → Shop Omsom ‍ Partake Founder & CEO: Denise Woodard What’s good: Partake was born out of a mom’s desire to make tasty snacks for her daughter, who has many food allergies. Selling cookies, breakfast and baking mixes, and snack packs, every offering at Partake is certified gluten-free, non-GMO, and vegan. They are also free of the top nine allergens: wheat, tree nuts, peanuts, milk, eggs, soy, fish, sesame, and shellfish. While championing food inclusivity (did you know Black children are at a significantly higher risk for developing food allergies?) Partake also works with organizations like No Kid Hungry to fight food insecurity. Denise also founded Black Futures in Food & Beverage, an annual fellowship program that mentors HBCU students to help them secure internships and jobs in the food industry. → Shop Partake ‍ Buchi Co-Founders: Jeannine Buscher & Sarah Schomber What’s good: Buchi is a kombucha brand dedicated to community, collaboration, and culture (pun intended). Ingredients are sourced through closed-loop, carbon-neutral sugarcane processes, and for other ingredients, preference is given to independent, women-owned, and minority-owned suppliers. Buchi also partners with One Tree Planted to work on reforestation projects around the world. → Shop Buchi ‍ Lifestyle Package Free Shop Founder & CEO: Lauren Singer What’s good: Package Free Shop is your one-stop shop for sustainable everyday items. With zero or minimal packaging, every item sold by Package Free Shop can either be composted, reused, refilled, or recycled. The brand encourages shoppers to lean into a planet-forward lifestyle, and since its launch in 2017, has diverted 132 million plastic bags, 48 million plastic straws, and 3.8 billion plastic water bottles from oceans and landfills. → Shop Package Free Shop ‍ Thistle Farms Founder & President: Becca Stevens CEO: Tasha Kennard What’s good: Thistle Farms is a nonprofit social enterprise that makes candles, lotions, essential oils, and more. Not only does every purchase support women survivors of trafficking, prostitution, and addiction — but the organization also houses residents in a therapeutic setting that offers them housing, healthcare, therapy, work, and community. → Shop Thistle Farms ‍ Stasher Founder: Kat Nouri CEO: Shannon Morgan Stearns What’s good: Stasher creates alternatives to plastic bags, making it easy to reduce food and plastic waste. In fact, since its founding, the company has saved over 5.5 billion single-use plastic bags from entering waterways and oceans. Stasher also donates 1% of its sales to environmental nonprofits, totaling over $1.3 million in donations to date. → Shop Stasher ‍ The Little Market Co-founders: Lauren Conrad and Hannah Skvarla What’s good: The Little Market is a nonprofit fair trade shop that features ethically-sourced and artisan-made products. By celebrating individual artisans and their cultural techniques and traditions, the Little Market brings attention to social justice and human rights issues while extending opportunities for people around the world. → Shop The Little Market ‍ Marley’s Monsters Owner & president: Sarah Dooley What’s good: Marley’s Monsters creates handmade reusable products UNpaper towels, cloth napkins, dusters, and more. These sustainable alternatives help minimize your carbon footprint and save trees, all while making your home a bit more colorful. Marley’s Monsters also diverts all of its fabric waste by donating scraps to St. Vincent de Paul Society of Lane County and ENVIA Fashion, where they are upcycled into other new products like jewelry, hair accessories, and more. → Shop Marley’s Monsters ‍ Blueland Co-founder & CEO: Sarah Paiji Yoo What’s good: Blueland is a Climate Neutral certified B Corp that designs reusable and refillable cleaning products like laundry essentials, hand soaps, cleaning sprays, and more. Since 2019, Blueland products have helped eliminate over a billion single-use plastic bottles from landfills and oceans. → Shop Blueland ‍ Pets Rowan Co-founders: Michelle Arnau & Sally Clarke What’s good: Rowan is reinventing coat care with naturally-derived formulas made with human-grade, vet-approved ingredients that keep your pup’s skin healthy, fur shiny, and smelling like coconuts (there’s even dry shampoo for dogs!). Plus, 1% of every purchase is donated to a nonprofit of your choice, like The Street Dog Coalition or Sage Compassion for Animals. → Shop Rowan ‍ Springer Co-founder & CEO: Shannon Ross VP of Finance & COO: Diana Ross What’s good: Springer creates innovative products for dogs and their parents, like travel bottles, walking gear, and more. As a member of 1% for the Planet, Springer also donates 1% of its sales to nonprofits that protect the environment — because there’s no better playground for pups than Mother Earth. → Shop Springer ‍ Dandylion Founder & CEO: Carolyn Chen What’s good: Dandylion is a dog skin and coat care company with natural products created in collaboration with vet dermatologists, chemists, groomers, and over 100 dog parents. Products — like this no-rinse paw cleanser — are pH-balanced and formulated with sustainably sourced ingredients that are vegan and cruelty-free. All packaged with recycled, recyclable, compostable, or biodegradable options — often by Chen and her family themselves. Dandylion also gives back to animal rescue organizations like Hope For Paws. → Shop Dandylion ‍ Cat Cave Co. Founder & CEO: Holly Hudson What’s good: Cat Cave Co. makes cat beds and products from ethically-sourced, organic merino wool. The brand pays its workers 200% the average wage and gives back to local shelters and rescues. → Shop Cat Cave Co. ‍ Dog Threads Co-founder & CEO: Gina Marie Davis What’s good: Offering a large collection of matching dog and human apparel items, Dog Threads donates a portion of each purchase to an animal rescue nonprofit to help shelter animals in need. The brand also recycles its scrap fabric to create donated dog beds! → Shop Dog Threads ‍ FOUND My Animal Co-founders: Bethany Obrecht and Anna Conway What’s good: FOUND My Animal sells rope leashes, collars, pet apparel, and accessories that promote animal adoption. Unique to each leash is a simple, numbered brass tag that reads “FOUND” and a portion of all sales go to support animal welfare and rescue organizations. Pets available for adoption are also widely shared across the brand’s social media pages. → Shop FOUND My Animal ‍ Media Pantsuit Politics Co-founders: Sarah Stewart Holland & Beth Silvers What’s good: The hosts of the Pantsuit Politics podcast take a different approach to the news, looking at politics through lenses of nuance, compassion, and care. → Listen to Pantsuit Politics ‍ The Newsworthy Founder: Erica Mandy Erica Mandy is an award-winning broadcast journalist and former CBS news reporter who started The Newsworthy, a daily news podcast to help people stay informed in a convenient, unbiased, and fun way. Her show empowers hundreds of thousands of listeners to engage more deeply with the world around them. → Listen to The Newsworthy ‍ The GIST Co-founders: Ellen Hyslop, Jacie deHoop & Roslyn McLarty What’s good: We all love a great newsletter! The GIST is a fan-first sports media platform that is reinventing the dialogue around sports by providing equal coverage of women’s and men’s sports. Whether you’re checking out the newsletter or listening to the podcast, the GIST will be there with bit-sized and badass sports coverage. → Subscribe to The GIST ‍ The 19th News Co-founder & CEO: Emily Ramshaw Co-founder & publisher: Amanda Zamora Editor-in-Chief: Julia B. Chan What’s good: The 19th is a nonprofit newsroom beloved for its reporting at the intersection of gender, politics, and policy. Supported by members, philanthropy, and corporate underwriting, the 19th offers free-to-consume and free-to-publish journalism — especially produced for women, women of color, and the LGBTQ+ community. → Become a member of The 19th ‍ Girlboss Founder: Sophia Amoruso CEO: Lulu Liang What’s good: Girlboss is a modern media company providing women all over the world with the tools and mindset to succeed. Whether you’re reading the Girlboss Daily newsletter, shopping Girlboss goods created by women, or listening to Girlboss Radio, you’re uplifting ambitious women everywhere. → Subscribe to the Girlboss Daily newsletter","filter_flag":1}
