{"title":"Renewable Energy Generation Operations Begin at Electrify America Solar Glow™ 1 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JlbmV3YWJsZS1lbmVyZ3ktZ2VuZXJhdGlvbi1vcGVyYXRpb25zLWJlZ2luLWF0LWVsZWN0cmlmeS1hbWVyaWNhLXNvbGFyLWdsb3ctMS0zMDE5MDEyMTMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JlbmV3YWJsZS1lbmVyZ3ktZ2VuZXJhdGlvbi1vcGVyYXRpb25zLWJlZ2luLWF0LWVsZWN0cmlmeS1hbWVyaWNhLXNvbGFyLWdsb3ctMS0zMDE5MDEyMTMuaHRtbNIBAA?oc=5","id":"CBMihgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JlbmV3YWJsZS1lbmVyZ3ktZ2VuZXJhdGlvbi1vcGVyYXRpb25zLWJlZ2luLWF0LWVsZWN0cmlmeS1hbWVyaWNhLXNvbGFyLWdsb3ctMS0zMDE5MDEyMTMuaHRtbNIBAA","guidislink":false,"published":"Tue, 15 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=227, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JlbmV3YWJsZS1lbmVyZ3ktZ2VuZXJhdGlvbi1vcGVyYXRpb25zLWJlZ2luLWF0LWVsZWN0cmlmeS1hbWVyaWNhLXNvbGFyLWdsb3ctMS0zMDE5MDEyMTMuaHRtbNIBAA?oc=5\" target=\"_blank\">Renewable Energy Generation Operations Begin at Electrify America Solar Glow™ 1<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Renewable Energy Generation Operations Begin at Electrify America Solar Glow™ 1 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JlbmV3YWJsZS1lbmVyZ3ktZ2VuZXJhdGlvbi1vcGVyYXRpb25zLWJlZ2luLWF0LWVsZWN0cmlmeS1hbWVyaWNhLXNvbGFyLWdsb3ctMS0zMDE5MDEyMTMuaHRtbNIBAA?oc=5\" target=\"_blank\">Renewable Energy Generation Operations Begin at Electrify America Solar Glow™ 1<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Milestone Renewable Energy Generation Project is Expected to Produce 225 Gigawatt-Hours Annually and Help Offset Energy Carbon Footprint For Delivered Charging Energy SAN BERNARDINO, Calif., Aug. 15, 2023 \/PRNewswire\/ -- Electrify America announced today the start of commercial operation for the new 75 Megawatt (MW) Electrify America Solar Glow™ 1 solar photovoltaic renewable energy generation project in San Bernardino County, CA, announced last year. Electrify America Solar Glow™ 1 is the result of a 15-year virtual power purchase agreement (VPPA) with developer Terra-Gen. Electrify America's Solar Glow 1, a milestone Renewable Energy Generation Solar Project, is expected to produce 225 Gigawatt-Hours annually to help offset energy carbon footprint for electric vehicle charging energy delivered. Electrify America is the largest open network of DC fast chargers for electric vehicles in the U.S. to enter into a virtual power purchase agreement for new renewable energy generation. This brand new construction contributes to 'additionality,' by producing new renewable energy that may not otherwise be available. \"Electrify America Solar Glow™ 1 is an important milestone in our commitment to reduce our energy carbon footprint,\" said Robert Barrosa, President and CEO of Electrify America. \"Electrify America is committed to being a part of the broader charging solution for EV drivers today and in the future.\" This investment is expected to generate 75 MW at peak solar capacity, which is comparable to the power drawn by 500 EVs charging at once at an average speed of 150 kilowatts. The total annual production is projected at 225 Gigawatt-hours (GWh). In 2022, Electrify America powered more than 5 million customer charging sessions or 3.5 times the sessions in 2021. These sessions delivered roughly 173 GWh of electricity, enabling an estimated 493 million miles of electric driving and avoided consumption of roughly 21 million gallons of gasoline. \"We expect the demand on our charging network to continue to rise with the increase in EV ownership,\" said Jigar Shah, Director of Energy Services at Electrify America. \"Solar Glow™ 1 adds new additional 100% renewable energy generation with estimated annual production that exceeds our 2022 network usage.\" \"This solar project is a significant accomplishment reinforcing our commitment in 2022 to back all energy delivered to customers on Electrify America's coast-to-coast public, ultra-fast DC charging network with 100% renewable energy,\" Barrosa said. The Electrify America Solar Glow™ 1 project is located in San Bernardino County, CA. It has over 200,000 solar panels and encompasses an area over one square mile. More information on Solar Glow™ 1 and Electrify America's VPPA investment is available here. To view \/ download a video of Electrify America's Solar Glow 1 – Click Here For Broadcast B-Roll of Electrify America's Solar Glow 1 – Click Here To access a digital photo of Electrify America's Solar Glow 1 – Click Here For Audio Soundbites from Jigar Shah, Director of Energy Services – Click Here About Electrify America Electrify America LLC, the largest open DC fast charging network in the U.S., is investing more than $2 billion in Zero Emission Vehicle (ZEV) infrastructure, and access. The investment will enable millions of Americans to discover the benefits of electric driving and support the build-out of a nationwide network of ultra-fast community and highway chargers that are convenient and reliable. Electrify America currently operates in 46 states and the District of Columbia, supporting increased ZEV adoption with a network that is comprehensive, technologically advanced and customer friendly. Electrify America earned the 2020 and 2021 \"EV Charging Infrastructure Best-in-Test\" award from umlaut , an infrastructure and benchmarking specialist, now part of Accenture, as published in Charged Electric Vehicles Magazine . Electrify America's Electrify Home ® offers home charging solutions for consumers with flexible installation options. Electrify Commercial ® provides expert solutions for businesses looking to develop electric vehicle charging programs. For more information, visit www.electrifyamerica.com and media.electrifyamerica.com . About Terra-Gen Terra-Gen, LLC is a leading U.S. developer, owner, and operator of utility-scale renewable energy projects in North America. The company has successfully developed over 5 GW of wind, solar and energy storage. Terra-Gen operates and maintains over 2.7 GW across 27 wind, solar and energy storage projects. Terra-Gen was formed in 2007 and is owned by ECP, a leading investor in infrastructure facilitating the energy transition, and Igneo Infrastructure Partners, a leading global asset manager. For more information, visit www.terra-gen.com. SOURCE Electrify America, LLC","filter_flag":1}
{"title":"The Clean Energy Future Is Arriving Faster Than You Think - The New York Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMjMvMDgvMTIvY2xpbWF0ZS9jbGVhbi1lbmVyZ3ktdXMtZm9zc2lsLWZ1ZWxzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMjMvMDgvMTIvY2xpbWF0ZS9jbGVhbi1lbmVyZ3ktdXMtZm9zc2lsLWZ1ZWxzLmh0bWzSAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMjMvMDgvMTIvY2xpbWF0ZS9jbGVhbi1lbmVyZ3ktdXMtZm9zc2lsLWZ1ZWxzLmh0bWzSAQA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMjMvMDgvMTIvY2xpbWF0ZS9jbGVhbi1lbmVyZ3ktdXMtZm9zc2lsLWZ1ZWxzLmh0bWzSAQA?oc=5\" target=\"_blank\">The Clean Energy Future Is Arriving Faster Than You Think<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New York Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Clean Energy Future Is Arriving Faster Than You Think - The New York Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2ludGVyYWN0aXZlLzIwMjMvMDgvMTIvY2xpbWF0ZS9jbGVhbi1lbmVyZ3ktdXMtZm9zc2lsLWZ1ZWxzLmh0bWzSAQA?oc=5\" target=\"_blank\">The Clean Energy Future Is Arriving Faster Than You Think<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New York Times<\/font>","source.href":"https:\/\/www.nytimes.com","source.title":"The New York Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The Energy Transition Delivery vans in Pittsburgh. Buses in Milwaukee. Cranes loading freight at the Port of Los Angeles. Every municipal building in Houston. All are powered by electricity derived from the sun, wind or other sources of clean energy. Across the country, a profound shift is taking place that is nearly invisible to most Americans. The nation that burned coal, oil and gas for more than a century to become the richest economy on the planet, as well as historically the most polluting, is rapidly shifting away from fossil fuels. A similar energy transition is already well underway in Europe and elsewhere. But the United States is catching up, and globally, change is happening at a pace that is surprising even the experts who track it closely. Wind and solar power are breaking records, and renewables are now expected to overtake coal by 2025 as the world’s largest source of electricity. Automakers have made electric vehicles central to their business strategies and are openly talking about an expiration date on the internal combustion engine. Heating, cooling, cooking and some manufacturing are going electric. As the planet registers the highest temperatures on record, rising in some places to levels incompatible with human life, governments around the world are pouring trillions of dollars into clean energy to cut the carbon pollution that is broiling the planet. 1 2 3 4 A big shift in the way America produces energy is already underway. Continue scrolling The cost of generating electricity from the sun and wind is falling fast and in many areas is now cheaper than gas, oil or coal. Private investment is flooding into companies that are jockeying for advantage in emerging green industries. “We look at energy data on a daily basis, and it’s astonishing what’s happening,” said Fatih Birol, the executive director of the International Energy Agency. “Clean energy is moving faster than many people think, and it’s become turbocharged lately.” More than $1.7 trillion worldwide is expected to be invested in technologies such as wind, solar power, electric vehicles and batteries globally this year, according to the I.E.A., compared with just over $1 trillion in fossil fuels. That is by far the most ever spent on clean energy in a year. Those investments are driving explosive growth. China, which already leads the world in the sheer amount of electricity produced by wind and solar power, is expected to double its capacity by 2025, five years ahead of schedule. In Britain, roughly one-third of electricity is generated by wind, solar and hydropower. And in the United States, 23 percent of electricity is expected to come from renewable sources this year, up 10 percentage points from a decade ago. Solar and Wind Power Have Taken Off Electricity generation per year, in terawatt hours China 600 TWh 500 Solar Wind U.S. China 400 E.U. 300 U.S. 200 E.U. 100 India India 1990 2000 2010 2020 1990 2000 2010 2020 China 600 TWh Solar Wind 500 U.S. China 400 E.U. 300 U.S. 200 E.U. 100 India India 1990 2005 2022 1990 2005 2022 China 600 TWh 500 Solar Wind U.S. China 400 E.U. 300 U.S. 200 E.U. 100 India India 1990 2000 2010 2020 1990 2000 2010 2020 Source: The Energy Institute’s 2023 Statistical Review of World Energy Note: Data reflects generation within country borders. By The New York Times “The nature of these exponential curves sometimes causes us to underestimate how quickly changes occur once they reach these inflection points and begin accelerating,” said former Vice President Al Gore, who called attention to what he termed a “planetary crisis” 17 years ago in his film “An Inconvenient Truth.” “The trend is definitely in favor of more and more renewable energy and less fossil energy.” Even as the pace of change in the United States is surprising everyone from energy experts to automobile executives, fossil fuels still dominate energy production at home and abroad. Corporations are building new coal mines, oil rigs and gas pipelines. The government continues to award leases for drilling projects on public lands and in federal waters and still subsidizes the industries. After posting record profits last year, leading oil companies are backing away from recent promises to invest more heavily in renewable energy. The scale of change required to remake the systems that power the United States — all the infrastructure that needs to be removed, re-engineered and replaced — is mind-boggling. There are major challenges involved in adding large amounts of renewable energy to antiquated electric grids and mining enough minerals for clean technologies. Some politicians, including most Republicans, want the country to continue burning fossil fuels, even in the face of overwhelming scientific consensus that their use is endangering life on the planet. Dozens of conservative groups organized by the Heritage Foundation have created a policy playbook, should a Republican win the 2024 presidential election, that would reverse course on lowering emissions. It would shred regulations designed to curb greenhouse gases, dismantle nearly every federal clean energy program and boost the production of fossil fuels. And while energy systems are changing fast, so is the climate. It is far from certain whether the United States and other polluting countries will do what scientists say is required to avert catastrophe: stop adding greenhouse gases to the atmosphere by 2050. All of the investment so far has slowed the pace at which emissions are growing worldwide, but the amount of carbon dioxide pumped into the atmosphere is at record levels. And yet, from Beijing to London, Tokyo to Washington, Oslo to Dubai, the energy transition is undeniably racing ahead. Change is here, even in oil country. ‘Energy Is Energy’ As the workday begins in Tulsa, Okla., the assembly line at the electric school bus factory rattles to life. Crews fan out across the city to install solar panels on century-old Tudor homes. Teslas and Ford F-150 Lightnings pull up to charging stations powered in part by the country’s second-largest wind farm. And at the University of Tulsa’s School of Petroleum Engineering, faculty are working on ways to use hydrogen as a clean energy source. Tulsa, a former boomtown once known as the “Oil Capital of the World” where the minor league baseball team is the Drillers, is immersed in a new energy revolution. At the port, an Italian company, Enel, is building a $1 billion solar panel factory. The bus factory is operated by Navistar, one of the biggest commercial vehicle makers in the world. And the city’s main electric utility, Public Service Company of Oklahoma, now harvests more than 28 percent of its power from wind. 1 2 3 4 5 Even Tulsa, with its strong links to oil and gas, is embracing clean energy. Continue scrolling Clean energy entrepreneurs are flocking to Oklahoma, too. Francis Energy, a fast-growing maker of electric vehicle charging stations, is based in Tulsa. Canoo, an electric vehicle start-up, is building a 100,000-square-foot battery factory at a nearby industrial park and a manufacturing plant for its trucks in Oklahoma City, though there are questions about whether the company will have enough funding to realize its plans. And teams from Solar Power of Oklahoma are busy fastening photovoltaic panels to the roofs of homes and businesses around Tulsa. The city is embracing its shifting identity. “We have a tremendous sense of pride in our history,” said Dewey F. Bartlett Jr., the Republican former mayor of Tulsa who was an oil and gas executive but now helps recruit clean energy companies to the region. “But we also understand that energy is energy, whether it is generated by wind, steam or whatever it might be.” Around the country, clean energy is taking root in unlikely locales. Houston, home to more than 500 oil and gas companies, also has more than 130 solar- and wind-related companies. Some of the country’s largest wind and solar farms are in the Texas flatlands outside the city, and a huge wind farm has been proposed off the coast of Galveston. In Arkansas, a planned solar farm — the state’s biggest — is expected to help power a nearby U.S. Steel factory that is undergoing a $3 billion upgrade. When complete, the plant will use electric furnaces to mold scrap steel into new products. That will result in about 80 percent less greenhouse gases, the company says, and set the pace for an industry that has been a major polluter. About two-thirds of the new investment in clean energy is in Republican-controlled states, where policymakers have historically resisted renewables. But with each passing month, the politics seem to matter less than the economics. “We’re the reddest state in the country, and we’re an oil and gas state,” said J.W. Peters, president of Solar Power of Oklahoma. “So it took a lot of time to convince people that this wasn’t snake oil.” Mr. Peters was broke six years ago, with less than $400 in his checking account after his contracting business slowed down. Then he responded to a help-wanted ad looking for workers to install solar panels, which were becoming more popular in Tulsa. He now employs 61 workers and has $18 million in annual sales. “The environmental benefits are nice,” he said, “but most people are doing this for the financial opportunity.” ‘Something Very Dramatic’ Fifteen years ago, solar panels, wind turbines and battery-powered vehicles were widely viewed as niche technologies, too expensive and unreliable for mainstream use. But clean energy became cheap far faster than anyone expected. Since 2009, the cost of solar power has plunged by 83 percent, while the cost of producing wind power has fallen by more than half. The price of lithium-ion battery cells fell 97 percent over the past three decades. Today, solar and wind power are the least expensive new sources of electricity in many markets, generating 12 percent of global electricity and rising. This year, for the first time, global investors are expected to pour more money into solar power — some $380 billion — than into drilling for oil. The Cost of Renewable Energy Has Plummeted Cost of building and running new power plants, in dollars per megawatt hour $300 Others Solar Utility-scale wind Onshore $200 $180 Nuclear $117 Coal $100 $70 Gas $60 $50 2009 2023 2009 2023 2009 2023 Solar Utility-scale wind Onshore $200 $100 $60 $50 2009 2023 2009 2023 Others $180 Nuclear $117 Coal $70 Gas 2009 2023 $300 Others Solar Utility-scale wind Onshore $200 $180 Nuclear $117 Coal $100 $70 Gas $60 $50 2009 2023 2009 2023 2009 2023 Source: Lazard Notes: Charts reflect the mean levelized cost of energy, which captures the price of building and running new power plants but excludes other electrical system costs. Lazard did not release data for 2022. In 2023, costs rose because of supply-chain problems, inflation and other issues. By The New York Times The rapid drop in costs for solar energy, wind power and batteries can be traced to early government investment and steady improvements over time by hundreds of researchers, engineers and entrepreneurs around the world. “The world has produced nearly three billion solar panels at this point, and every one of those has been an opportunity for people to try to improve the process,” said Gregory Nemet, a solar power expert at the University of Wisconsin-Madison. “And all of those incremental improvements add up to something very dramatic.” An equally potent force, along with the technological advances, has been an influx of money — in particular, a gusher since 2020 of government subsidies. In the United States, President Biden signed a trio of laws during his first two years in office that allocated unprecedented funds for clean energy: A $1 trillion bipartisan infrastructure law provided money to enhance the power grid, buy electric buses for schools and build a national network of electric vehicle chargers. The bipartisan CHIPS and Science Act set aside billions of dollars for semiconductors vital to car manufacturing. And the Inflation Reduction Act, which marks its first anniversary on Aug. 16, is by far the most ambitious attempt to fight climate change in American history. 1 2 3 4 5 The United States is ramping up its capacity to produce electric vehicles, batteries, solar panels and wind turbines. Continue scrolling That landmark law provided tax breaks related to electric vehicles, heat pumps and energy efficiency upgrades, solar panel and wind turbine manufacturing and clean hydrogen production. The government is also investing in efforts to capture carbon emissions and store them before they can reach the atmosphere, as well as technology that can remove them directly from the air. Originally estimated to cost roughly $391 billion between 2022 and 2031, the tax breaks are proving so popular with manufacturers and consumers that estimates now put the cost as high as $1.2 trillion over the next decade. Combined, the three laws have prompted companies to announce at least $230 billion in manufacturing investments so far. In Georgia, a Korean solar manufacturer, Qcells, is building a $2.5 billion plant. In Nevada, Tesla is building a new $3.6 billion electric truck factory. And in Oklahoma, the Enel and Canoo facilities are primed to benefit from the Inflation Reduction Act, as is a new $4.4 billion battery factory being considered by Panasonic, the Japanese conglomerate. “There’s a lot of appetite to invest in the United States thanks to that law,” said Giovanni Bertolino, an executive at Enel, adding that the plant his company is building in Tulsa would not exist without the Inflation Reduction Act. Regulations are also hastening the energy transition. Mr. Biden has proposed tough new federal pollution limits on tailpipes and smokestacks, but several states are acting on their own. California, with market muscle that influences the entire auto industry, plans to halt sales of new gas-powered cars by 2035 and new diesel-powered trucks by 2036 — and a handful of states are following suit. In May, New York became the first state to ban gas hookups in most new buildings, requiring all-electric heating and cooking starting in 2026. Several cities, including New York and San Francisco, have similar prohibitions, although some Republican-controlled states have blocked their municipalities from banning gas. Heavy investment by the United States has spurred a spirited reaction from other wealthy nations. Countries that initially complained that the United States was unfairly subsidizing clean energy manufacturers have since engaged in a sort of friendly subsidy race. 1 2 3 Clean energy investments are generating thousands of new jobs. Continue scrolling Canada, South Korea and others have pushed for their companies to have better access to the American incentives, while offering similar subsidies to their domestic manufacturers. After Russia invaded Ukraine last year, the European Union moved to lessen its dependence on Russian oil and gas. In May, for the first time ever, wind and solar power in the E.U. generated more electricity than fossil fuels. And in China, which is currently both the world’s top polluter and the global leader for renewable power, the government continues to invest in every stage of clean energy production, from solar cells to batteries, wind turbines and more. Like the United States, China provides subsidies to buyers of electric vehicles. Last year it spent $546 billion on clean energy, far more than any other country in the world. With costs falling fast, manufacturing has picked up and installations of solar and wind projects have increased. The U.S. solar industry installed a record 6.1 gigawatts of capacity in the first quarter of 2023, a 47 percent increase over the same period last year. And those low costs have led many of the United States’ biggest corporations, such as Alphabet, Amazon and General Motors, to purchase large amounts of wind and solar power, because it burnishes their reputations and because it makes good economic sense. “We’re seeing the nonlinear change happen before us,” said Jon Creyts, chief executive of RMI, a nonprofit organization that promotes the energy transition. “And that’s important, because we’re facing a climate crisis right now.” ‘A National Phenomenon’ Steve Uerling’s Tulsa home is a model of energy efficiency. He replaced all his incandescent light bulbs with LEDs. He installed a heat pump and rooftop solar panels this year. And he drives a plug-in hybrid Ford Fusion and a Tesla Model 3. Mr. Uerling, a mechanical engineer, said he wanted to see renewable power take off in Oklahoma and was trying to do his part. But he was also driven by his wallet. “My fuel cost is equivalent to getting 200 miles a gallon on gasoline,” he said. “We charge at night, when we get a much cheaper rate on our electricity.” Electric Cars Are Gaining Momentum Electric models as percentage of total passenger vehicle sales 30% 25% 20% sales 15% 10% U.S. E.U. China 5% 2010 2016 2022 2010 2016 2022 2010 2016 2022 25% sales 20% 15% 10% U.S. E.U. China 5% 2010 2022 2010 2022 2010 2022 Source: International Energy Agency Note: Sales share of battery electric vehicles excludes plug-in hybrids. By The New York Times Millions of people around the country are making similar calculations. Electric vehicles are by far the fastest-growing segment of the auto industry, with record sales of 300,000 in the second quarter of 2023, a 48 percent increase from a year earlier. Teslas are now among the best-selling cars in the country, and Ford has expanded its production of the F-150 Lightning, the electric version of its popular pickup truck, after a surge of initial demand created a waiting list. Concerns among consumers about the availability of charging stations as well as the cost of some models have helped to cool sales somewhat, leading some automakers to slash prices. Still, federal tax credits of up to $7,500 have made the least expensive electric vehicles competitive with gas-powered cars. And about two dozen states offer additional tax credits, rebates or reduced fees, further pushing down their cost. Government action is also helping heavier vehicles go electric. Sales of electric school buses are soaring, largely because of $5 billion in federal grants that can cover 100 percent of the cost for low-income communities. The Postal Service plans to spend nearly $10 billion to purchase 66,000 electric mail trucks — roughly 30 percent of its fleet — over the next five years. 1 2 3 Electric vehicles sales are growing quickly, but consumers are still concerned about high upfront costs and charging availability. Continue scrolling In the private sector, Amazon has ordered 100,000 electric delivery trucks from Rivian. Tesla has an electric semitruck, as do several other manufacturers, including Peterbilt. Companies that provide charging stations are springing up to meet the demand. Francis Energy has more than 400 chargers across Oklahoma and is expanding nationwide. EVgo, which has one of the largest fast-charging networks in the United States, plans to more than double the 3,000 charging stalls it operates. “It is not a red-state, blue-state thing,” said Cathy Zoi, EVgo’s chief executive. “It is a national phenomenon.” In an unusual move, seven carmakers — BMW Group, General Motors, Honda, Hyundai, Kia, Mercedes-Benz Group and Stellantis — are spending $1 billion in a joint venture to build 30,000 charging ports on major highways and other locations in the United States and Canada. The shift is happening so quickly that some of America’s most iconic automakers are preparing for a world beyond gasoline-powered cars and trucks. General Motors, which has the largest market share of any carmaker in the United States, has committed to selling only zero-emissions vehicles by 2035. It’s a “once-in-a-generation inflection point” for the 114-year-old automaker, according to Mary Barra, G.M.’s chief executive. In an interview, Ms. Barra said her company began to consider an all-electric future in 2020. “We started to see this happening with the consumer research we did,” said Ms. Barra, who has subsequently bet billions on G.M.’s efforts to reorient its engineering, overhaul its manufacturing facilities and processes and build new battery plants. As the cost of batteries comes down, and the number of charging stations nationwide goes up, Ms. Barra expects exponential growth. “I think it’s going to be definitely an upward trajectory,” she said. “It’ll be a little bumpy, but bumpy growing.”","filter_flag":1}
{"title":"Clean Energy Skills Workshops | TRC - TRC Companies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LnRyY2NvbXBhbmllcy5jb20vaW5zaWdodHMvY2xlYW4tZW5lcmd5LXNraWxscy13b3Jrc2hvcHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LnRyY2NvbXBhbmllcy5jb20vaW5zaWdodHMvY2xlYW4tZW5lcmd5LXNraWxscy13b3Jrc2hvcHMv0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3LnRyY2NvbXBhbmllcy5jb20vaW5zaWdodHMvY2xlYW4tZW5lcmd5LXNraWxscy13b3Jrc2hvcHMv0gEA","guidislink":false,"published":"Wed, 16 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LnRyY2NvbXBhbmllcy5jb20vaW5zaWdodHMvY2xlYW4tZW5lcmd5LXNraWxscy13b3Jrc2hvcHMv0gEA?oc=5\" target=\"_blank\">Clean Energy Skills Workshops | TRC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TRC Companies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Clean Energy Skills Workshops | TRC - TRC Companies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LnRyY2NvbXBhbmllcy5jb20vaW5zaWdodHMvY2xlYW4tZW5lcmd5LXNraWxscy13b3Jrc2hvcHMv0gEA?oc=5\" target=\"_blank\">Clean Energy Skills Workshops | TRC<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TRC Companies<\/font>","source.href":"https:\/\/www.trccompanies.com","source.title":"TRC Companies","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Partnering With Local High Schools to Recruit the Next Generation of Clean Energy Workers TRC and our clients are partnering with local high schools to introduce students to career options in the clean energy industry. Our workshops give students the foundations of building science, teach networking skills, and create mentorship connections with industry professionals – with the goal of recruiting new talent and bringing greater diversity to the clean energy industry workforce. The Growing Need for a Clean Energy Workforce The clean energy industry is a growing economy in need of skilled workers. With the passage of the Inflation Reduction Act, the pace of growth has increased, and millions of clean energy jobs will be created over the next decade. Our industry needs an expansive workforce to carry out this long-term transition from fossil-fuel based systems to efficient, renewable, and decarbonized energy systems. A diverse workforce will make this energy transformation not only more equitable, but more successful and far-reaching. Diverse perspectives generate more effective and innovative solutions that meet the needs of a more diverse set of communities and customers. But barriers exist for recruiting underrepresented communities in the clean energy field, including lack of awareness of available career options and limited opportunities for education and training. Recruiting Early: High School Training Workshops TRC and our clients are working to expand the clean energy workforce by spreading the word to potential future employees at a young age: we’re partnering with local high schools and offering Clean Energy Skills Workshops to students in communities where we work. These workshops have a threefold purpose: 1) educate students on prospective clean energy careers; 2) provide building science and business education to students from different disciplines; and 3) teach networking skills and create opportunities for mentorship with professionals within our industry. By offering these classes to students with both science, technology, engineering, and mathematics (STEM) concentrations and non-STEM interests, we hope to engage a wide range of potential future workers in our industry. And by offering skills training in energy and non-energy subjects, including engineering, business operations, marketing, contracting, and general networking skills, we’re helping students visualize themselves in the many important roles that support the clean energy industry. Clean Energy Workshops in Action: Brooklyn and Los Angeles TRC and our partners recently offered clean energy workshops to students at high schools in Brooklyn, NY and Los Angeles, CA. At Brooklyn’s High School for Enterprise, Business, and Technology, TRC employees presented a four-day workshop on clean energy skill-building, including educational sessions on renewable energy, energy auditing, data analysis, marketing, and job-seeking skills. This hands-on workshop for 11th and 12th graders created rapport between students and guest teachers and concluded with a networking session where clean energy professionals from Brooklyn spoke about their personal journeys. As part of the workshop, TRC coordinated a field trip for Solar One, a New York City-based community solar organization, to teach students about careers in the solar industry and provide hands-on experience with a renewable energy technology installation in the field. For the networking portion of the workshop, local energy experts from Trane, Agarabi Engineering, and United Energy Advisors gave insights on entrepreneurship and career opportunities in the energy contracting field.","filter_flag":1}
{"title":"New products, packaging help minimize exam glove waste - Medline Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vbmV3c3Jvb20ubWVkbGluZS5jb20vc29jaWFsLXJlc3BvbnNpYmlsaXR5L25ldy1wcm9kdWN0cy1wYWNrYWdpbmctaGVscC1taW5pbWl6ZS1leGFtLWdsb3ZlLXdhc3RlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vbmV3c3Jvb20ubWVkbGluZS5jb20vc29jaWFsLXJlc3BvbnNpYmlsaXR5L25ldy1wcm9kdWN0cy1wYWNrYWdpbmctaGVscC1taW5pbWl6ZS1leGFtLWdsb3ZlLXdhc3RlL9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vbmV3c3Jvb20ubWVkbGluZS5jb20vc29jaWFsLXJlc3BvbnNpYmlsaXR5L25ldy1wcm9kdWN0cy1wYWNrYWdpbmctaGVscC1taW5pbWl6ZS1leGFtLWdsb3ZlLXdhc3RlL9IBAA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vbmV3c3Jvb20ubWVkbGluZS5jb20vc29jaWFsLXJlc3BvbnNpYmlsaXR5L25ldy1wcm9kdWN0cy1wYWNrYWdpbmctaGVscC1taW5pbWl6ZS1leGFtLWdsb3ZlLXdhc3RlL9IBAA?oc=5\" target=\"_blank\">New products, packaging help minimize exam glove waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medline Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New products, packaging help minimize exam glove waste - Medline Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vbmV3c3Jvb20ubWVkbGluZS5jb20vc29jaWFsLXJlc3BvbnNpYmlsaXR5L25ldy1wcm9kdWN0cy1wYWNrYWdpbmctaGVscC1taW5pbWl6ZS1leGFtLWdsb3ZlLXdhc3RlL9IBAA?oc=5\" target=\"_blank\">New products, packaging help minimize exam glove waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medline Newsroom<\/font>","source.href":"https:\/\/newsroom.medline.com","source.title":"Medline Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"As single-use disposable gloves help prevent the spread of germs and infections, they’re a necessity in healthcare settings across the continuum of care. They also contribute significantly to medical waste, with an estimated 65 billion gloves used globally each month. In busy healthcare settings, gloves become unusable when they are pulled too quickly from the box and fall to the floor, or when they rip or tear during donning and doffing. Used gloves also end up in the landfill. To help minimize glove waste and lower healthcare provider supply costs, Medline recently launched two new products—a patented box that maximizes glove utilization, and a new glove that minimizes rips and tears during donning and doffing. Medline’s Gloves Waste to Energy program also transforms used, non-hazardous gloves into energy. “Exam gloves are essential personal protective equipment and Medline is committed to optimizing their use,” said Jim Burgess, Medline Director of Sustainability. “Reducing glove waste helps the healthcare provider’s bottom line and the environment.” SmartBoX™ To minimize lost product when gloves are pulled from the box, Medline’s innovative glove packaging—the SmartBoX— includes a proprietary insert that propels gloves toward the box opening. The patent-pending design keeps gloves at the top, making it easier to pull a single glove out every time, maximizing glove utilization and decreasing glove waste by 33%.1","filter_flag":1}
{"title":"Stellantis Invests in CTR to Strengthen Low Emissions U.S. Lithium Production - Stellantis","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5zdGVsbGFudGlzLmNvbS9lbi9uZXdzL3ByZXNzLXJlbGVhc2VzLzIwMjMvYXVndXN0L3N0ZWxsYW50aXMtaW52ZXN0cy1pbi1jdHItdG8tc3RyZW5ndGhlbi1sb3ctZW1pc3Npb24tdXMtbGl0aGl1bS1wcm9kdWN0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5zdGVsbGFudGlzLmNvbS9lbi9uZXdzL3ByZXNzLXJlbGVhc2VzLzIwMjMvYXVndXN0L3N0ZWxsYW50aXMtaW52ZXN0cy1pbi1jdHItdG8tc3RyZW5ndGhlbi1sb3ctZW1pc3Npb24tdXMtbGl0aGl1bS1wcm9kdWN0aW9u0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5zdGVsbGFudGlzLmNvbS9lbi9uZXdzL3ByZXNzLXJlbGVhc2VzLzIwMjMvYXVndXN0L3N0ZWxsYW50aXMtaW52ZXN0cy1pbi1jdHItdG8tc3RyZW5ndGhlbi1sb3ctZW1pc3Npb24tdXMtbGl0aGl1bS1wcm9kdWN0aW9u0gEA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5zdGVsbGFudGlzLmNvbS9lbi9uZXdzL3ByZXNzLXJlbGVhc2VzLzIwMjMvYXVndXN0L3N0ZWxsYW50aXMtaW52ZXN0cy1pbi1jdHItdG8tc3RyZW5ndGhlbi1sb3ctZW1pc3Npb24tdXMtbGl0aGl1bS1wcm9kdWN0aW9u0gEA?oc=5\" target=\"_blank\">Stellantis Invests in CTR to Strengthen Low Emissions U.S. Lithium Production<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stellantis<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Stellantis Invests in CTR to Strengthen Low Emissions U.S. Lithium Production - Stellantis","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5zdGVsbGFudGlzLmNvbS9lbi9uZXdzL3ByZXNzLXJlbGVhc2VzLzIwMjMvYXVndXN0L3N0ZWxsYW50aXMtaW52ZXN0cy1pbi1jdHItdG8tc3RyZW5ndGhlbi1sb3ctZW1pc3Npb24tdXMtbGl0aGl1bS1wcm9kdWN0aW9u0gEA?oc=5\" target=\"_blank\">Stellantis Invests in CTR to Strengthen Low Emissions U.S. Lithium Production<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stellantis<\/font>","source.href":"https:\/\/www.stellantis.com","source.title":"Stellantis","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Stellantis invests over $100 million to advance the development of geothermal lithium project in California and encourage decarbonization of battery electric vehicle supply chains New agreement includes a supply increase from the initial plan of 25,000 metric tons to up to 65,000 metric tons per year of battery-grade lithium hydroxide monohydrate CTR’s integrated production process employs modular engineering design for efficient scale-up, minimizing environmental impacts and carbon emissions Sustainable lithium hydroxide supply will support Stellantis’ U.S. product offensive and Dare Forward 2030 plan of having more than 25 all-new battery electric vehicle (BEV) launches and 50% BEV sales by 2030 AMSTERDAM – Stellantis N.V. and Controlled Thermal Resources Holdings Inc. (CTR) today announced a major investment of over $100 million from Stellantis to advance the development of CTR’s Hell’s Kitchen project, the world’s largest geothermal lithium project with a total resource capacity to produce up to 300,000 metric tons of lithium carbonate equivalent each year. Lithium produced at Hell’s Kitchen will support Stellantis vehicles’ BEV eligibility for consumer incentives under the U.S. Inflation Reduction Act (IRA). Additionally, the companies expanded the initial supply agreement, which now calls for CTR to supply up to 65,000 metric tons of battery-grade lithium hydroxide monohydrate (LHM) each year over a 10-year contract term. This new agreement incorporates the original lithium supply agreement signed by both companies in June 2022 for up to 25,000 metric tons of LHM per year. CTR’s Hell’s Kitchen project in California’s Imperial County will recover lithium from geothermal brines using renewable energy and steam to produce truly “green” battery-grade lithium products in a fully integrated process. This eliminates the need for evaporation brine ponds, open pit mines and fossil-fueled lithium processing. “The foundation of our industry-leading decarbonization drive includes low-emissions production and sustainable supply as the building blocks for our electric vehicles,” Stellantis CEO Carlos Tavares said. “The latest agreement with CTR is an important step in our care for our customers and our planet as we work to provide clean, safe and affordable mobility in North America.” As part of the Dare Forward 2030 strategic plan, Stellantis announced plans of reaching a 100% passenger car BEV sales mix in Europe and 50% passenger car and light-duty truck BEV sales mix in the United States by 2030. To achieve these sales targets, the Company is securing approximately 400 GWh of battery capacity, supported by six battery manufacturing plants in North America and Europe. Stellantis is on track to become a carbon net zero corporation by 2038, all scopes included, with single-digit percentage compensation of remaining emissions. “This substantial investment in CTR by Stellantis marks an outstanding milestone for our company and further solidifies our efforts to support sustainable electric vehicle battery production,” CTR Chief Executive Officer Rod Colwell said. “With electric vehicle adoption growing rapidly in the U.S. and throughout the world, it has never been more important to ensure battery materials are sourced and produced responsibly. Through localizing the battery supply chain, we can minimize supply chain risk and create thousands of jobs in a disadvantaged community. We applaud the leadership of Stellantis and look forward to working together to set new industry benchmarks for reliability, efficiency, and sustainability.” CTR is scheduled to commence battery-grade lithium hydroxide monohydrate supply for Stellantis in 2027. The company expects to create 480 construction jobs through comprehensive project labor agreements and upward of 940 direct project jobs when the resource is fully developed. About Stellantis Stellantis N.V. (NYSE: STLA \/ Euronext Milan: STLAM \/ Euronext Paris: STLAP) is one of the world’s leading automakers and a mobility provider. Its storied and iconic brands embody the passion of their visionary founders and today’s customers in their innovative products and services, including Abarth, Alfa Romeo, Chrysler, Citroën, Dodge, DS Automobiles, Fiat, Jeep®, Lancia, Maserati, Opel, Peugeot, Ram, Vauxhall, Free2move and Leasys. Powered by our diversity, we lead the way the world moves – aspiring to become the greatest sustainable mobility tech company, not the biggest, while creating added value for all stakeholders as well as the communities in which it operates. For more information, visit www.stellantis.com. About CTR Through its project companies, Controlled Thermal Resources Holdings Inc. (CTR) specializes in critical minerals, battery-grade lithium chemicals, and renewable energy production with projects in advanced development in the United States. CTR’s leadership team has successfully developed and managed geothermal operations in California’s Salton Sea region for 30+ years. This highly specialized, location-specific knowledge has been instrumental in advancing CTR’s projects. Construction is expected to commence on Hell’s Kitchen - Stage 1 in late 2023. CTR is committed to delivering sustainable, low-cost lithium products and renewable power to support clean energy initiatives and to ensure a domestic, socially responsible lithium product supply chain in the United States. For more information, visit www.cthermal.com.","filter_flag":1}
{"title":"Kenya's Solar Industry, Discussing Its Challenges And Opportunities. With Over 80% Reliance On Renewable Energy ... - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi5gFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wOC8wMy9rZW55YXMtc29sYXItaW5kdXN0cnktZGlzY3Vzc2luZy1pdHMtY2hhbGxlbmdlcy1hbmQtb3Bwb3J0dW5pdGllcy13aXRoLW92ZXItODAtcmVsaWFuY2Utb24tcmVuZXdhYmxlLWVuZXJneS1mb3ItdGhlLW5hdGlvbmFsLWdyaWQta2VueWEtZGVtb25zdHJhdGVzLWEtc3Ryb25nLWNvbW1pdG1lbnQtdG8tcmVuZXdhYmxlcy1kYXZpZC1rYXJpL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi5gFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wOC8wMy9rZW55YXMtc29sYXItaW5kdXN0cnktZGlzY3Vzc2luZy1pdHMtY2hhbGxlbmdlcy1hbmQtb3Bwb3J0dW5pdGllcy13aXRoLW92ZXItODAtcmVsaWFuY2Utb24tcmVuZXdhYmxlLWVuZXJneS1mb3ItdGhlLW5hdGlvbmFsLWdyaWQta2VueWEtZGVtb25zdHJhdGVzLWEtc3Ryb25nLWNvbW1pdG1lbnQtdG8tcmVuZXdhYmxlcy1kYXZpZC1rYXJpL9IBAA?oc=5","id":"CBMi5gFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wOC8wMy9rZW55YXMtc29sYXItaW5kdXN0cnktZGlzY3Vzc2luZy1pdHMtY2hhbGxlbmdlcy1hbmQtb3Bwb3J0dW5pdGllcy13aXRoLW92ZXItODAtcmVsaWFuY2Utb24tcmVuZXdhYmxlLWVuZXJneS1mb3ItdGhlLW5hdGlvbmFsLWdyaWQta2VueWEtZGVtb25zdHJhdGVzLWEtc3Ryb25nLWNvbW1pdG1lbnQtdG8tcmVuZXdhYmxlcy1kYXZpZC1rYXJpL9IBAA","guidislink":false,"published":"Thu, 03 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=215, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi5gFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wOC8wMy9rZW55YXMtc29sYXItaW5kdXN0cnktZGlzY3Vzc2luZy1pdHMtY2hhbGxlbmdlcy1hbmQtb3Bwb3J0dW5pdGllcy13aXRoLW92ZXItODAtcmVsaWFuY2Utb24tcmVuZXdhYmxlLWVuZXJneS1mb3ItdGhlLW5hdGlvbmFsLWdyaWQta2VueWEtZGVtb25zdHJhdGVzLWEtc3Ryb25nLWNvbW1pdG1lbnQtdG8tcmVuZXdhYmxlcy1kYXZpZC1rYXJpL9IBAA?oc=5\" target=\"_blank\">Kenya's Solar Industry, Discussing Its Challenges And Opportunities. With Over 80% Reliance On Renewable Energy ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kenya's Solar Industry, Discussing Its Challenges And Opportunities. With Over 80% Reliance On Renewable Energy ... - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi5gFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8wOC8wMy9rZW55YXMtc29sYXItaW5kdXN0cnktZGlzY3Vzc2luZy1pdHMtY2hhbGxlbmdlcy1hbmQtb3Bwb3J0dW5pdGllcy13aXRoLW92ZXItODAtcmVsaWFuY2Utb24tcmVuZXdhYmxlLWVuZXJneS1mb3ItdGhlLW5hdGlvbmFsLWdyaWQta2VueWEtZGVtb25zdHJhdGVzLWEtc3Ryb25nLWNvbW1pdG1lbnQtdG8tcmVuZXdhYmxlcy1kYXZpZC1rYXJpL9IBAA?oc=5\" target=\"_blank\">Kenya's Solar Industry, Discussing Its Challenges And Opportunities. With Over 80% Reliance On Renewable Energy ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Can you highlight some of the unique challenges and opportunities you’ve encountered while operating in Kenya’s Solar Industry? with over 80% of the national grid being renewable, the renewable energy awareness across the country is relatively high, making rolling out renewable products easier in the Kenyan market. The high cost of National grid power also has pushed people to alternative sources and solar energy has come up on the top being for solar water heating, borehole pumping, backup solutions, hybrid and off-grid solutions. Some of the difficulties experienced include shifting government policies that have been unstable making the market unpredictable, low quality products especially decommissioned and dumped products especially from western markets, marketed as new products affecting efficiency and life span, which affects the market confidence and transfers the solar waste to the country How does your company engage with local communities in Kenya to ensure that the benefits of solar technology reach those who need it the most? A few government initiatives have had positive effects on the uptake of solar solutions in the country; -The government’s drive to 100% green power on the National grid by 2030 has helped in creating awareness across the country. Without awareness, the conversion would remain a greater issue. -Tax incentives including exemption on importation of some components unavailable locally -Legislative initiative requiring installation of solar water heaters for houses with more than 2 bedrooms, This has caused investors to add solar water heating in the construction budget as one of the requirements by buyers. Through these initiatives, new homeowners are buying houses already with solar installed further easing uptake. In your experience, what role do you see the Kenyan people playing in driving the adoption of solar technology? Are there any notable success stories or examples of community involvement? -Kenyan People\/the market has started demanding quality products with enforceable warranties. There is a market pull for quality with the middle and high-end market becoming less price sensitive and more quality driven. This pull will eliminate naturally the poor quality products in the market making solar more reliable -Nearly all manufacturers in the country (big power consumers) have adopted hybrid solar systems that enable them to lower their power bills by more than half. This lowers their cost of production and the many staff members who are working in the companies get to appreciate that the systems do work. Where we have installed solutions in companies and institutions, we have noted a spike in demand from the staff members for their homes within the first 2 years of commissioning. -Solar mini-grids have been developed on community levels to supply power to a village through their mostly through their elected representatives. Can you share any innovative technological solutions or advancements your company has implemented to overcome specific challenges in the Kenyan market? High initial capital outlay. This remains as the biggest hindrance to the adoption of solar solutions. to overcome this, Metrocart undertakes a thorough evaluation of the energy needs, starts by recommending saving actions like retrofitting of lower power consumers’ bulbs, compressors etc. With this, the client can save on running costs even before the adoption of solar, we then work with the client’s available funds and offer a modular system that can be grown over a period of time through savings generated. We also work with financiers to enable the clients to install the complete system for maximum savings without initial capital outlay, buy the power from us at a rate lower than what they would get from the National grid, and hand over the systems within the first quarter of the system life (build operate transfer model) Through years of market engagement, we have learnt what components works best in our market and as such are able to have different reliable components from different suppliers making up one solution to a client and this has earned us a market reputation of reliable solutions. How do you navigate the regulatory landscape in Kenya, and what measures do you take to ensure compliance with local policies and regulations? These local regulations start at sourcing, we ensure we source products that meets the quality and employ the services of a globally reputable organization for clearing and forwarding, outsourcing the work on tax compliance on this stage to those who specialize in it. All our technicians are locally accredited by EPRA( Energy and Petroleum Regulatory Authority), the regulating body and are re-assessed bi-annually for conformity. We also have metrocart ltd, accredited and reporting all sites installed to EPRA and inviting them in to have random checks to ensure conformity. Like this: Like Loading...","filter_flag":1}
{"title":"Observing the Megatrends of New Zealand's Green Economy | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA","guidislink":false,"published":"Mon, 07 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=219, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5\" target=\"_blank\">Observing the Megatrends of New Zealand's Green Economy | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Observing the Megatrends of New Zealand's Green Economy | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5\" target=\"_blank\">Observing the Megatrends of New Zealand's Green Economy | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"To realise these economic opportunities, while preserving and enhancing New Zealand’s natural environment and mitigating the impact of climate change, BCG has explored five fast- growing opportunities for New Zealand’s green economy: Eco-tourism: Delivering tourism through more environmentally sustainable travel, business practices, and tourism experiences. Sustainable construction: Developing more sustainable homes, buildings, and infrastructure, including leveraging the country’s strong position in biogenic building materials. Low carbon energy system: Capitalising on New Zealand’s highly renewable electricity system to attract low-carbon industry and enable the net zero transition through electrification of transport, heat, and industrial processes. Sustainable food production: Producing world-leading natural and sustainable food through premium product development, aggressive investment in R&D to reduce agricultural emissions, and adoption of best practice technologies to improve productivity. Green consumer products: Developing premium retail products with lower environmental impact, transparent supply chains enabled by digitisation, and clear sustainability metrics to attract a growing segment of customers that value sustainability. 1. Eco-tourism Tourism is a vital part of New Zealand’s economy. Domestic tourism expenditure has remained relatively stable at $25 billion per year from pre-COVID levels to current levels in the year ended March 2023. 1 1 Stats NZ, 2023, Tourism satellite account: Year ended March 2023 Notes: 1 Stats NZ, 2023, Tourism satellite account: Year ended March 2023 However, international tourism expenditure declined by ~90% during COVID from NZD$18 billion per year pre-COVID to NZD$2 billion in the year ended March 2022. As a result, tourism fell from ~20% of New Zealand’s exports to just 2%. The most recent data is brighter international tourism levels in March 2023 were ~20% below pre-COVID levels. As New Zealand emerges from the pandemic, eco-tourism is an opportunity to reinvigorate the tourism sector and the 100% Pure New Zealand brand. According to Tourism New Zealand data, people actively considering travel to New Zealand score the country highly on its pristine landscapes and scenery, and connection to the land relative to other destinations. 2 2 Tourism New Zealand, 2023, Active Considerer reports Notes: 2 Tourism New Zealand, 2023, Active Considerer reports Two global trends are changing the nature of tourism Rise in eco-tourism: Consumer awareness of the environmental footprint of their travel is on the rise, with 81% of travellers stating that sustainable travel is important. 3 3 Corporate Traveller, 2022, Sustainability in Travel: How to Make a Positive Impact Notes: 3 Corporate Traveller, 2022, Sustainability in Travel: How to Make a Positive Impact 36% of travellers stated they would be willing to pay up to 10% more for air travel with a lower carbon footprint. 4 4 Statista, 2020, Willingness to pay more for a flight with smaller environmental impact Notes: 4 Statista, 2020, Willingness to pay more for a flight with smaller environmental impact Demand for premium travel: Consumers are looking for more premium travel experiences. The average spend per traveller in New Zealand grew by 18% in the last three years. 5 5 Tourism New Zealand, 2023, Tourism data Notes: 5 Tourism New Zealand, 2023, Tourism data Many travellers that are seeking premium tourism experiences also want these experiences to be environmentally sustainable. The global eco-tourism industry is forecast to grow to NZD$700 billion by 2030, 6 6 imarc Group, 2022, “Ecotourism Market: Global Industry Trends, Share, Size, Growth, Opportunity and Forecast” Notes: 6 imarc Group, 2022, “Ecotourism Market: Global Industry Trends, Share, Size, Growth, Opportunity and Forecast” at 14% per year. New Zealand is well placed to build a more prosperous and sustainable eco- tourism industry that meets these changing consumer needs. New Zealand can harness the rise in eco-tourism Support sustainable air travel for international visitors to New Zealand: For most international travellers, New Zealand is a remote destination which is a potential threat to the tourism industry as concerns over the carbon footprint of air miles rise. In the future, potential visitors to New Zealand may choose a destination closer to home if air travel to the country is not sustainable. Anticipating this changing consumer preference, Air New Zealand has committed to at least 10% sustainable aviation fuel by 2030 and has set a target for net zero emissions by 2050. 7 7 Air New Zealand, Flight NZ0™ Notes: 7 Air New Zealand, Flight NZ0™ Policy support for decarbonising international travel to New Zealand is likely to be required to protect New Zealand’s tourism industry over the longer term. Drive low environmental footprint tourism within New Zealand: While improving sustainable travel to New Zealand is vital, it is also important to ensure tourism within the country becomes more sustainable. Low-emissions domestic transport options include e-bike rentals, electric hire car hires, electric buses, electric trains, and sustainable domestic flights. Sustainable accommodation and environmentally friendly tourist experiences are also important. A number of initiatives are underway, such as Waka Kotahi, New Zealand’s leading transport agency, facilitating a nationwide network of fast charging stations for electric vehicles every 75 km along state highways. 8 8 NZ Transport Agency, 2022, National guidance for public electric vehicle charging infrastructure Notes: 8 NZ Transport Agency, 2022, National guidance for public electric vehicle charging infrastructure Additionally, the tourism industry’s 12 Tourism Sustainability Commitments, including nature restoration and waste elimination, have been signed by over 1,800 businesses across New Zealand. 9 9 Tourism Industry Aotearoa, 2023, Tourism Sustainability Commitments Directory Notes: 9 Tourism Industry Aotearoa, 2023, Tourism Sustainability Commitments Directory Make the most of New Zealand’s natural environment: Natural attractions are one of the primary reasons tourists visit New Zealand, and while consumers are becoming more environmentally conscious, they are also looking for more premium eco-tourism services and experiences – and they are willing to pay more for them. International visitors to New Zealand are generally enchanted by its natural beauty, and there is an opportunity to consider how this can be further leveraged to reinvigorate the tourism industry. 2. Sustainable Construction Construction is a major part of New Zealand’s economy, contributing NZD$21 billion (7% of GDP) in 2019 and employing 275,000 workers (10% of the workforce). 10 10 Construction Sector Accord NZ, 2021, Construction Sector Accord Progress Report Notes: 10 Construction Sector Accord NZ, 2021, Construction Sector Accord Progress Report Adoption of sustainable construction materials in New Zealand will result in an increasingly low-carbon built environment. New Zealand already has a unique advantage in this area due to its leading position in biogenic building materials. The environmental impact of residential housing in New Zealand is 16 kg CO 2 eq\/m2\/year, roughly one-third of the international median of 50 kg CO 2 eq\/m2\/year, predominantly driven by the use of more wooden materials in New Zealand. 11 11 Buildings, Dani et al., 2022, “A Comparative Study on the Life Cycle Assessment of New Zealand Residential Buildings”, p.3 Notes: 11 Buildings, Dani et al., 2022, “A Comparative Study on the Life Cycle Assessment of New Zealand Residential Buildings”, p.3","filter_flag":1}
{"title":"Brown-Forman and Ylem Energy develop solar array for Scottish distillery - FoodBev.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZvb2RiZXYuY29tL25ld3MvYnJvd24tZm9ybWFuLWFuZC15bGVtLWVuZXJneS1kZXZlbG9wLXNvbGFyLWFycmF5LWZvci1zY290dGlzaC1kaXN0aWxsZXJ5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZvb2RiZXYuY29tL25ld3MvYnJvd24tZm9ybWFuLWFuZC15bGVtLWVuZXJneS1kZXZlbG9wLXNvbGFyLWFycmF5LWZvci1zY290dGlzaC1kaXN0aWxsZXJ5L9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmZvb2RiZXYuY29tL25ld3MvYnJvd24tZm9ybWFuLWFuZC15bGVtLWVuZXJneS1kZXZlbG9wLXNvbGFyLWFycmF5LWZvci1zY290dGlzaC1kaXN0aWxsZXJ5L9IBAA","guidislink":false,"published":"Wed, 23 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=235, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZvb2RiZXYuY29tL25ld3MvYnJvd24tZm9ybWFuLWFuZC15bGVtLWVuZXJneS1kZXZlbG9wLXNvbGFyLWFycmF5LWZvci1zY290dGlzaC1kaXN0aWxsZXJ5L9IBAA?oc=5\" target=\"_blank\">Brown-Forman and Ylem Energy develop solar array for Scottish distillery<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodBev.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Brown-Forman and Ylem Energy develop solar array for Scottish distillery - FoodBev.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmZvb2RiZXYuY29tL25ld3MvYnJvd24tZm9ybWFuLWFuZC15bGVtLWVuZXJneS1kZXZlbG9wLXNvbGFyLWFycmF5LWZvci1zY290dGlzaC1kaXN0aWxsZXJ5L9IBAA?oc=5\" target=\"_blank\">Brown-Forman and Ylem Energy develop solar array for Scottish distillery<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodBev.com<\/font>","source.href":"https:\/\/www.foodbev.com","source.title":"FoodBev.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Ylem Energy has partnered with Brown-Forman to develop a 630kW solar array that delivers 516,000 KWp of clean, renewable energy yearly, at the producer's Benriach Bond facility in Edinburgh, Scotland. The partnership will progress the producer of brands such as Jack Daniel’s Tennessee Whiskey and Benriach Scotch Whisky towards its mission of sourcing 100% of its electricity from renewable sources by 2030. The UK-based distillery is said to be committed to the Scotch Whisky Association’s 'Race to Zero' pledge to achieve net zero emissions by 2040. Ylem Energy’s installation is expected to offset around 120 tonnes of CO2 each year. Ylem Energy’s ‘Xchange’ product will allow Brown-Forman to export excess renewable energy generated at its Benriach Bond facility to the National Grid and reduce its onsite energy costs. Andy Battjes, director, global environmental sustainability at Brown-Forman, stated: “As a member of RE100, Brown-Forman is committed to supporting the development of new sources of renewable electricity in order to reach our goal of 100% renewable electricity by 2030. Our partnership with Ylem to install a new rooftop solar system at our Newbridge bottling facility is the latest example of turning our commitment into action.” Ian Gadsby, managing director of Ylem Energy, said: “We’re delighted to be working with Brown-Forman to help them achieve their sustainability goals and play a role in tackling climate change”. He added: “The recent energy crisis has seen many businesses diversify their energy supply while ensuring it comes from renewable sources. As part of Ylem’s Xchange product, Brown-Forman can be confident they will be using renewable energy while reducing their energy bills by exporting any excess generation to the National Grid.” The solar array at Benriach Bond is the first project to take place between Ylem Energy and Brown-Forman.","filter_flag":1}
{"title":"From Shirts to Insulators: Recycled Honda Uniforms Find New Utility in Vehicles - Honda Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtNTAwM2FhYTM5YzAwOTM5M2Y1ZDA2ZDYyMGYwN2Q0MDEtZnJvbS1zaGlydHMtdG8taW5zdWxhdG9ycy1yZWN5Y2xlZC1ob25kYS11bmlmb3Jtcy1maW5kLW5ldy11dGlsaXR5LWluLXZlaGljbGVz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtNTAwM2FhYTM5YzAwOTM5M2Y1ZDA2ZDYyMGYwN2Q0MDEtZnJvbS1zaGlydHMtdG8taW5zdWxhdG9ycy1yZWN5Y2xlZC1ob25kYS11bmlmb3Jtcy1maW5kLW5ldy11dGlsaXR5LWluLXZlaGljbGVz0gEA?oc=5","id":"CBMirAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtNTAwM2FhYTM5YzAwOTM5M2Y1ZDA2ZDYyMGYwN2Q0MDEtZnJvbS1zaGlydHMtdG8taW5zdWxhdG9ycy1yZWN5Y2xlZC1ob25kYS11bmlmb3Jtcy1maW5kLW5ldy11dGlsaXR5LWluLXZlaGljbGVz0gEA","guidislink":false,"published":"Thu, 10 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=222, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtNTAwM2FhYTM5YzAwOTM5M2Y1ZDA2ZDYyMGYwN2Q0MDEtZnJvbS1zaGlydHMtdG8taW5zdWxhdG9ycy1yZWN5Y2xlZC1ob25kYS11bmlmb3Jtcy1maW5kLW5ldy11dGlsaXR5LWluLXZlaGljbGVz0gEA?oc=5\" target=\"_blank\">From Shirts to Insulators: Recycled Honda Uniforms Find New Utility in Vehicles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"From Shirts to Insulators: Recycled Honda Uniforms Find New Utility in Vehicles - Honda Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtNTAwM2FhYTM5YzAwOTM5M2Y1ZDA2ZDYyMGYwN2Q0MDEtZnJvbS1zaGlydHMtdG8taW5zdWxhdG9ycy1yZWN5Y2xlZC1ob25kYS11bmlmb3Jtcy1maW5kLW5ldy11dGlsaXR5LWluLXZlaGljbGVz0gEA?oc=5\" target=\"_blank\">From Shirts to Insulators: Recycled Honda Uniforms Find New Utility in Vehicles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","source.href":"https:\/\/hondanews.com","source.title":"Honda Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Recycled Honda uniforms are shredded into fibers and repurposed for insulation in new Honda and Acura automobiles Uniform recycling program reduces waste to landfill from Honda manufacturing and R&D facilities in Alabama, Indiana, North Carolina and Ohio Honda's \"Triple Action to Zero\" approach focuses on \"resource circulation\" to make new products from 100% sustainable materials by 2050 Honda associates put a lot into the products they make, now including the shirts right off their backs. Honda is advancing a recycling initiative that takes uniforms worn by associates at its U.S. manufacturing and R&D facilities and transforms them into sound-absorbing insulation for use in Honda and Acura automobiles. This program diverts approximately 45,000 pounds of uniforms from reaching landfills each month as Honda works toward its commitment to use 100% sustainable materials in its products in the future. Watch a video of the uniform recycling process at https:\/\/honda.us\/UniformRecycling. Honda has established a global \"Triple Action to Zero\" approach, with the goal of achieving carbon neutrality for all products and corporate activities, use of 100% clean energy and resource circulation (100% sustainable materials), by 2050. Achieving that goal – which targets zero environmental impact – will require innovative solutions, including how Honda sources materials for new products by recycling and reusing material from end-of-life vehicles and Honda operations. \"To achieve our Triple Zero goal of 100% sustainable material use, we need to take every possible opportunity to recycle materials at end of life for reuse in our products, thereby minimizing our utilization of virgin materials,\" said Negar Gilsinger, manager of Resource Circulation for American Honda Motor Co., Inc. \"By maximizing end-of-life material recycling, we are giving our uniforms a second life in Honda and Acura vehicles.\" The Honda uniform recycling program leverages cross-industry collaboration between Honda and its uniform suppliers Aramark and Cintas Corporation, as well as insulation supplier UGN Automotive and textile recycler Leigh Fibers. Uniforms from Honda production and R&D facilities in Alabama, Indiana, North Carolina and Ohio are recycled and reused in five different insulator parts on all nine Honda and four Acura models made in North America. In the future, Honda plans to expand the uniform recycling program to other facilities in North America. \"Collaborating with Honda suppliers in the uniform recycling program has brought great value to our supply chain sustainability efforts,\" said Rob Long, senior procurement specialist with Honda North American Indirect Procurement. \"As Honda works to advance sustainability, we appreciate our suppliers' efforts to innovate their business operations to reduce waste and give new life to our Honda uniforms.\" More than 380,000 pounds of uniforms have been recycled since the program launched at the end of 2021. The uniforms Honda associates wear have always been an important part of the company's culture and success, symbolizing Honda's \"One Team\" approach, which promotes collaboration and the understanding that the ideas of all associates are valued. Transforming Uniforms into Insulation Honda associate uniforms that are cleaned by uniform suppliers – Aramark, at Honda Indiana and Ohio facilities, and Cintas Corporation, at Alabama and North Carolina facilities – are evaluated after washing. If the uniforms are undamaged, they are sent back to associates to wear. When uniforms are designated for reuse in Honda and Acura vehicles, they are baled and sent to Leigh Fibers, which specializes in reprocessing and custom-blending fiber-based materials. At Leigh Fibers' facility, the uniforms are shredded into material that meets the required fiber grade for use as vehicle insulators. Zippers and buttons from the uniforms are first extracted and collected so that no metal or plastic goes through the shredding process. Then the material gets blended into mixed fibers and tested to ensure the fiber material meets the fiber length requirements. The newly reprocessed fibers are then packaged and delivered to insulation supplier UGN. UGN blends, consolidates and trims the fibers into material that is molded into insulation and returned to Honda auto manufacturing plants for new vehicle production. Typically, UGN creates insulation from post-industrial fibers, which are sourced from textile companies, and polyester sourced from recycled water bottles. The uniform recycling program marks the first time Honda and UGN are using post-consumer textile waste for sustainable insulation material. \"It is part of UGN's history and culture to maximize recycled content in our parts, reduce landfill by recycling our own by-products, and promote circular, mono-material technologies that enable end-of-life vehicle recycling,\" said Pranav Singh, director of Purchasing & Packaging for UGN Automotive. \"Reusing Honda uniforms contributes to these efforts by increasing the amount of recycled materials available for insulators and opens the door to other post-consumer textile waste projects.\" Expanding Recycled Materials in Vehicles The uniform recycling program builds on Honda's longstanding commitment to reduce waste and incorporate higher recycled content in Honda and Acura vehicles. This includes working with suppliers to transform post-industrial textile scrap, such as fibers from denim, into vehicle insulation\/absorption material. In collaboration with UGN, Honda annually reuses approximately 2,800 tons of recycled post-industrial textile waste – equivalent to 5.6 million pairs of jeans – and 3,000 tons of post-consumer PET (polyethylene terephthalate) bottles – equivalent to 6 million water bottles – for vehicle sound-absorbing insulation. Other approaches to using sustainable materials in Honda and Acura vehicles have included soybean-based foam for vehicle headrests, recycled plastic water bottles and recycled Honda car bumpers for wheel liners, plant-based material for the seat fabric in the 2019 Acura RDX and Honda Clarity Plug-in Hybrid vehicle, and processed volcanic rocks for the roof liner in the 2003 Honda Element. To learn more about Honda's Triple Action to Zero approach and the concept of resource circulation, read Our Perspective, \"We Have Set a Great Big Goal: Nothing.\" About Honda's Commitment to the Environment Honda is working toward its global goal of zero environmental impact by 2050 through its \"Triple Action to Zero\" approach, including achieving carbon neutrality for all products and corporate activities, 100% utilization of renewable energy, and resource circulation, utilizing 100% sustainable materials by reprocessing products back to raw materials and reusing those materials in the creation of new products. Toward this goal, Honda will strive to make battery-electric and fuel cell electric vehicles represent 100% of auto sales in the U.S. and globally by 2040. To reduce the environmental impact of its business operations, Honda also is offsetting CO2 emissions from its North American manufacturing operations through long-term virtual power purchase agreements (VPPAs) for renewable wind and solar power that seek to cover more than 60% of the electricity Honda uses in North America. Honda also promotes environmentally responsible business practices with its suppliers and retail dealer partners across North America. # # #","filter_flag":1}
{"title":"CSRWire - Designing for Sustainability Drives Progress Along Logitech's Sustainability Journey - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MjYwNi1kZXNpZ25pbmctc3VzdGFpbmFiaWxpdHktZHJpdmVzLXByb2dyZXNzLWFsb25nLWxvZ2l0ZWNocy1zdXN0YWluYWJpbGl0edIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MjYwNi1kZXNpZ25pbmctc3VzdGFpbmFiaWxpdHktZHJpdmVzLXByb2dyZXNzLWFsb25nLWxvZ2l0ZWNocy1zdXN0YWluYWJpbGl0edIBAA?oc=5","id":"CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MjYwNi1kZXNpZ25pbmctc3VzdGFpbmFiaWxpdHktZHJpdmVzLXByb2dyZXNzLWFsb25nLWxvZ2l0ZWNocy1zdXN0YWluYWJpbGl0edIBAA","guidislink":false,"published":"Thu, 31 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=243, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MjYwNi1kZXNpZ25pbmctc3VzdGFpbmFiaWxpdHktZHJpdmVzLXByb2dyZXNzLWFsb25nLWxvZ2l0ZWNocy1zdXN0YWluYWJpbGl0edIBAA?oc=5\" target=\"_blank\">CSRWire - Designing for Sustainability Drives Progress Along Logitech's Sustainability Journey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CSRWire - Designing for Sustainability Drives Progress Along Logitech's Sustainability Journey - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc4MjYwNi1kZXNpZ25pbmctc3VzdGFpbmFiaWxpdHktZHJpdmVzLXByb2dyZXNzLWFsb25nLWxvZ2l0ZWNocy1zdXN0YWluYWJpbGl0edIBAA?oc=5\" target=\"_blank\">CSRWire - Designing for Sustainability Drives Progress Along Logitech's Sustainability Journey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Published 08-31-23 Submitted by Logitech LAUSANNE, Switzerland and SAN JOSE, Calif., August 31, 2023 \/CSRwire\/ - Logitech International (SIX: LOGN) (Nasdaq: LOGI) published its Fiscal Year 2023 Impact Report detailing the Company’s progress toward its sustainability commitments. Logitech is dedicated to removing more carbon than it produces, aiming to achieve climate positive by 2030. Since 2019, Logitech has reduced Scope 1 and 2 emissions by more than 56% and its carbon intensity has decreased by 74%. Scope 3 value chain emissions have reduced by more than 21% since 2021. “As part of our long-term journey toward climate positivity, our 15th Impact Report illustrates how our teams, including our value chain partners, are making meaningful progress on lifecycle carbon reductions,” said Prakash Arunkundrum, chief operating officer at Logitech. “Our Design for Sustainability approach continues to scale, accelerating the transition to lower impact materials and circular alternatives across our product portfolio.” Designing for Sustainability is a catalyst for reducing negative environmental impact and elevating social impact. Because sourcing materials and the manufacturing of Logitech products comprises 65% of the company’s entire carbon footprint, moving to renewable energy, partnering with suppliers, and focusing on removing and reducing hidden impacts early in the design process are critical to achieving the company’s climate goals. Highlights from this year's report include the following: Nearly two in three (2:3) products now use post consumer recycled plastic, lowering carbon and environmental impact across the portfolio. Over 50% of new products have FSC TM -certified packaging and 11% of all Logitech products use FSC TM -certified packaging, an initiative that not only supports the transition away from single-use plastic packaging, but ensures paper packaging is certified from responsibly managed sources. -certified packaging and 11% of all Logitech products use FSC -certified packaging, an initiative that not only supports the transition away from single-use plastic packaging, but ensures paper packaging is certified from responsibly managed sources. Logitech is transparent about its entire scope of impact and pledged to carbon label its products, holding itself accountable for reducing the entire scope of that impact. 42% of Logitech products shipped in 2022 had a product carbon footprint label compared to 17% in 2021. Logitech increasingly chooses materials made using renewable energy. 43 product lines use low carbon aluminum for lower carbon impact. Logitech facilities across the globe are powered by 94% renewable electricity and it is driving greater adoption of renewable energy within its supply chain with its renovated Renewable Electricity Buyer’s Program. Collaborative efforts with suppliers to match energy consumption with renewable electricity certificates led to over 75,000 tCO2 carbon savings. Logitech neutralized its entire carbon emissions across operations and its scope 3 value chain for the second year in a row. “The programs across Logitech aim to advance the positive impact we can have on individuals, communities, and society,” said Kirsty Russell, head of people and culture at Logitech. “In particular, we have taken an accelerated approach to addressing the barriers that keep people from accessing inclusive technology. Creating programs that challenge existing stereotypes and enable all people to work, create, and play will make everyone successful.” The company co-founded the Coalition for Gender Fair Procurement and adopted a new standard for gender equality in the procurement process by introducing Gender Fair’s Assessment Methodology. Logitech continues to elevate programs and products that promote equity and inclusivity in communities throughout the world. Logitech’s Aurora Product Collection and the Adaptive E-Sports Tournament were intentionally designed to challenge existing biases and stereotypes, enhancing inclusivity in gaming. Logitech’s FY23 Impact Report was developed with reference to the Global Reporting Initiative (GRI) standards, the Sustainability Accounting Standards Board (SASB) standard, recommendations outlined by the Task Force on Climate-Related Financial Disclosures (TCFD), and in alignment with the United Nations Global Compact (UNGC) and UN Sustainable Development Goals (SDGs). More information on these and other sustainability accomplishments can be found in the FY23 full report. Learn more about all of Logitech’s sustainability initiatives and commitments on the website at Logitech.com\/sustainability. About Logitech Logitech helps all people pursue their passions and is committed to doing so in a way that is good for people and the planet. We design hardware and software solutions that help businesses thrive and bring people together when working, creating, gaming and streaming. Brands of Logitech include Logitech, Logitech G, ASTRO Gaming, Streamlabs, Blue Microphones and Ultimate Ears. Founded in 1981, and headquartered in Lausanne, Switzerland, Logitech International is a Swiss public company listed on the SIX Swiss Exchange (LOGN) and on the Nasdaq Global Select Market (LOGI). Find Logitech at www.logitech.com, the company blog or @logitech. Logitech and other Logitech marks are trademarks or registered trademarks of Logitech Europe S.A. and\/or its affiliates in the U.S. and other countries. All other trademarks are the property of their respective owners. For more information about Logitech and its products, visit the company’s website at www.logitech.com # # # Editorial Contacts: Marie Perriard, Head of Sustainability Communications - USA mperriard@logitech.com Nicole Kenyon, Head of Global Corporate & Employee Communications - USA (510) 988-8553 Ben Starkie, Corporate Communications - Europe +41 (0) 79-292-3499 (LOGIIR)","filter_flag":1}
{"title":"RE+ 2023 Product Preview - AltEnergyMag","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmFsdGVuZXJneW1hZy5jb20vYXJ0aWNsZS8yMDIzLzA4L3JlLTIwMjMtcHJvZHVjdC1wcmV2aWV3LzM5OTU50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmFsdGVuZXJneW1hZy5jb20vYXJ0aWNsZS8yMDIzLzA4L3JlLTIwMjMtcHJvZHVjdC1wcmV2aWV3LzM5OTU50gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmFsdGVuZXJneW1hZy5jb20vYXJ0aWNsZS8yMDIzLzA4L3JlLTIwMjMtcHJvZHVjdC1wcmV2aWV3LzM5OTU50gEA","guidislink":false,"published":"Thu, 31 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=243, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmFsdGVuZXJneW1hZy5jb20vYXJ0aWNsZS8yMDIzLzA4L3JlLTIwMjMtcHJvZHVjdC1wcmV2aWV3LzM5OTU50gEA?oc=5\" target=\"_blank\">RE+ 2023 Product Preview<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AltEnergyMag<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"RE+ 2023 Product Preview - AltEnergyMag","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmFsdGVuZXJneW1hZy5jb20vYXJ0aWNsZS8yMDIzLzA4L3JlLTIwMjMtcHJvZHVjdC1wcmV2aWV3LzM5OTU50gEA?oc=5\" target=\"_blank\">RE+ 2023 Product Preview<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AltEnergyMag<\/font>","source.href":"https:\/\/www.altenergymag.com","source.title":"AltEnergyMag","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Featured Products Experience the power of SolisHub, the ultimate whole-home backup solution that serves as central hub for PV, batteries, generator, grid, and home loads management. RE+ Booth #4130 Solis is leading the way in innovation with world-class R&D and manufacturing capabilities and is consistently ranked one of the top global manufacturers of PV string inverters. Our team is excited to return to RE+ this year to introduce the SolisHub whole-home backup solution. Experience the power of SolisHub, the ultimate whole-home backup solution that serves as central hub for PV, batteries, generator, grid, and home loads management. It seamlessly integrates multiple Solis hybrid inverters, enhancing PV power output and battery storage capacity. With direct communication to Solis inverters and the battery system, homeowners gain complete control over energy usage and backup power through the intuitive SolisCloud app, enabling them to monitor and manage home energy use and shed loads as required. During grid outages, SolisHub automatically isolates the home from the grid, allowing the energy storage system to supply full power. It also offers generator integration and control for guaranteed automatic whole-home backup. Flexible and economical whole-home backup has never been easier with the new Solis Hub and S6 hybrid energy storage inverter solution, which offers a wide range of applications, customizable sizing, EV and generator integration, easy installation and comprehensive monitoring. Visit us at booth #4130 to meet with our expert sales and local technical teams to find out how Solis can support your business and meet the needs of your next project. Schedule a meeting at RE+ with our team today by emailing us at ussales@solisinverters.com QuickBOLT - Fewer Penetrations, Even Stronger Uplift RE+ Booth #343 QuickBOLT’s newest Deck Mount solutions are Butyl-backed and utilize a Peel-and-Place installation method. Just peel the paper and firmly press into position. Both 16319 and 16320 SKUs come with 4 self-tapping Hex Lags pre-assembled with EPDM backed washers for superior holding and water protection. Skip the rafters and mount anywhere on the roof in 20 seconds or less, no pre-drilling necessary. This over the shingle solution is the right fit for installers that want more flexibility in their array. Pair with QB2, where you can’t use the rafter, or mount your entire array direct-to-deck. The Deck Mount comes with QuickBOLT’s 25-year manufacturer's warranty, and 11 years of over-the-shingle mounts on the roof. Introducing the LG Electronics Home 8 Energy Storage System RE+ Booth #4717 Meet LG Electronics Home 8 Energy Storage System (ESS), a whole home battery backup solution built with installers and their homeowner customers in mind. The ready-to-deploy Home 8 features just one SKU and a modular assembly for fast installation. It can be AC-coupled or solar-powered and is engineered with a grid-connected inverter, four battery modules, and a Smart Energy Box featuring a 7’’ LCD touchscreen with commissioning wizard for easy setup. Each Home 8 unit can store up to 14.4 kWh of usable power, helping homeowners gain pure independence from the grid. Plus, installers can connect up to four units, bringing customers up to 57.6 kWh of total backup power—all easily managed and monitored through intuitive mobile apps. Introduce yourself at RE+, booth #4717 on level two of the Sands Expo Hall. Stäubli Electrical Connectors RE+ Booth #2143 Stäubli Electrical Connectors are used on more than 300 GW, over 50% of the PV capacity worldwide. The MC4 family of UL and TUV listed products include connectors, in-line fuses, branch connectors, cable assembly and more. EVERVOLT home battery storage: Standby power with or without solar RE+ Booth #4125 Renewable energy stored in an EVERVOLT home battery system is the perfect backup plan against an uncertain utility grid and weather events. Run key appliances longer and live life when the unexpected happens. EVERVOLT battery storage systems are covered by a complete 12-year warranty from Panasonic. Terrasmart turns any site into a success, even the toughest ones RE+ Booth #2107 At Terrasmart we believe all sites have potential. In today’s land-constrained market, this means turning unusable land into a solar reality. Known to deliver reliable results in unreliable conditions, Terrasmart boosts your site’s potential. You know us for our iconic ground screws and uniquely adjustable racking. But we are so much more. Our product portfolio spans across multiple foundation types, ground mount racking, canopy systems, project optimization software, and eBOS solutions. Combined with turnkey design, engineering and installation services, our value is uniquely integrated. Our unbiased approach to partnership allows us to deliver agnostic solutions tailored to your project’s unique size, application, terrain, or location - no matter how challenging it may be. Visit us at RE+ to view all our product offerings, including our new TerraTrak 1P single-axis tracker. Just like our 2P, TerraTrak 1P is built to withstand the toughest terrain and harshest weather with added reliability, speed of installation, and maximize value for every project and land type. Alencon Systems - High Power, High Voltage DC:DC Optimizers RE+ Booth #5355 Alencon Systems is the premier manufacturer of high power, high voltage DC:DC optimizers for alternative energy applications including solar, battery energy storage, Microgrids, Fuel Cells and Electric Vehicle charging. Alencon's DC:DC converter offerings include the SPOT, BOSS and CUBE series DC:DC converters. The SPOT is a modular, uni-directional DC:DC solution ideal for solar applications. The BOSS is a modular, bi-directional unit for use with battery energy storage. The CUBE is a monolithic DC:DC converter which is available in both uni-directional and bi-directional modalities. Pictured above, is the Alencon SPOT. 1st Solar & Metal Roof System Approved FM 4478 - Standard for Roof-Mounted Rigid PV Module Systems RE+ Booth #3335 Centroplan's PV system became the first rigid PV module, securement, and metal roof system to receive FM Approvals Listing to their 4478 Standard. The PV system was tested and certified along with S-5!’s NEW PVKIT® HUR, Butler's MR 24 standing seam roof and JA Solar's module. PVKIT® HUR is a new version of the PVKIT solar mounting attachment, designed to withstand extreme wind uplift forces such as hurricane forces. The length of the overhead grabs has increased to 6 inches, providing a larger contact area with the top of the PV module’s frame. This increases the grip on the module frame, preventing it from releasing as the module frame bows under extreme wind uplift force. A new contact surface design and angle increase the grip on the frame still further. Another feature is a baseplate to match the new 6-inch grab, resulting in greater clamping force across the entire grab length. This new baseplate incorporates a mechanism at the underside of the module frame to further prevent the frame from disengaging its mount under high uplift forces. It is the first metal roof PV mounting system certified to FM4478, FM Approvals toughest PV Standard. Roof Tech - Solar PV Mounting Systems for Every Roof! RE+ Booth #326 Now Roof Tech brings you the most innovative, watertight mounting systems ever developed for solar photovoltaic systems. Designed and manufactured exclusively for us by Japan's longtime leader in roofing technologies, Roof Tech products are 100% code-compliant and offer fast, simple installation and huge savings on shipping costs due to their compact, rail-less design. Learn more about our full line of versatile PV mounting solutions now available for residential installations. The next generation in rooftop solar mounting solutions.\" Canadian Solar - HiKuBlack - Black Backsheet & Frame (Mono) RE+ Booth #2516 Aesthetic appearance for residential systems: With black backsheet & black frame, Power range 380 ~ 405 W, Low power loss in cell connection. Enhanced reliability: · Low temperature coefficient (Pmax): -0.34 % \/ °C, LID LeTID less than 2.0%, Lower hot spot temperature, Better shading tolerance. BENY - SOLAR DC MINI CIRCUIT BREAKER RE+ Booth #4660 The BB1-63 modular miniature circuit-breakers can be used in solar DC circuits up to 1200 VDC (4-poles execution). Application in solar DC circuits, battery energy storage systems and UPS. Arc flash barrier design keeps solar equipment more safe and reliable. For DC circuit over-current protection. SFOne, the 1P tracker made in the US by Soltec RE+ Booth #1630 This tracker combines mechanical simplicity with Soltec’s outstanding experience of more than 18 years. Specially designed for larger 72 and 78 cell modules, this tracker is self-powered thanks to its dedicated module, which translates into a lower cost operating power supply. The SFOne features an innovative Full-Wireless system and an Open Thread mesh network. Its TMS is built-in for total PV plant control and achieves the lowest latency communication in the market. Face-2-Face positioning helps wash vehicles cover twice the area as the vehicle passes, which proportionally reduces wash time hours per MW. The SFOne has a lower height structure, which helps reduce the visual impact of the plants. HPS EnduraCoilTM Cast Resin Medium Voltage Transformer RE+ Booth #4963 HPS EnduraCoil is a high-performance cast resin transformer designed for many demanding and diverse applications while minimizing both installation and maintenance costs. Coils are formed with mineral-filled epoxy, reinforced with fiberglass and cast to provide complete void-free resin impregnation throughout the entire insulation system. HPS EnduraCoil complies with the new NRCan 2019 and DOE 2016 efficiency regulations and is approved by both UL and CSA standards. It is also seismic qualified per IBC 2012\/ASCE 7-10\/CBC 2013. Cast resin transformers are self-extinguishing in the unlikely event of fire, environmentally friendly and offer greater resistance to short circuits. HPS also offers wide range of accessories for transformer protection and monitoring requirements.","filter_flag":1}
{"title":"Hitachi Energy supports a green hydrogen economy to accelerate the energy transition - Hitachi Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA","guidislink":false,"published":"Fri, 04 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=216, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5\" target=\"_blank\">Hitachi Energy supports a green hydrogen economy to accelerate the energy transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hitachi Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hitachi Energy supports a green hydrogen economy to accelerate the energy transition - Hitachi Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5oaXRhY2hpZW5lcmd5LmNvbS9uZXdzL2ZlYXR1cmVzLzIwMjMvMDgvaGl0YWNoaS1lbmVyZ3ktc3VwcG9ydHMtYS1ncmVlbi1oeWRyb2dlbi1lY29ub215LXRvLWFjY2VsZXJhdGUtdGhlLWVuZXJneS10cmFuc2l0aW9u0gEA?oc=5\" target=\"_blank\">Hitachi Energy supports a green hydrogen economy to accelerate the energy transition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hitachi Energy<\/font>","source.href":"https:\/\/www.hitachienergy.com","source.title":"Hitachi Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Hitachi Energy, a global technology leader that is advancing a sustainable energy future for all, is focused on developing innovative products, solutions, and services that support a clean energy transition for customers and partners, which includes ways of harnessing green hydrogen for a decarbonized future. Rapidly increasing global demand for hydrogen is also driving up demand for clean, green hydrogen production, which in turn requires vast amounts of green energy, electrolysers and peripheral electrical equipment. \"We are delighted to play a significant and enabling role in the growing hydrogen sector offering leading-edge advisory services and technologies to accelerate the energy transition,\" said Marco Berardi, Head of Grid & Power Quality Solutions and Service business at Hitachi Energy. \"Our solutions for the hydrogen sector support the generation of efficient and reliable clean energy. On the one hand, we offer world-class expertise in connecting electrolyser systems to the grid, and on the other, we are driving innovation in clean power generation leveraging hydrogen fuel cell technology.\" Power-to-Hydrogen There are several ways of producing hydrogen with varying carbon intensity. Water electrolysis uses an electrolyser and an electric current to split fresh water into its constituent elements, hydrogen and oxygen. If the electricity used in this process comes exclusively from renewable sources like wind or solar, the hydrogen produced is called green hydrogen. Most hydrogen today is produced by reforming fossil fuels like gas or coal. These processes emit large amounts of CO 2 , while water electrolysis utilizing renewable energy produces a nearly CO 2 -free form of hydrogen. Green hydrogen is a new and complementing component in the electrification space, where Hitachi Energy can add substantial value and innovation. With vast domain expertise in grid connection and power quality solutions, it develops groundbreaking technologies that enable renewables integration, high power quality and reliable and resilient power grids. \"We expand in new directions to support customers with crucial innovations to meet the needs of the evolving global clean energy transition and offer advanced and proven solutions to connect high-power (>20 MW) electrolysers to the high-voltage grid,\" said Berardi. “We focus on optimizing the complete power supply system, from early-stage techno-economic studies and advise to grid connection and Battery Energy Storage Systems (BESS) down to stack terminals and O&M software which increases your system performance.” Hydrogen and renewable electricity are vital in the energy transition. For instance, a green value chain can supply clean fuel for heavy transport and supports hard-to-abate industries, such as steel, fertilizers, chemicals and oil and gas to lower their carbon footprint. It can also electrify remote construction sites, and provide clean backup power where it is needed. At all project phases, Hitachi Energy optimizes the costs, footprint, and efficiency of green hydrogen projects and helps remove the risk of not being grid-code compliant. Hydrogen-to-Power The restrictions on the use of fossil fuels are forcing us to rethink the status quo. To address this need, new products under development include a hydrogen power generator, based on zero-emission fuel cell technology. In 2021, Hitachi Energy and PowerCell agreed to collaborate on fuel cell-based power solutions contributing to the green energy transition. Hydrogen power generators are a disruptive replacement technology for carbon-intensive fossil fuel-based generators such as diesel gensets. A key feature of hydrogen is its capacity to store energy over long periods and convert it back to power when needed. Built to decarbonize sectors and applications such as remote construction sites and provide clean backup power, Hitachi Energy's hydrogen power generator will be available as a medium-power movable product (400-600 kVA) and a high-power stationary product (1 MVA+). This integrated and configurable clean energy generator can scale up to meet our customers' specific power needs.","filter_flag":1}
{"title":"Circularity, meet decarbonization - GreenBiz","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NpcmN1bGFyaXR5LW1lZXQtZGVjYXJib25pemF0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NpcmN1bGFyaXR5LW1lZXQtZGVjYXJib25pemF0aW9u0gEA?oc=5","id":"CBMiQWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NpcmN1bGFyaXR5LW1lZXQtZGVjYXJib25pemF0aW9u0gEA","guidislink":false,"published":"Fri, 25 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=237, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NpcmN1bGFyaXR5LW1lZXQtZGVjYXJib25pemF0aW9u0gEA?oc=5\" target=\"_blank\">Circularity, meet decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circularity, meet decarbonization - GreenBiz","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2NpcmN1bGFyaXR5LW1lZXQtZGVjYXJib25pemF0aW9u0gEA?oc=5\" target=\"_blank\">Circularity, meet decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","source.href":"https:\/\/www.greenbiz.com","source.title":"GreenBiz","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Decarbonization and circularity are often managed by separate teams within an organization, with separate timelines, projects and goals. This can cause competition for internal resources, talent and attention, rather than bringing the necessary pieces together to address interconnected issues. Stripped to their basics, circularity and decarbonization are both about reducing the negative externalities of our economic system. Even in the fundamental principles of circularity — eliminate waste and pollution, circulate products and materials at their highest value, regenerate nature — we see connections to decarbonization. Decarbonization, when taken to mean reducing emissions, is embedded in that first principle of circularity. Efforts to remove greenhouse gases from the atmosphere and recarbonize soil and vegetation are inherently circular solutions that help regenerate nature. Circularity and decarbonization strategies have significant overlap. To uncover some of the links, I spoke to Ke Wang, program director at Platform for Accelerating the Circular Economy (PACE). The self-described \"physicist turned sustainability professional\" turns the knowledge built by PACE and its partners into circular public-private collaborations across a wide range of industries. We started by discussing the report \"Completing the picture: How the circular economy tackles climate change\" from the Ellen MacArthur Foundation. It posits that efforts to improve energy efficiency and transition to renewable energy can only address 55 percent of global emissions. The other 45 percent of emissions come from the sourcing and manufacturing of consumer goods, the development of the built environment, the production and transportation of food and how we manage land. She described these two sides of global emissions as the \"operational energy use\" of all the fuels used to power transportation and buildings as opposed to emissions from extracting, processing and manufacturing \"the stuff that we use and consume every day.\" Circularity has a big role to play in supporting the clean energy transition. Kori Goldberg: So let’s dive into the operational energy side. How can circularity help address this 55 percent of global GHG emissions? Wang: Circularity has a big role to play in supporting the clean energy transition. Solar PV, wind turbines, EV batteries — all reduce fossil fuel-based emissions but these technologies are very material and mineral heavy. The International Energy Agency has forecasted that if we are to scale these clean energy technologies at the speed needed to stay within 1.5 degrees Celsius, the total demand for minerals will far exceed today's supply capacity. The material side is a big bottleneck for the energy transition. So this is where circularity can play an important role. We can reduce the demand for critical minerals and alleviate some of the supply pressure required for the energy transition. Goldberg: And now the other 45 percent: extracting, processing and manufacturing… Wang: So if you look at these material-related emissions, this comes mostly from the production of stuff … for example, for some electronics, three-quarters of the emission comes from the manufacturing phase alone. Circularity kind of boils down to \"reduce, reuse and recycle\"; all just strategies to reduce societal demand for virgin raw materials and new products. Circular strategies that reduce the demand for raw materials and new products subsequently reduce GHG emissions from production. Goldberg: What specific circular strategies are called out in the literature as the best avenues to achieve decarbonization targets? Wang: There are many articles in this space, but most of them can be traced back to just three bigger, more comprehensive reports: one from International Resource Panel; one from the Ellen MacArthur Foundation; and a third from Circle Economy. Circular strategies that reduce the demand for raw materials and new products subsequently reduce GHG emissions from production. Well, when we looked into those reports, although they may disagree on the numbers, they do agree qualitatively on which circularity measures have the highest GHG reduction potential. And those are not recycling strategies; those are more upstream measures that focus specifically on consumption patterns, reducing overconsumption and more efficient design. Upstream circularity strategies can achieve synergistic carbon reductions. For example, reducing total floor area reduces embedded carbon and emissions from heating and cooling; lightweight vehicle design reduces embedded carbon and emissions from fuel usage. Goldberg: Reporting on circularity is very minimal compared to GHG reporting. But essentially both reporting on circularity and GHG emissions are asking: What are your inputs, where are they coming from? How are they being managed, and where do they go? First off, what makes reporting on circularity so different from GHG reporting? Wang: First, the indicator itself: For GHG emissions, the indicator is simple and unified — CO2 equivalent. It's one unit that can be used by everybody. That simplifies measurement, comparing apples to apples. For circularity, it's not so simple...We measure both inputs and outputs in tonnage, but this doesn't say anything about, for example, how hazardous a material is or the scarcity of the material or the carbon footprint. Just simply looking at tonnage, we should prioritize washing machines, right? There's tons of concrete inside. But in terms of value, mobile phones have a lot more critical minerals. Unlike greenhouse gas emissions, there's a very clear global target on temperature, and also on the total emission budget. And for circularity, we don't have that yet. Challenge No. 2 is: Unlike greenhouse gas emissions, there's a very clear global target on temperature, and also on the total emission budget. And for circularity, we don't have that yet. There are research groups like the International Resource Panel, which are actually actively working with a large group of scientists on it. But even scientifically, there's no consensus yet of what the target should be. Goldberg: How have circular metrics changed in recent years? Wang: Literally hundreds of metrics have been developed. For the past few years PACE has hosted the Circular Economy Indicator Coalition with the intention to help metric developers talk to each other and to see if, longer term, we can consolidate, but we're not there yet. There are so many indicators out there, it can be confusing for companies to choose what to track. Earlier this year, working with Accenture, we launched circular target-setting guidance for companies. We try to boil down the hundreds of indicators to maybe a dozen, but it's still quite a few compared to GHG emissions. I've seen some companies start using material footprint per EBITA — so, basically, how much material they use, normalized to their profit. That might be a good kind of umbrella indicator. Goldberg: What does the integration of circularity and decarbonization mean for the likelihood of success for both these efforts? Can connecting these two issues increase the attention and resources given to both? Wang: This is a need we have spotted at PACE, which has led to a new program called Integrating Circularity with Climate Measures. So we intend to do exactly that. We have observed this siloed campaigning or advocacy between circularity and decarbonization, and we think if we bring the two closer together, we can achieve more. We still need the science to give more guidance of exactly how and there are efforts in that direction — for example, the Circular Transition Indicator work by WBCSD. They're already in their fourth edition, looking at how circularity indicators can be connected to GHG emissions. There are ongoing active efforts, and hopefully we’ll get there soon enough.","filter_flag":1}
{"title":"Top solar panel brands in performance, reliability, and quality - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzAxL3RvcC1zb2xhci1wYW5lbC1icmFuZHMtaW4tcGVyZm9ybWFuY2UtcmVsaWFiaWxpdHktYW5kLXF1YWxpdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzAxL3RvcC1zb2xhci1wYW5lbC1icmFuZHMtaW4tcGVyZm9ybWFuY2UtcmVsaWFiaWxpdHktYW5kLXF1YWxpdHkv0gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzAxL3RvcC1zb2xhci1wYW5lbC1icmFuZHMtaW4tcGVyZm9ybWFuY2UtcmVsaWFiaWxpdHktYW5kLXF1YWxpdHkv0gEA","guidislink":false,"published":"Tue, 01 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=213, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzAxL3RvcC1zb2xhci1wYW5lbC1icmFuZHMtaW4tcGVyZm9ybWFuY2UtcmVsaWFiaWxpdHktYW5kLXF1YWxpdHkv0gEA?oc=5\" target=\"_blank\">Top solar panel brands in performance, reliability, and quality<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top solar panel brands in performance, reliability, and quality - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzAxL3RvcC1zb2xhci1wYW5lbC1icmFuZHMtaW4tcGVyZm9ybWFuY2UtcmVsaWFiaWxpdHktYW5kLXF1YWxpdHkv0gEA?oc=5\" target=\"_blank\">Top solar panel brands in performance, reliability, and quality<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The Renewable Energy Test Center (RETC) released its 2023 PV Module Index report, evaluating the reliability, quality, and performance of solar panels. Solar modules are put through a variety of accelerated stress tests to evaluate these parameters. Through comparative test results, project stakeholders can select products best suited for a particular environment, location, or portfolio. Quality Hail durability Top performers: JA Solar, JinkoSolar, Trina Solar RETC’s hail durability test takes UL and IEC standards testing a step further, exposing solar modules to higher kinetic impact to reflect the risk posed by hail over a 25 or 30-year operating life. In addition to ballistic impact testing, RETC runs thermal cycle and hot-spot tests to reveal potential long-term module degradation. The top eight performers in this category withstood an effective kinetic energy of 20 Joules or more. These modules effectively demonstrated resistance to a 45 mm (1.8 in.) iceball traveling at a terminal velocity of 30.7 m\/s (68.7 mph). Thresher Test Top performers: Astronergy, JA Solar Longi Solar, Runergy The thresher test is a summation of a series of tests that places modules under a variety of vigorous environmental stresses to provide quantitative data behind degradation modes. Power drop, leakage current and visual observations are also made in the test. The RETC test places backsheets, modules, and connectors through accelerated stresses. Thresher tests include humidity-freeze cycling, thermal cycling, damp heat exposure, static and dynamic load testing, and UV soaking. High performers in this category consistently achieved less than 2% of power degradation. Performance LeTID resistance Top performers: Aptos Solar, Astronergy, JA Solar, Runergy, SEG Solar, Silfab Solar, Solar Space, Trina Solar, Yingli Solar Relatively new cell technologies may experience long-term degradation associated with light exposure and elevated temperatures. This phenomenon, called light- and elevated temperature-induced degradation (LeTID), is tested with a protocol of light soaking, followed by 75 C (167 F) temperature exposure for two 162-hour cycles to identify significant degradation (>5%). Subsequently, test samples are subject to 500 hours of 75 C temperature exposure followed by two additional 162-hour cycles. Highlighted top performers demonstrated products that had less than 0.75% power loss after 486 hours of exposure. LID resistance Top performers: Dehui Solar, Longi Solar, Merlin Solar Light-induced degradation (LID), or power losses from sunlight exposure, affects some PV cell types but not others. PV modules exposed to LID losses rapidly lose performance over the first few hours or days of operation before stabilizing. RETC notes LID resistance is highly correlated with cell type. Top performers were all monocrystalline silicon panels and experienced an increase in performance or a modest decrease amounting to less than one tenth of one percent. Module efficiency Top performers: Auxin Solar, JA Solar, Longi Solar, Meyer Burger, Mission Solar, Qcells, REC Solar, Silfab Solar, Trina Solar, Yingli Solar Module efficiency, or the percentage of incident solar energy converted to electrical energy, is a well-known and key metric for solar performance. It is highly correlated with cell technology and module design. The top 14 highest scoring modules scored efficiencies of 20% or more. An n-type TOPCon cell scored the highest at 25.8% efficiency, followed by a monocrystalline silicon module with heterojunction technology, recording a 22.4% efficiency. PAN file Popular content Top performers: Dehui Solar, JA Solar, Longi Solar, Qcells, Runergy, Yingli Solar The PAN file test is a module characterization test with 22 parameters set by the PVsyst modeling software. Project developers use PVsyst to evaluate potential sites based on energy production and financial performance. The assuming filed test conditions of a 10 MW utility-scale solar plant in Midland, Texas with fixed tilt ground mounts and 500 kVA central inverters. Top performers in the PAN test achieved a performance ratio in PVsyst of 85% or greater. pv magazine print edition In the latest, “In Conversation” issue of pv magazine we talk to a range of people about their experience with solar, from a sailor and a pair of overland adventurers to a mountain climber and more besides. We also focus on Africa to consider why a continent with such vast solar resource still lags more developed economies when it comes to widespread PV and energy storage rollout. Reliability Damp heat test Top performers: Astronergy, JA Solar, Longi Solar, Qcells, Runergy, Trina Solar, Yingli Solar The RETC thresher test includes a damp heat test that exposes modules for 2,000 hours, double the amount required for product certification. The test evaluates a module’s ability to withstand prolonged exposure to humid, high-temperature environments. Taking place inside an environmental chamber, the test exposes modules to a controlled temperature of 85 C (185 F) and a relative humidity of 85% for a set amount of time. RETC highlighted performers that experienced less than 2% degradation after this exposure. PID resistance Top performers: Astronergy, JA Solar, JinkoSolar, Qcells, Runergy Potential induced degradation (PID) resistance tests rack-mounted modules in an environmental chamber, which controls temperature and humidity, and exposes them to a voltage bias of several hundred volts with respect to the mounting structure. Typically, exposure times range from 96 hours to as much as 500 hours. PID testing characterizes a module’s ability to withstand degradation due to voltage and current leakage resulting from ion mobility between the semiconductor and other elements in module packaging. Nearly 28% of the test samples experienced less than 1% degradation over the test period. By comparison, less than 9% of modules achieved greater than 5% power loss. Static and dynamic mechanical load test Top performers: Astronergy, JA Solar, JinkoSolar, Longi Solar, Runergy, Trina Solar, Yingli Solar This test exposes modules to 1,000 cycles of +1,000 pascal and –1,000 pascal loads at a frequency of three to seven cycles per minute. Measurements were taken after this stress test rate electrical performance. This year, nearly 47% of the modules that RETC subjected to simulated wind and environmental stresses achieved less than 2% degradation in power. Roughly 17% of the total test samples experienced less than 1% degradation in power after the SDML sequence. RETC notes that the results in this category represent a modest improvement on a year-over-year basis. Thermal cycling Top performers: Astronergy, JA Solar, JinkoSolar, Longi Solar, Qcells, Runergy, Saint Gobain, Trina Solar, Yingli Solar The thermal cycle test calls for cycling modules in an environmental chamber between two temperature extremes—85 C (185 F) on the high end and –40 C (–40F) on the low end. The RETC test runs 600 cycles, three times as much as the 200 required for certification. Roughly 80% of modules in this test achieved less than 2% power loss, while only 2.4% had power losses of 4% or more. Overall top performers “To identify the best of the best, we reviewed and ranked the overall data distributions across all three disciplines: quality, performance, and reliability. The Overall Results Matrix on the right summarizes the results of this analysis, which highlights eight high achievers based on overall highest achievement in manufacturing,” said RETC. Top performers (alphabetical order): Astronergy, JA Solar, JinkoSolar, Longi Solar, Qcells, Runergy, Trina Solar, Yingli Solar","filter_flag":1}
{"title":"Shanghai Electric Delivers the First Batch of VRFB Products to Europe - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA","guidislink":false,"published":"Wed, 09 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=221, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5\" target=\"_blank\">Shanghai Electric Delivers the First Batch of VRFB Products to Europe<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Shanghai Electric Delivers the First Batch of VRFB Products to Europe - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc2hhbmdoYWktZWxlY3RyaWMtZGVsaXZlcnMtdGhlLWZpcnN0LWJhdGNoLW9mLXZyZmItcHJvZHVjdHMtdG8tZXVyb3BlLTMwMTg5NjgzNi5odG1s0gEA?oc=5\" target=\"_blank\">Shanghai Electric Delivers the First Batch of VRFB Products to Europe<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"ZARAGOZA, Spain, Aug. 9, 2023 \/PRNewswire\/ -- Shanghai Electric Energy Storage Technology Co., Ltd. (\"Shanghai Electric Energy Storage\" or \"the Company\") announced the completion of the factory acceptance test for its vanadium redox flow battery (VRFB) equipment, which is now en route to Zaragoza, Spain, for a commercial energy storage project, marking the first time that Shanghai Electric delivers its flow battery products to a European partner in bulk. Shanghai Electric Delivers the First Batch of VRFB Products to Europe. Under the agreement with local partner in Spain, which is the sixth sub-contract that Shanghai Electric signed with the Spain-based energy storage solution provider, Shanghai Electric Energy Storage will supply bespoke VRFB products for the local renewable projects. The cooperation of the pair showcases the market adaptability of Shanghai Electric's flow battery solutions as well as its ability to deliver products tail-made to help European countries accelerate toward energy transition. Meanwhile, Shanghai Electric and local partners are also in discussion on the design of multiple system projects, which encompass the supply of standard containerized systems and products. The two companies are also planning to cooperate on the construction of MW-scale projects. Energy storage technology is one of the foundations for the renewable energy revolution, playing a key role in facilitating the world's achievement of low-carbon targets. Shanghai Electric, with its long-term track record in new energy technology development, is a pioneer that pushes the boundary of battery solutions, spearheading innovation for VRFB products to boost the reliability, sustainability, and affordability of renewable power sources. In 2023, Shanghai Electric made a significant breakthrough in the field of battery storage technology with the launch of the 500kW\/3000kWh energy storage system, a new solution that represents a major milestone in the development of vanadium redox flow battery (VRFB) technology. By upgrading the form factor, functionality, and performance of VRFBs, Shanghai Electric has opened up new possibilities for renewable energy storage, empowering China and beyond to reduce dependence on fossil fuels and contributing to a cleaner, more sustainable future. The system employs a 65 kW high-power, high-performance stack, which is the largest single stack developed by China's homegrown energy company. The 500 kW battery features 4s2p configurations, making it the largest single module among long-duration flow batteries in China. The system's DC-side efficiency exceeds 85%, with the overall energy efficiency reaching 90%, trimming the cost of electricity per kWh down to RMB 0.2 (USD 0.028). With its electrolyte consisting of water and inorganic salts, the system is capable of operating at normal temperature and pressure without the risk of flammable or explosive hazards, offering 20,000 charge and discharge cycles with no capacity attenuation in its lifespan. It is designed as a high-power, long-duration energy storage system for wind energy and solar PV projects, with its expandable structure helping save 50% of land usage. The module is easily transportable, quick to install and deploy, and suitable for locations with a temperature range of -30 to 60 degrees Celsius and harsh environmental conditions. Equipped with state-of-the-art battery management technology powered by digital twin visualization and operation technology, the system's operational status is accurately monitored and optimized by intelligent algorithms that maximize battery protection, achieving smart O&M and ensuring the long-term reliability of the product. Shanghai Electric's ground-breaking innovation in VRFB has allowed the group to clinch the China Energy Storage Industry Technology Innovation Brand Award and the China Energy Storage Battery Brand Award in 2023. The dual recognition highlights the group's technological leadership in energy storage and its ability to develop cutting-edge VRFB products that address the future needs of the new energy sector. 2023 has also seen Shanghai Electric and China Vanadium Energy Storage Technology jointly commence the construction of a 100 MW\/600 MWh VRFB energy storage station in Baicheng, Jilin Province. Shanghai Electric Energy Storage is set to provide green, economical, and efficient VRFB products and integrated solutions, helping to decarbonize the local economy while bolstering the development of Jinlin's new energy industry. As Shanghai Electric Energy Storage continues to innovate on battery technology and expand its global market presence, the Company remains focused on providing its customers with reliable and sustainable energy solutions. In line with this commitment, the Company will ramp up investment in R&D to further advance the development of energy storage technologies, improve the safety and environmental sustainability of its products and services, and seek innovation to empower the world to reduce its carbon footprint and promote a greener future for all. SOURCE Shanghai Electric","filter_flag":1}
{"title":"Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5","id":"CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA","guidislink":false,"published":"Tue, 22 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5\" target=\"_blank\">Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzA4LzIyL3Rhbnphbmlhcy1zb2xhci1qb3VybmV5LWFjY2VsZXJhdGVzLWQtbGlnaHQtc2VjdXJlcy0zMC1taWxsaW9uLWludmVzdG1lbnQv0gEA?oc=5\" target=\"_blank\">Tanzania's Solar Journey Accelerates; d.light Secures $30 Million Investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"d.light, a leading provider of affordable solar-powered household products, has successfully secured a $30 million securitization facility from the Eastern and Southern African Trade and Development Bank Group (TDB Group). This funding, which has the potential to support up to $125 million of receivable assets, will be instrumental in d.light’s efforts to expand solar access in Tanzania. The capital from this facility will be utilized to amplify d.light’s existing securitized financing facility in Tanzania. The company aims to scale up its Pay-Go personal finance service, enabling more low-income households to afford their solar-powered products and contribute to sustainable energy solutions. This achievement propels d.light’s total securitized financing to $490 million since 2020, with the Tanzanian facility being anchored by TDB. The company has long been a pioneer in developing securitized finance models to raise equity for off-grid solar projects. Tanzania’s Solar Revolution with d.light’s Pay-Go Model CEO of d.light, Nick Imudia, expressed how this funding would be pivotal in reaching more low-income families in Tanzania through their Pay-Go business model. By facilitating affordable access to solar energy, the initiative will significantly contribute to both customers’ well-being and the environment. Imudia emphasized the significance of green energy investments in building a sustainable future. He highlighted how the securitization model has successfully advanced their goals in Kenya and is now expanding to Tanzania, a country where only 40% of the population has electricity access. TDB CEO Michael Awori emphasized the critical role of energy access in sustainable development. He applauded d.light’s efforts to extend its reach and positive impact to off-grid communities through renewable energy solutions. Tanzania, with its vast geographic spread and limited grid connectivity, is a prime candidate for d.light’s solar-powered solutions. The company’s finance facility leverages customer payments to further its solar initiatives, allowing for growth and market expansion in the country. With this successful funding, d.light plans to create a new financing vehicle, Brighter Life Tanzania 1 Limited (BLT1), in collaboration with lending partner African Frontier Capital (AFC). This vehicle will contribute to the expansion of local currency receivables financing, empowering d.light’s commitment to financial inclusion and clean energy access. As d.light continues to empower underserved communities, its initiatives serve as a beacon of change, driving sustainable development and equitable energy transition in Tanzania and beyond. Like this: Like Loading...","filter_flag":1}
{"title":"GE Vernova and ORE Catapult Collaborate to Drive Down Offshore Wind Costs - Offshore Engineer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm9lZGlnaXRhbC5jb20vbmV3cy81MDcwMjQtZ2UtdmVybm92YS1hbmQtb3JlLWNhdGFwdWx0LWNvbGxhYm9yYXRlLXRvLWRyaXZlLWRvd24tb2Zmc2hvcmUtd2luZC1jb3N0c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm9lZGlnaXRhbC5jb20vbmV3cy81MDcwMjQtZ2UtdmVybm92YS1hbmQtb3JlLWNhdGFwdWx0LWNvbGxhYm9yYXRlLXRvLWRyaXZlLWRvd24tb2Zmc2hvcmUtd2luZC1jb3N0c9IBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3Lm9lZGlnaXRhbC5jb20vbmV3cy81MDcwMjQtZ2UtdmVybm92YS1hbmQtb3JlLWNhdGFwdWx0LWNvbGxhYm9yYXRlLXRvLWRyaXZlLWRvd24tb2Zmc2hvcmUtd2luZC1jb3N0c9IBAA","guidislink":false,"published":"Mon, 07 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=219, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm9lZGlnaXRhbC5jb20vbmV3cy81MDcwMjQtZ2UtdmVybm92YS1hbmQtb3JlLWNhdGFwdWx0LWNvbGxhYm9yYXRlLXRvLWRyaXZlLWRvd24tb2Zmc2hvcmUtd2luZC1jb3N0c9IBAA?oc=5\" target=\"_blank\">GE Vernova and ORE Catapult Collaborate to Drive Down Offshore Wind Costs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Offshore Engineer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"GE Vernova and ORE Catapult Collaborate to Drive Down Offshore Wind Costs - Offshore Engineer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Lm9lZGlnaXRhbC5jb20vbmV3cy81MDcwMjQtZ2UtdmVybm92YS1hbmQtb3JlLWNhdGFwdWx0LWNvbGxhYm9yYXRlLXRvLWRyaXZlLWRvd24tb2Zmc2hvcmUtd2luZC1jb3N0c9IBAA?oc=5\" target=\"_blank\">GE Vernova and ORE Catapult Collaborate to Drive Down Offshore Wind Costs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Offshore Engineer<\/font>","source.href":"https:\/\/www.oedigital.com","source.title":"Offshore Engineer","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"GE Vernova’s Offshore Wind business and UK-based Offshore Renewable Energy (ORE) Catapult have signed a new research collaboration, building on the success of their previous ‘Stay Ashore’ program. The £4 million agreement Monday paves the way for a multi-year collaboration between GE Vernova and ORE Catapult to create a dedicated research program to help drive down the Levelised Cost of Energy (LCOE) for the global offshore wind market with reliable, enhanced, sustainable, and demonstrated technologies, ORE Catapult said. The partnership will focus on enhancing turbine performance and improved operations and maintenance through smart technological solutions. According to ORE Catapult, the previous program, 'Stay Ashore', successfully brought GE and ORE Catapult teams together, and has provided UK businesses, from micro-SMEs to large companies, with the opportunity to collaborate and develop products and services aimed at extending the life of offshore wind components. \"Stay Ashore delivered solutions for wind turbine digital twins and used data analytics to inform turbine operations and maintenance. The real-time data from over 70 operational wind turbines, together with virtual physics-based models for the turbine, were used to generate a cloud based digital twin, covering models for a multitude of wind turbine components and systems,\" ORE Catapult said. \"From robotic crawlers and new drone and sensor technologies, to cutting edge digital analysis tools, the Stay Ashore program supported UK SMEs in the development of further new products and services which have subsequently leveraged nearly £2m in funding and\/or investment,\" ORE Catapult added. Moving forward, ORE Catapult said, this new agreement will focus on some of the biggest challenges facing the industry in the future large-scale deployment of offshore wind and use applied research to enable the development of key innovations.","filter_flag":1}
{"title":"10 Facts About Sustainability - Family Handyman","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9saXN0L2ZhY3RzLWFib3V0LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9saXN0L2ZhY3RzLWFib3V0LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9saXN0L2ZhY3RzLWFib3V0LXN1c3RhaW5hYmlsaXR5L9IBAA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9saXN0L2ZhY3RzLWFib3V0LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">10 Facts About Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Family Handyman<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"10 Facts About Sustainability - Family Handyman","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9saXN0L2ZhY3RzLWFib3V0LXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">10 Facts About Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Family Handyman<\/font>","source.href":"https:\/\/www.familyhandyman.com","source.title":"Family Handyman","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Eager to make changes to reduce your carbon footprint? Here's what you need to know about sustainability. MURAT TANER\/GETTY IMAGES What Does Sustainable Mean? As we hear more about climate and other environmental concerns, it’s helpful to know what we can do at home to make a difference. We’re often asked to be more sustainable and to buy sustainable products, but what does sustainability actually mean? The term was first used in 1864, when American conservationist George Perkins Marsh discussed the importance of a harmonious relationship between humans and the natural world in his book, Man and Nature. He warned of the dangers that could arise if we exhausted our natural resources too quickly. The United Nations World Commission on Environment and Development defines sustainability as “meeting the needs of the present without compromising the ability of future generations to meet their own needs.” In 1969, the National Environmental Policy Act committed the United States to sustainability, declaring it a national policy “to create and maintain conditions under which humans and nature can exist in productive harmony, that permit fulfilling the social, economic and other requirements of present and future generations.” These three pillars of sustainability — aka the triple bottom line — are often referred to as people, profit and the planet. Knowing some key facts about sustainability will help you be a better consumer while reducing your negative impact on the planet. While you’re at it, also learn about some sustainability techniques that modern day sustainable builders incorporate in their work for a better environment.","filter_flag":1}
{"title":"The Power Engineer Electrifying John Deere’s Tractors, Trucks, and More - IEEE Spectrum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vc3BlY3RydW0uaWVlZS5vcmcvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdo0gFHaHR0cHM6Ly9zcGVjdHJ1bS5pZWVlLm9yZy9hbXAvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdoLTI2NjM5MTAyMzM?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vc3BlY3RydW0uaWVlZS5vcmcvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdo0gFHaHR0cHM6Ly9zcGVjdHJ1bS5pZWVlLm9yZy9hbXAvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdoLTI2NjM5MTAyMzM?oc=5","id":"CBMiOGh0dHBzOi8vc3BlY3RydW0uaWVlZS5vcmcvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdo0gFHaHR0cHM6Ly9zcGVjdHJ1bS5pZWVlLm9yZy9hbXAvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdoLTI2NjM5MTAyMzM","guidislink":false,"published":"Tue, 22 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vc3BlY3RydW0uaWVlZS5vcmcvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdo0gFHaHR0cHM6Ly9zcGVjdHJ1bS5pZWVlLm9yZy9hbXAvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdoLTI2NjM5MTAyMzM?oc=5\" target=\"_blank\">The Power Engineer Electrifying John Deere’s Tractors, Trucks, and More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">IEEE Spectrum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Power Engineer Electrifying John Deere’s Tractors, Trucks, and More - IEEE Spectrum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vc3BlY3RydW0uaWVlZS5vcmcvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdo0gFHaHR0cHM6Ly9zcGVjdHJ1bS5pZWVlLm9yZy9hbXAvam9obi1kZWVyZS1lbmdpbmVlci1icmlqLXNpbmdoLTI2NjM5MTAyMzM?oc=5\" target=\"_blank\">The Power Engineer Electrifying John Deere’s Tractors, Trucks, and More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">IEEE Spectrum<\/font>","source.href":"https:\/\/spectrum.ieee.org","source.title":"IEEE Spectrum","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"For Brij Singh, electrifying John Deere’s heavy-duty vehicles reflects his past. Singh grew up on a farm in India, and is committed to bettering agriculture’s future. John Deere, headquartered in Moline, Ill., is a leader in agricultural, construction, forestry, and turf-care machinery. Singh, a power-electronics engineer, has been working to replace the internal combustion engines used in the company’s equipment with hybrid (diesel-electric) and all-electric versions. “Power electronics and electrification of agricultural equipment can help change our world for the better by reducing the equipment’s greenhouse gas footprint, providing food and fiber to feed, house, and clothe the world, and helping farmers stay profitable,” Singh says. Singh grew up on a 10-hectare farm his family has owned for more than six centuries in Shahpur Charki, a 560-person village in the state of Uttar Pradesh, India. Brij Singh Employer: John Deere, Fargo, N.D. Title: External relationships manager for Australia, Canada, New Zealand, and the United States Education: Bachelor’s degree in electrical engineering, Mohan Malaviya Engineering College; master’s degree in engineering, Indian Institute of Technology Roorkee; Ph.D. in engineering, Indian Institute of Technology Delhi “I come from a long line of farmers. I personally know how important [farming] is,” he says. In 2007, he joined John Deere’s electronics-solutions group, in Fargo, N.D., as a staff engineer. Three years ago, he moved from his technical role to a more tactical role, taking on the newly created position of external relationships manager. He is responsible for securing government funding to carry out the company’s R&D work in Australia, Canada, New Zealand, and the United States. He also helps establish collaborations with academic research groups to work on emerging technologies that could be used to create new products. Singh enjoys the broader scope and added responsibility of his current job. “I’m now involved with deciding the kinds of vehicles to work on, technologies and components to design and test, and timelines,” the IEEE Fellow says. Transitioning to hybrid and all-electric machinery Earlier in his career, Singh helped Deere begin the transition away from diesel engines. As staff engineer from 2007 through 2011, he led, managed, and contributed to the design, development, and deployment of electrification technologies. Inverter technology that he developed has been used in John Deere’s 644K and 944K wheel loaders since 2012. Inverters allow a machine’s power train to run power between the electrical machines, acting like a generator or motor, and they convert electricity from AC to DC and back again. Wheel loaders have front and back booms and buckets that move soil, sand, rocks, and other materials. The 944K weighs more than 56 tonnes, and has a bucket capacity of up to 7.65 cubic meters. Watch this video of a 944K in action. John Deere 944K Hybrid Wheel Loader 360° Experience www.youtube.com During Singh’s time as a postdoctoral fellow at the École de Technologie Supérieure, at the University of Quebec, in Montreal, his research involved an indirect-current control technique to reduce harmonics created when different AC waveforms (voltages and frequencies) would create component-damaging heat; the system he developed kept the voltage free of harmonic distortion. Singh’s work is generally being used in non-Deere applications, such as a battery-charging system connected to distributed energy resources like solar, wind, and diesel generators. The benefits of electric industrial vehicles Moving from diesel to hybrid and all-electric industrial vehicles offers many benefits, Singh says. For the operator, the machines are significantly less noisy and easier to control. For the owner, the vehicles reduce costs because they have greater fuel efficiency and less tire wear, and they require fewer repairs. They also emit less greenhouse gasses, which is both a company goal and increasingly mandated by governments. Like the automotive industry’s move to hybrid and all-electric vehicles, the industrial-machine transition requires new designs, software, and materials to be developed and tested. That was Singh’s job when he joined the company’s advanced power-electronics department in 2011 as a senior staff engineer. He worked on high-efficiency electronics systems, including wide-bandgap power-conversion technologies for EV inverters. Semiconductor devices made with wide-bandgap materials such as silicon carbide (SiC) and gallium nitride (GaN) can operate at much higher voltages, temperatures, and frequencies than traditional silicon devices can. These materials allow components like inverters to be smaller and more energy efficient, Singh says. “Power electrics and electrification of agricultural equipment can help change our world for the better by reducing the equipment’s greenhouse gas footprint, and providing food and fiber to feed, house, and clothe the world.” To accelerate Deere’s electrification evolution, from 2015 through 2021, Singh and his group collaborated with researchers from the U.S. Department of Energy’s National Renewable Energy Laboratory to develop a 200-kilowatt, 1,050-volt silicon carbide inverter, which is now used in the 644K and the 944K. The collaboration with NREL led the company to receive funding through a U.S. government program to reduce greenhouse gas emissions. Singh says his current job of securing government funding and establishing relationships with university groups is necessary in research areas where the company lacks the expertise, time, and resources. “Government funding helps the company pursue research and innovation significantly sooner,” he says. “Without it, we might have to postpone our efforts another 5 to 10 years. With it, innovation is accelerated in developing and adopting new technologies.” Singh is still involved in developing new technologies as he continues to explore emerging tech and its application to farming and construction equipment as a John Deere Fellow. Becoming a power electronics expert Singh was the first in his family to go to college. He earned a bachelor’s degree in electrical engineering in 1989 from Mohan Malaviya Engineering College in Gorakhpur, India. (This institution became the Madan Mohan Malaviya University of Technology in 2013). He went on to earn a master’s degree in engineering in 1991 from the Indian Institute of Technology Roorkee, in Uttarakhand, and a Ph.D. in engineering in 1996 from the Indian Institute of Technology Delhi. This was followed by postdoc positions working on various aspects of power electronics, including power-quality control, and AC-to-DC and DC-to-DC converters for use in telecommunications products. Singh spent about two years as a postdoc at ETS Montreal and then a year as a research fellow at Concordia University, also in Montreal. In 2000, he became an assistant professor of electrical engineering and computer science at Tulane University, in New Orleans. There he was involved in R&D projects on power quality control converters and renewable energy systems. He taught courses in power electronics, microelectromechanical systems, and RF engineering. Advice for future power engineers There are many career opportunities for engineers who want to work on power electronics, Singh says. That includes working on solar and wind power, electric vehicles, industrial power, and consumer electronics. If you’re interested in learning about how to convert gasoline-powered vehicles to electric ones, Singh suggests taking at least one course in power systems to understand how EV power systems work. Also consider taking a power-electronics course and learning about power topologies, which are the various ways that power components may be interconnected, he says. To design semiconductor devices that use new materials like SiC and GaN, learn some materials science. Does Singh get to test-drive the vehicles he’s helping electrify? The answer is yes. “It’s incredibly rewarding to test-drive a machine that I’ve helped to develop,” he says. “It’s one thing to talk about how it will benefit customers, but it’s a whole other thing to experience the machine the way our construction workers get to. It’s one of the best aspects of my job.”","filter_flag":1}
{"title":"Wolfspeed to Sell RF Business to MACOM for $125 Million - Business Wire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwODIyMDcxNTA3L2VuL1dvbGZzcGVlZC10by1TZWxsLVJGLUJ1c2luZXNzLXRvLU1BQ09NLWZvci0xMjUtTWlsbGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwODIyMDcxNTA3L2VuL1dvbGZzcGVlZC10by1TZWxsLVJGLUJ1c2luZXNzLXRvLU1BQ09NLWZvci0xMjUtTWlsbGlvbtIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwODIyMDcxNTA3L2VuL1dvbGZzcGVlZC10by1TZWxsLVJGLUJ1c2luZXNzLXRvLU1BQ09NLWZvci0xMjUtTWlsbGlvbtIBAA","guidislink":false,"published":"Tue, 22 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwODIyMDcxNTA3L2VuL1dvbGZzcGVlZC10by1TZWxsLVJGLUJ1c2luZXNzLXRvLU1BQ09NLWZvci0xMjUtTWlsbGlvbtIBAA?oc=5\" target=\"_blank\">Wolfspeed to Sell RF Business to MACOM for $125 Million<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Wire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Wolfspeed to Sell RF Business to MACOM for $125 Million - Business Wire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwODIyMDcxNTA3L2VuL1dvbGZzcGVlZC10by1TZWxsLVJGLUJ1c2luZXNzLXRvLU1BQ09NLWZvci0xMjUtTWlsbGlvbtIBAA?oc=5\" target=\"_blank\">Wolfspeed to Sell RF Business to MACOM for $125 Million<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Wire<\/font>","source.href":"https:\/\/www.businesswire.com","source.title":"Business Wire","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"DURHAM, N.C.--(BUSINESS WIRE)--Wolfspeed, Inc. (NYSE: WOLF) today announced that Wolfspeed has entered into a definitive agreement to sell its radio frequency business (Wolfspeed RF) to MACOM Technology Solutions Holdings, Inc. (Nasdaq: MTSI) for approximately $75 million in cash, subject to a customary purchase price adjustment, and 711,528 shares of MACOM common stock, valued at $50 million based on the 30 trading day average for MACOM’s common stock through August 21, 2023. The company expects to close the transaction by the end of this year. “Given the significant growth we’ve seen in automotive, industrial and renewable energy markets, we believe this is the right time to further focus on scaling our Power device and materials businesses to meet this accelerated demand,” said Wolfspeed President and CEO Gregg Lowe. “This transaction also represents a tremendous opportunity for our RF team to grow and operate at scale, leveraging MACOM’s diverse customer base, RF engineering leadership and operational efficiencies.” Wolfspeed RF’s technology and innovation engine drives a strong product development pipeline, with deep domain expertise supporting a competitive gallium nitride (GaN) on silicon carbide product portfolio optimized for next generation telecommunications infrastructure, military and other commercial applications. Leveraging MACOM’s diverse customer base and operational expertise, Wolfspeed RF will be well positioned to continue to deliver industry leading products at scale. The transaction is subject to the expiration of the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 (“HSR”) and satisfaction of customary closing conditions. MACOM will assume control of Wolfspeed’s 100mm GaN wafer fabrication facility in Research Triangle Park, North Carolina (the “RTP Fab”) approximately two years following the closing of the transaction to accommodate Wolfspeed’s relocation of certain production equipment. Prior to such transfer, the shares of MACOM’s stock that Wolfspeed receives at closing will be subject to restrictions on transfer. In connection with the transaction, J.P. Morgan Securities LLC is acting as financial advisor and Smith Anderson LLP is acting as legal advisor to Wolfspeed. Business Outlook Based on the agreement to sell Wolfspeed RF, the operations of the RF business will be classified as discontinued operations. As a result, Wolfspeed is updating its guidance to reflect continuing operations only. For its first quarter of fiscal 2024, Wolfspeed targets revenue from continuing operations in a range of $185 million to $205 million. GAAP net loss from continuing operations is slightly improved from our August 16, 2023 business outlook, and is targeted at $138 million to $163 million, or $1.10 to $1.30 per diluted share. Non-GAAP net loss from continuing operations remains unchanged from our August 16, 2023 business outlook, and remains targeted at $75 million to $94 million, or $0.60 to $0.75 per diluted share. Targeted non-GAAP net loss from continuing operations excludes $63 million to $69 million of estimated expenses, net of tax, related to stock-based compensation expense, amortization of debt issuance costs, net of capitalized interest, project, transformation and transaction costs and loss on Wafer Supply Agreement. About Wolfspeed, Inc. Wolfspeed (NYSE: WOLF) leads the market in the worldwide adoption of silicon carbide and GaN technologies. We provide industry-leading solutions for efficient energy consumption and a sustainable future. Wolfspeed’s product families include silicon carbide and GaN materials, power devices and RF devices targeted for various applications such as electric vehicles, fast charging, 5G, renewable energy and storage, and aerospace and defense. We unleash the power of possibilities through hard work, collaboration and a passion for innovation. Learn more at www.wolfspeed.com. About MACOM Technology Solutions Holdings, Inc. MACOM (Nasdaq: MTSI) designs and manufactures high-performance semiconductor products for the Telecommunications, Industrial and Defense and Datacenter industries. MACOM services over 6,000 customers annually with a broad product portfolio that incorporates RF, Microwave, Analog and Mixed Signal and Optical semiconductor technologies. MACOM has achieved certification to the IATF16949 automotive standard, the ISO9001 international quality standard and the ISO14001 environmental management standard. MACOM operates facilities across the United States, Europe, Asia and is headquartered in Lowell, Massachusetts. To learn more visit www.macom.com. Non-GAAP Financial Measures This press release includes Wolfspeed’s business outlook on both a GAAP and a non-GAAP basis. The GAAP results include certain costs, charges and expenses that are excluded from non-GAAP results. By publishing the non-GAAP targets, management intends to provide investors with additional information to further analyze Wolfspeed’s performance, core results and underlying trends. Wolfspeed's management evaluates results and makes operating decisions using both the GAAP and non-GAAP measures included in this press release. Investors and potential investors are encouraged to review the reconciliation of non-GAAP targets to the most directly comparable GAAP targets attached to this press release. Forward Looking Statements This press release contains forward-looking statements involving risks and uncertainties, both known and unknown, that may cause Wolfspeed’s actual results to differ materially from those indicated in the forward-looking statements. Forward-looking statements by their nature address matters that are, to different degrees, uncertain, such as statements about the anticipated benefits of the transaction, including future financial and operating results. Actual results, including with respect to Wolfspeed’s ability to complete the transaction on time or at all, Wolfspeed’s realization of the value of MACOM’s stock received in connection with the transaction, the continued growth of Wolfspeed’s power products business, and Wolfspeed’s ability to achieve its targets for the first quarter of fiscal 2024 could differ materially due to a number of factors, including risks associated with divestiture transactions generally, including the inability to obtain, or the delay in obtaining, HSR clearance; fluctuations in the market price of MACOM’s common stock; the risk that a portion of the shares of MACOM common stock are forfeited by Wolfspeed in the event that the transfer of the RTP fab is not completed within four years following the closing date; issues, delays or complications in completing required carve-out activities to allow Wolfspeed RF to operate as part of MACOM after the closing, including incurring unanticipated costs to complete such activities; risks associated with integration or transition of the operations, systems and personnel of Wolfspeed RF, each, as applicable, within the term of the post-closing transition services agreement between MACOM and Wolfspeed; unfavorable reaction to the sale by customers, competitors, suppliers and employees; the risk that costs associated with the transaction will be greater than Wolfspeed expects; ongoing uncertainty in global economic and geopolitical conditions, including the ongoing military conflict between Russia and Ukraine, infrastructure development or customer or industrial demand that could negatively affect product demand, including as a result of an economic slowdown or recession, collectability of receivables and other related matters as consumers and businesses may defer purchases or payments, or default on payments; risks associated with Wolfspeed’s expansion plans, including design and construction delays and cost overruns, timing and amount of government incentives actually received, issues in installing and qualifying new equipment and ramping production, poor production process yields and quality control, and potential increases to Wolfspeed’s restructuring costs; the risk that Wolfspeed does not meet its production commitments to those customers who provide it with capacity reservation deposits or similar payments; the risk that Wolfspeed may experience production difficulties that preclude it from shipping sufficient quantities to meet customer orders or that result in higher production costs, lower yields and lower margins; Wolfspeed’s ability to lower costs; the risk that Wolfspeed’s results will suffer if it is unable to balance fluctuations in customer demand and capacity, including bringing on additional capacity on a timely basis to meet customer demand; the risk that longer manufacturing lead times may cause customers to fulfill their orders with a competitor's products instead; product mix; risks associated with the ramp-up of production of new products, and Wolfspeed’s entry into new business channels different from those in which it has historically operated; Wolfspeed’s ability to convert customer design-ins to sales of significant volume, and, if customer design-in activity does result in such sales, when such sales will ultimately occur and what the amount of such sales will be; the risk that the economic and political uncertainty caused by the tariffs imposed by the United States on Chinese goods, and corresponding Chinese tariffs and currency devaluation in response, may negatively impact demand for Wolfspeed’s products; the risk that Wolfspeed or its channel partners are not able to develop and expand customer bases and accurately anticipate demand from end customers, which can result in increased inventory and reduced orders as Wolfspeed experiences wide fluctuations in supply and demand; risks related to international sales and purchases; risks resulting from the concentration of business among few customers, including the risk that customers may reduce or cancel orders or fail to honor purchase commitments; the risk that Wolfspeed’s investments may experience periods of significant market value and interest rate volatility causing it to recognize fair value losses on its investment; the risk posed by managing an increasingly complex supply chain (including managing the impacts of ongoing supply constraints in the semiconductor industry and meeting purchase commitments under take-or-pay arrangements with certain suppliers) that has the ability to supply a sufficient quantity of raw materials, subsystems and finished products with the required specifications and quality; risks relating to the ongoing COVID-19 pandemic, including the risk of disruptions to Wolfspeed’s operations, supply chain, including our contract manufacturers, or customer demand; the risk Wolfspeed may be required to record a significant charge to earnings if its remaining goodwill or amortizable assets become impaired; risks relating to confidential information theft or misuse, including through cyber-attacks or cyber intrusion; Wolfspeed’s ability to complete development and commercialization of products under development; the rapid development of new technology and competing products that may impair demand or render Wolfspeed’s products obsolete; the potential lack of customer acceptance for Wolfspeed’s products; risks associated with ongoing litigation; the risk that customers do not maintain their favorable perception of Wolfspeed’s brand and products, resulting in lower demand for its products; the risk that Wolfspeed’s products fail to perform or fail to meet customer requirements or expectations, resulting in significant additional costs; risks associated with strategic transactions; and other factors discussed in Wolfspeed’s filings with the Securities and Exchange Commission (SEC), including Wolfspeed report on Form 10-K for the fiscal year ended June 26, 2022, and subsequent reports filed with the SEC. These forward-looking statements represent Wolfspeed's judgment as of the date of this release. Except as required under the U.S. federal securities laws and the rules and regulations of the SEC, Wolfspeed disclaims any intent or obligation to update any forward-looking statements after the date of this release, whether as a result of new information, future events, developments, changes in assumptions or otherwise. WOLFSPEED, INC. Business Outlook Unaudited GAAP to Non-GAAP Reconciliation Three Months Ended (in millions of U.S. Dollars) September 24, 2023 GAAP net loss from continuing operations outlook range ($163) to ($138) Adjustments: Stock-based compensation expense 18 Amortization of debt issuance costs, net of capitalized interest 8 Project, transformation and transaction costs 8 Loss on Wafer Supply Agreement 6 Total adjustments to GAAP net loss from continuing operations before provision for income taxes 40 Income tax adjustment 29 to 23 Non-GAAP net loss from continuing operations outlook range ($94) to ($75) Wolfspeed® is a registered trademark of Wolfspeed, Inc.","filter_flag":1}
{"title":"Is a circular economy approach right for your business? - Maddyness","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1hZGR5bmVzcy5jb20vdWsvMjAyMy8wOC8yMy9pcy1hLWNpcmN1bGFyLWVjb25vbXktYXBwcm9hY2gtcmlnaHQtZm9yLXlvdXItYnVzaW5lc3Mv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1hZGR5bmVzcy5jb20vdWsvMjAyMy8wOC8yMy9pcy1hLWNpcmN1bGFyLWVjb25vbXktYXBwcm9hY2gtcmlnaHQtZm9yLXlvdXItYnVzaW5lc3Mv0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3Lm1hZGR5bmVzcy5jb20vdWsvMjAyMy8wOC8yMy9pcy1hLWNpcmN1bGFyLWVjb25vbXktYXBwcm9hY2gtcmlnaHQtZm9yLXlvdXItYnVzaW5lc3Mv0gEA","guidislink":false,"published":"Wed, 23 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=235, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1hZGR5bmVzcy5jb20vdWsvMjAyMy8wOC8yMy9pcy1hLWNpcmN1bGFyLWVjb25vbXktYXBwcm9hY2gtcmlnaHQtZm9yLXlvdXItYnVzaW5lc3Mv0gEA?oc=5\" target=\"_blank\">Is a circular economy approach right for your business?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Maddyness<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Is a circular economy approach right for your business? - Maddyness","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Lm1hZGR5bmVzcy5jb20vdWsvMjAyMy8wOC8yMy9pcy1hLWNpcmN1bGFyLWVjb25vbXktYXBwcm9hY2gtcmlnaHQtZm9yLXlvdXItYnVzaW5lc3Mv0gEA?oc=5\" target=\"_blank\">Is a circular economy approach right for your business?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Maddyness<\/font>","source.href":"https:\/\/www.maddyness.com","source.title":"Maddyness","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Future-Proofing Against Regulation – Proactive sustainability helps future-proof businesses against potential carbon taxes, extended producer responsibility laws, or bans on certain hazardous materials. For example, IKEA is moving towards Mitigating Supply Chain Risks – Circular approaches like reuse and recycling make supply chains more resilient by decreasing dependence on virgin natural resources. This insulates companies from price shocks or supply disruptions. Recycling and Upcycling Create Value From Waste – Recapturing materials at end-of-life through recycling, or upcycling waste into higher value products, decreases waste disposal costs. It also provides a cost-advantaged source of secondary inputs. Reuse, Repair and Refurbishment Cut Costs – Reusing components, repairing products and refurbishing goods for resale allows companies to extract more value from materials and assets. This reduces the need for new raw material inputs, lowering materials costs. Refurbishment also enables selling into new secondary markets. Outdoor gear company Patagonia has operated a robust repair program for decades. Transitioning to a circular economy model can significantly reduce risks and costs for businesses in several key ways: For companies willing to rethink products, processes and partnerships, and be mindful of their growing trend towards conscious consumerism , the circular economy unlocks new opportunities for efficiency, sustainability and competitive advantage. While the transition can be challenging, the long-term benefits are substantial. There are many ways architects and related businesses can transition to a more circular mode l, including: working with more durable designs , reusing and refurbishing existing materials as well as a commitment to recycling goods, materials and products. Businesses will be aware of renewable energy options, resource recovery and innovative service offerings. The goal is to maximise product and material utilisation, extend lifespans and extract value at every point. A circular economic model represents a shift away from the traditional linear ‘take, make, waste’ model, which relies on large quantities of cheap, easily accessible materials and energy. Instead, a circular system aims to decouple economic growth from finite resource consumption. Recognising that consumers’ buying habits are changing Transitioning to a circular economy model can be a powerful way for businesses to enhance their reputation and build stronger customer relationships. With public concern rising over environmental and social issues, adopting sustainable practices helps meet consumer demand for ethical brands. By proactively communicating sustainability initiatives, businesses can boost brand trust and loyalty among today's eco-conscious consumers. As Matt Barker, Founder and CEO of MPB, observed, “Given increasing environmental concerns around overconsumption, alongside the rising pressure on household income, it's unsurprising that many of us are looking for alternatives to simply buying new, and it's brilliant to see that the perceived stigma around gifting and purchasing used items is declining.” Beyond customers, bringing circular principles to your supply chain also demonstrates a commitment to larger global goals around resource use and labour practices. Collaborating with vendors and suppliers on issues like circular agriculture and ethical working conditions shows shared values across your business ecosystem. Circular services like product-as-a-service leasing, rentals and take-back programs also foster closer customer relationships. These offerings provide regular touchpoints between company and consumer, creating a sense of community and encouraging reuse and retention. This loyalty can be invaluable in an increasingly competitive marketplace. Innovating products and lifespan-expanding services The circular economy opens up exciting opportunities for companies to innovate their offerings in impactful ways. By designing products and services to maximise lifespan and utilisation, businesses can find new value in underused assets. For example, creative design and business model choices allow products to be reused, remanufactured, shared or continuously upgraded instead of discarded. Exploring novel offerings like product-service systems, rentals, resale and take-back programmes can generate competitive differentiation and new revenue streams. These innovations also unlock savings and sustainability benefits. Durability, modularity and recyclability allow assets to circulate in loops rather than be tossed in landfills. Waste from one process can become feedstock for creating new products and materials. Transitioning to circular systems inspires new ways of thinking about resources, capabilities and customer needs. It pushes companies to stretch their creativity and find unexpected solutions. In the process, they strengthen resilience, reduce costs and provide society with much-needed alternatives to our wasteful linear economy. The circular economy empowers businesses to become innovators and disruptors. By bravely moving beyond business-as-usual, companies can develop truly differentiated and impactful products, services and processes. This sparks a virtuous cycle – circularity enabling innovation enabling competitiveness and leadership. Realising revenue and profit through circularity The circular economy opens up innovative ways for companies to boost revenues and profitability through creative use of underutilised assets and capabilities. Rather than automatically discarding waste and by-products, circular thinking sees these streams as potential inputs for creating valuable new products, materials, or services. With the right design and marketing, trash can be turned into cash by unlocking hidden value. Expanding offerings like repairs, maintenance, upgrades and remanufacturing also provide new income streams while prolonging existing product lifespans. These services may require additional tools, replacement parts or consumables that can drive incremental sales. Remanufactured and refurbished goods present an opportunity to target new demographics and geographies at more accessible price points. By selling quality products to markets that couldn't otherwise afford them, businesses can dramatically expand their addressable market. Winning circular models: a draw for skilled employees Transitioning to a circular economy model can be a powerful talent magnet for businesses. With increasing focus on ethics and sustainability among younger demographics, circularity helps attract and retain sought-after employees. Studies show that purpose is a top factor in the modern workforce. For example, a report by PricewaterhouseCoopers, suggests 88% of millennials will only want to work for companies with values they share. Companies with an authentic brand purpose tied to environmentalism often become talent destinations. Adopting circular practices signals commitment to larger societal goals that resonate across generations. On the retention side, integrating sustainability across operations shows employees that their values are shared by the company. This drives engagement and satisfaction. There are also opportunities to incorporate circular economy education into corporate training and leadership development programs. This builds critical knowledge while empowering employees to participate in green initiatives. Is it time to adopt circularity in your business? The circular economy offers numerous benefits that strengthen and future-proof businesses, from cost savings to innovation to talent acquisition. By taking a holistic, systems-thinking approach, companies can redesign processes, products, and partnerships to eliminate waste and protect resources. While the transition requires effort, a circular model allows organisations to meet sustainability goals while gaining durability, agility and competitive advantage. Dakota Murphey is a freelance writer based in the UK. She has more than 15 years' experience creating engaging and original content for a number of authoritative sites. Dakota covers topics ranging from sustainability, travel and photography to business development, digital marketing and cybersecurity\/AI.","filter_flag":1}
{"title":"Bosch sells new propane heat pumps with PV packages - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIyL2Jvc2NoLXNlbGxzLW5ldy1wcm9wYW5lLWhlYXQtcHVtcHMtd2l0aC1wdi1wYWNrYWdlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIyL2Jvc2NoLXNlbGxzLW5ldy1wcm9wYW5lLWhlYXQtcHVtcHMtd2l0aC1wdi1wYWNrYWdlcy_SAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIyL2Jvc2NoLXNlbGxzLW5ldy1wcm9wYW5lLWhlYXQtcHVtcHMtd2l0aC1wdi1wYWNrYWdlcy_SAQA","guidislink":false,"published":"Tue, 22 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIyL2Jvc2NoLXNlbGxzLW5ldy1wcm9wYW5lLWhlYXQtcHVtcHMtd2l0aC1wdi1wYWNrYWdlcy_SAQA?oc=5\" target=\"_blank\">Bosch sells new propane heat pumps with PV packages<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bosch sells new propane heat pumps with PV packages - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIyL2Jvc2NoLXNlbGxzLW5ldy1wcm9wYW5lLWhlYXQtcHVtcHMtd2l0aC1wdi1wYWNrYWdlcy_SAQA?oc=5\" target=\"_blank\">Bosch sells new propane heat pumps with PV packages<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Bosch Home Comfort Group, a unit of German industrial conglomerate Robert Bosch GmbH, recently launched a new air-water heat pump series for residential applications. The series consists of the Compress 5800i AW and Compress 6800i AW heat pumps, which both use propane (R290) as the refrigerant. “The use of R290 requires to implement additional components in regards to safety, due to refrigerant flammability, which are not needed in case of F-Gas refrigerant,” a spokesperson from the company told pv magazine. “On the other hand, the R290 refrigerant is not affected by F-Gas regulation and therefore more affordable.” The manufacturer is offering the new heat pumps with supplementing PV packages. “Especially in the DACH markets heat pump sales are increasingly combined with PV systems,” the spokesperson went on to say. “Bosch Home Comfort is also offering a power meter\/sensor enabling the Bosch heat pumps to work with any existing PV system and battery storage solution at home.” The Compress 5800i AW heat pump is available in five versions with a rated power of 3.9 kW to 6-7 kW and has a maximum flow temperature of 60 C. It also features an integrated 180 L domestic hot water storage tank and a 16 L buffer storage tank. Furthermore, this product has 3-way switching valve for the generation of domestic hot water, and a footprint of 0.36 m², which the company said makes it ideal for use in new buildings. The wall-mounted version has a height of 71 cm. Popular content The Compress 6800i AW heat pump is also sold in five versions with a rated power of 3.9 kW to 6.7 kW and has a maximum flow temperature of 75 C. It features two heating circuits and an integrated 70 L buffer storage tank concept with a height of 1.2 m, which the company said is ideal for refurbished and new buildings. Both products measure 600 mm x 600 mm x 1,787 mm and have a weight of 156 kg. They are sound-optimized from the ground up thanks to integrated sound diffusers. The manufacturer claims the new products are among the quietest heat pumps in their class. “The Compress 5800i AW and Compress 6800i AW are compatible with energy management ready from Q4 2023 onwards,” the spokesperson explained. “The energy management itself must be purchased separately via a one-time license fee that optimizes your energy system and results in saved extra energy costs year by year.” Bosch Home Comfort is currently selling the new heat pumps in Germany, Austria, Switzerland, and Luxemburg. “In September we will offer the heat pump in France, Netherlands, Denmark, United Kingdom, Ireland, and Poland,” the spokesperson said. “In November, we will also bring them to Italy and next year we will launch them in further European markets.”","filter_flag":1}
{"title":"GE Vernova, ORE Catapult to create new programme - reNEWS","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vcmVuZXdzLmJpei84NzM4NC9nZS12ZXJub3ZhLW9yZS1jYXRhcHVsdC10by1jcmVhdGUtbmV3LXByb2dyYW1tZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vcmVuZXdzLmJpei84NzM4NC9nZS12ZXJub3ZhLW9yZS1jYXRhcHVsdC10by1jcmVhdGUtbmV3LXByb2dyYW1tZS_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vcmVuZXdzLmJpei84NzM4NC9nZS12ZXJub3ZhLW9yZS1jYXRhcHVsdC10by1jcmVhdGUtbmV3LXByb2dyYW1tZS_SAQA","guidislink":false,"published":"Mon, 07 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=219, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vcmVuZXdzLmJpei84NzM4NC9nZS12ZXJub3ZhLW9yZS1jYXRhcHVsdC10by1jcmVhdGUtbmV3LXByb2dyYW1tZS_SAQA?oc=5\" target=\"_blank\">GE Vernova, ORE Catapult to create new programme<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">reNEWS<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"GE Vernova, ORE Catapult to create new programme - reNEWS","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vcmVuZXdzLmJpei84NzM4NC9nZS12ZXJub3ZhLW9yZS1jYXRhcHVsdC10by1jcmVhdGUtbmV3LXByb2dyYW1tZS_SAQA?oc=5\" target=\"_blank\">GE Vernova, ORE Catapult to create new programme<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">reNEWS<\/font>","source.href":"https:\/\/renews.biz","source.title":"reNEWS","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The collaboration will build on the success of their previous Stay Ashore research The Offshore Renewable Energy (ORE) Catapult and GE Vernova’s Offshore Wind business have announced the signing of a new research collaboration, building on the success of their previous Stay Ashore programme. The £4m agreement paves the way for a multi-year collaboration between GE Vernova and ORE Catapult to create a dedicated research programme. This aims to help drive down the Levelised Cost of Energy (LCOE) for the global offshore wind market with reliable, enhanced, sustainable, and demonstrated technologies. The partnership will focus on enhancing turbine performance and improved operations and maintenance through smart technological solutions. The previous programme Stay Ashore provided UK businesses, from micro-SMEs to large companies, with the opportunity to collaborate and develop products and services aimed at extending the life of offshore wind components. It focussed on delivering solutions for wind turbine digital twins and used data analytics to inform turbine operations and maintenance. The real-time data from over 70 operational wind turbines, together with virtual physics-based models for the turbine, were used to generate a cloud based digital twin, covering models for a multitude of wind turbine components and systems. From robotic crawlers and new drone and sensor technologies, to cutting edge digital analysis tools, the Stay Ashore programme supported UK SMEs in the development of further new products and services which have subsequently leveraged nearly £2m in funding and\/or investment. Moving forward, this new agreement will focus on some of the biggest challenges facing the industry in the future large-scale deployment of offshore wind and use applied research to enable the development of key innovations. Andrew Jamieson, chief executive of the Offshore Renewable Energy (ORE) Catapult, said: \"This new collaboration is a hugely exciting development for the sector and will allow us to build on the fantastic work we have already seen come through the previous research programme carried out with our colleagues at GE Vernova. \"By combining knowledge and research capabilities in this way, we can help innovative UK companies to develop some of the cutting-edge technological solutions that can help them support the continued growth of the UK offshore wind sector, while also opening up opportunities to export their skills and services to new global markets.\" Vincent Schellings, chief technology officer of GE Vernova’s offshore wind business, added: \"We are pleased to be able to build on our collaboration with ORE Catapult. \"They are an important partner in helping us to understand how we can use innovation to continue to make offshore wind as efficient, reliable, and sustainable as possible, both in the UK and globally.\"","filter_flag":1}
{"title":"How Sustainable Is Shein? Child Labor Practices, Working Conditions, and More - Brightly","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vYnJpZ2h0bHkuZWNvL2Jsb2cvc2hlaW4tc3VzdGFpbmFiaWxpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vYnJpZ2h0bHkuZWNvL2Jsb2cvc2hlaW4tc3VzdGFpbmFiaWxpdHnSAQA?oc=5","id":"CBMiLmh0dHBzOi8vYnJpZ2h0bHkuZWNvL2Jsb2cvc2hlaW4tc3VzdGFpbmFiaWxpdHnSAQA","guidislink":false,"published":"Wed, 02 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=214, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vYnJpZ2h0bHkuZWNvL2Jsb2cvc2hlaW4tc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">How Sustainable Is Shein? Child Labor Practices, Working Conditions, and More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Brightly<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Sustainable Is Shein? Child Labor Practices, Working Conditions, and More - Brightly","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vYnJpZ2h0bHkuZWNvL2Jsb2cvc2hlaW4tc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">How Sustainable Is Shein? Child Labor Practices, Working Conditions, and More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Brightly<\/font>","source.href":"https:\/\/brightly.eco","source.title":"Brightly","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"In October 2022, an undercover investigation from Channel 4 and The i newspaper in the UK revealed Shein workers work seven days a week, some getting a base salary of only $556 per month to make 500 pieces of clothing per day. In total, that equates to earning two cents per item of clothing produced. At some factories, female employees washed their hair over their lunch break due to having no time to do so after their 18-hour-long work days In June 2022, videos went viral on social media claiming that Shein employees were hiding messages in the clothes they produced. One such tag allegedly had \"need your help\" written within the care instructions. Shein responded to these claims in a TikTok video of its own, stating it's all a big misunderstanding and that it has a \"strict code of conduct for supplies, which forbids them to use forced labor.\"","filter_flag":1}
{"title":"Aether Raises $49M to Extract Critical Minerals and Create Next-Generation Materials - WebWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LndlYndpcmUuY29tL1ZpZXdQcmVzc1JlbC5hc3A_YUlkPTMwOTU5NdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LndlYndpcmUuY29tL1ZpZXdQcmVzc1JlbC5hc3A_YUlkPTMwOTU5NdIBAA?oc=5","id":"CBMiM2h0dHBzOi8vd3d3LndlYndpcmUuY29tL1ZpZXdQcmVzc1JlbC5hc3A_YUlkPTMwOTU5NdIBAA","guidislink":false,"published":"Wed, 16 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LndlYndpcmUuY29tL1ZpZXdQcmVzc1JlbC5hc3A_YUlkPTMwOTU5NdIBAA?oc=5\" target=\"_blank\">Aether Raises $49M to Extract Critical Minerals and Create Next-Generation Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WebWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Aether Raises $49M to Extract Critical Minerals and Create Next-Generation Materials - WebWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LndlYndpcmUuY29tL1ZpZXdQcmVzc1JlbC5hc3A_YUlkPTMwOTU5NdIBAA?oc=5\" target=\"_blank\">Aether Raises $49M to Extract Critical Minerals and Create Next-Generation Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WebWire<\/font>","source.href":"https:\/\/www.webwire.com","source.title":"WebWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Aether today announced a $49 million Series A led by Jay Zaveri at Natural Capital and Trevor Zimmerman at Unless to power the next industrial revolution by helping extract rare metals and create new materials, leading to a more resource-efficient and sustainable future. The funding will be used to scale its platform and grow the company\u0092s engineering, machine learning, and hardware teams. \u0093Nature invented nanoscale machinery called proteins that can move and rearrange atoms. At Aether, we\u0092re engineering these proteins to go beyond what nature intended to assemble new classes of molecules, transforming proteins into generalized molecular assemblers. Applications range from critical mineral extraction to the assembly of novel classes of materials with unprecedented properties,\u0094 said Pavle Jeremic, CEO and founder of Aether. \u0093In the long term, these assemblers will enable the construction of effectively any product at extremely low costs.\u0094 How does Aether\u0092s Molecular Assembler Platform work? The platform combines high-throughput robotics, machine learning, and synthetic biology to map millions of enzyme-reaction combinations. By generating unprecedented amounts of experimental data, the platform is able to engineer entirely new classes of nanoscale machines using protein building blocks called molecular assemblers. These molecular assemblers contain the power and sophistication of gigantic chemical factories, but on the scale of nanometers. \u0093Aether\u0092s revolutionary platform builds upon nature\u0092s machinery to deliver solutions that are cheaper, faster, and greener than any current technology or process on the market,\u0094 said Trevor Zimmerman, co-founder and managing partner at Unless. \u0093Current enzyme technologies are limited to catalyzing natural-like reactions while Aether\u0092s enzyme application space is far greater \u0096 unlocking enzymatic pathways to high-value chemicals that don\u0092t have a natural pathway. For example, lithium complexation.\u0094 How does the platform create new materials? These assemblers can synthesize new products with greater strength, flexibility, and chemical resistance. An example use case is in the defense industry, where Aether\u0092s novel materials can dramatically increase the effectiveness and elasticity of ballistic materials, such as Kevlar-like products. Another example is combining the materials with industrial plastics like PEEK to improve processability, strength, and flexibility. How does the platform extract metals? While Aether\u0092s assemblers can be used to create new molecules, they can also be used to extract molecules, such as metals. To do so, Aether\u0092s molecular assemblers are introduced to a brine where they bond only to specified metal atoms, regardless of the concentration. From there, Aether programs these assemblers to release the element into a new solution \u0096 one that is now highly concentrated with atoms of the specified element and void of other contaminants and unwanted materials. The company\u0092s initial emphasis is on lithium, with plans to extract additional metals in the future, such as rare earth metals, titanium, and other critical minerals. Aether\u0092s extraction process also eliminates the need for costly infrastructure that takes years to build, relying instead on portable, modular, shipping containers where the extraction and refinery occurs. With Aether, equipment can be deployed at unprecedented speeds while providing the unique ability to extract metals from previously inaccessible target metal reserves. \u0093Using machine learning with a real-time lab engine built into the training loop, Aether discovers novel enzymes and peptides that can functionally and effectively do many things - including the extraction of metals like lithium from brines and building flexible Kevlar-like material,\u0094 said Jay Zaveri, founder of Natural Capital and partner at Social Capital. \u0093Aether is the future of manufacturing where things that were not thought possible with chemical engineering are now possible through the engineering of new classes of enzymes that do specific work with lower energy needs, cleaner processes, and fast scalable systems.\u0094 Sustaining a Lithium-Powered Future The world possesses enough lithium to meet increasing demand, however, current mining and extraction practices impede access to these reserves. As a result, the International Energy Agency warns of potential global lithium shortages by 2025, driven by the surging demand for lithium in renewable energy systems and electric vehicle batteries. Current extraction techniques, including open-pit mining or evaporation ponds, require lithium concentration to be high enough for extraction to be commercially viable \u0096 while also requiring vast amounts of land and water. By utilizing its molecular assemblers, Aether can extract lithium from previously untapped sources \u0096 increasing domestic production by 30x. Additionally, because this process takes place via a closed-loop system without the use of harsh chemicals, virtually any water used in the process can be safely returned to the source, requiring 50,000x less water than evaporative methods used in South America\u0092s so-called Lithium Triangle. Aether will initially focus its lithium extraction efforts in the southern, middle portions of the United States, including Oklahoma and Arkansas, where subterranean lithium exists in sizable amounts but at lower concentrations. Texas and Oklahoma will also be key areas of focus given the company\u0092s unique ability to extract lithium from oil and gas wastewater byproducts, as well as capped oil wells. About Aether Aether is building nanoscale machinery that can assemble new classes of molecules from organic and metallic atoms. By mapping out millions of enzyme reactions, Aether utilizes new industrial processes, enabling faster development cycles, lower costs, and unprecedented materials advancements. Aether\u0092s approach also addresses the global demand for critical metals such as lithium by utilizing biologically-inspired molecular assemblers that can extract battery-grade lithium at a lower concentration, contributing to a greener, electrified future. Aether is dedicated to unleashing the full potential of Earth\u0092s materials and ushering in a future of abundance. To learn more about Aether, visit: www.aetherbio.com","filter_flag":1}
{"title":"Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico - The Weekly Journal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5","id":"CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA","guidislink":false,"published":"Wed, 16 Aug 2023 13:47:39 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=13, tm_min=47, tm_sec=39, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Weekly Journal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico - The Weekly Journal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50aGV3ZWVrbHlqb3VybmFsLmNvbS90b3Atc3Rvcmllcy9jaGFydGluZy1lY29ub21pYy1zdWNjZXNzLWEtY29tcGFyYXRpdmUtZXhwbG9yYXRpb24tb2YtbmV3LXplYWxhbmQtYW5kLXB1ZXJ0by1yaWNvL2FydGljbGVfZjE2YmM5ZjAtM2FiMy0xMWVlLTk2MGYtOGYxMGI4ODUyNzU4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Charting Economic Success: A Comparative Exploration of New Zealand and Puerto Rico<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Weekly Journal<\/font>","source.href":"https:\/\/www.theweeklyjournal.com","source.title":"The Weekly Journal","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Overview of New Zealand Puerto Rico must aspire to become one of the most competitive territories in the world and to do so, we must compare ourselves with one of the most competitive nations in the world that, like us, had incredible challenges before embarking on a new path to greatness. The trajectories of New Zealand and Puerto Rico toward becoming competitive nations may be quite similar; we shall highlight the strategies that propelled New Zealand's economic growth and draw comparisons to Puerto Rico's challenges. By examining New Zealand's success and identifying relevant lessons, we plan to present a comprehensive action plan for Puerto Rico to enhance its economic growth and competitiveness. New Zealand's has a GDP of $250 billion with a Per Capita income of $46,420, a total population of 5,122,600 million and a total area of 103,798.93 Square miles or 31 times larger than Puerto Rico. New Zealand's journey to becoming one of the world's most competitive nations was characterized by a combination of strategic policies, progressive reforms and a commitment to innovation. The following sections detail the key aspects that contributed to New Zealand's high rankings in competitiveness and provide a deeper understanding of how these strategies were implemented: 1. Diversification of the Economy: New Zealand recognized the limitations of relying solely on its traditional agricultural exports. To achieve economic diversification, they implemented: • Investment in Research and Development (R&D): The government-funded R&D initiatives across various sectors, including technology, healthcare, and agriculture. This initiative leads to the development of new products and services with global market potential. • Innovation Hubs: The creation of innovation hubs and research centers encouraged collaboration between academia, industry, and startups, fostering a culture of innovation. 12 Lessons Puerto Rico Must Learn Before it Emerges from Bankruptcy The secret to embracing change is to focus on building a new future. 2. Trade Liberalization: Engaging in global trade agreements and reducing trade barriers opened up new avenues for economic growth: • Closer Economic Relations (CER) Agreement: The CER agreement with Australia established a free trade area, facilitating the movement of goods, services and people between the two countries. • Diverse Trade Partnerships: New Zealand actively pursued trade agreements with various regions, including Asia-Pacific and Europe, expanding its export markets. 3. Skilled Workforce: Investments in education and training played a crucial role in nurturing a skilled workforce: • Education Reforms: Continuous improvements in the education system aligned curriculum with industry needs, emphasizing STEM subjects, technical education and vocational training. • International Education: Attracting international students enhanced cultural exchange and contributed to the Economy by generating revenue from tuition fees. 4. Regulatory Reforms: New Zealand's efforts to create a favorable business environment were instrumental in attracting investments: • Ease of Doing Business: Streamlined regulatory processes, reduced bureaucratic hurdles, and simplified procedures for starting and operating businesses. • Investment Incentives: The government offered incentives to attract foreign direct investment, such as tax breaks, grants, and support for establishing new ventures. 5. Sustainable Practices: Embracing sustainability and environmental practices contributed to New Zealand's competitiveness: • Clean Energy Transition: Investments in renewable energy sources like hydroelectric, wind, and geothermal power ensured a reliable and sustainable energy supply. • Agricultural Innovation: The agriculture sector adopted sustainable farming practices, organic farming, and value-added products, catering to global demand for ethically produced goods. 6. Quality of Life and Work-Life Balance: New Zealand's emphasis on quality of life and work-life balance was an attractive feature for both skilled professionals and investors: • Natural Beauty and Lifestyle: The country's stunning landscapes, outdoor recreational opportunities, and safe environment contributed to a high quality of life. • Flexible Work Policies: Promoting flexible work arrangements and remote work options further enhanced the appeal for locals and expatriates. 7. Strong Governance and Political Stability: Effective governance and political stability fostered an environment conducive to economic growth: • Transparency and Accountability: Clear regulatory frameworks, corruption-free governance, and efficient public administration contributed to a stable business environment. • Socio-Political Stability: Political consensus, social cohesion, and a strong rule of law provided a foundation for long-term planning and development. In summary, New Zealand's journey to becoming one of the world's most competitive nations was guided by a comprehensive approach that combined economic diversification, innovation, education, favorable regulations, sustainability, and quality of life considerations. These strategies, backed by effective governance and political stability, created an environment where businesses could thrive, investments could flow, and human capital could be developed to its full potential. It is this holistic approach that Puerto Rico could learn from and adapt to its unique context to enhance its economic growth and global competitiveness. Overview of Puerto Rico and Action Plan Puerto Rico, has a GDP of $106.5 billion 42.6% less than New Zealand with a Per Capita income of $22,419 a 48.29% less, a total population of 3,111,874 million a 60.7% less, and a total area of 3,360.5 Square miles or 31 smaller than Puerto Rico. Below we outlined in the plan of action for Puerto Rico, building upon the lessons from New Zealand's success: 1. Economic Diversification: Encouraging economic diversification involves moving away from over-reliance on a limited number of industries such as manufacturing and promoting the growth of new sectors. Puerto Rico can achieve this by: Commercial real estate with a global outlook In order to learn about the needs of commercial real estate investors and the opportunities … • Identifying Emerging Industries: Conduct thorough market research to identify industries with growth potential, such as renewable energy, technology startups, biotechnology, and sustainable agriculture. • Incentivizing Investment: Offer tax incentives, grants, and subsidies to attract local and foreign investors to these emerging sectors, fostering innovation and job creation. • Supporting Startups: Establish incubators and accelerators that provide resources, mentorship, and funding for startups in emerging industries. • Creating areas in all 78 cities with automatic permits for a wide range of businesses will convert Puerto Rico into an island with ease of doing business and will triplicate the number of new enterprises island wide. 2. Education and Workforce Development: Developing a skilled and competitive workforce is crucial for sustainable economic growth. To address the brain drain issue and retain local talent: • Revamping Education: Invest in modernizing and enhancing the education system to align with the needs of emerging industries. STEM Education must become our mantra, promoting science, technology, engineering and mathematics. • Vocational Training: Enhance and Create vocational training programs that equip individuals with practical skills in demand by industries such as manufacturing, technology and renewable energy. • Higher Education Collaboration: Forge partnerships between local universities and industries to ensure that education is aligned with current and future workforce requirements. 3. Trade Agreements: Active engagement in trade agreements can expand Puerto Rico's market access and enhance economic growth: • Regional Partnerships: Seek participation in regional trade agreements, such as the Caribbean Community (CARICOM), Central American Integration System (SICA) Dominican Republic-Central America FTA (CAFTA-DR) and Mercosur among others to access larger markets for goods and services. • Global Trade Agreements: Explore opportunities to join global trade agreements, such as the United States-Mexico-Canada Agreement (USMCA), the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) or bilateral trade agreements with key trading partners. • Export Promotion: Empower the trade promotion agencies with incentives, grants, automatic designation to assist local businesses in entering international markets and navigating trade regulations. 4. Fiscal Management and Governance: While the Financial Oversight and Management Board reviews all financial decisions, we must create rigorous financial implementation once Puerto Rico emerges from Bankruptcy. Addressing fiscal challenges and improving governance are essential for creating a conducive environment for economic growth: • Debt Limitation Legislation: Enact legislation that sets clear limits on the amount of debt the Government can incur, both in absolute terms and as a percentage of the GDP. These limits can be based on Puerto Rico's ability to service the debt without compromising essential services. • Transparency and Accountability: Enhance transparency in government operations, budget allocation, and public procurement to build trust and attract investments. • Multiyear budgeting with Long Term Planning: Develop comprehensive multiyear budgeting that includes long-term projections of revenues and expenses. This approach promotes better planning, reduces short-term decision-making, and aids in identifying potential budget gaps. • Structural Reforms: We must transform the Government by doing away with unneeded agencies, services, and bureaucracy, creating a more spartan nimbler government. It will also significantly reduce the revenue-to-expense ratio. • Efficiency Measures: Implement cost-saving measures across government agencies to allocate resources effectively and direct funds toward strategic initiatives. 5. Infrastructure Investment: Improving infrastructure is a critical enabler of economic competitiveness: • Transportation Modernization: Upgrade transportation networks, including roads, ports, and airports and convert the “Tren Urbano” into a real solution for mass transit to enhance connectivity and facilitate the movement of goods and people. • Renewable Energy Development: Invest in renewable energy infrastructure to reduce energy costs, enhance sustainability, and attract energy-intensive industries. • Digital Connectivity: Expand access to high-speed internet across the island to support digital industries and remote work opportunities. In summary, Puerto Rico has the potential to enhance its economic growth and competitiveness by drawing lessons from New Zealand's success and implementing a comprehensive plan of action. By diversifying the economy, investing in education and workforce development, engaging in trade agreements, addressing fiscal challenges, and improving infrastructure, Puerto Rico can transform its economic landscape and create a more resilient and prosperous future for its citizens. Maurice Mctigue and The New Zealand Miracle Maurice McTigue played a pivotal role in the economic reforms that contributed to what is often referred to as the \"New Zealand Miracle\". He was vital in implementing policies transforming New Zealand's economy and government operations during the 1980s and 1990s. Some of his notable contributions include economic deregulation, state-owned enterprise reforms and privatization, fiscal responsibility, public sector reforms, local government empowerment, government streamlining and export-oriented growth. Maurice McTigue's contributions were rooted in the belief that empowering individuals, businesses, and local communities while minimizing government intervention could lead to sustainable economic growth. The lessons from McTigue's work highlight the potential for other economies, including Puerto Rico, to achieve similar transformations by adopting policies encouraging market-driven growth, fiscal responsibility, efficient governance and an open business environment. Are our political leaders ready to accomplish such a transformation? The importance in policy development is knowing first if the current policies work or whether different activities would produce better results. The critical requirement is identifying the public benefit sought and then seeking proof that the recent actions beneficially impact that outcome. Absent this proof, every decision taken may be described as \"Anchored in philosophical beliefs.\" \"The canvas of Puerto Rico's future is painted stroke by stroke with the brush of today's pivotal choices; each decision serves as a color that could define whether our work is a masterpiece or a failure; the future is in our hands.\"","filter_flag":1}
{"title":"Energy and emissions landscape of the forest sector - Pulp & Paper Canada","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnB1bHBhbmRwYXBlcmNhbmFkYS5jb20vZW5lcmd5LWFuZC1lbWlzc2lvbnMtbGFuZHNjYXBlLW9mLXRoZS1mb3Jlc3Qtc2VjdG9yL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnB1bHBhbmRwYXBlcmNhbmFkYS5jb20vZW5lcmd5LWFuZC1lbWlzc2lvbnMtbGFuZHNjYXBlLW9mLXRoZS1mb3Jlc3Qtc2VjdG9yL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LnB1bHBhbmRwYXBlcmNhbmFkYS5jb20vZW5lcmd5LWFuZC1lbWlzc2lvbnMtbGFuZHNjYXBlLW9mLXRoZS1mb3Jlc3Qtc2VjdG9yL9IBAA","guidislink":false,"published":"Mon, 21 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=233, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnB1bHBhbmRwYXBlcmNhbmFkYS5jb20vZW5lcmd5LWFuZC1lbWlzc2lvbnMtbGFuZHNjYXBlLW9mLXRoZS1mb3Jlc3Qtc2VjdG9yL9IBAA?oc=5\" target=\"_blank\">Energy and emissions landscape of the forest sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pulp & Paper Canada<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Energy and emissions landscape of the forest sector - Pulp & Paper Canada","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnB1bHBhbmRwYXBlcmNhbmFkYS5jb20vZW5lcmd5LWFuZC1lbWlzc2lvbnMtbGFuZHNjYXBlLW9mLXRoZS1mb3Jlc3Qtc2VjdG9yL9IBAA?oc=5\" target=\"_blank\">Energy and emissions landscape of the forest sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pulp & Paper Canada<\/font>","source.href":"https:\/\/www.pulpandpapercanada.com","source.title":"Pulp & Paper Canada","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Canada’s Net-Zero by 2050 commitment will require comprehensive action across all industrial sectors to curb greenhouse gas (GHG) emissions. The Canadian forest sector took early actions in this direction, successfully reducing its GHG emissions by nearly 70 percent since the early 1990s. Achieving this milestone has involved enhancing energy efficiency and transitioning from fossil fuels to bioenergy by utilizing wood processing residues. Additional efforts are now needed to effectively meet Canada’s GHG reduction targets. While it is technically feasible to fully realize the potential of the forest sector to reach net-zero, or even net-negative emissions, substantial investments in technical and capital resources are indispensable to implement cutting-edge energy-efficient technologies, electrification, bioenergy and carbon capture. Context With energy consumption of approximately 600 PJ\/year, the manufacturing facilities of the forest sector use more energy than any other major Canadian manufacturing sector, including the iron and steel, cement, oil refineries and petrochemical sectors. However, this sector is unique in that a large part of its energy needs is met by renewable energy. Biomass-based fuels have enabled the industry to reduce its reliance on fossil fuels, helping to lower its net GHG emissions considerably. Energy assessment and mapping Evaluation of fuel consumption across major steps of the forest sector, from forest harvesting to transportation of finished products (Figure 1), has been performed to define the energy profile of the Canadian forest value chain. Data on energy usage and GHG emissions are available through public databases such as the National Energy Use Database launched by Natural Resources Canada in 1991, Canada’s National Inventory Report, and GHG Reporting Program led by Environment and Climate Change Canada. Since these databases focus on energy and GHG data for the pulp and paper sector, information for upstream and downstream operations is less defined. Specific attention was given to estimating diesel consumption. Advertisement The results illustrate that energy sources – fossil fuels, bioenergy, electricity – are not equally distributed along the forest value chain. Most of the energy is consumed in wood product manufacturing and pulp and paper mills (20 percent of the energy from fossil fuels, 25 percent as electricity and 55 percent from bioenergy). Mills also produce 8950 GWh per year of renewable electricity, of which over 60 percent is coming from cogeneration. Diesel fuel is used for harvesting operations and transportation of logs and wood chips to pulp mills, and shipping final products carried out by truck or rail transport. Natural gas is the most common fossil fuel in manufacturing facilities, mostly supplied to boilers, lime kilns and internal combustion dryers. Diesel consumption, on the other hand, in sawmills, wood product manufacturing, forest harvesting, wood and product transportation is estimated to be approximately 80 PJ\/y or 2.1 BL\/y of diesel. Diesel in these processes is used in heavy machinery and is heavily impacted by carbon policies such as Clean Fuel Regulations and the carbon fuel charge. Emissions landscape GHGs emitted from fossil fuels are generally considered to be the primary driver of anthropogenic climate change and are the focus of most carbon reduction policies. Emissions from biogenic sources, however, are considered carbon neutral within the accounting standard put forward by the International Panel on Climate Change. When biomass comes from residual materials generated by sustainable forestry, the biogenic emissions released from its combustion are offset by CO 2 captured by forests, with a carbon debt. In that framework, long-term storage of biogenic CO 2 is considered a negative emission. The distribution of energy sources translates to a similar distribution of carbon dioxide equivalent (CO 2 e) emissions generated along the forest value chain. In 2020, 10.1 million tonnes (Mt) of fossil fuel-based GHG emissions were produced (excluding final product transportation), with around 54 percent (5.5 Mt CO 2 e) originating from stationary sources within pulp and paper facilities. The production of fossil emissions from stationary equipment is as follows: the power boilers account for about 71percent of fossil fuel emissions (including co-firing in hog fuel boilers), the lime kilns contribute approximately 20 percent and tissue\/BCTMP dryers at nine percent. While fossil-based emissions through the forest value chain (Figure 2) are notable, they pale in comparison to the biogenic emissions, which amounted to 29.3 Mt CO 2 e, bringing the sector’s total emissions to approximately 39.4 Mt CO 2 e when final product transportation is excluded. The forest sector’s emissions are mostly biogenic and largely concentrated in pulp and paper mills. The biogenic CO 2 is emitted from residual pulping liquor burned in recovery boilers in the kraft pulping process (57 percent), from wood-based residues in power boilers (40 percent) and from process emissions in lime kilns (three percent). The wood processing facilities also use a large amount of bioenergy, mostly in boilers, furnaces and dryers. Capturing part of these emissions, especially in kraft mills, and permanently removing them from the atmosphere, would enable the forest sector to become carbon-negative. This could help Canada achieve net-zero industrial emissions by compensating for hard-to-abate industrial sectors. Additionally, it presents a valuable revenue stream for the pulp and paper industry. Carbon capture from pulp mills has been shown to be feasible but is not currently economically viable at a small scale if no credit is provided for negative emissions or without a market to sell captured CO 2 . While biogenic emissions are usually reported, they are not priced or subject to regulation under current national carbon policies. Why must we act now? In its 2030 Emissions Reduction Plan, Canada has committed to exploring the potential for negative-emission technologies in the forest sector, particularly in facilities where biomass is used as an energy source. Carbon taxes can be mitigated by lowering GHG emissions at forest products facilities. Cost-effective energy efficiency measures are still available if manufacturing facilities to further reduce fossil-fuel utilization, notably using heat recovery systems and advanced controls. Increasing carbon prices will likely help improve the collection and utilization of harvesting residues. Industry transformation is ongoing as traditional products such as paper and newsprint give way to different new products. Key takeaway Canada’s forestry sector is a large and energy-intensive industry, occupying a unique position as a predominant consumer of bioenergy. This sector offers promising avenues for reducing fossil fuel consumption and attaining carbon negativity. By integrating additional decarbonization strategies such as enhancing energy efficiency, transitioning to electrification and bioenergy, and implementing carbon capture technologies, the forestry sector can not only thrive but also shape a sustainable, low-carbon future for Canada. © His Majesty the King in Right of Canada, as represented by the Minister of Natural Resources, 2023 Luciana Savulescu (corresponding author), Jawad Jeaidi, Adam Rogerson are from Natural Resources Canada, CanmetENERGY, Industrial System Optimization Group. Bruno Gagnon is from Natural Resources Canada, Canadian Forest Service, Trade, Economics & Industry Branch.","filter_flag":1}
{"title":"POSCO to launch Greenate, its master brand for carbon neutrality, as an initiative for a sustainable future - POSCO","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL25ld3Nyb29tLnBvc2NvLmNvbS9lbi9wb3Njby10by1sYXVuY2gtZ3JlZW5hdGUtaXRzLW1hc3Rlci1icmFuZC1mb3ItY2FyYm9uLW5ldXRyYWxpdHktYXMtYW4taW5pdGlhdGl2ZS1mb3ItYS1zdXN0YWluYWJsZS1mdXR1cmUv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL25ld3Nyb29tLnBvc2NvLmNvbS9lbi9wb3Njby10by1sYXVuY2gtZ3JlZW5hdGUtaXRzLW1hc3Rlci1icmFuZC1mb3ItY2FyYm9uLW5ldXRyYWxpdHktYXMtYW4taW5pdGlhdGl2ZS1mb3ItYS1zdXN0YWluYWJsZS1mdXR1cmUv0gEA?oc=5","id":"CBMiiAFodHRwczovL25ld3Nyb29tLnBvc2NvLmNvbS9lbi9wb3Njby10by1sYXVuY2gtZ3JlZW5hdGUtaXRzLW1hc3Rlci1icmFuZC1mb3ItY2FyYm9uLW5ldXRyYWxpdHktYXMtYW4taW5pdGlhdGl2ZS1mb3ItYS1zdXN0YWluYWJsZS1mdXR1cmUv0gEA","guidislink":false,"published":"Mon, 28 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=240, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL25ld3Nyb29tLnBvc2NvLmNvbS9lbi9wb3Njby10by1sYXVuY2gtZ3JlZW5hdGUtaXRzLW1hc3Rlci1icmFuZC1mb3ItY2FyYm9uLW5ldXRyYWxpdHktYXMtYW4taW5pdGlhdGl2ZS1mb3ItYS1zdXN0YWluYWJsZS1mdXR1cmUv0gEA?oc=5\" target=\"_blank\">POSCO to launch Greenate, its master brand for carbon neutrality, as an initiative for a sustainable future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POSCO<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"POSCO to launch Greenate, its master brand for carbon neutrality, as an initiative for a sustainable future - POSCO","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL25ld3Nyb29tLnBvc2NvLmNvbS9lbi9wb3Njby10by1sYXVuY2gtZ3JlZW5hdGUtaXRzLW1hc3Rlci1icmFuZC1mb3ItY2FyYm9uLW5ldXRyYWxpdHktYXMtYW4taW5pdGlhdGl2ZS1mb3ItYS1zdXN0YWluYWJsZS1mdXR1cmUv0gEA?oc=5\" target=\"_blank\">POSCO to launch Greenate, its master brand for carbon neutrality, as an initiative for a sustainable future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POSCO<\/font>","source.href":"https:\/\/newsroom.posco.com","source.title":"POSCO","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Decarbonization of steel is emerging as an inevitable challenge Countries worldwide are working toward a low-carbon economy by setting ambitious targets to cut greenhouse gas (GHG) emissions to achieve carbon neutrality. Moreover, with the notice of the European Union’s forthcoming implementation of a carbon border tax, carbon neutrality in industries with high carbon intensity can no longer be deferred. In particular, steel is a typical carbon-intensive product that involves an iron ore reaction with coal as fuel and coke as a reducing agent and produces significant carbon emissions during manufacturing. POSCO, a leading steel company, declared 2050 Carbon Neutrality on December 11, 2020, and plans a comprehensive infrastructure reorganization to achieve decarbonization with eco-friendly raw materials, carbon capture and recycling, and hydrogen reduction steelmaking. Launch of Greenate, an integrated initiative brand POSCO is taking steps as Korea’s leader in carbon neutrality by actively participating in technology, product innovation and social efforts to reduce carbon emissions. In November 2022, POSCO launched the carbon-neutral master brand Greenate at the Green Materials Forum 2022 held to strengthen future business with customers. The brand name is a compound word of “Green,” which represents POSCO’s commitment to the environment, and “-ate,” a suffix that means acting in a certain way, and expresses POSCO’s intention to create a “green planet.” POSCO launched Greenate because of the need to integrate its efforts and outcomes to achieve carbon neutrality and communicate them intuitively. POSCO’s flagship eco-friendly brand Greenate consists of three categories: Steel, Tech & Process, and Infrastructure, and covers not only POSCO’s eco-friendly steel products led by e Autopos, INNOVILT, and Greenable, but also low-carbon steel technology and processes, especially next-generation hydrogen reduction iron and steel making. Introduction of sub-brands: ① Steel, ② Tech & Process, and ③ Infrastructure First, Greenate Steel refers to products that contribute to reducing carbon footprints throughout the life cycle assessment (LCA) from steel production to use and disposal. It is divided into footprint minimization and handprint enhancement products. Footprint minimization and handprint enhancement products 1. Footprint minimization products: They include steel produced using recycled raw materials, such as scrap, to reduce carbon emission during steel production and by applying carbon-reducing manufacturing technology such as using new & renewable energy power and applying low-carbon fuel and raw materials. 2. Handprint enhancement products: They are steel materials that contribute to reducing carbon footprint from a customer’s use cycle perspective, such as the use and disposal of steel and include steel materials that replace competitive materials, such as aluminum and cement, that emit much carbon in product processes compared to steel materials, along with those that are applied to low-carbon industrial use, such as wind power, solar power, and hydrogen, and those such as high-tensile automotive steel plates that contribute to improving automobile fuel efficiency. Greenate Tech & Process includes low-carbon steel technology and processes. POSCO plans to reduce the amount of coal and energy used in processes by introducing electric furnaces, using hot briquette iron (HBI) for facilities currently in operation, and developing bridge technologies such as low-HMR operation\/CCUS technology. In the case of hydrogen reduction iron and steelmaking process technology, POSCO plans to verify the feasibility of commercializing HyRex technology based on FINEX fluidized reduction furnace technology by 2030 to break away from conventional blast furnace steel making that emits carbon by reacting coal with iron ore. Greenate Infrastructure establishes all necessary conditions for the realization of Greenate Steel and Greenate Tech & Process. POSCO plans to establish a hydrogen production and supply system for the hydrogen reduction iron and steelmaking technology and achieve carbon neutrality with an eco-friendly power infrastructure. POSCO, hosted the world’s first Hydrogen Iron & Steel Making Forum (HyIS Forum) in 2021, updates the progress of global hydrogen reduction iron and steel initiatives and discusses measures to reduce GHG at the forum each year. The company also collaborates with various companies on raw materials, steel, and equipment technology through the HyRex R&D Partnership exchange platform. POSCO plans to continue to expand various activities aimed at carbon reduction. Operational status of global competitors’ low-carbon brands Global steel companies also operate master brands that include steel technology projects to achieve carbon neutrality. ArcelorMittal announced the XCarb Initiative, a green innovation project to build a next-generation circular economy and demonstrate carbon-neutral steel. The company introduced the XCarb Green Steel Certificate to help its customers reduce their carbon footprint. Another steel maker, Salzgitter AG, plans to dramatically reduce carbon emissions during steel production based on its conversion program SALCOS (SALzgitter Low CO₂ Steelmaking). The company is testing carbon-free steel manufacturing processes to realize green hydrogen production. Nippon Steel announced that it will sell carbon-neutral steel with zero CO2 emissions starting this year. Its decarbonization strategy includes using green electricity, developing high-performance products, such as advanced ultra-high-strength steel (AHSS) to reduce vehicle weight and high-performance steel for EV drive motors, and increasing supply capacity. POSCO Launches Korea’s First Low-Carbon Brand Product One of the notable products introduced by POSCO is “Greenate certified steelTM,” which operates on a mass-balance principle. This product effectively reduces carbon emissions by distributing the emissions saved through the implementation of low-carbon production processes and the use of low-carbon steel. Companies that purchase this product are acknowledged for their efforts in reducing carbon emissions equivalent to the amount associated with the product. At the Green Materials Forum 2022 on November 1 last year, POSCO Group launched Greenate, a master brand representing the company’s ambitious mission to achieve carbon neutrality by 2050, after which the product is named. Greenate encompasses all the efforts and products of POSCO Group to produce low-carbon steel and eco-friendly secondary battery materials, as well as the three major eco-friendly steel brands e Autopos, INNOVILT, and Greenable. Leading steel manufacturers in Europe and Japan had already adopted the mass balance methodology, which involves allocating carbon reductions to specific steel products, in 2021. POSCO became the first company in Korea to adopt this method for launching a low-emission product. The evaluation of carbon emission reduction for Greenate was conducted according to the GHG Protocol, a widely used international standard that measures greenhouse gas emissions. The assessment was performed by DNV (Det Norske Veritas) UK, one of the top three certification agencies globally, with extensive experience in certifying carbon-reduced steel from steel companies worldwide. The evaluation took place at POSCO’s Pohang Works and Gwangyang Works. Companies that purchase Greenate certified steelTM receive DNV’s product guarantee, with includes information on carbon reduction information on the raw material, along with POSCO’s purchase certificate. “The low emission trend is inevitable in the steel industry, and POSCO is responding proactively by launching new products,” Gi-cheon Eom, Head of Marketing Strategy Office, said at the briefing session. “With the launch of Greenate certified steelTM, the company has taken a step forward in its long journey towards carbon neutrality.” LG Electronics is the first client to purchase the newly released Greenate certified steelTM. Last November, POSCO and LG Electronics signed a business agreement for the supply and purchase of mass-balance type low-carbon steel products. Immediately after the product launch, LG Electronics placed an order for 200 tons of the new steel, which will be used as materials for their dryers. The company intends to actively explore opportunities for expanding the use of low-carbon steel in household appliances in the future. In addition, Samsung Electronics is currently considering the procurement of Greenate certified steelTM for their premium ovens. Recently, POSCO and Samsung Electronics entered into a three-year supply contract for high-strength, high-corrosion, and electric steel plate products for home appliances. This marks the first long-term agreement between the two companies, underscoring their shared dedication to technological collaboration and carbon neutrality. POSCO actively invests in the transformation to climate-friendly production, even in the high-energy era POSCO Group launched the holding company POSCO Holdings in March of last year and announced its aspiration to grow into a leading eco-friendly future materials company by gradually shifting to a carbon-neutral production system and proactively establishing eco-friendly infrastructure to achieve its 2050 carbon neutrality goal. As POSCO Greenate won the grand prize in each category in the Korea Consumer Appraisal Brand (KCAB) hosted by The Dong-A Ilbo in February, the Group is expected to solidify its global competitiveness in the low-carbon era with continuous innovation in eco-friendly steel products, production technology and solutions using products. POSCO plans to reduce carbon emissions by improving conventional blast furnace-based low-carbon operation technology and building new electric furnaces that directly produce molten steel or mix it with molten steel produced by blast furnaces beginning in 2026. Moreover, after completing a test facility for hydrogen reduction steelmaking in 2026, the company plans to complete commercialization technology by 2030 and gradually convert production facilities to a hydrogen reduction steelmaking method. In line with this, POSCO plans to support the carbon reduction activities of customers by selling renewable energy steel with the purchase of renewable energy credits, etc., and Greenate-Certified SteelTM using a carbon allocation method in the short term until the Gwangyang Steel Plant’s electric furnace is fully operational in 2026, and in the mid- to long-term, it plans to sell Greenate carbon-reduced steel, which reduces carbon emissions by 30% or more through blast furnace-based low-carbon operation, cutting-edge large-scale electric furnaces, and hydrogen reduction steelmaking.","filter_flag":1}
{"title":"Rising Volumes: Recent trends in India's power trading sector - Power Line Magazine - Power Line Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vcG93ZXJsaW5lLm5ldC5pbi8yMDIzLzA4LzI5L3Jpc2luZy12b2x1bWVzLXJlY2VudC10cmVuZHMtaW4taW5kaWFzLXBvd2VyLXRyYWRpbmctc2VjdG9yL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vcG93ZXJsaW5lLm5ldC5pbi8yMDIzLzA4LzI5L3Jpc2luZy12b2x1bWVzLXJlY2VudC10cmVuZHMtaW4taW5kaWFzLXBvd2VyLXRyYWRpbmctc2VjdG9yL9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vcG93ZXJsaW5lLm5ldC5pbi8yMDIzLzA4LzI5L3Jpc2luZy12b2x1bWVzLXJlY2VudC10cmVuZHMtaW4taW5kaWFzLXBvd2VyLXRyYWRpbmctc2VjdG9yL9IBAA","guidislink":false,"published":"Tue, 29 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=241, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vcG93ZXJsaW5lLm5ldC5pbi8yMDIzLzA4LzI5L3Jpc2luZy12b2x1bWVzLXJlY2VudC10cmVuZHMtaW4taW5kaWFzLXBvd2VyLXRyYWRpbmctc2VjdG9yL9IBAA?oc=5\" target=\"_blank\">Rising Volumes: Recent trends in India's power trading sector - Power Line Magazine<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Power Line Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rising Volumes: Recent trends in India's power trading sector - Power Line Magazine - Power Line Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vcG93ZXJsaW5lLm5ldC5pbi8yMDIzLzA4LzI5L3Jpc2luZy12b2x1bWVzLXJlY2VudC10cmVuZHMtaW4taW5kaWFzLXBvd2VyLXRyYWRpbmctc2VjdG9yL9IBAA?oc=5\" target=\"_blank\">Rising Volumes: Recent trends in India's power trading sector - Power Line Magazine<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Power Line Magazine<\/font>","source.href":"https:\/\/powerline.net.in","source.title":"Power Line Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The Indian power sector is on the cusp of an energy transition, as the share of renewable energy in the country’s power generation is rising rapidly. Alig­ned with the nation’s decarbonisation and net zero targets, industrial and commercial consumers are increasingly shifting towards renewable energy sourc­es to fulfil energy requirements. More­over, alongside the increasing share of short-term trading volumes, energy markets in the country are evolving to facilitate gre­ater adoption of renewable energy. This is exemplified by the emergence of innovative products such as the green term-ah­ead market (GTAM), the green day-ahead market (GDAM), the real-time market (RTM) and market-based ancillary services. These developments are an­ticipated to facilitate large-scale capacity addition of renewable energy while reducing the costs of integration. During 2022-23, short-term trading volumes stood at 194.35 BUs, marking a 4.1 per cent increase over the previous year. The volume accounted for 13.7 per cent of the total generation during this period. The volume of short-term transactions between 2017-18 and 2022-23 grew at a compound annual growth rate (CAGR) of 8.8 per cent, while power generation grew at a CAGR of 1.7 per cent. Power ex­chan­ges accounted for approximately 53 per cent (102.95 BUs) of the total transaction volume in the short-term market during 2022-23. The remaining portion includes volumes transacted through trading licensees, which accounted for a share of 17.4 per cent (33.80 BUs), deviation settlement mechanism transactions at 13.5 per cent (26.3 BUs), and bilateral transactions between discoms at 16.1 per cent (31.3 BUs). Power exchange and bilateral transactions During 2022-23, a volume of 102.95 BUs was transacted across three power ex­change platforms, an increase of 1.5 per cent over the previous year, when an agg­regate volume of 101.45 BUs was transacted on two power exchange platforms. Of the total volume, the Indian Energy Exchange (IEX) accounted for 89.2 per cent (91.85 BUs), while Power Exchange India Limited (PXIL) and Hindustan Power Exchange Limited (HPX) accounted for 9.7 per cent (9.96 Bus) and 1.1 per cent (1.14 BUs) respectively. Between 2017-18 and 2022-23, the aggregate trading volume transacted on the exchanges grew at a CAGR of 16.6 per cent. Day-ahead market (DAM): During 2022-23, an aggregate volume of 51.37 BUs was transacted on the three po­wer exchange platforms in the DAM segment, a decrease of 21.2 per cent over the previous year when an aggregate volume of 65.18 BUs was transacted on two power exchange platforms. The IEX accounted for a major share in the DAM with a trading volume of 51.18 BUs, while PXIL accounted for 0.19 BUs and HPX accounted for the remaining volume. RTM: During 2022-23, an aggregate vol­ume of 24.19 BUs was transacted on the power exchange platforms in the RTM segment, an increase of 21.5 per cent over the previous year wherein an aggregate volume of 19.91 BUs was transacted. Term-ahead market (TAM): During 2022-23, an aggregate volume of 19.4 BUs was transacted on the three pow­er exchange platforms in this segme­nt, an increase of 94.2 per cent over the previous year wherein an aggregate volume of 9.99 BUs was transacted. Of the total trading volume, the IEX accounted for approximately 10.1 BUs, while PXIL accounted for 8.2 BUs and the remaining 1.08 BUs were traded by HPX. GTAM: During 2022-23, an aggregate volume of 4.19 BUs was transacted in this segment on the three power ex­change platforms, a decrease of 23.2 per cent over the previous year when an aggregate volume of 5.45 BUs was transacted. Of the total, around 2.6 BUs was traded on the IEX, while PXIL accounted for 1.5 BUs and HPX ac­counted for the remaining 0.07 BUs. GDAM: During 2022-23, an aggregate volume of 3.82 BUs was transacted in this segment on the power exchange platforms, as compared to 0.92 BUs transacted at IEX during the five mon­ths of operation in 2021-22. During 2022-23, approximately 33.8 BUs of electricity was transacted through tra­ders, marking a decline of 14.4 per cent from the 39.47 BUs recorded during 2021-22. Energy markets in the country are evolving to facilitate greater adoption of renewable energy. Open access consumer participation During 2021-22, over 5,628 open access (OA) consumers procured power throu­gh two exchange platforms, compared to approximately 5,400 consumers in 2020-21. In both the power exchanges, OA ind­ustrial consumers bought 9.74 BU of el­ectricity, which formed 11 per cent of the total DAM, GDAM and RTM volume tra­nsacted in the power exchan­ges during 2021-22. The weighted average price (WAP) of electricity bought by OA consumers at IEX was Rs 3.20 per kWh, which was lower as compared to the WAP of the to­tal electricity transacted through IEX (Rs 4.73 per kWh), i.e., through DAM, GDAM and RTM. How­ever, the WAP of el­ectricity bought by OA consumer (Rs 4.99 per kWh), was higher compared to WAP of the total electricity transacted through PXIL (Rs 3.68 per kWh) in 2021-22. Market coupling will lead to the determination of a uniform market clearing price across the country. Renewable energy certificates During 2022-23, 8.16 million renewable energy certificates (RECs) were traded on the three power exchange platforms. Of the total, around 5.97 million RECs were traded on the IEX, while 2.1 million RECs were traded on PXIL and the re­maining 0.09 million RECs on HPX. During the five months of 2021-22 when RECs were transacted, a total of 8.46 million RECs, comprising 1.36 million solar RECs and 7.1 million non-solar RECs, were traded on two exchange platforms. Key developments Market coupling: In June 2023, the Ministry of Power (MoP) directed the Ce­ntral Electricity Regulatory Commis­sion (CERC) to initiate the consultation proce­ss for market coupling and finalise the framework for its implementation. Ma­rket coupling, which involves the aggregation of buy and sell bids from all power exchange platforms in the country under a single power trading entity, will lead to the determination of a uniform market clearing price across the country. Recently in August 2023, the CERC has issued a staff paper on market coupling. The paper discusses the regulatory provisions for market coupling, international experiences, objectives of market coupling in India, the issues and challenges in implementing market coupling, and the key points for discussion. The development of new products, more trade activity, and positive policy and regulatory changes are expected to contribute to the power market’s expansion. Redesign of the Indian electricity market: A group constituted by the MoP for “Development of Electricity Market in India” has proposed comprehensive solutions to address the key issues in the country’s electricity market design, such as the prevalence of inflexible long-term contracts, the lack of resource adequacy planning and the high reliance on self-scheduling by states. The report highlighted several near-term (less than one year) high-priority items to initiate po­wer market reforms. These items inclu­de implementing security-constrained economic despatch and unit commitments for thermal fleets, operationalising ancillary services regulations, mainstreaming renewable energy participation for select capacity, introducing re­so­urce adequacy and integrated resour­ce planning for states\/utilities, and im­plementing time-of-day tariff. HP-DAM: In February 2023, the IEX received the final approval from the CERC to introduce trading in high-price DAM (HP-DAM) contracts. Eligible sellers in the HP-DAM category would inclu­de gas-based power plants that utilise im­ported re­gasified liquefied natural gas and naphtha, imported coal-based pow­er plants th­at utilise imported coal, and battery en­ergy storage systems. The category of plants eligible to participate in HP-DAM will be subject to a quarterly review by the CERC. The power regulator has fixed a ceiling of Rs 20 per unit for electricity traded in HP-DAM, while a price cap of Rs 10 per unit is applicable across all the other spot power market segments. Ancillary service market: The CERC gave its approval for the power exchange platforms to launch the tertiary reserve ancillary service (TRAS) market segment in April 2023. The TRAS is a frequency control ancillary service capacity meant to keep grid frequency within a specified range. To ensure the availability of secondary reserves and accommodate variations in renewable energy supply, the TRAS framework covers qualified power plants, energy storage systems and in­ter­ruptible loads ready for despatch. The implementation of TRAS commenced from June 1, 2023. Outlook Going forward, the implementation of several new regulations for general network access, transmission sharing, REC, and the deviation settlement mechanism in the coming months will significantly transform the electricity market. Further, the market will witness the launch of new products including ancillary markets, derivatives, capacity markets and contract for differences. These developments are projected to transform the allocation and utilisation of interstate transmission systems in the country, and will also offer discoms the opportunity to reduce their overall power purchase cost, including transmission charges, by exploring various alternatives in the market. Overall, the development of new products, more trade activity, and positive policy and regulatory changes are expected to contribute to the power market’s expansion during the coming years.","filter_flag":1}
{"title":"Ignite Ideas Fund Round 10 recipients announced - Ventures - University of Queensland - UQ Ventures","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vdmVudHVyZXMudXEuZWR1LmF1L2FydGljbGUvMjAyMy8xMi9pZ25pdGUtaWRlYXMtZnVuZC1yb3VuZC0xMC1yZWNpcGllbnRzLWFubm91bmNlZNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vdmVudHVyZXMudXEuZWR1LmF1L2FydGljbGUvMjAyMy8xMi9pZ25pdGUtaWRlYXMtZnVuZC1yb3VuZC0xMC1yZWNpcGllbnRzLWFubm91bmNlZNIBAA?oc=5","id":"CBMiWmh0dHBzOi8vdmVudHVyZXMudXEuZWR1LmF1L2FydGljbGUvMjAyMy8xMi9pZ25pdGUtaWRlYXMtZnVuZC1yb3VuZC0xMC1yZWNpcGllbnRzLWFubm91bmNlZNIBAA","guidislink":false,"published":"Thu, 31 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=243, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vdmVudHVyZXMudXEuZWR1LmF1L2FydGljbGUvMjAyMy8xMi9pZ25pdGUtaWRlYXMtZnVuZC1yb3VuZC0xMC1yZWNpcGllbnRzLWFubm91bmNlZNIBAA?oc=5\" target=\"_blank\">Ignite Ideas Fund Round 10 recipients announced - Ventures - University of Queensland<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UQ Ventures<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ignite Ideas Fund Round 10 recipients announced - Ventures - University of Queensland - UQ Ventures","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vdmVudHVyZXMudXEuZWR1LmF1L2FydGljbGUvMjAyMy8xMi9pZ25pdGUtaWRlYXMtZnVuZC1yb3VuZC0xMC1yZWNpcGllbnRzLWFubm91bmNlZNIBAA?oc=5\" target=\"_blank\">Ignite Ideas Fund Round 10 recipients announced - Ventures - University of Queensland<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UQ Ventures<\/font>","source.href":"https:\/\/ventures.uq.edu.au","source.title":"UQ Ventures","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The inspiring startups and small-to-medium sized businesses will share in more than $1.42 million to help them tap into new markets and attract investment in new products and services developed in Queensland. The Ignite Ideas Fund helps companies to take a viable product to market with grants of up to $200,000. The program reaches across the Queensland economy, supporting innovation in tourism, agriculture, advanced manufacturing, renewable energy, technology, engineering and construction industries. Some of the game-changing products and services selected for the Round 10 funding include: an Artificial Intelligence fundraising and marketing assistant that saves time and increases productivity for fundraising and marketing teams at not-for-profits and small-to-medium businesses a digital toolkit to halve emissions across the animal health sector a zero-emission haulage solution for the construction industry, with a focus on hauling bulk products like sand and aggregates. Since 2016, Ignite Ideas funding has supported over 400 Queensland businesses with more than $49 million, delivering over 6,000 jobs to the economy. Read the full announcement One of these announced startups is 2023 Ventures ilab Accelerator participant, ExtrasJar, a self-insurance investment approach to address the insurance affordability crisis. ExtrasJar was among the 11 teams that took the stage at ilab Pitch Night.","filter_flag":1}
{"title":"Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd. - Energetica India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA","guidislink":false,"published":"Thu, 03 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=215, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5\" target=\"_blank\">Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd. - Energetica India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5\" target=\"_blank\">Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","source.href":"https:\/\/www.energetica-india.net","source.title":"Energetica India","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"August 03, 2023. By News Bureau Solar energy is the future. With the government's push towards renewable energy and the increasing awareness among consumers, the demand for solar products will continue to grow. Havells is closely working with the stakeholders and has started investing aggressively to offer the right solar solution to its customers. The company’s flagship solar grid tie inverter can be seen in more than 30000 homes and industries, shared Varinder Bhatia, Joint Vice President- Sales (Solar), Havells India Ltd. in an interview with Anurima Mondal, Associate Editor, Energetica India. Que: Please give us an overview of the Indian solar industry. Ans: India's solar industry has flourished over the years, thanks to the government's unwavering commitment to sustainable energy. The initiative to boost domestic production of solar equipment is a move to reduce dependence on imports and spur the adoption of solar technology. The Jawaharlal Nehru National Solar Mission (JNNSM) has played a crucial role in attracting foreign investment and facilitating the development of large-scale solar projects across the country. Renewable energy adoption boosted the economy and also created job opportunities. The 'Make in India' campaign has attracted additional investment and enhanced India's image as a global player in renewable energy. It's reassuring to see the positive impact of these efforts, as more and more companies are setting up production units, creating jobs and contributing to the country's growth story. The solar industry's progress is a testament to the power of innovation and collaboration, and we are excited to see what the future holds as we continue to push toward a greener, cleaner future. Que: Could you shed some light on Havells and its product range in the solar segment? Ans: At Havells, we keep striving to contribute to the growth of the Indian solar sector. We have been closely working with the stakeholders and have started investing aggressively to offer the right solar solution to our customers. Our flagship solar grid tie inverter can be seen in more than 30000 homes and industries. We offer both off-grid and on-grid solutions to our consumers. We have also partnered with SBI as funding support for our MSME customers to adopt solar. Our research & innovation team is committed to designing and offering world-class solar solutions. Soon, we are planning to launch an inverter that will be an edge in terms of technology. Que: What steps do you take to ensure quality products for the domestic and international markets? Ans: We have established state-of-the-art manufacturing facilities that are equipped with the latest technologies and equipment. Our manufacturing processes are strictly monitored to ensure that our products are of the highest quality and meet all relevant safety standards. We are seventh in Dow Jones Sustainability Index and have been rated as ‘Strong’ by Crisil. We also invest heavily in research and development to stay ahead of the curve and incorporate the latest technologies into our products. Our R&D teams work tirelessly to develop new products that are energy-efficient, eco-friendly, and meet the evolving needs of our customers. We offer some of the highly engineered off-grid solutions addressing customers’ pain points. Our state-of-the-art grid-tie inverters have the highest warranty in the industry, which is a testament to the robust product we offer to our customers. In addition, we have implemented rigorous quality control measures at every stage of the manufacturing process. Our products undergo multiple tests and inspections to ensure that they meet the highest standards of quality and safety. Que: What is your future roadmap? Ans: We believe that solar energy is the future, and we are committed to playing an active role in promoting its adoption. With the Government of India's push towards renewable energy and the increasing awareness among consumers, we are confident that the demand for solar products will continue to grow. In the near future, we plan to expand our solar product portfolio and offer innovative solutions that are both reliable and cost-effective. We are committed to offering the best services in the industry. With our strong channel network, we want to reach every category of customers across the country. Our aim is to provide value-based offerings solving customer needs. Que: How do you think have the government initiatives helped the Indian solar sector? Ans: The Indian government implemented several initiatives to promote the use of solar energy, including the 'Make in India' campaign, the National Solar Mission, and other policies. These efforts have attracted strong investment from large Indian houses & FDI. This has led to an increase in domestic solar panel production. India aims to achieve 110 GW in module manufacturing capacity by 2026 which is currently at 18 GW. India has already achieved 175 GW of renewable energy and it aims to achieve 450 GW by 2030. The govt. has taken a big initiative by introducing the PLI scheme to promote domestic manufacturing of solar components. Over INR 45000 crore has been allocated for solar PV manufacturing under the PLI scheme. Apart from this, solar direct subsidy transfer has been initiated by the government through the launch of the solar rooftop national portal. For residential consumers, the government is providing a 40 percent subsidy on less than 3 KW system and a 20 percent subsidy on more than 3 KW to 10 KW system. Today, India is one of the top five countries globally in terms of installed solar capacity. The steep climb in the installed solar capacity is a testament to the success of the government's efforts. Que: How can the PLI scheme establish Indian solar manufacturing companies to meet the global solar demand? Ans: The Production Linked Incentive (PLI) scheme is a game-changing initiative by the Indian government to boost the manufacturing industry and establish India as a major player in the global solar market. The scheme's primary aim is to promote domestic production by offering financial incentives to Indian enterprises that manufacture solar equipment. This would not only assist in minimizing import dependence but will also create job possibilities and national manufacturing champions. As a result, Indian companies will be better equipped to vie with their foreign counterparts in areas such as pricing and product excellence, all the while satisfying the rapidly escalating global requirement for solar energy. Additionally, the program will foster a robust ecosystem for procuring vital materials needed in the solar industry, ones that are of Indian origin. Que: As a joint report from the Institute for Energy Economics and Financial Analysis (IEEFA) and JMK Research and Analytics, India has the potential to become the world’s second-largest solar manufacturer by 2026. What are your views on it? Ans: We are proud to be a part of India's solar industry and are optimistic about its growth potential. It’s exhilarating to witness the potential for India to become the world's second-largest solar manufacturer by 2026, as outlined in the joint report from the Institute for Energy Economics and Financial Analysis and JMK Research and Analytics. This is a testimony to the tremendous growth potential of the Indian solar industry and the immense talent and potential of our workforce. We are dedicated to actively aiding this expansion and making significant contributions to India's path towards a more sustainable and eco-friendly future. Our engineers are relentlessly working on designs to offer the next generation off-grid & on-grid solar products. We aim to be the topmost solar company in the industry delivering some of the world-class solution to both contractors & end users in the days to come. Que: How do you see the Indian solar market expanding in the future? Ans: India has been taking big strides towards achieving a sustainable future with renewable energy. Our nation has made significant progress in the global RE scenario, but we believe that there is still more work to be done. What gives us an edge is our commitment to innovation and technology which has allowed us to harness the power of the sun and wind. However, we need to continue investing in R&D and infrastructure to keep up with the growing demand for clean energy. As a leading player in the Indian solar industry, we are proud to be contributing to this transition towards a greener future. Que: How do you see the Indian solar market expanding in the future? Ans: India has been taking big strides towards achieving a sustainable future with renewable energy. Our nation has made significant progress in the global RE scenario, but we believe that there is still more work to be done. What gives us an edge is our commitment to innovation and technology which has allowed us to harness the power of the sun and wind. However, we need to continue investing in R&D and infrastructure to keep up with the growing demand for clean energy. As a leading player in the Indian solar industry, we are proud to be contributing to this transition towards a greener future.","filter_flag":1}
{"title":"New from Suma - Organic Kombuchas & Paper Packaged Pasta - NP NEWS | The online home of Natural Products ... - Natural Products News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lm5hdHVyYWxwcm9kdWN0c29ubGluZS5jby51ay93aGF0cy1uZXctaW4tc3RvcmUvbmV3LWZyb20tc3VtYS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lm5hdHVyYWxwcm9kdWN0c29ubGluZS5jby51ay93aGF0cy1uZXctaW4tc3RvcmUvbmV3LWZyb20tc3VtYS_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3Lm5hdHVyYWxwcm9kdWN0c29ubGluZS5jby51ay93aGF0cy1uZXctaW4tc3RvcmUvbmV3LWZyb20tc3VtYS_SAQA","guidislink":false,"published":"Wed, 16 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lm5hdHVyYWxwcm9kdWN0c29ubGluZS5jby51ay93aGF0cy1uZXctaW4tc3RvcmUvbmV3LWZyb20tc3VtYS_SAQA?oc=5\" target=\"_blank\">New from Suma - Organic Kombuchas & Paper Packaged Pasta - NP NEWS | The online home of Natural Products ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Natural Products News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New from Suma - Organic Kombuchas & Paper Packaged Pasta - NP NEWS | The online home of Natural Products ... - Natural Products News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3Lm5hdHVyYWxwcm9kdWN0c29ubGluZS5jby51ay93aGF0cy1uZXctaW4tc3RvcmUvbmV3LWZyb20tc3VtYS_SAQA?oc=5\" target=\"_blank\">New from Suma - Organic Kombuchas & Paper Packaged Pasta - NP NEWS | The online home of Natural Products ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Natural Products News<\/font>","source.href":"https:\/\/www.naturalproductsonline.co.uk","source.title":"Natural Products News","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Organic Kombuchas Our new range of sparkling organic kombuchas are craft-brewed and traditionally fermented from natural ingredients. Suma kombucha offers a quality product and packaging and includes the traditional bestseller, ginger; a fruity option with strawberry and raspberry; and a more adventurous peach and turmeric. The kombucha market is still in its infancy with growth predicted as people look for alternative soft drinks that are natural, low in calories, without artificial sweeteners and alcohol free. They RRP at £1.75 making them competitive in comparison to other kombuchas and, importantly, in relation to other healthy soft drinks in the chiller. They come with an introductory offer for September and October, of 20% off. Suma Paper Packaged Pasta We’ve ditched the plastic. Our Italian organic wheat pasta is now packaged in biodegradable and recyclable paper, sourced from sustainably managed forests. Printed with water-based ink and heat-sealing lacquers without solvents. Our pasta is made using traditional methods by a co-operative bringing together over 300 farms. It’s produced using a slow drying process that uses 100% renewable energy. We have eight different types of pasta, so, plenty of choice. The product lasts as long as it would in plastic packaging if stored correctly, and has a highly competitive RRP, at just £1.89 for the penne, macaroni and spaghetti, and £2.25 for tricolore fusilli. Suma Tel: 01422 313848 www.suma.coop\/wholesale","filter_flag":1}
{"title":"Tesco Express overhaul with 50 cheaper own-brand products to hit shelves within fortnight - Express","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvZmluYW5jZS9wZXJzb25hbGZpbmFuY2UvMTgwMTE5Ny90ZXNjby1leHByZXNzLWNoZWFwZXItaXRlbXMtY29udmVuaWVuY2XSAWVodHRwczovL3d3dy5leHByZXNzLmNvLnVrL2ZpbmFuY2UvcGVyc29uYWxmaW5hbmNlLzE4MDExOTcvdGVzY28tZXhwcmVzcy1jaGVhcGVyLWl0ZW1zLWNvbnZlbmllbmNlL2FtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvZmluYW5jZS9wZXJzb25hbGZpbmFuY2UvMTgwMTE5Ny90ZXNjby1leHByZXNzLWNoZWFwZXItaXRlbXMtY29udmVuaWVuY2XSAWVodHRwczovL3d3dy5leHByZXNzLmNvLnVrL2ZpbmFuY2UvcGVyc29uYWxmaW5hbmNlLzE4MDExOTcvdGVzY28tZXhwcmVzcy1jaGVhcGVyLWl0ZW1zLWNvbnZlbmllbmNlL2FtcA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvZmluYW5jZS9wZXJzb25hbGZpbmFuY2UvMTgwMTE5Ny90ZXNjby1leHByZXNzLWNoZWFwZXItaXRlbXMtY29udmVuaWVuY2XSAWVodHRwczovL3d3dy5leHByZXNzLmNvLnVrL2ZpbmFuY2UvcGVyc29uYWxmaW5hbmNlLzE4MDExOTcvdGVzY28tZXhwcmVzcy1jaGVhcGVyLWl0ZW1zLWNvbnZlbmllbmNlL2FtcA","guidislink":false,"published":"Fri, 11 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=223, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvZmluYW5jZS9wZXJzb25hbGZpbmFuY2UvMTgwMTE5Ny90ZXNjby1leHByZXNzLWNoZWFwZXItaXRlbXMtY29udmVuaWVuY2XSAWVodHRwczovL3d3dy5leHByZXNzLmNvLnVrL2ZpbmFuY2UvcGVyc29uYWxmaW5hbmNlLzE4MDExOTcvdGVzY28tZXhwcmVzcy1jaGVhcGVyLWl0ZW1zLWNvbnZlbmllbmNlL2FtcA?oc=5\" target=\"_blank\">Tesco Express overhaul with 50 cheaper own-brand products to hit shelves within fortnight<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Express<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tesco Express overhaul with 50 cheaper own-brand products to hit shelves within fortnight - Express","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvZmluYW5jZS9wZXJzb25hbGZpbmFuY2UvMTgwMTE5Ny90ZXNjby1leHByZXNzLWNoZWFwZXItaXRlbXMtY29udmVuaWVuY2XSAWVodHRwczovL3d3dy5leHByZXNzLmNvLnVrL2ZpbmFuY2UvcGVyc29uYWxmaW5hbmNlLzE4MDExOTcvdGVzY28tZXhwcmVzcy1jaGVhcGVyLWl0ZW1zLWNvbnZlbmllbmNlL2FtcA?oc=5\" target=\"_blank\">Tesco Express overhaul with 50 cheaper own-brand products to hit shelves within fortnight<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Express<\/font>","source.href":"https:\/\/www.express.co.uk","source.title":"Express","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Tesco will swap out cheaper product lines into its convenience stores Tesco will swap out cheaper product lines into its convenience stores as shoppers battle the rising cost of living. The move comes as German discounter rivals Aldi and Lidl have witnessed sharp sales growth in recent months as cash-strapped shoppers seek to trim their shopping bills. Tesco revealed that more than 50 everyday products in its smaller Express shops will be replaced by better-priced alternatives, many from its own-brand range. A study from Which? earlier this year claimed that shoppers who regularly buy groceries from Tesco and Sainsbury's convenience stores instead of bigger supermarkets were likely to pay hundreds of pounds more over the course of a year due to the higher price of many items stocked. On Friday, Tesco said that the own-brand alternatives being switched in to replace other products are, on average, over 40 percent cheaper. Tesco said that the own-brand alternatives on average will be over 40 percent cheaper It said the move is in response to internal shopping data, which shows that price-conscious customers are increasingly turning to own-brand products for better value. Among the own-brand lines being introduced are Tesco penne pasta (85p) and Tesco smooth peanut butter (£1.65), both of which will cost half the price of the previous branded product stocked, it said. Meanwhile, some branded lines, such as toothpaste, are being replaced by a cheaper branded alternative. The new products will be delivered to stores over the coming fortnight, with the changeover complete by the end of August, Tesco said. The new products will be delivered to stores over the coming fortnight Sarah Lawler, Tesco Convenience managing director, said: \"We know customers are watching every penny at the moment, so we hope these helpful product swaps will bring down food bills for even more families. \"Our Express stores offer unbeatable value on everything from essentials to fresh produce, making healthy food more accessible for the 2,000 communities that we serve across the UK. \"And while our convenience stores don't have the shelf space to carry the full range of our larger shops, by swapping these products, we've been able to make way for even more of our great-value own brand ranges.\" Trending SUBSCRIBE Invalid email We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. Read our Privacy Policy","filter_flag":1}
