{"title":"Guidelines for 'nurdle' transportation agreed after X-Press Pearl disaster - TradeWinds","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9yZWd1bGF0aW9uL2d1aWRlbGluZXMtZm9yLW51cmRsZS10cmFuc3BvcnRhdGlvbi1hZ3JlZWQtYWZ0ZXIteC1wcmVzcy1wZWFybC1kaXNhc3Rlci8yLTEtMTQ0NDQ2MtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9yZWd1bGF0aW9uL2d1aWRlbGluZXMtZm9yLW51cmRsZS10cmFuc3BvcnRhdGlvbi1hZ3JlZWQtYWZ0ZXIteC1wcmVzcy1wZWFybC1kaXNhc3Rlci8yLTEtMTQ0NDQ2MtIBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9yZWd1bGF0aW9uL2d1aWRlbGluZXMtZm9yLW51cmRsZS10cmFuc3BvcnRhdGlvbi1hZ3JlZWQtYWZ0ZXIteC1wcmVzcy1wZWFybC1kaXNhc3Rlci8yLTEtMTQ0NDQ2MtIBAA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9yZWd1bGF0aW9uL2d1aWRlbGluZXMtZm9yLW51cmRsZS10cmFuc3BvcnRhdGlvbi1hZ3JlZWQtYWZ0ZXIteC1wcmVzcy1wZWFybC1kaXNhc3Rlci8yLTEtMTQ0NDQ2MtIBAA?oc=5\" target=\"_blank\">Guidelines for 'nurdle' transportation agreed after X-Press Pearl disaster<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TradeWinds<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Guidelines for 'nurdle' transportation agreed after X-Press Pearl disaster - TradeWinds","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnRyYWRld2luZHNuZXdzLmNvbS9yZWd1bGF0aW9uL2d1aWRlbGluZXMtZm9yLW51cmRsZS10cmFuc3BvcnRhdGlvbi1hZ3JlZWQtYWZ0ZXIteC1wcmVzcy1wZWFybC1kaXNhc3Rlci8yLTEtMTQ0NDQ2MtIBAA?oc=5\" target=\"_blank\">Guidelines for 'nurdle' transportation agreed after X-Press Pearl disaster<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TradeWinds<\/font>","source.href":"https:\/\/www.tradewindsnews.com","source.title":"TradeWinds","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"New stowage recommendations for plastic pellets — known as nurdles — have been agreed in the wake of the X-Press Pearl container ship disaster off Sri Lanka. Nurdles are lentil-sized pellets that are the building blocks for plastic products. Packed with chemicals, they are often mistaken for food by marine life and can break down into smaller microplastics. The 2,756-teu X Press Pearl (built 2021) grounded and suffered a catastrophic fire off Sri Lanka in 2021.","filter_flag":1}
{"title":"European Commission refuses to let the dust settle on the EU Taxonomy - Travers Smith","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50cmF2ZXJzc21pdGguY29tL2tub3dsZWRnZS9rbm93bGVkZ2UtY29udGFpbmVyL2V1cm9wZWFuLWNvbW1pc3Npb24tcmVmdXNlcy10by1sZXQtdGhlLWR1c3Qtc2V0dGxlLW9uLXRoZS1ldS10YXhvbm9teS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50cmF2ZXJzc21pdGguY29tL2tub3dsZWRnZS9rbm93bGVkZ2UtY29udGFpbmVyL2V1cm9wZWFuLWNvbW1pc3Npb24tcmVmdXNlcy10by1sZXQtdGhlLWR1c3Qtc2V0dGxlLW9uLXRoZS1ldS10YXhvbm9teS_SAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy50cmF2ZXJzc21pdGguY29tL2tub3dsZWRnZS9rbm93bGVkZ2UtY29udGFpbmVyL2V1cm9wZWFuLWNvbW1pc3Npb24tcmVmdXNlcy10by1sZXQtdGhlLWR1c3Qtc2V0dGxlLW9uLXRoZS1ldS10YXhvbm9teS_SAQA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50cmF2ZXJzc21pdGguY29tL2tub3dsZWRnZS9rbm93bGVkZ2UtY29udGFpbmVyL2V1cm9wZWFuLWNvbW1pc3Npb24tcmVmdXNlcy10by1sZXQtdGhlLWR1c3Qtc2V0dGxlLW9uLXRoZS1ldS10YXhvbm9teS_SAQA?oc=5\" target=\"_blank\">European Commission refuses to let the dust settle on the EU Taxonomy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Travers Smith <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"European Commission refuses to let the dust settle on the EU Taxonomy - Travers Smith","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy50cmF2ZXJzc21pdGguY29tL2tub3dsZWRnZS9rbm93bGVkZ2UtY29udGFpbmVyL2V1cm9wZWFuLWNvbW1pc3Npb24tcmVmdXNlcy10by1sZXQtdGhlLWR1c3Qtc2V0dGxlLW9uLXRoZS1ldS10YXhvbm9teS_SAQA?oc=5\" target=\"_blank\">European Commission refuses to let the dust settle on the EU Taxonomy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Travers Smith <\/font>","source.href":"https:\/\/www.traverssmith.com","source.title":"Travers Smith","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The draft amendments to the existing TSC on climate change mitigation and adaptation cover for the first time, or amend existing, criteria for economic activities, and in particular, activities with a strong focus on the transition to sustainable transport. This includes, for example, manufacture of components for low carbon transport, or the conversion of transport to lower carbon alternatives. It is interesting that the Commission emphasises in its commentary that newly included activities may not only be those with the most substantial contribution, or the least harm to the other environmental objectives; this paves the way for certain activities, where there is presently no technologically or economically feasible low-carbon alternative, to be considered Taxonomy eligible or aligned. This is consistent with recommendations from the advisory body, the Platform on Sustainable Finance (\"PSF\"), which highlights the need for the Taxonomy to be a \"dynamic tool\"3 which can develop over time with technological and scientific development. A good example of this is the inclusion of aircraft manufacturing, which includes upgrading and retrofitting for compliance with the strict TSC. The rationale behind the inclusion of such transitional activities is not difficult to discern; demand for aviation services cannot realistically be expected to cease entirely, even if environmentally conscious consumers decrease their carbon footprint by flying less. Therefore, it is beneficial to ensure that the remaining demand for flights is met by aircraft causing as little environmental impact as technically feasible. This inclusion is, however, already proving to be controversial, as critics argue that rail and zero-emission aircraft should be encouraged over traditional aircraft with only minimal environmental improvement, and that allowing aircraft to qualify with only marginal reduction of emissions will lock in carbon-intensive assets for many years. The amendments to the existing TSC are planned to apply from 1 January 2024, with entities required to start reporting from 2024.","filter_flag":1}
{"title":"Top 10 Best Textile Companies In India In 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5","id":"CBMiRmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top 10 Best Textile Companies In India In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Textile Companies In India In 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdGV4dGlsZS1jb21wYW5pZXMtaW4taW5kaWEtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top 10 Best Textile Companies In India In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Pollution Prevention\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"INTRODUCTION India is one of the world’s leading producers and exporters of textiles. In 2023, the Indian textile industry is expected to continue its growth trajectory with a projected US $250 billion market size. The sector employs over 45 million people nationwide, making it one of the nation’s most prominent job creators. Major textile companies in India include Arvind Group, Bombay Rayon, Grasim Industries, JCT Limited, Siyaram Silk Mills, and Raymond Limited. Many small and medium-sized enterprises have also established themselves in the industry. The government of India has implemented numerous initiatives to support the sector’s growth, such as the Technology Upgradation Fund Scheme and the Amended Technology Upgradation Fund Scheme, which provide incentives to players for technological upgradation and modernization. The Textile Industry Development Plan provides subsidies and other incentives for increasing production capacities, modernizing infrastructure, and enhancing the sector’s productivity. Furthermore, the government has also taken several steps to promote exports, such as schemes for duty remission, export promotion capital goods scheme, etc. Overall, the Indian textile industry continues to contribute to the nation’s economy. With more advanced technology and economic reforms, the sector is expected to reach even greater heights in the coming years. IMPORTANCE In 2023, the textile industry in India will be one of the most critical industries in the country. The sector is estimated to employ more than 45 million people and contribute around 11% to the country’s GDP. The industry has shown significant growth over the past few years and is expected to progress further in the coming year. Textile companies can benefit from the rising demand for high-quality fabrics, as well as from a steady influx of skilled labour from outside India. Additionally, the government’s Make In India initiative has enabled many companies to access cheaper raw materials and modern technologies, which are helping them become more competitive. The Indian market also offers a vast consumer base with different kinds of tastes. This means that companies have the opportunity to tap into various segments, such as fashion, home furnishings, and technical fabrics. Textile companies can also benefit from the increasing number of digital platforms, allowing them to reach out to customers from all corners of the globe. Furthermore, the Indian government has initiated several policies to promote the growth of the textile industry. These include subsidies for technological upgrades, fiscal incentives for investments in special economic zones, and preferential market access for major exporters. The future of the textile industry in India looks set to be very bright. Companies can leverage the country’s rich cultural heritage and diverse talent pool to build innovative products and services. With the right strategies in place, textile companies can position themselves as leaders in the global market. Here are the top 10 best textile companies in India in 2023 Grasim Industries – Grasim Industries is a leading Indian multinational conglomerate with a market capitalization of $11 billion. Headquartered in Mumbai, the company has businesses spread across cement, textiles, chemicals, and BFSI. Grasim was established in 1947 as a textile company and later diversified into other sectors. The company has 12 manufacturing plants in India, and its cement brand, UltraTech Cement, is the largest in the country. Grasim also has interests in the financial services sector and is one of the largest NBFCs in India. It is also involved in mergers and acquisitions to strengthen its presence in the market. Grasim is listed on both the Bombay Stock Exchange and the National Stock Exchange of India. The company’s core values focus on Innovation, Quality, Integrity, and Excellence. This helps them build strong relationships with customers and stakeholders. Grasim is highly committed to sustainable development and actively engages in Corporate Social Responsibility (CSR). They are dedicated to promoting a culture of safety, health, and environmental protection and have created a number of initiatives to support this. Raymond Limited – Raymond Limited is a leading textile and apparel company based in India. Founded in 1925, Raymond has grown to become one of the most successful Indian companies in its sector. Its core business is fabric and garment manufacturing, with products ranging from fine fabrics, dress materials, and home furnishings to garments for men, women, and children. The company also operates in real estate, engineering tools, financial services, and hospitality sectors. Raymond is well-known not only for its quality products but also for its commitment to excellence in customer service and innovation. The company follows a business model focused on providing customers with high-quality products at competitive prices. It has diversified into many product categories, each of which is backed by cutting-edge technology and strong marketing strategies. Raymond has earned a reputation for being an innovative and forward-moving organization that puts customer satisfaction at the forefront of its mission. The company’s success is rooted in its focus on quality and service. It has built a strong foundation of trust among its customers by delivering on its promise of delivering the very best in terms of quality, reliability, and service. In addition, Raymond has invested heavily in research and development, allowing it to stay ahead of the competition. This commitment to innovation has enabled the company to introduce new products and technologies that have revolutionized the textile and apparel industry. Raymond also takes pride in its commitment to corporate social responsibility. It has launched various projects and initiatives that support sustainability, promote education, empower women, and contribute to local communities. These initiatives are reflective of Raymond’s philosophy of putting people first. Raymond Limited is a leader in the textile and apparel industry and has become one of the most recognized names in India. From its humble beginnings, the company has grown to become a global leader in its sector. Through its commitment to quality, innovation, and customer service, Raymond has established itself as a trusted and reliable partner for customers across the world. Arvind Ltd. – Arvind Ltd is a textile manufacturing company based in Ahmedabad, India. The company was founded in 1931 by three brothers – Kasturbhai Lalbhai, Narottam Lalbhai, and Chimanlal Lalbhai. Arvind Ltd has evolved into one of India’s leading integrated textile companies, with a wide range of products, including yarn, fabrics, and apparel. The company’s core strength lies in its vertically integrated supply chain which includes spinning, weaving, dyeing, printing, garmenting and retailing. It also has a strong presence in the global market with operations in over 30 countries. Arvind Ltd has diversified into other business segments such as apparel brands, engineering and renewable energy. The company has a strong focus on research and development, and has collaborated with many leading institutions in India and abroad for the same. It has also established the Arvind Institute of Technology, the first technology institute in India dedicated to the study and research of textiles. Arvind Ltd is committed to quality and design innovation. It is one of the largest exporters of fabrics in India, and is also the first company to launch India’s first designer denim brand – Flying Machine. The company also manufactures a range of high-end luxury clothing under the brand name Arvind Luxury. The company believes in encouraging sustainable practices throughout its supply chain, and is in the process of replacing conventional processes with eco-friendly alternatives. It has launched several initiatives to reduce water consumption, increase efficiency, and promote responsible sourcing of materials. In conclusion, Arvind Ltd is an established company that has been at the forefront of textile manufacturing for almost a century. Its commitment to innovation, sustainability, and quality has helped the company become one of the leading players in the Indian textile industry. Welspun Group – Welspun Group is a global enterprise that specializes in providing home textiles, steel pipes and infrastructure solutions. Founded in 1985, it is one of India’s leading business groups and has diversified operations across the globe. The company’s main business divisions include Home Textiles, Steel Pipes, Infrastructure Solutions and B2C Services. Home Textiles: Welspun is one of the world’s largest producers of terry towels, bed linen and mattress protectors. It offers an extensive range of quality yarns, fabrics and value-added products for the home textile industry. Steel Pipes: Welspun’s pipes business produces tubular steel products for the Oil & Gas, Automotive, Refineries & Petrochemicals, Power Generation and other industries. The company offers a wide range of seamless, welded and extruded steel pipes and tubes in various sizes and materials to meet customers’ requirements. Infrastructure Solutions: Welspun provides turnkey engineering and construction services for power, water and sewage systems. The company also offers project management services, including planning, design, implementation, supervision and operation of industrial projects. B2C Services: Welspun provides consumer-focused services such as home décor, furniture rental and financial services. Welspun also operates an online marketplace that connects customers with over 8000 sellers and 500 retailers. The Welspun Group has over 15,000 employees spread over 30 countries and serves more than 50 countries worldwide. The Group has established a strong presence in the US, UK, China, Middle East, South Africa and Latin America and is consistently ranked among the top 10 home textile companies in the world. Alok Industries – Alok Industries is a leading global textile and apparel company, headquartered in Mumbai, India. Founded in 1986, Alok Industries has grown to become a major player in the international textile industry, specializing in denim fabrics, home textiles, and finished garments. The company owns and operates several modern production facilities across India and Bangladesh, offering a full range of services from yarn manufacturing to garment processing. Alok Industries is committed to maintaining the highest standards of quality, safety, and sustainability, and sources all of its raw materials from certified suppliers. Alok Industries manufactures an extensive range of textiles for men, women, and children, including denim, corduroy, twill, poplin, chambray, and more. The company also produces terry cloths and bed linens, as well as finished knitted and woven garments for retail, private label, and institutional customers. With over 30 years of experience in the industry, Alok Industries has established itself as a reliable producer of top-quality products that meet the needs of sophisticated markets around the globe. Aditya Birla Group – Aditya Birla Group is a leading multinational conglomerate with its headquarters in Mumbai, India. The group operates in 35 countries across 6 continents and is one of the top 10 largest conglomerates in the world. It was founded in 1857 by Seth Shiv Narayan Birla and is currently managed by Kumar Mangalam Birla who serves as the chairman of the group. Aditya Birla Group operates in multiple industries including chemicals, textiles, financial services, telecom, IT, retail, engineering and construction, and many more. The group also has significant investments in non-manufacturing businesses such as real estate, hospitality, media, commodities, health care and logistics. Aditya Birla Group employs over 120,000 people worldwide. The company has won numerous awards for its contribution towards economic development, environmental sustainability, and corporate social responsibility. The group has a strong presence in India with core business operations spread across multiple states. It is one of India’s largest employers with more than 70,000 people employed in manufacturing and services. Aditya Birla Group owns major brands such as Grasim Industries, UltraTech Cement, Hindalco Industries, Idea Cellular, and Aditya Birla Nuvo. Aditya Birla Group has placed sustainability at the core of its business operations and actively works to reduce environmental impacts and create positive economic and social value. The company has invested in renewable energy, water conservation, pollution prevention, waste management and green building initiatives. Moreover, it has taken steps to ensure that its supply chain is sustainable and responsible. Through various CSR initiatives, the group has focused on education, healthcare, infrastructure, livelihood and skill development and sports. Aditya Birla Group is committed to providing quality products and services at competitive prices and is continuously innovating to enable a better future for all stakeholders. With an unwavering focus on customer satisfaction, Aditya Birla Group is dedicated to creating value for all its customers and partners. Trident Group – The Trident Group is a diversified industrial conglomerate headquartered in London, England. Founded in 1994, it has been a leading player in the industrial sector for over two decades. The company specializes in manufacturing and distribution of industrial products such as motors, pumps, compressors, valves, gears, bearings and other components. Through its various subsidiaries, it also provides engineering services and project management services to customers worldwide. In addition to its industrial business, Trident Group also operates in the energy sector. It produces and distributes oil, gas and renewable energy solutions. Its portfolio includes exploration and production, refining and marketing, petrochemicals and power generation businesses. Trident Group also has a strong presence in infrastructure development. It offers project management, engineering design, construction, procurement and commissioning services to customers in both urban and rural areas. It is also engaged in several large-scale projects in Africa, Middle East, China and India. The organization is committed to sustainability and invests heavily in research and development. It has won several awards and recognitions for its commitment to environmental protection and corporate responsibility. It is also committed to providing high quality products and services to its customers. Trident Group is led by a team of experienced and highly dedicated professionals who strive to maintain its standards of excellence. In addition, it actively encourages its employees to be innovative and creative in their work. As a result, the organization has achieved significant growth and success in the last few years. Bombay Dyeing – Bombay Dyeing is a multinational textile company that was founded in 1879. It is one of the oldest and most successful textile companies in India and is renowned for its high-quality products and innovative designs. The company has over 1000 outlets across the country and exports its products to more than 60 countries worldwide. Bombay Dyeing’s primary focus is on manufacturing and marketing of apparel fabrics and home furnishing materials. It is known as a trendsetter in fashion industry and its product portfolio also includes bedsheets, quilts, pillow covers and towels. In addition, the company also produces yarns, garments and readymades. The company has two manufacturing units located in Thane, Maharashtra, and Surat, Gujarat. The plants have the latest technology and equipment for manufacturing processes such as spinning, weaving, dyeing, printing, embroidery, and finishing. All the mills are certified with ISO 9000 quality standards. Bombay Dyeing also has five retail stores across India which offers a wide range of products. Bombay Dyeing has invested heavily in research and development and has developed an extensive network of vendors and distributors who help them maintain the quality standards set by the company. Bombay Dyeing has introduced several new lines of products in recent years such as silk-satin sarees, designer formal wear, linen curtains, as well as menswear. The company has also launched a new range of eco-friendly fabrics made from natural fibers like cotton, hemp and bamboo. Thus, Bombay Dyeing is one of the leading textile companies in India and has built a strong reputation among customers for its quality and innovative products. Siyaram Silk Mills – Siyaram Silk Mills is an Indian textile company that specializes in producing high-quality silk fabrics. The company was founded in 1978 by Shri Siyaram Poddar and is now one of the country’s leading manufacturers of textiles. Their fabrics are used to make apparel, home furnishing products, and other items. They produce a variety of fabrics such as crepe, dupioni, Jacquard, dobby, taffeta, voile, organza, and more. The company has its manufacturing units located in Kolkata, Mumbai, and Surat. These factories are equipped with state-of-the-art machinery and have a team of skilled professionals who ensure that the textiles produced meet international quality standards. They also have a Research and Development (R&D) department that works on innovative designs for their products. Siyaram Silk Mills offers a wide range of products, such as dress materials, sarees, suits, lehengas, blouses, stoles, and much more. They also provide custom-made products to suit individual needs and preferences. Moreover, they take immense pride in providing excellent customer service and making sure that their customers are satisfied with their purchases. In addition to traditional fabrics, Siyaram Silk Mills is also known for their stylish, contemporary designs. They use a mix of modern technology and hand-weaving techniques to create unique and trendy fabrics for their customers. Their fabrics come in a variety of colours, textures, and patterns, so no two pieces are alike. Siyaram Silk Mills prides itself on its commitment to sustainability and ethical sourcing. They use eco-friendly dyes, sustainable materials, and production processes. They also adhere to strict labour laws and employ workers from certified suppliers only. Overall, Siyaram Silk Mills is a reliable and trusted provider of high-quality silk fabrics. Their innovative designs, excellent customer service, and commitment to sustainability make them a preferred choice for many consumers. KPR Mill Limited – KPR Mill Limited is a vertically integrated apparel manufacturing company. It was established in the year 1982 and has its headquarters in Tiruppur, Tamil Nadu, India. The company primarily deals in the production of knitted and woven garments for infants, children, women, and men. It also manufactures yarn, fibres and fabrics, as well as home textiles such as bed linens and towels. KPR Mill has over 35 years’ worth of experience in the textile industry and has around 50,000 employees across its facilities. The company has 12 state-of-the-art manufacturing plants which are fully equipped with advanced machinery, equipment and systems that adhere to international standards. KPR Mill produces nearly 30 million pieces of garments every year and caters to some of the renowned brands in the world, such as H&M, C&A, Zara, Walmart, Gap, and others. It has also made major investments in its infrastructure to stay ahead of the competition. KPR Mill has won numerous awards and accolades in recognition of its high-quality products, innovative designs, and sustainable processes. It is also certified under ISO 9001:2015 and SA 8000:2014 for its ethical compliance, providing assurance to its customers about the quality of its products. The company is committed to sustainability by complying with all applicable laws and regulations, conserving natural resources, preventing pollution and reducing greenhouse gas emissions. CONCLUSION In 2023, India’s textile industry is expected to continue its growth trajectory. The sector is estimated to reach a value of USD 220 billion by 2024, with exports reaching USD 40 billion. It is expected that the Indian textile industry will continue to benefit from government initiatives such as Make in India and the Tex-Tech India Scheme. Additionally, there has been an increase in investments in the sector due to technological advancements, with the emergence of automation and smart factories. This is likely to open up new opportunities for innovation and product development while also helping to reduce costs. Furthermore, the country’s large population and rising disposable incomes are expected to boost demand for textile products, creating further growth potential for the sector.","filter_flag":1}
