{"title":"CNN's Going Green explores the innovations protecting and purifying water - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvY25ucy1nb2luZy1ncmVlbi1leHBsb3Jlcy10aGUtaW5ub3ZhdGlvbnMtcHJvdGVjdGluZy1hbmQtcHVyaWZ5aW5nLXdhdGVyLTMwMTk3NTMxNy5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvY25ucy1nb2luZy1ncmVlbi1leHBsb3Jlcy10aGUtaW5ub3ZhdGlvbnMtcHJvdGVjdGluZy1hbmQtcHVyaWZ5aW5nLXdhdGVyLTMwMTk3NTMxNy5odG1s0gEA?oc=5","id":"CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvY25ucy1nb2luZy1ncmVlbi1leHBsb3Jlcy10aGUtaW5ub3ZhdGlvbnMtcHJvdGVjdGluZy1hbmQtcHVyaWZ5aW5nLXdhdGVyLTMwMTk3NTMxNy5odG1s0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvY25ucy1nb2luZy1ncmVlbi1leHBsb3Jlcy10aGUtaW5ub3ZhdGlvbnMtcHJvdGVjdGluZy1hbmQtcHVyaWZ5aW5nLXdhdGVyLTMwMTk3NTMxNy5odG1s0gEA?oc=5\" target=\"_blank\">CNN's Going Green explores the innovations protecting and purifying water<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CNN's Going Green explores the innovations protecting and purifying water - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvY25ucy1nb2luZy1ncmVlbi1leHBsb3Jlcy10aGUtaW5ub3ZhdGlvbnMtcHJvdGVjdGluZy1hbmQtcHVyaWZ5aW5nLXdhdGVyLTMwMTk3NTMxNy5odG1s0gEA?oc=5\" target=\"_blank\">CNN's Going Green explores the innovations protecting and purifying water<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled Water\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"HONG KONG, Nov. 2, 2023 \/PRNewswire\/ -- Water is one of the most precious resources on our planet – we use it to grow food, produce energy, and many products we use rely on it. It is interconnected with everything, and all living things need water to survive. Yet polluted waterways, dwindling access to reserves and declining ocean reefs are putting this vital element in peril. In this episode of Going Green, CNN visits the innovators around the world discovering new ways to protect, preserve and purify the lifeblood of our planet. CNN’s Going Green explores the innovations protecting and purifying water First, CNN visits Cape RADD, an organization in South Africa focused on conserving the Great African Sea Forest and the wildlife that live there. Cape RADD is dedicated to marine research that engages both biologists and citizen scientists. South Africa is one of the top global hotspots for sharks, and one project Cape RADD has embarked upon is studying the shy shark species. With the help of a high-tech shark monitoring database and photographs taken during citizen snorkelling dives, they're aiming to improve protections for these sharks and their habitat. CNN then explores a solar-powered desalination solution created by Elemental Water Makers, which aims to provide clean water in areas that are water-scarce or have limited access to electricity. More than 2 billion people globally do not have access to clean drinking water. After seeing one rural community in Madagascar facing this reality, the Dutch company's CEO Sid Vollebregt and co-founder Reinoud Feenstra were determined to find a solution for water scarcity. Their innovation was built around reverse osmosis - a water purification process that removes contaminants by pushing water through a porous membrane. Vollebregt tells CNN that one machine can create 22,000 liters of water on a single day, drastically improving lives of communities and improving illness rates. CNN then travels to the California, US to visit Epic Cleantec, a startup recycling wastewater into reusable non-potable water. The company seeks to make water use more circular by creating water recycling systems built within buildings themselves, thus eliminating the need to discharge wastewater into a sewer and transport it to a remote treatment facility. Epic Cleantec's CEO Aaron Tartakovsky says their system recycles up to 95% of a building's wastewater for reuse in non-potable applications like toilets and irrigation. They created a beer made from recycled water to show the potential of water reuse, which encourages people to rethink the way they perceive wastewater. Next, CNN visits Glanris, a company converting agricultural waste like rice hulls into a water filtration medium capable of removing contaminants and metals from water, all while sequestering carbon. Glanris was founded in Mississippi, US, right across America's largest rice-producing state, Arkansas, with the mission to take agricultural waste and turn it into biochar. Not only does this conversion process remove carbon dioxide from the normal carbon cycle, biochar can also be used in a variety of products like plastics, water filtration and battery anodes. Biochar's porous nature is also said to improve soil production by increasing water and nutrient retention in the soil. Its potential as a greener, lower cost solution to purifying water has also led Glanris to partner with Clear Genius, a water filter company, to develop a more sustainable filtration medium. Finally, CNN meets Bloom, a sustainable materials company that's turning toxic algae waste into plastics used in consumer products. While algae can be beneficial in many ways, pollution can turn algae into harmful blooms which can deplete oxygen levels, release toxins and kill aquatic life. 'Bloom Sustainable Materials' was thus born out of a desire to help solve this problem by cleaning waterways and creating eco-friendly plastic material out of the collected algae. Bloom's algae-blended products can be made into footwear, sporting gear and other wearables. Bloom says they have cleaned over a billion liters of water and sequestered over a million kilograms of CO2 from the atmosphere in the process. Going Green trailer: bit.ly\/3scH4Fx Going Green images: bit.ly\/3s39t0J Going Green microsite: https:\/\/cnn.it\/3bMvOqF Airtimes for 30-minute special: Saturday, 4th November at 1:30pm HKT Sunday, 5th November at 3am HKT About CNN International CNN's portfolio of news and information services is available in seven different languages across all major TV, digital and mobile platforms, reaching more than 475 million households around the globe. CNN International is the number one international TV news channel according to all major media surveys across Europe, the Middle East and Africa, the Asia Pacific region, and Latin America and has a US presence that includes CNNgo. CNN Digital is a leading network for online news, mobile news and social media. CNN is at the forefront of digital innovation and continues to invest heavily in expanding its digital global footprint, with a suite of award-winning digital properties and a range of strategic content partnerships, commercialised through a strong data-driven understanding of audience behaviours. CNN has won multiple prestigious awards around the world for its journalism. Around 1,000 hours of long-form series, documentaries and specials are produced every year by CNNI's non-news programming division. CNN has 36 editorial offices and more than 1,100 affiliates worldwide through CNN Newsource. CNN International is a Warner Bros. Discovery company. SOURCE CNN International","filter_flag":1}
{"title":"Sustainable Shoes: 13 Brands Creating Planet-Friendly Footwear - Pebble Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcGViYmxlbWFnLmNvbS9zdXN0YWluYWJsZS1zaG9lcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcGViYmxlbWFnLmNvbS9zdXN0YWluYWJsZS1zaG9lcy_SAQA?oc=5","id":"CBMiKGh0dHBzOi8vcGViYmxlbWFnLmNvbS9zdXN0YWluYWJsZS1zaG9lcy_SAQA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcGViYmxlbWFnLmNvbS9zdXN0YWluYWJsZS1zaG9lcy_SAQA?oc=5\" target=\"_blank\">Sustainable Shoes: 13 Brands Creating Planet-Friendly Footwear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pebble Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable Shoes: 13 Brands Creating Planet-Friendly Footwear - Pebble Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKGh0dHBzOi8vcGViYmxlbWFnLmNvbS9zdXN0YWluYWJsZS1zaG9lcy_SAQA?oc=5\" target=\"_blank\">Sustainable Shoes: 13 Brands Creating Planet-Friendly Footwear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pebble Magazine<\/font>","source.href":"https:\/\/pebblemag.com","source.title":"Pebble Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled Water\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Are you running in circles trying to find a pair of sustainable shoes? From materials to manufacturing—not to mention what to do with your favorite sneakers when they eventually wear out—there’s a lot to consider when choosing environmentally friendly footwear. If it seems like an uphill challenge, don’t worry. We’ll help you head straight to the finish line with our list of the most sustainable shoe brands for all your pro-planet footwear needs. So, who stopped us in our tracks during our hunt for the most sustainable shoe brands? Let’s start with our favorites. The Best Sustainable Shoe Brands There’s nothing wooly about Certified B Corp brand Babuuk’s ethical offerings. Their stylish unisex shoes are ethically manufactured using responsibly sourced mulesing-free wool. Thousand Fell designs its closed-loop shoes to be sustainable from the start. They prioritize natural and sustainable materials, including vegan leather from recycled water bottles, and all their women’s and men’s eco-friendly shoes are repairable and recyclable. 8000Kicks gets a high five for using sustainable hemp fabric and recycled materials to create eco-friendly men’s and women’s shoes. Whether you’re looking for fair trade flats, low-impact loafers, sustainable sandals, or conscious kicks, we’ve got your toes covered (or uncovered, depending on the style) with our ultimate list of the best sustainable shoe brands. To find out how we chose the brands on our list, skip down to the end of the article. 1. Baabuk Images by Baabuk Price Range | $39–$169 | Shop Baabuk Materials | Mulesing-free wool (from Portugal and New Zealand), natural latex, natural rubber, Thermoplastic polyurethane (TPU), and REACH-certified dyes. What We Love | We’re not sheepish about our love for this Certified B Corp’s ethical wool shoes and slippers. They take their environmental and social responsibility seriously and care about the animals and people in their supply chain. Baabuk’s Eco-friendly Shoes This Swiss brand offers sneakers, boots, ballerinas, eco-friendly slip-on shoes, and slippers, all made from responsibly sourced mulesing-free wool. The Urban Wooler is their low-rise sustainable shoe made from mulesing-free Portuguese wool and a TPU sole. We’ve personally tested these (in honey grey!) here at pebblemag and they’re incredibly comfortable, easy to slip on and surprisingly go with so many outfits. If you prefer a high-top sneaker, the Sky Wooler is made from the same wool but features a rubber and Nubuck sole. These ethical sustainable shoes are machine washable on a wool cycle. Choose between several stylish color combinations or custom design your own with their Baabuk by You option. Baabuk’s Sustainability Carbon Goals & Achievements | Keeping shoes in circulation for longer is key to creating a more sustainable shoe industry. Babuuk’s wool sneakers are machine washable, and you can buy a repair kit and replacement insoles to make them last longer. Baabuk has their own resale platform The Marketplace by Baabuk, and a recycling program where you can return your old shoes for donation or recycling for raw materials. Supply Chain | Babuuk’s eco-friendly wool shoes are made in Portugal, their slippers in Nepal, and their boots begin in Nepal before being finished in Portugal. Both manufacturing partners were chosen for their expertise and the use of traditional techniques. Nepalese employees (who are mainly female) receive wages 25% higher than the national average and benefit from good working conditions. Diversity, Equity & Inclusion | All of Baabuk’s shoes are unisex. To staff its logistics center in Switzerland, Babuuk partners with the BVA Foundation to provide employment opportunities to people with mental and physical disabilities. Pay It Forward | The Miss Baabuka Program is the brand’s joint initiative with ProSpecieRara (the Swiss foundation for the cultural and genetic diversity of plants and animals) to protect native endangered sheep. Shop Baabuk 2. ABLE Images by ABLE Price Range | $98–$158 | Shop ABLE Materials | Eco-friendly leather shoes made from byproduct leather (from discarded hides), deadstock leather, rubber, cotton, tweed, and memory foam. ABLE’s leather manufacturing partners use a closed-loop water system and “semi-veg tanning,” a combination of vegetable and chrome tanning. What We Love | Nashville-based ABLE offers some of the best sustainable women’s shoes for all occasions. They’re committed to women’s empowerment, body inclusivity, and creating high-quality shoes that will last a long time. Able’s Sustainable Women’s Shoes For sustainable shoes in the USA, ABLE caters to all our footwear needs with its collection of boots, flats, heels, sandals, and sneakers. For summer-ready sustainable slip-on shoes, the Whitney Sandal features chunky adjustable straps with gold-toned buckles and a padded footbed for all-day comfort. Beyond footwear, we love ABLE for its collection of ethical clothing, including dresses, tops, bottoms, coats, jackets, and a range of accessories. Able’s Sustainability Carbon Goals & Achievements | All of ABLE’s ethical and sustainable shoes are guaranteed for life. Supply Chain | ABLE partners with suppliers who share their values and have created their own third-party auditing process. Together with Nisolo, they launched the Lowest Wage Challenge and are working to ensure living wages throughout their supply chain. Diversity, Equity & Inclusion | Over 90% of staff are female. In addition to earning a living wage, employees benefit from a share in the company, full maternity pay, flexible working, fully paid healthcare options, and support with infertility and adoption. ABLE embraces body inclusivity and designs clothing for all bodies. Pay It Forward | ABLE works closely with its suppliers to support female employment and empowerment. Shop ABLE 3. Thousand Fell Images by Thousand Fell Price Range | $125–$135 (+$20 recycling deposit) | Shop Thousand Fell Materials | Vegan leather (from recycled bottles coated with a corn waste resin and natural quartz), natural rubber, recycled rubber (from yoga mats), castor bean oil, aloe vera, coconut husks, palm leaf fibers, and sugar cane. What We Love | Thousand Fell’s closed-loop eco-friendly skate shoes are designed to be recycled when they eventually wear out. Their durable recycled kicks are also vegan and made from several recycled materials, including food waste. Thousand Fell’s Sustainable Skate Shoes For classically styled, super comfortable sneakers, Thousand Fell has you (and specifically your feet) covered. Their shoes are breathable and stain-resistant and feature an odor-resistant aloe vera-coated liner. We’ve tried two of their vegan, sustainable shoes, the Women’s Lace-Up and the Women’s Slip On. The slip-ons hug the foot securely and are comfortable and light, while the lace-ups offer some extra support. Both are super comfortable. Thousand Fell claims their vegan shoes are tested to last for 2.4 million steps, and we could certainly imagine walking thousands of miles in these. Thousand Fell’s Sustainability Carbon Goals & Achievements | Recyclable sneakers made from sustainable materials are a much better deal for the environment. Thousand Fell also practices carbon offsetting and uses bicycles for local deliveries in NYC. Supply Chain | The brand’s sustainable men’s shoes and women’s shoes are made in Brazil by a family-owned factory. Pay It Forward | Donated shoes find a new home with someone in need via the brand’s partnership with Soles4Souls. Shop Thousand Fell 4. 8000Kicks Images by 8000Kicks Price Range | $129–$199 | Shop 8000Kicks Materials | For uppers and insoles, 8000Kicks’s eco-friendly canvas shoes feature hemp fabric, one of the most sustainable natural materials. Outer soles are either Bloom foam algae, recycled rubber, or recycled plastic. What We Love | Hemp shoes won’t get you high, but they are highly sustainable. Those from 8000Kicks combine hemp fabric with several other eco-friendly materials to help you tread a little lighter on the planet. They’re 100% vegan, too. 8000Kicks Sustainable Hemp Shoes 8000Kicks’ eco-friendly women’s shoes and men’s shoes come in four different styles. Two styles of sneakers, a Chelsea boot, and a slip-on. Their signature model, the Explorer V2 might easily be one of our favorite eco-friendly athletic shoes. Available in several different colors, the minimalist, versatile design is ready for everyday adventures. It’s durable, lightweight, and waterproof to boot. We’ve recently tested the Explorer V2 and find the waterproof feature super handy, especially for things like commuting and walking the dog on a rainy day. Although we did find the sizing ran a little big in the women’s version (men’s seemed to be fine). 8000Kicks Sustainability Carbon Goals & Achievements | The brand’s manufacturing partners use some renewable energy, and 800Kicks is working with them to increase this amount. Supporting hemp farms and tree planting also helps to capture carbon. Supply Chain | 8000Kick’s vegan shoes are made in China and Portugal by partners selected on the basis of high quality and experience of working with hemp. Regular inspections ensure good working conditions and adherence to the brand’s Code of Conduct. Shop 8000Kicks 5. Allbirds Images by Allbirds Price Range | $55–$170 | Shop Allbirds Materials | TENCEL™ lyocell ( from FSC-certified eucalyptus tree fiber), ZQ-Certified Merino Wool, FSC-certified natural rubber, Proforest-certified SweetFoam®, castor bean oil, bio-TPU, recycled polyester, and recycled nylon. What We Love | Allbirds creates some of the best all-round sustainable footwear. They pioneer the use of renewable, natural materials, support regenerative farming, and take their carbon footprint seriously. Allbirds’ Sustainable Shoes The Allbirds collection includes casual sneakers, running shoes, hiking shoes, flats, sandals, and sustainable slip-on shoes for men, women, and kids. We’ve been running with the Women’s Tree Flyer for about 6 months and love how lightweight and comfortable they are. With a breathable TENCEL™ lyocell upper and ZQ-certified wool heel lining, they’re the perfect running shoe for warmer weather. We’ve also previously tested one of Allbirds’ original products, the Wool Runner which will always be an all time favorite for comfort and style. We wore them for years until they literally got holes in the toes so we can vouch for their durability too. We’d also recommend following the washing instructions if you plan to wash your Allbirds in the washing machine. We did not follow instructions with ours, which resulted in tears as the insoles have never quite been the same. Allbirds also offers sustainable kids’ shoes, so you can kit your mini-me out in planet-friendly footwear, too. Allbirds’ Sustainability Carbon Goals & Achievements | The Carbon Neutral certified brand is on track to cut its carbon impact in half by 2025. They’ve created the world’s first net-zero carbon shoe – M0.0NSHO – due for release next year. Supply Chain | WRAP-certified factories make Allbird’s comfortable sustainable shoes in Vietnam and Korea. Pay It Forward | The brand’s partnership with Soles4Souls means lightly worn shoes are donated to those in need. Shop Allbirds 6. Cariuma Images by Cariuma Price Range | $79–$169 | Shop Cariuma Materials | Leather and suede sourced from LWG Gold Rated tanneries, organic cotton, FSC, and OEKO-TEX-certified bamboo, Braskem I’m green EVA (from sugarcane), mamona oil, natural rubber, GRS certified recycled PET (from plastic bottles), bluesign® approved dye chemicals. What We Love | Cariuma combines sustainable materials and ethical manufacturing to create eco-friendly shoes with a laid-back, retro aesthetic. Cariuma’s Eco-friendly Skate Shoes Whether you’re looking for sustainable skate shoes or just dig the old-school aesthetic, Cariuma’s classic collection of high-tops, low-low tops, and slip-ons keeps sustainability high on the agenda. Good news, too, if you’re looking for vegan eco-friendly shoes, as 65% of Cariuma’s line is vegan. The vegan models in their OCA High and OCA Low collections feature a cotton canvas upper paired with a bio-based insole and natural rubber soles. Choose between several colors and prints, including some more unique designs through their numerous collaborations. We’ve tested two pairs from their skate range, one chosen for skating and one chosen for nostalgia (anyone remember the Converse days?), both of which have lived up to expectations and bring the ‘cool’ factor to any outfit. Cariuma’s Sustainability Carbon Goals & Achievements | This Certified B Corp considers climate by using a solar-powered warehouse, which is LEED Gold and ISO 14001:2015 certified. Express shipping is carbon neutral via DHL’s GoGreen, and their Reforestation Programme is helping to restore Brazilian rainforests. Supply Chain | Cariuma’s sustainable footwear is made in a WRAP GOLD-certified factory with regular audits ensuring high social standards. They have a comprehensive Code of Conduct and are working to increase traceability at each level of their supply chain. Pay It Forward | To capture carbon and pay it forward for the planet, Cariuma plants two trees for each pair of shoes they sell. Shop Cariuma 7. Icebug Images by Icebug Price Range | $129–$249 | Shop Icebug Materials | GRS-certified recycled PET, Responsible Wool Standard (RWS) wool, recycled wool, leather from Leather Working Group Gold-Rated tanneries, EVA mixed with BLOOM™ algae foam, supercritical foam, Ortholite® foam, recycled rubber, natural rubber, recycled plastic, recycled nylon, OEKO-TEX and bluesign®-approved GORE-TEX. What We Love | For outdoor footwear, including sustainable winter shoes, Swedish brand Icebug has your feet covered—whatever the terrain. Scan the QR code on each product tag to learn about its impact. Icebug’s Eco-friendly Winter Shoes One of the best sustainable shoe brands for outdoor enthusiasts, Icebug offers eco-friendly hiking shoes, walking shoes, running shoes, and winter boots. The Larvik Hemp Biosole is a perfect all-around boot for everyday activities. It features a water-repellent upper made from hemp and nubuck and temperature-regulating hemp and wool padding. For summer adventure-ready sneakers, the Eli RB9X is made from 34% recycled and 13% bio-based materials and comes in eight beautiful colors. Icebug’s Sustainability Carbon Goals & Achievements | This Certified B Corp aims to halve its carbon emissions by 2030. The Solar Rooftop Scaling Program is helping to decarbonize its supply chain in Vietnam; they use boat transport instead of air freight and support a carbon dioxide tax. Supply Chain | Icebug’s eco-friendly footwear is made in Vietnam and China. They’re a member of the Fair Wear Foundation and work closely with their suppliers to ensure fair wages and safe working conditions. Pay It Forward | This 1% for the Planet Member donates to several organizations, including Protect our Winters and Naturarvet. Shop Icebug 8. Alohas Images by Alohas Price Range | $90–$400 | Shop Alohas Materials | Materials for uppers include Leather Working Group Certified leather, vegan leathers (from cactus, apple, and corn), a polyester and recycled polyester blend, and 100% cotton. Insole materials include leather, recycled polyamide, and a polyurethane and polyester blend. Materials for outsoles include rubber, recycled rubber, and 100% Cuerolite. We’re not sure what material the Cuerolite soles are made from, so we will be contacting the brand to find out. What We Love | Say hello to slow fashion with Alohas’ handcrafted shoes available on a pre-order basis. Their vegan collection is easily searchable from the main menu, and there are plenty of stylish options for year-round footwear. Aloha’s Sustainable Handcrafted Shoes Whether you’re looking for boots, clogs, flats, heels, loafers, mules, sandals, or sneakers, Alohas offers stylish, timeless shoes for every occasion. For classic sustainable summer shoes that will never go out of style, their Crossed-Cream Vegan Leather Espadrilles are made from 100% vegan corn leather with a recycled polyamide insole and 100% jute outsole. They feature an adjustable ankle strap and come in Black, Beige, Cream, or Brown. Aloha’s Sustainability Carbon Goals & Achievements | Alohas’ pre-order business model reduces waste from overproduction, and local manufacturing helps to lower the brand’s carbon footprint. Supply Chain | Designed in Barcelona, Alohas’ sustainable footwear is handcrafted by skilled artisans in Alicante. The Aloha team regularly visits its suppliers to ensure excellent working conditions. Pay It Forward | The carbon offset feature on the brand’s website enables you to add a donation to a carbon offset project of your choosing. Current options include renewable energy and forest regeneration projects. Shop Alohas 9. Nisolo Images by Nisolo Price Range | $90–$260 | Shop Nisolo Materials | All women’s and men’s eco-friendly shoes are made from leather (95% from Leather Working Group Certified tanneries), memory foam (for insoles),and natural rubber and wood (for heels and heel caps). What We Love | Nashville-based Nisolo offers stylish and sustainable leather shoes for every occasion. We love their comprehensive Sustainability Facts Label that provides the full low-down on each product’s impact. Nisolo’s Sustainable Leather Shoes Nisolo’s stylish collection of women’s and men’s sustainable shoes includes boots, loafers, oxfords, slip-ons, sandals, and sneakers. With classic, timeless designs, these shoes are ready to accompany you to the office, on your next vacation, to a formal event, or even brunch with friends. The Women’s Huarache Sandal is one of our summer wardrobe staples. Made from soft, water-resistant leather (that does take a little breaking in), the breathable, closed-toe design and cushioned midsole will see you through your day in comfort and style. Nisolo’s Sustainability Carbon Goals & Achievements | This Climate Neutral certified brand is on a journey to 0% Net Carbon. They’ve installed solar panels on their Peru factory roof and partnered with Ecosphere+ to offset their emissions by supporting forest conservation projects. Supply Chain | Co-founder of the Lowest Wage Challenge Nisolo pays 100% living wages at its factory in Peru, where most of the leather shoes are made. They also partner with ethical manufacturers in Mexico, and their artisan jewelry is made in Kenya. Pay It Forward | Nisolo’s shoe reclamation program donates pre-loved shoes to Soles4Souls, who ensure they go to those who most need them. Shop Nisolo 10. Rothy’s Images by Rothy’s Price Range | $119–$249 | Shop Rothy’s Materials | Rothy’s uppers are knitted from recycled plastic bottles. They prioritize natural, bio-based, and recycled materials for the rest of the shoe, including algae-based foam, natural rubber, recycled rubber, bio-based TPU, and natural minerals. What We Love | Colorful, fun, machine washable, and made from recycled plastic, there’s a lot to love about the eco-friendly, sustainable shoes from this San Francisco-based brand. Rothy’s Recycled Plastic Shoes Rothy’s offers flats, loafers, mules, sandals, and slip-ons for women. They also offer a selection of eco-friendly shoes for men and some cute and colorful kids’ shoes. Made from 11 recycled water bottles, The Flat is Rothy’s sustainable take on a classic ballet shoe. The soft, flexible upper provides a glove-like fit, and you can pop them in the washing machine for a refresh. The only challenge might be choosing between the 22 different colors\/patterns. Rothy’s Sustainability Carbon Goals & Achievements | Beyond using sustainable materials, Rothy’s is working to lower their emissions by using renewable energy and practicing carbon offsetting. Rothy’s knit their uppers using a 3D printing technology that produces 30% less material waste than traditional methods. They’re working towards a fully circular production process where the raw materials from their shoes can be recycled into new products. Supply Chain | Rothy’s owns and operates their LEED Gold-certified factory in China. Earlier this year, their factory also received TRUE Platinum certification for its zero waste practices. Pay It Forward | Rothy’s has partnered with Dress For Success, donating shoes to support the organization’s work empowering women. They also regularly contribute to the Breast Cancer Research Foundation. Shop Rothy’s 11. Thesus Images by Thesus Price Range | $138–$209 | Shop Thesus Materials | This eco-friendly shoes brand’s materials include recycled ocean plastic, recycled natural rubber, recycled foam, recycled PU (from car dashboards), recycled nylon, recycled foam, and recycled plastic bottles. What We Love | Thesus creates its stylish and functional vegan footwear from 95% recycled materials, making it a go-to brand for those seeking vegan, eco-friendly shoes. Thesus’ Vegan Eco-friendly Shoes For sustainable walking shoes that are equally suited to hitting the trail and traversing urban terrain, Thesus’s Weekend Boot helps you spend your day off without worrying about the ecological footprint of your footwear. The upper is made from 100% recycled ocean plastic, the outsole from 45% recycled natural rubber, the insole from 100% recycled nylon, and the laces from 100% recycled plastic bottles. Did we mention they come in some fabulous colors, too? Thesus also offers a versatile clog and the Anyday Rain Boot, so you can get outside whatever the weather. Thesus’ Sustainability Carbon Goals & Achievements | The brand’s extensive use of recycled materials is an excellent step towards cutting carbon costs, and their ultimate goal is to become climate-positive. Supply Chain | All of Thesus’s vegan, eco-friendly sustainable shoes are made by carefully chosen factories in Portugal that pay a living wage. Diversity, Equity & Inclusion | This BIPOC woman-owned company is committed to ensuring equal employment opportunities and celebrating diversity in all its forms. Shop Thesus 12. VEJA Images by VEJA Price Range | $70–$245 | Shop VEJA Materials | For its vegan-friendly uppers VEJA uses organic and regenerative cotton canvas coated with a 54% bio-based coating. Non-vegan models feature chrome-free leather from LWG Gold-certified and REACH-compliant tanneries. Other materials include recycled polyester, EVA, rubber, also natural rubber, rice waste, and sugarcane. What We Love | Are VEJA shoes sustainable? Yes! VEJA is committed to transparency and shares all the details of its journey towards sustainability. Materials are responsibly sourced, and VEJA goes the extra mile to support Amazonian farmers paying above the market prices. Veja’s Vegan & Eco-friendly Shoes VEJA’s classically styled sneakers are a versatile wardrobe essential. They offer several styles for men and women and a great selection of eco-friendly kids’ shoes, too. Keep it old-school with the Wata II Low Top Sneaker. It features a 100% organic and regenerative cotton upper, an insole made with sugarcane, recycled EVA, Amazonian rubber, and organic cotton, and an outsole made from Amazonian rubber and recycled rubber. Veja’s Sustainability Carbon Goals & Achievements | The emissions for each pair of VEJA’s shoes are listed in the product description. This Certified B Corp has calculated its Scope 1, 2, and 3 emissions and published all the findings in the VEJA Carbon Footprint report. Supply Chain | VEJA’s eco-friendly shoes are manufactured in Brazil, where they also source most of their materials. Workers are paid fairly and have safe working conditions. The brand works directly with its cotton producers in Brazil and Peru and pays for 50% of the harvest in advance. Diversity, Equity & Inclusion | VEJA has partnered with Log’ins to provide employment opportunities for disabled adults at its warehouse in Paris. Shop VEJA 13. Will’s Vegan Store Images by Will’s Vegan Store Price Range | $58–$194 | Shop Will’s Vegan Store Materials | Most of Will’s Vegan Store’s footwear is made from vegan bio-based leather produced in Italy. This contains 31% polyurethane but is free of PVC and PFCs. A few designs are made from a PU vegan suede that is OEKO-TEX-certified and REACH-compliant. Other materials include recycled polyurethane, rubber, TR, and polyester. What We Love | For sustainable shoes in the UK, PETA-approved brand Will’s Vegan Store offers plenty of wardrobe staples – all vegan, of course, and with plastic-free packaging to boot. Wills Vegan Stores’ Sustainable Vegan Shoes From Ballerina Flats to Waterproof Hiking Boots (and everything in between), WVS offers vegan shoes for every occasion and activity. For everyday ethical boots, the popular Luxe Smart Chelsea Boots are made from Italian vegan leather and feature a cushioned recycled insole for maximum day-long comfort. Wills Vegan Stores’ Sustainability Carbon Goals & Achievements | Will’s Vegan Store is Carbon Neutral certified. They offset all of their emissions by investing in environmental projects. Supply Chain | Everything is made in Italy and Portugal following strict EU employment laws. Their Netherlands warehouse reduces the shipping distance to their EU customers and, consequently, their carbon footprint. Shop Will’s Vegan Store","filter_flag":1}
{"title":"New lithium discovery highlights why we never run out of resources - Yield PRO magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8veWllbGRwcm8uY29tLzIwMjMvMTEvbmV3LWxpdGhpdW0tZGlzY292ZXJ5LWhpZ2hsaWdodHMtd2h5LXdlLW5ldmVyLXJ1bi1vdXQtb2YtcmVzb3VyY2VzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8veWllbGRwcm8uY29tLzIwMjMvMTEvbmV3LWxpdGhpdW0tZGlzY292ZXJ5LWhpZ2hsaWdodHMtd2h5LXdlLW5ldmVyLXJ1bi1vdXQtb2YtcmVzb3VyY2VzL9IBAA?oc=5","id":"CBMiYGh0dHBzOi8veWllbGRwcm8uY29tLzIwMjMvMTEvbmV3LWxpdGhpdW0tZGlzY292ZXJ5LWhpZ2hsaWdodHMtd2h5LXdlLW5ldmVyLXJ1bi1vdXQtb2YtcmVzb3VyY2VzL9IBAA","guidislink":false,"published":"Fri, 03 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=307, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8veWllbGRwcm8uY29tLzIwMjMvMTEvbmV3LWxpdGhpdW0tZGlzY292ZXJ5LWhpZ2hsaWdodHMtd2h5LXdlLW5ldmVyLXJ1bi1vdXQtb2YtcmVzb3VyY2VzL9IBAA?oc=5\" target=\"_blank\">New lithium discovery highlights why we never run out of resources<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yield PRO magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New lithium discovery highlights why we never run out of resources - Yield PRO magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8veWllbGRwcm8uY29tLzIwMjMvMTEvbmV3LWxpdGhpdW0tZGlzY292ZXJ5LWhpZ2hsaWdodHMtd2h5LXdlLW5ldmVyLXJ1bi1vdXQtb2YtcmVzb3VyY2VzL9IBAA?oc=5\" target=\"_blank\">New lithium discovery highlights why we never run out of resources<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yield PRO magazine<\/font>","source.href":"https:\/\/yieldpro.com","source.title":"Yield PRO magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled Water\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A new discovery of lithium in September led to a flurry of headlines touting the finding as one of the biggest lithium deposits in history. The discovery comes amid fears that a shift towards electric vehicles would exhaust too much of the world’s supply of lithium—an important component in batteries. Fear about the availability of lithium is only the latest doom and gloom prediction about humanity’s access to resources. Throughout the 20th century, experts predicted that we would run out of food, land, and oil among other things. Consider for example the history of “peak oil” predictions in the U.S. As the timeline above shows, we’ve been on our last 13 years of oil for 84 years now. Why are predictions about resource availability so biased in the direction of doom and gloom? To see why, we need to turn to one of my favorite economists—Julian Simon. The failure of technical forecasts Over the course of your life, you’ve probably heard that we’re “running out” of a particular resource. In fact, sometimes experts even boldly make predictions about how we have a specific number of years left before we run out. Where does this information come from? Well, technical forecasts of resource availability rely on two factors: the quantity of a resource available and the rate of consumption. For example, if a community only has 100 gallons of oil, and they use 10 gallons per day in their cars, the oil will only last 10 days. In the late Julian Simon’s book, The Ultimate Resource 2, he highlights that this approach is fundamentally flawed. The problem is that experts don’t have access to either the physical quantity of a resource available or the future rate of consumption for resources. To substitute for this, technical forecasts use the data that are available. The problem is, those data always underestimate the availability of resources. One such data point used to figure out the amount of resources available is known reserves. That is, the amount of a resource that we know exists. The problem with this can be seen by considering incentives. A significant amount of known reserves are discovered by private businesses searching for more of a scarce resource. If you are a lithium mining company with 10 years of supply on hand, there is no need to seek out more. Businesses will only spend to search for new deposits as long as the benefits from discovery are greater than the costs. However, as supplies start to run short, prices for raw materials rise. When the price of a resource rises, the benefits to discovering more of the resource rises. As a result, businesses will begin to search for new reserves when they start to run out. In practice, this means estimates on resource availability will always appear to stay barely ahead of short-term consumption needs. Since businesses only look for more of a resource when the known reserves start to run out, the known reserves will always appear to be running out, even though total reserves (known + unknown) are likely not. Substitutes in everything The other factor, the consumption rate, has a similar problem. As resources become more scarce, prices rise, which forces consumers to economize. For example, when gas is more expensive, people buy less gas. When consumers cut back their consumption of resources like gas they try to find substitute goods. Someone may choose to bike to work or finally spend the time to figure out the public transit paths. Meanwhile, companies try to innovate and create new products which solve consumers’ problems. These innovations often replace the original desire for the increasingly scarce resource. For example, Zoom, in many cases, has replaced the use of gasoline. So as we run out of a particular resource, we should expect consumers will consume less of it. As such, technical forecasts will always assume consumers will over-consume relative to reality. So large discoveries of lithium should be no surprise. As demand increases, I expect the known reserves to continue to increase. And even as lithium reserves do begin to diminish, the profit motive strengthened by increasing prices will drive self-interested businesses to create clever new substitutes. I’ll conclude with Simon’s brilliant illustration of this tendency. “People’s response to the long trend of falling raw-material prices often resembles this parody: We look at a tub of water and mark the water level. We assert that the quantity of water in the tub is ‘finite.’ Then we observe people dipping water out of the tub into buckets and taking them away. Yet when we re-examine the tub, lo and behold the water level is higher (analogous to the price being lower) than before. We believe that no one has reason to put water into the tub (as no one will put oil into an oil well), so we figure that some peculiar accident has occurred, one that is not likely to be repeated. But each time we return, the water level in the tub is higher than before—and water is selling at an ever cheaper price (as oil is). Yet we simply repeat over and over that the quantity of water must be finite and cannot continue to increase, and that’s all there is to it. Would not a prudent person, after a long train of rises in the water level, conclude that perhaps the process may continue—and that it therefore makes sense to seek a reasonable explanation? Would not a sensible person check whether there are inlet pipes to the tub? Or whether someone has developed a process for producing water? Whether people are using less water than before? Whether people are restocking the tub with recycled water? It makes sense to look for the cause of this apparent miracle, rather than clinging to a simpleminded fixed-resources theory and asserting that it cannot continue.” Author Peter Jacobsen is a Writing Fellow at the Foundation for Economic Education","filter_flag":1}
{"title":"Victoria’s New Recycling Scheme Is Serving Us Utopian Slay - The Latch","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdGhlbGF0Y2guY29tLmF1L3ZpY3RvcmlhLXJlY3ljbGluZy1zY2hlbWUv0gE2aHR0cHM6Ly90aGVsYXRjaC5jb20uYXUvdmljdG9yaWEtcmVjeWNsaW5nLXNjaGVtZS9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdGhlbGF0Y2guY29tLmF1L3ZpY3RvcmlhLXJlY3ljbGluZy1zY2hlbWUv0gE2aHR0cHM6Ly90aGVsYXRjaC5jb20uYXUvdmljdG9yaWEtcmVjeWNsaW5nLXNjaGVtZS9hbXAv?oc=5","id":"CBMiMmh0dHBzOi8vdGhlbGF0Y2guY29tLmF1L3ZpY3RvcmlhLXJlY3ljbGluZy1zY2hlbWUv0gE2aHR0cHM6Ly90aGVsYXRjaC5jb20uYXUvdmljdG9yaWEtcmVjeWNsaW5nLXNjaGVtZS9hbXAv","guidislink":false,"published":"Fri, 03 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=307, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdGhlbGF0Y2guY29tLmF1L3ZpY3RvcmlhLXJlY3ljbGluZy1zY2hlbWUv0gE2aHR0cHM6Ly90aGVsYXRjaC5jb20uYXUvdmljdG9yaWEtcmVjeWNsaW5nLXNjaGVtZS9hbXAv?oc=5\" target=\"_blank\">Victoria’s New Recycling Scheme Is Serving Us Utopian Slay<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Latch<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Victoria’s New Recycling Scheme Is Serving Us Utopian Slay - The Latch","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vdGhlbGF0Y2guY29tLmF1L3ZpY3RvcmlhLXJlY3ljbGluZy1zY2hlbWUv0gE2aHR0cHM6Ly90aGVsYXRjaC5jb20uYXUvdmljdG9yaWEtcmVjeWNsaW5nLXNjaGVtZS9hbXAv?oc=5\" target=\"_blank\">Victoria’s New Recycling Scheme Is Serving Us Utopian Slay<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Latch<\/font>","source.href":"https:\/\/thelatch.com.au","source.title":"The Latch","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled Water\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Attention, Victorian children, now is the time to get splashed in cash. Now is the time to make stacks upon stacks of pocket money— for you can now recycle your old Fanta cans for 10 cents apiece. By picking up litter, you will become the mogul of recess. On November 1, Victoria’s Container Deposit Scheme, CDS Vic, kicked off. This recycling scheme provides Victorians with a 10-cent refund for each can, carton, and bottle that they return to a collection zone. According to the Victorian Government, this recycling scheme will have a multitude of benefits. Not only will it recycle old containers into new products, but it has also created 600 jobs. One person who’s particularly stoked about this programme is Steve Dimopoulos, Victoria’s Minister for the Environment. “Our new Container Deposit Scheme is now open, which will reduce the amount of litter in Victoria by up to half, contributing to a more sustainable future while putting money back in the pockets of hardworking Victorians,” Dimopoulos said. “CDS Vic will maximise the number of cans, bottles, and cartons being recycled.” As it stands, there are around 400 cash-back sites in Victoria, with 47 Reverse Vending Machines being installed in different Coles locations. According to the Coles General Manager, Grocery Leanne White, these Reverse Vending Machines are going to vastly improve the lives of his patrons. “From Bendigo to Blackburn, Berwick and Braybrook, we want to help make recycling as easy as possible for our customers,” White said. “Now Victorian customers can be rewarded for returning their used cans, bottles, and cartons, with the option to put the funds towards their next shop at Coles, redeem for cash, give to a charity, or add it straight into their bank account.” Will Victoria’s Recycling Scheme Work? While NSW, Queensland, and Western Australia all operate similar recycling schemes, some believe that Victoria’s programme will need more support to be viable. One such person is Fatima Madani, an RMIT University Lecturer in Marketing. “To meet the Victorian Government’s target of diverting 80% of all material away from landfill by 2030, the CDS needs to constantly improve and sustain people’s behaviours,” Madani said. “It will be interesting to see how Victorians engage in the scheme and if they adopt it as a daily life routine and become active participants.” “Businesses benefiting from the scheme need to practise constant communication, instil convenient processes, and create ongoing connection. These are key pillars which will lead to repeated behaviour, continued engagement, a new recycling mindset, and lifestyle changes.” However, according to Victoria’s Premier, Jacinta Allan, the CDS Vic scheme might already be a state institution. “Just got some great news,” Allan noted. “More than one million containers were recycled on day one of the Container Deposit Scheme.” Victoria’s Recycling Scheme: All the Refund Locations If you want a map of all the CDS Vic locations, then please click the link here. Related: Drinking Recycled Water — Queensland’s Great Debate Related: Is Uber Green the Rideshare Revolution It Wants to Be? Read more stories from The Latch and subscribe to our email newsletter.","filter_flag":1}
