{"title":"Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact? - PYMNTS.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA","guidislink":false,"published":"Fri, 09 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=160, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5\" target=\"_blank\">Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PYMNTS.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact? - PYMNTS.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5\" target=\"_blank\">Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PYMNTS.com<\/font>","source.href":"https:\/\/www.pymnts.com","source.title":"PYMNTS.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"In recent years, sustainability has become a hot topic across various industries, including the retail sector. Companies are increasingly under pressure to adopt environmentally friendly practices and reduce their carbon footprint. However, the question remains: Are sustainable practices a drain on finances or do they actually create a positive impact on retail businesses? The recent news of Selfridges and Hermès quietly exiting the Fashion Pact amid slow progress sheds some light on this ongoing debate. Sustainable practices in the retail industry encompass a wide range of initiatives, from reducing waste and using renewable materials to promoting ethical sourcing and fair trade. While these practices are undoubtedly crucial for the long-term well-being of the planet, they can also come with significant upfront costs. Implementing sustainable measures often requires investments in research and development, supply chain restructuring, and changes in manufacturing processes. Critics argue that these financial investments can strain a company’s resources, particularly smaller retailers with limited budgets. They argue that the focus on sustainability diverts funds from other essential areas, such as product development, marketing and expansion. Furthermore, the initial costs associated with sustainable practices can sometimes outweigh the immediate benefits, leading to skepticism about their financial viability. However, it is important to recognize the long-term benefits of sustainability. Consumers today, especially millennials and Gen Z, are conscious of the environmental and social impact of their purchasing decisions. They are more likely to support and patronize brands that align with their values and demonstrate a commitment to sustainability. In fact, a study found that 73% of global consumers are willing to change their consumption habits to reduce their environmental impact. By adopting sustainable practices, retailers can tap into this growing consumer demand and position themselves as environmentally responsible. This can lead to increased customer loyalty, positive brand image, and even attract new customers who prioritize sustainability. As consumers become more educated and aware of the impact of their choices, companies that fail to embrace sustainability risk losing market share and relevance. Sephora and H&M Sephora and H&M, giants in the retail industry, stand out for their pioneering efforts in sustainability. These initiatives not only resonate with customers but also draw shoppers back into their physical stores. According to a PYMNTS report in April, Sephora unveiled an initiative called Beauty (Re)Purposed, designed to address the issue of difficult-to-recycle packaging waste within the beauty industry. The initiative has been implemented across 600 Sephora stores in the United States and Canada. Conversely, H&M introduced Close the Loop, a program that enables customers to bring their unwanted clothing to designated in-store recycling bins and receive a coupon for their next purchase. The initiative has collected over 155,000 tons of textiles. Read more: Sephora, H&M Sustainability Programs Bet on In-Store Traffic and Sales Selfridges, Hermès Walk Back Pact Selfridges, a U.K.-based department store, and Hermès, the luxury fashion brand, recently made headlines by quietly exiting the Fashion Pact. The Fashion Pact, launched in 2019, is a coalition of fashion and textile companies committed to reducing the industry’s impact on the environment. Selfridges and Hermès’ departure raises questions about the effectiveness and progress of such collective sustainability efforts. It is essential to consider the broader context. Sustainable practices require ongoing commitment, continuous improvement, and measurable results. It is possible that Selfridges and Hermès found the Fashion Pact’s progress to be slow or insufficient in addressing their specific sustainability goals. This does not necessarily imply a complete abandonment of sustainable practices but rather a shift towards alternative approaches that better align with their strategies. The fact that Selfridges and Hermès were part of the Fashion Pact in the first place demonstrates their recognition of the importance of sustainability in the retail industry. It is crucial to acknowledge that sustainability is a complex and evolving field, and there is no one-size-fits-all solution. Each company needs to assess its unique circumstances, business model, and sustainability objectives to determine the most effective path forward.","filter_flag":1}
{"title":"Five priorities for sustainable procurement in healthcare - Feature - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5\" target=\"_blank\">Five priorities for sustainable procurement in healthcare - Feature<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Five priorities for sustainable procurement in healthcare - Feature - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5\" target=\"_blank\">Five priorities for sustainable procurement in healthcare - Feature<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Time to act To enable the healthcare industry to make a meaningful contribution to the 2015 Paris Agreement and 2050 net-zero targets, we call on governments, purchasing agencies and procurement organizations in Europe to improve supplier evaluation criteria for Green Public Procurement across five key themes: Ensure that suppliers report their environmental impact (including emissions) and that they have a greenhouse gas emission (GHG) reduction plan in place Focus on circularity for health technology products and solutions Require supplier transparency on product performance and EcoDesign for products and equipment Require suppliers to demonstrate how digital offerings support decarbonization and dematerialization by optimizing resources and workflow efficiency Require suppliers to publicly report their social impact Find out more about these five key themes, and action you can take, by downloading our full guidance paper for European procurers. ","filter_flag":1}
{"title":"Upcycled Del Monte Foods, Inc. Products Named Snack Product - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA","guidislink":false,"published":"Fri, 16 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=167, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5\" target=\"_blank\">Upcycled Del Monte Foods, Inc. Products Named Snack Product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Upcycled Del Monte Foods, Inc. Products Named Snack Product - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNzcndpcmUuY29tL3ByZXNzX3JlbGVhc2VzLzc3Njk0MS11cGN5Y2xlZC1kZWwtbW9udGUtZm9vZHMtaW5jLXByb2R1Y3RzLW5hbWVkLXNuYWNrLXByb2R1Y3RzLXllYXItMjAyMy1taW5kZnVs0gEA?oc=5\" target=\"_blank\">Upcycled Del Monte Foods, Inc. Products Named Snack Product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The company has won accolades for its innovative snacking products, building on recognition already received this year for its new brand JOYBA® Published 06-16-23 Submitted by Del Monte Foods WALNUT CREEK, Calif., June 16, 2023 \/CSRwire\/ – Del Monte® Gut Love and Boost Me Fruit Cup® Snacks with Infusions have been recognized as the Overall Snack Products of the Year by the 2023 Mindful Awards. The Mindful Awards highlight conscious companies and products in the Consumer Packaged Goods (CPG) industry that stand up for what’s right and take action to make a positive impact on people and the planet. This recognition for Del Monte Foods speaks to the company’s purpose as Growers of Good® to nourish people and the planet by making nutritious foods more accessible to all. The Del Monte® Gut Love and Boost Me Fruit Cup® Snacks with Infusions are made with real fruit like mangos and pineapples, and are infused with antioxidants and natural ingredients including Vitamin C, nourishing prebiotics, and coffee extract, making better for you snacking delicious and convenient. The two new products add to Del Monte’s existing products that are Upcycled Certified. Through Gut Love and Boost Me Fruit Cup® Snacks, the company is re-directing approximately 130,000 pounds of pineapple juice each year, helping to provide nutritious and affordable food, while reducing greenhouse gas emissions. “We’re constantly innovating to make great-tasting products that are more convenient and accessible to meet the needs of consumers’ ever-changing habits and lifestyles,” said Bibie Wu, Chief Marketing Officer for Del Monte Foods. “This recognition is a testament to the hard work of our team members in using sustainable practices to ensure that food reaches its highest and best purpose, while creating delicious snacks that bring joy to nutritious eating.” Del Monte Foods has launched a slew of new products during the past five years using breakthrough technologies in ingredients, packaging and processes. One of its latest brands, JOYBA®, was recently recognized by the Refrigerated and Frozen Food Awards as part of the Best New Retail Products for 2023. The brand’s Blueberry Pomegranate Bubble Tea ranked third of five new products of the year, decided by consumer vote. JOYBA® Bubble Tea is a first of its kind line of boba shop-inspired ready to drink beverages made with real brewed tea and popping boba, conveniently available in retail stores nationwide. Del Monte® Gut Love and Boost Me Fruit Cup® Snacks are available at major national retailers including Walmart and Kroger. JOYBA® Bubble Tea is available at select Target, Walmart, Costco, Sam’s Club and Circle K. To learn more and to locate a store partner near you, please visit www.delmonte.com and www.joyba.com. About Del Monte Foods For more than 135 years, Del Monte Foods, Inc. has been driven by our mission to nourish families with earth's goodness. As the original plant-based food company, we're always innovating to make nutritious and delicious foods more accessible to consumers across our portfolio of beloved brands, including Del Monte®, Contadina®, College Inn®, Kitchen Basics®, JOYBA®, Take Root Organics™ and S&W®. We believe that everyone deserves great tasting food they can feel good about, which is why we grow and produce our products using sustainable and earth-friendly practices for a healthier tomorrow. Del Monte Foods, Inc. is the U.S. subsidiary of Del Monte Pacific Limited (Bloomberg: DELM SP, DELM PM) and is not affiliated with certain other Del Monte companies around the world, including Fresh Del Monte Produce Inc., Del Monte Canada, or Del Monte Asia Pte. Ltd. For more information about Del Monte Foods and our products, please visit www.delmontefoods.com or www.delmonte.com.","filter_flag":1}
{"title":"How to make climate finance work for everyone - World Economic Forum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA","guidislink":false,"published":"Mon, 19 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=170, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5\" target=\"_blank\">How to make climate finance work for everyone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How to make climate finance work for everyone - World Economic Forum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzA2L2NsaW1hdGUtZGVjYXJib25pemF0aW9uLWZpbmFuY2UtZXF1aXRhYmxlL9IBAA?oc=5\" target=\"_blank\">How to make climate finance work for everyone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","source.href":"https:\/\/www.weforum.org","source.title":"World Economic Forum","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Climate finance needs to be scaled up and redesigned so that governments, investors and businesses prioritize green solutions. Around $5 trillion will be needed every year by 2050 to meet climate and biodiversity goals, and scale new low-carbon technologies. Recent legislation such as the US Inflation Reduction Act shows how the public sector can steer markets in a new direction. The transition to a decarbonized economy offers the chance to eradicate poverty, reduce inequality and decent employment for all. Every day, governments, financial institutions and corporations have a choice to make: invest in physical assets that emit greenhouse gases and harm nature or prioritize the development of green solutions that foster a stable, resilient and equitable economy. As communities face the harsh impacts of climate change, the choice to build a sustainable future is becoming clearer. Estimates suggest around $5 trillion of capital will be needed every year by 2050 to meet climate and biodiversity goals. These investments are essential to research and scale new low-carbon technologies, to substitute the existing capital stock with sustainable alternatives, to shift business models away from harmful practices and to enable rich countries to support vulnerable ones in their climate resilience and biodiversity protection, all while ensuring that historically marginalized communities share in the broad prosperity created. Systems Change Lab is tracking six major shifts in the finance sector that can drastically transform how investments are scaled and allocated for a sustainable future. If these transformations are achieved together, it will enable the fundamental changes needed for the planet and people to thrive: Discover Accelerating Climate Action Show more A 2018 report by the Intergovernmental Panel on Climate Change found we have until 2030 – just 11 more years – to avert climate change. The run-up to 2020 is a crucial period for delivering sufficient climate action to limit global warming to 1.5°C, as countries move to expand their climate commitments. To help meet this global challenge, the World Economic Forum's 2019 Sustainable Development Impact summit has made Accelerating Climate Action one of four focus areas. Following the UN Secretary-General’s Climate Action Summit this month, this meeting will bring together stakeholders to cap global warming at 1.5°C through innovative partnerships and smart technologies. The action areas include heavy industries and transport, energy innovation, nature-based climate solutions, restoring ocean health and the role cities, among others. 1) Measure, disclose and manage climate- and nature-related financial risks The transition to a decarbonized and nature-positive future will disrupt products and services, especially those that have high emission outputs and are harmful to ecosystems. Not only are there risks to physical facilities, including factories and operations, but also to existing business models. Corporations, financial institutions and regulators must have access to information and a clear understanding of the risks and opportunities to target investments that advance sustainable transformations of their businesses. Accurate disclosures are needed to allow financial institutions and governments to deploy capital efficiently and monitor and manage risks at a portfolio and systemic level. An increasing number of corporations disclose their climate risks under standards created by the Sustainability Accounting Standards Board, which follows recommendations from the Taskforce for Climate-related Financial Disclosures. Analysis from the Systems Change Lab shows that 36% of the largest global companies have set climate risk disclosures (up from about 32% in 2021). By 2030, all of these businesses need to provide disclosures. There is also positive momentum regarding nature-related disclosures. The Taskforce for Nature-related Financial Disclosures framework is in the process of being finalized and has also received substantial support from the private sector. 36% of the world's largest global companies have set climate risk disclosures, expected to reach 100% before 2030. Image: Systems Change Lab Despite progress in adoption, disclosures have been on a voluntary basis with inconsistent quality and gaps in coverage. Governments must play a crucial role in mandating high-quality disclosures to ensure there is universal coverage and uniformity in reporting. Regulators are stepping up. The world’s largest economies and capital markets are considering mandating such disclosures and incorporating them into the supervision of their economies. In 2022, 36 countries planned or set mandatory climate-related disclosures aligned with the Taskforce for Climate-related Financial Disclosures. The countries include Brazil, India, Japan, the United Kingdom, countries in the European Union and the United States. 2) Scale up public finance for climate and nature The public sector can play a significant role in the protection of climate and nature by investing directly in climate initiatives and steering private markets, all while formulating policies that promote an equitable transition toward a green economy. Governments are the biggest allocators of capital in most economies, and their investment is crucial in areas where private finance is unable or unwilling to take a leading role such as development of new, high-risk technologies, public infrastructure and supporting underserved and marginalized communities. Recent climate legislation such as the U.S. Inflation Reduction Act is a concrete example of how the public sector can steer markets in new directions that favor decarbonization, allocate public finance to invest and develop new low-carbon solutions, and address inequities in disadvantaged communities. For example, policies like the Inflation Reduction Act are expected to significantly grow the amount of government investments in research and development of low-carbon technologies, currently estimated to be around $24 billion per year globally. Reactions from the business community, especially the finance sector, have been positive, recognizing that the legislation is expected to dramatically increase the scale of business opportunities and investments in both mature and nascent climate solutions. Climate finance needs to increase more than 10x faster than current trends to stay on track with climate goals. Image: Systems Change Lab To prevent some of the worst impacts of climate change, estimates suggest that public climate finance of at least $1.3 trillion will be needed every year by 2030. In 2020, it totaled $333 billion, significantly below the levels required to meet that target. To bridge the gap, financing needs to grow by more than eight times the historical rate. Fortunately, the Inflation Reduction Act and similar climate-focused legislation being planned in Europe and other major economies will help. Some estimates suggest that the Inflation Reduction Act will result in $1.2 trillion over 10 years in public incentives on clean technologies, with potential to go further depending on uptake. Finally, public finance from developed countries can play a key role in meeting their annual $100 billion commitment to support developing countries on climate mitigation and adaptation. In 2020, the amount totaled $83 billion, falling short of the target. The quality of financing also needs to improve as multilateral development banks, one of the main providers of climate finance, can increase share of grants and concessional loans to give developing countries greater financial flexibility in addressing their climate needs. New initiatives such as the Bridgetown Initiative that aim to help developing countries meet their climate goals by reforming the global financial architecture are gaining momentum and garnering attention. 3) Scale up private finance for climate and nature Meeting climate and nature goals also depends on the participation of the private sector. Some projections suggest that three-quarters of the estimated $5 trillion needed per year by 2030 will come from private sources while historically there has been an even split between public and private climate finance. The corporate sector can help scale the climate solutions needed to decarbonize our economies, but investments need to accelerate more than 10 times to reach the estimated $2.6 trillion to $3.9 trillion per year from the private sector by 2030. There are some signs of progress. Innovative firms have identified which new risks and business opportunities are developing out of the economic transition. An increasing number of firms are adapting their strategies and business models to reduce their exposure to such risks, setting net-zero targets to cut their emissions and investing in new products and services to grow in this new economic reality. The number of corporations with science-based targets that have been independently validated by the Science Based Targets initiative to align with the goals of the Paris Agreement grew 20% in 2022 and continues to increase. Such emissions-reduction targets are expected to influence their business strategies and investments, both on their own operations as well as capital allocated to other firms. But such corporate targets will require further scrutiny, improvement, robust oversight and implementation monitoring. The number of firms with validated science-based targets grew more than 15-fold in the last five years. Image: Systems Change Lab Investors are also aligning their investment allocation — about $7.5 trillion in assets — to net-zero targets by pushing high-emitting companies to change their businesses and shifting capital toward firms developing low-carbon solutions. Investor initiatives like Climate Action 100+ have engaged with the largest corporate emitters of greenhouse gases via joint shareholder proposals and escalation actions to reduce their emissions and adapt their businesses. The pool of capital aligned with net-zero targets is expected to expand as investors increasingly realize that sustainable business practices not only result in more competitive and resilient firms but also align with profitable financial returns. Finally, getting private finance involved in supporting developing countries in their decarbonization and adaptation efforts has long been a goal. While the record of de-risking private finance is mixed, recent initiatives like the Energy Transition Accelerator and the Just Energy Transition Partnerships are novel attempts to harness private finance to decarbonize middle- and low-income countries. 4) Extend economic and financial inclusion to underserved and marginalized groups Our current economic and financial systems have failed to be inclusive in sharing economic prosperity, resulting in historical inequities that have been perpetuated and sometimes worsened, further marginalizing already underserved groups. The transition to a decarbonized and sustainable economy provides an opportunity for historically underserved communities to share in new prosperity which will contribute to a more inclusive, fair and democratic society. Success in implementing a just transition will enable the world to meet the UN Sustainable Development Goals of eradicating poverty, reducing inequality and promoting full employment. Such progress is not only morally right but will also gain popular support and provide the political legitimacy and social stability that allow the transition to be accomplished. To do this, governments can coordinate with the private sector to create high-quality employment in green industries that will enable communities to work and participate in building a decarbonized future. Additionally, access to well-regulated financial resources, such as bank accounts and well-regulated lending, can help them build the financial security needed to become resilient and adapt to a changing environment. In 2021, 76% of the world's adult population had access to a bank account, indicating that the remaining 1.4 billion adults were still considered “unbanked.” The public sector can establish the infrastructure that facilitates access to financial services for all while also providing direct assistance to vulnerable communities with cash transfers, which serve as an entry point into the formal financial system and are an important aspect of social safety nets. Connecting green finance and financial inclusion. Image: Systems Change Lab 5) Price greenhouse gas emissions and other environmental externalities One of the largest challenges to shifting investments to a more sustainable future is the lack of accounting for the negative external costs generated by the fossil-fuel industry and other high polluters that get passed into society. These indirect costs, often referred to as “externalities,” are not adequately captured by prices despite the negative effects attributed to them such as lower quality of life, economic disruption and environmental degradation. As a result, polluters profit from their harmful activities and are not held accountable for these externalities while distorted prices can discourage changes in consumption patterns and efforts to reduce pollution. Applying a direct carbon price via carbon markets or a carbon tax on polluters can ensure that these external costs are properly accounted for in planning and decision-making that reduces environmental harm. While carbon pricing is not a silver bullet to solve climate change, it can complement a broader toolkit of approaches such as industrial policy and incentives for research and development of new low-carbon technologies. Similarly, taxing other environmentally harmful activities such as air pollution, natural resource use and waste can internalize their externalities which are estimated to reach $7.8 trillion annually by 2050. Currently only about 23% of global greenhouse gas emissions are covered by a direct carbon pricing regime. Pricing levels globally average about $23 per ton of carbon dioxide equivalent, which are well below the minimum of $170 required to prevent the most harmful impacts of climate change. To reach complete coverage by 2030 with at least some level of carbon pricing, coverage will need to grow nearly three times the historical rate. The share of GHG emissions covered by direct carbon pricing needs to accelerate 3x faster than historical rates. Image: Systems Change Lab 6) Eliminate harmful subsidies and financing Public and private investments continue to support activities that are incompatible with a sustainable future such as the development of new fossil fuel exploration and land degradation. Shifting investments toward a decarbonized future means stopping such harmful practices and redirecting capital to build a sustainable economy. The public sector continues to provide significant financing and investment to the fossil fuel industry via subsidies, financing from development finance institutions and fossil fuel investments from state-owned companies. Public financing for fossil fuels totaled $687 billion in 2020 — still very far from the phaseout needed by 2030 which requires a decreased pace of almost five times the historical rate. Public financing for fossil fuels needs to decrease 5x faster to achieve a phase-out by 2030. Image: Systems Change Lab Similarly, governments persist in granting detrimental agricultural subsidies that incentivize the overuse of land and excessive use of fertilizers and pesticide, which contribute to environmental degradation. For example, total agricultural support reached $530 billion in 2021 for the countries in the Organization for Economic Co-operation and Development plus 11 major developing economies and it is estimated that 87% of such support is “price-distorting or harmful to nature and health.” Agricultural and fisheries subsidies should be structured to reduce their environmental harm and encourage sustainable practices. Finance for a sustainable future Across these six shifts, we have already seen some positive developments from both public and private finance in channeling financial flows toward creating a green and sustainable economy. Although these signs are encouraging, current levels of investment are still far behind what is required.","filter_flag":1}
{"title":"5 Ways Tech Companies Can Improve Their Sustainability - Entrepreneur","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA","guidislink":false,"published":"Mon, 12 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=163, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5\" target=\"_blank\">5 Ways Tech Companies Can Improve Their Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrepreneur<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 Ways Tech Companies Can Improve Their Sustainability - Entrepreneur","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5\" target=\"_blank\">5 Ways Tech Companies Can Improve Their Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrepreneur<\/font>","source.href":"https:\/\/www.entrepreneur.com","source.title":"Entrepreneur","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Opinions expressed by Entrepreneur contributors are their own. In an era where environmental concerns have reached unprecedented levels, businesses across all industries face the imperative of adopting sustainable practices. Among the various industries around the globe, the technology sector has emerged as a prominent player, recognizing the pressing need to prioritize green initiatives. With growing consumer awareness and demand for eco-friendly solutions, tech companies have realized that sustainability is no longer a mere trend but a critical driver of success that has a significant impact on their bottom line. According to research conducted by Deutsche Bank, companies with high ratings for environmental, social, and governance (ESG) have a lower cost of debt and equity. These findings were corroborated by MSCI in 2020. Additionally, the findings show that companies with high ESG ratings outperform the market in the medium and long term. Further, by implementing stewardship-focused programs, companies have not only seen growth in their financials but also in brand awareness. By adopting circular economic models, implementing waste reduction programs, and increasing their focus on extended life cycles of their assets, companies are creating a shift toward doing business from an eco-friendly perspective. This shift has created the need for companies that specialize in helping large organizations develop sustainability plans, operate with a focus on being eco-friendly, reduce waste, and implement strong stewardship practices. Here are five strategies that tech companies around the globe are using to level up their green credentials while decreasing their negative impact. Related: This Is Why Your Business Should Prioritize Environmental Efforts 1. Embrace the circular economy The circular economy model is an economic framework that aims to minimize waste and maximize the efficient use of resources. In contrast to the conventional linear economy, circular economy promotes a closed-loop system where materials and products are continuously reused, repaired, remanufactured, or recycled to create new value. According to McKinsey, the European circular economy market size for electronics is expected to grow from €60 to €95 billion by 2030. Additionally, resource productivity is estimated to grow by 3 percent, which will generate cost savings of around €600 billion as well as €1.8 trillion in other economic benefits annually. For businesses, one of the most important resources they have at their hands is technology, be it software or hardware. Often, the largest and most impactful investments an organization makes are technology-related. With computer hardware accounting for around 30% of overall IT budgets, hardware spending is the largest portion of overall tech spending. Consequently, hardware products, such as laptops, tablets, and smartphones, are often at the top of the list in both cost and volume. The circular economy is based on the principles of designing for longevity and efficiency while minimizing waste and pollution. This is achieved by keeping assets and materials, such as smartphones or laptops, in use for as long as possible. Additionally, efforts are made to regenerate natural systems. In 2021, ATRenew reduced emissions by a total of 464,000 metric tons through re-commercializing pre-owned phones. This is equivalent to the carbon sink of about 1,533 square kilometers of urban forests in one year. 2. Invest in eco-friendly products and manufacturing One of the key benefits of the implementation of a circular economy model is the reduction in waste. By prioritizing the reusing, repairing, and recycling of resources, the circular economy model minimizes the amount of waste that ends up in landfills or incinerators. According to the European Environment Agency, waste management, industrial processes, and product use account for over 12% of greenhouse gas emissions in the EU. Consequently, a circular economy model reduces the environmental impacts associated with waste disposal and mitigates pollution and greenhouse gas emissions during manufacturing. Investing in eco-friendly manufacturing processes and products is crucial for minimizing environmental impact. According to the Ellen MacArthur Foundation, 80% of a product's environmental impact is decided in the initial design stages. Companies can increase their green credentials by using sustainable materials, reducing energy consumption, and minimizing waste. Further, sustainable practices attract environmentally conscious customers, positioning sustainable businesses as leaders in a competitive marketplace. In other words, embracing sustainability is both a moral and strategic imperative for the long-term success of any business. Related: How to Overcome the Shortage of Tech Talent in the US 3. Encourage and facilitate recycling Recycling plays a crucial role in reducing electronic waste (e-waste), so encouraging it is important in promoting and advancing a sustainable approach to technology. With technological advancements continuing to happen at an astonishing rate, it is becoming increasingly important for tech companies to take responsibility for the lifecycle of their products. Companies can help reduce e-waste and minimize their environmental impact by implementing effective strategies, such as trade-in programs or recycling events that incentivize consumers to recycle their old devices. For example, tech companies can establish partnerships or in-house programs that allow consumers to trade in their used devices in exchange for credit toward a new purchase. Not only does this encourage the recycling of devices, but it also promotes brand loyalty and customer satisfaction. Education and awareness campaigns can also be powerful tools, especially considering that many electronic devices contain valuable and limited resources. Materials like lead, silver, copper and gold are essential for manufacturing new technology, making recycling even more attractive. Related: The U.S. Has a Huge E-Waste Problem. But There Is Money To Make in Its Disposal. 4. Extend the lifecycle of devices Extending the lifespan of electronic devices offers both financial and environmental benefits. By offering repair services, manufacturers and third-party providers can help consumers prolong the lifespan of their electronic devices. Not only is this often cheaper than buying a new device, but it also reduces e-waste and minimizes the environmental impact of manufacturing a new device. Another approach businesses can take to extend the lifecycle of electronic devices is to sell their used devices. By selling thoroughly tested and repaired used devices at a reduced price with a warranty, consumers bask in a vibrant array of choices, extending beyond the realm of brand-new products. According to Counterpoint Research, the demand for refurbished smartphones continues to grow. In 2022, the global secondary smartphone market saw growth of 5% year-over-year, with refurbished iPhone sales growing by 16%. Additionally, the secondary market of refurbished devices also creates new opportunities for businesses and consumers to get some of their investments back, reducing the overall cost of ownership and making affordable technology more accessible. Manufacturers can also support the environment by making affordable replacement parts available and providing repair guides or tutorials. Companies can extend the lifespan of their products and foster customer loyalty simultaneously by embracing repairability and sustainability. 5. Foster a culture of sustainability Promoting sustainability within the company culture is essential for sustainable organizations aiming to make a positive environmental impact. Integrating sustainability into a company's core values, practices, and decision-making processes becomes a shared responsibility and commitment among employees, consumers, and stakeholders. This commitment then leads to a range of benefits for all involved parties, as well as the environment. Weaving a strong sustainability policy into a company's foundation as well as educating and engaging employees, sets a whole new standard that also comes with numerous benefits. Not only do sustainable organizations attract quality employees and sustainability-focused customers, but they also benefit financially. For example, after successfully defining and implementing a stewardship plan focusing on sustainability, REI now has one of the most successful circular commerce programs of any outdoor retail brand, taking in around 100,000 outdoor-related items to be traded or resold in their store locations in 2022. By integrating sustainability into all operations, tech companies can drive change and contribute to a more sustainable future. Related: 3 Ways You Can Bring Sustainability to Your Workplace","filter_flag":1}
{"title":"ATD wins SEAL award for tire recycling program - Tire Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRpcmVidXNpbmVzcy5jb20vd2hvbGVzYWxlL2F0ZC13aW5zLXNlYWwtYXdhcmQtdGlyZS1yZWN5Y2xpbmctcHJvZ3JhbdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRpcmVidXNpbmVzcy5jb20vd2hvbGVzYWxlL2F0ZC13aW5zLXNlYWwtYXdhcmQtdGlyZS1yZWN5Y2xpbmctcHJvZ3JhbdIBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LnRpcmVidXNpbmVzcy5jb20vd2hvbGVzYWxlL2F0ZC13aW5zLXNlYWwtYXdhcmQtdGlyZS1yZWN5Y2xpbmctcHJvZ3JhbdIBAA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRpcmVidXNpbmVzcy5jb20vd2hvbGVzYWxlL2F0ZC13aW5zLXNlYWwtYXdhcmQtdGlyZS1yZWN5Y2xpbmctcHJvZ3JhbdIBAA?oc=5\" target=\"_blank\">ATD wins SEAL award for tire recycling program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tire Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ATD wins SEAL award for tire recycling program - Tire Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnRpcmVidXNpbmVzcy5jb20vd2hvbGVzYWxlL2F0ZC13aW5zLXNlYWwtYXdhcmQtdGlyZS1yZWN5Y2xpbmctcHJvZ3JhbdIBAA?oc=5\" target=\"_blank\">ATD wins SEAL award for tire recycling program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tire Business<\/font>","source.href":"https:\/\/www.tirebusiness.com","source.title":"Tire Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"HUNTERSVILLE, N.C. — American Tire Distributors Inc. (ATD) was named a winner of the 2023 SEAL Business Sustainability Award for Environmental Initiatives, which honors companies for their leadership, innovative practices and commitment to sustainable business practices. The awards cover four sustainability categories — environmental initiatives, sustainable products, sustainable services and sustainable innovations — and recognize the 50 Most Sustainable Companies in the World and the most impactful and innovative environmental initiatives. \"We are honored to be recognized as a leader in sustainable initiatives,\" ATD President and CEO Stuart Schuette said. \"Innovation is at the heart of ATD, and we are always striving to be better. We are proud to continue the work we're doing with the tire recycling initiative.\" ATD was recognized for its commitment to sustainable practices. Last year, the company created a new tire recycling initiative to collect scrap tires from retailers. ATD picks up the scrap tires when new tires are delivered and takes the scraps to be recycled. This service was created to address retailers' obstacle of getting reliable, environmentally friendly scrap tire pickup from scrap tire haulers, ATD said. The tire recycling service reduces overall greenhouse gases (GHG) in the ecosystem by using delivery trucks to backhaul the scrap tires to recyclers. The process effectively lowers GHG while providing material for new products, ATD said. There is also a significant potential impact in the ecosystem based on processing options available today, likely in excess of ATD's current measured impact. This impact is likely to have significant economic value to other actors in the system, the company said. \"Granularity was the theme of the 2023 sustainability awards. Across all industries and geographies, companies are going deep and granular — into materials, chemistry, processes, R&D, and more — to generate sustainability improvements,\" Matt Harney, chairperson and founder of SEAL Awards, said. \"Corporate ESG leadership — like our 2023 honorees have demonstrated — is absolutely needed to address our climate crisis.\" A full list of winners is available online at sealawards.com.","filter_flag":1}
{"title":"Walmart plans to open its own beef plant for case-ready meat for its stores - Food Safety News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8yMDIzLzA2L3dhbG1hcnQtcGxhbnMtdG8tb3Blbi1pdHMtb3duLWJlZWYtcGxhbnQtZm9yLWNhc2UtcmVhZHktbWVhdC1mb3ItaXRzLXN0b3Jlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8yMDIzLzA2L3dhbG1hcnQtcGxhbnMtdG8tb3Blbi1pdHMtb3duLWJlZWYtcGxhbnQtZm9yLWNhc2UtcmVhZHktbWVhdC1mb3ItaXRzLXN0b3Jlcy_SAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8yMDIzLzA2L3dhbG1hcnQtcGxhbnMtdG8tb3Blbi1pdHMtb3duLWJlZWYtcGxhbnQtZm9yLWNhc2UtcmVhZHktbWVhdC1mb3ItaXRzLXN0b3Jlcy_SAQA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8yMDIzLzA2L3dhbG1hcnQtcGxhbnMtdG8tb3Blbi1pdHMtb3duLWJlZWYtcGxhbnQtZm9yLWNhc2UtcmVhZHktbWVhdC1mb3ItaXRzLXN0b3Jlcy_SAQA?oc=5\" target=\"_blank\">Walmart plans to open its own beef plant for case-ready meat for its stores<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Safety News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Walmart plans to open its own beef plant for case-ready meat for its stores - Food Safety News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RzYWZldHluZXdzLmNvbS8yMDIzLzA2L3dhbG1hcnQtcGxhbnMtdG8tb3Blbi1pdHMtb3duLWJlZWYtcGxhbnQtZm9yLWNhc2UtcmVhZHktbWVhdC1mb3ItaXRzLXN0b3Jlcy_SAQA?oc=5\" target=\"_blank\">Walmart plans to open its own beef plant for case-ready meat for its stores<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Safety News<\/font>","source.href":"https:\/\/www.foodsafetynews.com","source.title":"Food Safety News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"With a new $275 million beef processing facility being built in Olathe, KS, with an opening of 2025 expected, Walmart plans to take a page from history by producing “case-ready” meat. A half-century ago, Colorado’s Greeley Beef Plant was the first large-scale producer of what it called “boxed beef,” with specific cuts of beet, for restaurant and grocery store customers back East. Today, case-ready meat, retail-ready meat, or pre-packaged meat is how the industry refers to fresh meat that is processed and packaged at a central facility and delivered store-ready for the retail meat case. While Walmart can order case-ready cuts of meat from any number of producers these days, the fact that its first wholly-owned plant is going with case-ready products is not going unnoticed. The “boxed beef” plant will bring 600 jobs to the Olathe area. “This is great news,” said Olathe Mayor John Bacon. “We’re thrilled that Walmart chose Olathe for its innovative facility. This huge capital investment will create more jobs that will greatly benefit the City of Olathe and our entire region.” Olathe is the county seat of Johnson County, KS. It is the fourth-most populous city in both the Kansas City metropolitan area and the state of Kansas, with a 2020 population of 141,290. Walmart Inc. is a retail chain of large, discount, department, and grocery stores that is headquartered in Bentonville, AR. It is already a huge purchaser of case-ready beef for its 4,700 U.S. stores with Angus beef from cattle using sustainable practices among its featured products. The new Olathe facility will add to Walmart’s ability to control its supply chain. It follows the Walmart food production facility that opened in 2018 in Fort Wayne IN. The milk production facility supplies about 500 Walmart stores with milk products under the Great Value brand. The milk comes from dairy farms in Indiana and Michigan. (To sign up for a free subscription to Food Safety News, click here.)","filter_flag":1}
{"title":"Responsibly Sourced Fish Fillets - Trend Hunter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvcmVzcG9uc2libHlzb3VyY2VkLWZpc2gtZmlsbGV0c9IBRmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS9hbXAvdHJlbmRzL3Jlc3BvbnNpYmx5c291cmNlZC1maXNoLWZpbGxldHM?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvcmVzcG9uc2libHlzb3VyY2VkLWZpc2gtZmlsbGV0c9IBRmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS9hbXAvdHJlbmRzL3Jlc3BvbnNpYmx5c291cmNlZC1maXNoLWZpbGxldHM?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvcmVzcG9uc2libHlzb3VyY2VkLWZpc2gtZmlsbGV0c9IBRmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS9hbXAvdHJlbmRzL3Jlc3BvbnNpYmx5c291cmNlZC1maXNoLWZpbGxldHM","guidislink":false,"published":"Fri, 09 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=160, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvcmVzcG9uc2libHlzb3VyY2VkLWZpc2gtZmlsbGV0c9IBRmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS9hbXAvdHJlbmRzL3Jlc3BvbnNpYmx5c291cmNlZC1maXNoLWZpbGxldHM?oc=5\" target=\"_blank\">Responsibly Sourced Fish Fillets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Trend Hunter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Responsibly Sourced Fish Fillets - Trend Hunter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS90cmVuZHMvcmVzcG9uc2libHlzb3VyY2VkLWZpc2gtZmlsbGV0c9IBRmh0dHBzOi8vd3d3LnRyZW5kaHVudGVyLmNvbS9hbXAvdHJlbmRzL3Jlc3BvbnNpYmx5c291cmNlZC1maXNoLWZpbGxldHM?oc=5\" target=\"_blank\">Responsibly Sourced Fish Fillets<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Trend Hunter<\/font>","source.href":"https:\/\/www.trendhunter.com","source.title":"Trend Hunter","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"These Oven-Ready Fish Meals Are Delicious & Sustainable Fish Said Fred, a farmed fish brand created a couple of years ago by none other than New England Seafood International, is launching a brand new range of responsible sourced fish fillets that are designed to be quickly and easily prepared in an oven. This new range of fish fillets comprises three different versions, namely sea bass fillets with creamy pesto crumb, cheesy smoked haddock and cod kyiv. Available in Tesco supermarkets in the U.K., these oven-ready fish fillets set about showing that healthy eating, delicious flavors and sustainability needn't be mutually exclusive. What's more, the price point of approximately $7.5 per meal is designed to be accessible. “This new launch continues Fish Said Fred’s mission to help people fall in love with tasty, healthy and responsibly sourced fish, whilst maintaining our positioning of being accessible to UK families,” said Lisa Cowell, head of brand at New England Seafood. Image Credit: New England Seafood Trend Themes 1. Responsible Sourcing of Fish - There is an opportunity for sustainable and responsibly sourced fish products to take a larger share of the market and appeal to environmentally conscious consumers. 2. Convenient Oven-ready Meals - Convenience is a key trend in the food industry and there is an opportunity to create more pre-prepared, oven-ready meal options for busy consumers. 3. Affordable Healthy Eating - As consumers become more health-conscious, there is an opportunity to create healthy, sustainably sourced meal options that are priced within reach of a diverse range of consumers. Industry Implications 1. Food Retail - Grocery retailers can capitalize on the trend toward sustainably sourced, convenient, and affordable meal options to attract and retain environmentally conscious consumers. 2. Fish Farming - Fish farms can differentiate themselves by emphasizing their commitment to ethical and sustainable practices, and by developing new products that cater to consumers looking for responsibly sourced fish options. 3. Meal Kit Delivery Services - Meal kit delivery services can incorporate responsibly sourced fish into their recipes and offerings, appealing to customers who want the convenience and customization of meal kits while also supporting sustainable practices.","filter_flag":1}
{"title":"Patagonia discourages spending during China's 618 shopping festival - Jing Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9wYXRhZ29uaWEtYW50aS1jb25zdW1lcmlzbS02MTgtZmVzdGl2YWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9wYXRhZ29uaWEtYW50aS1jb25zdW1lcmlzbS02MTgtZmVzdGl2YWzSAQA?oc=5","id":"CBMiQ2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9wYXRhZ29uaWEtYW50aS1jb25zdW1lcmlzbS02MTgtZmVzdGl2YWzSAQA","guidislink":false,"published":"Thu, 15 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=166, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9wYXRhZ29uaWEtYW50aS1jb25zdW1lcmlzbS02MTgtZmVzdGl2YWzSAQA?oc=5\" target=\"_blank\">Patagonia discourages spending during China's 618 shopping festival<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jing Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Patagonia discourages spending during China's 618 shopping festival - Jing Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vamluZ2RhaWx5LmNvbS9wb3N0cy9wYXRhZ29uaWEtYW50aS1jb25zdW1lcmlzbS02MTgtZmVzdGl2YWzSAQA?oc=5\" target=\"_blank\">Patagonia discourages spending during China's 618 shopping festival<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Jing Daily<\/font>","source.href":"https:\/\/jingdaily.com","source.title":"Jing Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"On June 18, Patagonia will team up with local running community DarkRunners and women's skateboarding community Todaynowave to organize a gathering at Gate M Westbund in Shanghai. Named \"618 Don’t-Consume Market,\" the activation aims to encourage participants to \"buy less, play more\" during this year's 618 shopping festival. Consumers can repair, exchange, and recycle old clothes via the brand's Worn Wear program at the market, make coffee cup sleeves, watch Patagonia documentaries, as well as join outdoor activities like running and skateboarding. Patagonia's 618 event discourages consumers from shopping, which aligns with the brand's core value of environmentalism. Photo: Gate M Westbund Because the event was announced on June 14, online traffic is still low, though some netizens have commented that hosting anti-consumerism activities on a shopping festival sounds interesting. As outdoor sports have boomed in the post-pandemic era, Patagonia’s collaboration with China's running and skateboarding communities appeals to outdoor sports enthusiasts. Meanwhile, the recycling services offered at the event will engage consumers who are conscious of sustainability. Verdict Patagonia is well known for its counterintuitive ads telling consumers to buy less of its products. In 2020, the outdoor retailer’s Worn Wear recycling program was launched as an exhibition in Shanghai’s K11 shopping mall, educating consumers on the environmental footprint behind their purchases. Over the past two years, Patagonia has opted out of participating in the 618 shopping extravaganza, urging consumers to shop less and trade in their old clothes instead. In 2022, Patagonia founder Yvon Chouinard and his family even gave away all their company shares to combat climate change and protect wild land, which sparked a wave of positive feedback in China. In line with its sustainable development philosophy, Patagonia continues to promote anti-consumerism through various campaigns and events. However, as competition in the outdoor apparel and equipment sector intensifies, the brand will need to enrich its sustainability storytelling to maintain its brand desirability in China.","filter_flag":1}
{"title":"Galalite Screens Sets a New Standard for Environmental Responsibility in the Cinema Screen Industry - Celluloid Junkie","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2NlbGx1bG9pZGp1bmtpZS5jb20vd2lyZS9nYWxhbGl0ZS1zY3JlZW5zLXNldHMtYS1uZXctc3RhbmRhcmQtZm9yLWVudmlyb25tZW50YWwtcmVzcG9uc2liaWxpdHktaW4tdGhlLWNpbmVtYS1zY3JlZW4taW5kdXN0cnkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2NlbGx1bG9pZGp1bmtpZS5jb20vd2lyZS9nYWxhbGl0ZS1zY3JlZW5zLXNldHMtYS1uZXctc3RhbmRhcmQtZm9yLWVudmlyb25tZW50YWwtcmVzcG9uc2liaWxpdHktaW4tdGhlLWNpbmVtYS1zY3JlZW4taW5kdXN0cnkv0gEA?oc=5","id":"CBMihQFodHRwczovL2NlbGx1bG9pZGp1bmtpZS5jb20vd2lyZS9nYWxhbGl0ZS1zY3JlZW5zLXNldHMtYS1uZXctc3RhbmRhcmQtZm9yLWVudmlyb25tZW50YWwtcmVzcG9uc2liaWxpdHktaW4tdGhlLWNpbmVtYS1zY3JlZW4taW5kdXN0cnkv0gEA","guidislink":false,"published":"Wed, 07 Jun 2023 14:46:46 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=14, tm_min=46, tm_sec=46, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2NlbGx1bG9pZGp1bmtpZS5jb20vd2lyZS9nYWxhbGl0ZS1zY3JlZW5zLXNldHMtYS1uZXctc3RhbmRhcmQtZm9yLWVudmlyb25tZW50YWwtcmVzcG9uc2liaWxpdHktaW4tdGhlLWNpbmVtYS1zY3JlZW4taW5kdXN0cnkv0gEA?oc=5\" target=\"_blank\">Galalite Screens Sets a New Standard for Environmental Responsibility in the Cinema Screen Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Celluloid Junkie<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Galalite Screens Sets a New Standard for Environmental Responsibility in the Cinema Screen Industry - Celluloid Junkie","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2NlbGx1bG9pZGp1bmtpZS5jb20vd2lyZS9nYWxhbGl0ZS1zY3JlZW5zLXNldHMtYS1uZXctc3RhbmRhcmQtZm9yLWVudmlyb25tZW50YWwtcmVzcG9uc2liaWxpdHktaW4tdGhlLWNpbmVtYS1zY3JlZW4taW5kdXN0cnkv0gEA?oc=5\" target=\"_blank\">Galalite Screens Sets a New Standard for Environmental Responsibility in the Cinema Screen Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Celluloid Junkie<\/font>","source.href":"https:\/\/celluloidjunkie.com","source.title":"Celluloid Junkie","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Galalite, the pioneering manufacturer of cinema projection screen surfaces, has been at the forefront of innovation and technology for over six decades. At the beginning of the year, the company has taken a step towards reducing its carbon footprint and improving sustainability by investing in an Air and Water Pollution Control system in their plant. During the production of Avatar, Galalite’s factory operated around the clock to meet the demand. Following the success of the film, they temporarily closed the plant to undergo significant upgrades. For a period of two weeks, the factory was closed while they successfully commissioned and installed a wet scrubber system. A wet scrubber is a mechanical system that removes pollutants from an air stream by bringing it in contact with water. Wet scrubbers are generally the only single air pollution control device to remove particulates and gases\/vapors. They are highly efficient at capturing the smallest dust particles and can eliminate more than 99% of airborne particulate matter. Galalite redirects the cleaned air back into the plant to reduce the environmental impact further and make it into a zero-emission plant. Yusuf Galabhaiwala, Director of Operations at Galalite, says, “We believe in doing our part to create a cleaner, more sustainable world. Although this was a major investment, we didn’t hesitate to invest in this system, even if it meant temporarily shutting down our plant although the markets had just bounced back. It was worth it to know that we’re doing our best to protect the environment.” Galalite has been committed to using eco-friendly water-based coatings since 2009 and was one of the first companies to adopt such sustainable practices. Water-based optical coatings are eco-friendly and have low VOC levels and HAP emissions, reducing the concentration of contaminants in the ozone layer. Galalite has always believed in constantly upgrading its technology and processes, and this new development of installing a scrubber is no exception. Galalite has also slated other upgrades and initiatives that further reinforce its commitment to innovation while being sustainable. The company plans to launch new products in the near future that will enhance and upgrade the movie-watching experience while being environmentally friendly. Saikat Ali, Production Head at Galalite, added, “Upgrading is constant at Galalite. We are excited about the new products we will soon launch, and we are confident that they will further elevate the movie-watching experience. As always, we will continue to innovate and take a responsible approach toward the environment.” With these initiatives, Galalite hopes to set an example for the industry and inspire others to adopt sustainable practices. Galalite’s commitment to sustainability and the environment is commendable, and it is a prime example of how businesses can innovate while keeping the planet in mind. With its cutting-edge technology, innovative products, and eco-friendly approach, Galalite is a true leader in the cinema screen industry. For more information, click on:- https:\/\/galalitescreens.com\/?p=16768 About Galalite: Galalite is a family-owned business headquartered in Mumbai, India, and is the leading manufacturer of cinema screens in the country. The company has the largest production unit in Lonavala and is now a global leader in cinema screen manufacturing in European countries. With a commitment to innovation, quality, and sustainability, Galalite has become one of the largest projector screen suppliers in the world, representing India on the global stage.","filter_flag":1}
{"title":"Natural meats in high demand in 2023 - Supermarket Perimeter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy85Mzk5LW5hdHVyYWwtbWVhdHMtaW4taGlnaC1kZW1hbmQtaW4tMjAyM9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy85Mzk5LW5hdHVyYWwtbWVhdHMtaW4taGlnaC1kZW1hbmQtaW4tMjAyM9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy85Mzk5LW5hdHVyYWwtbWVhdHMtaW4taGlnaC1kZW1hbmQtaW4tMjAyM9IBAA","guidislink":false,"published":"Sat, 03 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=154, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy85Mzk5LW5hdHVyYWwtbWVhdHMtaW4taGlnaC1kZW1hbmQtaW4tMjAyM9IBAA?oc=5\" target=\"_blank\">Natural meats in high demand in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supermarket Perimeter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Natural meats in high demand in 2023 - Supermarket Perimeter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN1cGVybWFya2V0cGVyaW1ldGVyLmNvbS9hcnRpY2xlcy85Mzk5LW5hdHVyYWwtbWVhdHMtaW4taGlnaC1kZW1hbmQtaW4tMjAyM9IBAA?oc=5\" target=\"_blank\">Natural meats in high demand in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supermarket Perimeter<\/font>","source.href":"https:\/\/www.supermarketperimeter.com","source.title":"Supermarket Perimeter","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"As consumers demand more transparency from producers of the foods they eat and express increased concerns about not only their own health but the health and welfare of animals, demand for natural meats continues to surge. Arkansas City, Kan.-based Creekstone Farms is excited about the growing consumer interest in transparent food production, said Jim Rogers, the company’s senior vice president of sales. Sixty-three percent of consumers want to know more about the who, what, where and how behind their food, according to Midan Marketing research cited by Creekstone. In addition, one in three consumers specifically looks for claims-based meat, and 42% of meat consumers consider “natural” to be an indicator of quality. Additionally, 43% consider US-raised to be an indicator of quality, 41% of meat consumers consider no-added hormones to indicate quality, and 38% consider no antibiotics ever to indicate quality. “Transparency opens up many conversations about animal welfare, natural meat production and sustainability – topics we’re proud to discuss because we hold ourselves to such high standards,” Rogers said. Creekstone has longstanding relationships with cattle producers and, as a result, is able to trace cattle back to their origin. The company’s producer partners, Rogers said, care deeply about the land and livestock, and more and more consumers want to hear their stories. Creekstone’s Natural Black Angus Beef products are raised without antibiotics, added hormones, and using Certified Humane handling practices. Showcasing farmers and ranchers through video interviews, ranch photography and digital storytelling is essential to getting those messages out to even more future Creekstone customers, he added. Westminster, Colo.-based Niman Ranch has several new products on tap for 2023, said Alicia LaPorte, the company’s communications director. For starters, Niman Ranch will debut a 100% grass-fed and grass-finished hot dog. The recipe is the same as the one for the company’s award-winning Fearless Franks. The difference is that it’s made with grass-fed beef. “It’s a winning combination that aligns with huge jumps in consumer demand for grass-fed beef,” LaPorte said. Also in 2023, Niman Ranch has plans to expand its line of prepared sausages and deli items in an effort to appeal to consumers looking for new flavors. The company will also debut a new line of premium pork products and to expand its case-ready options. “Innovation is the name of the game in 2023, as we believe there is pent up consumer demand for new options on store shelves,” LaPorte said. 63% of consumers want to know more about the who, what, where and how behind their food. 1 in 3 consumers specifically looks for claims-based meat. 42% of meat consumers consider “natural” to be an indicator of quality. 43% consider US-raised to be an indicator of quality. 41%of meat consumers consider no-added hormones to indicate quality. Source: Midan Marketing Getting the word out As consumers look for transparency in the products and claims they’re purchasing, Creekstone is looking forward to introducing rebranded point of sale materials into the retail meat case, Rogers said. “From case dividers and consumer brochures to videos of ranchers and some of the nation’s top chefs, we’re working hard to transparently communicate what makes our natural program stand out.” Across all sectors and regions, Creekstone is continuing to see increased demand for elevated eating experiences, Rogers said. It’s a trend that began during COVID, as consumers recreated restaurant experiences at home, and Creekstone expects it to continue for the foreseeable future. Ribeyes and tenderloins continue to be top grocery retail sellers for Creekstone, and during the holidays, bone-in ribeye and short loin sales tend to spike. In addition, Creekstone’s skirt steaks have been popular because of their versatility, Rogers said. And the company also sees different demand depending on the region of the country. Californians, for instance, seem to like tri-tip steaks, while New Englanders prefer sirloin flap. Across all cuts, though, natural ground beef sales stand out, Rogers said. Natural claims are now listed on 40% of ground beef packages and 20% of beef packages — up from 36% and 17%, respectively, in 2018. Capturing the natural meat consumer can pay huge rewards for retailers, Rogers said. Natural and organic purchasers tend to be much more engaged with meat than the average meat consumer, according to Midan. They enjoy cooking and prefer package claims that are better for them, the animal and the environment. Sustainability continues to be a crucial topic in the fresh meat industry, including decision-makers in grocery retail, Rogers said. In terms of meat, 34% of consumers say they’re more concerned with meat sustainability, while 15% said they think about it a “great deal.” “For this core group of shoppers, sustainability is an important purchase driver. At Creekstone, sustainability is about being a partner to the generational family farms and ranchers who supply our cattle. We believe strongly in offering a premium for sustainable practices and in turn hold our farmers and ranchers to rigorous sustainability and animal welfare standards.” A higher bar Five years ago, slapping “natural” on a package was enough for many consumers, LaPorte said. That’s not the case today, especially for premium meat shoppers. “If you say sustainable, they want to know the acres of cover crops your farmers have planted,” she said. “If you say family farmers, they want to know where the farms are located and how many generations are involved. Consumers want to know the story of their food and how it aligns with their values.” For Niman Ranch, that’s a huge selling point, thanks to the company’s transparent supply chain and industry-leading sustainable and humane animal care practices, she added. E ye on California 2023 promises to be a big year for how pigs are raised in California — and, as is so often the case, what starts in California often spreads to the rest of the country. The Supreme Court is expected to rule on Proposition 12, the law that will ban the sale of pork in California that is sourced from farms using gestation crates. “Regardless of the Court’s decision, this topic will be in the news quite a bit in 2023 and demand for true crate-free pork will grow,” LaPorte said.","filter_flag":1}
{"title":"Taking concrete action on more sustainable construction materials – Monash Lens - Monash Lens","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vbGVucy5tb25hc2guZWR1L0B0ZWNobm9sb2d5LzIwMjMvMDYvMjMvMTM4NTczNy90YWtpbmctY29uY3JldGUtYWN0aW9uLW9uLW1vcmUtc3VzdGFpbmFibGUtY29uc3RydWN0aW9uLW1hdGVyaWFsc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vbGVucy5tb25hc2guZWR1L0B0ZWNobm9sb2d5LzIwMjMvMDYvMjMvMTM4NTczNy90YWtpbmctY29uY3JldGUtYWN0aW9uLW9uLW1vcmUtc3VzdGFpbmFibGUtY29uc3RydWN0aW9uLW1hdGVyaWFsc9IBAA?oc=5","id":"CBMieGh0dHBzOi8vbGVucy5tb25hc2guZWR1L0B0ZWNobm9sb2d5LzIwMjMvMDYvMjMvMTM4NTczNy90YWtpbmctY29uY3JldGUtYWN0aW9uLW9uLW1vcmUtc3VzdGFpbmFibGUtY29uc3RydWN0aW9uLW1hdGVyaWFsc9IBAA","guidislink":false,"published":"Fri, 23 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=174, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vbGVucy5tb25hc2guZWR1L0B0ZWNobm9sb2d5LzIwMjMvMDYvMjMvMTM4NTczNy90YWtpbmctY29uY3JldGUtYWN0aW9uLW9uLW1vcmUtc3VzdGFpbmFibGUtY29uc3RydWN0aW9uLW1hdGVyaWFsc9IBAA?oc=5\" target=\"_blank\">Taking concrete action on more sustainable construction materials – Monash Lens<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Monash Lens<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Taking concrete action on more sustainable construction materials – Monash Lens - Monash Lens","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vbGVucy5tb25hc2guZWR1L0B0ZWNobm9sb2d5LzIwMjMvMDYvMjMvMTM4NTczNy90YWtpbmctY29uY3JldGUtYWN0aW9uLW9uLW1vcmUtc3VzdGFpbmFibGUtY29uc3RydWN0aW9uLW1hdGVyaWFsc9IBAA?oc=5\" target=\"_blank\">Taking concrete action on more sustainable construction materials – Monash Lens<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Monash Lens<\/font>","source.href":"https:\/\/lens.monash.edu","source.title":"Monash Lens","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The construction industry has long been associated with negative environmental impacts, largely due to its heavy reliance on natural resources and high energy consumption. The industry heavily relies on concrete in many parts of the world. However, the energy usage required for the extraction of natural resources, production of cement and concrete, and the hydration process to make cement all have a significant impact on carbon dioxide (CO 2 ) emissions. To address these issues, researchers are exploring alternative, greener base materials that can be reused, recycled, or upcycled for new construction materials. Associate Professor Sudharshan N. Raman, from the School of Engineering at Monash University Malaysia, and his research group are focusing on valorising various sources of industrial byproducts and deemed waste materials for construction and building applications. Valorisation refers to the process of adding value to waste or byproducts by converting them into new products, energy, or other valuable resources, thus reducing waste and promoting circular construction practices. Many Southeast Asian nations, including Malaysia, experienced rapid population growth and urbanisation between 1970 and 2000, leading to a surge in construction activities during this era to provide space, shelter and amenities to the growing population. Since most buildings and infrastructure are designed for a life cycle of 50 years, they will soon reach their maximum lifespan in the next five to 20 years. The demolition of these structures to make way for new construction would leave residual materials that can be extracted and processed using suitable techniques to be reused in construction and other applications. Despite extensive research on recycled aggregates from construction and demolition waste, there are still gaps in knowledge and its implementation in practice. The properties of recycled aggregates must be examined for optimal performance to meet the limits and standards specified in materials specifications and design codes. Dr Raman's group is working to fill these gaps and ensure that recycled aggregates are applicable in real-life scenarios. In addition to recycled aggregates from demolition wastes, Dr Raman's team is investigating the potential use of coal bottom ash (CBA), a byproduct from coal combustion in coal-fired power plants, as an alternative material in construction. The research group is examining the properties of CBA and how it can contribute as an alternative aggregate, as well as a supplementary additive material to cement, in the process of developing a novel cement variation. In another effort to support resource efficiency in cement production, Dr Raman's group is looking to produce a cement variant by minimising the clinker content (base Portland cement material) to 10%, where the remaining 90% will incorporate upcycled industrial waste or byproduct materials. To further promote circular practices in construction, Dr Raman teamed up with Dr Chua Yie Sue from Monash University Malaysia and Associate Professor Mehrdad Arashpour from Monash University, along with 10 other Monash researchers, to form in April 2022 the University's multi-campus interdisciplinary research node, the Monash Construction Circularity Node (Monash-ConCerN). The research node will focus its research and innovation efforts on three main areas: Circular construction materials to promote resource efficiency and sustainable consumption. Lean construction to minimise systems wastage Smart life-cycle assessment to improve the overall performance efficiency of the built environment. The construction industry is a significant contributor to carbon emissions and resource depletion. However, with the development of new technologies and sustainable practices, it’s possible to reduce the negative impact of construction activities on the environment. Dr Raman and his team are at the forefront of developing and promoting greener construction materials and practices, as well as advocating for the adoption of circular economy principles in the industry. Their research and initiatives have the potential to transform the construction industry, and contribute to a more sustainable future.","filter_flag":1}
{"title":"ELFBAR Joins Forces with UK Recycler to Strengthen its Global Sustainable Practices - PR Newswire UK","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvLnVrL25ld3MtcmVsZWFzZXMvZWxmYmFyLWpvaW5zLWZvcmNlcy13aXRoLXVrLXJlY3ljbGVyLXRvLXN0cmVuZ3RoZW4taXRzLWdsb2JhbC1zdXN0YWluYWJsZS1wcmFjdGljZXMtMzAxODQxOTAwLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvLnVrL25ld3MtcmVsZWFzZXMvZWxmYmFyLWpvaW5zLWZvcmNlcy13aXRoLXVrLXJlY3ljbGVyLXRvLXN0cmVuZ3RoZW4taXRzLWdsb2JhbC1zdXN0YWluYWJsZS1wcmFjdGljZXMtMzAxODQxOTAwLmh0bWzSAQA?oc=5","id":"CBMijQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvLnVrL25ld3MtcmVsZWFzZXMvZWxmYmFyLWpvaW5zLWZvcmNlcy13aXRoLXVrLXJlY3ljbGVyLXRvLXN0cmVuZ3RoZW4taXRzLWdsb2JhbC1zdXN0YWluYWJsZS1wcmFjdGljZXMtMzAxODQxOTAwLmh0bWzSAQA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvLnVrL25ld3MtcmVsZWFzZXMvZWxmYmFyLWpvaW5zLWZvcmNlcy13aXRoLXVrLXJlY3ljbGVyLXRvLXN0cmVuZ3RoZW4taXRzLWdsb2JhbC1zdXN0YWluYWJsZS1wcmFjdGljZXMtMzAxODQxOTAwLmh0bWzSAQA?oc=5\" target=\"_blank\">ELFBAR Joins Forces with UK Recycler to Strengthen its Global Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire UK<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ELFBAR Joins Forces with UK Recycler to Strengthen its Global Sustainable Practices - PR Newswire UK","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvLnVrL25ld3MtcmVsZWFzZXMvZWxmYmFyLWpvaW5zLWZvcmNlcy13aXRoLXVrLXJlY3ljbGVyLXRvLXN0cmVuZ3RoZW4taXRzLWdsb2JhbC1zdXN0YWluYWJsZS1wcmFjdGljZXMtMzAxODQxOTAwLmh0bWzSAQA?oc=5\" target=\"_blank\">ELFBAR Joins Forces with UK Recycler to Strengthen its Global Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire UK<\/font>","source.href":"https:\/\/www.prnewswire.co.uk","source.title":"PR Newswire UK","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"LONDON, June 5, 2023 \/PRNewswire\/ -- On World Environment Day, ELFBAR, a pioneer and innovator of vaping technologies, reiterated its sustainable practices and industry compliance through its comprehensive recycling efforts in reducing e-waste generation. The transportation process prioritizes minimal emissions and utilizes low-carbon vehicles approved by Euro 6 standards. Under the GreenPowercycle recycling program, ELFBAR has placed recycling bins to collect used ELFBAR products in its retail partners’ UK-based stores. The environmental regulatory landscape is ever changing and ELFBAR is actively following its development. In a move towards greater sustainability, ELFBAR has been working closely with the UK's compliance body, the European Recycling Platform (ERP), since 2022. The partnership has facilitated ELFBAR's successful registration under the guidelines of the Waste Electrical and Electronic Equipment (WEEE) regulations in the UK. To further enhance its environmental commitment, ELFBAR has launched the GreenPowercycle recycling program with Recover, one of the UK's most established lithium recycling companies, in the UK early this year. Leveraging its Euro 6 standard-compliant, low-carbon vehicles, Recover has handled the collection and transportation of the discarded devices from retail outlets. The collected devices are transported to an Authorized Approved Treatment Facility (AATF) certified organization, where they are completely and thoroughly disassembled for recycling. The GreenPowercycle recycling program ensures that all the components within the vapes, including the plastics and metals, undergo a rigorous disassembly and recycling procedure. \"Through the comprehensive recycling process, all components, including plastics and metals, are safely transformed into reusable secondary raw materials,\" said John Dorman, Chief Executive Officer of Recover. \"No e-cigarette maker has achieved this before ELFBAR.\" Several vape retail partners, such as MyCigara, Evapo, and Tidal Vape, have already joined the GreenPowercycle program to install dedicated recycling bins for used ELFBAR products in their UK-based stores. The initiative will be expanded to include more retail chains soon. This proactive step provides an easy way for consumers to conveniently dispose of their products after use. \"From R&D to business operations, environmental stewardship permeates all aspects of our business,\" said Priya Liu, Director of ESG of ELFBAR. \"We are committed to achieving zero waste diversion to landfills and are continually developing our recycling program. By 2025, ELFBAR aims to achieve closed-loop sustainable development by establishing a full-cycle recycling system that is mature, dismantlable, and reusable.\" Outside of the UK, ELFBAR has also been implementing environmental protection programs and carrying out recycling initiatives in various countries since last year. This includes Ireland, Romania, and Cyprus, where recycling services are provided in over 3,000 stores. ELFBAR's recycling program represents a tangible step towards environmental responsibility. Together with the environmentally focused brand GreenAwareness, ELFBAR is dedicated to advancing sustainable development and caring for the environment globally. Photo - https:\/\/mma.prnewswire.com\/media\/2092330\/Figure_1_The_transportation_process_prioritizes_minimal_emissions_utilizes_low_carbon.jpg Photo - https:\/\/mma.prnewswire.com\/media\/2092331\/Figure_2_Under_GreenPowercycle_recycling_program_ELFBAR_recycling_bins_collect.jpg Logo - https:\/\/mma.prnewswire.com\/media\/2092373\/ELFBAR_logo_Logo.jpg","filter_flag":1}
{"title":"Cruelty-Free Skincare: A Comprehensive Guide to Ethical Beauty - INQUIRER USA & CANADA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vdXNhLmlucXVpcmVyLm5ldC8xMzI0MDkvY3J1ZWx0eS1mcmVlLXNraW5jYXJlLWd1aWRl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vdXNhLmlucXVpcmVyLm5ldC8xMzI0MDkvY3J1ZWx0eS1mcmVlLXNraW5jYXJlLWd1aWRl0gEA?oc=5","id":"CBMiO2h0dHBzOi8vdXNhLmlucXVpcmVyLm5ldC8xMzI0MDkvY3J1ZWx0eS1mcmVlLXNraW5jYXJlLWd1aWRl0gEA","guidislink":false,"published":"Thu, 29 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=180, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vdXNhLmlucXVpcmVyLm5ldC8xMzI0MDkvY3J1ZWx0eS1mcmVlLXNraW5jYXJlLWd1aWRl0gEA?oc=5\" target=\"_blank\">Cruelty-Free Skincare: A Comprehensive Guide to Ethical Beauty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">INQUIRER USA & CANADA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cruelty-Free Skincare: A Comprehensive Guide to Ethical Beauty - INQUIRER USA & CANADA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vdXNhLmlucXVpcmVyLm5ldC8xMzI0MDkvY3J1ZWx0eS1mcmVlLXNraW5jYXJlLWd1aWRl0gEA?oc=5\" target=\"_blank\">Cruelty-Free Skincare: A Comprehensive Guide to Ethical Beauty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">INQUIRER USA & CANADA<\/font>","source.href":"https:\/\/usa.inquirer.net","source.title":"INQUIRER USA & CANADA","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The beauty landscape is constantly evolving, and one trend that has captured the hearts of all consumers is the growing demand for cruelty-free skincare products. Now more than ever, people are aware of the ethical considerations surrounding their beauty choices and actively seek products that align with their values. Cruelty-free and sustainable skincare has emerged as a significant player in the industry, thanks to its unwavering commitment to not testing on animals. In this guide, we will delve into the world of cruelty-free skincare, highlighting its numerous benefits, and presenting you with a handpicked selection of leading brands that prioritize ethical practices. Your subscription could not be saved. Please try again. Your subscription has been successful. Subscribe to our daily newsletter SIGN ME UP Whether you’re a seasoned skincare aficionado or a curious beginner dipping your toes into the realm of cruelty-free beauty, this guide is your ultimate resource. We aim to empower you with the knowledge and insights necessary to make well-informed purchasing decisions, ensuring you play a part in shaping a future of skincare that is both ethical and sustainable. Understanding Cruelty-Free Skincare Cruelty-free skincare refers to products that have not been tested on animals during their development or production stages. These products have formulations that focus on ethical and sustainable practices. Understanding the key aspects of these products is crucial in navigating the market and making conscious choices. The Concept of Cruelty-Free Skincare Cruelty-free skincare revolves around the principle of compassion toward animals. It promotes the use of alternative testing methods that do not involve subjecting animals to harmful procedures. ADVERTISEMENT Choosing skincare that do not test on animals means you support brands that prioritize animal well-being and refuse to participate in animal testing. Cruelty-Free vs. Vegan Skincare Many people use cruelty-free and vegan skincare interchangeably. However, they have distinct differences. Cruelty-free skincare refers to products not tested on animals, while vegan skincare goes a step further by excluding any animal-derived ingredients. Remember that not all cruelty-free products are vegan, as they may contain animal ingredients such as honey or beeswax. The Importance of Cruelty-Free Certifications and Labels Cruelty-free certifications and labels play a significant role in identifying and verifying ethical skincare products. Look for recognized certifications like Leaping Bunny and PETA’s Beauty Without Bunnies program. These certifications ensure that the brand adheres to strict cruelty-free standards and does not test on animals at any stage of production. How to Identify Cruelty-Free Skincare Brands Identifying cruelty-free skincare brands requires some research and understanding of the different certifications and labels. Look for the following indicators: Leaping Bunny Certification The Leaping Bunny is a cruelty-free international logo indicating that a brand is cruelty free. It requires suppliers and manufacturers to comply with a fixed cut-off date for animal testing. PETA’s Beauty without Bunnies Program The Beauty Without Bunnies program is another reliable certification that ensures a brand does not test on animals. Ensure that you also review a brand’s cruelty-free policy, which should be transparent and easily accessible on their website. Cruelty-Free Skincare and Global Regulations Remember that while a brand may be cruelty-free in one country, they may still sell their products in regions where the law requires these brands to test on animals. For example, some brands may choose to enter the Chinese market, where animal testing is mandatory for certain cosmetic products. International regulations can be a complex issue for consumers who wish to support cruelty-free brands. Researching a brand’s stance on international animal testing regulations can help you make an informed decision. Common Myths about Cruelty-Free Skincare Misconceptions surrounding cruelty-free products can lead to confusion and hinder informed decision-making. Let’s debunk some common myths and provide clarity regarding cruelty-free labels. Myth 1: “Cruelty-free labels are not regulated.” It’s true that there is no universal regulation for cruelty-free labeling. However, reputable certifications like Leaping Bunny and PETA’s Beauty Without Bunnies program provide reliable standards that brands must meet to obtain their certification. Myth 2: “Cruelty-free products are less effective.” This is a common misconception. Cruelty-free makeup brands undergo the same rigorous testing and formulation processes as any other skincare product. The only difference is that animals have no involvement in the testing. Myth 3: “Cruelty-free products are more expensive.” While some cruelty-free brands may have higher price points, there are also affordable options available. Most brands determine the cost of a product through various factors such as brand positioning, ingredients, and packaging. Myth 4: “Cruelty-free products are harder to find.” With the increasing demand for cruelty-free skincare, the availability of such products has significantly expanded. Many mainstream beauty retailers now carry some cruelty-free brands, and numerous online platforms have dedicated themselves to curating cruelty-free options. Additionally, the rise of social media has made it easier to discover and connect with cruelty-free skincare brands, making them more accessible than ever before. Myth 5: “Cruelty-free products are not as innovative as conventional skincare.” This is a common misconception that fails to acknowledge the progress made by cruelty-free brands in the skincare industry. Many cruelty-free beauty products brands invest heavily in research and development, formulating innovative products that deliver effective results without compromising ethics. From advanced serums to cutting-edge formulations, cruelty-free brands continue to push the boundaries of skincare innovation. Benefits of Choosing Cruelty-Free Skincare Opting for cruelty-free cosmetics extends beyond ethical considerations. There are several benefits to choosing these products, ranging from environmental advantages to potential health benefits. It is also one of the best ways to have glow-getter skin naturally. Ethical Implications and Environmental Benefits Choosing cruelty-free skincare means actively supporting the movement toward ending animal testing in the beauty industry. This decision contributes to reducing animal suffering and promoting ethical practices. Additionally, most cruelty-free beauty brands often prioritize sustainability, using eco-friendly packaging and sourcing certified organic ingredients responsibly. Potential Health Advantages Cruelty-free skincare products avoid using potentially harmful ingredients. Many skincare products are free from parabens, sulfates, and synthetic fragrances. These can be irritating or harmful to any skin type. Selecting cruelty-free options helps you minimize the risk of adverse reactions and prioritize the health of your skin. Positive Impact on Animal Welfare Choosing cruelty-free skincare demonstrates your commitment to animal welfare. By supporting cosmetic companies that refuse to test on animals, you actively encourage a shift towards more compassionate practices within the beauty industry. Your purchasing choices contribute to the demand for cruelty-free products and send a powerful message to companies that still engage in animal testing. Environmental Sustainability Cruelty-free skincare often goes hand in hand with a commitment to environmental sustainability. Many cruelty-free brands prioritize eco-friendly practices, such as using recyclable or biodegradable packaging, sourcing sustainable ingredients, and reducing their carbon footprint. Choosing cruelty-free skincare contributes to the preservation of the planet and supporting a brand’s products dedicated to minimizing their environmental impact. Switching to Cruelty-Free Skincare: What to Expect Transitioning to a cruelty-free skincare routine may seem daunting at first. But with the right information and resources, it becomes an empowering and rewarding process. Here’s what you can expect during your switch: Transition Phase Be patient during the transition phase. Your skin may need time to adjust to new products and ingredients. Give your skin a few weeks to adapt before evaluating the effectiveness of the products. Common Challenges and Solutions During the first few weeks after your switch, you may face finding suitable alternatives for your favorite non-cruelty-free products and navigating ingredient lists. Researching and exploring cruelty-free brands and reading reviews can help you discover new favorites. Additionally, several online resources provide comprehensive lists of cruelty-free brands and their product offerings. Adjusting to New Ingredients When transitioning to organic skincare, you may encounter new ingredients that you haven’t used before. Plant-based and natural ingredients are common in cruelty-free products. While these ingredients can offer numerous benefits, it’s important to be aware of any specific sensitivities or allergies you may have. Take the time to research and understand the ingredients in your new products, and consider consulting with a dermatologist if you have any concerns. Top Cruelty-Free Skincare Brands to Consider The market is brimming with cruelty-free skincare brands that offer a wide range of products catering to different skin concerns and budgets. Here are some standout brands that uphold their cruelty-free commitments: Paula’s Choice This beauty company is popular for its variety of skin care products that have clean formulas and are non-toxic. According to the brand, they have never used animals to test their products, which was confirmed by Leaping Bunny and PETA. With the majority of their skincare products being vegan and all natural, the brand takes a firm stand against the use of animal or animal-derived ingredients. They actively seek alternatives and continuously explore innovative formulations to minimize the presence of such ingredients in their products. Paula’s Choice predominantly offers vegan-friendly skincare solutions. However, they maintain transparency by acknowledging that a select few products may contain animal or animal-derived ingredients. In their commitment to transparency, Paula’s Choice provides an updated list of products that contain animal or animal-derived ingredients. Glossier Glossier is one of known beauty brands in many countries for their product and stands firmly against animal testing and cruelty in the beauty industry. With a strong commitment to ethical and sustainable practices, Glossier has earned a well-deserved reputation as a cruelty-free brand. They adhere to a strict policy of not testing their finished products or ingredients on animals, and they ensure their suppliers and third-party partners also share this cruelty-free philosophy. This unwavering stance ensures their products remain ethically sourced. Prioritizing the welfare of animals shows Glossier’s strong ethical commitment, giving consumers the peace of mind that their skincare routine is aligned with their values. One notable Glossier product that exemplifies Glossier as a brand is their best-selling Glossier Milky Jelly Cleanser. This gentle yet effective cleanser is formulated to remove impurities without stripping the skin’s natural moisture barrier. Drunk Elephant Picture a skincare brand that goes above and beyond, placing compassion and ethics at the forefront of their values. That’s Drunk Elephant for you. This remarkable brand takes a resolute stand against animal testing, making it a true cruelty-free champion. Drunk Elephant’s devotion to cruelty-free practices doesn’t go unnoticed. Currently, they may not be classified as a 100% vegan brand. Still, they wear their transparency like a badge of honor from PETA and Leaping Bunny certified. Some of their products contain ingredients derived from animals, and they’re upfront about it. Let’s get to know Drunk Elephant’s standout products that exemplifies their ethical and sustainable approach: the A-Gloei Retinol Oil. This marvelously crafted creation embodies Drunk Elephant’s philosophy of using high-quality, non-toxic ingredients while maintaining a strict no-animal-testing policy. Drunk Elephant is owned by Shiseido, a brand that does not uphold cruelty-free standards. If you prefer brands with ethically sourced ingredients or are not owned by companies that test on animals, it’s wise to explore alternative vegan skincare options and give them the attention they deserve. ELF Cosmetics With a strong commitment to cruelty-free practices, ELF ensures that none of their ingredients, formulations, or finished products are tested on animals anywhere in the world. As a Leaping Bunny and PETA-certified company, ELF goes above and beyond to uphold ethical standards in the beauty industry. This initiative aims to strip down cluttered packaging and introduce more sustainable options. Removing the plastic box and excess packaging has helped ELF make a significant contribution to reducing waste in the beauty industry. ELF Cosmetics takes pride in offering a wide range of cruelty-free vegan skincare and makeup products. All their products are 100% vegan, meaning they do not contain any animal-derived ingredients or by-products. This ensures that customers can enjoy high-quality cosmetics without compromising their values. ELF’s product lineup, from skincare essentials to makeup brushes and lashes, caters to various beauty needs while maintaining a cruelty-free approach. Tata Harper The brand has confirmed they test neither their finished products nor their ingredients on animals. In addition, their suppliers and any third parties involved in the production process also do not conduct animal testing. The company also emphasizes the importance of creating effective skincare solutions and formulas without compromising the well-being of animals. Offering a range of ethically sourced products has helped Tata Harper provide consumers with the assurance they can enjoy luxurious skincare while supporting a brand aligned with their values. Tata Harper is owned by AmorePacific, which many do not consider a cruelty-free brand. If you prefer to avoid brands owned by companies that test on animals, you might want to steer clear of Tata Harper. While Tata Harper itself is cruelty free, it’s not 100% vegan. Some of their products may contain animal-derived ingredients. However, the brand strives to be transparent about their formulations, allowing consumers to make informed choices based on their preferences and values. You may also like: Glow-Getter: The Ultimate Women’s Skincare Gift Guide Resources for Cruelty-Free Shopping Navigating the world of ethical beauty is made easier with the help of various resources. Here are a few valuable tools and certifications to aid your cruelty-free shopping journey: Leaping Bunny: Cruelty-Free Certification Program Leaping Bunny program is a widely recognized cruelty-free certification organization. Their website serves as a valuable resource for consumers looking to make ethical shopping choices. Leaping Bunny’s certification ensures that the brand and its suppliers do not test on animals at any stage of the product development process. When you visit their website, you have access to a comprehensive list of certified cruelty-free brands across various categories. The search feature allows you to look up specific companies or browse by product type. PETA’s Beauty Without Bunnies: Cruelty-Free Database PETA’s Beauty Without Bunnies is a widely used online database that aids consumers in their search for cruelty-free products. The database includes an extensive list of cruelty-free brands and products, along with information on companies that continue to test on animals. Users can search for specific brands or browse through different categories to find suitable alternatives. PETA regularly updates their database to ensure accurate and up-to-date information. Beauty Without Bunnies is a valuable resource for individuals looking to support brands that align with their cruelty-free values and avoid those that do not prioritize animal welfare. Cruelty-Free Kitty: Cruelty-Free Beauty Blog and Resource Cruelty-Free Kitty is a popular beauty blog and resource that offers a wealth of information for cruelty-free shoppers. The website features extensive lists of cruelty-free brands, product recommendations, and informative articles. Cruelty-Free Kitty provides up-to-date information on animal testing policies and helps consumers determine if a brand is genuinely cruelty-free. The website is a valuable tool for those seeking guidance, reviews, and reliable information on cruelty-free products across various categories. Logical Harmony: Cruelty-Free Shopping Guide Logical Harmony is a trusted resource that provides comprehensive guidance for cruelty-free shopping. The website features a cruelty-free brand list, product reviews, and shopping guides. Logical Harmony categorizes brands according to their cruelty-free status, helping consumers easily identify and support ethical companies. The website is a go-to destination for those looking to make cruelty-free choices in various industries, including beauty, personal care, and household products. Choose Cruelty-Free (CCF): Australian Cruelty-Free Resource Choose Cruelty-Free (CCF) is an Australian brand dedicated to ending animal testing. Their website offers a searchable database of certified cruelty-free brands and products. While their focus is primarily on Australian and international companies, the listed brands are often available globally. Choose Cruelty-Free provides valuable information to consumers looking for cruelty-free alternatives and supports ethical businesses that prioritize animal welfare. Final Thoughts In an ever-evolving beauty landscape, the demand for humane beauty products has captured the hearts of American consumers. People are now more aware than ever of the ethical considerations surrounding their beauty choices and actively seek out products that align with their values. With a wide range of cruelty-free skincare brands available, we’ve highlighted several standout brands in this guide. Paula’s Choice, Glossier, Drunk Elephant, ELF Cosmetics, and Tata Harper uphold their cruelty-free commitments and offer products that cater to different skin concerns and budgets. These brands prioritize ethical and sustainable practices, and their dedication to cruelty-free skincare is commendable. Navigating the world of cruelty-free skincare is now easier with the help of valuable tools and certifications. Recognized certifications like Leaping Bunny and PETA’s Beauty without Bunnies program play a significant role in identifying and verifying ethical skincare products. These resources help you come to informed choices and support brands that align with your values. Your onscious choices and choosing cruelty-free skincare can help shape a future of ethical and sustainable skincare. Frequently Asked Questions (FAQs) What does it mean for a brand to be certified cruelty-free? When a brand is certified cruelty-free, it means that they have undergone a thorough verification process by recognized organizations such as Leaping Bunny or PETA. These certifications ensure that the brand does not test its products on animals at any stage of development or production. Are all cruelty-free skincare products suitable for sensitive skin? Cruelty-free skincare products are formulated with a focus on ethical practices. Still, remember that not all products may be suitable for sensitive skin. Check the product’s ingredient list and, if possible, perform a patch test before adding it into your skincare routine. Opting for products specifically designed for sensitive skin can be a safer choice. Are cruelty-free skincare products more expensive than conventional skincare products? Cruelty-free skincare products are available in a wide range of price points, from affordable options to luxury brands. Some cruelty-free brands may have higher price tags due to premium ingredients or sustainable sourcing. However, there are plenty of affordable and accessible cruelty-free options available. It’s possible to find cruelty-free skincare products that fit within your budget. Are all cruelty-free skincare brands also vegan? Cruelty-free skincare brands prioritize the ethical treatment of animals and do not conduct animal testing. Still, not all cruelty-free brands are vegan. Cruelty-free specifically refers to the absence of animal testing, while vegan skincare products do not contain any animal-derived ingredients or animal byproducts. Check the labels or brand websites for vegan certifications or indications if you’re specifically looking for vegan skincare options.","filter_flag":1}
{"title":"Trends in Fashion & Apparel Manufacturing - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTY4Mi90cmVuZHMtaW4tZmFzaGlvbi1hcHBhcmVsLW1hbnVmYWN0dXJpbmfSAWRodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk2ODIvdHJlbmRzLWluLWZhc2hpb24tYXBwYXJlbC1tYW51ZmFjdHVyaW5nP2FtcD10cnVl?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTY4Mi90cmVuZHMtaW4tZmFzaGlvbi1hcHBhcmVsLW1hbnVmYWN0dXJpbmfSAWRodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk2ODIvdHJlbmRzLWluLWZhc2hpb24tYXBwYXJlbC1tYW51ZmFjdHVyaW5nP2FtcD10cnVl?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTY4Mi90cmVuZHMtaW4tZmFzaGlvbi1hcHBhcmVsLW1hbnVmYWN0dXJpbmfSAWRodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk2ODIvdHJlbmRzLWluLWZhc2hpb24tYXBwYXJlbC1tYW51ZmFjdHVyaW5nP2FtcD10cnVl","guidislink":false,"published":"Fri, 16 Jun 2023 12:15:27 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=16, tm_hour=12, tm_min=15, tm_sec=27, tm_wday=4, tm_yday=167, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTY4Mi90cmVuZHMtaW4tZmFzaGlvbi1hcHBhcmVsLW1hbnVmYWN0dXJpbmfSAWRodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk2ODIvdHJlbmRzLWluLWZhc2hpb24tYXBwYXJlbC1tYW51ZmFjdHVyaW5nP2FtcD10cnVl?oc=5\" target=\"_blank\">Trends in Fashion & Apparel Manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Trends in Fashion & Apparel Manufacturing - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTY4Mi90cmVuZHMtaW4tZmFzaGlvbi1hcHBhcmVsLW1hbnVmYWN0dXJpbmfSAWRodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk2ODIvdHJlbmRzLWluLWZhc2hpb24tYXBwYXJlbC1tYW51ZmFjdHVyaW5nP2FtcD10cnVl?oc=5\" target=\"_blank\">Trends in Fashion & Apparel Manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The fashion industry is undergoing a paradigm shift, with technology and digitisation at the forefront of this transformation. The integration of new technologies, such as robotics, 3D printing, and CRM systems, is facilitating greater efficiency, productivity, and customer satisfaction. The industry is also embracing ethical and sustainable manufacturing practices, driven by consumer demand for greater transparency and social responsibility. As the fashion industry continues to evolve, it is expected that technology will play an increasingly critical role in driving progress towards a more sustainable, ethical, and customer-centric future. The fashion industry is undergoing a digital transformation that is comparable to the Industrial Revolution of the 1800s. With the rise of technology and hyperconnected consumers, the entire manufacturing business has been forced to adapt quickly to meet changing customer demands. As a result, the creation and manufacture of fashion have seen some of the most significant developments, which have revolutionised the sector’s functionality. To ensure that the right products are available to the right clients at the right time, at the right price, and with the right logistics, the industry must adapt swiftly. This has necessitated the continued digitisation of manufacturing using more interconnected platforms and gadgets. To stay competitive, businesses and entrepreneurs must gather and analyse user data, sales performance, user feedback, and supply chain difficulties quickly. This has resulted in the continued digitisation of manufacturing, using more interconnected platforms and gadgets. In this context, several trends are shaping the future of manufacturing, and some of the most impactful ones are discussed in this article. Machine Learning Machine learning has the potential to revolutionise the textile manufacturing industry by automating many processes and drastically increasing efficiency. Though it is not new for a machine to be able to study and mimic intelligent human behaviour, the cutting-edge algorithms are currently changing how the manufacturing sector gathers data, performs specialised labour, and forecasts customer behaviour. Some even offer client emotion regarding products and runway photographs, as well as themes in vogueing patterns, shapes, hues, and styles. To determine whether the perfect customer for a brand is present and what goods they should buy, some are practically replacing humans. For instance, Tommy Hilfiger announced collaboration with IBM and the Fashion Institute of Technology to create an Artificial Intelligence System to analyse this kind of data and optimise sales, production, and cost while also reducing waste. Students at FIT will have access to IBM Research’s AI capabilities, including computer vision, to analyse company data, including customer sentiment about every Tommy Hilfiger product and real-time fashion industry trends, in order to make educated decisions about the creation of new products. Supply Chain Optimisation Supply chain optimisation is crucial for businesses in the textile manufacturing industry to remain competitive in a fast-paced and demanding market. With consumers increasingly demanding faster delivery times, it is essential to reduce lead times and improve the efficiency of the supply chain. One way that many businesses are achieving this is by bringing all aspects of production ‘in-house’. By sourcing materials, designing, producing, and shipping products all under one roof, businesses can streamline operations and improve communication between teams. Real-time communication is essential to ensure that all teams have the same information and are working towards the same goals. This can help reduce errors and misunderstandings, leading to better customer service, higher quality products, and improved sustainability. Effective supply chain optimisation can also help reduce inventory costs and optimise production flows. By improving coordination between suppliers and customers, businesses can minimise waste and reduce costs, leading to greater profitability and a more sustainable business model. The benefits of supply chain optimisation are not limited to large corporations like Gucci; even small manufacturers can benefit from implementing these strategies. By optimising their supply chain, businesses of all sizes can remain competitive in a rapidly evolving market and meet the demands of increasingly impatient consumers. Fashion on Demand Fashion on demand is a growing trend in the industry that involves producing clothing only when an order is placed, rather than producing large quantities of clothing in advance. This approach to production is gaining popularity due to the advancements in technology, such as automation and data analytics, which have made just-in-time production more feasible and efficient. Traditionally, fashion production cycles were lengthy and required over a year of planning, resulting in a large amount of unsold inventory that often ended up in landfills. However, the rise of small-batch production cycles and made-to-order trends has reduced the amount of overstocked apparel and made the production cycle more sustainable. Emerging fashion firms like Dressarte and software firms like ShareCloth are leading the way in digitising fashion and creating 3D virtual models of clothing and consumers’ bodies, allowing for shops to place orders before the products are manufactured. Major players in the fashion industry, such as Boohoo, Zara, Uniqlo, and Asos, are also adopting this trend. While on-demand production has the advantage of small batch inventories and a more sustainable production cycle, it also comes with higher production costs due to fewer garments being made. Nonetheless, the benefits of reducing waste and improving sustainability are driving the trend forward, and it is likely to become even more prevalent in the fashion industry in the future. Robot Designs for the Manufacturing Floor Robots are becoming an increasingly common presence on manufacturing floors, and they are being designed to work more collaboratively with humans. The latest robotic designs are equipped with advanced memory and adaptability features, allowing them to perform a wider range of tasks and work more efficiently. The primary goal of these new robotic designs is to make workers smarter and keep them safe by replacing humans in hazardous or repetitive tasks. Robots are especially useful for tasks such as material handling, assembly, and inspection, where they can perform tasks quickly and with high precision. In the fashion industry, robotic fabric cutting has been used for some time, but robotic sewing has been more challenging due to the difficulty in working with certain types of fabrics, such as elastic or malleable materials. However, there have been some successful examples, such as Nike’s use of Grabit’s electroadhesion-based robotic gripper for shoe production. The latest robotic designs are meant to enhance the productivity and efficiency of manufacturing processes while keeping workers safe and reducing the risk of injury. As technology continues to advance, we can expect to see even more sophisticated robotic designs on manufacturing floors in the future. Digital Factories Digital factories are transforming the textile and apparel industry, as manufacturers adopt cutting-edge technologies to improve their operations. By digitising their supply and production chains, manufacturers can leverage technologies such as workers augmentation, end-to-end, real-time planning, and big data analytics to generate highly personalised items and increase productivity. The future of factories is fully automated, with self-maintaining and self-repairing infrastructure that requires minimal human involvement. They will enable self-diagnosis and predictive analytics, and fully integrated smart factories will provide an accurate view of all stages of the manufacturing process with the help of real-time processing and data analysis. The Digital Twin strategy is a popular approach to digitalisation that involves creating virtual replicas of manufacturing operations in a digital environment. These virtual models, known as digital twins, offer many benefits, including the ability to test innovative process solutions for factories without incurring high overhead costs. By leveraging digital twins, manufacturers can optimise their production processes, reduce downtime, and ultimately lower their production costs over time. Digital factories also enable businesses to adopt sustainable practices by reducing waste and energy consumption. With the help of real-time data analysis and predictive maintenance, manufacturers can identify areas for improvement in their production processes and optimise their use of resources. Rapid Data Analysis Rapid data analysis is a critical component of manufacturing management in today’s fast-paced environment. With the help of real-time feedback and data collected from production, factories and brands can quickly identify any flaws or defects in their products and take corrective action before they become major issues. Management software such as IQMS can help manufacturers monitor production in real-time, which provides valuable insights into how their operations are performing. Cloud computing has revolutionised the way businesses operate, and manufacturing is no exception. Cloud-based ERP systems offer a whole-system solution, which allows for automated updating without the downtime associated with outdated ERP systems. Manufacturers can securely store their customer, warehouse, and financial information on a single platform, making the entire supply chain more visible. Manufacturers who use cloud-based ERP systems have access to powerful data analysis tools, which can help them make informed decisions about production and inventory management. By analysing data in real-time, manufacturers can identify inefficiencies in their operations and take corrective action before they become major issues. The use of cloud computing in apparel manufacturing is expected to increase in the coming years, leading to greater transparency throughout the entire supply chain. By eliminating wasteful spending and reducing production costs, manufacturers can improve their profitability while delivering high-quality products to their customers. Rapid data analysis is an essential tool for achieving these goals, enabling manufacturers to respond quickly to changing market conditions and stay ahead of the competition. Manufacturing CRM Manufacturing CRM (Customer Relationship Management) software is revolutionising the way that manufacturing companies manage their customer relationships and enhance their sales performance. With this tool, businesses can centrally organise and manage client data on a single platform, making it easier to close deals and improve customer satisfaction. The textile manufacturing industry is a prime example of how Manufacturing CRM is transforming the manufacturing sector. By streamlining their processes, organisations can track customer interactions and sales performance, giving them access to real-time data that they can use to make informed decisions. This allows manufacturers to be more agile and respond more quickly to changes in the market. One of the biggest benefits of Manufacturing CRM is that it provides a single view of all customer interactions. This means that manufacturers can better manage their relationships with clients and gain deeper insights into their purchasing behaviours. This information can be used to create new products that meet customer needs and improve existing products to increase customer satisfaction. Marketing campaigns and other customer outreach activities are also made more effective with Manufacturing CRM. By providing insights into the effectiveness of these initiatives, manufacturers can tailor their marketing efforts to individual customers, creating a more personalised experience that leads to greater long-term satisfaction. Overall, Manufacturing CRM is a game-changing tool for manufacturers who want to improve their sales performance, streamline their processes, and enhance customer satisfaction. With access to real-time data and a single view of customer interactions, manufacturers can make better decisions and build stronger relationships with their clients. 3d Design, Printing, and Mass Customisation 3D printing technology is revolutionising the way brands approach design, production, and customisation. With the ability to produce items on demand, brands can reduce waste and offer personalised products that meet the unique preferences of each client. Cutting-edge 3D rendering technologies, such as CLO, enable brands to update designs in real-time, making it easier to confirm silhouette and fit in the development phase, minimising unnecessary waste and inaccuracy in the sample before finalisation. The benefits of 3D printing, however, extend beyond the design phase. On-demand production has become increasingly accessible, with a wide range of 3D products available, such as 3D-printed sneakers and 4D-printed sneakers produced by Adidas and knitwear produced on-demand by Ministry of Supply. Ministry of Supply claims that their ‘Slouchy’ sweater is zero-waste, as their ‘3D Print-Knit’ technology goes straight from yarn to garment, minimising waste and reducing environmental impact. Digital knitting is another development in the apparel sector that offers a wide array of customising options. With the help of 3D printing technology, brands can create unique, high-quality designs in less time and with less waste than traditional manufacturing methods. Thus, the rise of 3D printing technology is transforming the way brands approach design, production, and customisation. It offers numerous benefits, including reduced waste, increased personalisation, and faster time to market. As technology continues to improve, the possibilities for 3D printing in the fashion industry are endless. Better Working Conditions In recent years, the fashion industry has seen a growing number of international firms taking action to ensure fair living wages and improved working conditions for employees. This is a response to the exploitation that has occurred due to economic constraints, fragmented production models, and a lack of critical thinking. To achieve these goals, companies are entering into agreements with vendors, governments, and NGOs. These partnerships allow for greater transparency in the supply chain, and ensure that workers are treated fairly. In some cases, companies are even urging governments to raise their labour standards. Advancements in internet-based technology have also made it easier to uncover and track information related to working conditions. This information can then be used to organise and connect people and groups to advocate for better conditions. However, despite these efforts, there are still many challenges to ensuring better working conditions for employees. Governments may fail to enforce laws that protect workers, and workers themselves may not fully understand their rights. Since access to information has been a key factor in facilitating progress towards better working conditions, as technology continues to evolve, it will be important to continue using it as a tool for positive change in the fashion industry and beyond. Ending Note The world of global textile manufacturing is rapidly changing and adapting as both brands and consumers embrace new technologies, materials, ethical standards and production methods. With a focus on fast fashion, sustainability and traceability, the trend towards consumerism appears to be driving an encouraging movement towards greater transparency in the textile industry and a growing commitment to ethical manufacturing practices. As the latest trends continue to develop, it is expected that consumer choice and preferences will be better served with improved access to increased quality products as well as greater understanding of their origin.","filter_flag":1}
{"title":"Role of R&D in achieving sustainable goals - Indian Chemical News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4","guidislink":false,"published":"Mon, 26 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=177, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5\" target=\"_blank\">Role of R&amp;D in achieving sustainable goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Role of R&D in achieving sustainable goals - Indian Chemical News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9yb2xlLW9mLXJkLWluLWFjaGlldmluZy1zdXN0YWluYWJsZS1nb2Fscy0xNzk1ONIBX2h0dHBzOi8vd3d3LmluZGlhbmNoZW1pY2FsbmV3cy5jb20vb3Bpbmlvbi9saXRlL3JvbGUtb2YtcmQtaW4tYWNoaWV2aW5nLXN1c3RhaW5hYmxlLWdvYWxzLTE3OTU4?oc=5\" target=\"_blank\">Role of R&amp;D in achieving sustainable goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Chemical News<\/font>","source.href":"https:\/\/www.indianchemicalnews.com","source.title":"Indian Chemical News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The chemical industry is a major contributor to the global economy, with a market size of over US $4 trillion in 2021. The industry is also a significant employer, with millions of people working in various roles, including research and development, production, quality, EHS, sales, and logistics. In India, the chemical industry is extremely diversified and covers more than 80,000 commercial products. This can be broadly classified into bulk chemicals, specialty chemicals, agrochemicals, petrochemicals, polymers, and fertilizers. One of the major challenges the industry faces is changing consumer preferences. As consumers become more environmentally conscious, there is an increasing demand for products that are made from sustainable and environmentally friendly materials. This trend is driving the development of new products and technologies and therefore, one of the fundamental drivers of growth in the chemical industry continues to be R&D. The traditional approach of chemical organizations to R&D may not be the best option as the industry is changing fast with development of newer technologies and digitalization across the world. It will be difficult for companies to remain competitive if they do not stay ahead of the technology curve. This is only possible by investing in R&D and developing new products. Therefore, R&D will play an extremely important role in helping organizations achieve sustainable goals. Sustainable chemistry aims to design and develop chemicals and processes that reduce or eliminate the use and generation of hazardous substances, minimize environmental impacts, and promote economic growth. It is important for R&D to focus on the twelve principles of “Green Chemistry” which include prevention, atom economy, less hazardous chemical syntheses, designing safer chemicals, safer solvents and auxiliaries, design for energy efficiency, use of renewable feedstocks, reduce derivatives, catalysis, design for degradation, real-time analysis for pollution prevention, and inherently safer chemistry for accident prevention. Scientists and engineers working in R&D should also focus on developing new sustainable materials, such as biodegradable plastics, bio-based materials, and recyclable materials to replace traditional materials that are less sustainable. Newer technologies can also be used to develop new processes for recycling and upcycling materials. Chemists need to develop new methods for breaking down plastics into their component parts, which can then be used to create new products. Additionally, upcycling processes can transform waste materials into new products, reducing the need for new raw materials. Coatings play a critical role in many industries, but traditional coatings can be harmful to the environment. Green chemistry can be used to develop sustainable coatings that are less harmful to the environment. For example, researchers can develop coatings that are made from renewable materials or coatings that have lower volatile organic compound (VOC) emissions. In the agrochemical industry, efforts of scientists over several years have resulted in identification and developing safer chemicals that have lower toxicity and are less harmful to human health and the environment. Discovering new modes of actions for insecticides, herbicides, and fungicides has helped farmers to reduce the doses of chemicals from Kg\/hectare to few grams\/hectare. Scientists have developed safer raw materials which cause minimum damage to the environment and are less hazardous for farmers. Collaboration among researchers, government agencies, and industry can help identify safer chemicals. By sharing data and knowledge, stakeholders can work together to identify chemicals that are safer and more sustainable. In the pharmaceutical industry, sustainable manufacturing of Active Pharmaceutical Ingredients (APIs) is important to ensure supply security to manufacture required formulations. This was evident during Covid-19 period as some of the most developed nations were dependent on India to supply life-saving drugs. Recently developed and introduced APIs are highly active but complex in chemistry. Therefore, more sophisticated processes are involved which also poses challenges and opportunities for R&D scientists. Atom economy, waste generation and chemical reaction hazards need to be focused to ensure sustainability of the processes. In the oil and gas industry, engineers and chemists in the upstream processes need to collaborate to develop greener solutions which are effective as corrosion inhibitors, scale inhibitors, viscosity modifiers, emulsion breakers, reverse emulsion breakers, biocides, hydrate inhibitors among others. These solutions are extremely important for sustainability considering the high-volume requirements. Developing and identification of greener catalysts, fuel additives, H2S scavengers in the downstream process of the oil and gas industry is equally important for sustainability. Today, the sustainable practices followed by Industries are limited to solvent recoveries and developing safe processes to avoid accidents. Economic and technical challenges often hinder the commercialization of green chemical processes. Over the last few years, commercialization of a few green technologies using ionic liquids and supercritical carbon dioxide as solvent were attempted with limited success. Microwave chemistry is extremely popular with academia but still not seen as a success in commercial applications. Advantages of microwave chemistry include low energy consumption, homogeneity, speed of heating, faster reaction (minutes instead of hours or days), atom economy (greater yield and lesser wastage), green solvents (including water, ethanol, and methanol) which are strongly responsive to microwave. Less or no solvent also gives opportunity to perform concentrated reactions and possibility of neat condition or supported reagents. Rapid conditions screening for integrated on-line control guarantees safe operations. R&D scientists need to challenge themselves to commercialize this technology which will contribute significantly to the sustainability cause. There are also recent reports of commercial applications of surfactant mediated reactions but in limited numbers. Many organic fundamental organic reactions, which otherwise need organic phase and dry conditions, can be carried out in water using surfactant mediated technology. Advantages of this chemistry is that it brings substrates and reagents in proximity to enhance efficiency and rate of reaction, and it sometimes shows reactivity or selectivity that cannot be attained in organic medium. Considering the potential of this technology, more efforts are needed to popularize green chemistry. Flow chemistry is getting good traction and over the next few years, it is expected that several batch processes will be converted to continuous using flow chemistry. In flow chemistry, reagents are continuously pumped through the reactor and the product is continuously collected. Key factors for flow chemistry reactions are residence time (flow rates), mixing, pressure and temperature. Some of the highly energetic reactions such as nitration are good candidates for flow chemistry and are being practiced in industry. Sustainability principles should be considered when we initiate the process development of any molecule. It is important that during the ideation stage, we must thoroughly debate and look for sustainable practices. This includes the use of lower quantities of volatile organic solvents and recyclable catalysts. This also includes focusing on processes which give least minimum products and maximum yields resulting in superior atom economy and selecting processes with least steps resulting in energy efficient synthesis. During the entire product lifecycle from development to growth and from maturity to decline, processes need changes. In every step, the development team must focus on sustainability which may also be achieved through collaborations with academia or research institutes. Industry and academia must foster a better environment for creativity by jointly building and developing new knowledge and by bringing together multi-talented groups of researchers from both pools to provide solutions to make R&D more sustainable. To develop a sustainable process for optimum yield (which is also intrinsically safe to manufacture), very often we are required to use solvents in larger quantities and hence it is extremely important to judiciously follow 3R (Reduce, Reuse, and Recycle) principles. We must try to Reduce as minimum solvent as possible in the process, our next option must be to Reuse it back in the process. However, very often it has challenges of impurities and therefore Recycle after appropriate treatment is key to the success of the process. All efforts should also be made to use solvents with superior EHS profile such as minimum ozone depletion potential and biodegradability. This also has an economic advantage since incineration of waste is not cost effective and will result in expensive product costs. Green chemistry is probably not a solution to all environmental challenges, but it still remains to be the most fundamental approach in achieving sustainability goals. Green processes will not be successful if not economically viable and therefore Green technology must compete with classical processes with respect to cost of the product. More efforts are required from R&D as well as commercial teams to make our products “Good and Green”. Globally, there is an increased regulatory focus on ESG and climate risk, and the chemical industry will be the first one to face scrutiny. We need to work towards changing the environmental brand image of the chemical industry by focusing on sustainable and green technologies to deliver better and safer solutions. R&D will play an integral role in fostering economic and viable solutions for future growth.","filter_flag":1}
{"title":"ITC SWOT Analysis (2024) - Business Model Analyst","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5","id":"CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA","guidislink":false,"published":"Sun, 04 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=155, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5\" target=\"_blank\">ITC SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ITC SWOT Analysis (2024) - Business Model Analyst","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vYnVzaW5lc3Ntb2RlbGFuYWx5c3QuY29tL2l0Yy1zd290LWFuYWx5c2lzL9IBAA?oc=5\" target=\"_blank\">ITC SWOT Analysis (2024)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Model Analyst<\/font>","source.href":"https:\/\/businessmodelanalyst.com","source.title":"Business Model Analyst","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"ITC SWOT Analysis encompasses a comprehensive assessment that examines the strengths, weaknesses, opportunities, and threats faced by ITC Ltd, a leading Indian conglomerate that operates in diverse sectors. The company was formerly known as the Imperial Tobacco Company of India Limited. It is based in India, and it has established itself as a powerhouse in multiple industries by being a significant player in sectors, such as fast-moving consumer goods (FMCG), agribusiness, hotels, paperboard, and information technology. ITC Ltd’s operations span across India and extend to various international markets. In India, the company has a widespread presence, with manufacturing units, offices, and distribution networks strategically located across the country. ITC’s international footprint includes a global agribusiness presence, with exports of agricultural commodities to numerous countries. Additionally, ITC Hotels cater to both domestic and international tourists, offering unparalleled hospitality experiences. ITC Ltd traces its origins back to 1910 when it was incorporated as the Imperial Tobacco Company of India Limited. At the time, its primary focus was on manufacturing and marketing cigarettes, catering to the growing demand in the Indian market. The company established its first manufacturing facility in Munger, Bihar, and quickly gained a reputation for producing high-quality tobacco products. Recognizing the need to diversify its operations and reduce dependence on a single industry, ITC Ltd embarked on a journey of expansion into new businesses. This strategic move aimed to leverage its resources, expertise, and brand equity to venture into sectors with promising growth potential. Over the years, ITC Ltd successfully entered several industries, expanding its footprint and establishing itself as a diversified conglomerate. One of the key areas where ITC Ltd made significant strides is the fast-moving consumer goods (FMCG) sector. In the 1970s, the company ventured beyond tobacco and entered the FMCG market with the launch of its personal care products under the brand name “Essenza Di Wills.” This foray marked the beginning of ITC’s journey into non-tobacco consumer goods. In subsequent years, ITC Ltd expanded its FMCG portfolio, introducing a range of products across categories such as food and beverages, personal care, education stationery, and safety matches. The company’s FMCG division witnessed exponential growth, fueled by its commitment to quality, innovation, and consumer-centric strategies. Today, ITC Ltd’s FMCG brands, including Aashirvaad, Sunfeast, Bingo!, and Yippee!, are household names in India and enjoy a significant market share. ITC Ltd recognized the importance of building a robust supply chain and ensuring sustainable sourcing practices. In the early 1980s, the company entered the agribusiness sector, focusing on agricultural commodities such as wheat, rice, leaf tobacco, and coffee. With a vision to create a more inclusive and sustainable agricultural ecosystem, ITC Ltd implemented farmer empowerment programs, promoting responsible farming practices, and enhancing the livelihoods of farmers across the country. The company’s agribusiness division handles the sourcing, processing, and exporting of agricultural commodities. ITC Ltd’s efforts in this sector have not only strengthened its supply chain, but also contributed to rural development and the overall growth of the agricultural industry in India. In the late 1970s, ITC Ltd made its entry into the hospitality industry with the launch of its first luxury hotel, the ITC Maurya, in New Delhi. This marked the inception of ITC Hotels, a chain known for its opulence, exceptional service, and commitment to sustainability. Over the years, ITC Hotels expanded its presence across major cities and tourist destinations in India, offering a unique blend of traditional Indian hospitality and contemporary luxury. ITC Hotels has been a pioneer in sustainable practices, emphasizing environmental stewardship and social responsibility. The chain has received numerous accolades for its initiatives in energy conservation, water management, and community development, making it a preferred choice for environmentally conscious travelers. From its humble beginnings as a tobacco company, ITC Ltd has transformed into a diverse conglomerate with a remarkable presence in various industries. In this article, we will be examining the internal factors that empower ITC and the external elements that pose challenges. This SWOT analysis will help to shed light on the company’s current standing, growth potential, and strategic implications, allowing stakeholders to gain valuable insights into its prospects. SWOT Analysis of ITC ITC Strengths The following are the strengths that have helped ITC remain in business for over a century: Diversified Portfolio In the highly competitive business landscape, companies that possess a diversified portfolio enjoy a distinct advantage. ITC has strategically ventured into multiple industries, including fast-moving consumer goods (FMCG), agribusiness, hotels, paperboard, and information technology. This diversification has proven to be a pillar of strength for the company. ITC Ltd’s diversified portfolio provides a buffer against market fluctuations that may affect individual sectors. By operating in multiple industries, the company can mitigate the impact of adverse conditions in any one sector. Diversification reduces ITC Ltd’s reliance on any single industry, particularly its historical association with tobacco. Strong Brand Equity Brand equity plays a pivotal role in the success and sustainability of any business. For ITC Ltd, a conglomerate operating in various industries, solid brand equity is undeniably a significant strength. ITC Ltd’s substantial brand equity fosters a high level of consumer trust and loyalty. Through consistent delivery of quality products and services, the company has cultivated a positive reputation among its target audience. It also provides the company with a competitive advantage in the market and helps the company to differentiate itself from competitors. Finally, during times of crisis or challenging situations, robust brand equity acts as a protective shield for ITC Ltd. Extensive Distribution Network An extensive distribution network is often a critical factor that can propel a company to success. ITC Ltd possesses an extensive distribution network that spans urban and rural areas in India. This enables the company to reach a vast and diverse consumer base. By establishing a strong foothold across different regions and markets, ITC Ltd can tap into a wide range of customers with varied preferences and purchasing power. ITC Ltd’s extensive distribution network also provides a competitive advantage when launching new products or expanding into new markets. When introducing a new product, the company can leverage its established distribution channels to reach a broad audience quickly. Sustainable Practices Companies are increasingly realizing the importance of adopting sustainable practices, as the business landscape changes rapidly. By integrating sustainability into its operations, ITC has shown its deep commitment to environmental stewardship, social responsibility, and ethical governance. The company has implemented numerous initiatives to reduce its ecological footprint and promote conservation. These include energy-efficient operations, waste management programs, water conservation measures, and the use of renewable energy sources. Sustainable practices adopted by ITC Ltd often result in cost savings and improved operational efficiency. Embracing sustainability drives innovation and product differentiation for ITC Ltd. In conclusion, ITC’s sustainable practices not only enhance its brand reputation but also positions the company for long-term success in a rapidly evolving business landscape. Strong Research and Development (R&D) Capabilities ITC stands out for its strong research and development (R&D) capabilities that help it stay ahead of the curve. The company’s R&D capabilities serve as a driving force behind product innovation. The company invests heavily in R&D activities to develop cutting-edge technologies, novel product formulations, and unique solutions that meet evolving customer needs. Through its strong R&D capabilities, ITC Ltd focuses on enhancing the quality and performance of its products and services. Also, the company invests in patents, trademarks, copyrights, and trade secrets to protect its innovative technologies, processes, and formulations. In conclusion, ITC’s strong R&D capabilities foster market differentiation, nurture collaborative partnerships, and future-proof its business. ITC Weaknesses The following are the weaknesses that pose challenges to ITC’s growth and development: Dependence on Cigarette Business While ITC Ltd has established itself as a diversified conglomerate with interests spanning various sectors, its significant reliance on the cigarette industry poses challenges and vulnerabilities. The cigarette market is highly saturated and fiercely competitive. ITC Ltd faces intense competition from both domestic and international tobacco companies. The market dominance of established players, coupled with the challenges of brand loyalty and consumer preferences, makes it difficult for ITC Ltd to expand its market share significantly. Also, the cigarette industry is subject to stringent regulations and increasing scrutiny worldwide. Governments are implementing stricter regulations, including higher taxes, graphic health warnings, advertising restrictions, and bans on smoking in public places. Geographic Concentration Despite the advantages of ITC’s domestic market, it also exposes the company to vulnerabilities and limitations. Geographic concentration restricts ITC Ltd’s exposure to a single market, namely India. While the Indian market is vast and offers tremendous growth potential, over-reliance on a single market limits the company’s ability to diversify its revenue streams. Market fluctuations, economic downturns, or regulatory changes specific to India can have a significant impact on ITC Ltd’s overall financial performance. Also, operating primarily in the Indian market exposes ITC Ltd to intense competition from domestic and regional players. Slow Adoption of E-commerce In an era marked by rapid digital transformation and changing consumer preferences, the slow adoption of e-commerce poses a serious challenge to ITC. The slow adoption of e-commerce means that ITC Ltd needs to fully tap into the potential revenue and growth opportunities offered by online retail channels. With the increasing popularity of online shopping, consumers are seeking convenience, broader product selections, and competitive pricing. By not fully embracing e-commerce, ITC Ltd may miss out on a significant portion of the market and potential customers who prefer online purchasing. Also, by not actively participating in e-commerce, ITC Ltd risks falling behind in terms of industry trends and customer expectations. High Debt Levels While ITC operates across diverse sectors and has achieved considerable success, its burden of substantial debt can hinder its growth potential and financial stability. High levels of debt restrict ITC Ltd’s financial flexibility and limit its ability to allocate resources efficiently. The company’s cash flow and profitability may be impacted by the need to service debt obligations, including interest payments and debt repayments. This financial strain can constrain the company’s ability to pursue new growth opportunities, invest in research and development, undertake strategic acquisitions, or respond effectively to market fluctuations. In conclusion, ITC’s high debt levels lead to financial constraints, increased interest costs, limitations on capital expenditure, ratings downgrades, reduced investor confidence, and restricted strategic agility. Vulnerability to Commodity Price Volatility ITC Ltd heavily relies on commodities as raw materials for its products; therefore, fluctuations in commodity prices can significantly impact the company’s profitability, supply chain, and overall financial performance. Commodity price volatility exposes ITC Ltd to cost pressures that can directly affect its profitability. Sudden price increases in essential commodities used in manufacturing processes, such as agricultural products, metals, or energy sources, can lead to higher production costs. These increased costs may not be easily passed on to consumers, especially in competitive markets, resulting in squeezed profit margins. Also, commodity price volatility can disrupt ITC Ltd’s supply chain, leading to potential shortages or delays in raw material availability. ITC Opportunities The following are opportunities for ITC’s growth and development: Growing FMCG Market ITC Ltd has the potential to capitalize on the expanding Fast-Moving Consumer Goods (FMCG) market. The growing FMCG market offers ITC Ltd an opportunity to diversify its revenue streams beyond its core businesses. While the company has a strong presence in sectors such as tobacco, hotels, paperboard, and agribusiness, the FMCG market provides a new avenue for expansion. The FMCG market thrives on innovation and new product development, providing ITC Ltd with an opportunity to showcase its research and development capabilities. The company can leverage its expertise in product development, packaging, and formulation to introduce innovative and value-added FMCG products. In conclusion, ITC Ltd’s diverse portfolio of businesses can create synergies and cross-promotional opportunities within the FMCG market. Expansion into Emerging Markets ITC Ltd has the potential to leverage its capabilities and resources to tap into the growing economies of emerging markets. Emerging markets offer ITC Ltd access to a large and relatively untapped consumer base. A growing middle class, rising disposable incomes, and increasing consumer spending power characterize these markets. By expanding its presence into emerging markets, ITC Ltd can target a new set of consumers who are eager to explore and adopt new products and brands. By strategically entering and expanding in emerging markets, ITC Ltd can position itself for long-term growth, enhanced profitability, and sustainable business performance. Focus on Health and Wellness ITC Ltd can leverage the growing consumer demand for health and wellness products and services. There is a global shift towards health consciousness, with consumers increasingly prioritizing their well-being and seeking healthier lifestyle choices. This presents a significant opportunity for ITC Ltd to align its product portfolio with the growing demand for health and wellness products. By leveraging its existing resources, research and development capabilities, and consumer insights, ITC Ltd can introduce a range of health-focused products that cater to the evolving needs of health-conscious consumers. By aligning its business strategy with the health and wellness trend, ITC Ltd can capture market share, enhance consumer loyalty, and drive long-term growth. Acquisitions and partnerships Through strategic acquisitions and partnerships, ITC can fuel its growth, expand its market presence, and enhance its competitive advantage. Acquisitions and partnerships offer ITC Ltd an opportunity to expand its market presence and diversify its business portfolio. By acquiring businesses in related or complementary sectors, ITC Ltd can enter new markets, gain access to new customer segments, and broaden its product offerings. These strategic moves allow the company to reduce its reliance on specific sectors, mitigate risks associated with market fluctuations, and create a more balanced revenue stream. Adoption of E-commerce The growing popularity of e-commerce platforms and other digital channels can help ITC to enhance its market reach, improve customer experience, and drive revenue growth. The adoption of e-commerce allows ITC Ltd to expand its customer reach beyond traditional brick-and-mortar stores. By establishing a strong online presence, the company can tap into a larger customer base, including those who prefer the convenience of shopping online. E-commerce enables ITC Ltd to reach customers in remote areas, international markets, and underserved regions, thereby increasing its market penetration and potential revenue streams. ITC Threat The following are some of the threats that ITC faces: Intense Competition ITC Ltd faces fierce competition from both domestic and international players across its business segments. Intense competition often leads to price wars as companies strive to capture market share. Price-based competition can result in reduced profit margins for ITC Ltd, as it may be forced to lower prices to remain competitive. This can impact the company’s profitability and financial performance, making it challenging to maintain sustainable growth and invest in innovation and expansion. Also, intense competition can lead to market saturation, impacting ITC’s brand loyalty. Changing Regulatory Landscape ITC Ltd is subject to a wide range of regulations and policies imposed by governments and regulatory bodies. The evolving regulatory landscape often brings about increased compliance costs and regulatory burdens for companies. New regulations, amendments to existing laws, or stringent enforcement can necessitate changes in processes, systems, and operations. Compliance with these regulations may require significant investments in technology, infrastructure, training, and monitoring systems. Such costs can impact ITC Ltd’s profitability and financial resources, diverting funds from growth initiatives and hindering the company’s ability to compete effectively. Rising Input Costs ITC Ltd is reliant on various inputs such as raw materials, energy, labor, and other resources to produce its goods and services. Higher input costs can put ITC Ltd at a competitive disadvantage compared to its rivals. If competitors can procure inputs at lower costs, they may be able to offer products at more competitive prices, potentially capturing market share from ITC Ltd. Also, rising input costs necessitate a focus on operational efficiency and cost management within ITC Ltd. Higher input costs can limit ITC Ltd’s ability to invest in innovation and research and development (R&D). Rapid Technological Advancements ITC Ltd has existed for over a century and is now operating in an era of unprecedented technological disruption. Rapid technological advancements can render existing products and services obsolete. Also, it often comes with a significant cost of implementation, such as investing in new technologies, upgrading infrastructure, and training employees. As new technologies emerge, customer preferences and demands change accordingly. ITC Ltd may face the challenge of maintaining the relevance and competitiveness of its offerings in the face of disruptive technologies. Failure to keep pace with technological advancements can result in a loss of market share to more innovative competitors offering superior and technologically advanced products and services. Also, these rapid technological advancements can outpace existing regulatory frameworks. Environmental Factors Despite being a diversified conglomerate operating in various sectors, ITC Ltd is subject to the growing scrutiny and impact of environmental issues. Environmental factors, including climate change and the increasing frequency and intensity of natural disasters, pose a threat to ITC Ltd. Climate change can lead to disruptions in the availability and quality of resources, affecting the company’s operations and supply chains. Natural disasters such as floods, hurricanes, or droughts can damage infrastructure, interrupt production processes, and impact distribution networks. Negative publicity related to environmental damage, pollution incidents, or unsustainable practices can erode customer trust, investor confidence, and brand value. In addition, environmental factors can disrupt global and domestic supply chains, impacting the availability and quality of inputs. For ITC Ltd, this can lead to challenges in sourcing sustainable and ethically produced raw materials, as well as disruptions in logistics and transportation. Conclusion In conclusion, ITC Ltd’s diverse portfolio, strong brand presence, and strong distribution network position it as a market leader in multiple sectors. However, weaknesses such as heavy dependence on the tobacco business and limited international presence warrant attention. To navigate the dynamic business landscape and position itself for sustainable growth and success in the future, ITC has to leverage its strengths, address its weaknesses, capitalize on opportunities, and mitigate threats.","filter_flag":1}
{"title":"Emirates to recycle plastic trays, bowls into new products - Gulf Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS9lbWlyYXRlcy10by1yZWN5Y2xlLXBsYXN0aWMtaXRlbXMtdXNlZC1vbmJvYXJkL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS9lbWlyYXRlcy10by1yZWN5Y2xlLXBsYXN0aWMtaXRlbXMtdXNlZC1vbmJvYXJkL9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS9lbWlyYXRlcy10by1yZWN5Y2xlLXBsYXN0aWMtaXRlbXMtdXNlZC1vbmJvYXJkL9IBAA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS9lbWlyYXRlcy10by1yZWN5Y2xlLXBsYXN0aWMtaXRlbXMtdXNlZC1vbmJvYXJkL9IBAA?oc=5\" target=\"_blank\">Emirates to recycle plastic trays, bowls into new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Emirates to recycle plastic trays, bowls into new products - Gulf Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vZ3VsZmJ1c2luZXNzLmNvbS9lbWlyYXRlcy10by1yZWN5Y2xlLXBsYXN0aWMtaXRlbXMtdXNlZC1vbmJvYXJkL9IBAA?oc=5\" target=\"_blank\">Emirates to recycle plastic trays, bowls into new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf Business<\/font>","source.href":"https:\/\/gulfbusiness.com","source.title":"Gulf Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Image: Emirates Emirates Airline has unveiled a new closed-loop recycling initiative. The initiative will see millions of onboard items, such as plastic trays, bowls, and snack and casserole dishes, now recycled in a local facility. They will then be remade into fresh, ready-to-use meal service products. Emirates will introduce the new recycled utensils onboard from June onwards, marking World Environment Day on June 5, and the theme of #BeatPlasticPollution. Millions of old and damaged meal service items from Economy and Premium Economy Class dining will be collected after flights, washed and checked for damage, transported to a facility in Dubai to be ground down, reprocessed, and manufactured into new dishes, bowls and trays. These items will be then sent to Emirates Flight Catering to be used again for thousands of meals in the sky. The new trays, casseroles, snack dishes and bowls, potentially containing around 2 per cent reused material (recyclate), will be brought back into service on the airline’s fleet. Emirates partners with deSter The airline has partnered with deSter UAE, a provider of service ware concepts to the aviation industry and an expert in closed loop manufacturing, for the project. The airline will be reusing plastic materials that have already reached their end of life and would otherwise need to be written off. The team at deSter are members of the CE100 network, which includes some of the world’s leading circular economy companies and have also been awarded the ‘Gold’ Sustainability rating from Ecovadis – a globally recognised certification for sustainable practices. Emirates elected to work with deSter once a facility in UAE was ready to facilitate the huge scale of Emirates’ requirement – substantially reducing the carbon footprint of sending the products to another country to be recycled. The deSter factory also incorporates sustainable design principles focusing on solar power, efficient use of water and minimisation of waste. Here’s how the airline has been reducing plastic waste It has diverted over 150 million single-use plastic items from landfill each year by replacing plastic straws, inflight retail bags, and stirrers with responsibly sourced paper and wooden alternatives. Each blanket in Economy and Premium Economy Class is manufactured from 28 recycled plastic bottles. Over the course of one year, this initiative saves 88 million plastic bottles from landfill. The airline’s current range of inflight toy bags, baby amenity kits and plush toys are made from recycled plastic bottles, and over eight million plastic bottles were repurposed during 12 months of amenity kit production. The hygiene covers for bowls on Emirates meal trays and plastic tumblers are made from 80 per cent recycled plastic. Economy and Premium Economy amenity kits are made from alternative materials such as kraft paper, rice paper and recycled plastic, reducing the consumption of virgin plastic. Emirates cabin crew separate glass and plastic bottles for recycling in Dubai, diverting about 500,000 kilograms of plastic and glass from landfill in 2022. Read: Emirates to phase out paper boarding passes for flights from Dubai","filter_flag":1}
{"title":"How Modi Naturals is Redefining Retail in India with Natural Oil Products and Sustainable Practices - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vaW50ZXJ2aWV3L3JldGFpbC1wZW9wbGUvbmV3LWNvbW1lcmNlL2hvdy1tb2RpLW5hdHVyYWxzLXJlZGVmaW5pbmctcmV0YWlsLWluZGlhLW5hdHVyYWwtb2lsLXByb2R1Y3Rz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vaW50ZXJ2aWV3L3JldGFpbC1wZW9wbGUvbmV3LWNvbW1lcmNlL2hvdy1tb2RpLW5hdHVyYWxzLXJlZGVmaW5pbmctcmV0YWlsLWluZGlhLW5hdHVyYWwtb2lsLXByb2R1Y3Rz0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vaW50ZXJ2aWV3L3JldGFpbC1wZW9wbGUvbmV3LWNvbW1lcmNlL2hvdy1tb2RpLW5hdHVyYWxzLXJlZGVmaW5pbmctcmV0YWlsLWluZGlhLW5hdHVyYWwtb2lsLXByb2R1Y3Rz0gEA","guidislink":false,"published":"Mon, 12 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=163, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vaW50ZXJ2aWV3L3JldGFpbC1wZW9wbGUvbmV3LWNvbW1lcmNlL2hvdy1tb2RpLW5hdHVyYWxzLXJlZGVmaW5pbmctcmV0YWlsLWluZGlhLW5hdHVyYWwtb2lsLXByb2R1Y3Rz0gEA?oc=5\" target=\"_blank\">How Modi Naturals is Redefining Retail in India with Natural Oil Products and Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Modi Naturals is Redefining Retail in India with Natural Oil Products and Sustainable Practices - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vaW50ZXJ2aWV3L3JldGFpbC1wZW9wbGUvbmV3LWNvbW1lcmNlL2hvdy1tb2RpLW5hdHVyYWxzLXJlZGVmaW5pbmctcmV0YWlsLWluZGlhLW5hdHVyYWwtb2lsLXByb2R1Y3Rz0gEA?oc=5\" target=\"_blank\">How Modi Naturals is Redefining Retail in India with Natural Oil Products and Sustainable Practices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Modi Naturals Limited, founded by D. D. Modi in 1974, has grown into a leading player of the edible oil industry in India. With a strong focus on natural oil processing, the company has evolved into Modi Naturals Limited and is listed at the Bombay Stock Exchange. The brand's mission is to deliver good health naturally, promoting a healthy way of living through their products. Modi Naturals emphasizes sustainability, innovation, and integrity in its operations, aiming to provide consumers with natural and healthy options. Oleev is among the top two brands in the olive pomace oil category and is the third-largest super premium edible oil brand in India. As a publicly listed company, Modi Naturals had a turnover of Rs 419 crore in the fiscal year 2022-2023. According to Akshay Modi, the Jt. Managing Director of Modi Naturals Ltd, the unique characteristics and flavor profile of Modi Naturals' olive pomace oil, known as Oleev Pomace Oil, sets it apart from other cooking oils. Made with high-quality refining techniques, Oleev Pomace Oil has a neutral flavor, making it suitable for various cooking methods, especially frying, deep frying, and roasting. Additionally, it has a high smoke point, making it ideal for deep frying. \"Enriched with MUFA and essential vitamins such as vitamins A, D, E and K, Oleev Pomace Oil strengthens the body with good fat and lowers the effects of bad cholesterol. MUFA promotes heart health and prevents high blood pressure and cholesterol,\" Modi elaborated. Diverse Range The brand's unique selling proposition lies in its varied range of olive oils, including olive pomace oil, extra virgin olive oil, extra light olive oil, and the multi-source oil range, which includes Oleev Active, Oleev Smart, and Oleev Health. The brand is the only one in India to offer a multi-source oil variant with the goodness of olive oil, while being the largest importer of olive oil, which makes Modi Naturals stand out from its competitors. \"Oleev is a premium brand with a wide range of olive oils in its portfolio, catering to different consumer preferences and needs,\" he added. Targeting Health-Conscious Consumers To effectively reach its target audience, Modi Naturals has utilized technology and digital marketing platforms effectively. Their primary target audience for Oleev consists of health-conscious individuals, particularly females aged 30-45 years in key metros and Tier l cities. The brand engages with its consumers through digital platforms such as e-commerce, social media, connected TV, and OTT media channels. By maintaining a strong digital presence, Oleev has effectively met the needs of its target audience. \"Oleev's wide presence across digital platforms seamlessly supports its digital-first initiatives,\" Modi asserted. Marketing Strategy In terms of retail and marketing strategies, Modi Naturals ensures the widespread availability of its products by having an extensive presence across general trade, modern trade, and e-commerce platforms. They are constantly expanding their distribution network and have recently partnered with CSD canteens, Dmart, and quick-commerce companies. “In terms of marketing, we employ a comprehensive strategy that targets consumers at every stage of the buying journey, leveraging digital ads, social media, retail branding, and other above-the-line tactics. Modi Naturals' retail strategy is backed by its wide presence across multiple channels, and we target our consumers across the complete funnel of awareness, consideration, retention, and engagement,\" Modi further added. Share of the Green Pie Modi Naturals is committed to sustainability and responsible business practices. They take a three-dimensional approach, considering the environmental, economic, and social dimensions of their products. The company has reduced CO2 emissions by using biofuels, contributing to cleaner air and a greener planet. They also support farmers through agricultural extension programs, ensuring superior quality produce and high profitability. Furthermore, they promote quality education by adopting a government school in an underdeveloped village, providing quality education to children from disadvantaged backgrounds. Future Diversification Looking ahead, Modi Naturals has strategic plans for both B2C and B2B expansions. They aim to introduce new products and brands in their FMCG portfolio, expand into sunrise sectors, and diversify their businesses. They have already ventured into the production of ethanol, constructing a state-of-the-art plant in Chhattisgarh to support sustainable growth and contribute to the Ethanol Blended Petrol program.","filter_flag":1}
{"title":"Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5\" target=\"_blank\">Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5\" target=\"_blank\">Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"We recycle more plastic than we consume Bisleri International Pvt Ltd, one of India’s leading packaged drinking water companies, has undertaken a project to upcycle PET bottles to create apparels, shoes, and other products, thus contributing to the circular economy. The project is part of the company’s initiative ‘Bottles for Change’ which aims to raise awareness about post-consumer plastic and encourage people to consider used plastic as a valuable resource for recycling, rather than waste. In an interview with Fibre2Fashion, Bisleri International CEO Angelo George shares his perspective on how the company’s PET upcycling process is making a positive impact on the planet. What are the key factors driving the demand for a sustainable lifestyle, and how has this shift impacted consumer behaviour in recent years? Consumer behaviour is undergoing a significant transformation as people are becoming increasingly conscious of the environmental and social issues. As a result, consumers are making deliberate choices on products and services with a reduced impact on the environment. Consequently, there is an expectation for businesses to actively contribute to positive change, and consumers also desire governments and other stakeholders to take responsibility. This shift is particularly evident in industries such as consumer goods, food and beverages, fashion, and mobility. The preference for local and organic food, reusable products, energy-efficient appliances, and renewable energy sources represents a transformative trend towards sustainable living. Furthermore, consumers are actively participating in discussions and initiatives related to recycling, water and biodiversity conservation, organic produce, and ethical sourcing. How does upcycling of PET bottles into apparel contribute to the growth of the circular economy? PET bottles are highly versatile and can be repurposed into a range of items. The upcycling process involves recycling and transforming used PET bottles into different products, exemplifying a circular approach that extends the lifespan of existing materials and reduces the need for new resources. Upcycling PET bottles into apparel plays a vital role in advancing India’s circular economy objectives. By reducing the demand for virgin materials like petroleum, which is used to produce new synthetic fibres, it helps conserve valuable resources. Simultaneously, this practice diminishes the amount of plastic waste that would otherwise accumulate in landfills and oceans as the bottles are transformed into high-value products. Moreover, upcycling offers ecological benefits by lowering the carbon footprint compared to traditional textile production, which typically consumes substantial energy, water, and raw materials. Scaling up upcycling practices can create significant employment opportunities and contribute to local economic development. What challenges and opportunities do companies face when incorporating upcycled PET bottles into their production processes for apparel? The conversion of PET bottles into apparel production processes presents both challenges and opportunities for companies. One primary challenge lies in ensuring a consistent supply of high-quality recycled PET material, which necessitates strict quality control measures. Additionally, specialised equipment and processes are required to convert the recycled material into fabric or other apparel components, potentially requiring investments in machinery and worker training. However, this integration can also yield opportunities for companies. It can cater to the growing consumer demand for sustainable and eco-friendly products, allowing businesses to differentiate themselves from their competitors and build brand equity. Besides, it can help decrease the environmental impact of textile production, resulting in cost savings, improved environmental performance, and a better reputation for the organisation by being conscious and purpose driven. What motivated Bisleri International to embark on sustainable practices and environmental stewardship? Sustainability is embedded in the core of Bisleri International’s business strategy. We were one of the first companies in India to recycle plastic since the 1990s, and we are passionate about plastic circularity. Our commitment to sustainability is based on our core principle, the Bisleri Greener Promise, which anchors our programmes for conserving natural resources and ensuring plastic circularity. We are one of the first FMCG companies in India to be plastic-neutral and water-positive. We recycle more plastic than we consume and replenish more water than we process for our business. Our business model focuses on the responsible extraction of groundwater. We have plants spread across the country to extract groundwater evenly, rather than mega-size plants at central locations, which depletes the water table. The proximity to the market reduces the carbon footprint as well. Our manufacturing processes convert >90 per cent of water processed into finished goods, reducing wastage. All our plants have robust water harvesting systems, and we restore water bodies to help recharge groundwater. Bisleri also repairs and maintains check dams to conserve precious rainwater to benefit farmers in rural areas. Our packaging materials have always been 100 per cent recyclable. Our approach has been to reduce, reuse and recycle plastic. Design innovations have helped us reduce over 10 per cent of virgin plastic consumption last year. Our focus on reusable containers to minimise virgin plastic consumption has made this segment almost 30 per cent of the business. Besides, we have been promoting the repurposing of used plastic in collaboration with recyclers. We have also invested in solar panels at our plants and are using electric delivery vehicles to improve energy efficiency and reduce carbon footprint in operations. Can you explain the process followed to collect and process used PET bottles for recycling? In 2018, we launched the programme ‘Bottles For Change’ to raise awareness that used plastic is a valuable resource that can be recycled. We educate people about the responsible disposal of used plastic and provide enabling systems to ensure that it is sent directly for recycling. We advocate a 3-stage process – clean the used plastic, segregate it at the source, and send it directly for recycling. We also provide collection infrastructure to ensure used plastic reaches recyclers directly and does not end up in landfills. The programme is active in 7 cities, and we have managed to reach over 600,000 people so far. The footprint covers some of the largest corporates, educational institutions and housing societies in India. We have also introduced a user-friendly mobile app that allows individuals and organisations to register for the programme. Through the app, users can easily locate nearby plastic agents to collect the clean and segregated plastic, which is then sold to recyclers. Once collected, PET waste is sorted, cleaned, and treated to remove other materials like caps, rings, or labels. The bottles are washed using a combination of hot and cold water and then processed through a PET treatment plant specially designed for recycling. Any irregular lumps or blocks of materials are crushed to produce flakes, which are then dried, mixed with pigments, extruded, and spun into filaments. These filaments are then cooled, collected, stretched, crimped, heat-treated, and cut into desired lengths depending on the final product. For example, for an apparel, the fibres are spun into yarn, wound onto bobbins, and woven into the fabric. It is then finished and dyed if necessary. Finally, the material is stitched to create various merchandise such as T-shirts and backpacks. How does your upcycling initiative contribute to the concept of the circular economy? Through our initiative, we have been able to collect valuable used plastic and upcycle them into highly valuable products. The upcycling practices have helped mitigate the requirement for natural resources and create new products, thereby reducing the impact on the environment. Through our ‘Bottles for Change’ programme, we promote sustainability and create employment opportunities for rag pickers, aggregators, and recyclers who repurpose used plastic to create higher-value items. We aim to create a citizen movement where everyone joins hands in achieving the sustainable goals of our nation. What products are created from the upcycling process of PET bottles? PET is widely recognised as the most recycled plastic worldwide, owing to its flexibility and lightweight properties that help ease upcycling into different new products. PET bottles can be transformed into a range of high-value items such as apparels, bags, shoes, plant pots, window blinds and utility items. Besides, it can also be upcycled into hard-bound industry products such as benches and paver blocks, among others. Can you share the impact Bottles For Change has created so far? Bottles For Change aims to create awareness among people to treat used plastic as a valuable resource by segregating and responsibly disposing it off, thereby preventing it from entering landfills. Our initiative strives to bring behavioural change by inculcating best practices among people to build a greener environment. Bottles for Change has made significant progress since its inception. We have successfully engaged with over 600,000 citizens through workshops and collection drives conducted at more than 3,500 housing societies, 680 educational institutions, 790 corporates, and 600 hotels and restaurants across 13 municipal corporations. All profits from the initiative are dedicated to improving the lives of the ragpickers. Which cities in India is Bisleri currently working on for the Bottles for Change programme? Are you also partnering with NGOs?","filter_flag":1}
{"title":"Unlocking Indonesia's Potential Through a Blue Economy - Your View - Tempo.co English","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZW4udGVtcG8uY28vcmVhZC8xNzM0NDA2L3VubG9ja2luZy1pbmRvbmVzaWFzLXBvdGVudGlhbC10aHJvdWdoLWEtYmx1ZS1lY29ub2150gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZW4udGVtcG8uY28vcmVhZC8xNzM0NDA2L3VubG9ja2luZy1pbmRvbmVzaWFzLXBvdGVudGlhbC10aHJvdWdoLWEtYmx1ZS1lY29ub2150gEA?oc=5","id":"CBMiVmh0dHBzOi8vZW4udGVtcG8uY28vcmVhZC8xNzM0NDA2L3VubG9ja2luZy1pbmRvbmVzaWFzLXBvdGVudGlhbC10aHJvdWdoLWEtYmx1ZS1lY29ub2150gEA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZW4udGVtcG8uY28vcmVhZC8xNzM0NDA2L3VubG9ja2luZy1pbmRvbmVzaWFzLXBvdGVudGlhbC10aHJvdWdoLWEtYmx1ZS1lY29ub2150gEA?oc=5\" target=\"_blank\">Unlocking Indonesia's Potential Through a Blue Economy - Your View<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tempo.co English<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Unlocking Indonesia's Potential Through a Blue Economy - Your View - Tempo.co English","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZW4udGVtcG8uY28vcmVhZC8xNzM0NDA2L3VubG9ja2luZy1pbmRvbmVzaWFzLXBvdGVudGlhbC10aHJvdWdoLWEtYmx1ZS1lY29ub2150gEA?oc=5\" target=\"_blank\">Unlocking Indonesia's Potential Through a Blue Economy - Your View<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tempo.co English<\/font>","source.href":"https:\/\/en.tempo.co","source.title":"Tempo.co English","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"By: Zuzy Anna, a professor at the Faculty of Fisheries and Marine Science, Universitas Padjadjaran. In the wake of COVID-19, Indonesia has the opportunity to shift away from a growth-oriented economic model towards an inclusive blue economy. COVID-19 sent shockwaves through economies worldwide, causing severe disruptions and exposing the fragility of growth-oriented models. The pandemic's impact has forced governments, policymakers, and economists to re-evaluate the traditional approach of focusing solely on economic expansion and imagine alternative economic models. For Indonesia, this opportunity to reimagine the post-COVID economy is centred around implementing a blue economy. A blue economy aims to reset inclusive and long-lasting economic growth by harnessing sustainable marine resources. Growth is achieved through economic interventions that support development while preserving and protecting marine resources. Indonesia has more than 17,500 islands, 108,000km of coastline, and three-quarters of its territory at sea. Oceans are central to Indonesia's prosperity through economic activities such as capture fisheries, aquaculture, coastal tourism, marine con­struction and transportation. Indonesia has the world's second largest fishery sector, worth around USD$27 billion and providing seven million jobs and over 50 percent of the country's animal-based protein needs. Oceans are a key asset for the country's tourism industry, which was worth around USD$21 billion to GDP in 2019. Indonesia's unique reliance on the ocean for its economic and cultural development has led its government to adopt the recommendations of the United Nations Environment Programme to promote a low-carbon economy. This agreement involves adopting policies and implementing initiatives supportive of a low-carbon economy, prioritising clean water access, mitigating climate change, protecting marine resources, and preserving terrestrial ecosystems. These goals reflect Indonesia's commitment to sustainable development and its recognition of the interconnectedness between economic growth, social wellbeing and environmental protection. Indonesia's commitment to incorporating blue economy principles into their policies is not new. During a June 2012 UN conference, the administration of then-Indonesian President Susilo Bambang Yudhoyono voiced their commitment to implementing a blue economy. His successor, President Joko Widodo, has established a blueprint known as Nawacita, which outlined the government's vision and priorities. The commitment to implementing a blue economy was a key aspect of Nawacita, highlighting the administration's determination to prioritise sustainable practices, including the responsible use of marine resources. In June 2021, Indonesia committed to the Initiative Natural Capital Carbon Communities Super Power at the Tri Hita Karana Climate Forum. This initiative emphasises the importance of natural capital, including marine resources, in mitigating climate change and promoting sustainable development. By recognising the significance of natural capital, Indonesia aims to position itself as a leading force in addressing climate change and fostering sustainable communities. The opportunity to pursue a blue economy in Indonesia is strong and potentially lucrative. The World Bank estimates the value of Indonesia's blue economy at USD$1.338 billion, which includes opportunities for revenue through coastal culture, capture fishery, treasure-laden shipwrecks, marine tourism, coral reefs, seagrass and mangroves. There are challenges implementing blue economy principles in Indonesia. Coastal areas are facing population growth, which will lead to more demand for land in limited space, leading to internal migration and environmental strain. Tidal flooding due to land subsidence poses a significant threat to coastal urban areas, damaging infrastructure and affecting communities, households and individuals. Indonesia produces the second largest volume of marine debris after China; it is vulnerable to oil spills and marine fisheries are unsustainably exploited. Ninety percent of Indonesian boats draw their catch from areas that are already overfished and overcapacity. Traditional communities in Indonesia, whose lives have long revolved around the sea, face challenges to their way of life due to rising populations, coral reef destruction and the abandonment of traditional fishing practices. With many significant challenges, Indonesia needs to carefully pick its battles, considering its limited resources. The Indonesian government still heavily relies on revenue from the mining and fossil energy sectors. The objectives of promoting a low-carbon economy cannot be achieved if the government continues to depend on these sectors. To meet its commitment to transition to a blue economy, Indonesia must diversify its economy, reduce reliance on extractive industries, transition to renewable energy sources and promote sustainable practices. This shift would align with the principles of a blue economy and contribute to mitigating climate change, ensuring a more sustainable future. To finance this shift towards a blue economy, Indonesia could consider investing a minimum of 10 percent of its marine economic output in managing ocean governance and health. Seeking funding from developed countries through debt conversion or debt-for-nature swaps could be explored. Environmental fiscal reforms can be implemented, including incentives and disincentives such as taxation, fees, pricing mechanisms and phasing out harmful subsidies. In addition, private investors and capital markets could be encouraged to scale up investments in blue economy practices and principles through mechanisms such as green banking. Encouraging insurance companies to design new products that proactively support sustainable marine sectors is also important. Promoting public-private partnerships for research and development of financial solutions for the ocean and investable marine pathways can be beneficial. Providing concessional, catalytic and patient capital for the transition to a blue economy is essential. By implementing these financing strategies, Indonesia can mobilise the necessary resources to support the implementation of a blue economy. Collaboration among various stakeholders, including government, private sector, and international institutions, is crucial to ensure effective financing mechanisms and the sustainable development of a blue economy. Originally published under Creative Commons by 360info™. *) DISCLAIMER Articles published in the “Your Views & Stories” section of en.tempo.co website are personal opinions written by third parties, and cannot be related or attributed to en.tempo.co’s official stance.","filter_flag":1}
{"title":"Transforming your spaces with sustainable solutions: Plascon's 130-year legacy - East Coast Radio","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVjci5jby56YS9saWZlc3R5bGUvaG91c2UtaG9tZS90cmFuc2Zvcm1pbmcteW91ci1zcGFjZXMtc3VzdGFpbmFibGUtc29sdXRpb25zL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVjci5jby56YS9saWZlc3R5bGUvaG91c2UtaG9tZS90cmFuc2Zvcm1pbmcteW91ci1zcGFjZXMtc3VzdGFpbmFibGUtc29sdXRpb25zL9IBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LmVjci5jby56YS9saWZlc3R5bGUvaG91c2UtaG9tZS90cmFuc2Zvcm1pbmcteW91ci1zcGFjZXMtc3VzdGFpbmFibGUtc29sdXRpb25zL9IBAA","guidislink":false,"published":"Mon, 26 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=177, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVjci5jby56YS9saWZlc3R5bGUvaG91c2UtaG9tZS90cmFuc2Zvcm1pbmcteW91ci1zcGFjZXMtc3VzdGFpbmFibGUtc29sdXRpb25zL9IBAA?oc=5\" target=\"_blank\">Transforming your spaces with sustainable solutions: Plascon's 130-year legacy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">East Coast Radio<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Transforming your spaces with sustainable solutions: Plascon's 130-year legacy - East Coast Radio","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LmVjci5jby56YS9saWZlc3R5bGUvaG91c2UtaG9tZS90cmFuc2Zvcm1pbmcteW91ci1zcGFjZXMtc3VzdGFpbmFibGUtc29sdXRpb25zL9IBAA?oc=5\" target=\"_blank\">Transforming your spaces with sustainable solutions: Plascon's 130-year legacy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">East Coast Radio<\/font>","source.href":"https:\/\/www.ecr.co.za","source.title":"East Coast Radio","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Forming part of Plascon’s rich 130-year history and evolution, the brand will be sharing these products with the public at the popular home and décor show that continue to embrace Plascon’s eco-friendly practices while delivering revolutionary world-class quality paint and products. Featuring as a headline sponsor this year at the show, Plascon will also be showcasing other transformative home products along with exciting colour trends and insights from their latest winter and summer colour palettes. Suvasin Moodley, Plascon’s Head of Marketing, says, “Plascon has remained a leader in the industry by consistently adapting to emerging trends and providing customers with eco-friendly product solutions. This core value that has lived throughout the brand since its inception is to design products that improve the lives of customers through constant innovation”. By tapping into their extensive experience and deep understanding of consumer preferences, Plascon has successfully evolved its product offerings to meet the ever-changing demands of the market while ticking the boxes of product performance and sustainability. “We are committed to providing products that benefit homeowners and are eco-conscious. Both Micatex and Woodcare products have a long heritage with Plascon but have been recently upgraded and modified. Our Plascon WoodCare range has been reinvigorated with a new look and improved formula that’s suitable for interior and exterior use. The decorative wood preservative enhances the natural appearance of timber while providing effective protection against the elements. With its water-resistant properties, this product ensures the longevity of wooden surfaces. We have also re-engineered the Plascon Micatex product with Polycell. This is a premium quality water-based coating renowned for its durability and UV resistance that also boasts a fine texture that not only adds an elegant touch to exterior wall surfaces, but also offers exceptional weatherproofing capabilities to safeguard your walls from the harshest conditions. At this year’s East Coast Radio House + Garden Show, we look forward to introducing our new products to the public and capturing their attention and imagination with our ‘2 Palettes, 2 Rooms’ colour stories activation,” adds Moodley. Cairey Baxter-Bruce, the East Coast Radio House + Garden’s Show Director, expressed excitement about the partnership with Plascon, highlighting their valuable insight into home décor and lifestyle trends. “This sponsorship demonstrates Plascon's commitment to being a leader in the home and décor space. Over the past four decades of running this show we know full well that colour is more than just paint on a wall. It is the way in which we identify with our environment and express our different personalities. By defining our living spaces through colour, we unlock purpose and functionality as we create comfortable and multi-purpose spaces within our homes. Through the combination of curated colour palettes, interior design elements and eco-friendly products you are able to create signature spaces within your own home, your way,” explains Baxter-Bruce. Plascon's journey toward sustainability encompasses a wide range of initiatives and also resonates with the show’s theme linked to this growing trend in homes. From utilising APEO-free formulations to zero volatile organic compounds (VOCs) product recipes, the brand strives to minimise its carbon footprint and promote eco-friendly practices throughout the entire product lifecycle. Examples of Plascon’s sustainable practices include water-based paint formulations, investments in upcycling initiatives, and the Double Velvet paint range with air purifying technology. If you are searching for ways to transform your home and gain valuable insight from industry experts, visit the East Cast Radio House + Garden Show from 1 - 9 July 2023 at the Durban Exhibition Centre. Attendees will have the opportunity to experience the “2 Palettes, 2 Rooms” activation, where talented Durban-based designers will conceptualise the rooms utilizing their expertise to create a visually appealing and contemporary atmosphere that will showcase the latest Summer and Winter colour stories. Visitors can also look forward to an interactive experience with Plascon's experts to inspire them on how to transform spaces stylishly and sustainably. For more information visit www.housegardenshow.co.za or follow the Show on Instagram and Facebook using @housegardenshow.","filter_flag":1}
{"title":"Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5\" target=\"_blank\">Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5\" target=\"_blank\">Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Practices\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
