{"title":"Consumer Companies Must Innovate to Drive Impact on Climate - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5\" target=\"_blank\">Consumer Companies Must Innovate to Drive Impact on Climate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Consumer Companies Must Innovate to Drive Impact on Climate - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29uc3VtZXItY29tcGFuaWVzLW5lZWQtaW5ub3ZhdGl2ZS1jbGltYXRlLWNoYW5nZS1zb2x1dGlvbnMtdG8tZHJpdmUtaW1wYWN00gEA?oc=5\" target=\"_blank\">Consumer Companies Must Innovate to Drive Impact on Climate<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Yet it’s one thing to say C&S is a priority—successful execution is another thing entirely. The CPG sector significantly lags other industries in what BCG calls “innovation readiness,” the underlying capabilities or “systems” that organizations deploy to generate new value propositions and profitably solve customer problems. According to our 2020 MIC findings, companies with mature innovation systems generate as much as 20% more innovation output than their peers. Concerned Consumers The lack of CPG preparedness is especially significant given consumers’ growing climate concerns—and the shift in their buying habits over the past few years. Approximately 80% of consumers say they think about sustainability in their day-to-day purchasing decisions. Also, according to the NYU Stern Center for Sustainable Business, between 2015 and 2021, sales of products marketed as sustainable grew 2.7 times faster than conventionally marketed products. However, today, only around 10% of CPG shoppers (8% to 18% across the categories we tested) say they purchase sustainable products or have sustainability in their top drivers of choice. This percentage could increase by up to 30% if CPG companies linked sustainability to other emotional and functional needs, such as quality or health. Other BCG research determined that 75% of consumers think that large companies must take the lead against climate change. Clearly, CPG companies must use this opportunity to raise the level of their sustainability efforts. Innovating on Three Levels Given the sheer size and complexity of the value chain, organizations that wish to achieve game-changing innovation in CPG must execute sustainability well at scale. This journey requires applying an innovation lens to three dimensions: products, customers, and advanced digital and AI tools. Improve Today’s Products and Invent Tomorrow’s As a first step toward greater sustainability, organizations should assess their product portfolio to identify the brands that can be made greener as well as those that require marketing to drive awareness and conversion. This is also the time to determine whether any brands should be divested because they don’t align with corporate sustainability ambitions. That move can help fund opportunities in existing brands as well as new categories with greater potential. Product-development teams can then make existing products greener by replacing unsustainable ingredients with sustainable ones. Yet while this approach can provide some quick wins, it won’t suffice over the long term. Based on our experience, re-engineering of current operations may achieve only about 30% to 40% of 2030 carbon goals; it is necessary to re-imagine the business model to close the gap, which will require both a transformational portfolio and consumer behavior change. Replacing unsustainable ingredients with sustainable ones won’t suffice over the long term. To create truly sustainable products in the future, companies need to develop new products based on new formulations. (See the sidebar on Nestlé and AB InBev.) Since the primary source of CPG emissions is Scope 3 (the value chain, especially upstream), organizations need to ensure that their suppliers meet sustainability standards. How Two Leading CPGs Are Using Innovation to Boost Sustainability across the Value Chain Leading CPG companies like Nestlé and AB InBev (ABI) have launched initiatives with the potential for large-scale impact as they put sustainability at the top of their ESG agenda, as well as their overall business agenda. Nestlé Nestlé, an acknowledged sustainability leader, is innovating in various ways to meet its dual ambitions of zero environmental impact in operations by 2030 and net-zero greenhouse-gas emissions by 2050. After determining the carbon footprint of its portfolio, the company has put more emphasis on expansion in the plant-based space, an important commercial and environmental opportunity. To make existing products carbon neutral, Nestlé has substituted ingredients and changed entire formulations. The company’s sustainable R&D accelerator and creative application of new R&D processes inspired the formulation used in brands such as Wunda, a pea-based milk alternative. Nestlé has also committed to making its product packaging 100% recyclable or reusable by 2025. In addition, it has shifted manufacturing to renewable energy and invested in more energy-efficient processes. And it has optimized routes and used low-emission fuels and rail transport. Together, these measures are projected to mitigate 14% of greenhouse-gas emissions associated with the projected 44 million tonnes of carbon-dioxide equivalents by 2030. To fill out its plant-based portfolio, Nestlé has also made some noteworthy acquisitions, including Garden Gourmet and Sweet Earth foods. In parallel, the company has sold its North American bottled-water business, a slow-growing business with a large environmental footprint, to fund investments in higher-growth categories. This slew of product innovations has been enabled by Nestlé’s leadership team. A top CEO priority, sustainably minded innovation receives sufficient resources and focus. Moreover, teams are encouraged to explore emerging categories and find applications for R&D developments across the Nestlé portfolio. For example, Nestlé is using lessons from Wunda to develop other innovations in the dairy-alternative space. By embedding sustainability every step of the way, Nestlé is driving both incremental and game-changing innovation—and raising the bar in the process. ABI To help address the growing global demand for food and the pressure this is putting on natural resources, ABI is leveraging its brewing expertise to find new ways of sourcing food sustainably. In addition to rolling out many incremental innovations, ABI has launched ventures that develop new-to-world technologies. One of its startups, EverGrain, is developing a technology that extracts the proteins and fibers from brewing grains to create nutrient-rich ingredients for use in protein shakes, breads, and milk alternatives. Another startup, BioBrew, is using ABI’s fermentation knowledge to scale production of alternative proteins. ABI’s ventures are expected to help reduce crop- and livestock-related carbon emissions from food production while providing access to new markets Nestlé, an acknowledged sustainability leader, is innovating in various ways to meet its dual ambitions of zero environmental impact in operations by 2030 and net-zero greenhouse-gas emissions by 2050. After determining the carbon footprint of its portfolio, the company has put more emphasis on expansion in the plant-based space, an important commercial and environmental opportunity.To make existing products carbon neutral, Nestlé has substituted ingredients and changed entire formulations. The company’s sustainable R&D accelerator and creative application of new R&D processes inspired the formulation used in brands such as Wunda, a pea-based milk alternative.Nestlé has also committed to making its product packaging 100% recyclable or reusable by 2025. In addition, it has shifted manufacturing to renewable energy and invested in more energy-efficient processes. And it has optimized routes and used low-emission fuels and rail transport.Together, these measures are projected to mitigate 14% of greenhouse-gas emissions associated with the projected 44 million tonnes of carbon-dioxide equivalents by 2030.To fill out its plant-based portfolio, Nestlé has also made some noteworthy acquisitions, including Garden Gourmet and Sweet Earth foods. In parallel, the company has sold its North American bottled-water business, a slow-growing business with a large environmental footprint, to fund investments in higher-growth categories.This slew of product innovations has been enabled by Nestlé’s leadership team. A top CEO priority, sustainably minded innovation receives sufficient resources and focus. Moreover, teams are encouraged to explore emerging categories and find applications for R&D developments across the Nestlé portfolio. For example, Nestlé is using lessons from Wunda to develop other innovations in the dairy-alternative space.By embedding sustainability every step of the way, Nestlé is driving both incremental and game-changing innovation—and raising the bar in the process.To help address the growing global demand for food and the pressure this is putting on natural resources, ABI is leveraging its brewing expertise to find new ways of sourcing food sustainably. In addition to rolling out many incremental innovations, ABI has launched ventures that develop new-to-world technologies.One of its startups, EverGrain, is developing a technology that extracts the proteins and fibers from brewing grains to create nutrient-rich ingredients for use in protein shakes, breads, and milk alternatives. Another startup, BioBrew, is using ABI’s fermentation knowledge to scale production of alternative proteins.ABI’s ventures are expected to help reduce crop- and livestock-related carbon emissions from food production while providing access to new markets . This is a huge undertaking, requiring bold experimentation with supply-chain and sourcing models. Companies will need to expand their roster of partners. They will also need to change relationships with existing partners to active collaborations where companies share product-development expertise and work with suppliers to develop sustainable practices. Since CPG companies are positioned to be the steward of the value chain, they need to engage with partners to drive broader impact. Guinness, for example, recently launched a regenerative-agriculture pilot in Ireland to reduce the carbon emissions from producing barley, a key raw material. Working with farmers and other suppliers, Guinness expects to see improvements in soil health and water quality, as well as enhanced biodiversity. Help Consumers Change Their Behaviors While these efforts will go a long way, innovation in CPG won’t be able to maximize the impact of decarbonization measures unless consumers take a more active role. Yet while consumers are increasingly concerned about the climate crisis, many have not yet incorporated sustainability into their everyday behaviors, and many are confused about their role (around 20% say that individuals have a role to play in climate change). Companies, therefore, need to activate consumer behaviors that will stick. One solution is to innovate and commercialize products in a way that resonates deeply with potential buyers, understanding their core needs and barriers to ensure that sustainable products address them. To maximize the impact of decarbonization measures, companies need to activate consumer behaviors that will stick. That is exactly what Reckitt Benckiser’s Finish did in 2020, when the maker of dishwashing products launched “Skip the Rinse,” a campaign that aimed to drive growth and also conserve water by encouraging consumers not to pre-rinse their dishes. Reckitt innovated its product, and the key benefit was that busy families could save time and effort while effectively cleaning their dishes, which appealed to a much broader audience than sustainability alone. As an added benefit, for every consumer who pledged to #skiptherinse, Finish agreed to donate $1 to The Nature Conservancy. In less than two years, more than 20 million gallons of water were conserved. In addition, Finish drove share growth and increased marketing ROI. Deploy Next-Generation Digital and AI Tools Advanced analytics driven by AI provide the transparency that’s necessary for identifying the C&S leads with the greatest likelihood of success. These next-generation tools include machine learning, natural-language processing, and geo-mapping, Unlike traditional methods, advanced analytics allow an organization to combine multiple data sources to identify potential targets across multiple sectors globally and further upstream. Moreover, they enable the automated scraping of websites and social media to identify business signals (triggers) in areas of the organization’s choosing, such as environmental, social, and governance (ESG). Third, they help to quickly narrow down searches to a short list of the most promising opportunities. No less important, these tools enable traceability, both for companies that wish to monitor the greenness of their suppliers and for consumers who want to know whether the product they’re thinking of purchasing has green roots. Advanced analytics can help identify C&S leads and enable traceability. Given both the immensity of the C&S opportunity and our relative nascency in addressing it, advanced analytics and AI tools (including machine learning, natural-language processing, and geo-mapping) can help drive impact at critical junctures across the innovation value chain. Companies deploying these tools will be better able to surface valuable insights, prioritize the innovation focus, explore the C&S implications of potential product features during the design stage, and identify emerging technologies and partners to add to their innovation ecosystems. In all likelihood, CPG companies will play a central role in the ultimate success or failure of the C&S effort. Therefore, it’s only fitting that they use this role to bring us closer to a decarbonized future. By applying an innovative lens to the sustainability agenda, companies can create value—for the environment, for consumers, and for themselves. But to create a real sustainability advantage, organizations must act now, before this source of differentiation evaporates.","filter_flag":1}
{"title":"Tennant Company Announces Net-Zero Greenhouse Gas Emissions Goals - CleanLink","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL1Rlbm5hbnQtQ29tcGFueS1Bbm5vdW5jZXMtTmV0LVplcm8tR3JlZW5ob3VzZS1HYXMtRW1pc3Npb25zLUdvYWxzLS0yOTY2MNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL1Rlbm5hbnQtQ29tcGFueS1Bbm5vdW5jZXMtTmV0LVplcm8tR3JlZW5ob3VzZS1HYXMtRW1pc3Npb25zLUdvYWxzLS0yOTY2MNIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL1Rlbm5hbnQtQ29tcGFueS1Bbm5vdW5jZXMtTmV0LVplcm8tR3JlZW5ob3VzZS1HYXMtRW1pc3Npb25zLUdvYWxzLS0yOTY2MNIBAA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL1Rlbm5hbnQtQ29tcGFueS1Bbm5vdW5jZXMtTmV0LVplcm8tR3JlZW5ob3VzZS1HYXMtRW1pc3Npb25zLUdvYWxzLS0yOTY2MNIBAA?oc=5\" target=\"_blank\">Tennant Company Announces Net-Zero Greenhouse Gas Emissions Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CleanLink<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tennant Company Announces Net-Zero Greenhouse Gas Emissions Goals - CleanLink","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL1Rlbm5hbnQtQ29tcGFueS1Bbm5vdW5jZXMtTmV0LVplcm8tR3JlZW5ob3VzZS1HYXMtRW1pc3Npb25zLUdvYWxzLS0yOTY2MNIBAA?oc=5\" target=\"_blank\">Tennant Company Announces Net-Zero Greenhouse Gas Emissions Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CleanLink<\/font>","source.href":"https:\/\/www.cleanlink.com","source.title":"CleanLink","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Tennant Company announced an ambitious plan to become net-zero by 2040. “As a market leader with a reputation for innovation, I’m confident that we can work towards ambitious commitments to affect change on a global scale,” says president and CEO Dave Huml. “By embedding sustainable thinking into how we work, we’ll continue to deliver solutions that help our customers solve their biggest challenges and meet their sustainability targets. Working within our own business and with our stakeholders, we will help people thrive and contribute to a healthier planet.” Announcing long-term science-based net-zero targets Leading the mechanized cleaning industry, Tennant announces goals to achieve net-zero greenhouse gas emissions across Scopes 1, 2, and 3 by 2040. The company has submitted a letter of commitment regarding its net zero goals to the Science Based Targets initiative (SBTi) for validation. To reach net-zero, Tennant plans to make deep emissions cuts across its operations and value chain. To accomplish this, the company expects to: • Partner with its customers to increase the energy efficiency of its portfolio and offer solutions that will eliminate GHG emissions during the product’s use phase by 2040; • Seek to source 100 percent of electricity from renewable sources across all global facilities by 2030; • Electrify 100 percent of its global fleet by 2040; • Continue investing in energy efficiency initiatives in its facilities and across its operations; and • Collaborate with external groups to drive innovation and technology development to lead the industry toward a cleaner future. Tennant’s commitment to net-zero will help the company’s customers reach their own emissions reduction goals and improve collective shared spaces. Sustainability embedded across the enterprise With the goal of reaching net-zero by 2040, Tennant announces a new sustainability framework aligned with the most significant issues to the company and its stakeholders. “Our new framework rests on the foundational interconnection between people and planet, providing the lens for our company to set goals, align plans, and integrate sustainability across our business. This charts the path for our next 150 years, grounded in the belief that our sustainable cleaning solutions will help reinvent how the world cleans, creating shared value for business and society,” says Carol McKnight, SVP and chief administrative officer. The new sustainability framework is organized into two pillars, Thriving People and Healthy Planet. Each pillar targets key impact areas where the company intends to drive progress. These impact areas include employee success, social impact, shared spaces, climate and energy, water and chemical use, and circular products and waste. A legacy of leadership in sustainability and stewardship Tennant has a legacy of strong leadership in sustainability and ESG. The company has a consistent record of community engagement, products that help the company’s customers reach their sustainability goals and greenhouse gas emissions reductions. It was one of the first 100 companies globally to have greenhouse gas emissions reductions targets approved by the SBTi. Stewardship has long been one of the company’s guiding principles, aligned with its mission to create a cleaner, safer, and healthier world. Past actions show Tennant’s record of sustainable action. Recent accomplishments featured in the company’s 2022 (FY 2021) Sustainability Report include: • Continued progress toward the company’s existing Scope 3 science-based target by reducing the greenhouse gas emissions from the use of our products by 32 percent (since 2016). • Sourcing 86 percent of global electricity consumption sourced from renewable energy sources (in 2021). • $880,000 invested in community-based charitable contributions through the Tennant Foundation (in 2021). • Enterprise-wide Human Rights Policy launched, further codifying the company’s foundational commitment to ethical and transparent business practices. • Formal commitment to diversity, equity & inclusion (DE&I) enacted with the internal launch of the New Perspectives program, which seeks to ensure that Tennant maintains a work environment where all are welcome, heard, and able to succeed.","filter_flag":1}
{"title":"Sustainability and ESG glossary: 52 terms to know - TechTarget","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3N1c3RhaW5hYmlsaXR5L2ZlYXR1cmUvU3VzdGFpbmFiaWxpdHktYW5kLUVTRy1nbG9zc2FyeS1UZXJtcy10by1rbm930gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3N1c3RhaW5hYmlsaXR5L2ZlYXR1cmUvU3VzdGFpbmFiaWxpdHktYW5kLUVTRy1nbG9zc2FyeS1UZXJtcy10by1rbm930gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3N1c3RhaW5hYmlsaXR5L2ZlYXR1cmUvU3VzdGFpbmFiaWxpdHktYW5kLUVTRy1nbG9zc2FyeS1UZXJtcy10by1rbm930gEA","guidislink":false,"published":"Mon, 10 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=100, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3N1c3RhaW5hYmlsaXR5L2ZlYXR1cmUvU3VzdGFpbmFiaWxpdHktYW5kLUVTRy1nbG9zc2FyeS1UZXJtcy10by1rbm930gEA?oc=5\" target=\"_blank\">Sustainability and ESG glossary: 52 terms to know<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TechTarget<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability and ESG glossary: 52 terms to know - TechTarget","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3N1c3RhaW5hYmlsaXR5L2ZlYXR1cmUvU3VzdGFpbmFiaWxpdHktYW5kLUVTRy1nbG9zc2FyeS1UZXJtcy10by1rbm930gEA?oc=5\" target=\"_blank\">Sustainability and ESG glossary: 52 terms to know<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TechTarget<\/font>","source.href":"https:\/\/www.techtarget.com","source.title":"TechTarget","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"A-C D-F G-I J-L M-O P-R S-U V-X Y-Z Ensuring the health of people, the planet and even businesses rests on more sustainable practices, which depend on understanding core concepts and terms. Many individuals, businesses, nonprofits and government entities are working hard to quickly create and execute specific sustainability strategies and environmental, social and governance (ESG) initiatives. Everyone has a role to play. Learning about sustainability and ESG concepts ensures that critical stakeholders have productive conversations that avoid term misuse and oversimplification. Climate disruption is having and will continue to have a negative impact on life across the globe. It's imperative that business leaders, private citizens and governments take immediate and decisive action. Here are some fundamental sustainability terms and ESG concepts that provide a foundation for taking action.","filter_flag":1}
{"title":"Sustainable aluminum: Decarbonizing at a cost that makes sense - McKinsey","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL21ldGFscy1hbmQtbWluaW5nL291ci1pbnNpZ2h0cy9hbHVtaW51bS1kZWNhcmJvbml6YXRpb24tYXQtYS1jb3N0LXRoYXQtbWFrZXMtc2Vuc2XSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL21ldGFscy1hbmQtbWluaW5nL291ci1pbnNpZ2h0cy9hbHVtaW51bS1kZWNhcmJvbml6YXRpb24tYXQtYS1jb3N0LXRoYXQtbWFrZXMtc2Vuc2XSAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL21ldGFscy1hbmQtbWluaW5nL291ci1pbnNpZ2h0cy9hbHVtaW51bS1kZWNhcmJvbml6YXRpb24tYXQtYS1jb3N0LXRoYXQtbWFrZXMtc2Vuc2XSAQA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL21ldGFscy1hbmQtbWluaW5nL291ci1pbnNpZ2h0cy9hbHVtaW51bS1kZWNhcmJvbml6YXRpb24tYXQtYS1jb3N0LXRoYXQtbWFrZXMtc2Vuc2XSAQA?oc=5\" target=\"_blank\">Sustainable aluminum: Decarbonizing at a cost that makes sense<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable aluminum: Decarbonizing at a cost that makes sense - McKinsey","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9pbmR1c3RyaWVzL21ldGFscy1hbmQtbWluaW5nL291ci1pbnNpZ2h0cy9hbHVtaW51bS1kZWNhcmJvbml6YXRpb24tYXQtYS1jb3N0LXRoYXQtbWFrZXMtc2Vuc2XSAQA?oc=5\" target=\"_blank\">Sustainable aluminum: Decarbonizing at a cost that makes sense<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","source.href":"https:\/\/www.mckinsey.com","source.title":"McKinsey","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Aluminum decarbonization at a cost that makes sense (35 pages) Aluminum has an important role to play in global efforts to reduce greenhouse-gas emissions. This element is a critical building block for everything from electric vehicles and energy-efficient buildings to a modernized electrical grid. And unlike other basic materials such as steel and plastic, aluminum can be infinitely recycled with no loss of quality. About 75 percent of all the aluminum ever produced is still in use today. About the authors The analysis underlying this summary article was a collaborative effort by Pedro Assunção, Jeffrey Lorch, Kayla Olson, Reinaldo Penso, Matthias Stürtz, and Alex Ulanov . The insights were developed as part of McKinsey's knowledge partnership with the Mission Possible Partnership for the report Aluminum decarbonization at a cost that makes sense. While the metal itself is sustainable, its production usually is not. Although abundant in the Earth’s soil and rocks, aluminum does not occur in its pure form and has to be extracted from compounds—a complicated process of refining and smelting that requires a large and constant load of electricity. To produce this energy, many countries rely on coal. Globally, about 55 percent of the electricity needed for aluminum smelters comes from coal-fired power plants (with 10 percent from natural-gas plants and 30 percent from hydropower). As a result, the aluminum industry is among the highest-emitting sectors in the world, accounting for about 2 percent of global greenhouse-gas (GHG) emissions. The challenge of radical decarbonization To achieve an emissions pathway consistent with 1.5°C of global warming (as envisioned by the Paris Agreement on climate change), the aluminum industry will need to slash emissions dramatically—from around 15.9 metric tons of carbon dioxide equivalent (CO 2 e) per metric ton of primary aluminum (nonrecycled) today to lower than 0.5 tCO 2 e\/t by 2050, according to the International Aluminium Institute. Progress is already under way. In China, which produces nearly 60 percent of the world’s primary aluminum, the country’s largest producer has shifted much of its capacity to the hydropower-rich Yunnan province. Many companies are also exploring green technologies, including carbon capture and storage; inert-anode technology, which avoids the formation of CO 2 ; and mechanical vapor recompression (MVR), which recycles waste heat to improve efficiency. The industry’s current pipeline of green projects, however, is likely not enough to achieve this ambitious 95 percent reduction target. An investment model for change To explore the potential for change, Mission Possible Partnership’s Aluminium for Climate team, with analytical support from McKinsey’s Basic Materials Insights and McKinsey Sustainability, has developed an open-access, open-source investment model for alumina and aluminum plant decarbonization. The user-friendly model creates a twin lens on costs and technology options for a variety of emissions scenarios. The model is structured to allow alumina refineries, aluminum producers, OEMs, upstream players, finance players, policy makers, and end-industry users to input their assumptions and compare investment scenarios with best available technologies. Refer to the report for examples from this model for five different decarbonization scenarios. To accelerate the pace of decarbonization, bold action is required on multiple fronts, as explored in a new report by the Mission Possible Partnership with analytical support from McKinsey. No easy answer exists. Producing greener aluminum isn’t a simple matter of swapping out coal generation with renewable energy. Throughout each stage of aluminum production, large amounts of constant-load energy are required. Although the end goal is to make clean or renewable energy central to the production process, the most cost-efficient and effective way to get there is likely to involve a range of technologies and solutions (see sidebar, “An investment model for change”). Options for producing greener aluminum Any effort to produce low-carbon aluminum has to directly address the supply of electricity required for the smelting process, in which aluminum is extracted from its oxide, alumina. Roughly 80 percent of primary aluminum GHG emissions are generated from smelting, of which 81 percent are associated with the electricity used for electrolysis. For aluminum smelters that have opted to supply this energy from their own power plants, as opposed to obtaining energy from the grid, solar or wind generation can be a useful addition. But due to their intermittency, these renewable sources won’t be able to fully power the process. To generate large, stable loads, some producers have turned to hydropower. But this option potentially has limited growth, is regionally specific, and may be impacted by potential droughts. Nuclear energy, in the form of small modular nuclear reactors (SMRs), offers promise but is still at an early stage. For many smelters with their own generation ability, the most realistic short- to medium-term option may be retrofitting coal-fired power plants or natural-gas combined cycle plants with carbon capture utilization and storage (CCUS). Aluminum smelting operations that get their electricity from the grid have two potential options. One is to enter into virtual power purchase agreements (VPPA) with utilities. These agreements, which allow aluminum producers to claim GHG reductions, could achieve several goals. They could potentially support new renewable-energy projects, help accelerate a utility’s migration to low-carbon electricity, and provide a hedge against future energy price movements. An alternate option is a strategic relocation to regions that already have significant amounts of green electricity. The process of refining the sedimentary rock bauxite oxide to produce alumina also generates GHG emissions, albeit far fewer than smelting (17 percent of aluminum’s total emissions). Decarbonizing this process will mean shifting the fuel source for thermal boilers away from coal and heavy fuel such as diesel and oil. Producers in countries with access to reliable natural gas could switch to natural-gas-fired boilers and calciners, although this option will likely only reduce refining emissions by about one-third. More widely applicable alternatives that could reduce nearly all thermal refining emissions are electric boilers powered by either wind or solar, hydrogen boilers supplied with green hydrogen, or boilers that employ MVR technology, an energy recovery process that can be used to recycle waste heat. How stakeholders can help One of the challenges to aluminum decarbonization is that the best currently available fossil-fuel-based technology has a net present value greater than the green alternative. Overcoming these economic obstacles and mitigating potential risks will likely require collaborative action among stakeholders. Banks, investors, policy makers, and end customers can each play an important role. The finance sector. Decarbonization won’t be cheap. Globally and across industries, the net-zero transition is projected to demand average annual spending of $9.2 trillion by 2050. Aluminum producers will need to retire fossil-fuel-based production and make new investments in low-carbon alternatives, even though these are likely to have a lower return on capital and entail a certain amount of technology and implementation risk. Financial institutions have the capability to mitigate some of these risks and shift cash flows toward green investments. Given the generally high levels of debt in the aluminum industry, improved interest rates for low-carbon investments and new products such as green loans or bonds used exclusively for climate-friendly projects could be key enablers. Additionally, banks could incorporate climate considerations into their lending decisions, such as those developed by the Center for Climate-Aligned Finance (CAF). Financial partnerships designed to support sustainable investment are already happening, such as the Net-Zero Banking Alliance (NZBA), which brings together banks representing 40 percent of global banking assets. Governments and policy makers. Government grants to aluminum producers could potentially help offset some of the costs of green investment, while carbon contracts for difference (CCfDs) could bring the operational costs of decarbonized operations in line with those of fossil-fuel-based technology. However, the analysis shows that the greatest impact to the economics of decarbonization could come from carbon pricing, whether through trading schemes or carbon taxes. This could spur investment in green aluminum and enable the economics of the industry’s net-zero transition. Customers. Aluminum users likely have an important role to play in creating demand and helping shift the industry toward decarbonization. This could include what the report estimates to be a 5 to 10 percent premium for green aluminum or by making firm advance commitments to purchase it. Such offtake agreements could be negotiated before a factory is constructed or begins operating or before major retrofits are undertaken, significantly cutting potential investment risk. For manufacturers that have set decarbonization goals for their sourcing and supply chains, such premiums may be worth paying. Rising demand for low-carbon products is pushing the aluminum industry away from the carbon-emitting processes that have dominated production for the past 135 years. At the same time, the dynamics of a warming planet are evidence that change needs to happen as fast as possible. To make the green transition a reality, players throughout the aluminum value chain could seize the moment, work together to support a purposeful transition, and recreate the industry for the demands of the coming decades.","filter_flag":1}
{"title":"Md. taking tentative steps toward clean construction rules: 'How we buy things matters' - Maryland Matters","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vbWFyeWxhbmRtYXR0ZXJzLm9yZy8yMDIzLzA0LzAzL21kLXRha2luZy10ZW50YXRpdmUtc3RlcHMtdG93YXJkLWNsZWFuLWNvbnN0cnVjdGlvbi1ydWxlcy1ob3ctd2UtYnV5LXRoaW5ncy1tYXR0ZXJzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vbWFyeWxhbmRtYXR0ZXJzLm9yZy8yMDIzLzA0LzAzL21kLXRha2luZy10ZW50YXRpdmUtc3RlcHMtdG93YXJkLWNsZWFuLWNvbnN0cnVjdGlvbi1ydWxlcy1ob3ctd2UtYnV5LXRoaW5ncy1tYXR0ZXJzL9IBAA?oc=5","id":"CBMie2h0dHBzOi8vbWFyeWxhbmRtYXR0ZXJzLm9yZy8yMDIzLzA0LzAzL21kLXRha2luZy10ZW50YXRpdmUtc3RlcHMtdG93YXJkLWNsZWFuLWNvbnN0cnVjdGlvbi1ydWxlcy1ob3ctd2UtYnV5LXRoaW5ncy1tYXR0ZXJzL9IBAA","guidislink":false,"published":"Mon, 03 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=93, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vbWFyeWxhbmRtYXR0ZXJzLm9yZy8yMDIzLzA0LzAzL21kLXRha2luZy10ZW50YXRpdmUtc3RlcHMtdG93YXJkLWNsZWFuLWNvbnN0cnVjdGlvbi1ydWxlcy1ob3ctd2UtYnV5LXRoaW5ncy1tYXR0ZXJzL9IBAA?oc=5\" target=\"_blank\">Md. taking tentative steps toward clean construction rules: 'How we buy things matters'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Maryland Matters<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Md. taking tentative steps toward clean construction rules: 'How we buy things matters' - Maryland Matters","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vbWFyeWxhbmRtYXR0ZXJzLm9yZy8yMDIzLzA0LzAzL21kLXRha2luZy10ZW50YXRpdmUtc3RlcHMtdG93YXJkLWNsZWFuLWNvbnN0cnVjdGlvbi1ydWxlcy1ob3ctd2UtYnV5LXRoaW5ncy1tYXR0ZXJzL9IBAA?oc=5\" target=\"_blank\">Md. taking tentative steps toward clean construction rules: 'How we buy things matters'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Maryland Matters<\/font>","source.href":"https:\/\/marylandmatters.org","source.title":"Maryland Matters","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Diesel-belching trucks are rumbling down Maryland 550 in Woodsboro at high rates of speed. It’s a pretty remote stretch of highway in Frederick County, surrounded mainly by cornfields. Many of the trucks are stopping at Laurel Sand and Gravel, a massive quarry and mining operation off the main road, where 600,000 tons of small stones are ground into powder every year. The powder, known as aggregate, is sold to the concrete industry as a thickening agent. The property is pockmarked by mounds of rocks and gravel, giant construction equipment, and industrial-sized chutes, tunnels, bridges and conveyor belts. It’s also got a natural deep pool, which is used as a training ground for U.S. and Israeli military divers, local first responders and police deepwater investigators. The Frederick County government had to grant the property a special zoning designation to allow for commercial scuba diving operations. Amidst this clamorous contemporary moonscape, a local businessman, Brad Hill, is thinking about a carbon-free future — but taking his inspiration from Ancient Rome. Hill, who leases most of the land to Laurel Sand and Gravel, also runs a business there called Comus Sustainable Pozzolan Products. Hill has invented a way to dramatically reduce the pollutants that go into the concrete manufacturing process. His patent relies on mixing cement without burning coal and other toxins at high temperatures. And he’s using a natural thickener, Pozzolan, that’s as old as civilized society itself. “You have clean cement because you don’t have to use fossil fuels in our product,” Hill — a trained astrophysicist — explains. Not only is it climate-friendly, he asserts, but it’s cheaper and considerably more durable than most of the concrete on the market. Hill’s once-lonely quest to produce cleaner cement and concrete is now finding receptive ears in government and in certain sectors of the building industry itself. The fledgling “Buy Clean” movement for the construction and building industries, which focuses on using less carbon-intensive materials, is becoming embedded in federal policy, with a goal of zero carbon emissions in the construction sector by the year 2050. “This helps fill an enormous hole in the push to reduce industrial emissions,” said Jason Walsh, executive director of the BlueGreen Alliance, a national coalition of labor unions and environmental organizations. Speaking last week at a Washington, D.C., conference on the Buy Clean idea, sponsored by the BlueGreen Alliance and Third Way, a centrist Democratic think tank, Walsh described Buy Clean not just as an effort to combat climate change, but as a way to reinvigorate the country’s struggling manufacturing sector and create good-paying union jobs. Four states, led by California, have enacted Buy Clean laws of their own. And just a few weeks ago, a dozen states, including Maryland, signed on to the Federal-State Buy Clean Partnership, a proposed procurement policy. The state governments have committed to seeking lower-carbon infrastructure materials, including concrete and steel, in state-funded projects. And they’ve agreed to collaborate with the federal government and one another in an effort to transform the marketplace. The federal-state partnership, Walsh said, “will give certainty to businesses that there is a large, stable market to buy these cleaner products. How we buy things matters.” Maryland may also be taking tentative steps toward establishing a Buy Clean policy of its own for construction. A bill that passed in the House of Delegates last month would instruct the Maryland Department of General Services to assess the global warming impact of each category of cement or concrete mixture used in the construction of a public project. Beginning July 1, 2025, state agencies would be required to specify in each solicitation for a government-funded construction project the cement or concrete mixture that would be used in the building materials, and prioritize proposals with the lowest carbon footprint. Bidders would be required to submit environmental product declarations — a fairly new concept in the building sector that has been described as nutrition labels for greenhouse gas emissions. The bill, which stalled during last year’s General Assembly session, has a week to make it through the Senate and to Gov. Wes Moore’s (D) desk. One large multinational cement company has embraced the legislation, and so have environmental groups, which argue that any attempt to regulate the emissions of the construction industry creates a benefit for the climate. “How can you know the environmental impact of a building or structure if you don’t know what the products are going into it are going to be doing?” said Zachary Lovett, a Baltimore-based project pursuit manager for Holcim US, part of a Swiss building construction materials conglomerate. But some construction industry associations in Maryland are opposing the measure, saying it would place too much of a financial burden on smaller companies that do not have the ability to keep a large inventory of concrete mixes or stick an environmental label on every one of their products. And they suggested that any state Buy Clean program should run through the Maryland Department of Transportation rather than the Department of General Services, because so many construction projects, like roads and the massive operations at the Port of Baltimore, are controlled by MDOT. In written testimony, Marshall Klinefelter, president of the Maryland Asphalt Association, said his group’s members appreciate the intent of the legislation, but “strongly feel that the market should dictate the types of materials needed for construction projects. If these vague determinations are set, we have serious concerns that it will make it nearly impossible to adhere to. Setting preferences also pits producers against each other, giving an unfair advantage to those that meet the requirements.” The bill would, however, provide state grants for ready-mix concrete companies to buy the technology they need to make cleaner concrete. “I don’t see any way how, if this bill goes through, it puts any companies at a disadvantage,” Lovett said. “In fact, I think it gives the smarter companies an advantage.” The measure passed 103-31 in the House on March 20. Every Democrat present voted for it, along with five Republicans. The bill and its Senate companion are now sitting in the Senate Budget and Taxation Committee, which has held hearings on both versions. ‘The most widely used material on the planet besides water’ The building industry is one of the worst polluters on the planet, because concrete is so ubiquitous. It’s not just used on roads and buildings but on bridges and dams, ports and airports, trails and sidewalks, playgrounds, swimming pools, skate parks, patios, fountains, statuary, indoor construction, and so much more. “Concrete is the most widely used material on the planet besides water,” is how Del. Ken Kerr (D-Frederick), the House sponsor of the Buy Clean bill in Annapolis, puts it. The concrete industry accounts for about 8% of global greenhouse gas emissions, and most of that is attributable to the way cement is made, in a kiln, often fueled by coal, that heats to over 2,500 degrees Fahrenheit. That creates a chemical reaction with a high level of carbon emissions. When cement is mixed with water, sand and other aggregates like those mined and crushed at Laurel Sand and Gravel in Frederick County, it becomes concrete. “If the concrete industry were a country, it would be in the top five of carbon-producing nations in the world,” said state Sen. Sarah Elfreth (D-Anne Arundel), the Senate sponsor of the state’s green construction legislation. The U.S. government is using its purchasing power to try to combat climate change. The federal government is the largest direct purchaser in the world and one of the leading funders of infrastructure projects. It owns 8,000 buildings across the country and is the largest purchaser of electric power. It’s also the largest fleet operator in the U.S. The Biden administration is targeting decades-old methods of manufacturing and urging the building industry to find alternative, less carbon-intensive ways of producing cement and concrete, steel and other construction materials. The Inflation Reduction Act, for example, includes $6 billion for the Department of Energy to dole out grants to concrete and cement manufacturers to find alternative means of production. The administration announced last year that it was creating a Federal Buy Clean Initiative, prioritizing the purchase of low carbon materials for government construction projects, with a goal of covering 98% of materials purchased by the federal government. The U.S. Department of Transportation, the Environmental Protection Agency and General Service Administration and other agencies are developing regulations to favor contractors that use low-carbon products on building projects. Robin Carnahan, the administrator of the General Services Administration, told the Buy Clean conference in D.C. last week that her agency is targeting asphalt, concrete, glass and steel as it develops regulations for cleaner construction. “Turns out that the four are pretty heavy emitters of carbon in the supply chain,” she said. “These supply chain emissions are things we know we’re going to be able to make a significant impact on.” And there’s an international component to the government’s effort: Through John Kerry, the erstwhile U.S. senator and secretary of State who is serving as President Biden’s envoy on climate change, the U.S. has organized major corporations from across the globe into the First Movers Coalition. These companies have agreed to purchase at least 10% near-zero carbon cement and concrete for their operations by 2030. Four states have passed Buy Clean laws of their own. And New Jersey is working on a regulation that not only sets benchmarks for concrete manufacturers to meet but provides financial incentives for companies that go beyond the proposed climate-friendly standards. Buy Clean is also now on the radar of the U.S. Climate Alliance, the coalition of two dozen states and territories, including Maryland, that formed after former President Trump pulled the U.S. out of international climate pacts. While there are no formal agreements yet between the states, one goal, said Kareem Hammoud, a senior policy analyst at the U.S. Climate Alliance, is ensuring that whatever Buy Clean standards they enact are reasonably well-aligned with one another, so construction industry suppliers do not have to scramble from state to state. “We’re not just target-setting organizations,” Hammoud said. “Governors commit to real action.” “But for many states,” he conceded, “this is a very new area.” ‘This isn’t new stuff’ Brad Hill calls himself “a cement guy.” He has owned construction companies and helped build power plants, cement plants and other energy infrastructure. He was working as a civil contractor at the Lehigh Cement plant in Union Bridge — 10 miles from Woodsboro — when he bought the company’s quarry in Woodsboro 15 years ago. He wasn’t sure what he’d do with it. “I had to figure out what I’d bought,” he recalled. Eventually Hill came to realize that the rock deposits on the property, formed from the wearing down of the Appalachian Mountains, contained many of the same properties that are found in the volcanic ash at Mount Vesuvius in Italy — which literally helped build the Roman Empire. Hill thought about the durability of so many of the buildings and infrastructure from Ancient Rome, including famous structures like the Pantheon and the Colosseum, and compared that to the dramatically shorter life-cycle of modern concrete. “This isn’t new stuff,” he said. “This is 2,000-year-old stuff that we’ve got here.” Hill concluded that he wanted to start promoting the use of Pozzolan in U.S. construction. He also thought about how the concrete industry essentially tries to reproduce the natural chemical explosions of a volcanic eruption, but in an unnatural, carbon-intensive way. “We burn so much fossil fuel to get it to mimic Vesuvius,” he said. So he began tinkering and eventually invented a system that he says reproduces the chemical reaction at cold temperatures, powered by giant rollers controlled by air currents, rather than using extreme heat. Thus, the so-called Hill Process was born, and Hill launched Comus Sustainable Pozzolan Products as a spinoff of one of his construction companies. Hill believes that by using a less carbon-intensive method of producing concrete, he can help reduce greenhouse gas emissions in several ways: Through the cold-temperature chain reaction, which in turn will produce concrete that weighs half as much as standard concrete and has a greater life cycle, which in turn will require fewer road repairs, which contribute to climate change, and fewer truck trips to quarries like the one he owns and that’s used by Laurel Sand and Gravel. Down the road at Hill’s old employer, executives at Lehigh Hanson, Inc., which operates the Lehigh Cement plant in Union Bridge, announced last summer that the plant would fully transition from producing ordinary Portland cement to making an eco-friendly product, beginning this year. The company said it was using new technology to reduce the energy required to produce the product and associated emissions — making for a carbon footprint that is up to 10% less than ordinary Portland cement. But some people in the industry say it’s easy for big companies to make dramatic changes and substantial investments in new products and equipment. Lehigh Cement is owned by Heidelberg Materials, a German-based international company. “If you’re forcing smaller firms to manage and hold different types of concrete, essentially what you’re doing is pushing out some of the smaller guys,” said Michael Sakata, president and CEO of the Maryland Transportation Builders and Materials Association. Sakata said that many manufacturers are making innovations to reduce greenhouse gas emissions when they can, “but if we are going to invest and make things cleaner, we definitely need a push” from the federal government. Hill feels the same way. While U.S. and European regulators are evaluating his method for creating greener concrete, he and a team of scientists continue to refine the system. “Breaking big rocks into little rocks is big science,” he says. Last summer, U.S. Rep. David Trone (D-6th) visited his quarry, and Hill credits Trone and other members of Maryland’s congressional delegation for embracing his work and securing funding for operations like his. But for now, the money is caught in the federal bureaucracy. So Hill tinkers, waits, and hopes — and envisions one day doing more to fight climate change. “I’ve been working my entire life for this,” he says.","filter_flag":1}
{"title":"How closed loop systems are key to a sustainable future - Chain Store Age","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY2hhaW5zdG9yZWFnZS5jb20vaG93LWNsb3NlZC1sb29wLXN5c3RlbXMtYXJlLWtleS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY2hhaW5zdG9yZWFnZS5jb20vaG93LWNsb3NlZC1sb29wLXN5c3RlbXMtYXJlLWtleS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5","id":"CBMiTGh0dHBzOi8vY2hhaW5zdG9yZWFnZS5jb20vaG93LWNsb3NlZC1sb29wLXN5c3RlbXMtYXJlLWtleS1zdXN0YWluYWJsZS1mdXR1cmXSAQA","guidislink":false,"published":"Wed, 12 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=102, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY2hhaW5zdG9yZWFnZS5jb20vaG93LWNsb3NlZC1sb29wLXN5c3RlbXMtYXJlLWtleS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5\" target=\"_blank\">How closed loop systems are key to a sustainable future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Chain Store Age<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How closed loop systems are key to a sustainable future - Chain Store Age","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY2hhaW5zdG9yZWFnZS5jb20vaG93LWNsb3NlZC1sb29wLXN5c3RlbXMtYXJlLWtleS1zdXN0YWluYWJsZS1mdXR1cmXSAQA?oc=5\" target=\"_blank\">How closed loop systems are key to a sustainable future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Chain Store Age<\/font>","source.href":"https:\/\/chainstoreage.com","source.title":"Chain Store Age","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"You may have noticed that the term \"sustainability\" has become a big buzzword these days. And it's an industry trend that, fortunately, doesn't seem to be losing steam. From fashion houses to beverage brands, businesses are seeking out innovative ways to produce reusable products without depleting natural resources by using renewable sources of energy and reducing their carbon footprint—all while maintaining ethical business practices that extend beyond the physical environment, i.e., promoting equality and inclusion in the workplace. Of course, the growing trend—and the corporate response to it—has been heavily influenced by climate change as well as the awareness and socio-economic changes prompted by the COVID-19 pandemic. But what's keeping it going? According to recent research, the sustainability movement is mainly driven by consumer demand. In the 2021 Global Sustainability Study, 85% of people said they've shifted their purchasing habits toward more sustainable products in the past five years—and more than one-third of the population is willing to pay more to get them. But sustainability isn't just an investment in our companies; it's an investment in our planet. So as more companies commit to more environmentally-friendly and ethical practices to give consumers what they want, the question becomes, how do we make sustainability, well, sustainable? The answer lies in closed loop systems. Here is how restructuring global commerce to a circular model can create a more sustainable future for our planet. What is a closed loop system? A closed loop system, a.k.a. a circular system or economy, is a way to reduce or eliminate waste, as products and materials can be used to create new products. We use a circular system at SodaStream. Once consumers finish a CO2 cylinder, they can exchange for a fresh one online or in-store at participating retailers nationwide. That CO2 cylinder is then shipped back to a plant to be cleaned, filled, and sealed for reuse. The focus of our closed loop system is reusability and regeneration through every step of the supply chain. Conversely, with an open loop system, materials and products have a very limited lifespan and ultimately end up as waste. We can see how circular systems work in other industries, including fashion. According to Earth.org, a staggering 85% of textiles end up in a landfill on a yearly basis in America. To reduce that statistic, fashion subscription brand, For Days, collects used garments that are then chopped up and spun into yarn to make new fabric. The sustainable label Reformation has a program that allows buyers to return worn merchandise for a credit toward new stuff. The old clothing is turned into fibers for new products. Many well-known food and beverage, personal care, and household products are also available via the e-commerce and in-person retailer LOOP, created by TerraCycle, a global company specializing in tackling hard-to-recycle waste. Through this waste-free shopping platform, consumers can purchase their favorite products in reusable packaging. Once finished, customers can have them picked up by LOOP (or return them to an in-person site) to be refilled and reused. SodaStream’s closed loop on a broader scale A move to a circular economy for our brand strongly aligns with the UN Sustainable Development Goals, specifically goal number 12: Ensure Sustainable Consumption and Production Patterns. According to the UN, unsustainable practices are the root causes of pollution, loss of biodiversity, and climate change. And our reliance on natural resources is rising over 65% globally. How does a circular economy impact climate change? Products are manufactured, consumed, collected, and remanufactured into new products—an infinite loop designed to eliminate waste. Corporations can use fewer resources overall, reduce greenhouse gas emissions (70% of emissions stem from material use), and decrease global waste, including the reliance on landfills. The sustainable future Sustainability is not a trend to court new customers; it’s the path to a healthier planet if it’s done correctly. Open loop systems that don’t account for the product once it’s been bought by the consumer are not the answer, even if the materials can be recycled. Looking ahead, the goal of closed loop solutions is zero waste. According to the investment fund Closed Loop Partners, in 2021 alone, closed loop solutions kept 3.6 million tons of materials in circulation and avoided 6.8 million tons of greenhouse emissions. And for our part, one SodaStream reusable bottle saves thousands of single-use plastic bottles, and by 2025, we will save up to 76 billion single-use plastic bottles from our planet. The message behind these numbers is clear: to keep sustainability going—and address the mounting concerns about climate change—closed loop systems, where the materials are always in use and not in the trash, are essential to have around. Mark Fenton is chief business officer of SodaStream U.S.","filter_flag":1}
{"title":"Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5","id":"CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5\" target=\"_blank\">Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5\" target=\"_blank\">Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"\"Circularity is about reimagining not just the product lifecycle, but the relationship between brand, planet and consumer. That's why we've created Coachtopia as both a discovery lab to pioneer circularity in fashion and a collaborative platform for change,\" says Joon Silverstein, SVP, Global Marketing, Creative and Sustainability at Coach and Head of Coachtopia. \"We know that to transform our impacts, we need to fundamentally shift mindsets—from seeing opportunity in waste to designing backwards to taking a more open-source approach to creativity. We've built Coachtopia as an entirely new world within Coach—an agile start-up with a mission to reimagine the end-to-end system. We're building it not just for our consumers, but with them, inviting a growing community of hundreds of Gen Z individuals to join us on our Slack channel, collaborate with us on products, take center stage in our content and campaigns—and reimagine our future together.\" Designed for and with a new generation of consumers who are increasingly passionate about addressing the climate crisis and determined to drive change, Coachtopia is resetting the paradigm between brand and consumer, co-creating a new brand in collaboration with a growing community of Gen Z individuals—from climate activists, designers and upcyclers to journalists, film makers, entrepreneurs and fashion enthusiasts. The Coachtopian community has been actively involved in Coachtopia since its earliest founding days, with members continually sharing their perspectives on circular fashion, shaping concepts, and setting expectations of the change they want to see. As part of its mission, Coachtopia is investing in this next generation of talent through collaborative programs, harnessing and showcasing new talent to find solutions to the problems facing fashion. \"We were inspired by our shared desire to do better for the planet by inventing new circular ways of dreaming, designing and creating,\" said Coach Creative Director Stuart Vevers. \"It's a bigger, bolder step forward in realizing our vision for sustainability at Coach, where we prioritize experimenting and learning, and ethical design intentions over cookie cutter perfection. Coachtopia takes this to a new level by challenging us to 'design in reverse,' with the end goal of circularity top of mind, in collaboration with the next generation and their optimistic vision for tomorrow.\" Coachtopia is a world in progress—advancing iteratively towards a continually evolving vision of circularity. It builds upon the investments that Coach is making to improve the end-to-end sustainability of its business, as well as the learnings and capabilities developed through the brand's Coach (Re)Loved program. By giving a second life to more than 20,000 Coach products since its April 2021 launch, Coach (Re)Loved has provided critical insights into the aspects of traditional luxury craftsmanship that make circularity challenging, and thus the need to design for circularity from the start in order to achieve it at scale. Coachtopia takes up this challenge, innovating through rapid prototyping and forming a continuous feedback loop with Coach to drive mutual progress. Coachtopia launches today with an all-gender collection of bags, accessories, ready-to-wear and footwear made with recycled, repurposed and renewable materials and designed with our Made Circular™ principles in mind. As Coachtopia grows, it will continue to innovate through limited drops of experimental products that push circular craft ever further—with a commitment to take back every product at end-of-life for reuse, remaking or recycling. Each bag, wallet, footwear and ready- to-wear product also comes with a unique digital passport—accessed via an embedded NFC chip—that gives customers transparency into its materials, Made Circular™ design and impacts. This digital passport also provides the means to follow the product's journey as it is repaired, restored, reused and reimagined over multiple lives. Coachtopia is available today on Coach.com in the US, Canada and UK and in Selfridges, London. Coachtopia will then launch in Spitalfields, London on April 28; Coach stores across the US including Coach House Fifth Avenue, New York; N. Michigan Avenue, Chicago; The Grove, Los Angeles; and Dadeland, Miami; and additional Selfridges stores across the UK in May; Coach House Regent Street, London in early June; and Coach Soho, New York in July. Coachtopia will also expand to Asia later this year. That's just the short version. Take a full tour of Coachtopia, including details on its Made Circular™ principles, material innovations, strategic partnerships and launch campaign below. Learn more about Coachtopia at coachtopia.com. Connect on social @coachtopia. A world of circular craft In today's linear fashion system, over 85% of materials produced end up incinerated or as waste in landfill. Through its Made Circular™ principles, Coachtopia is working to design out waste and reduce the use of new materials—the creation of which accounts for 38%* of the fashion industry's greenhouse gas emissions—while helping to keep products out of landfill by designing them to be reused over many lives. Coachtopia's Made Circular™ principles are as follows: Craft with recycled, repurposed or renewable materials. Exploring new ways to craft from what already exists, with a mission to avoid the creation of new, virgin materials in making Coachtopia products. The leathers used in Coachtopia products are either ingeniously Upcrafted from Coach production waste or made with at least 50% recycled leather scraps from tanneries. Other materials used across the range include 95%+ recycled cotton for hoodies and T-shirts, a colorful 70%+ recycled resin for bag straps and hardware, 100% recycled polyester for canvas totes and webbing on footwear and a 40% bio-based renewable Sugarcane EVA for footwear soles. Exploring new ways to craft from what already exists, with a mission to avoid the creation of new, virgin materials in making Coachtopia products. The leathers used in Coachtopia products are either ingeniously Upcrafted from Coach production waste or made with at least 50% recycled leather scraps from tanneries. Other materials used across the range include 95%+ recycled cotton for hoodies and T-shirts, a colorful 70%+ recycled resin for bag straps and hardware, 100% recycled polyester for canvas totes and webbing on footwear and a 40% bio-based renewable Sugarcane EVA for footwear soles. Design for multiple lives. Crafting products to be more easily disassembled, repaired and reimagined for second and even third lives. Coachtopia is continually working to develop new, circular design details to help products to be more easily repaired, unmade and remade with less damage to their components and materials than in conventional luxury leather goods. From removable screw- back hardware, detachable handles and straps, binding or seam-out constructions and monomaterial designs, Coachtopia design innovations are aimed at keeping materials in use at their highest value—and out of landfill. Crafting products to be more easily disassembled, repaired and reimagined for second and even third lives. Coachtopia is continually working to develop new, circular design details to help products to be more easily repaired, unmade and remade with less damage to their components and materials than in conventional luxury leather goods. From removable screw- back hardware, detachable handles and straps, binding or seam-out constructions and monomaterial designs, Coachtopia design innovations are aimed at keeping materials in use at their highest value—and out of landfill. Create circular pathways. Committing to take back all Coachtopia products, regardless of age or condition, and finding ways to reuse them, with clear pathways defined for restoring, upcrafting, remaking and recycling. Each Coachtopia product can be traded in at a Coach Retail store in exchange for a credit—calculated according to the product's original price and current condition. Each one comes with a unique digital passport to track its journey across multiple lives. * Source: Fashion on Climate, McKinsey & Company, 2020 Material Innovations Designed in accordance with Coachtopia's Made Circular™ principles, the Coachtopia launch collection features a range of products ingeniously made with waste, including the Ergo and Wavy Dinky shoulder bags, a multi-functional 3-in-1 Crossbody Belt Bag and a selection of small leather goods, ready-to-wear, footwear and accessories crafted with recycled, repurposed and renewable materials. Key innovations include: Upcrafted leather Upcrafted leather is made from Coach production waste, specifically, the scraps of leather left over after Coach bag patterns are cut from leather hides, through processes that are only possible thanks to Coach's 80+ years of leather expertise. In the launch collection, the Ergo and Wavy Dinky bags have been reimagined using a range of different Upcrafted techniques, including patchwork, weaving, appliqué, sequins, pressed leathers and scrap binding, that transform Coach waste—from leather cutting room scraps to zipper ends— into unique artisanal styles. Key styles include the Ergo and Wavy Dinky in Checkerboard Upcrafted Leather. Coachtopia Leather Coachtopia leather is made with at least 50% recycled leather scraps from tanneries. Though it's made with waste, it sacrifices nothing in terms of style: Coachtopia has worked with its partners to ensure Coachtopia leather has the premium finish, grain and hand feel that you would expect from a Coach leather product. All bags and leather goods in the launch collection are available in Coachtopia leather variations, including styles that come with a unique Upcrafted binding made from Coach production leather scraps. 70% Recycled Resin As part of Coachtopia's mission to design for multiple lives, several styles in the launch collection come with easily detachable handles crafted in a colorful resin made from at least 70% recycled plastic waste, sorted by color and then extruded into new materials in one-of-a-kind patterns and colors. This recycled resin is also used across the collection for select hardware details and hangtags. A Shift Towards \"Nothing New\" Throughout the collection Coachtopia has examined every detail of its products with a view to replacing virgin materials with recycled, repurposed or renewable ones. The leather linings of Coachtopia bags are made with at least 50% recycled leather scraps. The thread used to stitch them is 100% recycled polyester. The plastic hardware in bags and small accessories is made from at least 70% recycled resin. Ready-to-wear is crafted in 95%+ recycled cotton or repurposed denim deadstock. Even the labels inside each product are 100% recycled polyester or nylon. Additionally, Coachtopia's at least 75% recycled packaging has been designed to be multi-functional to reduce material use and is printed with renewable Algae Ink.™ Powered by Community Coachtopia is being built as a community in which a new generation of fashion enthusiasts, creatives, entrepreneurs, activists and more are invited to participate through collaborative discussions, projects and opportunities. It's a platform for change in which emerging Gen Z voices help create the future they want to see. The Coachtopia Beta Community Coachtopia has been built on the passion of the Coachtopia Beta Community, a global and growing network of diverse and inspiring Gen Z individuals who are feeding their perspectives and ideas into Coachtopia products, messages and concepts as they are developed. They are united by a desire to drive positive change and help build a better future for fashion. \"We want to be part of the conversation because we see what the world will be like if we don't make change.\" Sophie Lowery, 20, film student and Coachtopia Beta Community founding member Collaborative drops Through limited-edition product collaborations, Coachtopia is inviting emerging talents to show- case their creativity and bring new and inspiring perspectives to bear on fashion's challenges. The brand's first collaboration is with graphic designer and illustrator Sabrina Lau, whose original art- work for Coachtopia's launch drop is inspired by her love of texture and surreal juxtaposition, as well as her encounters with nature throughout her home city of New York. \"Honestly, it was like a fever dream. It really did feel like a true collaboration—it was very open. And to be the first one to kick it off is truly an honor.\" Sabrina Lau, 25, collaborating graphic designer and Coachtopia Beta Community member Designing the future With the Coach Foundation, Coachtopia is sup- porting the passion and ingenuity of tomorrow's design talent. The CFDA x Coach Dream It Real Circular Design Scholarship has been awarded to 15 students passionate about making fashion more circular. Coachtopia has invited these scholars to participate in a \"Coachtopia Waste Contest\" in which, with mentorship from the Coachtopia team, they worked to develop new creative uses for Coach leather scraps. Select projects will be brought to market as limited edition drops. \"Going through the design and production process with the Coachtopia team pushed me to design with a new perspective. [The experience] has given me a lot more confidence in designing for circularity— and has inspired me to always leave a positive impact with the products I make.\" Vivian Luo, 21, fashion design student at The New School and Coachtopia Beta Community member. Community-driven storytelling As part of its collaborative ethos, Coachtopia is putting its community at the forefront of its campaigns and storytelling—engaging its broader audience in meaningful conversations around circular fashion through the voices of the inspiring and diverse group of individuals in the growing Coachtopian community. These community members are featured in the launch campaign, web content and a range of digital assets that take us behind-the-scenes in the making of Coachtopia, working both in front of and behind the camera. \"As a sustainability consultant and designer I've been bringing my voice and expertise to Coachtopia. They are collaborating with us, with the next generation of artists, activists and designers. Coachtopia has created a unique community of like-minded people in the sustainability and fashion spaces.\" Maya Penn, 23, climate activist, sustainable fashion designer and artist and Coachtopia Beta Community member. The Launch Campaign In its launch campaign, Coachtopia is paying tribute to its growing community, bringing together nine Gen Z talents, along with Coachtopia's designer and master craftsperson, who represent the breadth of voices feeding into the brand's products, messages and long-term vision: Lola Tung, actor Maya Penn, climate activist sustainable fashion designer and artist Caulin Donaldson (aka Trash Caulin), climate activist and creator Sabrina Lau, graphic designer Natalia Spotts, vintage and second-hand boutique owner Tyler McGillivary, fashion designer and upcycler Aditi Mayer, climate activist, photojournalist and speaker Sinn Chhin, makeup artist and designer Rahmir Meggett, fashion designer, entrepreneur and model Trey Denis, Coachtopia designer Mauricio Alvarado, Coachtopia master craftsperson The campaign film is directed by filmmaker Adrien Lagier, and the images were shot by photographer Remi Ferrante. Film & Photography Credits Production House: ADEUS Director: Adrien Lagier Editor: Roman Lagier Photographer: Remi Ferrante Set Designer: Till Duca Stylist: Max Ortega Creative Agency: Marcel Worldwide Building towards a better future In the knowledge that circularity is not an end point, but a journey, Coachtopia is working iteratively to improve its processes, prioritizing progress over perfection to find new ways of reimagining waste and reducing its carbon footprint. To drive that progress and measure its impacts, Coachtopia is collaborating with partners across the industry who share its mission for driving positive change through innovation. Key Partners The Ellen MacArthur Foundation The Ellen MacArthur Foundation is a non-profit committed to driving the global transition towards a circular economy and sharing learnings about its benefits for biodiversity, climate change and waste reduction. Coachtopia's Made Circular™ principles have been informed by The Ellen Mac- Arthur Foundation's vision of a circular economy for fashion where products are used more, made to be made again and made from safe and recycled or renewable inputs. Coachtopia's parent company, Tapestry, is a Network Partner of the Ellen MacArthur Foundation. ReCircled ReCircled is an innovative recycling and takeback company that helps keep pre-loved products and materials in circulation at their highest value, saving them from being sent to landfill. Coachtopia is working with ReCircled to help recycle otherwise unusable materials. For example, packaging waste and materials from unrepairable Coach products have been reimagined into new Coachtopia materials, such as the filling for the Coachtopia furniture ottomans in select stores. EON Coachtopia has partnered with EON, fashion's leading product cloud platform, to create a unique, cloud-based digital passport for each Coachtopia product, accessed via a scannable NFC chip or QR code embedded in the product. Through this partnership, Coachtopia is harnessing technological innovation to meet the need for data-driven circularity in an environment where clarity and transparency on the lifecycle of every product is increasingly vital. By connecting a product's digital passport to their account, Coachtopia customers can access a range of circular services that will help to prolong the lifespan of their product. Gen Phoenix Coachtopia has worked with Gen Phoenix, an innovative sustainable materials company, to develop a soft and durable uncoated leather lining, used in many Coachtopia products, made with at least 50% recycled leather scraps and 75% total recycled content. Gen Phoenix uses a patented hydroentanglement technology to create high quality materials from recycled leather waste, specifically offcuts from tanneries that might otherwise have been sent to landfill. Building on this Coachtopia partnership, Tapestry, the parent company of Coach, has invested in Gen Phoenix as part of the company's recent funding round. Everywhere Apparel We source the minimum 95% recycled cotton fabrics for Coachtopia T-shirts and hoodies through Everywhere Apparel, a company that collects, sorts and shreds pre- and post-consumer waste materials to create new yarns and fabrics. When a piece of Coachtopia clothing is no longer usable, we plan to work with Everywhere Apparel to mechanically recycle these materials into new textiles of the same value, with the goal of working towards a closed loop system where new products are made from old. WSP Coachtopia has partnered with WSP, one of the world's leading engineering, environment and professional services firms, to create an environ- mental impact calculation tool for Coachtopia. This cradle-to-grave tool calculates both the greenhouse gas emissions of our products and the total weight of waste diverted from landfill to create them. 1% for the planet Coachtopia* is a member of 1% for the Planet, a growing global community of businesses and individuals working together to help protect the earth. As a member, we've pledged to donate 1% of Coachtopia's annual sales to verified environmental non-profit organizations working to create positive change. *partnership with Tapestry, our parent company Good Shipping, 3 Degrees Coachtopia offsets the carbon emissions of its upstream and downstream shipping and freight, including eCommerce shipments to consumers, through two partnerships: Good Shipping, a company that substitutes fossil fuels in ocean freight with sustainable biofuels, a verified carbon neutral fuel option, and 3 Degrees, a company that works with brands to offset emissions through a portfolio of certified carbon emissions reductions projects. Our Impacts Coachtopia is assessing the impacts of its products through a carbon footprint and waste diversion measurement tool developed in partnership with WSP, one of the world's leading engineering, environment and professional services firms. To ensure these impacts are communicated with the utmost transparency, the brand is conducting a critical review of these metrics with three external lifecycle assessment experts—the results of which will be published in mid-2023. Coachtopia has also worked with testing and certification company SGS to conduct full lifecycle assessments of its key styles, the Ergo and the Wavy Dinky, to identify continued opportunities for reducing the impact of its products. Carbon Footprint Carbon Reduction Waste Diversion 10 kgs CO2e created. 71% carbon reduction. 398 gs waste diverted. Coachtopia has worked with WSP to calculate the carbon footprint of each one of its products, with the goal of reducing their overall emissions. By repurposing materials that already exist, this product helps to avoid the creation of new materials—which accounts for 38% of fashion's emissions. Coachtopia also works to reduce its emissions across its full value chain. By upcyling and recycling waste that might otherwise have been sent to landfill, this product helps Coachtopia to work towards a zero-waste future. The Reusable Store Each Coachtopia store environment reflects the brand's Made Circular™ principles, featuring fixtures made with Coach leather production waste, neon signs made from industry scraps and offcuts, hangers and trays made from recycled paper or textiles, seating made from excess materials and unrepairable Coach bags and a flexible modular design that facilitates reuse. Each store environment also reflects Coachtopia's collaborative ethos with bespoke furniture crafted by local artists using upcycled damaged Coach products, excess Coach materials and locally salvaged materials. To learn more about Coachtopia and its processes, visit Coachtopia.com. To learn more about Coach's sustainability commitments and progress, visit www.coach.com\/sustainability-crafted-to-last. To learn more about Tapestry's sustainability commitments and progress, visit www.tapestry.com\/responsibility\/our-planet. About Coach Coach is a global fashion house founded in New York in 1941. Inspired by the vision of Creative Director Stuart Vevers and the inclusive and courageous spirit of its hometown, the brand makes beautiful things, crafted to last—for you to be yourself in. Coach is a Tapestry, Inc. brand. Tapestry is publicly listed on the New York Stock Exchange under the ticker TPR. About Tapestry, Inc. Our global house of brands unites the magic of Coach, kate spade new york and Stuart Weitzman. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. We use our collective strengths to move our customers and empower our communities, to make the fashion industry more sustainable, and to build a company that's equitable, inclusive, and diverse. Individually, our brands are iconic. Together, we can stretch what's possible. To learn more about Tapestry, please visit www.tapestry.com. The Company's common stock is traded on the New York Stock Exchange under the symbol TPR. Follow and connect with Tapestry on LinkedIn and Instagram or visit our newsroom. To build your future at Tapestry, find our latest job opportunities on our careers page. Press Inquiries Amanda Garcia Santana, Global Head of PR & Celebrity Relations [email protected] Brooke Hudson, Director, Global Brand Communications [email protected] SOURCE Coach, Inc.","filter_flag":1}
{"title":"11 Effective Solutions for Food Waste - EARTH.ORG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiK2h0dHBzOi8vZWFydGgub3JnL3NvbHV0aW9ucy1mb3ItZm9vZC13YXN0ZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiK2h0dHBzOi8vZWFydGgub3JnL3NvbHV0aW9ucy1mb3ItZm9vZC13YXN0ZS_SAQA?oc=5","id":"CBMiK2h0dHBzOi8vZWFydGgub3JnL3NvbHV0aW9ucy1mb3ItZm9vZC13YXN0ZS_SAQA","guidislink":false,"published":"Sat, 08 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=98, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiK2h0dHBzOi8vZWFydGgub3JnL3NvbHV0aW9ucy1mb3ItZm9vZC13YXN0ZS_SAQA?oc=5\" target=\"_blank\">11 Effective Solutions for Food Waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EARTH.ORG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"11 Effective Solutions for Food Waste - EARTH.ORG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiK2h0dHBzOi8vZWFydGgub3JnL3NvbHV0aW9ucy1mb3ItZm9vZC13YXN0ZS_SAQA?oc=5\" target=\"_blank\">11 Effective Solutions for Food Waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EARTH.ORG<\/font>","source.href":"https:\/\/earth.org","source.title":"EARTH.ORG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Food waste is one of the biggest environmental problems and challenges of our lifetime and it must be eradicated at all costs. However, some see it as a business opportunity ready for innovative solutions. If we properly educate ourselves about food waste, we would see that taking the steps to reduce it can be an excellent way to lower costs, generate profits, and alleviate climate change. Here are 11 effective solutions to tackle food waste for businesses, producers, retailers, and consumers. __ The issue of food waste ranges from industrial to individual; there are many contributing factors towards why food is wasted, such as purchasing preferences, excess production, retail standards, convenience, cost and more. Food waste affects all three realms of sustainability: environmental, economic and social. It is a societal issue that touches everyone around the globe, and it contributes to the larger issue of climate change. It has been estimated that food waste accounts for one-third of all human-caused greenhouse gas emissions and generates 8% of greenhouse gases annually. Solutions for food waste are needed now more than ever. Everyone can be a part of the solution to food waste, from large corporations to small communities. Innovators have explored food waste solutions in the science and technology industry, but there is still more that needs to be done. Addressing food waste does not need to be a charitable thing or a form of philanthropy. What often goes unrecognised are the huge benefits that can be achieved from reducing food waste, and they are not just environmental. They can differ from improvements in one’s health, to profits generated in a company with innovative solutions to tackle the crisis. If businesses redirect excess food to communities with limited access to it, they can save money and reduce their methane emissions at the same time. Educating the public about the benefits of reducing food waste will also encourage businesses and consumers to monitor their waste more closely. You might also like: What is Food Waste? Creating Circular Food Systems Businesses can benefit in the reduction of food waste economically, socially and on a broader scale, environmentally. Inspired by Patagonia’s sustainability effort, the University of Maine’s Mitchell Center Team Project conducted a research project that looked into “Food Management: Empowering Main Businesses Towards Sustainability”. This study was conducted in collaboration with stakeholders who were persuading business owners to adapt food waste solutions into their practices. The aim of the project was to determine how easily these changes can be adapted to fit the individual lifestyles of consumers. The stakeholders involved work in Maine’s food-related industries, such as grocery stores, farms, restaurants, and hospitals. Key stakeholders included Hannaford, Northern Light: Maine Coast Hospital, City of Portland, and the Maine DEP, as well as many others. In this study, using a triple bottom line approach, businesses were encouraged to equally prioritise their monetary profits with their environmental and social responsibilities. They recommended food systems to be reworked from a linear one into a circular one. In a linear system, there is a simple relationship between production to consumption, in which the end result is waste. However, with a circular economy, the goal is to recycle waste into a resource that can be used to create new products. The study was successful in that stakeholders were interested in collaboration at the end of the project. It also highlighted the importance of education and accessibility to landfill alternatives. Six solutions were developed from the collaboration in the project: 1. Measuring and tracking all food storage Businesses were encouraged to use pre-existing food waste tracking technology. These systems can help make businesses aware of the money they are wasting on food waste that never gets to consumers. 2. Creating a “Food Rescue” system This solution utilised a web-based system that matched locally available food to local food needs and volunteers to transfer the food to the ones that need it. 3. Promoting statewide consumer and producer waste education Consumer education and awareness about the food system and the waste was encouraged. Doing so helped people see the true value of the food they are purchasing. There is a general lack of awareness, so implementing education programmes in schools can be an effective way to educate the public. 4. Building of food handling and processing infrastructure This solution focuses on “upcycling” food that is already in the system, e.g. turning tomatoes into tomato sauce and increasing demand in canning and processing food for long-term storage. The aim here is to connect key members of the food system and create synergy among handling and processing stakeholders. Primary issues to be addressed are transportation availability, storage limitations, and restrictions associated with food donation. 5. Educate producers on the advantages of donating This solution is also related to the second solution. The primary goal for this solution is to educate stakeholders on food donation incentives, legal protection, and offer guidance on relevant governmental agencies. 6. Composting alternatives This solution aims to increase available options for composting and other alternatives to disposal of food in landfills. Developing statewide practices to divert food waste from landfills can make huge cost savings possible. Changing Food Crops The International Panel of Climate Change (IPCC) recommends producers and farmers to consider a change in crops. They believe that improving food security and lowering greenhouse gas emissions can be achieved through changing what we eat, and growing more sustainable and hardy crops. These types of crops can be ones that are low maintenance, can cope with extreme weather events, and crops that can be interspersed with pastures and arable land. Avoiding deforestation for additional farmland could also prevent more than 70 gigatons of greenhouse gas emissions. For other ways to reduce food waste on the producer level, the US Department of Agriculture (USDA) has recommended the following solutions for producers and farmers: 1. On-farm storage On-farm storage is a great way to reduce post-harvest loss. Farmers should have effective, safe and accessible storage for their products. Some countries might offer a farm storage facility loan programme (USDA) where they provide low-interest financing to help producers build or upgrade storage. 2. Value-added products This is where you can enhance the value of products by upcycling them into another product. The potential to reduce food waste can be made if we create value-added products. A good example of this is growing out black solider fly larvae to bioconvert the organic waste into sustainable insect protein, oil and frass which eliminates or abates on farm emissions. 3. Secondary markets that produce delivery services There are many businesses in some countries that offer weekly or bimonthly boxes of food products that have been directly sourced from the farmers. Farmers could directly collaborate with these markets to effectively control their food production. 4. Donations Donations from farmers can help provide individuals with fresh produce if they have limited access to it. There have been laws and programs created to make donations easy — liability protection, tax benefits, picking and pack-out costs, gleaning etc. 5. Feeding animals Using the food scraps as feed for animals can also be done. This is a common practice that has been around for centuries and is an easy way to divert food waste. However these animals especially cattle – produce methane. So better ways to recycle the waste need to be deployed, such as insect farming. Redirecting Food Surplus and Educational Campaigns Food waste from restaurants and business constitutes 28% of the food wasted. To rectify this, we can push for policies that limit waste and redirect uneaten food to places where it is needed. This can be in the form of food recovery programmes to direct surplus to shelters. There are other wide varieties of changes retailers can make in order to reduce their food waste. Some of these include upgrading their hardware with the latest technology, focusing on long-term sustainability rather than maximising returns from a product in the short-term, modifying their policies and regulations and ensuring all food is accepted to be sold etc. Supermarkets can also create campaigns, where they provide education, inspiration and advice to their customers. Sainsbury’s – the second largest chain of supermarkets in the UK – research found that people look to supermarkets for guidance on how to tackle food waste, therefore retailers could provide literature in the form of magazines and membership programmes, that can provide ideas on how customers can prevent food waste, as well as recipes on how to utilise leftover food. A good example is the rising number of “wonky” vegetable initiatives that have been implemented by supermarkets in recent years. These initiatives encourage consumers to buy food that does not meet aesthetic criteria, and they have been marketed in a way to make them appealing. In 2021, it was reported that Tesco’s food waste scheme Perfectly Imperfect saved at least 50 million packs of fruit and vegetables from being discarded. Rethink Our Food Perceptions and Habits Food waste is also the responsibility of us as individuals, as food waste at home can amount to 37% of overall food waste. We need to change our habits in ways that significantly reduce the amount of food that we waste. One of the easiest solutions for food waste is through organisation methods. We could organise our fridge in a way that ensures the food that will go off first is clearly visible to us when we open the fridge. We could keep a list of the food we have bought on hand, and make a note of all the use-by labels. While this can be time consuming, a study in 2020 indicated that if you put these small efforts into reducing food waste, you could end up saving a substantial amount of money. We also need to change our minds and the way we perceive food. Rather than preparing and cooking a meal we are in the mood for, we should base our cooking decisions off of the food we see in the fridge that needs to be used first. Researching literature or buying cookbooks that provide ideas on how to utilise food scraps and leftover food can also be beneficial. Additionally, composting your food waste can help reduce carbon by equivalent of 12 million passenger vehicles off the road for 30 years. Changes to our diet also need to be made. Experts have stated that there is too much fish, fats, sugars, dairy products and processed foods in our diets. Aside from incorporating more fruit and vegetables in our diets, Dr. Debra Roberts, co-chair of IPCC Working Group II, has recommended that we change our diet to consist primarily of low-CO2 emission food. By doing so, we can ensure that we maintain a balanced diet based on foods such as secondary cereals, pulses, fruits, vegetables, and even animal foods obtained with low CO2 emissions. We can do this by making conscious decisions to eat food that has a low carbon footprint such as plant-based foods. Meal-prepping is another great way to save time and resources, which can also prevent you from overbuying during food shopping. You might also like: 25 Shocking Facts About Food Waste 6 Key Facts to Help Consumers Make More Conscious Choices Most foods are labelled in supermarkets and retailers, and understanding what these labels mean can help you organise your food shopping. 1. “Sell by” date This is the date the retailer should display the product until withdrawing it from the shelves. This date does not indicate that the food has spoiled, but merely specifies the day that it will be past its best quality. The food is still safe to consume. 2. “Best if used by (or before)” date This date is for sellers and indicates when the food will be at its best quality to eat. It does not mean the food is inedible after this date, but merely informs the customer of when the best time to consume the food will be for it’s flavour and freshness etc. 3. “Guaranteed fresh” date This date refers to the date when the item is at its optimal freshness. This is usually used for bakery items. 4. “Pack date” This is usually the date on canned or packaged food. This date tells us when the product was packed. It does not indicate when it needs to be consumed by. 5. “Use By” date This is the last date that the manufacturer guarantees the product to be at its maximum quality. 6. “Expires on” date This date refers to the date that it is recommended that the product should be consumed by. If you decide to eat the food after the date, it is at your own risk. Overall, knowing the meaning of these dates is useful. However, it should be noted that some manufacturers might not put them on their products. For example, if you go to a meat market or a fish market, you may receive products in an ordinary bag, without a label. Here is a basic guide for when food is safe to eat: Milk – usually safe after one week after selling Eggs – often fine from three – five weeks from the date of purchase – often fine from three – five weeks from the date of purchase Poultry and seafood – cook or freeze within one or two days after purchase – cook or freeze within one or two days after purchase Beef or pork – cook or freeze within three-five days – cook or freeze within three-five days Canned goods – five-18 months, depending on the acidity of the product Benefits of Reducing Food Waste at Home Even though you will be making a conscious effort to help the environment, you will also be receiving benefits from reducing your food waste: Money saved by planning what to buy properly Maintaining a healthy weight and preventing overeating Lessening the chances of food poisoning in your household, as storing contaminated food could accidentally be consumed without you realising A well-organised, fresh-smelling pantry. There will be no bad smell or messy food waste around your pantry Pest control You can keep away pests, such as rats, flies and cockroaches Earth.Org believes that there is a gargantuan opportunity to recycle organic waste and believes companies like FlyFarm, Ynsect and Innovafeed are showing that insect bioconversion eliminates emissions at the same time as produces high value sustainable protein. Challenges remain for post consumer waste around waste segregation and incentives for consumers to ensure their waste is free of contaminants. Governments should focus on ensuring that organic waste can be recycled. Featured image by Marco Verch\/Flickr","filter_flag":1}
{"title":"Introducing the 2023 ENERGY STAR Award Winners | ProBuilder - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludHJvZHVjaW5nLTIwMjMtZW5lcmd5LXN0YXItYXdhcmQtd2lubmVyc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludHJvZHVjaW5nLTIwMjMtZW5lcmd5LXN0YXItYXdhcmQtd2lubmVyc9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludHJvZHVjaW5nLTIwMjMtZW5lcmd5LXN0YXItYXdhcmQtd2lubmVyc9IBAA","guidislink":false,"published":"Mon, 17 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=107, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludHJvZHVjaW5nLTIwMjMtZW5lcmd5LXN0YXItYXdhcmQtd2lubmVyc9IBAA?oc=5\" target=\"_blank\">Introducing the 2023 ENERGY STAR Award Winners | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Introducing the 2023 ENERGY STAR Award Winners | ProBuilder - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludHJvZHVjaW5nLTIwMjMtZW5lcmd5LXN0YXItYXdhcmQtd2lubmVyc9IBAA?oc=5\" target=\"_blank\">Introducing the 2023 ENERGY STAR Award Winners | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"For more than 30 years, ENERGY STAR has been one of America’s leading resources for energy efficiency, preventing over 4 billion tons of greenhouse gas emissions, while saving consumers and businesses over $500 billion, the program says. Its 2023 award winners join a growing list of building product manufacturers (BPMs) and businesses pushing the envelope of energy efficiency in the commercial, industrial, and residential sectors. What is ENERGY STAR? ENERGY STAR is a government-certified symbol for energy efficiency administered by the U.S. Environmental Protection Agency. The program helps Americans make well-informed consumer decisions inside and outside of the home. To date, approximately 1,700 manufacturers and 1,200 retailers partner with ENERGY STAR to make and sell millions of ENERGY STAR certified products, the company says. With the help of its product certifications and residential and commercial building standards, the ENERGY STAR program has helped American families and businesses save “5 trillion kilowatt-hours of electricity, avoid more than $500 billion in energy costs, and achieve 4 billion metric tons of greenhouse gas reductions,” according to EPA’s research. The ENERGY STAR awards are announced each year by the Environmental Protection Agency (EPA) Image: Eric BVD \/ Stock.adobe.com READ MORE: Products Newswire ENERGY STAR’s Annual Awards Program Every year, ENERGY STAR awards are granted to partner companies that have made “outstanding contributions to protecting the environment through superior energy achievements” by producing, manufacturing, and promoting certified products, the foundation says. Program partners can submit nominations or apply for annual awards through the application portal located on the ENERGY STAR website. Among this year’s 221 winners ENERGY STAR is recognizing more than 170 organizations for their “year-over-year commitment to energy efficiency through the program’s highest honor: ENERGY STAR Partner of the Year – Sustained Excellence winner,” the organization says. In addition, ENERGY STAR recently named its annual Partner of the Year, Contractor of the Year, and Excellence award winners for their contributions towards energy efficiency in the built environment. Award Winners: Energy Professionals Award Winners: Building Pros Award Winners: BPM\/Suppliers Partner of the Year—Sustained Excellence The ENERGY STAR Partner of the Year—Sustained Excellence Award is given to partners who have “already received ENERGY STAR Partner of the Year recognition for a minimum of two consecutive years and have gone above and beyond the criteria needed to qualify for recognition,” ENERGY STAR says. Only partners who have been recognized for past achievements are eligible to apply. Partner of the Year The ENERGY STAR Partner of the Year Awards recognize partners meeting and exceeding program criteria through energy management, home building, and product manufacturing, among a number of other categories. The Partner of the Year Award is granted each year to “partner businesses and organizations in good standing that demonstrate superior leadership, innovation, and commitment to environmental protection through energy efficiency and ENERGY STAR,” according to the award guidelines. Home Performance with ENERGY STAR Contractor of the Year The Home Performance with ENERGY STAR Contractor of the Year Award is presented by EPA to ENERGY STAR participating contractors in good standing who use innovative building science solutions to improve homes. Those who have received the Home Performance with ENERGY STAR Contractor of the Year Award across multiple years are eligible to receive the Sustained Excellence Award in the same category. Excellence Award The final annual award most recently announced by ENERGY STAR is the Excellence Award, which honors partner companies and organizations excelling in data innovation, ENERGY STAR marketing, and product design. The Excellence Award is mostly reserved for retailers, manufacturers, energy efficiency program sponsors, service and product providers, and state and local governments, though any ENERGY STAR partners contributing to energy efficiency in their respective professions are also encouraged to apply. PEG Partner of the Year - Sustained Excellence - Energy Rating Company Fairfax, Virginia-based PEG certified more than 7,500 homes as ENERGY STAR in 2022 for a total of over 97,000 since 2007, and the home energy rating and HVAC design engineering company also facilitated over a dozen in-person sessions at state-wide events to educate more than 1,000 builders and vendors on ENERGY STAR program requirements, utility rebates, and the 45L Tax Credit extension. EnergyLogic, Inc. Partner of the Year - Sustained Excellence - Energy Rating Company Based out of Berthoud, Colorado, EnergyLogic is a home energy rating and applied building science company that certified more than 1,800 homes as ENERGY STAR in 2022 for a total of nearly 40,000 since 2001. EnergyLogic also enhanced its website to better promote the value of ENERGY STAR certification and associated EPA whole-house labels, resulting in a 50% increase in web traffic to the ENERGY STAR-related pages. GreenSavers Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year With 2,200 home energy assessments and 781 home performance projects completed, GreenSavers surpassed its 2021 record for heat pump sales by 58% without incentives to switch from gas furnaces to heat pumps and increased Home Performance with ENERGY STAR projects completed by more than 10%. GDS Associates Partner of the Year - Sustained Excellence - Energy Rating Company Home energy rating company GDS Associates certified more than 900 homes as ENERGY STAR in 2022, for a total of nearly 13,000 since 2006. Conducting in-field training with project management, site supervisors, and purchasing; sales, marketing, and subcontractor staff to identify new strategies to meet ENERGY STAR program requirements and maintain builder commitments to the program. MaGrann Associates Partner of the Year - Sustained Excellence - Energy Rating Company MaGrann Associates, a home energy rating company, certified nearly 800 homes as ENERGY STAR in 2022, for a total of over 56,000 since 1997. Certifying 433 all-electric units and encouraging clients pursuing ENERGY STAR certification to implement all-electric projects, consulting on how they can choose all-electric systems while still meeting ENERGY STAR program requirements. EDGE Energy Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year Home performance company EDGE Energy boosted its duct sealing completions by 39% over the previous year, reducing air leaks by an average of 50–90%. EDGE Energy also performed 655 home energy assessments and increased home performance projects by 9%, achieving an average savings of 18.6 MMBtu per project. Ideal Air Conditioning and Insulation Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year Ideal Air Conditioning and Insulation is a home energy efficiency and HVAC contractor based out of Phoenix, Arizona. Ideal Air assessed 892 homes in 2022, almost twice the number performed in 2021, and completed 347 Home Performance with ENERGY STAR projects, a 30% increase over 2021. Wise Home Energy Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year In 2022, Wise Home Energy achieved an increase in total annual energy savings of almost 20% over 2021 with average energy savings to 35 MMBtu per project. The home performance company also increased heat pump sales by more than 50%. Southern Energy Management Partner of the Year - Sustained Excellence - Energy Rating Company Southern Energy Management certified more than 1,500 homes in 2022, created showroom displays and “silent sellers” to help builders showcase the features and benefits of ENERGY STAR certification, and Provided on-demand access to ENERGY STAR marketing materials for builder clients through its “High-Performance Homes Resource Hub.” US-EcoLogic Partner of the Year - Sustained Excellence - Energy Rating Company U.S. Eco Logic, Inc.\/TexEnergy Solutions certified more than 2,000 homes as ENERGY STAR in 2022, for a total of over 56,000 since 2002. The Irving, Texas-based home energy rating company also provided technical training to over 100 local trades and contractors to help them implement ENERGY STAR program requirements. Home Energy Medics Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year Home Energy Medics helped its customers reduce energy bills by as much as 50% through HVAC and envelope improvements and increased average energy savings per project to 129 MMBtu in 2022. Pando Alliance Partner of the Year - Sustained Excellence - Energy Rating Company Pando Alliance, a home energy rating company, certified more than 700 dwelling units as ENERGY STAR in 2022, for a total of over 5,000 since 2011. Ciel Power Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year Ciel Power ended 2022 with 512 home performance assessments and 96 home performance projects completed—a 25% increase over the previous year. The home performance contractor also launched its 13th public\/private energy program and joined an effort to uncover common barriers to household electrification to be addressed in future program designs. Green Team LI Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year Green Team LI increased average home energy savings to 50MMBtu by including whole-house heat pumps in more projects. In 2022, the home energy efficiency contractor completed 883 home energy audits and 364 home performance projects through its Home Performance with ENERGY STAR partnership. Building Efficiency Resources Partner of the Year - Energy Rating Company Home energy rating company Building Efficiency Resources certified more than 3,000 homes as ENERGY STAR in 2022, for a total of more than 28,000 since 2010. The company also trained over 300 home energy raters and rating field inspectors on ENERGY STAR program requirements. EAM Associates Partner of the Year - Energy Rating Company EAM Associates certified 1,400 homes as ENERGY STAR in 2022, for a total of over 20,000 since 2002. In addition, the home energy rating company promoted the importance of HVAC grading and ENERGY STAR certification at multiple state and local industry conferences for policymakers, builders, code enforcement officials, real estate professionals, and home inspectors. ReVireo Partner of the Year - Energy Rating Company ReVireo, a home energy rating company, certified 300 homes as ENERGY STAR in 2022, for a total of nearly 8,000 since 2011. Habitat for Humanity—Metro Denver Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Habitat for Humanity of Metro Denver, a nonprofit, affordable home builder and volunteer organization, constructed 31 ENERGY STAR certified homes in 2022, for a total of more than 360 homes since joining the program in 2002. McStain Neighborhoods Partner of the Year - New Home Builder and Affordable Housing McStain Neighborhoods, a regional home builder, constructed over 80 ENERGY STAR certified homes in 2022, for a total of more than 2,100 since joining the program in 2001. AZ Energy Efficient Home Home Performance with ENERGY STAR - Sustained Excellence - Contractor of the Year AZ Energy Efficient Home is an energy efficiency contractor. AZ Energy Efficient Home developed bi-weekly newsletters focusing on home performance topics, leading to a 15% increase in organic search website traffic over six months. KB Home Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing KB Home, one of the nation’s largest home builders, constructed over 12,000 ENERGY STAR certified homes in 2022, for a total of more than 174,000 homes since 2000, and utilized ENERGY STAR as its preferred platform for communicating its achievements in building homes that are more energy efficient and sustainable. Beazer Homes USA Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Beazer Homes U.S.A., a large national home builder, constructed more than 3,700 ENERGY STAR certified homes in 2022, for a total of more than 80,000 homes since joining the program in 2011. The company also incorporated innovative technologies, such as Tesla solar roof tiles, battery storage, and electric vehicle charging, into its homes. Brighton Homes Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Brighton Homes, a Meridian, Idaho-based home builder, constructed more than 160 ENERGY STAR certified homes in 2022, for a total of more than 2,000 homes since joining the program in 2009. Fulton Homes Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Based out of Tempe, Arizona, regional home builder Fulton Homes constructed more than 650 ENERGY STAR certified homes in 2022, for a total of more than 7,600 homes since joining the program in 2008. Providence Homes Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Jacksonville, Florida-based Providence Homes constructed over 60 ENERGY STAR certified homes in 2022, for a total of more than 1,900 since joining the program in 2009, and those homes were, on average, 70% tighter and 30% more energy efficient than code. Chinburg Builders Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Chinburg Builders, a regional home builder based out of Newmarket, New Hampshire, built nearly 80 ENERGY STAR certified homes in 2022, for a total of more than 800 ENERGY STAR certified homes since joining the program in 2004. New Tradition Homes Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing New Tradition Homes, a Vancouver, Washington-based regional home builder, constructed more than 250 ENERGY STAR certified homes in 2022, for a total of over 3,000 since joining the program in 2004. Mandalay Homes Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Based in Prescott, Arizona, Mandalay Homes constructed over 100 ENERGY STAR certified homes in 2022, for a total of nearly 1,300 since joining the program in 2013. Main Street Homes Partner of the Year - Sustained Excellence - New Home Builder and Affordable Housing Main Street Homes, a local home builder in Midlothian, Virginia, built over 300 ENERGY STAR certified homes in 2022, for a total of more than 2,100 since 2001. Design Tech Homes Partner of the Year - New Home Builder and Affordable Housing Spring, Texas-based Design Tech Homes, constructed 60 ENERGY STAR certified homes in 2022, for a total of more than 1,800 homes since joining the program in 2001. Habitat for Humanity of Pinellas and West Pasco Counties Partner of the Year - New Home Builder and Affordable Housing Habitat for Humanity of Pinellas and West Pasco Counties, an affordable home builder and volunteer organization, constructed 28 ENERGY STAR certified homes in 2022, for a total of more than 300 homes since joining the program in 2012. The organization also made homeownership affordable for underserved families by reducing their energy bills by 40% relative to code-built homes and 60%–70% relative to older rental units. LG Electronics Partner of the Year - Sustained Excellence - Product Brand Owner In 2022, LG Electronics increased sales of ENERGY STAR certified products by over $700 million to $4.3 billion, an 18% increase over 2021. In addition, the consumer electronics, home appliances, and mobile communications manufacturer exceeded 1 million units in sales of ENERGY STAR certified products across refrigerators, washers, and dryers, including 43 models earning the ENERGY STAR Emerging Technology 2022 Award. Pentair plc Partner of the Year - Sustained Excellence - Product Brand Owner Since 2005, Pentair plc’s ENERGY STAR certified pool pumps have been responsible for a cumulative 38.8 billion kWh of energy savings, and unit sales represent 46% of all ENERGY STAR pool pumps sold. In 2022, the company offered 17 ENERGY STAR certified pool pump models, which is a 55% increase in ENERGY STAR certified pool pumps available year-over-year. SoftLite Windows & Doors Partner of the Year - Sustained Excellence - Product Brand Owner - Windows, Doors, and Skylights In 2022, ENERGY STAR certified models accounted for 99% of SoftLite’s total sales (in dollars) and over 8% of all products shipped were recognized as ENERGY STAR Most Efficient products. SoftLite Windows & Doors also trained and tested 100% of new and existing employees and over 600 dealer employees—a 39% increase—with a revamped ENERGY STAR training program. Samsung Electronics Partner of the Year - Sustained Excellence - Product Brand Owner In 2022, Samsung Electronics introduced the first mass-market smart home energy management system (SHEMS) to earn the ENERGY STAR certification and became the first major brand to certify televisions to the latest ENERGY STAR criteria. GE Lighting, a Savant company Partner of the Year - Sustained Excellence - Product Brand Owner GE Lighting, a Savant Company, increased year-over-year sales and new SKUs of GE-branded ENERGY STAR certified lighting across the retail spectrum in 2022, and the company also featured the ENERGY STAR label on endcaps and in utility-sponsored displays at major retailers. Schneider Electric Partner of the Year - Sustained Excellence - Service and Product Provider In 2022, Schneider Electric benchmarked more than 59,000 properties and submitted nearly 160 buildings for ENERGY STAR certification. In addition, the energy management and automation services company assisted a large home builder with benchmarking and smart metering, helping homeowners reduce energy and costs by more than $800 million annually. Air King America Partner of the Year - Sustained Excellence - Product Brand Owner Throughout the past year, Air King America increased sales of an entry-level, affordable line of ENERGY STAR certified fans by 15% through a campaign designed to deliver better indoor air quality to homes using more efficient products to major U.S. homebuilders. In addition, the PA-based manufacturer offered 16 of the top 20 most efficient ENERGY STAR exhaust fans and the top 15 most efficient range hoods, including some of the lowest cost models. Beko US Partner of the Year - Sustained Excellence - Product Brand Owner In 2022, Beko US introduced the CornerIntense dishwasher that uses 50% less energy and 25% less energy than federal standards mandate. The company’s first national dishwasher campaign for this ENERGY STAR Most Efficient 2022 model secured nearly 22 million impressions. Panasonic Eco Systems North America Partner of the Year - Sustained Excellence - Product Brand Owner In 2022, Panasonic earned ENERGY STAR certification for 94% of vent fans, representing 99% of sales, with 55% of sales being ENERGY STAR Most Efficient ventilation fans. The company’s commitment to certifying products and training employees, distributors, and retailers about the benefits of ENERGY STAR also led to product sales that contributed to electricity savings of 32.8 Terawatt hours in 2022. A.O. Smith Partner of the Year - Sustained Excellence - Product Brand Owner A.O. Smith promoted ENERGY STAR and educated industry pros on energy efficiency in 2022 by hosting more than 186,000 participants for classes specifically related to high-efficiency products, with an emphasis on ENERGY STAR certified heat pump water heaters. Broan-NuTone Partner of the Year - Sustained Excellence - Product Brand Owner Over the past year, Broan-NuTone introduced six new ENERGY STAR certified range hood models, presented at leading industry conferences, and promoted ENERGY STAR certified fans and range hoods to builders, including a buying group with over 1,400 builders. Andersen Corporation Partner of the Year - Sustained Excellence - Product Brand Owner - Windows, Doors, and Skylights In 2022, Andersen Corporation provided ENERGY STAR themed promotional point-of-purchase\/point-of-sale materials for dealer showrooms and major home improvement retailers in over 1,500 locations with an average of six stock order displays per store, resulting in 18,000 impressions across all the locations. Rheem Manufacturing Company Partner of the Year - Sustained Excellence - Product Brand Owner Rheem debuted the first ENERGY STAR certified 120-volt heat pump water heater in 2022, a ready-to-use, drop-in gas replacement offering 55% savings in energy costs compared to a standard tank-type gas water heater. The company also launched four Innovative Learning Centers and hosting groups of contractors for intensive, hands-on, and virtual trainings on ENERGY STAR products such as tankless and hybrid electric water heaters. L'Image Home Products Partner of the Year - Sustained Excellence - Product Brand Owner In 2022, Montreal-based L’Image Home Products sold enough ENERGY STAR certified bulbs to avoid GHG emissions equivalent to those of approximately 18,000 passenger vehicles driven in one year. Bradford White Corporation Partner of the Year - Sustained Excellence - Product Brand Owner Bradford White successfully drove consumer traffic to the company’s dedicated ENERGY STAR website, which received 13,833 page views in 2022. The company also reached over 2,500 individuals on the benefits of its ENERGY STAR certified heat pump water heaters through in-person training, webinars, LinkedIn, and collateral materials. Emerson Sensi Partner of the Year - Sustained Excellence - Product Brand Owner In 2022, Emerson incorporated a video featuring ENERGY STAR into its Amazon product pages, resulting in 3.2 million consumer impressions. The company also conducted over 1,200 training sessions in 2022 to educate contractors about the value of ENERGY STAR. Greenlite Partner of the Year - Sustained Excellence - Product Brand Owner Lighting manufacturer Greenlite continued to increase energy efficiency in 2022 by delivering ENERGY STAR certified bulbs that far exceed the 100 lumens-per-watt minimum for ENERGY STAR certification. Bosch Home Appliances Partner of the Year - Sustained Excellence - Product Brand Owner In 2022, Bosch Home Appliances incorporated ENERGY STAR and energy efficiency messaging across marketing and communications efforts, including matte releases, broadcast segments, a consumer survey, and a press release—garnering over 4.9B impressions. The company also introduced the 500 Series ENERGY STAR certified refrigerator. Ecobee Partner of the Year - Sustained Excellence - Product Brand Owner Along with providing exceptional support for the ENERGY STAR smart thermostat specification improvement through its unique Donate Your Data program, smart thermostat manufacturer ecobee doubled its lineup of ENERGY STAR certified products and added additional energy-saving features to products already in subscribers’ homes. Google Nest: Energy Partnerships Team Excellence Awards - Product Design In 2022, Google Nest pioneered smart thermostats, was key to the establishment of smart thermostat recognition, and was the first to certify a model as ENERGY STAR. Electrolux Partner of the Year - Product Brand Owner Electrolux, a global appliance company, increased ENERGY STAR certified model offerings by 58% in 2022 and offered ENERGY STAR training sessions to 2,500 internal employees and 20,000 external retailer employees. The Home Depot Partner of the Year - Retailer Throughout 2022, Home Depot offered over $500 million in discounts or markdowns for ENERGY STAR products, making energy-efficient products more attainable for customers.","filter_flag":1}
{"title":"Fact-or-Myth: Bio-based, organic, biodegradable - Cordis News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzEyNTM5Ni1mYWN0b3JteXRoLWJpb2Jhc2VkLW9yZ2FuaWMtYmlvZGVncmFkYWJsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzEyNTM5Ni1mYWN0b3JteXRoLWJpb2Jhc2VkLW9yZ2FuaWMtYmlvZGVncmFkYWJsZdIBAA?oc=5","id":"CBMiVGh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzEyNTM5Ni1mYWN0b3JteXRoLWJpb2Jhc2VkLW9yZ2FuaWMtYmlvZGVncmFkYWJsZdIBAA","guidislink":false,"published":"Thu, 13 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=103, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzEyNTM5Ni1mYWN0b3JteXRoLWJpb2Jhc2VkLW9yZ2FuaWMtYmlvZGVncmFkYWJsZdIBAA?oc=5\" target=\"_blank\">Fact-or-Myth: Bio-based, organic, biodegradable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cordis News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fact-or-Myth: Bio-based, organic, biodegradable - Cordis News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vY29yZGlzLmV1cm9wYS5ldS9hcnRpY2xlL2lkLzEyNTM5Ni1mYWN0b3JteXRoLWJpb2Jhc2VkLW9yZ2FuaWMtYmlvZGVncmFkYWJsZdIBAA?oc=5\" target=\"_blank\">Fact-or-Myth: Bio-based, organic, biodegradable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cordis News<\/font>","source.href":"https:\/\/cordis.europa.eu","source.title":"Cordis News","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Fact-or-Myth: Bio-based, organic, biodegradable What are these terms all about? Climate Change and Environment Society Food and Natural Resources © Daniel Funes Fuentes Bio-based and organic is the same. It’s a myth. Bio-based and organic are not the same. The prefix “bio” means “life” or “living organisms”. It is generally used to indicate biological or natural materials as opposed to synthetic raw materials such as crude oil or natural gas. Instead, the term bio-based refers to the type of raw material used to manufacture a product, and it does not relate to the materials produced. Which means that if a product is bio-based, it is partly or wholly made from biomass, i.e. renewable materials of plant or animal origin. Being labelled as “Bio-based” however, says nothing about how such feedstock has been produced (for example, how plants have been cultivated). To indicate resource-saving and environmentally friendly way of producing resources, the term “organic” is mainly used instead. This particularly applies to the food sector and in agriculture. Not every bio-based product is organic. It’s a fact. A product can be “bio-based” and “organic”, but it does not have to be. Bio-based simply describes the fact that a product or material is of plant or animal origin. “Organic” means that the cultivation of the plants or the keeping of the animals complies with requirements of the European organic farming standard. Bio-based is always (per definition) more environmentally friendly. It’s a myth. Bio-based products are not automatically more sustainable than fossil-based products. When it comes to greenhouse gas emissions and fossil resource consumption, bio-based materials usually perform better than fossil-based ones. Conversely, they mostly do worse in the acidification and eutrophication categories. In addition, factors such as environmental damage from oil drilling or disruption of the ecosystems in mining areas contribute to increasing the environmental impact of oil-based resources. Bio-based means a product is always biodegradable. It’s a myth. Biodegradability is often discussed for plastics, but not all bio-based plastics and products are biodegradable. Biodegradation is the naturally-occurring breakdown of materials by microorganisms such as bacteria and fungi to water and gases such as carbon dioxide (CO2) and methane (CH4) or also new biomass. There is no official definition of biodegradable, in contrast to the term compostable. Since everything eventually biodegrades, even if it takes thousands of years, the claim biodegradable should always come with an explanation of the surrounding environmental conditions (the environmental medium and temperature) under which a product or material biodegrades. Details about different biodegradable and durable bio-based materials can be found in this facts- or-myth post on biodegradability. Biodegradable and compostable are the same. It’s a myth. This one is a bit tricky. Biodegradation is the naturally-occurring breakdown of materials by microorganisms. There is no official definition of biodegradable, in contrast to the term compostable. Composting is the organic recycling process in which organic waste is broken down by microbial digestion to create compost. This means composting is one kind of biodegradation in a specific environment. To go through a composting process, organic waste requires the right level of heat, water and oxygen. When talking about composting of bio-based materials it usually refers to industrial composting. Industrial composting facilities meet the requirements of a controlled environment and high temperatures. Standards (e.g. EN 13432 ) for industrial composting define what conditions a product needs to meet to be called “compostable”, such as disintegration in a defined time, no harmful substances or ecotoxicity. In home composting temperatures are lower and the environment is not controlled. Consequently, the process also works slower under home composting conditions. Keywords biodegradable, biobased, organic","filter_flag":1}
{"title":"These 8 Countries are Embracing Plant-Based Food for the Planet - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5","id":"CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA","guidislink":false,"published":"Tue, 04 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=94, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5\" target=\"_blank\">These 8 Countries are Embracing Plant-Based Food for the Planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"These 8 Countries are Embracing Plant-Based Food for the Planet - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vdmVnbmV3cy5jb20vY291bnRyaWVzLWVtYnJhY2luZy1wbGFudC1iYXNlZC1mb29kLWZvci1wbGFuZXTSAQA?oc=5\" target=\"_blank\">These 8 Countries are Embracing Plant-Based Food for the Planet<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"It’s no secret, global temperatures are soaring. The world’s biggest industries have pumped more and more greenhouse gasses into the atmosphere, and the consequences are becoming difficult to ignore. Last year was fraught with extreme weather events, like heatwaves and devastating floods, and this year, more is coming. In fact, early forecasts suggest that a combination of El Niño and the climate crisis could see temperatures exceed 1.5C of warming this year. The prediction is alarming. But, when it comes to climate crisis mitigation, we’re not totally powerless. As individuals, there are some actions we can take to reduce our own environmental impact. In 2018, the world’s biggest food production analysis, conducted at the University of Oxford, concluded that rejecting resource-intensive and pollutive animal agriculture, and adopting a plant-based diet, was the best way a person could reduce their own carbon footprint. “A vegan diet is probably the single biggest way to reduce your impact on planet Earth, not just greenhouse gases, but global acidification, eutrophication, land use, and water use,” said lead author Joseph Poore at the time. Unsplash But when it comes to climate action, the truth is, the problem is far bigger than individuals. And that means the solution needs to come from higher up. We are, of course, talking about governmental action. There is a long way to go before many countries, particularly those in the West (who are responsible for most of the world’s emissions), can say they have truly done their part to limit emissions and tackle the climate crisis. But, by pushing plant-based food consumption and supporting alternative protein development, some governments (at a local, state, and central level) have started to take important steps—here are eight examples. 1 Germany At the end of 2022, Germany’s federal minister of food and agriculture Cem Özdemir proposed Germany’s new National Nutrition Strategy in a paper titled “Towards the Federal Government’s Nutrition Strategy.” The paper acknowledged that the country’s meat consumption was far too high, both from a nutrition and sustainability standpoint. In 2021, Statista notes that German people ate 55kg of meat per capita—lower than in previous years, but still a significant amount.) “How and what we eat also has far-reaching effects: on the environment, biodiversity, and climate in Germany and worldwide, on animals as our fellow beings, on the agricultural and food industry, and not ultimately on our health and well-being,” the paper noted. It also lays out several goals, including the whole country going carbon neutral by 2045 and ensuring that 30 percent of agricultural goods come from organic farming by 2030, as well as halving food waste in every sector. It noted that to meet these goals, food strategies must embrace seasonal, local, plant-based produce. “The transformation of the entire food system towards a plant-based diet is the most important adjusting screw in the nutrition sector to achieve our national and international climate, biodiversity, and sustainability goals,” the paper continued. Unsplash 2 The US Across the US, several states and major cities have embraced a more plant-forward approach to food. In New York City, for example, public schools launched Vegan Fridays last year. The initiative means that every Friday, 930,000 children are served plant-based meals. And in March 2022, the city, which has its own vegan mayor, Eric Adams, joined 40 states and cities, including Colorado, by declaring March 20 “MeatOut Day.” The initiative was created by the Farm Animal Rights Movement in a bid to educate more people about the benefits of plant-based diets. On the West Coast, California has also been pushing plant-based diets. In July 2022, it became the first state to support plant-based school meals with a $700 million investment. “We are grateful to see both the legislature and the Governor recognize the cultural shift towards plant-based choices by supporting our children to eat healthier, more climate-friendly, and humane diets,” said Judie Mancuso, founder of animal advocacy nonprofit Social Compassion in Legislation, at the time. Elsewhere in the US, new legislation in Illinois, set to go into force this year, means that nearly 2 million children have access to plant-based school lunches. And in May 2022, Washington, DC celebrated its first vegan restaurant week thanks to a proclamation signed by Mayor Murial Bowser. “Whereas plant-centric eating lowers the risk of heart disease, stroke, obesity, and type 2 diabetes, and those conditions disproportionally undermine the health-related quality of life of Black, Indigenous, and people of color (BIPOC) residents of Washington, DC and whereas a global shift toward plant-centric food norms would help lower greenhouse gas emissions, and governments can play a crucial trailblazing role in facilitating such shifts by their citizenry,” Bowser said at the time. 3 Canada In the four years leading up to December 2022, Protein Industries Canada—which has received funding from the Government of Canada and is one of the country’s five Global Innovation Clusters—invested more than $477 million into Canada’s plant-based food sector. “We now have projects that span from British Columbia to Prince Edward Island and beyond,” Bill Greuel, the CEO of Protein Industries Canada, said. “More so, the result of this investment is becoming increasingly tangible, with new ingredients and food products making their way onto grocery shelves and restaurant menus in Canada and beyond.” Also in 2022, the government’s AgriInnovate Program awarded plant-based brand Big Mountain Foods 2 Ltd. more than $1.4 million in funding. 4 Denmark In 2021, the Danish government announced it would be dedicating more than 1.25 billion kroner (around $183 million) to the advancement of the plant-based food sector. The funding was agreed as part of an “unprecedented climate agreement for food and agriculture,” reported the Good Food Institute (GFI) Europe. “With this announcement, Denmark has recognized the huge potential of sustainable proteins to drive down agricultural emissions, and established itself as Europe’s biggest public investor in plant-based innovation,” Acacia Smith, GFI Europe’s policy manager, said at the time. In 2022, Denmark followed up this agreement by investing more than $100 million into its “Plant Fund.” 5Taiwan In January 2023, a new climate bill, which specifically references the promotion of plant-based, low-carbon diets, passed the legislature in Taiwan. The bill, called the Climate Change Response Act, also enshrines the country’s 2050 net zero targets into law. The move was praised by the Environment & Animal Society of Taiwan (EAST), which has campaigned consistently for an update to Taiwan’s laws regarding the role of food in the climate crisis. “As the world comes to grips with the importance of food systems in addressing climate change, we are delighted to see an emphasis on low-carbon diets in Taiwan’s climate legislation,” Wu Hung, EAST’s Chief Executive, said. @punehealthsave 6 India In 2021, a grassroots campaign called The Plant Based Treaty launched for the first time. Designed to accompany the Paris Agreement, the treaty aims to “put food systems at the heart of combatting the climate crisis.” So far, thousands of individuals have endorsed the treaty, as well as 20 cities around the world. While Boynton Beach, FL; Los Angeles, CA; Didim, Turkey; Haywards Heath, England; and Edinburgh, Scotland are among the endorsers, most (15) of the cities and towns on the list are located in India. Gopalpur, a coastal town in Odisha, was the most recent Indian town to endorse the treaty. “We completely agree with the motto ‘eat plants, plant trees,’” Gopalpur’s council said in a message regarding its endorsement. “We believe that shifting towards a plant-based diet can solve the climate crisis.” 7 The Netherlands In 2019, Amsterdam, the capital of the Netherlands, announced that meat would no longer be automatically available at government-catered events, starting in 2020. Instead, all menus are vegetarian by default. “The initiative makes it the individual’s choice of whether to have meat or fish,” Rutger Groot Wassink, the head of operational management, said at the time. “We are turning the norms upside down. The question is no longer, ‘Are you vegetarian?’ but ‘Do you eat meat or fish?’” In 2021, Amsterdam City Council also revealed plans to persuade citizens to go 50-percent plant-based by 2030, and 60-percent plant-based by 2040. Plus in 2022, the central government of the Netherlands showed its support for alternative protein when it allocated €60 Million for the cultivated meat industry (cultivated meat refers to growing meat from cells in laboratories, so it isn’t plant-based, but it is slaughter-free). 8 Finland In 2020, the Finnish government invested $2.4 million into the country’s plant-based meat sector. And, in December 2022, it was revealed that the funding is paying off. The VTT Technical Research Centre of Finland, which is owned by the state, announced that it had developed a new innovative technology that would help to perfect plant-based meat products. Essentially, it combines cellular agriculture techniques with plant-based ingredients, and the result tastes just like animal meat. “Our innovation toolkit allows producers to perfectly recreate the sizzling fat and juicy tenderness of meat like never before,” Nesli Sözer, Research Professor at VTT, said. “By combining our experience in plant-based ingredients, food design, and cellular agriculture, we can create proof-of-concept of prototypes for tasty, identical meat alternatives that are ready to be scaled up for industrial production.”","filter_flag":1}
{"title":"Exxon’s new ‘advanced recycling’ plant raises environmental concerns - The Guardian US","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS91cy1uZXdzLzIwMjMvYXByLzEwL2V4eG9uLWFkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLWVudmlyb25tZW500gFcaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3VzLW5ld3MvMjAyMy9hcHIvMTAvZXh4b24tYWR2YW5jZWQtcmVjeWNsaW5nLXBsYXN0aWMtZW52aXJvbm1lbnQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS91cy1uZXdzLzIwMjMvYXByLzEwL2V4eG9uLWFkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLWVudmlyb25tZW500gFcaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3VzLW5ld3MvMjAyMy9hcHIvMTAvZXh4b24tYWR2YW5jZWQtcmVjeWNsaW5nLXBsYXN0aWMtZW52aXJvbm1lbnQ?oc=5","id":"CBMiXGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS91cy1uZXdzLzIwMjMvYXByLzEwL2V4eG9uLWFkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLWVudmlyb25tZW500gFcaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3VzLW5ld3MvMjAyMy9hcHIvMTAvZXh4b24tYWR2YW5jZWQtcmVjeWNsaW5nLXBsYXN0aWMtZW52aXJvbm1lbnQ","guidislink":false,"published":"Mon, 10 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=100, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS91cy1uZXdzLzIwMjMvYXByLzEwL2V4eG9uLWFkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLWVudmlyb25tZW500gFcaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3VzLW5ld3MvMjAyMy9hcHIvMTAvZXh4b24tYWR2YW5jZWQtcmVjeWNsaW5nLXBsYXN0aWMtZW52aXJvbm1lbnQ?oc=5\" target=\"_blank\">Exxon’s new ‘advanced recycling’ plant raises environmental concerns<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Guardian US<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Exxon’s new ‘advanced recycling’ plant raises environmental concerns - The Guardian US","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS91cy1uZXdzLzIwMjMvYXByLzEwL2V4eG9uLWFkdmFuY2VkLXJlY3ljbGluZy1wbGFzdGljLWVudmlyb25tZW500gFcaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3VzLW5ld3MvMjAyMy9hcHIvMTAvZXh4b24tYWR2YW5jZWQtcmVjeWNsaW5nLXBsYXN0aWMtZW52aXJvbm1lbnQ?oc=5\" target=\"_blank\">Exxon’s new ‘advanced recycling’ plant raises environmental concerns<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Guardian US<\/font>","source.href":"https:\/\/www.theguardian.com","source.title":"The Guardian US","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"ExxonMobil just launched one of the largest chemical recycling plants in North America – but environmental advocates say the technology is a dangerous distraction from the need to reduce plastic production. On the surface, the latest addition to ExxonMobil’s giant petrochemical refinery complex in Baytown, Texas, sounds like it could be a good thing: An “advanced recycling” facility capable of breaking down 36,000 metric tons of hard-to-recycle plastic each year. But plastic waste advocates warn that plants like it do little actual recycling, and instead generate hazardous pollutants while providing cover for oil giants to keep producing millions of tons of new plastic products each year. The facility, which began large-scale operations in December of last year, is one of the largest chemical recycling plants in North America. Chemical recycling works by breaking down plastic polymers into small molecules in order to make new plastics, synthetic fuels and other products. Companies like ExxonMobil have rebranded the technology as “advanced recycling” and are now touting it as the latest hi-tech fix to address the plastic crisis, as traditional, mechanical recycling has failed to slow the tide of plastic piling up in landfills and the ocean. ExxonMobil also says it’s planning to build chemical recycling plants at “many of its other manufacturing sites around the world”. Though it hasn’t committed specific dollar amounts to building new plants, the company is currently assessing locations in Louisiana, Illinois, Belgium, Singapore and elsewhere. By the end of 2026, the oil giant hopes to have enough chemical recycling capacity to process roughly 450,000 metric tons of plastic each year. But that’s a drop in the bucket compared with how much plastic ExxonMobil creates. In 2021 alone, ExxonMobil churned out 6m tons of new single-use plastic, more than any other petrochemical company, according to a recent report by the philanthropic Minderoo Foundation. What’s more, recent research has shown that chemical recycling is worse for the environment than mechanical recycling in terms of greenhouse gas emissions and water use, and in some cases, worse than virgin plastic production. The process ExxonMobil’s Baytown plant uses, called pyrolysis, is often so inefficient that many environmental advocates say it should not be called recycling at all. View image in fullscreen Smoke fills the air at the refinery in Baytown, Texas, in 2021. In that year alone, ExxonMobil churned out 6m tons of new single-use plastic Photograph: Mark Mulligan\/AP Conventional mechanical recycling involves sorting different types of plastic into individual streams that are washed, shredded and melted down to make new products. During this process, the chemical makeup of the plastic remains unchanged, although contaminants can find their way in during the melting and cutting process and the end products have a weaker physical structure. Chemical recycling relies on high heat, pressure or chemical catalysts like enzymes to break down plastic into its molecular building blocks. Those building blocks can then be used to make new products – including new plastics with the same physical structure as the original material. The most commercially widespread chemical recycling technology today is pyrolysis, according to Taylor Uekert, a scientist at the National Renewable Energy Laboratory who studies plastic recycling. Pyrolysis has significant environmental impacts. Plants that use it require large amounts of energy to operate: Uekert found that recycling a kilogram of high-density polyethylene plastic using pyrolysis requires nearly seven times the amount of energy needed to make a kilogram of virgin plastic. Typically, that energy comes from burning fossil fuels, which creates air pollution and planet-heating carbon emissions. Pyrolysis operations can also consume large volumes of water, and they often generate hazardous waste. Overall, Uekert’s research found that the environmental impact of making recycled plastics with pyrolysis is 10 to 100 times greater than virgin plastic production. In a pyrolysis plant, plastic is put in a reactor and subjected to high temperatures (ranging from 300 to 900C) and pressures in the absence of oxygen. This treatment transforms plastic into a synthetic form of crude oil which can be used as a replacement for fossil fuels or to create new plastics. While pyrolysis is able to handle more types of plastic waste than some other chemical recycling technologies, Uekert said it is not typically considered “closed loop” recycling because the fuel it generates is often burned for energy – meaning it can’t be recycled again and again. Although pyrolysis is not the same as incineration, in which waste is burned in the presence of oxygen, environmental advocates often liken pyrolysis to incineration since the end products tend to go up in smoke one way or the other. Chemical recycling “is a way for the industry to continue to expand its plastic production and assuage people’s concerns about plastic waste”, said Veena Singla, a senior scientist at the Natural Resources Defense Council who has analyzed chemical recycling facilities around the US. “They’re trying to put a pretty bow on it.” ExxonMobil’s Baytown recycling plant uses the firm’s proprietary “Exxtend” technology, a pyrolysis-based approach, according to company statements. Reached for comment, an ExxonMobil spokesperson, Julie King, told the Guardian that this process “complements traditional mechanical recycling” by turning hard-to-recycle plastics into raw materials which can be used to make new plastics for food packaging, medical equipment and personal hygiene products. skip past newsletter promotion Sign up to First Thing Free daily newsletter Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion King declined to respond to criticisms about the negative environmental impacts of pyrolysis or answer questions about how much pollution the Baytown recycling plant generates. She also did not confirm the exact name or location of the plant: when asked for any identifying information that could be used to look up its state and federal permits, King simply said that ExxonMobil reports emissions to the US Environmental Protection Agency (EPA) and the state of Texas in a “consistent and timely manner in accordance with all laws, regulations and permits”. King also offered that a third-party analysis by the environmental consulting firm Sphera found that every ton of plastic waste fed through ExxonMobil’s chemical recycling process generates 19 to 49% fewer greenhouse gas emissions than processing the same amount of crude-based feedstocks. (ExxonMobil did not share a copy of a report, and Sphera didn’t answer emails.) She also declined to say how much of the plastic waste fed into the plant would be used to make recycled plastic versus synthetic fuel. An internal analysis shared with the Guardian by the Minderoo Foundation found that if ExxonMobil’s Baytown plant had yields typical of pyrolysis plants, only 23% of the fuel it generates would be used to produce new plastics. The rest would go to other non-plastic applications, like fuel for transportation. Chemical recycling is “deflecting attention away from what we need, which is reducing single-use plastics and a global treaty on plastic waste”, said Phaedra Pezzullo, a professor at the University of Colorado, Boulder who has a book forthcoming on plastics and environmental justice. In an undercover investigation in 2021, Unearthed caught the ExxonMobil lobbyist Keith McCoy on video explaining how the firm uses recycling – including the Baytown plant – to shift the conversation around how to deal with plastic away from reducing consumption. (ExxonMobil’s CEO, Darren Woods, later said that McCoy’s comments “in no way represent the company’s position on a variety of issues”, and the oil company has since parted ways with McCoy.) As the petrochemical industry forges ahead with chemical recycling, the same low-income communities and communities of color that bear the burden of plastic manufacturing are seeing these plants pop up in their backyards. Of the eight chemical recycling facilities operating in the US in 2021, six are located in disproportionately Black and brown communities, according to a report by Singla. Five are in areas with a large number of households living on less than $25,000 a year. View image in fullscreen The refinery in Baytown, Texas. Nearly 20% of the city’s predominately white, working-class residents live in poverty, with a per-capita income of just $25,000. Photograph: Mark Mulligan\/AP The Baytown plant wasn’t included in Singla’s analysis, which only included facilities for which data had been reported to the EPA or state permits were available as of August 2021. But the city, already a hub of petrochemical production, fits the pattern she identified: nearly 20% of its predominantly white, working-class residents live in poverty, with a per-capita income of just $25,000. ExxonMobil’s Baytown complex – which includes the third largest oil refinery in the US and a plant that manufactures 2.3m metric tons of plastic a year – is a major contributor to regional air and water pollution. It also has a long history of emitting chemicals above its permit limits, including the carcinogenic compound benzene. In recent years, ExxonMobil’s Baytown complex has been the site of fires and explosions that have injured workers and triggered shelter-in-place orders for nearby residents. “Exxon has a terrible track record of polluting the Baytown community,” Luke Metzger, the executive director of Environment Texas, told the Guardian. “This false ‘chemical recycling’ will only produce more toxic misery for Baytown.”","filter_flag":1}
{"title":"Can you future-proof a refinery against climate change concerns? Shell thinks so - CBC.ca","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5\" target=\"_blank\">Can you future-proof a refinery against climate change concerns? Shell thinks so<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBC.ca<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Can you future-proof a refinery against climate change concerns? Shell thinks so - CBC.ca","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5\" target=\"_blank\">Can you future-proof a refinery against climate change concerns? Shell thinks so<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBC.ca<\/font>","source.href":"https:\/\/www.cbc.ca","source.title":"CBC.ca","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"On a sunny spring afternoon, Shell's massive Scotford industrial complex northeast of Edmonton heaves with activity. There are dozens of smokestacks in every direction of the plant, which churns out not only gasoline and jet fuel, but propane and other materials, on a site that's larger than downtown Edmonton. Grey and brown steel pipes snake from one building to another and back again, like a spaghetti buffet. About 50 different tanks hold a variety of oils, fuels and gases. At a glance, it's not the kind of facility people might imagine as part of the company's efforts to reduce its carbon emissions. But it is. The refinery is one of five in the world that Shell has selected globally to transform into a low-carbon energy production facility, which the company says it intends to keep operating for decades to come, even as it aims to reach a 2050 goal of net-zero emissions. \"It's the ambition to be here for many decades to come,\" said Mark Pattenden, a senior vice-president with Shell Canada, during an interview at the Scotford facility. The Scotford facility employs 1,500 workers, 500 long-term contractors, and thousands of short-term contractors. (Kyle Bakx\/CBC) 'Top of the policy agenda' Achieving those climate targets — now less than three decades away — while operating such a massive refining operation may seem far-fetched, but the company has begun to take steps toward transforming the facility. It's a common dilemma facing many companies throughout Canada's industrial sector: finding ways to future-proof their business amid increasing concerns about the environment and the harmful effects of climate change around the globe. \"As the pandemic recedes, climate change and the transition to a low-carbon economy will move to the top of the policy agenda,\" said the Canadian Manufacturers and Exporters in a report , noting the transition will be difficult, but has the potential to be rewarding as \"global demand for clean technology is increasing at an explosive rate.\" WATCH | Coast-to-coast clean energy in the federal budget: Federal budget includes plan for clean energy grid Duration 1:43 This week’s federal budget revealed the Liberal Party's plans to provide clean energy from coast to coast. But making that a reality will be a massive undertaking, logistically and politically. Canadian companies are taking different approaches in the face of environmental pressure. Oilsands companies in Alberta are proposing to reach net-zero emissions by 2050 largely through using carbon capture and storage facilities. Last year, Suncor Energy sold its wind and solar business, but wants to expand its biofuel and hydrogen production. Meanwhile, pipeline firm Enbridge is expanding the number of its renewable energy projects including offshore wind, while TC Energy is developing projects like pumped-hydro electricity storage A hydrogen production facility is shown at Shell's Scotford complex. This plant uses water and natural gas to produce hydrogen that is used at the nearby oil refinery. Shell's proposed Polaris project would capture the majority of the carbon dioxide emissions from this hydrogen facility and store the gases in an underground reservoir. (Kyle Bakx\/CBC) Shell's Scotford facility was first built in 1984 as a refinery, and later expanded to add an upgrader to process oilsands bitumen into different types of crude oil. The two plants work together to produce gasoline, diesel and jet fuel, in addition to some gasses such as propane and butane. A petrochemical plant on the site pumps out styrene monomer and ethylene glycol, used in products like food containers, home insulation and antifreeze. The refinery, upgrader and petrochemical plants are all connected, and that level of integration is part of the reason why Scotford was one of the handful of refineries around the world that Shell wants to keep, the company told CBC News. It's also one of its most profitable, they added. Changes underway There is a general plan for Scotford to be re-invented by cutting down on pollution and by producing new types of low-carbon products. There is a specific roadmap to reduce emissions, although company officials are more vague about diversifying its product mix. The first step in cutting emissions came in 2015, when the Quest carbon capture and storage began operating. Annually, it collects about one million tonnes of emissions and pumps the gases into a reservoir several kilometres underground. Recently, a five megawatt solar field was built on site, and Shell has signed a long-term deal to purchase 50 megawatts of electricity from a newly-built nearby wind farm. Construction of a second solar field is underway, officials say, which will produce about 58 megawatts of electricity. Combined, executives say the three projects are expected to cut the amount of pollution produced to power the entire Scotford facility in half. A five megawatt solar field is located near Shell's petrochemical plant. (Kyle Bakx\/CBC) Within the next year, officials say the company will make a final decision on whether to proceed with the Polaris carbon capture and storage project, which would be much larger than the existing Quest facility. For now, the company continues developing the project, such as the detailed designs. The carbon capture projects help cut down on pollution, but considering the size of the facility, they will only put a dent into overall emissions. For now, the Scotford facility will continue to focus on producing oil, fuels and chemicals as there are no specific plans to change the formula. However, Pattenden said the company is exploring whether to branch out into producing other types of low-carbon energy like biofuels, hydrogen, and sustainable aviation fuel. \"They're all in play and they're all things that we're going to be considering,\" said Pattenden. \"There's going to be other opportunities we're going to develop.\" Climate concerns Last month, scientists delivered a \"final warning\" on the climate crisis, calling for immediate action as rising greenhouse gas emissions push the world to the brink of irrevocable damage. At the same time, consumption of oil and gas continues to rise around the globe every year. Since Russia's invasion of Ukraine, there has been an increased focus on energy security and affordability. Previously, Shell has sold refineries in different parts of the world and much of its Alberta oilsands operations, in part, to reduce its emissions. While Shell's divestments help the company reach its climate goals, the facilities are still in operation, just under a different ownership. While some environmental groups want the oilpatch to stop fossil fuel development altogether, others are a bit more nuanced. The world is beginning to move through an energy transition, experts say, as there is a shift from fossil fuels to cleaner sources of fuel and power. For a company to achieve a net-zero emission target, there is no specific game plan to follow as it can be a complex goal to achieve, said Jan Gorski with the Pembina Institute, a clean energy think-tank. Generally, oilpatch producers should invest money toward reducing emissions from existing operations while also diversifying their business — such as expanding into renewable energy and hydrogen production, he said. To determine whether companies could be greenwashing or are earnest in their efforts, Gorski said, he looks at the size of a company's investments. Crude oil is refined into gasoline, diesel, jet fuel, propane and butane at the Scotford complex. (Kyle Bakx\/CBC) \"The key thing to look at is how are they using their money? How are they investing their capital? What percentage of their capital is going toward reducing emissions? What per cent is going toward diversification?\" said Gorski. \"I don't have any hard and fast rules for what's good and what a company should be striving for, but those are the kind of metrics to look at.\" Despite the industry's record profits last year, only about five per cent of worldwide investment by the oilpatch went to wind, solar and other renewable energies in 2022, according to the International Energy Agency , up from one per cent in 2019. Last year, Shell invested about $3.5 billion globally on its renewables and energy-solutions business, which includes a variety of technologies from wind and solar farms, to carbon offsets, carbon capture and biofuels. The level of spending made up about 14 per cent of total capital expenditures last year and executives have said that level of spending will remain steady in 2023. At Scotford, the refinery, upgrader and petrochemicals plant will remain the centrepieces of the facility, even as renewable energy and other additions are made. How quickly Shell offers new products at the site, like biofuels, will depend on demand from their customers, executives say. \"This is how we will move through the energy transition,\" said Pattenden. \"Affordable energy, available energy, but also a decarbonised energy are all going to be really important aspects.\"","filter_flag":1}
{"title":"Semiconductor Consulting & Strategy | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy90ZWNobm9sb2d5LW1lZGlhLXRlbGVjb21tdW5pY2F0aW9ucy9zZW1pY29uZHVjdG9yc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy90ZWNobm9sb2d5LW1lZGlhLXRlbGVjb21tdW5pY2F0aW9ucy9zZW1pY29uZHVjdG9yc9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy90ZWNobm9sb2d5LW1lZGlhLXRlbGVjb21tdW5pY2F0aW9ucy9zZW1pY29uZHVjdG9yc9IBAA","guidislink":false,"published":"Tue, 25 Apr 2023 21:54:14 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=25, tm_hour=21, tm_min=54, tm_sec=14, tm_wday=1, tm_yday=115, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy90ZWNobm9sb2d5LW1lZGlhLXRlbGVjb21tdW5pY2F0aW9ucy9zZW1pY29uZHVjdG9yc9IBAA?oc=5\" target=\"_blank\">Semiconductor Consulting & Strategy | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Semiconductor Consulting & Strategy | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vaW5kdXN0cmllcy90ZWNobm9sb2d5LW1lZGlhLXRlbGVjb21tdW5pY2F0aW9ucy9zZW1pY29uZHVjdG9yc9IBAA?oc=5\" target=\"_blank\">Semiconductor Consulting & Strategy | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Transforming the sales and marketing organization at a semiconductor company. We redesigned our client’s sales and marketing function so it could better serve global customers while at the same time, better utilize its regional teams. The transformation had several components. Among them: striking a balance between accounts hosted centrally and those hosted by the regions, building a unit devoted to customer and sales excellence, reshaping roles and responsibilities, and making it all stick through robust change management. With this foundation in place, the company hopes to accelerate its path to $100 billion in revenue.","filter_flag":1}
{"title":"12 New Staples Are Pushing Farms Into the Future with Vegan Milk, Meat, and Honey - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tdmVnYW4tbWlsay1tZWF0LWhvbmV50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tdmVnYW4tbWlsay1tZWF0LWhvbmV50gEA?oc=5","id":"CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tdmVnYW4tbWlsay1tZWF0LWhvbmV50gEA","guidislink":false,"published":"Thu, 06 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=96, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tdmVnYW4tbWlsay1tZWF0LWhvbmV50gEA?oc=5\" target=\"_blank\">12 New Staples Are Pushing Farms Into the Future with Vegan Milk, Meat, and Honey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"12 New Staples Are Pushing Farms Into the Future with Vegan Milk, Meat, and Honey - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vZnV0dXJlLWZhcm0tdmVnYW4tbWlsay1tZWF0LWhvbmV50gEA?oc=5\" target=\"_blank\">12 New Staples Are Pushing Farms Into the Future with Vegan Milk, Meat, and Honey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Brazil is the most biodiverse country in the world with nearly 50 percent of its land covered by forest. It is also known as one of the world’s top meat producing and consuming countries in the world. The South American country is home to JBS Foods, which has consistently been named as one of the worst polluters with links to illegal deforestation, destruction of wildlife habitats, and recurring corruption. Last month, World Animal Protection released its “Factory Farming Climate Culprits Scorecard” in which JBS ranks the highest in terms of greenhouse gas emissions among the five factory farming giants the animal-rights group analyzed. “JBS is responsible for unspeakable cruelty and the slaughter of billions of thinking, feeling animals each year and is the worst contributor of factory farming greenhouse gas emissions,” Lindsay Oliver, Executive Director, World Animal Protection US, said in a statement. “The company is no stranger to other horrific practices including—false advertising, illegal child labor and labor rights violations, deforestation, and financial bribery.” JBS might be the top polluter but many other animal agriculture companies are contributing to the destruction of the environment and Brazil-based Future Farm is dead set on doing something about it. Future Farm “The Amazon Forest is right in our backyard,” Alexandre Ruberti, CEO of Future Farms US and former Red Bull executive, tells VegNews. “We know firsthand how important it is to protect the environment and create a world where people choose to eat more plants, not animals. So, it’s our mission to change the way the world eats.” Building the farm of the future with vegan food Founded in 2019 by Brazilian entrepreneur Marcos Leta and business partner Alfredo Strechinsky, Future Farm’s mission is encapsulated in its name: to create the farm of the future, where craveable, plant-based products replace the cruel and unstainable animal-derived counterparts of the past. “The farm of the future is one that is environmentally conscious, without sacrificing taste and texture,” Ruberti says. “We know that we can’t keep eating the way we’re eating as a planet to sustain human needs and agriculture.” The company first tackled beef with the launch of its hero product Future Burger, followed by its Future Meatball, Future Beef, and Future Sausage—all of which expanded to the United States in 2021. Future Farm Future Farms’ products are made from non-GMO plant ingredients, including its “3-plant protein,” a blend of pea, soy, and chickpea flour. Together with its proprietary technologies, the plant-based meats are made to compete with animals on every level. The food technology company has its own manufacturing facility, making it agile in product development, whether for its own line or through partnerships. This year, Future Farm is tackling new categories with the launch of Future Chik’n and shelf-stable Future Tuna. Ultimately, it is working on 12 new vegan staples, including honey, milk, hot dogs, and more, to support a transition to a plant-based food system. “As we continue to move forward into the farm of the future, we have to look at consumer demand and respond to that with our offerings,” Ruberti says. “We’re aiming to be the one-stop shop for consumers for all things they could find on a farm.” Future Farm As it continues to grow, Future Farm aims to push the needle forward for plant-based alternatives to take up space alongside animal products, the way that sports drinks cut into the soda category or how electric vehicles moved in on combustion cars. “While it took time and consumer education, both sides are now in the market and sharing the space when they once weren’t,” Ruberti says. The future of burgers While Future Farm has its sights set on delivering new vegan products in many categories, it is also continuing to improve some of its core products as consumer habits continue to evolve. Future Farm And its flagship Future Burger just got a 4.0 makeover. “We know that consumer needs are ever-changing, so as future thinkers, we’re thinking about our products differently,” Ruberti says. “Nutrition is at the forefront, and we’re constantly innovating to make improvements.” The new Future Burger is lower in fat and sodium and features an improved texture and flavor thanks to its proprietary technology which Ruberti says is its “secret sauce.” The company is also working to bring down the price of its plant-based products so that they can truly compete with their animal counterparts. “The category price in comparison to meat has been a challenge, but with new technology and scale, Future Farm will be able to close the gap between animal and plant-based protein in the near future,” Ruberti says. What’s JBS doing to stay competitive when consumers increasingly demand more sustainable proteins? Short answer: nothing. Earlier this year, The National Advertising Division of BBB National Programs ordered JBS to pull its claims of achieving net-zero emissions by 2040 as it found that the meat giant had not implemented any plans to do so. On the flipside, Future Farm’s burger is already miles ahead. Future Farm “Plant-based proteins can be delicious and tasty while also being environmentally friendly and nutritious,” Ruberti says. “In fact, our Future Burger is 100-percent carbon neutral. We’ve partnered with ClimatePartner to offset our carbon footprint by planting trees in the Amazon. Brazil will always inform how we operate as a company.” Since its launch, Future Farm has expanded its distribution to 30 countries and with an entire farm of vegan staples in the works, the company is not quitting anytime soon. “The farm of the future is one where taste and quality don’t have to be sacrificed for sustainability,” Ruberti says.","filter_flag":1}
{"title":"Cummins Inc. and Tata Motors Strengthen Their 30-Year Alliance to Power a Cleaner India With Low- to Zero ... - businesswire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQyNjAwNTE1MS9lbi9DdW1taW5zLUluYy4tYW5kLVRhdGEtTW90b3JzLVN0cmVuZ3RoZW4tVGhlaXItMzAtWWVhci1BbGxpYW5jZS10by1Qb3dlci1hLUNsZWFuZXItSW5kaWEtV2l0aC1Mb3ctLXRvLVplcm8tRW1pc3Npb25zLVRlY2hub2xvZ2llcy1mb3ItTW9iaWxpdHktU29sdXRpb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQyNjAwNTE1MS9lbi9DdW1taW5zLUluYy4tYW5kLVRhdGEtTW90b3JzLVN0cmVuZ3RoZW4tVGhlaXItMzAtWWVhci1BbGxpYW5jZS10by1Qb3dlci1hLUNsZWFuZXItSW5kaWEtV2l0aC1Mb3ctLXRvLVplcm8tRW1pc3Npb25zLVRlY2hub2xvZ2llcy1mb3ItTW9iaWxpdHktU29sdXRpb25z0gEA?oc=5","id":"CBMi0AFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQyNjAwNTE1MS9lbi9DdW1taW5zLUluYy4tYW5kLVRhdGEtTW90b3JzLVN0cmVuZ3RoZW4tVGhlaXItMzAtWWVhci1BbGxpYW5jZS10by1Qb3dlci1hLUNsZWFuZXItSW5kaWEtV2l0aC1Mb3ctLXRvLVplcm8tRW1pc3Npb25zLVRlY2hub2xvZ2llcy1mb3ItTW9iaWxpdHktU29sdXRpb25z0gEA","guidislink":false,"published":"Wed, 26 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=116, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQyNjAwNTE1MS9lbi9DdW1taW5zLUluYy4tYW5kLVRhdGEtTW90b3JzLVN0cmVuZ3RoZW4tVGhlaXItMzAtWWVhci1BbGxpYW5jZS10by1Qb3dlci1hLUNsZWFuZXItSW5kaWEtV2l0aC1Mb3ctLXRvLVplcm8tRW1pc3Npb25zLVRlY2hub2xvZ2llcy1mb3ItTW9iaWxpdHktU29sdXRpb25z0gEA?oc=5\" target=\"_blank\">Cummins Inc. and Tata Motors Strengthen Their 30-Year Alliance to Power a Cleaner India With Low- to Zero ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cummins Inc. and Tata Motors Strengthen Their 30-Year Alliance to Power a Cleaner India With Low- to Zero ... - businesswire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQyNjAwNTE1MS9lbi9DdW1taW5zLUluYy4tYW5kLVRhdGEtTW90b3JzLVN0cmVuZ3RoZW4tVGhlaXItMzAtWWVhci1BbGxpYW5jZS10by1Qb3dlci1hLUNsZWFuZXItSW5kaWEtV2l0aC1Mb3ctLXRvLVplcm8tRW1pc3Npb25zLVRlY2hub2xvZ2llcy1mb3ItTW9iaWxpdHktU29sdXRpb25z0gEA?oc=5\" target=\"_blank\">Cummins Inc. and Tata Motors Strengthen Their 30-Year Alliance to Power a Cleaner India With Low- to Zero ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","source.href":"https:\/\/www.businesswire.com","source.title":"businesswire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"COLUMBUS, Ind.--(BUSINESS WIRE)--Global power leader Cummins Inc. (NYSE: CMI) announced today that it has signed a definitive agreement with Tata Motors Limited (TML), to manufacture a range of low- to zero-emissions technology products in India over the next few years. The definitive agreement was signed by Jennifer Rumsey, President and Chief Executive Officer, Cummins Inc., and Girish Wagh, Executive Director, Tata Motors, at Cummins Inc. headquarters in Columbus, Indiana, USA. Senior officials and dignitaries from Cummins, the company’s India leadership team and Tata Motors were present during the signing of the agreement. Tata Motors and Cummins have a 30-year strong partnership through their joint venture Tata Cummins Private limited (TCPL) in India, established in 1993. The signing of this definitive agreement further strengthens their relationship and is a step forward from the Memorandum of Understanding (MoU) signed between the two organizations in November 2022 to collaborate on the design and development of low- and zero-emissions propulsion technology solutions for commercial vehicles in India. As a part of this agreement, Cummins and TML have set up a new business entity called TCPL Green Energy Solutions Private Limited (GES), a wholly owned subsidiary under the existing joint venture with a focus on the development and manufacturing of sustainable technology products that will include hydrogen-powered internal combustion engines, fuel delivery systems, and battery electric powertrains and fuel cell electric systems through the AcceleraTM by Cummins brand. The low- to zero-emissions technologies developed by TCPL GES will be integrated into both on-highway and off-highway applications for domestic and international markets. This agreement will play a pivotal role in developing sustainable powertrain solutions that will help in mitigating greenhouse gas emissions, improving air quality, and supporting India's net-zero ambitions. After signing the agreement, Jennifer Rumsey, Cummins President, and Chief Executive Officer said, “Progress requires partnership, and I am delighted that we are embarking on this decarbonization journey with our trusted partner of 30 years – Tata Motors. Together, we will advance low- and zero-emissions technologies in a way that is best for our customers, communities, and the planet. By doing so, we are also unlocking new opportunities to innovate for our employees all over the world and those who share our passion for powering a more prosperous world.” Speaking on the occasion, Girish Wagh, Executive Director of Tata Motors said, “Tata Motors is leading the global megatrend of green, smart, and safe mobility in India. Our goal is to achieve net zero emissions by 2045 in the commercial vehicles segment. We are collaborating with partners who believe in this vision and are delighted to further strengthen our three-decade long association with Cummins Inc. Together, we will develop and indigenise smart and green powertrain technologies to create India specific sustainable mobility solutions. Our commitment and proactive actions towards zero-emission technologies will enable customers to progressively and seamlessly transition to cleaner and commercially viable mobility solutions, in the coming years, thus shaping the future of mobility in India.” Expressing his delight on India being one of the first markets to receive Cummins’ Hydrogen engines, Ashwath Ram, Managing Director, Cummins Group in India shared his views, \"I am thrilled about the collaboration between Cummins and Tata Motors, which will provide a significant boost to India's Green Hydrogen Mission, electrification and net zero goals. Our shared vision of a cleaner and greener India is backed by a promising combination of global technological expertise, deep understanding of the Indian market, and robust product development and manufacturing capabilities. As we move forward in our partnership, we will continue to explore new technologies and invest in research and development to commercialize them in the coming years. Our focus is on developing innovative and sustainable solutions that cater to the evolving needs of the Indian Commercial vehicle market, and we are confident that this collaboration will enable us to achieve this goal.” About Cummins Inc. Cummins Inc., a global power technology leader, is a corporation of complementary business segments that design, manufacture, distribute and service a broad portfolio of power solutions. The company’s products range from internal combustion, electric and hybrid integrated power solutions to components including filtration, aftertreatment, turbochargers, fuel systems, controls systems, air handling systems, automated transmissions, electric power generation systems, microgrid controls, batteries, electrolyzers and fuel cell products. Headquartered in Columbus, Indiana (U.S.), since its founding in 1919, Cummins employs approximately 73,600 people committed to powering a more prosperous world through three global corporate responsibility priorities critical to healthy communities: education, environment, and equality of opportunity. Cummins serves its customers online, through a network of company-owned and independent distributor locations, and through thousands of dealer locations worldwide and earned about $2.2 billion on sales of $28.1 billion in 2022. See how Cummins is powering a world that’s always on by accessing news releases and more information at https:\/\/www.cummins.com\/always-on. About Cummins Group in India Cummins in India, a power leader, is a group of complementary business units that design, manufacture, distribute, and service engines and related technologies, including fuel systems, air handling, filtration, emission solutions, and electrical power generation systems. Its technology and pioneering initiatives are bringing innovative solutions and dependable services at the best possible value to users across the country. Its high-performance outlook is based on customer focus, integrity, and capability of its people. Part of the $24 billion Cummins Inc. USA, Cummins in India is a Group of eight legal entities across 200 locations in the country with a combined turnover of ₹24,000 crores in 2022 and employing over 10,000 individuals. About Tata Motors Part of the USD 128 billion Tata group, Tata Motors Limited (NYSE: TTM; BSE: 500570 and 570001; NSE: TATAMOTORS and TATAMTRDVR), a USD 37 billion organization, is a leading global automobile manufacturer of cars, utility vehicles, pick-ups, trucks and buses, offering an extensive range of integrated, smart and e-mobility solutions. With ‘Connecting Aspirations’ at the core of its brand promise, Tata Motors is India’s market leader in commercial vehicles and amongst the top three in the passenger vehicles market. Tata Motors strives to bring new products that fire the imagination of GenNext customers, fuelled by state-of-the-art design and R&D centres located in India, UK, US, Italy, and South Korea. With a focus on engineering and tech enabled automotive solutions catering to the future of mobility, the company’s innovation efforts are focused to develop pioneering technologies that are sustainable as well as suited to evolving aspirations of the market and the customers. The company is pioneering India’s Electric Vehicle (EV) transition and driving the shift towards sustainable mobility solutions by preparing a tailor-made product strategy, leveraging the synergy between the Group companies, and playing an active role liasoning with the Government in developing the policy framework. With operations in India, the UK, South Korea, Thailand, South Africa and Indonesia, Tata Motors’ vehicles are marketed in Africa, Middle East, South & Southeast Asia, Australia, South America, Russia, and other CIS countries. As of March 31, 2022, Tata Motors’ operations include 86 consolidated subsidiaries, two joint operations, four joint ventures and 10 equity-accounted associates, including their subsidiaries, in respect of which the company exercises significant influence.","filter_flag":1}
{"title":"IGI Wins $70 Million to Study Microbiome Engineering for Health, Climate Challenges - Genetic Engineering & Biotechnology News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmdlbmVuZ25ld3MuY29tL2luc2lnaHRzL2lnaS13aW5zLTcwLW1pbGxpb24tdG8tc3R1ZHktbWljcm9iaW9tZS1lbmdpbmVlcmluZy1mb3ItaGVhbHRoLWNsaW1hdGUtY2hhbGxlbmdlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmdlbmVuZ25ld3MuY29tL2luc2lnaHRzL2lnaS13aW5zLTcwLW1pbGxpb24tdG8tc3R1ZHktbWljcm9iaW9tZS1lbmdpbmVlcmluZy1mb3ItaGVhbHRoLWNsaW1hdGUtY2hhbGxlbmdlcy_SAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LmdlbmVuZ25ld3MuY29tL2luc2lnaHRzL2lnaS13aW5zLTcwLW1pbGxpb24tdG8tc3R1ZHktbWljcm9iaW9tZS1lbmdpbmVlcmluZy1mb3ItaGVhbHRoLWNsaW1hdGUtY2hhbGxlbmdlcy_SAQA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmdlbmVuZ25ld3MuY29tL2luc2lnaHRzL2lnaS13aW5zLTcwLW1pbGxpb24tdG8tc3R1ZHktbWljcm9iaW9tZS1lbmdpbmVlcmluZy1mb3ItaGVhbHRoLWNsaW1hdGUtY2hhbGxlbmdlcy_SAQA?oc=5\" target=\"_blank\">IGI Wins $70 Million to Study Microbiome Engineering for Health, Climate Challenges<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Genetic Engineering & Biotechnology News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IGI Wins $70 Million to Study Microbiome Engineering for Health, Climate Challenges - Genetic Engineering & Biotechnology News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LmdlbmVuZ25ld3MuY29tL2luc2lnaHRzL2lnaS13aW5zLTcwLW1pbGxpb24tdG8tc3R1ZHktbWljcm9iaW9tZS1lbmdpbmVlcmluZy1mb3ItaGVhbHRoLWNsaW1hdGUtY2hhbGxlbmdlcy_SAQA?oc=5\" target=\"_blank\">IGI Wins $70 Million to Study Microbiome Engineering for Health, Climate Challenges<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Genetic Engineering & Biotechnology News<\/font>","source.href":"https:\/\/www.genengnews.com","source.title":"Genetic Engineering & Biotechnology News","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"A research initiative co-led by Nobel laureate and CRISPR pioneer Jennifer Doudna, PhD, has been awarded $70 million to address health and climate challenges by combining the genome editing technology with genome-resolved metagenomics through the microbiome. TED’s Audacious Project, a collaborative funding effort designed to help solve grand-scale social impact challenges, will award the $70 million toward “Engineering the Microbiome with CRISPR to Improve our Climate and Health.” Doudna and Jill Banfield, PhD, both of the Innovative Genomics Institute (IGI) at the University of California (UC), Berkeley, are leading the initiative. It was Banfield who first introduced Doudna to the CRISPR field in bacteria at UC Berkeley’s Free Speech Movement Café in 2006. Banfield pioneered the field of community sequencing or metagenomics, while Doudna shared the 2020 Nobel Prize in Chemistry with her former collaborator, Emmanuelle Charpentier, PhD. Doudna and Banfield have led a research group that has developed a method of adding or modifying genes within a community of many different species simultaneously, enabling “community editing” of microbes—a technology capable of both editing and tracking edited microbes within a natural community, such as in the gut. The group detailed how they precisely edited genes directly within complex microbiomes, including model systems that replicated natural soil and infant gut microbiomes, in “Species- and site-specific genome editing in complex bacterial communities,” a paper published in January 2022 in Nature Microbiology. Now, Doudna’s focus on CRISPR and Banfield’s on microbial communities are being combined through the research effort, which aims to apply precision genome editing to microbiomes. The researchers aim to develop a precision microbiome editing platform, and create a new class of products capable of treating and preventing human diseases, as well as reducing greenhouse gas emissions. “We need to understand microbiomes and there’s a huge knowledge gap even in the simplest microbiomes, such as those that are associated with the human infant and infant calf. We really just don’t understand how they work,” Banfield told GEN Edge. “The power that we are pursuing is to use the editing tools to manipulate organisms in the context of microbial communities, to begin to explore in some detail how organisms interact with each other and how they’re interdependent.” That approach, she explained, differs from the historic approach to studying microbes growing by themselves, based on pure culture research. “Our first stage is to begin to explore what functions microbes possess and how they play out. We can do that by using CRISPR-Cas to edit organisms that have not been brought into pure culture,” Banfield continued. “With those tools, we can provide a roadmap or a hypothesis that can be explored in the laboratory, in microbial communities prior to being deployed in actual real-life circumstances.” Targeting childhood asthma The IGI—whose priorities include advancing genome engineering to cure disease and advancing food security—will collaborate with two other UC campuses, UC San Francisco (UCSF) and UC Davis. At all three sites, researchers have identified several health challenges they will work on during the seven years of the research initiative. One challenge is studying whether an inflammatory compound identified by Susan Lynch, PhD, director of the Benioff Center for Microbiome Medicine at UCSF, might be an effective target for treating asthma in children. The compound is produced by gut bacteria in children who develop asthma, and past research by Lynch and colleagues has pinpointed which bacteria produce the greatest concentration of the compound. Researchers will carry out an extensive analysis of fecal samples collected from children up to two years old to study more potential targets. The research has the potential to be applied beyond asthma, Brad Ringeisen, PhD, IGI’s executive director, told GEN Edge. “Our approach might be based on the molecule that she’s looked at, and that specific gene and that specific microbe. But it might also be much more expansive. We’re really trying to expand to almost any disease of inflammation,” Ringeisen said. “We’re really focusing on ways to try to reduce that inflammatory response, which should then reduce the likelihood of developing asthma. But I think it has applications to other diseases of inflammation—things like cardiovascular disease, that are known to be associated with inflammatory markers in the circulatory system as well,” Ringeisen said. “It starts with the characterization of the fecal samples, and then we’ll be able to start going to mice studies, and then ultimately to humans.” Between the fecal sample characterization and mice studies, Banfield emphasized, the microbial communities will be grown in the lab and tested there. “One of the three pillars of the initiative is to be able to cultivate realistic human and calf microbiomes in the laboratory, such that they’re stable and representative,” Banfield said. “And then, we can test the editing tools in the context of those communities and also test the consequences of the edits, so we know how the system works in greater resolution before transitioning into organoids, in mice, and ultimately humans or animals.” Researchers are hoping to expand their studies into calves by year four, then move beyond. If researchers succeed in finding targets, Ringeisen said, “we’re planning to try to start a human trial in year six or year seven.” Metagenomics and CRISPR “You can think of the metagenomics component almost as providing a blueprint or a roadmap, and then the CRISPR toolkit being the laser targeted device that’s able to go in and alter either a specific microbe or a specific gene in the microbe,” Ringeisen said. “One doesn’t work without the other. You need both of them combined.” Another key area of focus for the researchers will be addressing climate change, specifically curbing greenhouse gas emissions from microbiomes. Microbes from livestock, agricultural soils, and landfills emit methane and nitrous oxide—while microbes in the gut are the source of cow burps commonly held as a major source of methane. Microbes are also the source of methane emissions from landfills, waste lagoons, and rice paddies. Over half of human-driven methane emissions are microbial in origin, and the tools needed to deal with problematic microbes at a global scale are lacking or limited: Antibiotics kill both beneficial and harmful bacteria. Probiotics have only shown a limited impact. Fecal transplants have raised concerns over safety and acceptance, though they have shown some promise in specific areas. Researchers reason, therefore, that animal agriculture is key to addressing greenhouse gas emissions, 15% of which come from livestock, making them a key toward a solution. UC Davis researchers Matthias Hess, PhD, and Ermias Kebreab, PhD, the co-principal investigators heading the livestock methane emissions portion of the research initiative, have focused on dietary interventions aimed at reducing greenhouse gas emissions from livestock. One such intervention, red seaweed, has led to significant decreases in methane emissions by lowering the expression of methane-producing genes in specific microbes in the cow’s gut. But providing enough seaweed for daily consumption by the global cattle population—reported at between 942.6 million head (U.S. Department of Agriculture) and 1.5 billion head (World Animal Foundation)—would most likely not work, especially for the grazing cattle that account for most of the world’s livestock. Researchers reason that early intervention with CRISPR, however, could reduce the methane emitted by cows and do so for nearly every calf. “We’re trying to intervene when the calf is born,” Ringeisen said. “The goal is to use these CRISPR tools and these characterization tools to find a stable microbiome that is a low methane microbiome, and then that that would hopefully set the calf to a lifetime of reduced emissions.” “Our partners at UC Davis innovated these feed supplements. But now we’re turning their attention to these CRISPR tools and characterization tools to come up with new strategies, which I think are going to ultimately solve the larger problem which the feed supplements can’t.” Global reach The research group says it will disseminate the data it collects and the tools it develops to the global research community, and work with global nonprofits to help scale its advances. One global nonprofit the group is working with is the Consortium of International Agricultural Research Centers (CGIAR), a global research partnership with which the researchers have agreed to distribute its technologies to low- and middle-income farmers and ranchers. Ringeisen said IGI’s public impact team will work to disseminate new technologies developed by the researchers through models that enable companies to profit in the most developed countries but provide the technologies at cost or lower in developing countries. IGI will soon go public with a task force’s findings on how to broaden access to genomic therapeutics and interventions based on its technologies—and do so affordably. “We’re trying to figure out ways to make these technologies more accessible, so that it can help more people in the world,” Ringeisen said. Researchers hope to avoid with their technologies the years of legal wrangling that has surrounded the development of CRISPR-Cas9, which has been the subject of a bitter legal battle. Last year, the Patent Trial and Appeal Board (PTAB) of the U.S. Patent and Trademark Office (USPTO) sided against UC, Charpentier, and the University of Vienna, issuing a decision maintaining that the Broad Institute had priority in the invention of a single RNA CRISPR-Cas9 system that functions in eukaryotic cells. Beyond legal and logistical issues, an even more basic challenge for researchers is much less discovering what microbes exist than it is learning how they interact in community with other organisms. “We don’t really understand how to read the genome to predict what they’re doing in complete detail,” Banfield acknowledged. “We can predict a lot of the functionalities based on 100 years of laboratory bench work in biochemistry and genetics. But the part that’s minimal and out of view is the set of genes that are involved in interactions with and amongst organisms, because they can’t be probed by pure culture experiments.” “It’s not so much about discovering new organisms, because we’ve gone through that phase,” Banfield added. “It’s about discovering how they work in the context of their communities, and how that leads to manifestations of disease or undesirable ecosystem impacts such as greenhouse gas emissions.”","filter_flag":1}
{"title":"Danfoss Debuts New Line of Liquid-Cooled System Modules at the 2023 Mari-Tech Conference - Automation.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL2FwcmlsLTIwMjMvZGFuZm9zcy1saW5lLWxpcXVpZC1jb29sZWQtc3lzdGVtLW1vZHVsZXMtbWFyadIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL2FwcmlsLTIwMjMvZGFuZm9zcy1saW5lLWxpcXVpZC1jb29sZWQtc3lzdGVtLW1vZHVsZXMtbWFyadIBAA?oc=5","id":"CBMiY2h0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL2FwcmlsLTIwMjMvZGFuZm9zcy1saW5lLWxpcXVpZC1jb29sZWQtc3lzdGVtLW1vZHVsZXMtbWFyadIBAA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL2FwcmlsLTIwMjMvZGFuZm9zcy1saW5lLWxpcXVpZC1jb29sZWQtc3lzdGVtLW1vZHVsZXMtbWFyadIBAA?oc=5\" target=\"_blank\">Danfoss Debuts New Line of Liquid-Cooled System Modules at the 2023 Mari-Tech Conference<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Automation.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Danfoss Debuts New Line of Liquid-Cooled System Modules at the 2023 Mari-Tech Conference - Automation.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL2FwcmlsLTIwMjMvZGFuZm9zcy1saW5lLWxpcXVpZC1jb29sZWQtc3lzdGVtLW1vZHVsZXMtbWFyadIBAA?oc=5\" target=\"_blank\">Danfoss Debuts New Line of Liquid-Cooled System Modules at the 2023 Mari-Tech Conference<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Automation.com<\/font>","source.href":"https:\/\/www.automation.com","source.title":"Automation.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Summary At the Mari-Tech 2023 Conference and Exhibition in Vancouver, British Columbia, April 18-20, Danfoss Power Electronics and Drives segment will debut the iC7 Series liquid-cooled system modules. Danfoss Debuts New Line of Liquid-Cooled System Modules at the 2023 Mari-Tech Conference April 18, 2023 - At the Mari-Tech 2023 Conference and Exhibition in Vancouver, British Columbia, April 18-20, Danfoss Power Electronics and Drives segment will debut the iC7 Series liquid-cooled system modules. The modules combine the world’s highest power density, industry-leading liquid-cooled thermal management, unmatched security and easy system integration to deliver a drive with superior performance and which requires less room—for an industry where space is worth its weight in gold. The iC7 series liquid-cooled system modules deliver world-class precision in motor control and modular control capacity. Secure-by-design, each iC7 drive is equipped with market-leading hardware-based protection against unauthorized access with a built-in crypto chip on the control unit. It uses a microSD card to copy settings, log data, download software and activate additional features – all protected by the crypto chip ensuring end-to-end encrypted data transfer. The iC7-Marine uncovers new marine performance levels, providing customers with confidence when it comes to defense and protection of their business, with the highest quality and reliable ultra-compact drives. In addition to showcasing the next generation of drive technology, Danfoss will also feature VACON NX Series, which has been driving decarbonization through electrification. The Danfoss VACON product line offers a complete range; the DC\/DC converters, drives, active front ends, and grid converters are all based on the same platform and are flexible and scalable. The savings in expensive diesel fuels, zero emissions and much lower operating noise levels are all benefits of an investment in electrification. Retrofitting older vessels with new power systems can help comply with initiatives put forth by many ports and municipalities to decrease carbon emissions and noise volume from vessels. Danfoss helped PortsToronto, which was faced with this challenge and was looking to fully decarbonize and retrofit the formerly diesel-powered Marilyn Bell I ferry. The ferry was retrofitted with the VACON NX Series and experienced a reduction of direct emissions by approximately 530 tons per year. The vessel makes four round trips per hour during a 19-hour day and recharges each time it docks at the mainland via an automated 400 kW pantograph charging system. This created a shore-to-vessel DC connection, the first of its kind in North America, which integrated with the Danfoss electrification system, utilizing the active front end module to convert the AC utility power to DC power for use by the vessel systems. As soon as the vessel docks and the vehicle ramp is lowered, the vessel starts charging via the pantograph, initiated using wireless communication between the vessel and the equipment on shore. From conception to installation, Danfoss’ VACON Common DC-Bus electrification products worked seamlessly to make it possible for the Marilyn Bell I to be powered only by electricity from clean wind and solar sources, eliminating greenhouse gas emissions entirely. The marine industry is getting more intelligent, necessitating drives that come with built-in software capabilities and top-level computing power, including smart algorithms that provide superior speed, torque control and accuracy. No matter what the application, Danfoss can help marine customers improve the efficiency, safety and reliability of their offshore vessels. About Danfoss Danfoss engineers solutions that increase machine productivity, reduce emissions, lower energy consumption and enable electrification. Our solutions are used in such areas as refrigeration, air conditioning, heating, power conversion, motor control, industrial machinery, automotive, marine, and off- and on-highway equipment. We also provide solutions for renewable energy, such as solar and wind power, as well as district-energy infrastructure for cities. Our innovative engineering dates back to 1933. Danfoss is family-owned, employing more than 40,000 people, serving customers in more than 100 countries through a global footprint of 95 factories.","filter_flag":1}
{"title":"To all those lab meat skeptics: Please, just stay out of the way - The Japan Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvb3Bpbmlvbi8yMDIzLzA0LzIxL2NvbW1lbnRhcnkvd29ybGQtY29tbWVudGFyeS9sYWItZ3Jvd24tbWVhdC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvb3Bpbmlvbi8yMDIzLzA0LzIxL2NvbW1lbnRhcnkvd29ybGQtY29tbWVudGFyeS9sYWItZ3Jvd24tbWVhdC_SAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvb3Bpbmlvbi8yMDIzLzA0LzIxL2NvbW1lbnRhcnkvd29ybGQtY29tbWVudGFyeS9sYWItZ3Jvd24tbWVhdC_SAQA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvb3Bpbmlvbi8yMDIzLzA0LzIxL2NvbW1lbnRhcnkvd29ybGQtY29tbWVudGFyeS9sYWItZ3Jvd24tbWVhdC_SAQA?oc=5\" target=\"_blank\">To all those lab meat skeptics: Please, just stay out of the way<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Japan Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"To all those lab meat skeptics: Please, just stay out of the way - The Japan Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvb3Bpbmlvbi8yMDIzLzA0LzIxL2NvbW1lbnRhcnkvd29ybGQtY29tbWVudGFyeS9sYWItZ3Jvd24tbWVhdC_SAQA?oc=5\" target=\"_blank\">To all those lab meat skeptics: Please, just stay out of the way<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Japan Times<\/font>","source.href":"https:\/\/www.japantimes.co.jp","source.title":"The Japan Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Italy’s right-wing government provoked immediate controversy when it proposed banning the production of lab-grown meats to \"safeguard our nation’s heritage.” The farm lobby cheered, scientists protested and the conflict began to sound eerily akin to Europe’s protracted battle over genetically modified crops. I could only think: Here’s another hugely promising technological frontier stymied by false claims and misguided public skepticism. The Italian Parliament should proceed cautiously as it deliberates over whether to approve the ban. Members should heed the objections of European scientists who warn against inhibiting crucial research and development at a time when cellular agriculture is finally poised to hit the global mainstream.","filter_flag":1}
{"title":"Why is recycling so important? The dirty truth behind our trash - ZME Science","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA","guidislink":false,"published":"Fri, 28 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=118, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5\" target=\"_blank\">Why is recycling so important? The dirty truth behind our trash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZME Science<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why is recycling so important? The dirty truth behind our trash - ZME Science","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5\" target=\"_blank\">Why is recycling so important? The dirty truth behind our trash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZME Science<\/font>","source.href":"https:\/\/www.zmescience.com","source.title":"ZME Science","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Facebook X LinkedIn Pinterest Email Recycling is about much more than just reducing the amount of waste sent to the landfill, with a long list of benefits that aren’t limited to the environment — there are economic and social advantages too. Even as we live in a consumer-driven world, with a growing appetite for new things, if we begin to look at the waste created by this level of consumption in a different light, we might turn our problem into an opportunity. Credit Flickr What is recycling? Every day, we produce a vast amount of waste that ends up in landfills or polluting our oceans. From plastic bottles to food packaging, our throwaway culture is taking a toll on the environment. Recycling is one of the most effective ways to reduce the amount of waste that goes to landfills and to mitigate the negative impact on the planet. Whether it’s plastic, paper, or aluminum, the products, and materials that can be used after they fulfill their original purpose are far from worthless. In fact, most materials have great recycling value. The EPA estimates that up to 75% of all the waste can be recycled or repurposed, a figure that shows how impactful the process can be if done right. Almost everything we see around us can be technically recycled, although different materials require different techniques when they are recycled. Most of the commonly recyclable materials include batteries, biodegradable waste, clothing, electronics, garments, glass, metals, paper, plastics, and a lot more. Recycling is the process of separating, collecting, and remanufacturing or converting used or waste products into new materials. But if we want to truly focus on recycling, it’s important to change the way we address it both on a personal and societal level. Recycling helps extend the life and usefulness of something that has already served its initial purpose by returning it to its raw materials and then using those materials to produce something that is usable. It’s part of the three golden rules of sustainability (Reduce, Reuse, and Recycle) and has a lot of benefits both to us humans and to the environment. Virtually all of the environment is impacted by how much we recycle. Benefits of recycling The world’s natural resources are finite, and some are in very short supply. At a fundamental level, recycling paper and wood can save trees and forests, recycling plastic means creating less new polluting plastic, recycling metals means there’s less need for hugely costly mining, and recycling glass reduces the use of new raw materials like sand that affect coastal systems. Of course, the reality of it is much more complex, but the fundamental process is valid nonetheless. Some materials are technically recyclable, but doing so is so expensive it virtually never happens, while other materials retain their properties better than others. Metals, for instance, are repeatedly recyclable, while maintaining most or all of their properties. The most obvious benefit of recycling is the reduction of landfill waste. Landfills are rapidly filling up, and many cities are struggling to find new places to dump their trash. Recycling reduces the amount of waste that goes to landfills, making it a vital solution to the problem of overflowing landfills. When we recycle, we give new life to materials that would otherwise end up in a landfill. Recycling reduces the need to grow, harvest, or extract new raw materials from the Earth. That, in turn, reduces the harmful disruption and damage being done to the natural world, which means fewer forests cut down, rivers diverted, wild animals harmed or displaced, and less pollution. It’s also much better to recycle existing products than to damage someone else’s community or land during the exploration and exploitation of new raw materials. The demand for new goods has led to more of the poorest and most vulnerable people being displaced from their homes or otherwise exploited. Making products from recycled materials typically requires less energy than making them from new raw materials — sometimes it’s a huge difference in energy. For example, producing new aluminum from old products uses 95% less energy than making it from scratch. For steel, the energy saving is around 70%. Recycling paper saves 60% of the energy required to produce new paper from wood pulp. By conserving energy, we reduce the amount of greenhouse gases emitted during the production process. While not always, manufacturing something the second time around usually consumes far less energy. Because recycling means you need to use less energy on sourcing and processing new raw materials, it produces lower carbon emissions, which means it can help with global warming. It also keeps potentially methane-releasing waste out of landfill sites. Overall, reducing carbon dioxide and other greenhouse gases being emitted into the atmosphere is vital to stop climate change. Recycling also makes economic sense. As a rule of thumb, it’s six times cheaper to dispose of recycled waste than general refuse. So, the more you recycle, and the less you put in the bin, the more money is saved — which should be good for households, businesses, and local public services. Recycling food waste and green waste is a great idea too, often generating lots of valuable compost. Recycling can stimulate the economy in multiple ways. The EPA has shown recycling helps to create jobs in both the recycling and manufacturing industries. Recycling companies need workers to collect, sort, and process materials. These jobs can range from manual labor to high-tech positions, providing employment opportunities for people with different levels of education and skill. A 2016 study said recycling activities account in a single year for 757,000 jobs, $36.6 billion in wages, and $6.7 billion in tax revenues. Recycling also helps protect wildlife. When we dispose of waste improperly, it can end up in our oceans and harm marine life. For example, plastic waste can entangle and suffocate sea turtles and other animals. By recycling, we reduce the amount of waste that ends up in our oceans and protect marine life. The steps of recycling Recycling includes three essential steps, which create a continuous loop, represented by the familiar recycling symbol. The first one is to actually collect the recyclables, which can be done in different ways. For example, they can be collected from the curbside, dropped off at centers, or gathered through deposit or refund programs. Following the collection, recyclables are sent to a recovery facility where they are sorted, cleaned, and processed into materials that can be used in manufacturing. Recyclables are then bought and sold just like raw materials would be, and prices go up and down depending on supply and demand. A growing number of products are being manufactured with recycled content. Common household items that contain recycled materials are newspapers, steel cans, plastic laundry detergents, and soft drink containers. Recycled materials are also used in new ways such as recovered glass in asphalt to pave roads. Consumers can help close the recycling loop by buying new products made from recycled materials. There are thousands of products that contain recycled content. When you go shopping, look for products that can be easily recycled and products that contain recycled content. Types of recycled materials It’s important to recycle any materials possible, but one of the most relevant is plastic as it is such a big part of the solid waste that we make. When plastic is sent to a landfill, it does not break down as it’s not biodegradable, and even in ocean water, plastic stays around virtually forever, breaking down into smaller and smaller pieces called microplastics. Most plastics are used only once before they are discarded, known as single-use plastics — this type of single-use plastic is already being banned in many parts of the world. Recycling metal is also very important as it saves energy, reduces emissions, and creates jobs. Using recycled metal, known as scrap metal, instead of new metal reduces mining waste by 97% and saves more than 90% on energy, depending on the material. Recycling metals creates six times more jobs than sending the metals to a landfill. The same applies to paper recycling. One ton of recycled paper saves 17 trees and 7,000 gallons of water. It also saves energy, about 4,000 kilowatts of it, enough t power an average American home for six months. Paper takes up a lot of space in landfills, so the more is recycled the better the landfills operate. Like paper, cardboard recycling uses less water, cuts back on emissions, saves prime real estate in landfills for materials that are not recyclable, and prevents deforestation. It is estimated that recycling one ton of cardboard can save 17 trees from harm, and 7,000 gallons of water. Reduce and reuse You may have heard of “The 3 R’s”: Reduce, Reuse, and Recycle. While recycling is important, the most effective way to reduce waste is to not create it in the first place. Making a new product requires a lot of materials and energy and then the product has to be transported to wherever it will be sold. That means reducing and reusing are also important ways to protect the environment. Image via Wikipedia Commons Some of the ways to reduce and reuse include looking for products that use less packaging, which means less raw materials, buying reusable over disposable items, maintaining and repairing products like clothing so they don’t have to be thrown away, as well as borrowing, renting or sharing items that are used infrequently like tools. Reducing our consumption should be the first step, and reusing also tends to be far more sustainable than recycling. Recycling means turning an item into raw materials which can be used again, either for the same product or a new one, while reusing means using an object as it is, without treatment. The reason why recycling is so important is that it prevents pollution, reduces the need to harvest new raw materials, saves energy, reduces greenhouse gas emissions, saves money, reduces the amount of waste that ends up in landfills, and allows products to be used to their fullest extent. Sounds like a no-brainer, eh? If our society wants to truly reach some level of sustainability, recycling needs to play a core role in that, there’s just no alternative. Was this helpful? Thanks for your feedback!","filter_flag":1}
{"title":"Float Foods Launches Asia's First Plant-Based Poached Egg & Egg Yolk for Food Service - vegconomist - the vegan business magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2Zsb2F0LWZvb2RzLXBsYW50LWJhc2VkLXBvYWNoZWQtZWdnLWVnZy15b2xrL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2Zsb2F0LWZvb2RzLXBsYW50LWJhc2VkLXBvYWNoZWQtZWdnLWVnZy15b2xrL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2Zsb2F0LWZvb2RzLXBsYW50LWJhc2VkLXBvYWNoZWQtZWdnLWVnZy15b2xrL9IBAA","guidislink":false,"published":"Tue, 25 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=115, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2Zsb2F0LWZvb2RzLXBsYW50LWJhc2VkLXBvYWNoZWQtZWdnLWVnZy15b2xrL9IBAA?oc=5\" target=\"_blank\">Float Foods Launches Asia's First Plant-Based Poached Egg & Egg Yolk for Food Service<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Float Foods Launches Asia's First Plant-Based Poached Egg & Egg Yolk for Food Service - vegconomist - the vegan business magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL2Zsb2F0LWZvb2RzLXBsYW50LWJhc2VkLXBvYWNoZWQtZWdnLWVnZy15b2xrL9IBAA?oc=5\" target=\"_blank\">Float Foods Launches Asia's First Plant-Based Poached Egg & Egg Yolk for Food Service<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","source.href":"https:\/\/vegconomist.com","source.title":"vegconomist - the vegan business magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Singapore’s Float Foods is launching two new plant-based alternatives to eggs — OnlyEg Poached Eg and OnlyEg Eg Yolk — for suppliers, F&B businesses, and distributors worldwide. The brand claims the NPDs are Asia’s first commercially available plant-based poached egg and egg yolk for food service. Both OnlyEg products will debut at the Food & Hotel Asia (FHA) exhibition at the Singapore Expo from 25-28 April 2023. “We are thrilled to introduce OnlyEg Poached Eg and Eg Yolk, which are among the first plant-based whole egg available in Asia, at FHA Singapore,” says Vinita Choolani, Founder and CEO of Float Foods. Sustainable alternatives Vinita Choolani founded Float Foods with support from the Temasek Foundation and the Enterprise Singapore Startup Scheme. The plant-based eggs are a sustainable solution to address the environmental impact of egg production, which is a significant source of greenhouse gas emissions in the food industry. “Our mission is to provide sustainable and nutritious food options that are good for the planet and good for the people,” states Choolani. Float Foods is known as Singapore’s fastest-selling plant-based egg brand, offering a range of vegan eggs — OnlyEg Shreds, OnlyEg Omelette, OnlyEg Tamagoyaki, and Asia’s first plant-based whole egg — across Singapore’s hospitality and food service industry. Last September, OnlyEg received the Best Plant-Based Functional Award at the Plant Based Expo in New York City. The brand’s international expansion strategy includes distribution agreements with the UAE’s largest food service distributor, Bidfood Middle East — along with Day Day Cook, Hong Kong’s largest meal kit subscription service, which launched the brand’s eggs on its platform this week. Float Foods has announced other expansion plans for Malaysia, Dubai, and Australia from June 2023. Revolutionizing the alt egg industry Developed by Float Foods’ R&D team using proprietary technology, the new products are legume-based, offering a nutritious protein and dietary fiber source. Additionally, they are cholesterol-free, with over 50% less saturated fats than a chicken egg. Both products are suitable for vegans, vegetarians, those with egg allergies, and health-conscious consumers. OnlyEg Poached Eg offers the food industry an innovative solution that simplifies operations for large chains, hotel breakfast buffets, institutional caterers, and airlines looking to serve plant-based eggs. OnlyEg Eg Yolk replaces egg yolks as an ingredient, allowing chefs to serve a wider variety of plant-based menu options. “We believe that OnlyEg will revolutionize the alternative egg industry and offer a more sustainable and ethical alternative to conventional eggs,” added Choolani.","filter_flag":1}
{"title":"California approves phase-out of large diesel-powered trucks - Vijesti.me","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5","id":"CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz","guidislink":false,"published":"Sat, 29 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=119, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5\" target=\"_blank\">California approves phase-out of large diesel-powered trucks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vijesti.me<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"California approves phase-out of large diesel-powered trucks - Vijesti.me","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vZW4udmlqZXN0aS5tZS93b3JsZC9nbG9idXMvNjU0NDM4L0NhbGlmb3JuaWEtYXBwcm92ZXMtcGhhc2Utb3V0LW9mLWxhcmdlLWRpZXNlbC10cnVja3PSAVVodHRwczovL2VuLnZpamVzdGkubWUvYW1wLzY1NDQzOC9DYWxpZm9ybmlhLWFwcHJvdmVzLXBoYXNlLW91dC1vZi1sYXJnZS1kaWVzZWwtdHJ1Y2tz?oc=5\" target=\"_blank\">California approves phase-out of large diesel-powered trucks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vijesti.me<\/font>","source.href":"https:\/\/en.vijesti.me","source.title":"Vijesti.me","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Across the U.S., transportation contributes the largest share of greenhouse gas emissions, the EPA says, with medium- and heavy-duty trucks accounting for nearly a quarter of those emissions. Disclaimer: The translations are mostly done through AI translator and might not be 100% accurate. New diesel-powered tow trucks and buses will not be sold in California starting in 2036 - a new rule approved by its regulators this Sunday to wean the state off fossil fuels and fight climate change. That rule would refer to exhaust pollution from heavy trucks transporting goods through ports and would require companies to disclose how much they use those trucks as early as 2024. However, that rule cannot be applied without approval from the US Environmental Protection Agency (EPA). However, it is tied to standards the US government approved last month to phase out large diesel-powered box trucks, tow trucks and large buses. If the EPA approves the California rule, other states could later adopt the same standards. California Governor Gavin Newsom, a Democrat, said Friday's decision was an opportunity to \"show the world what real climate action looks like.\" \"We are one step closer to achieving healthier neighborhoods and cleaner air for all Californians,\" he said in a statement. California is approving ambitious emissions standards as part of its broader goal of achieving \"carbon neutrality,\" meaning by 2045 it will remove as much carbon as it emits. Air pollution regulators previously voted to require all new cars, trucks and SUVs to be electric or hydrogen-powered by 2035. And they banned the sale of new products powered by small internal combustion engines, including leaf blowers, lawn mowers and portable generators. The vote on truck emissions came as the California Air Resources Board on Thursday approved a rule to phase out decades-old diesel locomotives and transition to more zero-emissions technology for pogo trains that transport food, lumber, oil and other products. But some in the transportation industry are concerned that the rule will ultimately increase the cost of goods being transported. The American Trucking Association called the rule \"unrealistic.\" The group is concerned about how costly a drastic transition to zero-emission vehicles will be and says the infrastructure to charge such electric vehicles is not ready. \"As it becomes clear that California's rhetoric does not match the technology, we hope the Board will reverse course and allow transportation companies the freedom to choose the clean technologies that work best for their business,\" the group said in a statement. Gas emissions from trucks have been drastically reduced in recent decades, according to the announcement. More than 100 zero-emission truck models are available in North America, state regulators say, and more than 100 others are in production. California's new rule, combined with previous state-approved electric truck regulations, would mean more than 2048 million zero-emissions medium- and heavy-duty trucks operating in the state by 1,6. Across the U.S., transportation contributes the largest share of greenhouse gas emissions, the EPA says, with medium- and heavy-duty trucks accounting for nearly a quarter of those emissions. Heavy-duty vehicles make up about three percent of the vehicles on California's roads, but generate more than half of the nitrogen oxide and fine particulate pollution from diesel, according to the California Air Resources Board. This is because these trucks have diesel engines which, although more powerful than petrol engines, produce more pollution. They also travel much more than passenger vehicles. California has many of these trucks on the road because it has two of the busiest ports in the world: Los Angeles and Long Beach. Of the 10 most ozone-polluted US cities, six are in California, according to the American Pulmonologist Association's State of the Air Report. \"You cannot overstate the importance of the actions being taken in California today from a public health perspective,\" said Will Barrett, national senior director for the association. Sam Wilson, an analyst at the Union of Concerned Scientists, said in a statement that the technology is available to begin the transition to electric trucks. \"We need that standard to accelerate the necessary phase-out of fossil fuel trucks that pollute our air,\" Wilson said. Bonus video:","filter_flag":1}
{"title":"Offshore Wind Power Foundation | Offshore Wind Power Generation Business | New Products | Products & Services ... - jfe-eng.co.jp","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmpmZS1lbmcuY28uanAvZW4vcHJvZHVjdHMvbGlmZS9vd3AwMi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmpmZS1lbmcuY28uanAvZW4vcHJvZHVjdHMvbGlmZS9vd3AwMi5odG1s0gEA?oc=5","id":"CBMiNWh0dHBzOi8vd3d3LmpmZS1lbmcuY28uanAvZW4vcHJvZHVjdHMvbGlmZS9vd3AwMi5odG1s0gEA","guidislink":false,"published":"Mon, 03 Apr 2023 10:45:47 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=3, tm_hour=10, tm_min=45, tm_sec=47, tm_wday=0, tm_yday=93, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmpmZS1lbmcuY28uanAvZW4vcHJvZHVjdHMvbGlmZS9vd3AwMi5odG1s0gEA?oc=5\" target=\"_blank\">Offshore Wind Power Foundation | Offshore Wind Power Generation Business | New Products | Products & Services ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">jfe-eng.co.jp<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Offshore Wind Power Foundation | Offshore Wind Power Generation Business | New Products | Products & Services ... - jfe-eng.co.jp","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3LmpmZS1lbmcuY28uanAvZW4vcHJvZHVjdHMvbGlmZS9vd3AwMi5odG1s0gEA?oc=5\" target=\"_blank\">Offshore Wind Power Foundation | Offshore Wind Power Generation Business | New Products | Products & Services ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">jfe-eng.co.jp<\/font>","source.href":"https:\/\/www.jfe-eng.co.jp","source.title":"jfe-eng.co.jp","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Project Overview The government has set a goal of reducing greenhouse gas emissions to virtually zero by 2050, and offshore wind power generation is expected to play a key role in making renewable energy the main power source. In the \"Overview of the Vision for Offshore Wind Power Industry (1st)\" announced in December 2020, 30 to 45 GW of project formation and a domestic procurement ratio of 60% were set as target by 2040. In the aforementioned background, we launched offshore wind turbine PJ team in April 2021, and started construction of Japan's first monopile type foundation manufacturing plant. Of the foundations for offshore wind turbines, the monopile type foundation consists of a monopile as a column and a transition piece for connection with a tower of the wind turbine. Monopiles and transition pieces are extra-thick, large-diameter, and long, super-heavy objects, and their size makes it difficult to manufacture at existing domestic plants. Once our new plant was completed, it will be Japan's first monopile type foundation manufacturing plant. We will promptly establish a domestic monopile manufacturing base, and in the future, we will add the jacket type foundation, which has already been extensively used in port piers, etc., and aim for a full lineup of all-made-in-Japan fixed-bottom foundations. We will surely respond to the rapidly expanding construction demand for offshore wind power generation and contribute significantly to the realization of carbon neutrality. If you would like to know more about our design technology development of offshore wind power foundation and construction plan of monopile manufacturing plant, please refer to the following JFE Group technical report.","filter_flag":1}
{"title":"Top 10 Best Specialty Chemicals Companies In Europe 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvMTAtc3BlY2lhbHR5LWNoZW1pY2Fscy1jb21wLWV1cm9wZS0yMDIzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvMTAtc3BlY2lhbHR5LWNoZW1pY2Fscy1jb21wLWV1cm9wZS0yMDIzL9IBAA?oc=5","id":"CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvMTAtc3BlY2lhbHR5LWNoZW1pY2Fscy1jb21wLWV1cm9wZS0yMDIzL9IBAA","guidislink":false,"published":"Sun, 02 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=92, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvMTAtc3BlY2lhbHR5LWNoZW1pY2Fscy1jb21wLWV1cm9wZS0yMDIzL9IBAA?oc=5\" target=\"_blank\">Top 10 Best Specialty Chemicals Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Specialty Chemicals Companies In Europe 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvMTAtc3BlY2lhbHR5LWNoZW1pY2Fscy1jb21wLWV1cm9wZS0yMDIzL9IBAA?oc=5\" target=\"_blank\">Top 10 Best Specialty Chemicals Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Specialty chemicals play a crucial role in various industries, from pharmaceuticals to agriculture, and from construction to electronics. These chemicals are used for a specific function and are often tailored to meet the needs of specific industries or applications. They are typically produced in smaller quantities and at a higher cost than commodity chemicals. The demand for specialty chemicals is increasing due to their ability to provide superior performance and features over commodity chemicals. They also help in reducing costs, improving efficiency, and providing enhanced safety in various applications. Some of the key drivers for the growth of the specialty chemicals industry include increasing demand for high-performance materials, growing environmental regulations, and rising consumer awareness about health and safety concerns. In addition, advancements in technology and innovations in the field of chemistry are driving the development of new and improved specialty chemicals. The specialty chemicals industry is highly diverse, with companies ranging from small, niche players to large, multinational corporations. These companies provide a wide range of specialty chemicals, including adhesives, coatings, pigments, and surfactants, among others. The industry is also characterized by a high level of competition, with companies constantly seeking to develop new and innovative products that provide improved performance and features over existing products. In addition, companies are increasingly focused on sustainability and developing products that are environmentally friendly and have a lower impact on the environment. Overall, the specialty chemicals industry is expected to continue to grow in the coming years, driven by increasing demand for high-performance materials, advancements in technology and chemistry, and growing environmental regulations. The industry is also likely to see increased collaboration and partnerships between companies as they seek to develop new and innovative products to meet the needs of various industries and applications. Here are the Top 10 Best Specialty Chemicals Companies in Europe 2023 BASF SE (Germany) – BASF SE is a multinational chemical company based in Germany, with a focus on specialty chemicals, plastics, and performance materials. The company operates in a wide range of sectors, including automotive, construction, and healthcare. BASF SE has a strong reputation for innovation and sustainability and is known for developing environmentally-friendly products. BASF SE is a multinational chemical company headquartered in Ludwigshafen, Germany. It was founded in 1865 and is one of the world’s largest chemical companies with operations in over 80 countries. The company produces a wide range of chemicals, including plastics, coatings, automotive fluids, and industrial chemicals. BASF has a strong presence in Europe, with multiple production sites and research centers throughout the region. The company’s products are used in a variety of industries, including automotive, construction, and agriculture. One of BASF’s key strengths is its focus on sustainability. The company has set ambitious goals to reduce its carbon emissions and has made significant investments in renewable energy and energy efficiency projects. BASF also works closely with its customers to develop more sustainable products and solutions. In addition to its focus on sustainability, BASF has a strong commitment to innovation. The company invests heavily in research and development and has a strong track record of developing new and innovative products. BASF also works closely with its customers to develop customized solutions to meet their specific needs. Overall, BASF is a leading specialty chemicals company in Europe with a strong focus on sustainability and innovation. Clariant AG (Switzerland) – Clariant AG is a Swiss specialty chemicals company that produces a range of chemicals for use in a variety of industries, including automotive, construction, and personal care. The company has a strong focus on sustainability and is committed to reducing its carbon footprint. Clariant AG is a Swiss specialty chemicals company that produces and supplies a range of chemicals, including additives, pigments, and catalysts, to various industries, including plastics, coatings, and personal care. The company operates in four business segments: Care Chemicals, Catalysis, Natural Resources, and Plastics & Coatings. The Care Chemicals segment offers products for personal and home care applications, including surfactants, emulsifiers, and polymers. The Catalysis segment produces catalysts for the chemical and petrochemical industries, as well as for emissions control systems. The Natural Resources segment provides products for the oil and gas industry, such as catalysts and adsorbents. The Plastics & Coatings segment supplies products for the plastics, coatings, and printing industries. Clariant is committed to sustainability and operates under a sustainability strategy called “Sustainability for Clariant and Society”. This strategy includes goals such as reducing greenhouse gas emissions, improving resource efficiency, and promoting the use of renewable raw materials. The company has a global presence and operates in more than 50 countries. It has approximately 13,000 employees and generated sales of CHF 3.86 billion in 2020. Evonik Industries AG (Germany) – Evonik Industries AG is a German specialty chemicals company that produces a range of chemicals for use in industries such as automotive, construction, and healthcare. The company is known for its focus on innovation and sustainability and has developed a range of products that are both environmentally-friendly and highly effective. Arkema SA (France) – Arkema SA is a French chemical company that specializes in the production of specialty chemicals, including polymers, resins, and adhesives. The company operates in a range of sectors, including automotive, construction, and electronics, and is known for its innovative approach to product development. Arkema SA is a French specialty chemicals and advanced materials company that operates in more than 50 countries across the globe. With a history dating back over 60 years, Arkema has grown into a major player in the chemical industry and is widely recognized for its innovative and sustainable products. The company is divided into three main segments: High-Performance Materials, Industrial Specialties, and Coating Solutions. Arkema’s High-Performance Materials division is focused on the development and production of advanced materials used in a variety of industries such as aerospace, automotive, electronics, and oil and gas. This segment includes products such as fluoropolymers, thermoplastic resins, and specialty polyamides, which offer superior mechanical and thermal properties compared to traditional materials. The Industrial Specialties segment of Arkema is focused on providing customized solutions for specific customer needs. This segment includes products such as acrylics, biochemicals, and additives used in a wide range of applications, including adhesives, construction, and water treatment. Finally, the Coating Solutions segment is focused on providing specialty coatings for various industries such as automotive, architecture, and packaging. Arkema’s coating solutions offer enhanced properties such as improved scratch resistance, durability, and water repellency. Arkema has a strong commitment to sustainability and has implemented several initiatives to reduce its environmental footprint, including reducing its energy consumption and greenhouse gas emissions. The company is also committed to developing sustainable products and has set several ambitious sustainability goals, including reducing its CO2 emissions and increasing the use of renewable energy sources. Overall, Arkema’s focus on innovation and sustainability has helped the company establish itself as a leading player in the specialty chemicals industry, and its continued commitment to these principles is likely to drive its future growth and success. Solvay SA (Belgium) – Solvay SA is a Belgian chemical company that produces a range of specialty chemicals for use in industries such as automotive, construction, and healthcare. The company is known for its focus on sustainability and has developed a range of environmentally-friendly products that are highly effective. Solvay SA is a Belgian chemical company that produces a wide range of specialty chemicals. The company is a global leader in the production of soda ash and hydrogen peroxide, as well as specialty polymers, surfactants, and fluorinated compounds. Solvay operates in a number of markets, including aerospace, automotive, consumer goods, electronics, and healthcare. Some of the key products offered by Solvay include high-performance plastics, agrochemicals, and advanced materials for the aviation and aerospace industries. In addition to its focus on developing innovative products, Solvay is also committed to sustainability and environmental responsibility. The company has set ambitious sustainability goals, including reducing its carbon footprint, increasing its use of renewable energy, and reducing its water consumption. Solvay has also implemented a number of programs to promote sustainable practices throughout its supply chain. Overall, Solvay is widely recognized as a leading provider of specialty chemicals, with a strong reputation for innovation and sustainability. The company’s products are used in a wide range of applications, and it is well-positioned to continue to grow and expand its presence in the global chemicals industry. Croda International Plc (UK) – Croda International Plc is a UK-based specialty chemicals company that produces a range of chemicals for use in industries such as automotive, construction, and personal care. The company has a strong focus on sustainability and is committed to reducing its carbon footprint. Croda International Plc is a UK-based specialty chemicals company that produces and sells a wide range of chemicals and ingredients to various industries. It operates in four main segments: Personal Care, Life Sciences, Performance Technologies, and Industrial Chemicals. Croda’s products are used in a variety of applications, including skincare, haircare, makeup, fragrances, pharmaceuticals, food and beverage, and lubricants. Croda’s Personal Care segment provides ingredients for skincare, haircare, and cosmetics. It offers products such as moisturizers, emulsifiers, and surfactants. The Life Sciences segment produces ingredients used in pharmaceuticals and biotechnology. The Performance Technologies segment provides materials used in coatings, polymers, and various industrial applications. The Industrial Chemicals segment produces specialty chemicals used in a range of industrial applications. Croda is committed to sustainability and is focused on reducing its environmental impact. It has set targets to reduce its greenhouse gas emissions, waste, and water use. The company is also working to source sustainable raw materials and to ensure that its products are safe for the environment. Croda operates globally and has a strong presence in Europe, Asia, and North America. Its customers include some of the world’s leading consumer goods companies, as well as smaller niche players in various industries. The company’s mission is to be a leader in sustainable innovation and to provide high-quality products and services to its customers. Wacker Chemie AG (Germany) – Wacker Chemie AG is a German chemical company that specializes in the production of specialty chemicals, including polymers, resins, and adhesives. The company operates in a range of sectors, including automotive, construction, and healthcare, and is known for its innovative approach to product development. Wacker Chemie AG is a leading German specialty chemical company that produces a wide range of products including silicone fluids, sealants, resins, and emulsions. It has a global presence with production sites in Europe, Asia, and the Americas. The company serves various industries including automotive, construction, and electronics. Wacker Chemie AG has a strong focus on sustainability and aims to be carbon neutral by 2050. It has developed innovative products such as silicones for electric cars and water-based silicone emulsions that are used in the paper industry. The company also invests heavily in research and development to develop new products and applications. Wacker Chemie AG has received numerous awards for its innovative products and sustainability efforts, including the 2020 German Sustainability Award in the category of Resource Efficiency. The company has also been recognized as one of the world’s most sustainable companies by Corporate Knights, a Canadian media company that focuses on corporate sustainability. Lanxess AG (Germany) – Lanxess AG is a German chemical company that produces a range of specialty chemicals for use in industries such as automotive, construction, and personal care. The company has a strong focus on sustainability and is committed to reducing its carbon footprint. Lanxess AG is a German specialty chemicals company with headquarters in Cologne, Germany. The company was founded in 2004 as a spin-off from the chemicals division of Bayer AG. Lanxess focuses on the development, manufacturing, and marketing of specialty chemicals, with a particular focus on plastics, rubber, and specialty chemicals for the automotive, construction, and electronics industries. The company has a strong focus on sustainability and has set ambitious sustainability goals, including carbon neutrality by 2040. Lanxess has a global presence with production sites in Europe, Asia, and the Americas. The company’s product portfolio includes high-performance plastics, rubber, and specialty chemicals such as flame retardants, lubricants, and functional additives. Some of the company’s most well-known products include the high-performance plastics Durethan and Pocan, as well as the synthetic rubber Keltan. Lanxess has received several awards for its sustainability efforts, including a Gold rating in the Sustainability Yearbook 2021, published by S&P Global, and a Platinum rating in the 2020 EcoVadis Sustainability Ratings. The company is also committed to promoting diversity and inclusion and has set a target to increase the proportion of women in management positions to 30% by 2025. In addition to its focus on sustainability, Lanxess has also been investing in digitalization to increase efficiency and optimize production processes. The company has implemented a digitalization strategy that includes the use of advanced analytics, artificial intelligence, and the Internet of Things (IoT) to improve process control and increase operational efficiency. Overall, Lanxess is a leading player in the specialty chemicals industry with a strong focus on sustainability and digitalization. The company’s innovative products and commitment to sustainability make it a key player in the global chemicals market. Brenntag AG (Germany) – Brenntag AG is a German chemical distribution company that supplies a range of specialty chemicals to industries such as automotive, construction, and healthcare. The company is known for its focus on sustainability and has developed a range of environmentally-friendly products. Brenntag AG is a leading distributor of specialty chemicals and ingredients headquartered in Germany. With operations in more than 77 countries, the company has a broad product portfolio that includes over 10,000 chemicals and ingredients from more than 1,000 suppliers. Brenntag serves a wide range of industries, including food and beverage, personal care, pharmaceuticals, water treatment, and more. The company’s services include product development, formulation, blending, repackaging, and storage. Brenntag’s commitment to sustainability and responsible business practices has been recognized by various organizations. The company was named one of the world’s most ethical companies by Ethisphere Institute for six consecutive years, and it has received several awards for its sustainability efforts, including a Gold rating by EcoVadis. In recent years, Brenntag has expanded its operations through strategic acquisitions, including the acquisition of the chemical distribution business of Canada Colors and Chemicals Ltd. and the acquisition of Petra Chemical Company in the Middle East. With a strong focus on customer satisfaction and sustainability, Brenntag continues to be a leading distributor of specialty chemicals and ingredients in Europe and beyond. Ciech SA (Poland) – Ciech SA is a Polish chemical company that produces a range of specialty chemicals for use in industries such as automotive, construction, and personal care. The company has a strong focus on sustainability and is committed to reducing its carbon footprint. Ciech SA is a Polish specialty chemicals company founded in 1945. The company specializes in the production of soda ash, salt, sodium bicarbonate, and other chemical products. Ciech SA has a strong presence in Europe, but also exports to more than 100 countries around the world. Ciech SA’s main product, soda ash, is used in the production of glass, detergents, and chemicals, making it an essential material in many industrial processes. The company also produces salt, which is used in various applications, such as food preservation, water softening, and the production of detergents. Ciech SA is committed to sustainability and has implemented various measures to reduce its environmental impact. For example, the company uses a closed-loop production process for soda ash, which recycles wastewater and reduces the amount of waste generated. Additionally, Ciech SA has invested in renewable energy sources, such as wind farms, to reduce its carbon footprint. Overall, Ciech SA is a leading player in the European specialty chemicals industry, with a strong focus on sustainability and innovation. The company’s commitment to reducing its environmental impact makes it an attractive partner for customers looking to adopt more sustainable practices in their own operations.","filter_flag":1}
{"title":"Top 10 Best Laundry Companies In Europe 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvbGF1bmRyeS1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvbGF1bmRyeS1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvbGF1bmRyeS1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA","guidislink":false,"published":"Mon, 10 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=100, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvbGF1bmRyeS1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Laundry Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Laundry Companies In Europe 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvbGF1bmRyeS1jb21wYW5pZXMtaW4tZXVyb3BlLTIwMjMv0gEA?oc=5\" target=\"_blank\">Top 10 Best Laundry Companies In Europe 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Greenhouse Gas Emissions\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"List of the top laundry companies in Europe in 2021 based on their popularity, revenue, and customer satisfaction. It’s important to note that rankings may vary from year to year based on various factors, including changes in the market, customer preferences, and company performance. Here are the top 10 laundry companies in Europe in 2021: Unilever: Unilever is a multinational consumer goods company that owns several laundry brands, including Persil, Omo, and Surf. The company is headquartered in the UK and operates in over 190 countries. Unilever is a British-Dutch multinational company that specializes in consumer goods. The company was formed in 1929 through the merger of two companies: Lever Brothers, a British soap maker, and Margarine Unie, a Dutch margarine producer. Unilever is headquartered in London, UK, and Rotterdam, the Netherlands, and operates in more than 190 countries worldwide. Unilever’s product portfolio includes a wide range of consumer goods such as food, beverages, cleaning agents, and personal care products. Some of the company’s well-known brands include Axe, Dove, Hellmann’s, Knorr, Lipton, Magnum, and Ben & Jerry’s . Unilever has a strong focus on sustainability a nd is committed to reducing its environmental impact and improving the lives of people around the world. In recent years, Unilever has made several strategic moves to strengthen its portfolio and focus on higher-growth categories. In 2017, the company acquired the personal care and home care brands of Quala, a Latin American consumer goods company. In 2018, Unilever acquired the healthy snack company Graze and the premium tea company Pukka Herbs. In 2020, Unilever announced plans to unify its dual-headed structure and become a single company based in London. Unilever is also committed to making a positive social impact and has several initiatives aimed at promoting sustainability and social responsibility. The company has set ambitious targets to reduce its environmental footprint, such as its goal to achieve zero net deforestation in its supply chain by 2023. Unilever also supports several social initiatives, such as its partnership with the World Food Programme to improve the nutrition of children in developing countries and its commitment to providing safe drinking water to millions of people around the world through its Pureit water purifier brand. Overall, Unilever is a global leader in consumer goods with a strong focus on sustainability and social responsibility. The company’s commitment to making a positive impact on the world, combined with its diverse portfolio of well-known brands, makes it a popular choice for consumers around the globe. Procter & Gamble: Procter & Gamble is an American multinational consumer goods company that owns several laundry brands, including Tide, Ariel, and Dash. The company has operations in over 80 countries, including several in Europe. P&G produces and markets a wide range of household and personal care products, including laundry detergent, cleaning products, shampoo, and baby care items. The company’s well-known brands include Tide, Crest, Pampers, and Gillette. P&G’s success can be attributed to its focus on innovation and marketing. The company invests heavily in research and development, constantly striving to create new and improved products that meet the changing needs of consumers. P&G’s marketing campaigns are also known for their effectiveness, with the company’s advertisements often becoming cultural touchstones. In addition to its focus on innovation and marketing, P&G places a strong emphasis on corporate social responsibility. The company has set ambitious sustainability goals, including a commitment to power all of its plants with 100% renewable energy by 2030. P&G also works to improve the communities in which it operates, through initiatives such as its Children’s Safe Drinking Water program, which has provided clean drinking water to millions of people in developing countries. P&G’s success has not gone unnoticed, and the company has received numerous accolades over the years. In 2021, P&G was named one of the World’s Most Admired Companies by Fortune magazine, and it has consistently been recognized as a top employer for diversity and inclusion. Overall, Procter & Gamble is a leading player in the consumer goods industry, with a strong focus on innovation, marketing, and corporate social responsibility. Its well-known brands and commitment to sustainability and social causes have earned it a reputation as a responsible and successful corporation. Henkel: Henkel is a German chemical and consumer goods company that owns several laundry brands, including Persil, Purex, and Dixan. The company operates in over 75 countries worldwide. Reckitt Benckiser: Reckitt Benckiser is a British multinational consumer goods company that owns several laundry brands, including Vanish, Woolite, and Calgon. The company operates in over 60 countries worldwide. Colgate-Palmolive: Colgate-Palmolive is an American multinational consumer goods company that owns several laundry brands, including Ajax, Fab, and Dynamo. The company operates in over 80 countries, including several in Europe. The company’s product portfolio includes several well-known brands such as Colgate, Palmolive, Speed Stick, and Hill’s Science Diet. Colgate-Palmolive’s Oral Care segment produces and markets toothpaste, toothbrushes, mouthwash, and other oral care products. The company’s Personal Care segment produces and markets soaps, shower gels, deodorants, and other personal care products. Colgate-Palmolive has a strong focus on research and development, with a significant portion of its revenue being reinvested in developing new products and technologies. For example, the company has developed several innovative kinds of toothpaste, such as Colgate Total and Colgate Sensitive Pro-Relief, which offer advanced protection against gum disease and sensitivity. The company also places a strong emphasis on sustainability and has implemented several initiatives to reduce its environmental impact. Colgate-Palmolive has a goal to achieve zero waste to landfill by 2025 and has implemented several initiatives to reduce water usage and promote sustainable packaging. In addition to its commitment to sustainability, Colgate-Palmolive also has several initiatives aimed at promoting corporate social responsibility. The company has a strong commitment to diversity and inclusion in the workplace and has implemented several programs to support employee development and well-being. Colgate-Palmolive also has a strong commitment to giving back to communities and has implemented several initiatives to support education, health, and other social causes around the world. In summary, Colgate-Palmolive is a global leader in personal care and oral care products with a strong focus on research and development, sustainability, and corporate social responsibility. The company’s well-known brands, commitment to innovation and sustainability, and emphasis on corporate social responsibility make it a popular choice for consumers around the world. SCA: SCA is a Swedish multinational consumer goods company that owns several laundry brands, including Persil, Breeze, and Skip. The company has operations in over 100 countries worldwide. SCA is a Swedish multinational consumer goods company that owns several laundry brands, including Persil, Breeze, and Skip. The company has operations in over 100 countries worldwide. SCA is a multinational corporation from Sweden that specializes in personal care, tissue, and forest products. The company was established in 1929 and is headquartered in Stockholm, Sweden. SCA has three business areas: Personal Care, Tissue, and Forest Products. SCA’s Personal Care business area produces and markets a wide range of personal hygiene products, including incontinence products, baby diapers, feminine care products, and wet wipes. Some of the company’s well-known brands in this area include TENA, Libresse, and Libero. SCA’s Tissue business area produces and markets tissue products such as toilet paper, paper towels, and napkins. Some of the company’s well-known brands in this area include Velvet, Plenty, and Tork. SCA’s Forest Products business area produces and markets forest products such as wood, pulp, and kraft liner. The company places a strong emphasis on sustainability and responsible forest management practices. All of its wood and pulp products are certified according to international standards. SCA operates in more than 100 countries worldwide and employs approximately 44,000 people. The company has a strong commitment to sustainability and has set ambitious goals to reduce its environmental impact, including a target to cut greenhouse gas emissions by 25% by 2020. In 2017, SCA announced that it would divide into two separate publicly listed companies: one focusing on hygiene and health products, and the other on forest products. The split was finalized in 2018, and Essity became the new name for the hygiene and health products company. Kao Corporation: Kao Corporation is a Japanese chemical and consumer goods company that owns several laundry brands, including Attack, Ariel, and Bold. The company operates in over 30 countries, including several in Europe. Kao Corporation is a Japanese multinational company that specializes in the manufacture and sale of personal care, cosmetic, and cleaning products. The company was founded in 1887 and is headquartered in Tokyo, Japan. Kao operates in over 80 countries around the world and employs approximately 33,000 people. Kao’s product portfolio includes a wide range of personal care products such as hair care, skincare, and oral care products. Some of the company’s well-known brands include Bioré, Jergens, John Frieda, and Molton Brown. Kao is also a major player in the cosmetics industry with several brands such as Kanebo, Sofina, and Kate Tokyo. Kao’s Cleaning Products division produces and markets a variety of cleaning products such as laundry detergent, dishwashing liquid, and household cleaners. The company’s well-known brands in this area include Attack, Magiclean, and Quickle. Kao has a strong focus on sustainability and has set ambitious targets to reduce its environmental impact. The company has a goal to achieve net-zero greenhouse gas emissions by 2050 and to use only renewable electricity by 2030. Additionally, Kao is committed to reducing waste and promoting circular economy principles throughout its operations. Innovation is also a key focus for Kao, with the company investing heavily in research and development. Kao has established several research and development centers around the world to develop new products and technologies. Kao also places a strong emphasis on corporate social responsibility and has several initiatives aimed at promoting social and environmental sustainability. The company has a partnership with UNICEF to improve the lives of children in developing countries and has also implemented several programs to support diversity and inclusion in the workplace. In summary, Kao Corporation is a global leader in personal care, cosmetic, and cleaning products with a strong focus on sustainability, innovation, and corporate social responsibility. The company’s well-known brands, commitment to sustainability, and emphasis on research and development make it a popular choice for consumers around the world. Church & Dwight: Church & Dwight is an American consumer goods company that owns several laundry brands, including Arm & Hammer, OxiClean, and Xtra. The company has operations in several countries worldwide, including several in Europe. Church & Dwight is an American multinational consumer goods company that produces and markets a wide range of household and personal care products. The company was founded in 1846 and is headquartered in Ewing, New Jersey. Church & Dwight operates in more than 100 countries worldwide and employs approximately 4,700 people. The company’s product portfolio includes several well-known brands such as Arm & Hammer, Trojan, OxiClean, and First Response. Church & Dwight’s Household Products segment produces and markets a range of cleaning products, including laundry detergents, fabric softeners, and cleaning sprays. The company’s Personal Care segment produces and markets a range of personal care products, including oral care products, deodorants, and hair care products. Church & Dwight has a strong focus on innovation and research and development. The company invests heavily in developing new products and technologies to meet the changing needs of consumers. For example, the company has developed several innovative laundry detergents such as Arm & Hammer Power Paks and OxiClean White Revive Laundry Stain Remover. The company also places a strong emphasis on sustainability and has implemented several initiatives to reduce its environmental impact. Church & Dwight has a goal to reduce its greenhouse gas emissions by 10% by 2025 and has implemented several initiatives to reduce waste and promote recycling. In addition to its commitment to sustainability, Church & Dwight also has several initiatives aimed at promoting corporate social responsibility. The company has a strong commitment to diversity and inclusion in the workplace and has implemented several programs to support employee development and well-being. In summary, Church & Dwight is a global leader in household and personal care products with a strong focus on innovation, sustainability, and corporate social responsibility. The company’s well-known brands, commitment to innovation and sustainability, and emphasis on corporate social responsibility make it a popular choice for consumers around the world. Seventh Generation: Seventh Generation is an American company that specializes in eco-friendly and sustainable products, including Seventh Generation is an American company that specializes in eco-friendly and sustainable products, including laundry detergent. The company has operations in several countries worldwide, including several in Europe.","filter_flag":1}
