{"title":"Labelexpo 2023: Heidelberg and Gallus showcase three new products - printweek","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2xhYmVsZXhwby0yMDIzLWhlaWRlbGJlcmctYW5kLWdhbGx1cy1zaG93Y2FzZS10aHJlZS1uZXctcHJvZHVjdHMtNTc5MjTSAWpodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9sYWJlbGV4cG8tMjAyMy1oZWlkZWxiZXJnLWFuZC1nYWxsdXMtc2hvd2Nhc2UtdGhyZWUtbmV3LXByb2R1Y3RzLTU3OTI0P2FtcD0x?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2xhYmVsZXhwby0yMDIzLWhlaWRlbGJlcmctYW5kLWdhbGx1cy1zaG93Y2FzZS10aHJlZS1uZXctcHJvZHVjdHMtNTc5MjTSAWpodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9sYWJlbGV4cG8tMjAyMy1oZWlkZWxiZXJnLWFuZC1nYWxsdXMtc2hvd2Nhc2UtdGhyZWUtbmV3LXByb2R1Y3RzLTU3OTI0P2FtcD0x?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2xhYmVsZXhwby0yMDIzLWhlaWRlbGJlcmctYW5kLWdhbGx1cy1zaG93Y2FzZS10aHJlZS1uZXctcHJvZHVjdHMtNTc5MjTSAWpodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9sYWJlbGV4cG8tMjAyMy1oZWlkZWxiZXJnLWFuZC1nYWxsdXMtc2hvd2Nhc2UtdGhyZWUtbmV3LXByb2R1Y3RzLTU3OTI0P2FtcD0x","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2xhYmVsZXhwby0yMDIzLWhlaWRlbGJlcmctYW5kLWdhbGx1cy1zaG93Y2FzZS10aHJlZS1uZXctcHJvZHVjdHMtNTc5MjTSAWpodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9sYWJlbGV4cG8tMjAyMy1oZWlkZWxiZXJnLWFuZC1nYWxsdXMtc2hvd2Nhc2UtdGhyZWUtbmV3LXByb2R1Y3RzLTU3OTI0P2FtcD0x?oc=5\" target=\"_blank\">Labelexpo 2023: Heidelberg and Gallus showcase three new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">printweek<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Labelexpo 2023: Heidelberg and Gallus showcase three new products - printweek","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2xhYmVsZXhwby0yMDIzLWhlaWRlbGJlcmctYW5kLWdhbGx1cy1zaG93Y2FzZS10aHJlZS1uZXctcHJvZHVjdHMtNTc5MjTSAWpodHRwczovL3d3dy5wcmludHdlZWsuaW4vbmV3cy9sYWJlbGV4cG8tMjAyMy1oZWlkZWxiZXJnLWFuZC1nYWxsdXMtc2hvd2Nhc2UtdGhyZWUtbmV3LXByb2R1Y3RzLTU3OTI0P2FtcD0x?oc=5\" target=\"_blank\">Labelexpo 2023: Heidelberg and Gallus showcase three new products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">printweek<\/font>","source.href":"https:\/\/www.printweek.in","source.title":"printweek","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly innovations\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"During Labelexpo Europe 2023, Heidelberg and its subsidiary Gallus presented various digital solutions that promote automation within the print industry. These systems aim to facilitate \"smart, connected printing\" to address the shortage of skilled labour, increase productivity and reduce waste. Heidelberg has identified digital label printing as a highly attractive market for growth within the digital printing sector due to its yearly growth rate of approximately six percent. To support this digital transformation, Heidelberg and Gallus have introduced new innovations that address key challenges faced by stakeholders in the industry, including shortages of skilled labour and increasing demands for productivity. Dr Ludwin Monz, CEO of Heidelberg, said these new solutions demonstrate the companies' commitment to promoting digital transformation in the industry. Labelexpo marked the European trade show debut of the new Gallus One digital label press. The Gallus One was launched in August 2022 and was designed to remove the total cost of ownership (TCO) barrier for the adoption of reel-to-reel digital labels. It does so by incorporating high levels of automation and cloud-based technologies, thus making digital label printing more accessible. Brands can now access cost-effective and sustainable, high-quality digital labels. Gallus recently launched the new Gallus One with Converting to optimise the TCO benefits further. This solution brings everything inline, featuring a digital printer with an inline flexo station, a semi-rotary die cutter that can change a job within one minute and process up to 70 m per minute, and vision inspection systems to ensure the highest level of quality and minimise waste. The trade show also saw Gallus highlight the newly available digital printing unit (DPU) for the Gallus ECS 340 flexo press. The DPU was released this summer during the first Gallus Experience Days. By using the DPU, a traditional Gallus ECS 340 can now be transformed into a Gallus Labelfire 340 hybrid press, without requiring any additional platform investment. This allows customers to take advantage of the flexibility and versatility of digital printing while maintaining the reliability and precision of conventional printing and further processing technology. Dario Urbinati, CEO, Gallus Group At Labelexpo, the Heidelberg Customer Portal (HCP) was showcased. Recently introduced at the Gallus Experience Centre, the HCP automates most of the customer touchpoints. This unique platform is the first of its kind in the industry. Future versions of the HCP will utilise artificial intelligence (AI) to offer predictive capabilities and recommendations for enhancing productivity, reducing maintenance, and improving profitability. This new solution is estimated to save customers an average of 35% in both time and money. “Labelexpo is always such a positive and inspiring arena, and we’re thrilled to have the opportunity not only to showcase our latest products at the show, but also to connect with stakeholders market-wide and continue to share our vision for the industry’s future,” concluded Dario Urbinati, CEO, Gallus Group.","filter_flag":1}
{"title":"Ashok Chaturvedi unveils report on recyclability of multi-layered aseptic packaging - printweek","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMNIBfmh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMD9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMNIBfmh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMD9hbXA9MQ?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMNIBfmh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMD9hbXA9MQ","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMNIBfmh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMD9hbXA9MQ?oc=5\" target=\"_blank\">Ashok Chaturvedi unveils report on recyclability of multi-layered aseptic packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">printweek<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ashok Chaturvedi unveils report on recyclability of multi-layered aseptic packaging - printweek","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMNIBfmh0dHBzOi8vd3d3LnByaW50d2Vlay5pbi9uZXdzL2FzaG9rLWNoYXR1cnZlZGktdW52ZWlscy1yZXBvcnQtb24tcmVjeWNsYWJpbGl0eS1vZi1tdWx0aS1sYXllcmVkLWFzZXB0aWMtcGFja2FnaW5nLS01NzkzMD9hbXA9MQ?oc=5\" target=\"_blank\">Ashok Chaturvedi unveils report on recyclability of multi-layered aseptic packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">printweek<\/font>","source.href":"https:\/\/www.printweek.in","source.title":"printweek","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly innovations\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Ashok Chaturvedi, chairman and managing director, UFlex, released a study report on Recyclability of Multi-Layered Aseptic Packaging at a special roundtable organised by Plastics Packaging Research and Development Centre (PPRDC). The report was unveiled in the presence of Deepak Mishra, joint secretary, Department of Chemicals and Petrochemicals, Government of India, and Prof Shishir Sinha, DG-CIPET. Chaturvedi said, “We welcome the government’s initiatives toward clean India as it is a stepping-stone for a clean planet. As a global leader in packaging, we have made significant investments in industrial and MLP (multi-layer mixed plastic) waste recycling facilities across our global locations and very recently, in multi-layer aseptic recycling technology.” Historically, multi-layer aseptic packaging is considered non-recyclable as the packaging structures are made of a mix of materials (such as paper, polyethylene, and aluminium foil). Multi-layer aseptic packaging mostly ends up in landfills or is incinerated. Chaturvedi said, UFlex has invested in an advanced Enzymatic Delamination Technology to enable aseptic packaging recycling. “Enzymatic delamination utilises enzymes to break down the bonding between different layers of the packaging materials, allowing for the separation of individual layers, such as paper and polyethylene\/foil laminate which can be reused in the production of new products. UFlex has set up a state-of-the-art aseptic packaging recycling facility in Gwalior and would like to invite brand owners, civic bodies, NGOs, and recyclers to visit our facilities and learn more about this technology,” he added. He said that the report will help brand owners and recyclers appreciate the technical processes, possibilities, and financial returns of recycling MLAP (multi-layer aseptic plastic) waste. In a country like India, this could provide a direction for the treatment of aseptic plastic waste in a sustainable manner and bring circularity in aseptic packaging “We all realise that this world cannot do without plastic packaging, and it is the biggest contributor to our farmers’ income. 90% of the produce from farmers is made available to consumers thanks to MLP packaging. While we have invested our own time and money, and developed technology to pave the way for recycling in India, we believe that adequate regulatory support in creating the right environment to boost recycling is the need of the hour. Often, a well-drafted law accelerates the pace of change like nothing else,” he said. Anantshree Chaturvedi, vice-chairman and CEO of Flex Films International, said, “The PPRDC roundtables are a great initiative to bring all stakeholders together to discuss industry trends and best practices toward a collective goal. We recently showcased our global sustainability project called Plastic Fix at the PRDC roundtable that applies recycling, pyrolysis, biodegradable enzymes, and other practical solutions to enhance the recyclability and circularity of plastics.” Ashwani K Sharma, president and CEO, Aseptic Liquid Packaging Business, UFLex, said, “At UFlex, we recognise the critical role of aseptic packaging in our modern economy, and we are committed to driving innovation that aligns sustainability with economic progress. Our advanced enzymatic delamination technology is a testament to our investment and commitment to highly efficient, technologically advanced, and sustainable practices. By upcycling aseptic packaging waste into valuable industrial and daily-use products, we are paving the way to address one of the biggest challenges of recycling aseptic packaging waste for the industry and the country. We look forward to playing a critical role in creating a more sustainable future for India and beyond.” ","filter_flag":1}
