{"title":"Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5","id":"CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA","guidislink":false,"published":"Fri, 29 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=272, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1kZW1vbnN0cmF0ZXMtaW5kdXN0cnktbGVhZGluZy1lbmVyZ3ktbWFuYWdlbWVudC1zb2x1dGlvbnMtYXQtbmVjYS0yMDIzLTMwMTk0MjU4OS5odG1s0gEA?oc=5\" target=\"_blank\">Schneider Electric Demonstrates Industry-Leading Energy Management Solutions at NECA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy optimization\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Schneider Home , a first-of-its-kind home energy management solution being premiered to electrical contractor audience , a first-of-its-kind home energy management solution being premiered to electrical contractor audience EcoStruxure Microgrid Flex, SourcePacT isolation switches, and VisiPact safety switches among new products being launched New offerings support changing needs of electrical contractors and installers at the forefront of the new energy landscape PHILADELPHIA, Sept. 29, 2023 \/PRNewswire\/ -- Schneider Electric, the leader in the digital transformation of energy management and automation, today announced a broad portfolio of product innovations at the NECA 2023 Convention & Trade Show taking place September 29 through October 2 in Philadelphia, PA. Designed to accelerate the new energy landscape, these innovations will support electrical contractors and installers who play a vital role at the forefront of energy efficiency, safety, and sustainability for residential, commercial and industrial customers. Schneider Home, a first-of-its-kind integrated home energy management solution that makes homes more efficient and resilient, will be premiered to industry professionals at the event. Schneider Home provides energy independence for homeowners – automating energy production, storage, measurement, and control – all from a single, easy-to-use app. This award-winning, comprehensive solution includes a smart electrical panel, a home battery for clean energy storage, a high-power solar inverter, an electric vehicle (EV) charger, and connected electric sockets and light switches, all connected to intelligently orchestrate home energy. In contrast to existing solutions, requiring separate apps and disjointed hardware, Schneider Home eliminates that complexity, allowing homeowners to easily manage energy usage and reduce costs. \"As we move rapidly into the new energy landscape, electrical contractors and installers are at the forefront of energy efficiency, safety and sustainability guiding their industrial, commercial, and residential customers through an increasingly electric world,\" said Peyton Pratt, Vice President, Power Systems, Schneider Electric. \"We are responding to their changing needs by providing innovative technology, training, and services to grow their businesses, and we're excited to share those solutions at the NECA show.\" Schneider Electric: Innovation on display Schneider Electric also announced additional new product innovations, including: VisiPact Safety Switch – This new heavy duty safety switch takes all the trusted features, such as the switching mechanism and adds new, standard features, such as a viewing window, hook stick handle, QR code for quick access to information, touch safe barriers, and more. – This new heavy duty safety switch takes all the trusted features, such as the switching mechanism and adds new, standard features, such as a viewing window, hook stick handle, QR code for quick access to information, touch safe barriers, and more. SourcePacT Isolation Switch – The Industry's first purpose-built solution that automatically isolates an electrical system from an external utility, enabling local inverter-based sources to provide standby-power in resilience applications. – The Industry's first purpose-built solution that automatically isolates an electrical system from an external utility, enabling local inverter-based sources to provide standby-power in resilience applications. EcoStruxure Microgrid Flex – This industry-first fuses microgrid controls, electrical distribution, software, and Schneider Electric's Energy Control Center and all-in-one Battery Energy Storage System (BESS) to simplify traditional microgrid configuration for faster and simpler implementation. – This industry-first fuses microgrid controls, electrical distribution, software, and Schneider Electric's Energy Control Center and all-in-one Battery Energy Storage System (BESS) to simplify traditional microgrid configuration for faster and simpler implementation. QO Smart Panel Solution – A modular, flexible solution that provides 'smart' panel functionality quickly, easily, and inexpensively by adding Square D Control Relays and a Schneider Energy Monitor to new or existing Square D Plug-on Neutral panels. – A modular, flexible solution that provides 'smart' panel functionality quickly, easily, and inexpensively by adding Square D Control Relays and a Schneider Energy Monitor to new or existing Square D Plug-on Neutral panels. EcoConsult Electrical Digital Twin Service – This service digitizes paper single-line diagrams (SLDs) to easily operate and maintain the electrical systems, and helps you comply with new NFPA 70B mandates. These products will be displayed at the 2023 NECA Convention in Schneider Electric's Booth #2000. To learn more, please visit http:\/\/www.se.com\/us. About Schneider Electric Schneider's purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On. Our mission is to be your digital partner for Sustainability and Efficiency. We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries. We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values. www.se.com Discover Life Is On | Follow us on: Twitter | Facebook | LinkedIn | YouTube | Instagram | Blog Discover the newest perspectives shaping sustainability, electricity 4.0, and next generation automation on Schneider Electric Insights. SOURCE Schneider Electric","filter_flag":1}
{"title":"Schneider Electric Unveils Latest Texas Manufacturing Plant as Part of a $300 Million Investment in U.S. Manufacturing - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy11bnZlaWxzLWxhdGVzdC10ZXhhcy1tYW51ZmFjdHVyaW5nLXBsYW50LWFzLXBhcnQtb2YtYS0zMDAtbWlsbGlvbi1pbnZlc3RtZW50LWluLXVzLW1hbnVmYWN0dXJpbmctMzAxOTI4NDgxLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy11bnZlaWxzLWxhdGVzdC10ZXhhcy1tYW51ZmFjdHVyaW5nLXBsYW50LWFzLXBhcnQtb2YtYS0zMDAtbWlsbGlvbi1pbnZlc3RtZW50LWluLXVzLW1hbnVmYWN0dXJpbmctMzAxOTI4NDgxLmh0bWzSAQA?oc=5","id":"CBMiqwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy11bnZlaWxzLWxhdGVzdC10ZXhhcy1tYW51ZmFjdHVyaW5nLXBsYW50LWFzLXBhcnQtb2YtYS0zMDAtbWlsbGlvbi1pbnZlc3RtZW50LWluLXVzLW1hbnVmYWN0dXJpbmctMzAxOTI4NDgxLmh0bWzSAQA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy11bnZlaWxzLWxhdGVzdC10ZXhhcy1tYW51ZmFjdHVyaW5nLXBsYW50LWFzLXBhcnQtb2YtYS0zMDAtbWlsbGlvbi1pbnZlc3RtZW50LWluLXVzLW1hbnVmYWN0dXJpbmctMzAxOTI4NDgxLmh0bWzSAQA?oc=5\" target=\"_blank\">Schneider Electric Unveils Latest Texas Manufacturing Plant as Part of a $300 Million Investment in U.S. Manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Schneider Electric Unveils Latest Texas Manufacturing Plant as Part of a $300 Million Investment in U.S. Manufacturing - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy11bnZlaWxzLWxhdGVzdC10ZXhhcy1tYW51ZmFjdHVyaW5nLXBsYW50LWFzLXBhcnQtb2YtYS0zMDAtbWlsbGlvbi1pbnZlc3RtZW50LWluLXVzLW1hbnVmYWN0dXJpbmctMzAxOTI4NDgxLmh0bWzSAQA?oc=5\" target=\"_blank\">Schneider Electric Unveils Latest Texas Manufacturing Plant as Part of a $300 Million Investment in U.S. Manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy optimization\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Products made in state-of-the-art facility will support customers in the energy transition and contribute to the build out of America's infrastructure The projected 400 new jobs will boost the company's total number of employees in El Paso to about 1,500 by year end to about 1,500 by year end Company's fourth El Paso plant makes the city home to its largest manufacturing operation in the United States EL PASO, Texas, Sept. 14, 2023 \/PRNewswire\/ -- Today, Schneider Electric, the global leader in the digital transformation of energy management and automation, joined forces with state, region, and local officials and dignitaries to formally unveil its new 160,000 square foot manufacturing plant in El Paso, TX. The plant is part of a $300 million U.S. manufacturing investment the company has made to support customers who will use the electrical equipment produced in it, contributing to the advancement of the energy transition and the build out of America's infrastructure. \"Schneider Electric is proud to be at the forefront of America's manufacturing renaissance, exemplifying our commitment to fostering innovation, job creation, and sustainable growth,\" said Annette Clayton, CEO of Schneider Electric North America. \"As we embark on this journey with the opening of our latest manufacturing plant in the United States, we look forward to providing the highest level of service to our customers while also contributing to the revitalization of American manufacturing.\" With more than 20 plants in its U.S. manufacturing network, the latest smart factory opening makes Schneider Electric's El Paso campus the company's largest manufacturing operation in the U.S. By the end of the year, the company will have approximately 1,500 employees in El Paso, thanks to the creation of about 400 new jobs making the Fortune 500 company one of the largest employers in the region. \"We are proud that Texas is home to a booming tech manufacturing sector that continues to fuel Texas' economic global might,\" said Governor Abbott. \"Texas is a hub of innovation, and Schneider Electric's new facility in El Paso will help produce medium voltage switchgear serving the data center market segment. Schneider Electric is a key part of the Texas economic juggernaut, and I thank Judge Samaniego, Mayor Leeser, the Borderplex Alliance, and all the community leaders involved for their work to bring such a great company to this wonderful city. This facility is an investment in the future of El Paso and an important piece in building the Texas of tomorrow.\" Located in the Northwest Corporate Center, the new facility produces custom designed low voltage and medium voltage electrical products that safely distribute electrical power from the utility grid to various places within industrial, commercial, and residential settings. The first set of products manufactured in the new El Paso plant shipped out earlier this summer to customers in the data center sector. \"Schneider Electric's investment in the El Paso community goes beyond creating well-paying jobs for our skilled workforce - it's significantly enhancing our local economy,\" said El Paso Mayor Oscar Leeser. \"On behalf of the people of El Paso, I want to thank Schneider Electric for their continued commitment to our region and their role in fostering economic development and skilled job opportunities.\" \"Schneider Electric's expansion in El Paso showcases the Borderplex region's significant contributions to our country's economy,\" said Jon Barela, CEO, Borderplex Alliance. \"We're grateful to Schneider Electric for choosing our community to expand its operations and thank our city and county partners for their cooperation in continuing to move our region forward.\" \"Schneider Electric, a formidable force in the industry, not only holds the key to unlocking economic growth but also possesses the unparalleled ability to elevate the very fabric of our community, enriching lives in ways beyond measure,\" said Ricardo A. Samaniego, El Paso County Judge. \"This decision exemplifies our county's unwavering commitment to fostering innovation, bolstering enterprises, and cultivating a hospitable ecosystem for esteemed industry pioneers.\" Since 2020, the company has not only constructed its new El Paso plant it has also invested in equipment and upgraded operations at its manufacturing facilities in Lexington, Kentucky; Lincoln, Nebraska; as well as Mechanicsburg and Middletown, Pennsylvania. The enhancements, made possible by the $300 million multi-year investment, have made these facilities smarter, more sustainable, and highly efficient. Schneider Electric is currently ranked No. 1 in Gartner, Inc's Global Supply Chain Top 25 list the industry analyst firm publishes annually that recognizes companies with leading supply chain operations. The company was recently ranked among the Top 10 of the 2023 Best Workplaces in Manufacturing & Production by the Great Place to Work U.S. organization and Fortune magazine. In 2022, its El Paso campus expansion project received recognition as the Project of the Year from the Texas Economic Development Council for cities with a population of more than 250,000 residents. About Schneider Electric Schneider's purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On. Our mission is to be your digital partner for Sustainability and Efficiency. We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries. We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values. www.se.com Follow us on: Hashtags: #AccessToEnergy #SchneiderElectric #SupplyChain #Manufacturing #Investment SOURCE Schneider Electric","filter_flag":1}
{"title":"Schneider Electric Opens Pre-Orders for Schneider Home, A First-of-its-Kind Home Energy Management Solution - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1vcGVucy1wcmUtb3JkZXJzLWZvci1zY2huZWlkZXItaG9tZS1hLWZpcnN0LW9mLWl0cy1raW5kLWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtc29sdXRpb24tMzAxOTI0MjI2Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1vcGVucy1wcmUtb3JkZXJzLWZvci1zY2huZWlkZXItaG9tZS1hLWZpcnN0LW9mLWl0cy1raW5kLWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtc29sdXRpb24tMzAxOTI0MjI2Lmh0bWzSAQA?oc=5","id":"CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1vcGVucy1wcmUtb3JkZXJzLWZvci1zY2huZWlkZXItaG9tZS1hLWZpcnN0LW9mLWl0cy1raW5kLWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtc29sdXRpb24tMzAxOTI0MjI2Lmh0bWzSAQA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1vcGVucy1wcmUtb3JkZXJzLWZvci1zY2huZWlkZXItaG9tZS1hLWZpcnN0LW9mLWl0cy1raW5kLWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtc29sdXRpb24tMzAxOTI0MjI2Lmh0bWzSAQA?oc=5\" target=\"_blank\">Schneider Electric Opens Pre-Orders for Schneider Home, A First-of-its-Kind Home Energy Management Solution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Schneider Electric Opens Pre-Orders for Schneider Home, A First-of-its-Kind Home Energy Management Solution - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiogFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NjaG5laWRlci1lbGVjdHJpYy1vcGVucy1wcmUtb3JkZXJzLWZvci1zY2huZWlkZXItaG9tZS1hLWZpcnN0LW9mLWl0cy1raW5kLWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtc29sdXRpb24tMzAxOTI0MjI2Lmh0bWzSAQA?oc=5\" target=\"_blank\">Schneider Electric Opens Pre-Orders for Schneider Home, A First-of-its-Kind Home Energy Management Solution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy optimization\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Also announces EcoStruxure Microgrid Flex and EcoXpert Microgrid Badge certification Schneider Electric unveils bidirectional EV charging New offerings support the acceleration of a new energy landscape for industrial, commercial, and residential prosumers LAS VEGAS, Sept. 12, 2023 \/PRNewswire\/ -- Schneider Electric, the leader in the digital transformation of energy management and automation, today announced that it has begun taking orders for Schneider Home, a first-of-its-kind integrated home energy management solution that makes homes more efficient and resilient. Unveiled at the Consumer Electronics Show (CES) in January, this award-winning solution provides energy independence automating energy production, storage, measurement, and control – all from a single, easy-to-use app. The announcement was made during RE+ 2023, the largest event in North America for the clean energy industry. Schneider Electric has a significant presence at this year's conference, with executives featured in seven expert sessions, including North America CEO, Annette Clayton joining the opening session roundtable co-hosted by Kal Penn, Former Associate Director, White House Office of Public Liaison, and Van Jones, CNN Host & President of Magic Labs Media. Schneider Electric begins to take orders for Schneider Home, an integrated home energy management solution Post this \"As the need for resilience and decarbonization becomes ever more urgent, it's imperative that the growing range of energy users--organizations, businesses, utilities and consumers--contribute to a shared grid,\" said Annette Clayton, CEO, North America, Schneider Electric. \"This trend will require innovative technology to accelerate the electrification of homes, buildings and transport, EV charging infrastructure and microgrids.\" Clayton concluded, \"Empowering everyone from homeowners to commercial and industrial customers with more visibility and decision making over their energy consumption is critical as this collection of energy conscious prosumers will make up the new energy landscape.\" Schneider Home is a comprehensive solution that includes a smart electrical panel, a home battery for clean energy storage, a high-power solar inverter, an electric vehicle (EV) charger and connected electric sockets and light switches, all connected to intelligently orchestrate home energy. In contrast to existing solutions which require separate apps and disjointed hardware, Schneider Home eliminates that complexity, providing homeowners the ability to easily monitor energy consumption by individual appliance, decide where to prioritize power during an outage to extend available back up power and avoid expensive electrical service upgrades when purchasing an EV. Schneider Electric's announcements provide transformative approach for net-zero carbon efforts Schneider Electric also announced that its EcoStruxure Microgrid Flex and the EcoXpert Microgrid Badge certification program are now available. These new offerings are the latest in Schneider Electric's efforts to meet the growing needs of today's prosumer. EcoStruxure Microgrid Flex, also an industry first, standardizes microgrid development to drastically reduce project timelines. It fuses microgrid controls, electrical distribution, software, and Schneider Electric's all-in-one Battery Energy Storage System (BESS) to simplify traditional microgrid configuration for faster and simpler implementation. Partners will gain access to a new microgrid design approach, EcoStruxure Microgrid Build, a web-based tool that helps to configure, program, and deploy microgrid control algorithms. Meanwhile, the EcoXpert Microgrid Badge program is set up to deliver needed certification, training, and a mutually beneficial partnership program to enable participants to succeed in the growth of microgrid adoption. EcoXpert Microgrid Badge certification highlights partners' competence in designing and implementing microgrid solutions. Partners can become advanced system integrators adept at helping organizations manage loads and distributed energy resources, yielding more sustainable and resilient energy systems. According to Guidehouse Insights, Schneider Electric is the leading microgrid integrator globally due to its microgrid services, technologies, and innovative scope of delivery through joint ventures. Customers, like Bimbo Bakeries, benefit from Schneider Electric's expertise in delivering high-quality, strategic solutions in the microgrid value chain, enabling customers to achieve new heights in decarbonizing their energy operations. \"Grupo Bimbo and Bimbo Bakeries USA are committed to Net Zero Carbon by 2050,\" said Chris Wolfe, Bimbo Bakeries USA's Senior Director of Environmental Sustainability. \"These onsite microgrids represent a key component to our diversified strategy.\" Schneider Electric reveals bidirectional EV charging Optimized energy use is crucial for a net-zero future. Schneider Electric is unifying commercial and residential customers in this endeavor by enabling bidirectional charging, such as vehicle-to-grid (V2G) and vehicle-to-home (V2H) functionalities. With more than 100 years of energy management innovation and existing projects, like the one powered by zero-emissions electric buses in Oakland, California, Schneider Electric is positioned to deliver on the promise of a two-way energy paradigm. Customers will be able to future-proof their EVs as they become dynamic energy assets that can produce emergency backup power for homes (V2H), reduce homeowner costs and electric supply strain by selling excess power back to the grid (V2G), and reduce carbon emissions by harnessing renewable energy. RE+ attendees visiting the Schneider Electric booth (#5343) will get a 'first-look' at the company's all-in-one bi-directional EV charging prototype expected to be commercially available in 2025. Schneider Electric's bi-directional EV charger will enable full home backup, high power charging, plug and play integration of solar and stationary storage and optimized installation costs with its simple, integrated design. For more information, visit Schneider Electric at RE+ (Sands Expo Level 2, Booth #5343) to learn more about these announcements. About Schneider Electric Schneider's purpose is to empower all to make the most of our energy and resources, bridging progress and sustainability for all. We call this Life Is On. Our mission is to be your digital partner for Sustainability and Efficiency. We drive digital transformation by integrating world-leading process and energy technologies, end-point to cloud connecting products, controls, software and services, across the entire lifecycle, enabling integrated company management, for homes, buildings, data centers, infrastructure and industries. We are the most local of global companies. We are advocates of open standards and partnership ecosystems that are passionate about our shared Meaningful Purpose, Inclusive and Empowered values. www.se.com Discover Life Is On | Follow us on: Twitter | Facebook | LinkedIn | YouTube | Instagram | Blog Discover the newest perspectives shaping sustainability, electricity 4.0, and next generation automation on Schneider Electric Insights SOURCE Schneider Electric","filter_flag":1}
{"title":"Anker SOLIX Showcases Next-Generation Home Energy Solutions at RE+ 2023 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYW5rZXItc29saXgtc2hvd2Nhc2VzLW5leHQtZ2VuZXJhdGlvbi1ob21lLWVuZXJneS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MjM2MzMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYW5rZXItc29saXgtc2hvd2Nhc2VzLW5leHQtZ2VuZXJhdGlvbi1ob21lLWVuZXJneS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MjM2MzMuaHRtbNIBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYW5rZXItc29saXgtc2hvd2Nhc2VzLW5leHQtZ2VuZXJhdGlvbi1ob21lLWVuZXJneS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MjM2MzMuaHRtbNIBAA","guidislink":false,"published":"Mon, 11 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=254, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYW5rZXItc29saXgtc2hvd2Nhc2VzLW5leHQtZ2VuZXJhdGlvbi1ob21lLWVuZXJneS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MjM2MzMuaHRtbNIBAA?oc=5\" target=\"_blank\">Anker SOLIX Showcases Next-Generation Home Energy Solutions at RE+ 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Anker SOLIX Showcases Next-Generation Home Energy Solutions at RE+ 2023 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvYW5rZXItc29saXgtc2hvd2Nhc2VzLW5leHQtZ2VuZXJhdGlvbi1ob21lLWVuZXJneS1zb2x1dGlvbnMtYXQtcmUtMjAyMy0zMDE5MjM2MzMuaHRtbNIBAA?oc=5\" target=\"_blank\">Anker SOLIX Showcases Next-Generation Home Energy Solutions at RE+ 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy optimization\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Unveils Survey Highlighting Opportunities and Challenges for Increasing Battery Backup Adoption Among Homeowners LAS VEGAS, Sept. 11, 2023 \/PRNewswire\/ -- Anker, a global leader in charging, power delivery, and power storage, has announced its participation in RE+, North America's largest energy event, taking place from September 11 to 14, 2023, in Las Vegas at The Venetian Convention & Expo Center. This marks Anker's debut at the renowned clean energy conference following the June launch of the Anker SOLIX brand, as the company expands its presence in the home energy solutions market. Anker, global leader in charging and power delivery, showcases Next-Generation Home Energy Solutions at RE+ 2023 Post this Anker SOLIX's new X1 is a super powerful home battery backup system featuring an ultra-slim modular design that will seamlessly blend into any home décor. It is customizable with up to six battery packs per system (30 kWh) or up to six systems in parallel (180 kWh). During the event, Anker will introduce two innovative products - the Anker SOLIX X1 Home Energy Solution and the Anker SOLIX F3800 Portable Power Station - to industry professionals in the United States. These products demonstrate Anker's commitment to redefining energy independence for consumers. As the home energy storage market experiences rapid growth, Anker conducted a survey of 500 U.S. consumers who own single-family residences with solar panels installed. The survey revealed key insights for those with and without battery backup systems. Homeowners with a Solar and Battery Backup Solution: Decision to Invest Goes Beyond the \"Backup\": Most purchasing decisions were driven by homeowners' desire to safeguard their homes from power outages (51%), followed by reducing energy costs (44%). However, almost one-third of homeowners (29%) say they chose to purchase a home battery backup solution to increase the value of their property. Most purchasing decisions were driven by homeowners' desire to safeguard their homes from power outages (51%), followed by reducing energy costs (44%). However, almost one-third of homeowners (29%) say they chose to purchase a home battery backup solution to increase the value of their property. Battery Backup Lives Up to the Potential: 2 out of 3 survey respondents found that battery backup systems were worth or partially worth the investment. 2 out of 3 survey respondents found that battery backup systems were worth or partially worth the investment. Consumers Want More Power Off the Grid: In response to Anker's survey, 27% indicated a strong preference for a solar and battery backup solution that is not tied to the grid, enabling continuous power generation and storage during blackouts. An additional 23% of respondents expressed a desire for greater power output, specifically the ability to fully power everything in their homes, including HVAC systems. Homeowners with Solar and no Battery Backup Solution: Need for Further Education: For homeowners who have not yet invested in a home battery backup system, the cost of purchase (38%) and the cost of installation (32%) are significant barriers. However, 28% of these homeowners expressed that they lack sufficient information about the benefits of battery backup systems to consider adding them to their existing solar setup. For homeowners who have not yet invested in a home battery backup system, the cost of purchase (38%) and the cost of installation (32%) are significant barriers. However, 28% of these homeowners expressed that they lack sufficient information about the benefits of battery backup systems to consider adding them to their existing solar setup. Space Constraints: About 18% of homeowners believe they lack adequate space in their homes to accommodate a battery backup system. About 18% of homeowners believe they lack adequate space in their homes to accommodate a battery backup system. Concerns about Battery Safety and Lifespan: 18% of surveyed homeowners expressed concerns about the safety of battery solutions, and 20% were worried that the batteries might experience a decline in storage capacity over time, impacting their investment. \"RE+ 2023 provides an excellent opportunity for Anker to present our vision for the home energy storage sector,\" said Shaun Xiong, General Manager of Anker and Anker SOLIX. \"Our survey findings highlight distinctive feature gaps in the battery backup market that our solutions can address, as well as some consumer educational challenges that our industry must work together to fix.\" Anker SOLIX Solutions on Display in the U.S. for the First Time at RE+ RE+ attendees can learn more about how Anker is transforming the home energy market and visit booths #16096 and #21106 at the Venetian Expo to explore the latest Anker SOLIX product offerings, engage in informative discussions with the team of experts, and discover how Anker SOLIX solutions can make a positive impact for consumers. Anker SOLIX solutions at RE+ include: Anker SOLIX X1 Home Energy Solution – Flagship High-Performance Making its U.S. debut at RE+, the Anker SOLIX X1 Home Energy Solution is a revolutionary addition to Anker's lineup of advanced home energy solutions. Designed with precision engineering and cutting-edge technology, the X1 is set to redefine backup power for homes. Below are the key features of this flagship high-performance system: Compact and Modular Design : Compact and modular, the X1 is designed to fit in with any décor. It features an ultra-slim form factor thinner than most home energy solutions. With its sleek edges and geometrical finishes, classic minimalism defines the X1. This elegant, eye-catching design fosters intuitive interactions between the screen and lighting, creating an engaging experience. : Compact and modular, the X1 is designed to fit in with any décor. It features an ultra-slim form factor thinner than most home energy solutions. With its sleek edges and geometrical finishes, classic minimalism defines the X1. This elegant, eye-catching design fosters intuitive interactions between the screen and lighting, creating an engaging experience. More Power. More Flexibility: The flexible, modular design of the X1 allows users to customize their system with up to six battery packs per system (30kWh\/6kW) or up to six systems in parallel (180kWh\/36kW). The flexible, modular design of the X1 allows users to customize their system with up to six battery packs per system (30kWh\/6kW) or up to six systems in parallel (180kWh\/36kW). Innovative Energy Optimization : Each battery pack in the X1 works independently during the charging and discharging processes, eliminating the \"barrel effect\" and providing a 3-5% increase in energy capacity compared to traditional home energy storage solutions. : Each battery pack in the X1 works independently during the charging and discharging processes, eliminating the \"barrel effect\" and providing a 3-5% increase in energy capacity compared to traditional home energy storage solutions. Seamless Transition : During blackouts, the X1 will continue to work with the owner's PV panels to power their home, seamlessly switching to off-grid mode in less than 15 milliseconds. : During blackouts, the X1 will continue to work with the owner's PV panels to power their home, seamlessly switching to off-grid mode in less than 15 milliseconds. Fast Charging and Discharging : Compared to other solutions on the market, the X1 has 20% faster charging from 0% to 90% storage capacity and 32% faster discharging from 100% to 0% capacity. : Compared to other solutions on the market, the X1 has 20% faster charging from 0% to 90% storage capacity and 32% faster discharging from 100% to 0% capacity. Widest Temperature Range and Built to Last : Operates in temperatures ranging from -4ºF to 131ºF, backed by a 10-year warranty, smart battery management system, and IP65 outdoor protection. : Operates in temperatures ranging from -4ºF to 131ºF, backed by a 10-year warranty, smart battery management system, and IP65 outdoor protection. eXtreme Intelligent Energy Management System : The X1 offers enhanced power capacity, increased revenue potential, and greater self-sufficiency. The Storm Warning Mode includes an AI Forecast feature that will automatically trigger power backup ahead of a storm to provide peace of mind. Additionally, with the NEM 3.0 Mode, the X1 can discharge 13.2 kWh at 110% of the standard rate, enabling owners to maximize electricity sales at peak prices within a two-hour window. And using the Anker App, users can manage all aspects of the X1 system as well as control energy usage for other devices, including heat pumps, generators, EV chargers and more. : The X1 offers enhanced power capacity, increased revenue potential, and greater self-sufficiency. The Storm Warning Mode includes an AI Forecast feature that will automatically trigger power backup ahead of a storm to provide peace of mind. Additionally, with the NEM 3.0 Mode, the X1 can discharge 13.2 kWh at 110% of the standard rate, enabling owners to maximize electricity sales at peak prices within a two-hour window. And using the Anker App, users can manage all aspects of the X1 system as well as control energy usage for other devices, including heat pumps, generators, EV chargers and more. Safety Features: The X1 will automatically isolate a malfunctioning battery pack, allowing the system to continue operating smoothly using the other functioning packs. And thanks to its distinctive feature of rapid voltage shutdown to 0V, the X1 can be safely transported, installed, and serviced. For more details about the X1, visit anker.com\/anker-solix\/home-energy-solutions. Anker SOLIX F3800 Portable Power Station – The Most Accessible Home Power Solution: The Anker SOLIX F3800 Portable Power Station is the first power station to feature AC coupling and support home solar power cycling when paired with the Anker SOLIX Home Power Panel. Easy installation only takes a few hours by a professional electrician, and with a cost-effective price point, the F3800 is the most accessible home power solution available on the market. Impressive Power Output : The F3800 offers 6000W AC power output and 120V\/240V dual voltage output, enabling it to simultaneously power high-energy devices. The AC output power can even be elevated up to 12,000W when two F3800s are combined. : The F3800 offers 6000W AC power output and 120V\/240V dual voltage output, enabling it to simultaneously power high-energy devices. The AC output power can even be elevated up to 12,000W when two F3800s are combined. Large Battery Capacity : At the same time, it boasts a massive 3.84kWh internal battery for extended backup power. With its expandable form factor, users can customize their power storage needs with up to 53.76kWh when combining two F3800s and up to 12 additional batteries, providing up to a week of home backup power. : At the same time, it boasts a massive 3.84kWh internal battery for extended backup power. With its expandable form factor, users can customize their power storage needs with up to 53.76kWh when combining two F3800s and up to 12 additional batteries, providing up to a week of home backup power. Portability : For ultimate flexibility, the F3800 can be transported with ease thanks to its \"suitcase design,\" which features a handle and large wheels. : For ultimate flexibility, the F3800 can be transported with ease thanks to its \"suitcase design,\" which features a handle and large wheels. EV Charging: Electric vehicles can also be charged without the need for additional grounding accessories. This means EV users can connect their vehicle's charging cable directly to the Anker F3800, providing a convenient charging solution at home, even when the power is out. Pricing and availability for the Anker SOLIX F3800 will be announced later this year. About Anker SOLIX: Leveraging Anker's leadership in battery storage and power delivery, Anker SOLIX is dedicated to developing power solutions that will provide energy independence to people worldwide. This includes modular solar battery storage systems for homes, solar balcony solutions designed for apartments, and a growing portfolio of portable power stations. Additional details about Anker SOLIX can be found at https:\/\/www.anker.com\/anker-solix\/power-solutions. About Anker Innovations: Anker Innovations is a global leader in charging technology and a developer of unique consumer electronic products that support premium audio, mobile entertainment, and the emerging smart home space. This innovation is led by its six key brands: Anker, AnkerWork, eufy, NEBULA, soundcore, AnkerMake, and now Anker SOLIX. More information about Anker Innovations and its various brands can be found at anker.com. PR Contacts Eric Villines: [email protected] Marcia Chapman: [email protected] SOURCE Anker Innovations","filter_flag":1}
