{"title":"13 Best Eco-Friendly & Organic Mattress Toppers - Good Good Good","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy9lY28tZnJpZW5kbHktb3JnYW5pYy1tYXR0cmVzcy10b3BwZXJz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy9lY28tZnJpZW5kbHktb3JnYW5pYy1tYXR0cmVzcy10b3BwZXJz0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy9lY28tZnJpZW5kbHktb3JnYW5pYy1tYXR0cmVzcy10b3BwZXJz0gEA","guidislink":false,"published":"Thu, 04 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=124, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy9lY28tZnJpZW5kbHktb3JnYW5pYy1tYXR0cmVzcy10b3BwZXJz0gEA?oc=5\" target=\"_blank\">13 Best Eco-Friendly & Organic Mattress Toppers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Good Good Good<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"13 Best Eco-Friendly & Organic Mattress Toppers - Good Good Good","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy9lY28tZnJpZW5kbHktb3JnYW5pYy1tYXR0cmVzcy10b3BwZXJz0gEA?oc=5\" target=\"_blank\">13 Best Eco-Friendly & Organic Mattress Toppers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Good Good Good<\/font>","source.href":"https:\/\/www.goodgoodgood.co","source.title":"Good Good Good","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-conscious Materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Sleep is something we all need, but it certainly isn’t a one-size-fits-all experience — especially when you’re looking to incorporate your values of health and sustainability to your nighttime routine. If you’re not ready to buy a new mattress, if you want to extend the life of your current mattress, or if you just need a little extra boost of comfort and support, mattress toppers are the key to improved sleep hygiene. Although it can be tempting to purchase a $30 foam mattress topper from your nearest big box store, we highly recommend researching to find the right fit — for your benefit, as well as the environment’s. It goes without saying: If you already love your bedroom sleep setup, there’s no need to buy something new. But if you’re looking to get more comfortable sleep or prolong the life of your mattress — without causing harm to the environment — we’re here to make it easier! Read on for some mattress topper tidbits — and, of course, our recommendations for the best organic and non-toxic choices on the market. You might also like our deep-dives on: By the way, some of the products and links in this article are partners and affiliates, which means we may earn a commission at no extra cost to you. Everything in this article was independently and honestly written by the Good Good Good team. Thank you for your support! ‍ Our reviews of organic and non-toxic mattress toppers This section contains honest reviews of mattress toppers our team actually reviewed. We unboxed, set up, and slept on each of these mattress toppers — and broke down their impact on the environment, health, and, of course, our sleep. The brands you see listed in this section sent members of our team sample mattress toppers to review for this article. (Our reviews are always honest. Receiving free products for testing never impacts our writing — and brands don’t have any influence on our writing or editorial process.) ‍ Savvy Rest The organic Savvy Woolsy from Savvy Rest \/ Photo courtesy of Savvy Rest What’s good: Savvy Rest is one of our favorite bedding and mattress companies at this point. As a certified B Corp, the brand has a large catalog of natural latex mattresses and other bedding accessories that are all certified by trusted parties. Savvy Rest prioritizes values like health impact, the ability to reuse materials, investments in renewable energy, water stewardship, social fairness, and more. Additionally, through a partnership with Carbon Fund, the company offsets its annual estimated carbon emissions. Materials: Savvy Rest uses materials like all natural or organic latex, organic cotton, and wool in its mattress topper offerings. Natural Savvy Woolsy \/ Photo by Johnathan Huang for Good Good Good Mattress Topper Options: Natural Savvy Woolsy \/ Photo by Johnathan Huang for Good Good Good Johnathan’s Thoughts: Savvy Rest sent me the Natural Savvy Woolsy, which is a wool-filled mattress topper with four elastic corner straps to secure it to your mattress. It came minimally wrapped in plastic, in a cardboard box. The outside cotton casing feels very soft, yet thick and durable. I was a little skeptical on how the “quilted” squares would feel, as I thought it might feel like an uneven layer under my back. As someone who prefers their mattress on the firm side, I was also worried that adding a plush mattress topper would make it feel too soft. But — wow — I was wrong. After putting a fitted sheet over top and laying down to try it, it felt heavenly. It was like a cloud, but a cloud that still had the firm support of my mattress underneath. It allowed my body to sink in just enough without feeling overwhelming. Even though the material is durable, it doesn’t feel dense or heavy, but light, fluffy, and cool. I have no doubt this will last a long time, though I do wonder if it will get flatter where my body weight is applied each night — but so far it has remained just as comfortable as the first time I tried it. Savvy Rest’s products are always of such a nice quality, on top of the organic and ethical materials and sourcing. I’m excited to say I am now a mattress topper convert! → Shop mattress toppers from Savvy Rest ‍ Holy Lamb Organics Two quilted toppers from Holy Lamb Organics \/ Photo courtesy of Holy Lamb Organics What’s good: Holy Lamb Organics creates bed and bath staples, with a mission of “strengthening the economy based on ecology.” The Fair Trade company has a small and sustainable operation out of Oakville, Washington and practices zero waste initiatives throughout production. None of Holy Lamb’s raw materials ever go into a landfill; instead, the brand upcycles fabric and wool through a ReKindle Program, compost or mulch tiny scraps, and donates extras to schools for creative projects. With a plastic-free packaging policy and Cradle to Cradle practice, Holy Lamb ensures that your bedding can be recycled and repurposed without doing harm to the land, animals, or people. This is thanks to the certified organic materials used in manufacturing; Holy Lamb has a partnership with California mill Woolgatherer to ensure ethical wool practices, as well as certifications and testing clearance from GOTS, OEKO-TEX, Eco Wool, UC Davis Toxicology Lab, and Element Materials Technology. Materials: Holy Lamb utilizes organic cotton fabric, organic latex, premium natural American wool, and certified organic New Zealand wool. All-Natural Quilted Mattress Topper from Holy Lamb Organics \/ Photo by Kamrin Baker for Good Good Good Mattress Topper Options: All-Natural Quilted Mattress Topper from Holy Lamb Organics \/ Photo by Kamrin Baker for Good Good Good Kamrin’s Thoughts: Holy Lamb sent me the All-Natural Quilted Topper, which is made with organic cotton and filled with eco-conscious natural wool. Prior to getting this new topper, I regrettably had a cheap foam mattress topper I got from a department store, and that old one truly pales in comparison to the Holy Lamb mattress topper. The topper came in a large cardboard box with no other additional packaging materials (the giant box came in handy when I moved recently, too!), and it was super easy to transfer onto my queen mattress. Every night when I get into bed, I feel so soothed and supported, and it truly is like landing on a cloud. My sleeping experience has been improved by the soft and gentle bolster (which still feels supportive), and I love that the topper doesn’t have that weird egg carton shape of a mass-manufactured foam option. It feels natural — like it’s supposed to be there — and I really feel like it gives me the added cushion I need to get a good night’s rest. That being said, if you’re looking for a firmer option, you’d probably want to check out a latex option with more resistance; in my experience, this one is rather plush. The topper does occasionally shift under my fitted sheet, but it just takes some brief adjusting to get it back to where it needs to be. → Shop mattress toppers from Holy Lamb Organics ‍ Saatva Natural Latex mattress topper from Saatva \/ Photo courtesy of Saatva ‍What’s good: Saatva is known for its eco-conscious mattresses, but the brand offers more than just a place to rest your head. Saatva sources Fair Trade and certified organic materials, and plants trees with Evertreen, all while adhering to ethical labor standards. Talk about a guilt-free nap! Materials: Saatva’s mattress toppers are made with either perforated natural latex foam, or chemical-free memory foam, and they are all wrapped with certified organic, moisture-wicking cotton. Natural Latex Mattress Topper from Saatva \/ Photo by Jessica Irvin for Good Good Good Mattress Topper Options: Natural Latex Mattress Topper from Saatva \/ Photo by Jessica Irvin for Good Good Good Jessica’s Thoughts: Saatva sent me the Natural Latex Topper and it was a great upgrade to my (already comfortable) Saatva Latex Hybrid mattress. The topper arrived in minimal packaging, wrapped in a single layer of plastic. The elastic bands in the corners are easily slipped under the mattress while still holding the topper securely in place. I haven't had any issues with the topper shifting around like I have with other toppers. It has added extra softness to my mattress, but is still firmer than a lot of topper options on the market. If you’re looking for something more plush, you might opt for a different topper, but this provides a great, firm cushion if you’re looking for some additional support. → Shop mattress toppers from Saatva ‍ ‍ Other eco-friendly mattress toppers to consider For this section, we’ve conducted research, read dozens of reviews, and included a breakdown of the environmental considerations of each mattress topper — but we have not yet slept on these ourselves. We will continue to update this article over time. ‍ Avocado Green Mattress Vegan mattress topper from Avocado Green Mattress \/ Photo courtesy of Avocado Green Mattress What’s good: Avocado Green Mattress is a leader in the sustainable sleep space and has a mantra of “natural, safe, and responsible.” This is carried out through B Corp and Climate Neutral certifications, as well as a vast array of products that are certified by GOTS, GOLS, Made Safe, and Greenguard. Avocado also works with 1% for the Planet to donate one percent of its annual revenue to environmental organizations like SolarBuddy, Brave Trails, Protect Our Winters, and more. We love to see it! It is worth noting that Avocado's mattress toppers are specifically mentioned in a 2023 class action lawsuit claiming the brand is not as green as it claims. The suit hasn't been settled or closed yet, but it's definitely something to keep in mind as you're making your purchasing decisions. Materials: Avocado’s mattress toppers are made with certified organic materials like latex, wool, and cotton. Mattress Topper Options: → Shop mattress toppers from Avocado ‍ Brentwood Home Memory foam mattress topper from Brentwood Home \/ Photo courtesy of Brentwood Home What’s good: Brentwood Home is owned by Avocado and echoes its parent company’s priorities of inventive and eco-conscious materials that are all trusted and certified (by organizations like Fiar Trade, FSC, Greenguard, GOTS, and more). Brentwood Home is Climate Neutral certified and offsets emissions to be 100% carbon negative. Materials: Brentwood Home carries a variety of mattress toppers, either made with organic latex, or BioFoam, a memory foam that is biologically made using vegetable materials, such as corn, sunflower seeds, castor oil beans, and soybeans. The brand’s mattress toppers also include materials like organic cotton or tencel. Mattress Topper Options: → Shop mattress toppers from Brentwood Home ‍ Parachute Home Down alternative mattress topper from Parachute \/ Photo courtesy of Parachute What’s good: Parachute is a Climate Neutral certified company that utilizes circular programs, partners with Fair Trade and GOTS certified manufacturers, uses thoughtfully-selected textiles, and has long-term goals for sustainability. With a number of carbon offset projects and a diversity initiative that provides capital and mentorship for Black-owned startups, Parachute is showing us all how to be intersectional environmentalists. Now that’s what we call dreaming big. Materials: Cuddled into a 100% cotton exterior, Parachute uses down (certified by the Responsible Down Standard), and hypoallergenic microfiber down alternative. Mattress Topper Options: → Shop mattress toppers from Parachute ‍ Birch Organic mattress topper from Birch \/ Photo courtesy of Birch What’s good: Birch, a bedding company by Helix, creates recyclable, health and environment-conscious bedding goods. With materials certified by the Rainforest Alliance, Greenguard, Forest Stewardship Council, Fair Trade, GOTS, and GOLS, Birch keeps you comfortable with natural, non-toxic design. Materials: Birch’s organic mattress topper is made with organic cotton, wool, and natural latex. Mattress Topper Options: → Shop mattress toppers from Birch ‍ Coyuchi Climate Beneficial wool mattress topper from Coyuchi \/ Photo courtesy of Coyuchi What’s good: Coyuchi is a nature-inspired design haven that has a circular business model and recycling program that encourages shoppers to recycle their textiles and shop new products made from those recycled fibers. For new goods, the brand only sources organic materials and has a number of certifications, like those from GOTS, GOLS, Fair Trade, and Made Safe. As a member of 1% for the Planet, Coyuchi and champions climate nonprofits, as well. Materials: Coyuchi’s wool mattress topper is made with 100% climate beneficial wool sourced from a ranch in northern California, as well as 100% GOTS certified organic cotton. Mattress Topper Options: → Shop mattress toppers from Coyuchi ‍ Happsy What’s good: Happsy hits it out of the park with health and comfort — all without harming the planet. As a member of 1% for the Planet, Happsy financially supports a variety of sustainability initiatives, as well as ensuring the use of certified organic materials. Materials: Happsy keeps it simple with one organic mattress topper offering. It’s made with organic latex, wrapped in organic cotton. Simple as that! Mattress Topper Options: → Shop mattress toppers from Happsy ‍ Boll & Branch Cloud Cover Fiberbed mattress topper from Boll & Branch \/ Photo courtesy of Boll & Branch What’s good: Boll & Branch specializes in Fair Trade bed and bath goods that are totally traceable from start to finish, working with family-owned farms and factories who prioritize the use of organic and non-toxic materials — as well as fair and ethical labor standards. Materials: Boll & Brand mattress toppers are aptly titled “Cloud Covers” and are made with soft and sustainable materials. With certified ethically sourced down, 100% organic cotton, non-toxic down alternative, or humanely sourced wool, you’re sure to find a topper that fits your sleep needs. Mattress Topper Options: → Shop mattress toppers from Boll & Branch ‍ PlushBeds What’s good: From its certified organic manufacturing factory in California, PlushBeds makes handcrafted natural and organic sleep essentials. The brand is certified by an impressive list of third-party regulators, like GOLS, GOTS, Greenguard, Certi-PUR, and more. The company maintains transparent, eco- and worker-friendly business practices and donates a portion of each sale to a nonprofit partner. Materials: Whether it’s GOLS certified organic latex, ethically-sourced organic wool, hypoallergenic down alternative, non-toxic foams, or organic cotton exteriors, PlushBeds has a material available for every kind of sleeper. Mattress Topper Options: → Shop mattress toppers from PlushBeds ‍ Turmerry What’s good: Turmerry’s driving belief is that “home is a sanctuary.” The brand is dedicated to rigorous organic standards, as well as sustainable social change, and healthy lifestyle choices. The company has certifications from GOLS, GOTS, OEKO-TEX, and The Eco-Institut. In addition, Turmerry plants a tree with every order! Through partnerships with groups like American Forests and Trees For The Future, the brand has planted over 3o,000 trees in the U.S. and Africa in the last three years. Materials: Turmerry uses GOLS certified latex in both of its mattress topper options. Shoppers can also get an optional organic cotton cover for their mattress topper, too. Mattress Topper Options: → Shop mattress toppers from Turmerry ‍ My Green Mattress Organic latex topper from My Green Mattress \/ Photo courtesy of My Green Mattress What’s good: My Green Mattress came to be when founder Tim Masters wanted to help his daughter, who suffered from eczema and environmental allergies, have a better sleep experience. Now, the brand creates eco-friendly and health-conscious mattresses and accessories from hand in their organic factory in Illinois. With certifications from GOLS, GOTS, Made Safe, and Greenguard, My Green Mattress lives up to its name. Materials: My Green Mattress offers one type of mattress topper: an all-natural approach made with two inches of GOLS certified organic latex with a removable GOTS certified organic cotton cover. Mattress Topper Options: → Shop mattress toppers from My Green Mattress ‍ What should I look for in an organic mattress topper? If you’ve explored our roundup of sustainable mattresses, you already know that the sourcing, manufacturing, and distribution of your bed essentials really do impact your dreamworld — and the world we all share. Lots of standard mattress toppers are made from foams and materials that are not sustainably sourced, and might even include petroleum-based polyurethane or other toxic chemicals. Here are a few helpful insights on your eco-friendly mattress topper search to help you stay away from those not-so-friendly features: ‍ Materials The mattress toppers we’ve selected only use natural and organic materials. If you’re doing more research on your own, some solid eco-friendly fibers to search for include: Certified organic cotton Certified organic latex Certified ethical wool Bio-engineered foams ‍ Certifications Eco-friendly and organic mattresses are certified by trusted independent organizations that provide rigorous testing and regulations. These third-party environmental and health groups ensure strong standards for sourcing and manufacturing, keeping companies accountable so you can have the best product out there. Non-toxic mattress toppers are often certified or endorsed with the following labels: ‍ Environmental Impact Like with any ethical shopping choices, you should always keep a keen eye on a brand’s environmental impact reports and initiatives. Those who are truly dedicated to sustainability will share transparent information about carbon offsets, packaging, sourcing, and manufacturing, and more. Some may also have partnerships with environmental nonprofits like 1% for the Planet or Climate Neutral. ‍ Social Impact Lastly, another green flag for an ethical brand is the transparent reporting of supply chain and labor practices. Lots of these companies might have B Corp and Fair Trade certifications, so keep those at the front of your mind!","filter_flag":1}
{"title":"Shop Kate Bosworth's Blue Crush-Inspired Roxy Swimwear - POPSUGAR","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnBvcHN1Z2FyLmNvbS9mYXNoaW9uL2thdGUtYm9zd29ydGgtcm94eS1zd2ltd2Vhci1jb2xsZWN0aW9uLTQ5MTcwMzY40gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnBvcHN1Z2FyLmNvbS9mYXNoaW9uL2thdGUtYm9zd29ydGgtcm94eS1zd2ltd2Vhci1jb2xsZWN0aW9uLTQ5MTcwMzY40gEA?oc=5","id":"CBMiUGh0dHBzOi8vd3d3LnBvcHN1Z2FyLmNvbS9mYXNoaW9uL2thdGUtYm9zd29ydGgtcm94eS1zd2ltd2Vhci1jb2xsZWN0aW9uLTQ5MTcwMzY40gEA","guidislink":false,"published":"Wed, 10 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=130, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnBvcHN1Z2FyLmNvbS9mYXNoaW9uL2thdGUtYm9zd29ydGgtcm94eS1zd2ltd2Vhci1jb2xsZWN0aW9uLTQ5MTcwMzY40gEA?oc=5\" target=\"_blank\">Shop Kate Bosworth's Blue Crush-Inspired Roxy Swimwear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POPSUGAR<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Shop Kate Bosworth's Blue Crush-Inspired Roxy Swimwear - POPSUGAR","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnBvcHN1Z2FyLmNvbS9mYXNoaW9uL2thdGUtYm9zd29ydGgtcm94eS1zd2ltd2Vhci1jb2xsZWN0aW9uLTQ5MTcwMzY40gEA?oc=5\" target=\"_blank\">Shop Kate Bosworth's Blue Crush-Inspired Roxy Swimwear<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">POPSUGAR<\/font>","source.href":"https:\/\/www.popsugar.com","source.title":"POPSUGAR","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-conscious Materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Every editorial product is independently selected by our editors. If you buy something through our links, we may earn commission. We have a blue crush on Kate Bosworth's new swimsuits. The 40-year-old actor took us on a trip down memory lane, teaming up with swim and sportswear brand Roxy to create surfer-girl inspired swimwear. Inspired by the iconic fashion of her 2002 surfer hit \"Blue Crush,\" the sustainable collection features bright bikinis, cropped rash guards, and reversible one-pieces in a wide range of styles. Bosworth's chosen color palette is a fading sunset of oranges, pinks, and purples, with plenty of nostalgic Y2K prints. The collaboration also includes beachwear, from cozy sweatshirts and boardshorts, to knit dresses and miniskirts. Kindness is at the heart of Bosworth's collection, with some pieces promoting her creative platform, Kind. Est. \"Dream big, paddle hard, be kind,\" Roxy's site reads. \"Crush it like Kate in a sustainable collection designed for free spirits, big hearts and surf girls everywhere.\" While developing the new line, Bosworth kept the environment in mind, placing an emphasis on eco-conscious materials and practices. Consequently, the line is made up of environmentally-friendly fabrics like recycled nylon and organic cotton. Bosworth is the latest celebrity to drop a swimwear collaboration, joining celebrities like Pamela Anderson, who drew inspiration from \"Baywatch\" for Frankies Bikinis, and Sydney Sweeney, who also partnered with the brand on a romantic line speaking to her personal aesthetic. Read on to see some of our favorite pieces from Bosworth's collection, and shop her surfer styles below.","filter_flag":1}
