{"title":"Refrigeration chemicals are a nightmare for the climate. Experts say alternatives must spread fast - The Associated Press","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3N1c3RhaW5hYmxlLXJlZnJpZ2VyYW50LWNsaW1hdGUtY2FyYm9uLWRpb3hpZGUtYWlyLWNvbmRpdGlvbmluZy1hZmE1YmVmMGZkMWI5YzM2MDBiZTI1NDkxMDNiNTlkN9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3N1c3RhaW5hYmxlLXJlZnJpZ2VyYW50LWNsaW1hdGUtY2FyYm9uLWRpb3hpZGUtYWlyLWNvbmRpdGlvbmluZy1hZmE1YmVmMGZkMWI5YzM2MDBiZTI1NDkxMDNiNTlkN9IBAA?oc=5","id":"CBMie2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3N1c3RhaW5hYmxlLXJlZnJpZ2VyYW50LWNsaW1hdGUtY2FyYm9uLWRpb3hpZGUtYWlyLWNvbmRpdGlvbmluZy1hZmE1YmVmMGZkMWI5YzM2MDBiZTI1NDkxMDNiNTlkN9IBAA","guidislink":false,"published":"Mon, 16 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=289, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3N1c3RhaW5hYmxlLXJlZnJpZ2VyYW50LWNsaW1hdGUtY2FyYm9uLWRpb3hpZGUtYWlyLWNvbmRpdGlvbmluZy1hZmE1YmVmMGZkMWI5YzM2MDBiZTI1NDkxMDNiNTlkN9IBAA?oc=5\" target=\"_blank\">Refrigeration chemicals are a nightmare for the climate. Experts say alternatives must spread fast<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Refrigeration chemicals are a nightmare for the climate. Experts say alternatives must spread fast - The Associated Press","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL3N1c3RhaW5hYmxlLXJlZnJpZ2VyYW50LWNsaW1hdGUtY2FyYm9uLWRpb3hpZGUtYWlyLWNvbmRpdGlvbmluZy1hZmE1YmVmMGZkMWI5YzM2MDBiZTI1NDkxMDNiNTlkN9IBAA?oc=5\" target=\"_blank\">Refrigeration chemicals are a nightmare for the climate. Experts say alternatives must spread fast<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Associated Press<\/font>","source.href":"https:\/\/apnews.com","source.title":"The Associated Press","query":"https:\/\/news.google.com\/rss\/search?q=\"Cleaner Alternatives\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"PHILADELPHIA (AP) — When Jennifer Byrne, owner and technician at Comfy Heating and Cooling, gets a call to come and fix a relatively new air conditioning system, one of the first questions she asks is if the house has just been remodeled. Here in West Philadelphia, Byrne has found shoddy renovations where installers skip steps such as pressure testing after installation. That can result in ice buildup and leaks of the chemicals that cool, called refrigerants. “This problem is extremely frequent around here. Usually people tell you they bought a house that was flipped and all kinds of things are wrong, like the AC is freezing,” Byrne said, referring to the ice buildup. “Trying to get it done as cheaply as possible,” she added, as she hauled equipment out of her truck. Jennifer Byrne, owner and technician at Comfy Heating and Cooling, works on an air conditioning condenser unit in Philadelphia on Sept. 14, 2023. (AP Photo\/Joe Lamberti) Jennifer Byrne, owner and technician at Comfy Heating and Cooling, prepares a torch to repair an air conditioning condenser unit in Philadelphia on Thursday, Sept. 14, 2023. (AP Photo\/Joe Lamberti) Jennifer Byrne, owner and technician at Comfy Heating and Cooling, pulls a tank of refrigerant from the work truck in Philadelphia on Thursday, Sept. 14, 2023. (AP Photo\/Joe Lamberti) It’s not a small matter. When refrigerants leak out like this, they are highly destructive to the Earth’s sensitive atmosphere. They’re “the most potent greenhouse gases known to modern science,” as one research paper put it and they’re growing fast. One of the most common ones, with the unfriendly name R-410A, is 2,088 times more damaging to the climate than carbon dioxide, which comes from burning coal and gasoline. So an essential way that people are staying cool is making the world hotter and more unstable. This is why the Clean Air Act prohibits the intentional release of most refrigerants. With the Environmental Protection Agency required to phase out one family of the chemicals 85% by 2036, the push is on to develop and spread cleaner alternatives. Byrne’s truck is loaded with tools, canisters, hoses, and special sealed cylinders, including an industry-pink one that holds the potent R-410A. When she works on a leaking AC unit, she drains the remaining refrigerant into one of the cylinders for safe storage while she takes things apart. But these leaking home AC units are just one way refrigerants seep into the atmosphere, measurably raising levels and contributing to increasing extreme weather. Cans of R-134A refrigerant sit on the shelves of Cary’s Auto, Monday, Aug. 28, 2023, in Scottsdale, Ariz. (AP Photo\/Matt York) Cars are another source of these super pollutants, says Eckhard Groll, an expert in refrigeration and head of mechanical engineering at Purdue University. AC systems in gas-powered vehicles are “prone to leaking” and on average approximately 25% of refrigerant from all cars leak out every year. With more than 200 million gasoline cars in the U.S. alone, Groll said that amounts to approximately 100 million pounds of refrigerant leaking out into the atmosphere each year. Supermarkets are the second-biggest source of leaks because they are large and extensive piping carries refrigerant to each cold display case. Danielle Wright, executive director of the North American Sustainable Refrigeration Council, an advocacy group, said the average supermarket leaks approximately 25% of its refrigerant each year, which agrees with an Environmental Protection Agency document from 2011. “I wouldn’t say (supermarkets) are cutting corners necessarily, but let’s put it this way — it’s cheaper to leak the refrigerant than to build a leak-proof system,” Wright said. The need to minimize refrigerant leaks has spurred a reuse and reclamation industry. One company is A-Gas Rapid Recovery, which has facilities in Dallas, Texas, Toledo, Ohio and Punta Gorda, Florida, among others. Refrigerants can be used many times over and can last for 30 years, said Mike Armstrong, President of A-Gas in the Americas. The company takes in refrigerants and tanks from around the country and beyond, drains them, then purifies and reclaims the chemicals, shipping out recycled product. “Some technicians back in the day would literally just cut the line and vent the gas to the atmosphere,” said Anthony Nash, an A-Gas network training manager. Now, “the EPA and the regulations that we fall under make that not only illegal, but unethical,” he said. Refrigerant that cannot be reused goes through a very high-temperature process called pyrolysis so the gases are destroyed. Business is booming. “This industry is probably going to increase four to five times in the next couple years,” Armstrong said. An operator tests the contents of a used refrigerant cylinder in a lab at the A-Gas Rhome facility on Monday, Oct. 9, 2023, in Rhome, Texas. (AP Photo\/Sam Hodde) An operator prepares used cylinders to be drained of remaining refrigerant at the A-Gas Rhome facility on Monday, Oct. 9, 2023, in Rhome, Texas. The company takes in shipments of refrigerators and tanks from around the country and beyond, drains them, then purifies and reclaims the chemicals, shipping out recycled product. This prevents the need for new chemical production. (AP Photo\/Sam Hodde) Operators use a hoist to move a used refrigerant cylinder at the A-Gas Rapid Recovery DFW facility on Monday, Oct. 9, 2023, in Arlington, Texas. The company takes in shipments of refrigerators and tanks from around the country and beyond, drains them, then purifies and reclaims the chemicals, shipping out recycled product. This prevents the need for new chemical production. (AP Photo\/Sam Hodde) Used refrigerant cylinders sit in a warehouse at the A-Gas Rhome facility on Monday, Oct. 9, 2023, in Rhome, Texas. (AP Photo\/Sam Hodde) SUSTAINABLE REPLACEMENTS At the same time the chemical industry is looking for replacements. So far, some are much better for the climate, but could have other negatives, like being flammable, and their long-term impact on the environment isn’t known. A number of researchers are looking at carbon dioxide itself as a refrigerant. But Groll noted it has to be under extremely high pressure, requiring different systems. Carbon dioxide would be great “if we’re pulling it out of the atmosphere,” said Christopher Cappa, a professor of environmental engineering at the University of California, Davis. “But if we’re producing it just as a refrigerant, that wouldn’t be necessarily nearly as good.” “One could think of a future where we move to a largely fossil-free economy and our primary source of carbon dioxide would be pulling it out of the atmosphere,” Cappa said. Today, commercial buyers looking for cleaner refrigeration can find it. “This is kind of a low-hanging fruit, it’s a known technology and it’s market ready,” Wright said. But it’s a different story with air conditioning. Wright claims that lobbying efforts from chemical and HVAC equipment manufacturers, as well as certain codes and standards, have stalled the growth of cleaner refrigerants for air conditioners in the U.S. But one major manufacturer, Trane Technologies, said it has been working hard on cleaner alternatives, has selected one that is 78% less damaging than the current one, and will be phasing it into its units beginning in 2024. Jarad Mason, assistant professor of chemistry and chemical biology at Harvard University, of Watertown, Mass., holds a vile of cobalt-based hybrid material, Thursday, Sept. 14, 2023, in a lab on the school’s campus, in Cambridge, Mass. (AP Photo\/Steven Senne) Dan Laorenza, of North Andover, Mass., a post-doctoral researcher at Harvard University, places a vile of cobalt-based hybrid material among other hybrid materials being evaluated as candidates for solid refrigerants, in a lab on the school's campus, Thursday, Sept. 14, 2023, in Cambridge, Mass. The mixtures are part of research to develop a more environmentally-friendly solid refrigerant that could be used as an alternative to existing volatile refrigerants. (AP Photo\/Steven Senne) A copper-based candidate for a solid refrigerant is synthesized in a glass flask, center, Thursday, Sept. 14, 2023, in a lab on the campus of Harvard University, in Cambridge, Mass. The process is part of research to develop a more environmentally-friendly solid refrigerant that could be used as an alternative to existing volatile refrigerants. (AP Photo\/Steven Senne) Dan Laorenza, of North Andover, Mass., a post-doctoral researcher at Harvard University, monitors the synthesis of a copper-based candidate for a solid refrigerant in a glass flask, right, in a lab on the school’s campus, Thursday, Sept. 14, 2023, in Cambridge, Mass. (AP Photo\/Steven Senne) Jarad Mason, an assistant professor of chemistry and chemical biology at Harvard University, is working with fellow researchers to develop a refrigerant that’s actually a solid instead of a vapor. The mineral perovskite is good at absorbing heat under low pressure, allowing it to cool its surroundings. Solid refrigerant research is in it’s infancy, but Mason said that he is optimistic about its potential because it could be used in fridges, commercial buildings and homes. “Demands for heating and cooling are only going to increase and it’s absolutely critical that we have sustainable ways and economical ways of providing for everyone in the world,” he said. ___ Associated Press climate and environmental coverage receives support from several private foundations. See more about AP’s climate initiative here. The AP is solely responsible for all content.","filter_flag":1}
{"title":"Gasoline-to-Liquid Segment Takes Center Stage in the Synthetic Fuels Market, Offering Cleaner Alternatives for ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMC8yMy8yNzY0NjAxLzI4MTI0L2VuL0dhc29saW5lLXRvLUxpcXVpZC1TZWdtZW50LVRha2VzLUNlbnRlci1TdGFnZS1pbi10aGUtU3ludGhldGljLUZ1ZWxzLU1hcmtldC1PZmZlcmluZy1DbGVhbmVyLUFsdGVybmF0aXZlcy1mb3ItVHJhbnNwb3J0YXRpb24tYW5kLVBvd2VyLUdlbmVyYXRpb24uaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMC8yMy8yNzY0NjAxLzI4MTI0L2VuL0dhc29saW5lLXRvLUxpcXVpZC1TZWdtZW50LVRha2VzLUNlbnRlci1TdGFnZS1pbi10aGUtU3ludGhldGljLUZ1ZWxzLU1hcmtldC1PZmZlcmluZy1DbGVhbmVyLUFsdGVybmF0aXZlcy1mb3ItVHJhbnNwb3J0YXRpb24tYW5kLVBvd2VyLUdlbmVyYXRpb24uaHRtbNIBAA?oc=5","id":"CBMi4AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMC8yMy8yNzY0NjAxLzI4MTI0L2VuL0dhc29saW5lLXRvLUxpcXVpZC1TZWdtZW50LVRha2VzLUNlbnRlci1TdGFnZS1pbi10aGUtU3ludGhldGljLUZ1ZWxzLU1hcmtldC1PZmZlcmluZy1DbGVhbmVyLUFsdGVybmF0aXZlcy1mb3ItVHJhbnNwb3J0YXRpb24tYW5kLVBvd2VyLUdlbmVyYXRpb24uaHRtbNIBAA","guidislink":false,"published":"Mon, 23 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=296, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMC8yMy8yNzY0NjAxLzI4MTI0L2VuL0dhc29saW5lLXRvLUxpcXVpZC1TZWdtZW50LVRha2VzLUNlbnRlci1TdGFnZS1pbi10aGUtU3ludGhldGljLUZ1ZWxzLU1hcmtldC1PZmZlcmluZy1DbGVhbmVyLUFsdGVybmF0aXZlcy1mb3ItVHJhbnNwb3J0YXRpb24tYW5kLVBvd2VyLUdlbmVyYXRpb24uaHRtbNIBAA?oc=5\" target=\"_blank\">Gasoline-to-Liquid Segment Takes Center Stage in the Synthetic Fuels Market, Offering Cleaner Alternatives for ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Gasoline-to-Liquid Segment Takes Center Stage in the Synthetic Fuels Market, Offering Cleaner Alternatives for ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMC8yMy8yNzY0NjAxLzI4MTI0L2VuL0dhc29saW5lLXRvLUxpcXVpZC1TZWdtZW50LVRha2VzLUNlbnRlci1TdGFnZS1pbi10aGUtU3ludGhldGljLUZ1ZWxzLU1hcmtldC1PZmZlcmluZy1DbGVhbmVyLUFsdGVybmF0aXZlcy1mb3ItVHJhbnNwb3J0YXRpb24tYW5kLVBvd2VyLUdlbmVyYXRpb24uaHRtbNIBAA?oc=5\" target=\"_blank\">Gasoline-to-Liquid Segment Takes Center Stage in the Synthetic Fuels Market, Offering Cleaner Alternatives for ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Cleaner Alternatives\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Dublin, Oct. 23, 2023 (GLOBE NEWSWIRE) -- The \"Synthetic Fuels Market by Fuel Type (Methanol to liquid (MTL), Power to liquid (PTL), Gas to liquid (GTL)), Application (Gasoline, Diesel, Kerosene), End Use (Transportation, Industrial, Chemical ), and Region - Global Forecast to 2030\" report has been added to ResearchAndMarkets.com's offering. The global synthetic fuels market is poised for substantial growth, projected to reach USD 70.1 billion by 2030 from USD 48.4 billion in 2023, reflecting a notable Compound Annual Growth Rate (CAGR) of 5.4%. This burgeoning market is experiencing expansion across various regions, with Asia Pacific emerging as a prominent player, thanks to increased private sector investments fueling research and development in various applications of synthetic fuel. In the realm of fuel types, the gasoline-to-liquid segment took the spotlight, claiming the second-largest market share in 2022. Gasoline-to-liquid (GTL) fuel is a synthetic alternative to traditional diesel and gasoline, crafted by converting natural gas into a liquid form suitable for conventional engines. This conversion process involves steam methane reforming (SMR) or autothermal reforming (ATR) to produce syngas, followed by Fischer-Tropsch (FT) synthesis using catalysts. GTL fuel is versatile and finds applications in transportation, power generation, and heating, offering a cleaner energy option. The chemical & others end-use segment also held the second-largest market share in 2022. Synthetic fuels play a pivotal role in the chemical sector, reducing greenhouse gas emissions and dependence on fossil fuels. They serve as a carbon source for chemicals like syngas, used in methanol, ammonia, and synthetic hydrocarbon production, while also supplying hydrogen for various chemical processes. Furthermore, synthetic fuels align with green chemistry principles, offering a renewable, low-carbon alternative in chemical processes, making them a vital asset in achieving sustainability goals within the chemical industry. In terms of applications, the gasoline segment secured the second-largest market share in synthetic fuels in 2022. Synthetic gasoline, known as syn-gasoline, mirrors traditional gasoline and is generated via Fischer-Tropsch synthesis from carbon-containing inputs such as natural gas, coal, or biomass. It serves as a cleaner energy transition option, compatible with existing infrastructure and engines. Ongoing research and innovation are pivotal in advancing the synthetic fuels market, propelling its growth and sustainability. The rest of the world, comprising South America and the Middle East & Africa, emerged as the second-largest consumer of synthetic fuels worldwide in 2022. South America, including countries like Brazil and Chile, boasts a burgeoning synthetic fuels market due to its robust economy, manufacturing capabilities, and foreign investment. Meanwhile, in the Middle East & Africa (MEA), abundant natural resources such as natural gas, coal, and biomass provide a solid foundation for synthetic fuels production. MEA's growing focus on hydrogen as a feedstock, particularly through green hydrogen initiatives, supports synthetic hydrocarbon production, aligning with Saudi Arabia's ambition to become a top hydrogen supplier and contributing to the global growth of the synthetic fuels market. Key Highlights: Synthetic Fuels Market Driven by Increased Demand from Aerospace & Defense, Marine, and Other Sectors. Asia-Pacific to Account for the Largest Market During the Forecast Period. Power to Liquid Fuel to Register the Highest CAGR During the Forecast Period. Transportation Segment Accounted for the Largest Market Share in 2023. Kerosene to Register the Highest CAGR During the Forecast Period. Market Dynamics: Drivers: Investment by Private Players Boosting Research and Development. Diversification in Primary Energy Mix. Restraints: High Cost of Synthetic Fuel. Growing Market for Electric Vehicles and Alternative Fuel. Opportunities: High Potential Use of Synthetic Fuels in Various Applications. Introduction of Carbon Pricing Mechanism and Tax Credits for Synthetic Fuel Production. Challenges: Difficulty in Achieving Economies of Scale in Synthetic Fuel Production. Case Study Analysis: Porsche's Carbon-Neutral Synthetic Fuels from Thin Air Honeywell's Uop Refining Technology Pioneers Sustainable Aviation Fuel Companies Mentioned: Chevron Renewable Energy Group Chn Energy Investment Group Co., Ltd. Dakota Gasification Company ExxonMobil Corporation Inner Mongolia Yitai Coal Co., Ltd. Linde Engineering Maire Tecnimont S.P.A. Neste Norsk E-Fuel Petro Sa Prometheus Fuels Qatarenergy Rwe Saf+ Consortium Sasol Shell Skynrg Sunfire GmbH Synhelion Sa Synthesis Energy Systems, Inc. Topsoe Totalenergies Virent, Inc. Key Attributes: Report Attribute Details No. of Pages 222 Forecast Period 2023 - 2030 Estimated Market Value (USD) in 2023 $48.4 Billion Forecasted Market Value (USD) by 2030 $70.1 Billion Compound Annual Growth Rate 5.4% Regions Covered Global For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/ch3i84 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
