{"title":"Trending: Upcycled Cosmetics, Circular Beauty - Cosmetics & Toiletries","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2FuZHRvaWxldHJpZXMuY29tL3Jlc2VhcmNoL2NvbnN1bWVycy1tYXJrZXQvbmV3cy8yMjg2MjE2Ni90cmVuZGluZy11cGN5Y2xlZC1jb3NtZXRpY3MtY2lyY3VsYXItYmVhdXR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2FuZHRvaWxldHJpZXMuY29tL3Jlc2VhcmNoL2NvbnN1bWVycy1tYXJrZXQvbmV3cy8yMjg2MjE2Ni90cmVuZGluZy11cGN5Y2xlZC1jb3NtZXRpY3MtY2lyY3VsYXItYmVhdXR50gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2FuZHRvaWxldHJpZXMuY29tL3Jlc2VhcmNoL2NvbnN1bWVycy1tYXJrZXQvbmV3cy8yMjg2MjE2Ni90cmVuZGluZy11cGN5Y2xlZC1jb3NtZXRpY3MtY2lyY3VsYXItYmVhdXR50gEA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2FuZHRvaWxldHJpZXMuY29tL3Jlc2VhcmNoL2NvbnN1bWVycy1tYXJrZXQvbmV3cy8yMjg2MjE2Ni90cmVuZGluZy11cGN5Y2xlZC1jb3NtZXRpY3MtY2lyY3VsYXItYmVhdXR50gEA?oc=5\" target=\"_blank\">Trending: Upcycled Cosmetics, Circular Beauty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics & Toiletries<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Trending: Upcycled Cosmetics, Circular Beauty - Cosmetics & Toiletries","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LmNvc21ldGljc2FuZHRvaWxldHJpZXMuY29tL3Jlc2VhcmNoL2NvbnN1bWVycy1tYXJrZXQvbmV3cy8yMjg2MjE2Ni90cmVuZGluZy11cGN5Y2xlZC1jb3NtZXRpY3MtY2lyY3VsYXItYmVhdXR50gEA?oc=5\" target=\"_blank\">Trending: Upcycled Cosmetics, Circular Beauty<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics & Toiletries<\/font>","source.href":"https:\/\/www.cosmeticsandtoiletries.com","source.title":"Cosmetics & Toiletries","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"According to alliedmarketresearch, the estimated market size of upcycled cosmetic ingredients was valued at $231.5 million in 2021 and expected to reach $433.5 million by 2031, growing at a CAGR of 6.6%. Sustainability trends has garnered interest in the upcycled cosmetic ingredients market. With progress being made in research and expansion of the full utilization of ingredients, the option to upcycle ingredients is becoming more viable. According to alliedmarketresearch, the estimated market size of upcycled cosmetic ingredients was valued at $231.5 million in 2021 and expected to reach $433.5 million by 2031, growing at a CAGR of 6.6%. With the market expected to nearly double in a 10 year span, upcycled products can be expected to make their way into many new products. Trends in Upcycled Cosmetics Sustainability is often found in company commitments and leads many discussions during shows. The voice for creating more green products is alive and well, and so are the vast number of methods that allow more sustainable products to be made. Upcycled cosmetics is one of the many eco-friendly methods being utilized today and has found success in the following ingredients and companies: Kaffe Bueno is a Danish bioscience company known for upcycling coffee by-products into active and functional ingredients for personal care, nutraceuticals and functional food and beverages. The company recently released four active ingredients for various skin and hair care applications, including Kaffoil-R (INCI: Coffea Arabica Seed Oil), recommended for serums and face oils, shampoos and conditioners, scalp care, lotions, soaps, sunscreens and more. IFF has also stepped into the upcycled space with Genencare OSMS MI (INCI: Inositol), a highly purified myo-inositol and natural osmolyte that can support claims for products that energize skin. The Upcycled Beauty Company, a company that creates many upcycled ingredients, recently launched a hummus hair care ingredient: Faba TONIQ (INCI: Cicer Arietnum Seed Extract, Benzyl Alcohol). Manufactured from a by-product of hummus production, the ingredient adds to the company's range of water-soluble actives, including Gin TONIQ (INCI: Saccharomyces\/Barley Seed Ferment Filtrate, Glycerine) and Barley TONIQ (INCI: Hordeum Vulgare Extract, Propanediol). Hallstar France has also stepped into the upcycled beauty space with FILL Oléoactif (INCI: Olea Europaea (Olive) Fruit Oil (and) Polyglyceryl-4 Oleate (and) Myrtus Communis Leaf Extract (and) Olea Europaea (Olive) Leaf Extract). The natural, liposoluble active ingredient has been developed with sustainable sourcing (upcycled, local French origin) and was featured at in-cos Global 2023. Circular Beauty The January edition of Cosmetics and Toiletries magazine published a study on upcycled cosmetics which discussed the significance of circular beauty and what steps may be necessary to achieve it. According to the article, circular beauty requires companies to overcome several challenges, including selecting proper extraction methods and ensuring the safety of cosmetic formulations containing upcycled ingredients. Further, the study utilizes the upcycled journey of the cloudberry to outline the difficulties that companies face with circular beauty, mentioning the additional issue of communicating sustainable and clean ingredients to consumers. Circular beauty and upcycled ingredients are closely related, as upcycling aims to eliminate waste, circular beauty strives to function similar to the water cycle, constantly recycling into itself in order to create little to no waste. Unlike other sustainable methods, such as organic ingredients or advancements in biotechnology, upcycling beauty hopes to use sustainable ingredients in a sustainable manner. ","filter_flag":1}
{"title":"Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5\" target=\"_blank\">Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZyZnN0LjIwMjMuMTA3MzY2M9IBAA?oc=5\" target=\"_blank\">Sustainable side-stream management in Swedish food processing companies using external actors and biogas solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Side-stream management in food processing companies has the potential to improve sustainability performance by upcycling or managing bio-residuals into high-value products. This article investigates how food processing companies manage their side-streams by studying their sustainability reports, interviewing the companies, identifying external or internal side-stream management alternatives, and qualitatively analyzing the data. By learning more about how food processing companies prefer to manage their side-streams, it becomes easier to develop ideas for further refining of bio-residuals. One of the main results is that most of the companies prefer to use external actors for side-stream management and for processing them into high-value products, rather than developing and investing in the technology themselves. The few actors investing in side-stream management themselves have long-term strategies on how to become more sustainable and circular. This study also identifies biogas solutions through anaerobic digestion to have a special role in side-stream management due to its versatile and multifunctional nature. 1 Introduction The circular bio-economy is important as fossil products, to a larger extent, need to be replaced by bio-based ones, which means energy, nutrients, plastics, chemicals, and more need to be sourced from bio-based resources. Food production is one of the major contributors to environmental change and has a significant role in transitioning towards a more sustainable society. Recirculation of nutrients is becoming more prominent as the production of mineral fertilizers today is energy intensive and we approach phosphorus depletion (Sherwood, 2020). A focus on side-stream management within food industries can improve nutrient recovery and reduce environmental impact from the food processing company value chain. A large impact derives from agriculture and animal husbandry activities, but there is still environmental work to be done by food processing companies regarding side-streams. Sustainability strategies are important for food processing companies since customers and other stakeholders have high demands (Lozano, 2015). Commonly, packaging, transport, reducing waste, and technology improvements in industrial plants are common measures taken when food processing companies try to reduce their environmental impact. Side-streams always arise in food processing companies, and they can be managed in several ways. In this article, side-streams are defined as all flows\/streams not considered main products, thus including by-products, solid waste, and wastewater. The term side-stream is used as it gives the organic flow more value compared to calling it waste flow and is also used by practitioners (Adven, 2022; Metsä Group, n.d.2022). Value is used in this article and means benefits related to economic, environmental, societal, or business-related impacts of the side-stream management of the companies. When food processing companies manage their side-streams, they can be guided by the food waste hierarchy, following the steps of prevention, re-use, recycle, recovery, and disposal (Papargyropoulou et al., 2014), with the recent addition of upcycled food products and specific recirculation alternatives (Figure 1). FIGURE 1 FIGURE 1. Food waste hierarchy (based on the study by Moshtaghian et al., 2021). Valorization of food processing side-streams as animal feed is one of the most common practices in many settings (Otles et al., 2015). There is often potential for more high-value solutions, and side-stream management could provide an economic or environmental advantage (Garcia-Garcia et al., 2019). Legalization regarding food waste is improving, but there are still issues; for example, processed waste can be non-classified for human consumption, and thus, further development is impossible (Garske et al., 2020). The scientific literature regarding side-stream management in food industries focuses, to a large extent, on high-value products to be extracted from different food waste streams (c.f. Pfaltzgraff et al., 2013; Ravelli and Samorì, 2021), or a waste biorefinery approach (c.f. Alibardi et al., 2020; Chen et al., 2018; Dahiya et al., 2018), or the life-cycle impact of different treatment methods (c.f. Fei et al., 2022; Kobayashi et al., 2023; Xu et al., 2015). Yet, more research is needed regarding the role side-streams have in food processing companies’ sustainability strategy, business models, and if side-streams should acquire more attention than before. There are identified research gaps by Klitkou et al. (2019) and Salvador et al. (2021) regarding lack of business models for valorization of side-streams and the circular bio-economy in general. Therefore, this paper investigates if, and how, side-stream management is integrated into sustainability strategies among food processing companies and how they organize their management and use of side-streams. Sustainability strategies reflect long-term ideas for how the food processing company can reduce its environmental impact. The institutions and the food processing companies can work together to develop commercially viable processes for side-stream management according to Khedkar and Singh (2018). When it comes to the management literature, Magnusson et al. (2019) developed a framework for recovery of side-streams in manufacturing firms, and they identified four main alternatives for recovery and use of side-streams based on internal or external activities. Their article is like a bridge between this one and the field of industrial ecology and business strategy. There is more to learn from food processing industries regarding their perspective on side-streams and circularity and, especially, the side-streams seen as lower valued. Using side-streams as animal feed or for biogas solutions can mitigate global warming and recover energy and fertilizer (Hagman et al., 2020), which contributes to the development of more environmentally sustainable handling of different food side-streams and keeps valuable resources in a circular system (Scherhaufer et al., 2020). Biogas solutions include anaerobic digestion of organic streams, where biogas is produced and can be used as energy either directly, through a generator, or upgraded to fuel; in addition, a nutrient and fiber-rich digestate is produced in biogas plants, which can be used as biofertilizer (Wellinger et al., 2013), as biochar, or dried as an incineration fuel. Their other advantage is that they involve the return of nutrients to food-producing fields. There is an important role for biogas solutions to play in the transition into more bio-based synergies between industries (Medkova et al., 2019; Vanhamäki et al., 2020), not only as a bio-refining concept but also as a hub for surrounding industries (Lybæk and Kjær, 2021) and for improved nutrient recovery from digested streams (Vaneeckhaute et al., 2017). Biogas solutions are multifunctional (Lindfors et al., 2020) and versatile (Mountraki et al., 2016). This means they can have several roles in a bio-based cluster, such as waste management, wastewater management, energy provision, or fertilizer production. Biogas solutions can handle a range of diverse types of substrates and are useful even when the quality of the residuals is not high enough for feed or when materials are bulky and expensive to transport (Pereira et al., 2013). To use biogas solutions at the end of a cascading sequence, a company may improve the value of its raw material while generating products useful for its suppliers and energy for its production facility (Fagerström et al., 2018). This article aims to investigate how food processing companies manage and consider their side-streams with a special focus on biogas solutions as a management alternative. This topic will be studied in the light of sustainable strategies of the companies. The structure of the article is as follows: Section 2 provides a description of methods used; Section 3 provides the results and analysis of how the side-stream management is organized, connected to strategy, and motivated; and Section 4 provides a discussion including circularity of side-stream management and the role of biogas solutions. 2 Methods This article is based on a qualitative research approach (Bryman, 2016, chap. 17). Fifteen identified study objects from the Swedish food processing industry were asked to participate in this study, and ten of these were identified as the largest (based on turnover), according to largestcompanies.se January 2021 and, thus, covering a large part of the Swedish food market. In Sweden, the presence of large and centralized private or cooperative food processing actors is common. The remaining five were chosen as they had established biogas solutions as a side-stream management; three of these were identified by Google search using the keywords (“food processing company” +biogas + Sweden), and two were known from previous studies by the author. The study objects are chosen to assure that biogas solutions could be focused upon in the cases. 2.1 Data collection A desktop study was performed, focusing on the study objects’ websites and sustainability reports. In Figure 2, the method is illustrated. FIGURE 2 FIGURE 2. Method description regarding study objects chosen, desktop review performed, and focus areas for interviews. Following the desktop study, interviews were conducted during 2021. Within the companies, the aim was to contact sustainability managers who would have a good perspective of the company’s organization and sustainability ambition together with the business strategies, while still having some knowledge of what happens to the side-streams. In some cases, if the sustainability manager could not be reached, then perspectives of employees working with side-streams were then used together with the information from the sustainability reports. Among the 15 contacted companies, 12 chose to respond to an interview, and the results are based on these 12 companies’ responses and background information. The three non-participating companies belonged to sectors included among the other companies. The interviews were semi-structured, and after the respondents (Table 1) had introduced themselves with background and work descriptions, attention was on five focus areas: management alternatives for side-streams, biogas solutions, factors for choosing side-stream management, business strategy and collaboration, and sustainability work and organization. TABLE 1 TABLE 1. Side-streams and side-stream management for all interviewed cases are presented. In addition, information about the respondents is also included. The first results show the type of side-streams (defined by the companies themselves) and what they are used for. These results are followed by how the actors consider their side-stream management. 2.2 Data analysis The first part of the analysis, reported in Section 3.2, uses the informant’s description of their business and collaboration strategies and the sustainability reports to analyze the company’s sustainability ambitions. It looks at the company’s long-term visions, plans for circularity, and role of the environmental issues. The second part of the analysis is based on the side-stream options found at the companies, and a framework given by Magnusson et al. (2019) is applied. The framework originates from manufacturing firms and how they manage their recovered resources. They perform recovery either internally or by external actors, and the product can then be used internally or sold externally. In this paper, it is reorganized according to Figure 3. The side-stream management mapped through the interviews is categorized into this framework, and the result shows the connection between a company’s side-stream management and way of including external actors. FIGURE 3 FIGURE 3. Analysis method restructured from the work of Magnusson et al. (2019). Another analysis of the data identifies a hierarchy among the side-stream management alternatives based on responses from several actors who ranked side-stream management options in the interviews. Because of biogas solutions’ nutrient recovery and potential for circularity within the value chain, there are specific discussions regarding this as a side-stream management option and the connections to a company’s sustainability strategy. 3 Results and analysis 3.1 Descriptions of the side-stream management among the studied cases The companies participating in this study represent several types of food processing companies. In Table 1, the specific side-streams and types of management alternatives are listed. There is a range of various kinds of side-streams connected to dairies, slaughterhouses, vegetable processing, and fats, which are often used as food components, feed, or biogas solutions. Focus has been on the flows, which the companies themselves see as side-streams; for example, slaughterhouses have several products that could be considered side-streams but are commonly used as products and are, therefore, not included. The results are based on activities in Sweden. Actors with activities in other countries mention that the circularity has not been prioritized, partly because landfilling is a cheap alternative, but food donations are also more common in these countries. 3.2 Results and analysis of sustainability and business strategies within the companies The business strategy is to produce food and generate returns for shareholders. Side-streams are not prioritized among most food processing companies. Their sustainability strategies focus on reducing CO 2 emissions by using fossil-free fuels and energy sources, energy efficiency measures, and smarter packaging. The main driver for this is the increased pressure from consumers and stakeholders. The studied companies have worked for a few years on improving their own climate emissions, and, recently, several of them have set up science-based targets, which are in line with the Paris 2015 agreement (Science Based Targets, 2022). They address the full value chain’s sustainability impact, and the results show that approximately 90% of the value chain’s impact is in the food-producing stage according to several respondents. The studied companies identify that collaboration with upstream partners or reducing food losses are other keys to improve the value chain’s sustainability. Other aspects discussed in company groups with activities outside Sweden are water quality and security. Upcycling side-streams into food products is also becoming more interesting; because some of the actors in this category have a wider range of products, the development potential for new food from side-streams is easier. Secondary products, which earlier could be sold at the local industrial plant, can now be sold as specific products, marketed to improve resource efficiency, on the regular market. The author can identify two ambition levels regarding the companies’ sustainability strategies, based on information from interviews and sustainability reports. Some actors work with sustainability because customer demand has increased, but their main aim is to generate more money for their shareholders. Others invest large amounts of money in improving circularity and product development, as they see a need to work with this question for the environment’s sake, although economic results are still important. When the companies in the first category discuss sustainability strategies for side-streams, economical, climate-related, high-value, and organizational aspects are in focus. The economical aspect is prioritized for these companies, and sustainable action is becoming more justified with more economic reasoning than a decade ago. Most actors are reactive to the stakeholders and changes in society demanding sustainable products and improved animal welfare. One company has not had high stakeholder and customer demands and noticed that its sustainability work lagged behind. Most of the companies find sustainability important and high on their agenda, yet they connect reduced climate impact with the possibility to reduce costs or market themselves. Circularity is not always an integrated strategy for these companies, but they are moving in that direction. The organization for sustainability in these companies differs; some have a group of people, others have sustainability managers who are putting the responsibility on plant managers, and others try to integrate sustainability in everyday work. When the companies in the second category talk about strategies for side-streams, they work proactively to ensure sustainable operation in the future. Sustainable investments can be more expensive, as it becomes a competitive advantage. One company uses two investment budgets, one for long-term projects with a sustainability focus allowing a pay-off of 10–15 years and a regular one. Another company, family-owned, allows longer pay-off times compared to regular projects with only 3–5 years pay-off. Several actors in this category point out that customers and partners need to accept sustainable products cost more because they require higher investments and work intensity. The companies are working with this aim to integrate sustainability into the whole company and educate their employees on how to think and act. They monitor their side-streams to be able to identify further valorization alternatives for the streams. They mention that stubbornness is important to see change, as sustainability actions can be slow to get through. Most of these companies market their solutions very little; they are mentioned on websites and in sustainability reports, but some just see it as a natural way to work and have not considered it a unique selling point. 3.3 Analysis of side-stream management among food processing companies The prioritization among interviewed actors is to reduce side-streams and ensure that fewer side-streams are generated. After that, it is preferred to either partner with external companies or invest in technology themselves regarding high-value components, like xylitol, or new food products. New food products could include sales of secondary products or side-streams refined into new products. The will to invest in innovative technology for side-streams is low, and most actors prefer if external actors want to buy the side-streams for further valorization; this is often true for lower-valued solutions. An example was a company with beetroot juice, which could be further refined to coloring additives, but the food processing company did not want the investment and no external actor was found. The choice of management for their side-streams can depend on the communication value of the solution. High-value components or new food products can be good to communicate or as feed, and biogas solutions can be communicated as local and circular options. There are other reasons why an option is chosen; one company mentioned that a side-stream they wanted to use as feed required quality analysis to be approved, and as soon as it was approved, they were not eager to change management alternatives as they had paid for the tests to use it as feed. The most important factor for the food processing companies is that side-streams do not end up in incinerators or landfills. The management alternative can come with a risk as well. The demand for slaughter wastes as feed for the fur industry disappeared overnight when Denmark killed all their ferrets during the COVID-19 pandemic. It was a side-stream market in decline, so options like salmon feed and biogas production had been identified, but it was problematic to change with such short notice. It is common for food processing companies to be aware of and follow the food waste hierarchy. Figure 4 shows how food processing companies in general have chosen to recover their side-streams and how they use the recovered product. A company can appear in several squares, as they may have several side-streams and management alternatives. FIGURE 4 FIGURE 4. This figure illustrates how the studied companies manage their side-streams in relation to external or internal actors for the recovery of side-streams and use of recovered products. Open solutions are applied in all case companies on one or several side-streams. This option is driven by economic benefits, focusing on core business and a smooth solution. The food processing companies claim that those best suited to valorization should ensure it. Sustainability strategies have a role in open cases where higher valorization by an external actor is preferred. Business-related advantages with open solutions are that uncertainties are put to the external actors, as they make the necessary investments and manage the sales and marketing, and the food processing company can focus on ensuring that the operation runs smoothly with their external partners and that they stay in business (Magnusson et al., 2019). For food processing companies with large (often liquid) flows, alternatives which can manage the full volume are preferred to have long-term contracts with, such as biogas solutions. The open strategy depends on potential products produced from the side-stream, how much additional processing is needed, and how long transportation is required to valorize the side-stream. In open systems, biogas solutions are useful in local settings with short transportation or distribution through pipes. Depending on the distance, the income from biogas solutions is low for the food processing company; instead, values from regional development, reduced transportation, nutrient recirculation, and sustainability strategies are arguments for biogas solutions in open systems. The food processing company can sign long-term contracts with one side-stream actor who manages the side-streams in different parts of the country, and they can then get invoices and data directly from that company, which facilitates the side-stream management that can require significant paperwork for the food processing company due to reporting demands. The side-streams are monitored monthly and followed up on to see where further improvements are possible. Outsourcing among all the studied cases includes a biogas component. There is an internal energy demand in the production plant which can be replaced by biogas, but they do not have the capacity to produce the biogas themselves, so they deliver side-streams for biogas production and buy the produced gas. This seems common when there is a local biogas plant, and the food processing company has goals to replace fossil fuels and reduce CO 2 emissions. It requires long-term agreements to reduce uncertainty regarding deliveries in these setups as the food processing company is extending its value chain (Magnusson et al., 2019). The food processing industry’s side-stream volumes may be too small to invest in a biogas production facility itself, and so prefer to buy gas from a co-digestion plant. The business value lies in improving sustainability performance by using biogas instead of fossil fuels. Diversification is chosen by actors who have side-streams through which they recover or upgrade to food products in four cases and oleochemical products in the fifth. In those cases, the upgraded product lies within their business strategy: “to produce high-value food products or fatty products.” They are not moving outside their business idea by refining these products. These companies see a value in their side-streams and integrate them into the business strategy because they become products that are easy to incorporate into the overall business strategy. The sustainability aspect of this alternative is important, as food is a prioritized product for a food processing company, and it reduces the need for other food products. Drivers for these solutions are either economical or part of the sustainability strategy. One company invested in technology to extract a high-value sweetener component, as the economic performance would improve and because the circular economy discourse in society inspired them to develop new products. By diversifying and creating new products from side-streams, new markets may open to the food processing company, but it comes with additional costs for technology, marketing, and potentially sales (Magnusson et al., 2019). Closed arrangements are applied by companies recovering their own side-streams and are often used for internal energy purposes. These solutions are common in wastewater streams or when flows of by-products are large, and the produced gas has enough value to replace external energy. In four cases, biogas solutions are used as a closed system, and the final alternative is bio-oil for energy. These companies have made the investment to become more self-sufficient in energy. The companies could save money by producing energy from internal waste or wastewater flows and cost reduction is a motive for change (c.f. Van Beers et al., 2007). It was important for some of the actors to produce their own energy and reduce their climate impact. Two of the companies find the circularity of nutrients important, as they either have their own farm to fertilize or collaborate with farmers. Closed systems are useful if the company has internal needs for the recovered products and is willing to invest in technology for recovery (Magnusson et al., 2019). 3.4 Hierarchy of side-stream management Improving resource efficiency implies that the food industries need to prioritize how to manage their side-streams. Based on the responses from the case studies, a hierarchy within food side-streams can be constructed (Figure 5), which is more specific in the re-use, recycle, and recovery steps in the food waste hierarchy compared to earlier examples (Papargyropoulou et al., 2014; Moshtaghian et al., 2021). It is illustrated as a staircase rather than a pyramid since volumes going into different treatments can vary, and large volumes of low-quality side-streams can be diverted to steps further down the hierarchy. Another difference is that anaerobic digestion is equal to feed, which in other hierarchies is often ranked lower (Papargyropoulou et al., 2014; Moshtaghian et al., 2021). Still, higher-value products should be prioritized, and biogas solutions can often manage side-streams originating from these upcycled products. FIGURE 5 FIGURE 5. Hierarchy among side-stream management alternatives ranging from high-value chemicals to food, bioenergy, and feed. To a large degree, the staircase hierarchy focuses on economic factors; higher-ranked options, for example, pay better. The options that are the hardest to separate among the respondents in this stair-based hierarchy are the feed and biogas alternatives (circled in Figure 3), which are often the main competitors for lower-quality residuals that are not fit for human consumption. Which one of these is chosen is related to the availability of the local actors. Biogas solutions have the advantage of handling larger volumes than most feed customers do. Biogas solutions are chosen instead of feed if the company desires to produce its own energy or when agricultural actors are already collaborating with the food processing company, and the biofertilizer is valuable to them; otherwise, feed is the chosen option. 4 Discussion 4.1 Implementation of sustainable side-stream management According to the interviews, side-streams did not have a prominent role in business or sustainability strategies among the food companies a decade ago, but with the growing discourse about circular economy, the interest increased, which was also put forward by Kähkönen and Lintukangas (2022). The companies find it attractive to be a part of a circular system instead of a linear one, both from a financial and market perspective. The side-stream management can be inspired by other actors in the same sector, and the Swedish Food Federation is working more actively with improving sustainability among their members (Swedish Food Federation, 2019). One case study, which has been in action for generations, has ambitious sustainability plans to assure the company will survive for many more generations. Ferreira et al. (2021) also suggested that family businesses have more long-term perspectives compared to competitors in their area, indicating higher sustainability ambitions than others. Klein et al. (2022) studied agri-food companies handling potatoes and concluded that the industry needs to reform their business model to become more sustainable and see side-streams as a value rather than a waste, but this transformation is affected by both internal and external factors, and they also identified external partnerships as important in the development. Klein et al. (2022) put the finger on what this article will show: business models need to be thought through to improve sustainability in these value chains and external partners are important to assure a sustainable use of side-streams. Research focusing on business models regarding side-streams in the agri-food sector is not common, but this article can strengthen the results of Klein et al. (2022), as multiple cases show comparable results. Actors preferring internal recovery of their side-stream often do so when new food products can be produced out of a side-stream. Magnusson et al. (2019) showed that valorizing side-streams internally can be tempting but hard, as it requires investments and comes with a risk. Deciding what kind of products should be produced from the side-stream can be hard; in scientific literature, there are a large number of articles focusing on bioenergy recovery rather than higher-valued physical products according to Jones et al. (2022). The organization around the side-stream management, therefore, needs to be assessed, and Lybæk and Kjær (2021) identified biogas solutions to be an attractive hub for circularity in a region rather than a component at biorefineries to improve circularity. Lybæk and Kjær (2021) demonstrated that agricultural residuals can be managed in a more circular way by extracting high-value products like wax and furfural substrates and that a biogas plant would function as a hub among the refining actors. These actors are typically small but can contribute with simple biorefinery modules in a region. The idea is to combine product development from side-streams but also recovery energy. Business models for circular economy may inspire food processing companies on how to manage their side-streams. Similar to the work of Lybæk and Kjær (2021), an article by Tsvetkova and Gustafsson (2012) points out the modular approach, where actors surrounding biofuel production plants, in their case, support the main actor with distinct functions, creating a bio-based local system that is reliable and persistent. The circular approach is driven by the close collaboration within the value chain, and biogas solutions are useful when the side-streams’ quality is low, and nutrients can be recovered locally according to the work of Feiz et al. (2021). Biomass production, nutrient flows, and energy use are interlinked, and biogas solutions could provide options for improving nutrient recycling as well as allowing for bioenergy production, which does not compete with food production (Koppelmäki et al., 2021). Partnerships, value creation, and circularity play important roles when choosing internal recovery of side-streams among the studied cases. Partners that manage side-streams are often found locally, and several actors highlight the local circularity as important for their choice. This is in line with the work of Feiz et al. (2021) who identified local development to have a role in bio-based clusters with biogas solutions. While some see their side-stream partners as part of the business strategy, others focus on the economic value where the partners help in valorizing side-streams and food industry companies can focus on their core business. High-value components are investigated to improve circularity and income, and several actors in this study have started to look at biochar from their carbon-rich side-stream. Biochar is a way of improving carbon storage in soils (Lehmann et al., 2011). The implications of these results show how a more resource efficient management of side-streams will be developed and what arguments are brought forward for different alternatives among practitioners. It can impact what strategies food processing companies will have when they need to find higher-valued uses of their side-streams. The results are useful in places where large food processing companies are common, where similar business strategies are applied, and where the management of bio-based waste is regulated in some way. 4.2 Role of biogas solutions Food processing companies need to work with the full value chain to ensure sustainable practices; this includes cascading and upcycling between products and energy solutions. Biogas can be a suitable finish in a resource-efficient bio-economy (Hagman et al., 2018). Lyng et al. (2018) observed that biogas solutions are well integrated in a value chain and improve the sustainability performance of the system. In one of the cases studied in this article, a food processing company has close collaboration with the delivering farms; it sees value in delivering biofertilizer back to these farmers, which will reduce the overall environmental impact when replacing mineral fertilizers or reduce costs compared to other organic approved fertilizers. Even if side-streams should be avoided and high-value products prioritized according to Lybæk and Kjær (2021), the role of biogas solutions is to connect the farmers producing the food with the processing companies refining the products, creating a truly circular system thanks to the nutrient recovery (Carey et al., 2016; Vaneeckhaute et al., 2017). This study shows that a beneficial solution can be used to combine manure-based biogas plants at farms with input from low-value side-streams from the food processing companies, as short transportation distances were preferred among the respondents. The results from Feiz et al. (2021) showed that nutrient recovery improved and transportation was reduced when applying biogas solutions compared to other alternatives, which may be of importance when food industries choose the management option. Other options for biogas solutions are when no higher-valued solutions can be identified, or the high-value extraction results in low-value side-streams, or if alternatives are too costly to perform due to transportation, or if circularity is important and the nutrient recovery is prioritized. Fagerström et al. (2018) suggested that a company may improve the value of its raw material while generating products useful for its suppliers and energy for its production facility through biogas solutions. That is in line with the results from the respondents in this article as well but the diversity of solutions that can potentially be realized from a biogas solution is not considered among most of the companies. Instead, few companies bring up the nutrient and fiber aspect when recovering side-streams. The nutrient question may not be so high on their agenda as climate impact and CO 2 emissions are the priority among most companies and perhaps the nutrient issue is not well known. It is worth noting that composting, a nutrient recovery option, was not mentioned as an alternative among any food processing company in the study. The nutrient issue has become more pressing lately and will most likely be considered more in the future. The nutrient aspect of sustainable side-stream management in food processing companies should be further explored. Biogas solutions have long been viewed as an energy recovery step that is often far down in the food waste hierarchies by Moshtaghian et al. (2021) and Papargyropoulou et al. (2014). This article shows that biogas solutions have a natural role in the food processing company’s side-stream management because of the additional possibility to recover nutrients and its versatile nature. When food waste cannot be avoided, Stone et al. (2019) identified further valorization to increase a company’s resilience. With these results, the biogas sector can better understand what customers are looking for when comparing, for example, feed options and biogas options. Transportation distance, payment, and connection to farmers in need of digestate are reasons to choose biogas solutions over feed options. This can help them in choosing market strategies and their customer relations. 5 Conclusion This article focuses on the strategic role of side-stream management in food processing industries. The interviewed Swedish companies are good at valorizing their side-streams, but there is potential to create more value. If external actors are available, food processing companies prefer external management rather than investing in innovative technology themselves, developing into a biorefinery. With this knowledge, local networks to valorize food processing side-streams can be developed. The results from this article add to the existing literature an insight that side-stream management can be organized in several ways and that food processing companies often prefer external actors to manage their side-streams, which is in line with earlier research. However, more information on the characteristics of partnerships and interactions is needed to make more conclusive statements. Companies with a circular approach in their sustainability strategy regarding their side-stream management seem to be more active in identifying new alternatives and accepting long-term investments. Embracing the side-stream management has the potential to improve sustainability, resource efficiency, and the value for the company. When high-value products and new food products are extracted from the side-streams, the remaining fraction is often suited for a biogas solution to recover its energy and nutrients. If food processing companies work more within their own value chain, biogas solutions can improve sustainability performance for the agricultural actors in the value chain by using digestate as fertilizer to a higher degree. In future studies, there can be a focus on how these systems will become more resource efficient either through developing an internal biorefinery processer or using external actors to continue processing the materials, how different alternatives can be facilitated, and what factors are relevant for either method to develop (Budzianowski, 2017; Venkata Mohan et al., 2019). Data availability statement The original contributions presented in the study are included in the article\/Supplementary Material; further inquiries can be directed to the corresponding author. Author contributions The author confirms being the sole contributor of this work and has approved it for publication. Acknowledgments The author wants to thank her supervisors Mats Eklund and Niclas Svensson for the support in the work of this article. She is grateful for the funding received for this research through the Biogas Research Center by the Swedish Energy Agency, companies, and municipalities involved. She also wants to thank the reviewers who helped to improve this article. Conflict of interest The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors, and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Adven, (2022). Material and side stream recovery and processing. Available at: https:\/\/adven.com\/solutions-industries\/material-and-side-stream-recovery-and-processing\/([WWW Document]. Adven. URL accessed 15 2, 22). Google Scholar Bryman, A. (2016). Social research methods. Oxford, United Kingdom: Oxford University Press. Google Scholar Budzianowski, W. M. (2017). High-value low-volume bioproducts coupled to bioenergies with potential to enhance business development of sustainable biorefineries. Renew. Sustain. Energy Rev. 70, 793–804. doi:10.1016\/j.rser.2016.11.260 CrossRef Full Text | Google Scholar Fagerström, A., and Murphy, J. D. (2018). “IEA bioenergy task 37,” in The role of anaerobic digestion and biogas in the circular economy (Paris, France: IEA Bioenergy Programme). Google Scholar Fei, X., Jia, W., Chen, T., and Ling, Y. (2022). Life cycle assessment of food waste anaerobic digestion with hydrothermal and ionizing radiation pretreatment. J. Clean. Prod. 338, 130611. doi:10.1016\/j.jclepro.2022.130611 CrossRef Full Text | Google Scholar Feiz, R., Larsson, M., Ekstrand, E.-M., Hagman, L., Ometto, F., and Tonderski, K. (2021). The role of biogas solutions for enhanced nutrient recovery in biobased industries—Three case studies from different industrial sectors. Resour. Conservation Recycl. 175, 105897. doi:10.1016\/j.resconrec.2021.105897 CrossRef Full Text | Google Scholar Ferreira, J. J., Fernandes, C. I., Schiavone, F., and Mahto, R. V. (2021). Sustainability in family business – a bibliometric study and a research agenda. Technol. Forecast. Soc. Change 173, 121077. doi:10.1016\/j.techfore.2021.121077 CrossRef Full Text | Google Scholar Garcia-Garcia, G., Stone, J., and Rahimifard, S. (2019). Opportunities for waste valorisation in the food industry – a case study with four UK food manufacturers. J. Clean. Prod. 211, 1339–1356. doi:10.1016\/j.jclepro.2018.11.269 CrossRef Full Text | Google Scholar Garske, B., Heyl, K., Ekardt, F., Weber, L. M., and Gradzka, W. (2020). Challenges of food waste governance: An assessment of European legislation on food waste and recommendations for improvement by economic instruments. Land 9, 231. doi:10.3390\/land9070231 CrossRef Full Text | Google Scholar Hagman, L., Blumenthal, A., Eklund, M., and Svensson, N. (2018). The role of biogas solutions in sustainable biorefineries. J. Clean. Prod. 172, 3982–3989. doi:10.1016\/j.jclepro.2017.03.180 CrossRef Full Text | Google Scholar Hagman, L., Eklund, M., and Svensson, N. (2020). Assessment of by-product valorisation in a Swedish wheat-based biorefinery. Waste Biomass Valor 11, 3567–3577. doi:10.1007\/s12649-019-00667-0 CrossRef Full Text | Google Scholar Jones, R. E., Speight, R. E., Blinco, J. L., and O’Hara, I. M. (2022). Biorefining within food loss and waste frameworks: A review. Renew. Sustain. Energy Rev. 154, 111781. doi:10.1016\/j.rser.2021.111781 CrossRef Full Text | Google Scholar Kähkönen, A.-K., and Lintukangas, K. (2022). Towards sustainable supply strategy in the food industry: The case of Finland. Br. Food J. 124, 143–164. doi:10.1108\/BFJ-03-2021-0257 CrossRef Full Text | Google Scholar Khedkar, R., and Singh, K. (2018). “Food industry waste: A panacea or pollution hazard?,” in Paradigms in pollution prevention, SpringerBriefs in environmental science. Editor T. Jindal (Berlin, Germany: Springer International Publishing), 35–47. CrossRef Full Text | Google Scholar Klein, O., Nier, S., and Tamásy, C. (2022). Circular agri-food economies: Business models and practices in the potato industry. Sustain Sci. 17, 2237–2252. doi:10.1007\/s11625-022-01106-1 CrossRef Full Text | Google Scholar A. Klitkou, A. M. Fevolden, and M. Capasso (Editors) (2019). From waste to ValueValorisation pathways for organic waste streams in circular bioeconomies (London, United Kingdom: Routledge). Google Scholar Koppelmäki, K., Helenius, J., and Schulte, R. P. O. (2021). Nested circularity in food systems: A nordic case study on connecting biomass, nutrient and energy flows from field scale to continent. Resour. Conservation Recycl. 164, 105218. doi:10.1016\/j.resconrec.2020.105218 CrossRef Full Text | Google Scholar Lehmann, J., Rillig, M. C., Thies, J., Masiello, C. A., Hockaday, W. C., and Crowley, D. (2011). Biochar effects on soil biota - a review. Soil Biol. Biochem. 43, 1812–1836. doi:10.1016\/j.soilbio.2011.04.022 CrossRef Full Text | Google Scholar Lindfors, A., Gustafsson, M., Anderberg, S., Eklund, M., and Mirata, M. (2020). Developing biogas systems in Norrköping, Sweden: An industrial symbiosis intervention. J. Clean. Prod. 277, 122822. doi:10.1016\/j.jclepro.2020.122822 CrossRef Full Text | Google Scholar Lybæk, R., and Kjær, T. (2021). Biogas technology as an “engine” for facilitating circular bio-economy in Denmark—the case of lolland & falster municipalities within region zealand. Front. Energy Res. 9. doi:10.3389\/fenrg.2021.695685 CrossRef Full Text | Google Scholar Lyng, K.-A., Stensgård, A. E., Hanssen, O. J., and Modahl, I. S. (2018). Relation between greenhouse gas emissions and economic profit for different configurations of biogas value chains: A case study on different levels of sector integration. J. Clean. Prod. 182, 737–745. doi:10.1016\/j.jclepro.2018.02.126 CrossRef Full Text | Google Scholar Magnusson, T., Andersson, H., and Ottosson, M. (2019). Industrial ecology and the boundaries of the manufacturing firm. J. Industrial Ecol. 23, 1211–1225. doi:10.1111\/jiec.12864 CrossRef Full Text | Google Scholar Medkova, K., Vanhamäki, S., and Snell, J. (2019). Bio-based circular economy action plan sets the future steps in päijät-häme. Lille, France: BIOREGIO project,Interreg Europe. Google Scholar Metsä Group, n. d. (2022). From side streams to new products. Available at: https:\/\/www.metsagroup.com\/en\/media\/Pages\/Case-From-side-streams-to-new-products.aspx ([WWW Document] URL accessed 10 2, 22). Google Scholar Moshtaghian, H., Bolton, K., and Rousta, K. (2021). Challenges for upcycled foods: Definition, inclusion in the food waste management hierarchy and public acceptability. Foods 10, 2874. doi:10.3390\/foods10112874 PubMed Abstract | CrossRef Full Text | Google Scholar Mountraki, A., Tsakalova, M., Panteli, A., Papoutsi, A. I., and Kokossis, A. C. (2016). Integrated waste management in multiproduct biorefineries: Systems optimization and analysis of a real-life industrial plant. Industrial Eng. Chem. Res. 55, 3478–3492. doi:10.1021\/acs.iecr.5b03431 CrossRef Full Text | Google Scholar Otles, S., Despoudi, S., Bucatariu, C., and Kartal, C. (2015). “Chapter 1 - food waste management, valorization, and sustainability in the food industry,” in Food waste recovery. Editor C. M. Galanakis (San Diego, United States: Academic Press), 3–23. CrossRef Full Text | Google Scholar Papargyropoulou, E., Lozano, R., Steinberger, K. J., Wright, N., and Ujang, Z. B. (2014). The food waste hierarchy as a framework for the management of food surplus and food waste. J. Clean. Prod. 76, 106–115. doi:10.1016\/j.jclepro.2014.04.020 CrossRef Full Text | Google Scholar Pereira, C. P. P., Slingerland, M. A., Lier, J. B., and Rabbinge, R. (2013). “Anaerobic digestion as a key technology for biomass valorization: Contribution to the energy balance of biofuel chains,” in The biogas handbook: Science, production and applications (Sawston, United Kingdom: Woodhead Publishing), 166–188. Google Scholar D. Ravelli, and C. Samorì (Editors) (2021). Biomass valorization: Sustainable methods for the production of chemicals (Weinheim, Germany: Wiley VCH). Google Scholar Salvador, R., Puglieri, F. N., Halog, A., Andrade, F. G. D., Piekarski, C. M., and De Francisco, A. C. (2021). Key aspects for designing business models for a circular bioeconomy. J. Clean. Prod. 278, 124341. doi:10.1016\/j.jclepro.2020.124341 CrossRef Full Text | Google Scholar Scherhaufer, S., Davis, J., Metcalfe, P., Gollnow, S., Colin, F., De Menna, F., et al. (2020). Environmental assessment of the valorisation and recycling of selected food production side flows. Resour. Conservation Recycl. 161, 104921. doi:10.1016\/j.resconrec.2020.104921 CrossRef Full Text | Google Scholar Science Based Targets, (2022). Ambitious corporate climate action. Available at: https:\/\/sciencebasedtargets.org\/([WWW Document]. Science Based Targets URL accessed 30 6, 22). Google Scholar Stone, J., Garcia-Garcia, G., and Rahimifard, S. (2019). Development of a pragmatic framework to help food and drink manufacturers select the most sustainable food waste valorisation strategy. J. Environ. Manag. 247, 425–438. doi:10.1016\/j.jenvman.2019.06.037 PubMed Abstract | CrossRef Full Text | Google Scholar Swedish Food Federation, (2019). Sustainability manifesto. Athina, Greece: AEGEE. Google Scholar Tsvetkova, A., and Gustafsson, M. (2012). Business models for industrial ecosystems: A modular approach. J. Clean. Prod. 29 (30), 246–254. doi:10.1016\/j.jclepro.2012.01.017 CrossRef Full Text | Google Scholar Van Beers, D., Corder, G., Bossilkov, A., and Van Berkel, R. (2007). Industrial symbiosis in the Australian minerals industry: The cases of Kwinana and Gladstone. J. Industrial Ecol. 11, 55–72. doi:10.1162\/jiec.2007.1161 CrossRef Full Text | Google Scholar Vaneeckhaute, C., Lebuf, V., Michels, E., Belia, E., Vanrolleghem, P. A., Tack, F. M. G., et al. (2017). Nutrient recovery from digestate: Systematic technology review and product classification. Waste Biomass Valor 8, 21–40. doi:10.1007\/s12649-016-9642-x CrossRef Full Text | Google Scholar Vanhamäki, S., Virtanen, M., Luste, S., and Manskinen, K. (2020). Transition towards a circular economy at a regional level: A case study on closing biological loops. Resour. Conservation Recycl. 156, 104716. doi:10.1016\/j.resconrec.2020.104716 CrossRef Full Text | Google Scholar Venkata Mohan, S., Dahiya, S., Amulya, K., Katakojwala, R., and Vanitha, T. K. (2019). Can circular bioeconomy be fueled by waste biorefineries — a closer look. Bioresour. Technol. Rep. 7, 100277. doi:10.1016\/j.biteb.2019.100277 CrossRef Full Text | Google Scholar A. Wellinger, J. Murphy, and D. Baxter (Editors) (2013). The biogas handbook: Science, production and applications (Sawston, United Kingdom: Woodhead). Google Scholar","filter_flag":1}
{"title":"Upcycling Initiatives Turn Railway Industry Waste Materials into Creative Products - The Japan News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vamFwYW5uZXdzLnlvbWl1cmkuY28uanAvc29jaWV0eS9nZW5lcmFsLW5ld3MvMjAyMzA1MDEtMTA2ODk0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vamFwYW5uZXdzLnlvbWl1cmkuY28uanAvc29jaWV0eS9nZW5lcmFsLW5ld3MvMjAyMzA1MDEtMTA2ODk0L9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vamFwYW5uZXdzLnlvbWl1cmkuY28uanAvc29jaWV0eS9nZW5lcmFsLW5ld3MvMjAyMzA1MDEtMTA2ODk0L9IBAA","guidislink":false,"published":"Mon, 01 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=121, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vamFwYW5uZXdzLnlvbWl1cmkuY28uanAvc29jaWV0eS9nZW5lcmFsLW5ld3MvMjAyMzA1MDEtMTA2ODk0L9IBAA?oc=5\" target=\"_blank\">Upcycling Initiatives Turn Railway Industry Waste Materials into Creative Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Japan News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Upcycling Initiatives Turn Railway Industry Waste Materials into Creative Products - The Japan News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vamFwYW5uZXdzLnlvbWl1cmkuY28uanAvc29jaWV0eS9nZW5lcmFsLW5ld3MvMjAyMzA1MDEtMTA2ODk0L9IBAA?oc=5\" target=\"_blank\">Upcycling Initiatives Turn Railway Industry Waste Materials into Creative Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Japan News<\/font>","source.href":"https:\/\/japannews.yomiuri.co.jp","source.title":"The Japan News","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Yomiuri Shimbun Efforts to launch upcycling and recycling initiatives in the railroad industry are spawning new products from discarded items that would otherwise be thrown away. From slippers created by sewing together seat covers, to shoehorns fashioned from worn overhead wires and iron kettles made from melted-down steel rails, many of these practical everyday items are even helping to attract new railroad fans. ‘N700 Series’ slippers In early February in Kahoku, Yamagata Prefecture, one of the nation’s leading slipper production centers, seven veteran craftspeople were skillfully sewing pairs of specialty slippers at the factory of venerable Kawauchi Slipper, which was founded in 1955. The material used for the slippers came from seat covers used on N700 Series Tokaido Shinkansen bullet trains. They are being made to order for Central Japan Railway Co. (JR Tokai), which is trying to make effective use of the 1,200 kilograms of seat covers it discards each month. “It’s not easy to mass-produce the slippers, but I have absolute confidence in the quality. We are happy to be able to contribute to the effort to reduce waste materials,” said Kazuko Okada, a craftsperson with more than 20 years of experience. Kawauchi Slipper began producing the Shinkansen slippers at the request of Choichiro Tsuchiya, 72, a recycler in Yamagata. Tsuchiya, who had been contracted to clean seat covers more than 10 years ago at East Japan Railway Co.’s (JR East’s) Shinkansen General Rolling Stock Center in Rifu, Miyagi Prefecture, saw a large number being thrown away each time they were reupholstered. Thinking that it was a waste to throw away such high-quality fabric, he suggested that the company commercialize the product. At that time, the concept of upcycling was not yet widespread. His idea was rejected by the company, which said it was unthinkable to sell discarded items. It took two to three years to convince them to change their minds. Now, in addition to slippers, JR Tokai sells pen cases, coin purses and cushions. “The customers are very pleased with the products. I had an unerring eye,” Tsuchiya said. The Yomiuri Shimbun Slippers are made by stitching together seat covers from Tokaido Shinkansen bullet trains with a sewing machine in Kahoku, Yamagata Prefecture. Environmentally friendly With the recent spread of the notion of creating a “circular economy” that balances economic growth with a reduced environmental impact, rail companies have begun to focus on the development of upcycled products. In November last year, Keio Corp. started fashioning shoehorns from worn overhead copper wires. They come with a leather case engraved with “KO27,” the designation of Keio Line’s Seiseki Sakuragaoka Station in Tama, Tokyo, the closest station to the company’s headquarters. The shoehorns have been adopted as a return gift for the Tama city government’s furusato nozei, a tax-deductible donation program. Those who donate ¥140,000 can obtain the shoehorn as a gift in return for the donation. After JR East cut up rails that had been laid on the platform of the Yokosuka Line at Shinagawa Station in Tokyo, they turned them into bookshelves last October. Since February this year, JR Tokai has also been reusing aluminum from Tokaido Shinkansen carriages to make spoons and tie pins for sale. Osaka Metro Co. has also been commercializing products since spring last year that carry a label saying “scrapped train reconditioning project.” The products include bags made from subway car hand straps and gangway connections, and tables made from sliding doors. “We have come up with products that will encourage people to continue riding the subway with a special sense of attachment,” an Osaka Metro official said. Cultivating new fans Railroad companies are known from time to time to sell destination signs and front nameplates from trains, as well as the seats of discontinued trains, which prove wildly popular among railway enthusiasts. Meanwhile, the appearance of practical upcycled products has attracted brand-new fans. Last December, at the initiative of a young employee at JR East’s Morioka branch office, the company began selling Nambu tekki iron kettles made of melted-down Kamaishi Line rails. Nambu Tekki is the name of traditional Iwate cast ironware. Handmade by craftsmen in a workshop in Iwate Prefecture, the kettles cost between ¥89,000 and ¥330,000 each. Despite the high price, 10 had been ordered as of April. Yasuhiro Nishibe, 48, a building contractor in Iida, Nagano Prefecture, ordered two kettles — one for himself and one as a gift. He said he was not interested in trains, but was drawn to the story of how used rails are transformed into kettles that will last a lifetime. “The idea of making an iron kettle from a steel rail is interesting, and it will be a topic of conversation when I give one as a gift,” he said.","filter_flag":1}
{"title":"Why the future of sustainable food in India is upcycling - FFOODS Spectrum - nuFFooDS Spectrum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA1LzA5L3doeS10aGUtZnV0dXJlLW9mLXN1c3RhaW5hYmxlLWZvb2QtaW4taW5kaWEtaXMtdXBjeWNsaW5nLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA1LzA5L3doeS10aGUtZnV0dXJlLW9mLXN1c3RhaW5hYmxlLWZvb2QtaW4taW5kaWEtaXMtdXBjeWNsaW5nLmh0bWzSAQA?oc=5","id":"CBMiZGh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA1LzA5L3doeS10aGUtZnV0dXJlLW9mLXN1c3RhaW5hYmxlLWZvb2QtaW4taW5kaWEtaXMtdXBjeWNsaW5nLmh0bWzSAQA","guidislink":false,"published":"Tue, 09 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=129, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA1LzA5L3doeS10aGUtZnV0dXJlLW9mLXN1c3RhaW5hYmxlLWZvb2QtaW4taW5kaWEtaXMtdXBjeWNsaW5nLmh0bWzSAQA?oc=5\" target=\"_blank\">Why the future of sustainable food in India is upcycling - FFOODS Spectrum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">nuFFooDS Spectrum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why the future of sustainable food in India is upcycling - FFOODS Spectrum - nuFFooDS Spectrum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA1LzA5L3doeS10aGUtZnV0dXJlLW9mLXN1c3RhaW5hYmxlLWZvb2QtaW4taW5kaWEtaXMtdXBjeWNsaW5nLmh0bWzSAQA?oc=5\" target=\"_blank\">Why the future of sustainable food in India is upcycling - FFOODS Spectrum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">nuFFooDS Spectrum<\/font>","source.href":"https:\/\/nuffoodsspectrum.in","source.title":"nuFFooDS Spectrum","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Food waste is a significant concern in developing countries such as India, where approximately $14 billion worth of crops are wasted each year due to poor cold chain and disorganised logistics. In such a scenario, the concept of upcycled food offers promising solutions. According to a report published by Food and Nutrition Sciences, only 10 per cent of consumers are familiar with upcycled food products. However, 80 per cent of people are willing to explore upcycled food options once they are educated about them. Let’s examine how the upcycled food trend can drive a food revolution in India. Have you heard of Nescafé Nativ Cascara or Buxton Plant+Water? These are beverages produced by Nestlé Australia and Nestlé UK, respectively. Nescafé Nativ Cascara is a carbonated soft drink made from organic cascara – the ‘coffee berry’ fruit surrounding the coffee beans that is typically discarded during coffee production. By infusing sun-dried cascara husks with water and botanicals, Nestlé product developers created this innovative drink. Buxton Plant+Water, on the other hand, is a functional spring water infused with plants and represents a byproduct of the coffee decaffeination process. Both the products are novel but is there a link between them? Both these products are connected by the concept of upcycling, which is becoming increasingly popular in the food industry. Many food producers are developing products and technologies that use agricultural raw materials that would otherwise go to waste, reducing their environmental impact by lowering water usage and greenhouse gas emissions throughout the value chain. Using raw materials and side streams in products or processes can also create new revenue streams for farmers and startups focused on developing food ingredients or packaging materials. Nestlé, one of the largest multinational food and drink conglomerates, is committed to achieving net zero greenhouse gas emissions by 2050 and has been driving various business initiatives worldwide that align with the concept of food upcycling. According to Thomas Hauser, Head of Nestlé’s Product and Technology Development, “Developing new products and technologies using agricultural side streams is one way to reduce environmental impact and it creates new opportunities for farmers. We are committed to addressing food loss by creating new value for raw materials and developing innovations that are good for you, and the planet.” Commendable global efforts The Upcycled Food Association (UFA), a US-based nonprofit trade association, is working to prevent food waste by promoting the upcycled economy. According to UFA, upcycled foods use ingredients that would not have otherwise been used for human consumption, and are procured and produced using verifiable supply chains that have a positive impact on the environment. According to the Food Loss and Waste Protocol, the food waste destinations are when food ends up in incinerators, as animal feed, in landfills, or in anaerobic digesters. By avoiding these waste destinations, upcycled food makes better use of the energy expended in growing, transporting, and preparing that food. Food loss and waste are responsible for 8 per cent of human-caused greenhouse gas emissions, which is why reducing food waste is the single greatest solution to climate change. Upcycled food captures that value and leverages it to create a sustainable and resilient food system. UFA is the only food industry association dedicated to catalysing the upcycled economy to prevent food loss and waste across the entire supply chain. UFA is leveraging market forces to prevent food waste by coordinating hundreds of companies around the world and empowering millions of consumers to prevent climate change with the products they buy. UFA recently launched the world’s first product certification programme for upcycled products and ingredients, called Upcycled Certified. In January 2023, Kerry, a world-leading sustainable nutrition company, announced its sponsorship of The Kerry Upcycled Food Foundation Fellowship. This marks the second research fellowship initiated by the Upcycled Food Foundation (UFF), which is dedicated to supporting this evidence-based industry and educating consumers about the environmental and social benefits of upcycled foods. The Foundation is the non-profit subsidiary of the Upcycled Food Association. “Kerry’s sponsorship of this fellowship has enabled more fellows to enter the programme, which will provide invaluable insights that can be applied to industry practices and consumer messaging, and thus allow us to reduce food waste through upcycled food. In 2022, eight fellows were selected to conduct research that reflects a research question of interest to the upcycled food community,” said Angie Crone, Chief Executive Officer of the Upcycled Food Association. Various global upcycled food brands like Rebon, Abokichi, Diana’s, Riff, US Foods, The Spare Food Co., ReGrained, Blue Stripes Urban Cacao, GoodSport Nutrition, Agricycle Global, SUPERFRAU, Lost & Found Distillery, among others, have been driving innovations in the upcycled food, beverages, and snacks industry. Upcycled food: Could it be a game-changer for India? Food waste is a significant concern for developing countries like India, where roughly $14 billion worth of crops are wasted each year due to a poor cold chain and disorganised logistics. The cost of establishing and maintaining a cold chain, lack of awareness and untrained manpower, inferior quality and misused cold chain transport, poor infrastructure, etc., are some of the reasons behind this failure. While commenting on the situation, Swarn Kamal, Commercial Kitchen Consultant at Opstrah Design, said, “According to the Food and Agricultural Organisation (FAO), approximately 40 per cent of the food produced in India is wasted every year due to a fragmented food and inefficacious supply chain system. The irony is that loss occurs even before the food reaches the consumer. India wastes more fruits and vegetables than the entire United Kingdom consumes and more grains than Australia produces. Around 1 per cent of the GDP is depleted in the form of food wastage. According to the Ministry of Agriculture (Government of India), Rs 50,000 crore of food produced gets wasted every year.” In this context, the concept of upcycled food looks promising for India. According to a report published in Food and Nutrition Sciences, only 10 per cent of consumers are familiar with upcycled food products, but once educated, 80 per cent of people are willing to try them. The global upcycled food products market size was valued at $53.7 billion in 2021, and is estimated to reach $97 billion by 2031, growing at a CAGR of 6.2 per cent from 2022 to 2031, according to a new report published by Allied Market Research, titled, “Upcycled food products Market.” The upcycled food products industry is anticipated to experience significant expansion due to rising raw material costs. The market is also expanding due to growing consumer health concerns, and innovation and R&D growth have a significant impact on the expansion of the upcycled food products market. Tanvi Goswami, Former-Executive Chef, SAGA restaurant, said, “The trend of upcycled food will have a lasting impact on how we perceive ‘wastage’ with respect to food. In my opinion, the integration of the concept will have a pivotal role in global sustainability, which in this day and age can only be supported by value-added models such as upcycling food. We strive to utilise every facet of the raw produce. We instil a sense of ownership for produce sourced directly from the Earth. For example, we use fish skin to make chips, mutton neck bone to make stock, and we dehydrate any kind of vegetable peel and use it as a garnish. The conceptual thought process behind upcycling food looks to readapt our perception of waste, process waste into more marketable and sustainable products, constructing a waste-reducing macro impact on the globe.” Although the trend of upcycled food has been gaining popularity in India, there have not been considerable efforts made in this space by the Indian food industry counterparts. On the other hand, in the global market, food continues to get upcycled, and innovative food products are made available. For this trend to work in India, a considerable investment in sophisticated manufacturing equipment and training is crucial. Although the government of India has taken various initiatives to combat food waste in the nation, upcycled food products are yet to receive the attention they deserve from the authorities. Mansi Jamsudkar (mansi.jamsudkar@mmactiv.com) Image credit- shutterstock","filter_flag":1}
{"title":"what design can do reveals the 13 winners of the make it circular challenge - Designboom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmRlc2lnbmJvb20uY29tL2Rlc2lnbi93aGF0LWRlc2lnbi1jYW4tZG8tMTMtd2lubmVycy1tYWtlLWl0LWNpcmN1bGFyLWNoYWxsZW5nZS0wNS0xOC0yMDIzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmRlc2lnbmJvb20uY29tL2Rlc2lnbi93aGF0LWRlc2lnbi1jYW4tZG8tMTMtd2lubmVycy1tYWtlLWl0LWNpcmN1bGFyLWNoYWxsZW5nZS0wNS0xOC0yMDIzL9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LmRlc2lnbmJvb20uY29tL2Rlc2lnbi93aGF0LWRlc2lnbi1jYW4tZG8tMTMtd2lubmVycy1tYWtlLWl0LWNpcmN1bGFyLWNoYWxsZW5nZS0wNS0xOC0yMDIzL9IBAA","guidislink":false,"published":"Thu, 18 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=138, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmRlc2lnbmJvb20uY29tL2Rlc2lnbi93aGF0LWRlc2lnbi1jYW4tZG8tMTMtd2lubmVycy1tYWtlLWl0LWNpcmN1bGFyLWNoYWxsZW5nZS0wNS0xOC0yMDIzL9IBAA?oc=5\" target=\"_blank\">what design can do reveals the 13 winners of the make it circular challenge<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Designboom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"what design can do reveals the 13 winners of the make it circular challenge - Designboom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LmRlc2lnbmJvb20uY29tL2Rlc2lnbi93aGF0LWRlc2lnbi1jYW4tZG8tMTMtd2lubmVycy1tYWtlLWl0LWNpcmN1bGFyLWNoYWxsZW5nZS0wNS0xOC0yMDIzL9IBAA?oc=5\" target=\"_blank\">what design can do reveals the 13 winners of the make it circular challenge<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Designboom<\/font>","source.href":"https:\/\/www.designboom.com","source.title":"Designboom","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"the 13 finalists of what design can do’s make it circular challenge The wait is over. What Design Can Do (WDCD) announces the thirteen winners of the Make it Circular Challenge, representing original strategies for building a more circular society. Initiated in partnership with the IKEA Foundation, the competition enters an exciting phase as finalists gain access to a €10.000 award and development training package designed to launch their ideas into action. All winning projects can be viewed online, here! Guiding the Runoff (Mexico): an adaptive reuse and urban renewal project in Tijuana, Mexico all images courtesy of What Design Can Do For 2023, the Make it Circular Challenge is What Design Can Do’s fourth climate action challenge in partnership with the IKEA Foundation. Launched in October 2022, the design competition called for bold solutions to. The Challenge provided in-depth design briefs presenting original research on circularity and highlighting opportunities for designers and entrepreneurs alike. Over 650 participants submitted projects across themes: what we eat, what we wear, what we buy, how we package and how we build. Balena (Israel): a new kind of bioplastic that is both durable and compostable creativity, feasibility, scalability & teamwork Tasked with selecting the winners was an international jury comprising twelve leading experts in design, climate action and entrepreneurship, including Arthur Huang (founder, Miniwiz), Bas van Abel (founder, Fairphone), and Corine Gray (Unreasonable Group). Deliberating together both online and in-person, the panel selected thirteen winners from a shortlist of 50 high-potential nominees. In the end, the winning projects won over the Jury by exceeding expectations across the competition’s five criteria: impact, creativity & design, feasibility, scalability, and teamwork. ‘This year’s (2023) selection process was very competitive, not just because there were so many engaging and innovative ideas—but also because we recognize how urgent and complex the circular transition really is. The winning projects reflect this in their diversity and vision, and I’m looking forward to seeing the impact they’ll have, both individually and together,’ says WDCD’s co-founder and creative director Richard van der Laken. Nivogo (Türkiye): a pioneering circular economy startup refurbishing and recirculating products collected from users and partners Entrepreneurs worldwide were asked to come up with circular products, services, spaces and systems that would help us tackle the root of the climate crisis. Participants were encouraged to submit their projects in one of five categories, representing key value chains and industries like consumer goods, packaging or food. The winners are divided among these categories, but also closely relate to the three fundamental aspects of circularity: designing to last, working with nature and using what already exists. Alterist Marketplace (United Kingdom): a community-led platform for upcycled products The first is all about taking the long view and learning to think about how products can be designed in terms of its entire lifecycle. This approach can be seen in projects like Alterist Marketplace (United Kingdom), a community-led platform for upcycled products, Nivogo (Türkiye), a pioneering circular economy startup refurbishing and recirculating products collected from users and partners, and Balena (Israel), a new kind of bioplastic that is both durable and compostable. Craste (India): packaging from crop residue using circular fiber technology The second approach is a matter of working with nature and bringing about a more-than-human approach to design. This was a particularly popular strategy used by winners like Mujō (Germany), a biodegradable packaging made from seaweed, Apidae (Mexico), a system of breeding boxes for pollinating insect, CoolBricks (the Netherlands and Uganda), a bio-stabilized brick made from cow-dung, Landless Food (Hungary) a project that highlights the issue of food insecurity and explores the potential of microalgae to regenerate extinct flavor families and revive culinary traditions, and LibreWater (Germany) an Open Source purification device that can make nearly any water drinkable at a household level. Saathi (India): biodegradable sanitary pads made from banana fiber Lastly, there were also projects that focused on reuse and recovery, looking at how we can create new value out of discarded or neglected materials that already exist. This includes Resortecs (Belgium), a startup that is developing solutions for textile disassembly and recycling, Guiding the Runoff (Mexico), an adaptive reuse and urban renewal project in Tijuana, Mexico. In particular, three projects looked at how crop waste could be used to create new products: Rethread Africa’s (Kenya) textile solution uses maize husk residue to reduce resources and emissions. Saathi (India) offers biodegradable sanitary pads made from banana fiber, while Craste (India) creates packaging from crop residue using circular fiber technology. CoolBricks (the Netherlands and Uganda): a bio-stabilized brick made from cow-dung WDCD OFFERS €10.000 in funding TO EVERY WINNER Following the announcement, the aim is to work on strengthening each winning idea, deepening their potential impact, and putting their ideas into action. All the winnings teams receive €10.000 in funding, and access to a development programme co-created with Impact Hub Amsterdam. This begins with a week-long bootcamp, and is tailor-made for the special blend of change-makers present among participants. The thirteen projects can expect mentorship on a range of skills they need – from developing a viable business model, to impact-assessment and networking. Combined with exposure and publicity, the programme is set to provide unique support for the thinkers, doers and makers of the new economy. Apidae (Mexico): a system of breeding boxes for pollinating insect","filter_flag":1}
{"title":"Tortilla chips category continues to grow - Snack Food & Wholesale Bakery","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDkwNjItdG9ydGlsbGEtY2hpcHMtY2F0ZWdvcnktY29udGludWVzLXRvLWdyb3fSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDkwNjItdG9ydGlsbGEtY2hpcHMtY2F0ZWdvcnktY29udGludWVzLXRvLWdyb3fSAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDkwNjItdG9ydGlsbGEtY2hpcHMtY2F0ZWdvcnktY29udGludWVzLXRvLWdyb3fSAQA","guidislink":false,"published":"Mon, 22 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=142, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDkwNjItdG9ydGlsbGEtY2hpcHMtY2F0ZWdvcnktY29udGludWVzLXRvLWdyb3fSAQA?oc=5\" target=\"_blank\">Tortilla chips category continues to grow<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Snack Food & Wholesale Bakery<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tortilla chips category continues to grow - Snack Food & Wholesale Bakery","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDkwNjItdG9ydGlsbGEtY2hpcHMtY2F0ZWdvcnktY29udGludWVzLXRvLWdyb3fSAQA?oc=5\" target=\"_blank\">Tortilla chips category continues to grow<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Snack Food & Wholesale Bakery<\/font>","source.href":"https:\/\/www.snackandbakery.com","source.title":"Snack Food & Wholesale Bakery","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Bottom Line: Tortilla chips category increasing in sales Great taste, texture are key Americans bond over snacks Whether consumed while snacking alone or with friends, tortilla chips are versatile. They can be eaten alone; they also can function as a dipper for ingredients such as salsa, guacamole, or melted cheese. The tortilla chips category has experienced an increase in sales from last year, possibly because people are getting together with friends more in homes than a year before, watching football or other sports on TV, playing games, or having other kinds of social fun. Market data According to Chicago-based market research firm Circana’s data from the past 52 weeks, which ended on February 26, the salty snacks category brought in a whopping $36 billion, with an increase of 15.8% from the prior year. The “tortilla\/tostada chips” category provided $7.838 billion of that, with an increase of 18.4% from 2022. Source: Circana OmniMarket™ Total Store View | Geography : Total US - Multi Outlet w\/ C-Store (Grocery, Drug, Mass Market, Convenience, Military, and Select Club & Dollar Retailers) | Time : Latest 52 Weeks Ending 02-26-23 Doritos, a Frito-lay brand, led the pack, with $3.552 billion and a 21.4% increase in sales, followed by another Frito-lay brand, Tostitos, with $3.552 billion and a 10.8% increase. Barcel followed, with $974 million in sales and a notable 31.9% increase in sales. Also to note is Paqui, which brought in $34.5 million in sales but increased by 29.9%; Sabritas, with $23.1 million in sales and a 44.5% increase; and Tortilleria Mi Nina, with a modest $15 million in sales but a 119.9% increase from the previous year. Trends “Consumers are loyal to brands they know and love, but they also want variety,” says Leslie Vesper, vice president of brand marketing, Frito-Lay, Plano, TX. According to the most recent Frito-Lay Snack Index, 71% of respondents are “excited to try new flavors or variations of their favorite snacks,” she says. “That passion drives us to continue innovating our classic tortilla chips and bring new, interesting flavors to our fans, like Tostitos Mexican Style Three Cheese.” “Snacks have the power to bring people together—in fact, 59% of Americans have bonded over their preferences. We see this statistic take form through different buying occasions, like holidays and cultural moments, such as Super Bowl,” Vesper notes. “It’s also important to understand the culture behind these snacking moments. We don't view chips as just chips—instead, they are the catalyst for a joy-filled moment. People are starting to incorporate tortilla chips into their cooking routines and creating new culinary experiences for their friends and family—Tostitos are being brought to the table in new ways, quite literally, and we’re excited to start innovating around that,” she finishes. Sarah Wallace, CEO, and founder, Beanitos, Berkeley, CA, says that the tortilla chip market continues to grow after the pandemic, with consumers looking for more opportunities to replace eating out with exciting in-home dining\/snacking experiences. “While by and large tortilla chip consumers are brand- and flavor-loyal, millennials and Gen-Z in particular are brand-agnostic and excited by intriguing packaging and flavors—the bolder and spicier, the better,” she says. “At the end of the day, while the better-for-you chip market is still strong, chips are not fundamental to a health-and-wellness dietary commitment, so better-for-you chip manufacturers need to continue to laser-focus on great taste and texture. Health benefits are good, but nothing is better than a great eating experience without qualifications,” Wallace adds. “It's key to keep in mind that ultimately, chips are about comfort, enjoyment, relaxation, and sensory satiety—the whole package, really. So simply pushing health benefits onto consumers in this category is not as effective, as for example, in the categories of nutrition bars or similar snacks,” she notes. On the other hand, Josh Death, founder, Kazoo Snacks, Dallas, TX, says he’s excited to see a lot of growth and innovation within the tortilla chip aisle. “Lately, we’re noticing a shift towards cleaner chips with a short list of ingredients,” Death says. “For instance, our sea salt tortilla chip is made with just corn, upcycled corn germ, corn (or sunflower) oil, and sea salt. While certifications like gluten-free and organic still matter, many consumers are adopting a more plant-based lifestyle and are looking for versatile products that are inclusive of their dynamic diet. As a result, we’re beginning to see a rise in vegan, low-carb, low-sugar, and keto-friendly options. The more boxes a product can check, the better.” Courtesy of Don Pancho “Moreover, as the effects of climate change become more noticeable, we’re also seeing an increased adoption of upcycled, sustainable, and climate-friendly foods. However, it's important to note that flavor is still a crucial factor for consumers. There’s a new expectation for brands to embrace responsible sourcing and manufacturing processes while delivering great taste and exciting flavors,” Death finishes. Ricardo Baez, president, Don Pancho, Salem, OR, agrees, and says that consumers are placing continued importance on authenticity and seeking products that align with their values—both in terms of ingredients and the way a product is manufactured. “People want products that they can identify and that match their values. Today’s consumer wants fewer, but better ingredients, in their chips. Recognizing the importance of using high-quality ingredients, with fewer preservatives and additives, is what will continue to drive category growth,” he suggests. Julia Hecht, CMO, HIPPEAS, New York, NY, says that the tortilla chip category has really evolved over the past few years, with a variety of interesting vegetable and legume-based products being launched that offer superior nutritional benefits like protein and fiber. “We’ve seen amazing innovation on cheese flavors that are vegan, as well as new healthier products that offer both better-for-you and better-for-the-planet benefits,” she shares. “HIPPEAS focuses on reinterpreting broadly appealing category favorites—like tortilla chips—within a better-for-you framework. We keep our finger on the pulse in regard to the attributes our consumers demand and love about HIPPEAS through frequency consumer research that allows us to develop a strong understanding of our core consumer,” Hecht explains. In terms of sustainability, she says, the company has found that the HIPPEAS consumer prioritizes products that are vegan\/dairy-free, gluten-free, non-GMO, and still delicious—zero compromise when it comes to taste. Courtesy of HIPPEAS “We’ve also known that HIPPEAS consumers are focused on sustainability and our product delivers—our chickpeas are farmed using practices like conservation tillage to improve soil erosion and crop rotations that improve soil health,” Hecht says. “Our pulse crops are farmed using 10% of the water of most proteins, which means 90% less water taken from Mother Nature. Chickpeas also naturally use less fertilizer by pulling nitrogen from the air, which helps lower the brand's carbon footprint. At HIPPEAS, we believe that sustainable farming (and snacking!) is the way forward.” Innovation “Tortilla chips have traditionally been made with 100% corn, as corn fries into a crispy, thin chip quite easily. When innovating with tortilla chips it becomes very challenging to have any ingredient, let alone a legume, as the first ingredient without the chip becoming either dense or mealy in texture,” Hecht says. “[However,] we managed to break the mold with our chickpea tortilla chips. As a result, our HIPPEAS Chickpea Tortilla Chips are higher in protein, fiber, and vegetable content, and are the solution for those looking to satisfy their snack cravings but are unwilling to compromise on texture and flavor. We are particularly proud of our recently launched HIPPEAS Chickpea Tortilla Chip flavor: Nacho Vibes,” she adds. HIPPEAS Nacho Vibes Chickpea Tortilla Chips are vegan and contain 3g of protein and 3g of fiber per 1-ounce serving and are made without any artificial colors, flavors, or ingredients. Vesper says that knowing what Frito-Lay’s fans want is a top priority for the brand. “We’re consistently creating new ways for consumers to enjoy their favorite snacks, whether they’re dipping them, eating them on their own, or adding them to their meal routines. Being innovative and showing up for consumers in new and exciting ways is something we strive for,” she says. Courtesy of Frito-Lay “At Frito-Lay, we are constantly searching for the next big culinary adventure, and staying up to date on those trends is important. We often look to social media as a means of insight and connection. Food is one of the greatest connectors for people, so we set out to offer products that act as the centerpiece for fostering connections, a nostalgic bite during a favorite pastime, or the canvas for memorable recipes,” Vesper explains. “You’ll see this come to life through our flavor innovations and the way we engage with fans in person. For example, Tostitos opened its first pop-up restaurant, TOST by Tostitos, during Super Bowl LVII to reach consumers in a new way and show them how they can use their favorite Tostitos to create meals. We noticed that fans were using tortilla chips in unique ways in their cooking, so we took this insight and created a pop-up experience that was available in Scottsdale during the Super Bowl. It’s important to be on-trend and stay on-trend, but we also keep our eyes and ears open for emerging trends,” she finishes. Death says chasing the latest trends will leave founders in any industry in “a bit of a hamster wheel—that's why it's important for brands to lead with their values first.” “At Kazoo, we care immensely about people and the environment, and we believe the majority of consumers do as well. So we do our best to create products that we, and people like us, would like to see on grocery shelves,” he notes. “We set out to create upcycled tortilla chips with a low water footprint because that product did not yet exist in the marketplace. We also wanted to reduce our footprint in a measurable way, so it was important that consumers could measure their environmental impact by putting water-saving claims on our packaging—something we haven't yet seen from other brands,” Death adds. “We do our best to stay informed with current events and industry news about what is happening environmentally, and we read the comments on news articles to glean public sentiment—especially when a major brand releases a wild, new flavor,” he explains. Courtesy of General Mills “We also have conversations with friends, family members, and strangers alike, observing their snacking patterns and finding out what they enjoy eating while binge-watching their favorite shows. We look for unique flavor combinations on restaurant menus and even listen to what foodies are talking about and trying on social media (we love a good reaction video or taste test on TikTok). You'd be surprised how much insight can be gleaned from just listening and being observant about the world around us,” Death adds. “[For example, we] noticed brands making grain-free tortilla chips and chips using non-corn ingredients. This includes chips made from unique items such as sweet potatoes or cactus. Additionally, there is a growing trend towards upcycled products, and we are seeing more upcycled tortilla chips hit the market. Brands are also investing in uniquely flavored items, chips with added spice, and products that offer a protein boost,” he concludes. Baez says Beanitos relies on, and collaborates with, its trusted suppliers and valued customers, and tries to stay on top of emerging cuisines, and flavor profiles that resonate with consumers. “We are also very fortunate in that we have passionate followers who also give us feedback on what they like and what is important to them. At the end of the day, it’s really all about staying close to your customers, being bold, and willing to try new things,” he recommends. “We continue to see innovation in the ‘simple ingredients\/better-for-you’ category. Leveraging different types of ingredients in the plant-based category that can create a different type of experience,” Baez suggests. Collin Taylor, associate brand manager, General Mills, Minneapolis, says that through the company’s consumer research and testing, it has seen consumers take an interest in unique crispy and crunchy textures. “This led to our expansion into the chip aisle with the launch of Old El Paso Fiesta Twists, in three sweet and savory Tex-Mex flavors: Queso, Zesty Ranch, and Cinnamon Churro. Since 2019, tortilla chip sales have grown by over 45%, per Nielsen, outpacing the total salty snacks category. This, when paired with Old El Paso's strength in all-family Mexican flavors, made the tortilla\/corn chip space a natural fit for the brand,” he explains. “Families are a major growth driver for the category, yet are historically underserved. Fiesta Twists can help close that gap by focusing on Tex-Mex flavors the whole family can enjoy. Our research and development team helps us gain insights into the latest trends to ensure we’re continually innovating and bringing new products to market that we know consumers will love,” Taylor says. “We’re seeing tortilla chip innovations on form, expanding beyond flat or rolled chips, and unique flavors. This was front of mind for Old El Paso as we developed Fiesta Twists, given their unique shape,” he finishes. Wallace says that as a scrappy, entrepreneurial brand, Beanitos doesn’t have the resources to do the kind of exhaustive consumer validation work that larger CPG's have access to, so instead, it “does what we do best, which is to get creative, pay attention, watch socio-cultural dynamics around us, and dive into syndicated data to see what's actually selling.” “I'd like to think this makes us smarter and more nimble since we're not stuck in a quagmire of analysis, or worse, guided blindly by what consumers report they are going to do, versus what they actually do, at moments of truth in the grocery store aisle. We are also very inspired by the rise of global, inclusive multicultural brands in all kinds of categories that are bringing exciting, authentic offerings to the table and paving the way to create a truly global marketplace across all aisles, not just the ‘international’ set,” she explains. As far as innovation, Wallace has been “enjoying watching the rise of regionally authentic tortilla chip launches, such as thick-cut totopo-style chips, as well as chips made from alternative grains such as cassava, but with an authentic origin story behind them, more than just a ‘grain-free’ or other niche claim, she says. “The rise of ‘single-origin’ claims in the U.S. is also heartening to watch, something that UK brands like Tyrell's have been doing for years,” Wallace comments. What’s next Vesper says Tostitos is all about creating connection and togetherness, whether it’s at a party, around the dinner table, or while watching the big game. “We are always on the hunt for new, exciting snacking experiences for our fans and make sure to keep a pulse on what they’re telling us via social media,” she notes. Kazoo Snacks will be rebranding, says Death, and the brand is excited to announce that it is currently launching in Sprouts Farmers Markets nationwide with a completely new look. “Our products will have the same great taste but will feature a more Earth-centric look with a ‘low water footprint’ callout to help eco-minded customers find us on shelves. We also plan to launch a few new flavors in the coming months that will be sold exclusively at Sprouts. Our hope is that these new flavors will give sustainable snackers more upcycled snacking options. Lastly, we're in the final stages of obtaining our Upcycled Foods Certification,” Death notes. Baez says Don Pancho will be launching its new plant-based chips soon. “We like the flavor profile of garbanzo beans and how it gives us flexibility to enhance the presence in this space. For 2023, [we have announced] the expansion of our plant-based offerings, as well as our extension of our flavored corn tortilla chips that highlights street corn, and our authentic Totopo Style chips. We are very excited to offer these innovative new items this year.” Wallace says that Beanitos is excited to unveil its rebrand of its core Tortilla Chips line. “We acquired the brand a couple of years ago, and after spending COVID getting to really understand it, have just launched packaging that honors its origin story—Beanitos invented the bean tortilla chip in Austin, TX, back in 2010—while also highlighting our passion for regenerative agriculture and responsible, domestic supply chains,” she shares. “We source all our beans from American family farms, delivering transparency through the value-chain that we can feel proud of, and the packaging showcases the product's Tex-Mex origins and bold flavors,” Wallace says. “We also improved the formulation, making the chip a true cantina-style tortilla chip with benefits, that everyone can enjoy eating and sharing, not just for health reasons, but because they are really tasty, dippable chips. I hope that we have done [justice to] the original vision of the brand and its Texas roots,” she finishes.","filter_flag":1}
{"title":"Q&A: Carbonwave expands seaweed emulsifier as demand grows - CosmeticsDesign.com USA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzI0L1EtQS1DYXJib253YXZlLWV4cGFuZHMtc2Vhd2VlZC1lbXVsc2lmaWVyLWFzLWRlbWFuZC1ncm93c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzI0L1EtQS1DYXJib253YXZlLWV4cGFuZHMtc2Vhd2VlZC1lbXVsc2lmaWVyLWFzLWRlbWFuZC1ncm93c9IBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzI0L1EtQS1DYXJib253YXZlLWV4cGFuZHMtc2Vhd2VlZC1lbXVsc2lmaWVyLWFzLWRlbWFuZC1ncm93c9IBAA","guidislink":false,"published":"Wed, 24 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=144, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzI0L1EtQS1DYXJib253YXZlLWV4cGFuZHMtc2Vhd2VlZC1lbXVsc2lmaWVyLWFzLWRlbWFuZC1ncm93c9IBAA?oc=5\" target=\"_blank\">Q&amp;A: Carbonwave expands seaweed emulsifier as demand grows<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Q&A: Carbonwave expands seaweed emulsifier as demand grows - CosmeticsDesign.com USA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA1LzI0L1EtQS1DYXJib253YXZlLWV4cGFuZHMtc2Vhd2VlZC1lbXVsc2lmaWVyLWFzLWRlbWFuZC1ncm93c9IBAA?oc=5\" target=\"_blank\">Q&amp;A: Carbonwave expands seaweed emulsifier as demand grows<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","source.href":"https:\/\/www.cosmeticsdesign.com","source.title":"CosmeticsDesign.com USA","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Last month, Puerto Rico-based Carbonwave announced it had secured a $5 million Series A investment round led by investment manager Mirova, with participation from several other investment groups. The funding is slated to be used to expand production facilities on the island to better meet consumer demand for biomaterials used in cosmetic emulsifiers and other industries. Specifically, Sargassum (floating seaweed masses) are being harvested by Carbonwave and upcycled into the world’s first seaweed-based cosmetic emulsifier, SeaBalance 2000. Named as the ‘Best Functional Ingredient’ at In-Cosmetics Global last year, a half-ton of the ingredient has already been sold for cosmetic product formulation since launch. To learn more about SeaBalance 2000’s potential impact on the formulation of cosmetic and personal care products, the emulsifier’s research and development process, and the potential for further innovation in this area of environmental sustainability, CosmeticsDesign interviewed Jeff Yeh, Vice President of Personal Care at Carbonwave for his insights. CDU: What is the potential impact of the recent investment on manufacturers and suppliers to the cosmetics and personal care industries? ​ Jeff Yeh (JY): This investment is geared at scaling up production of our award-winning cosmetic emulsifier: SeaBalance 2000. We are building a modern biorefinery in Puerto Rico that will produce hundreds of tons of the product annually. There has been an incredible interest in SeaBalance 2000 since it launched in early 2022 among brands, formulators, and distributors around the world. They want more sustainable and upcycled ingredients and appreciate that SeaBalance provides a silicone-like hand feel while also working with cold process formulations. SeaBalance 2000 is a multifunctional ingredient that, in addition to its emulsification properties, has a significant improvement on moisturization and in the suspension of sunscreen mineral filters. Carbonwave is reaching commercial scale with its first-of-its-kind natural emulsifier. Manufacturers and suppliers can now access the only upcycled seaweed emulsifier with a wide range of uses and functional features, sourced from the world’s largest seaweed bloom. CDU: Were there any challenges in the development of the technology or formulation behind SeaBalance2000? ​ JY: Our team of scientists has spent over two years studying Sargassum, which is a new field of study because Sargassum has largely been treated as waste biomass. They have been learning what types of compounds we could get from it, and how to extract them in a way that was commercially and environmentally sustainable. For SeaBalance 2000, our journey started with the hypothesis that sodium alginate was a good base for our emulsification properties given its uses in the food industry. Most of our early struggles were trying to make this work for the cosmetic industry, but we could not get the strength needed to pass commercial standards. Our breakthrough was in changing our course to develop a biopolymer complex that used many components of the seaweed together in a molecular structure that more fully stabilized the oil. When we developed our first working version of SeaBalance 1000, we were pleased that it passed harsh heat tests at fifty degrees Celsius for ten days at a wide range of emollient types and emollient concentrations. However, we were getting feedback that the product had too much of a seaweed smell and the pigment was creating off-white emulsions. Rather than relying on common harsh chemical treatments like bleach, Carbonwave worked with natural processes to decolor and deodorize the product. Now SeaBalance 2000 is both stable across a broad range of emollient types, creates silky white emulsions, and contributes a minimal smell to the final product. CDU: How does Sargassum seaweed upcycling create additional opportunities for manufacturers and suppliers to the cosmetics and personal care industries for further innovation in environmentally sustainability? ​ JY: We are in awe of how sustainable Sargassum is, even compared with other natural or plant-based ingredients. First, it is important to know that the Caribbean Sargassum bloom is a relatively new phenomenon – about fifteen years old – and is causing havoc in coasts from West Africa to the Gulf of Mexico. There is so much it kills tourism and coastal ecosystems, and as it rots it creates dangerous byproducts like Methane, a powerful greenhouse gas. There’s immediate environmental impact in upcycling it. In replacing petroleum-based emulsifiers without sacrificing performance, we are offering a clear sustainable innovation for an industry hungry for both plant-based and upcycled products. Even when compared to other emulsifiers of natural origin, we are clearly an even more sustainable alternative: we do not require land, irrigation, additional nutrients, nor are we affected by a warmer planet; in fact, warmer oceans will mean more Sargassum. CDU: What is the importance of utilizing environmentally sustainable ingredients in the cosmetics and personal care product categories? ​ JY: The cosmetics industry has realized that the future of the industry is one that must be sustainable. There are many ways we need to become more sustainable including: – using ingredients of natural origin over synthetics, prioritizing ingredients that do not harm the consumer or the ecosystem in their creation or use, promoting solutions that reduce rather than increase carbon emissions, and creating systems that upcycle from what would otherwise be waste rather than extracting scarce resources. If we do not shift to more sustainable solutions, we are contributing to accumulating environmental toxicity, the degradation of our oceans, and a rapidly warming planet. Some products can claim sustainability in one or two of these areas, but SeaBalance 2000 delivers on them all. In our view, we need to move beyond “more sustainable” and start creating products that are truly regenerative. SeaBalance 2000 uses seaweed that is otherwise rotting and releasing methane gas, that is clogging sea turtle nesting habitat, and is choking the Caribbean economy. We are challenging the industry to source in a way that leaves ecosystems as close to their historical state as possible. We are proud of our regenerative impact on mangroves, coral reefs, seagrass meadows and the ocean – all important habitats and carbon sinks. CDU: Is SeaBalance2000 a renewable source of cosmetic emulsifiers? ​ JY: Every year, millions of tons of Sargassum wash up on Caribbean coasts. The bloom is so big, that it can be seen from space. And it is only getting worse – continuing deforestation, industrial and agricultural runoff, and warming waters will only increase the intensity and length of the bloom of this fast-growing floating seaweed. On this scale, it is one of the largest and most renewable sources of biomass in the world. We are proud to turn it into an innovative cosmetic emulsifier, and a range of other inputs for the agriculture, textiles, and plastics industries.","filter_flag":1}
{"title":"Singapore's Confetti Snacks in talks with Walmart and Target as collaboration with Dole and Disney lays on the horizon - FoodNavigator-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yNS9zaW5nYXBvcmUtcy1jb25mZXR0aS1zbmFja3MtaW4tdGFsa3Mtd2l0aC13YWxtYXJ0LWFuZC10YXJnZXQtYXMtY29sbGFib3JhdGlvbi13aXRoLWRvbGUtYW5kLWRpc25leS1sYXlzLW9uLXRoZS1ob3Jpem9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yNS9zaW5nYXBvcmUtcy1jb25mZXR0aS1zbmFja3MtaW4tdGFsa3Mtd2l0aC13YWxtYXJ0LWFuZC10YXJnZXQtYXMtY29sbGFib3JhdGlvbi13aXRoLWRvbGUtYW5kLWRpc25leS1sYXlzLW9uLXRoZS1ob3Jpem9u0gEA?oc=5","id":"CBMirAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yNS9zaW5nYXBvcmUtcy1jb25mZXR0aS1zbmFja3MtaW4tdGFsa3Mtd2l0aC13YWxtYXJ0LWFuZC10YXJnZXQtYXMtY29sbGFib3JhdGlvbi13aXRoLWRvbGUtYW5kLWRpc25leS1sYXlzLW9uLXRoZS1ob3Jpem9u0gEA","guidislink":false,"published":"Thu, 25 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=145, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yNS9zaW5nYXBvcmUtcy1jb25mZXR0aS1zbmFja3MtaW4tdGFsa3Mtd2l0aC13YWxtYXJ0LWFuZC10YXJnZXQtYXMtY29sbGFib3JhdGlvbi13aXRoLWRvbGUtYW5kLWRpc25leS1sYXlzLW9uLXRoZS1ob3Jpem9u0gEA?oc=5\" target=\"_blank\">Singapore's Confetti Snacks in talks with Walmart and Target as collaboration with Dole and Disney lays on the horizon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Singapore's Confetti Snacks in talks with Walmart and Target as collaboration with Dole and Disney lays on the horizon - FoodNavigator-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yNS9zaW5nYXBvcmUtcy1jb25mZXR0aS1zbmFja3MtaW4tdGFsa3Mtd2l0aC13YWxtYXJ0LWFuZC10YXJnZXQtYXMtY29sbGFib3JhdGlvbi13aXRoLWRvbGUtYW5kLWRpc25leS1sYXlzLW9uLXRoZS1ob3Jpem9u0gEA?oc=5\" target=\"_blank\">Singapore's Confetti Snacks in talks with Walmart and Target as collaboration with Dole and Disney lays on the horizon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","source.href":"https:\/\/www.foodnavigator-asia.com","source.title":"FoodNavigator-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Eighteen months since setting foot into the US, Confetti has experienced significant growth, from sealing deals with major retailers to prospective collaborations with mega brands. At its manufacturing plant in Johor, Malaysia, “ugly veggies” and surplus crops from local farms are upcycled into vegetable and mushroom chips. According to Jiyin Low, business development executive at Confetti, the firm has secured a factory in Texas to use the local “imperfect produce” to make their snacks. “It makes more sense to procure locally sourced ingredients for upcycling, although the seasonings will still be sent from our flavour house in Malaysia for now,” ​Low told FoodNavigator-Asia​. In the US, the brand is currently available in chain stores such as Super 1 Foods and Rosauers Supermarkets, and specialty shops like HomeGoods. “Other than working with distributors including United Natural Foods, Inc and US Foods, we are also talking to Walmart and Target to retail our snacks across the country. It usually takes a long time for a company starting out in such a big market to achieve these, so we consider our progress to be very good,” ​she added. At the same time, the firm is doubling down on expansion in the Asia-Pacific (APAC) region. It recently participated in FHA-Food & Beverage 2023 to seek out distributors for markets including Malaysia, Indonesia, Thailand, the Philippines, Japan, and Australia. “Hopefully something fruitful will come out of the discussions that we are having. As a start-up, we certainly want to grow further. If we are able to bring our brand to overseas markets, especially the big ones, then it’d be a great opportunity,” ​said Low. In addition, Confetti is looking to work with Ireland-based farm produce giant Dole to formulate a range of vegan dips using the latter’s surplus fruit and nutritive by-products. “We are in talks with Dole to do this collaboration. Our aim is to create dips that would pair well with our chips,” ​Low revealed. The firm is also preparing to roll out a special line-up that features Mickey and Friends characters on the packaging, following a partnership with Disney. “The Disney characters will be printed on our product packaging, but with a localised twist — such as Peranakan houses in the background. This themed series is expected to be launched in Q4 this year.” ​ Palate preferences​ Confetti has sold 181,541 units of its chips to date, and reached a year-on-year growth rate of 50% since its inauguration. “We’ve done a lot of trade shows to raise brand awareness. From these events, we observed that the upcycling and healthy snacking mindset is more common among consumers in Western countries, such as the US, than Asian markets like Singapore.​ “The idea of being kind to the environment and staying healthy, particularly during and after COVID-19, is very important to a big portion of the Western populations, so the growth potential there is huge,” ​said Low. At the moment, Confetti’s product portfolio comprises three veggie chip flavours, two mushroom chip flavours, and two mandarin orange chip flavours. “Interestingly, we noted a significant difference between the top-performing flavours in Singapore and the US. Products with a truffle element tend to do well in Singapore — our Summer Truffle veggie chips and Black Truffle mushroom chips are the best-sellers here. ​ “For US consumers, they are keener on what they call exotic flavours, or things that are new to them and differ from their daily palate. Our best-selling products there are Tandoori Curry veggie chips and Green Curry mushroom chips,” ​Low shared. The firm is now working on new flavours while delving deeper into fruit chips. “Although the mandarin orange chips were only introduced this year, the response has been quite eye-opening. We thought, ‘why are we solely focusing on vegetables when there are many other things that we can use to reduce food waste?’. We hope to come up with a range of fruit chips very soon,” ​she explained.","filter_flag":1}
{"title":"Tiger breaks beer-making boundaries to keep up with 'sessionable and accessible' drinking trends - FoodNavigator-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yOS9UaWdlci1icmVha3MtYmVlci1tYWtpbmctYm91bmRhcmllcy10by1rZWVwLXVwLXdpdGgtc2Vzc2lvbmFibGUtYW5kLWFjY2Vzc2libGUtZHJpbmtpbmctdHJlbmRz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yOS9UaWdlci1icmVha3MtYmVlci1tYWtpbmctYm91bmRhcmllcy10by1rZWVwLXVwLXdpdGgtc2Vzc2lvbmFibGUtYW5kLWFjY2Vzc2libGUtZHJpbmtpbmctdHJlbmRz0gEA?oc=5","id":"CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yOS9UaWdlci1icmVha3MtYmVlci1tYWtpbmctYm91bmRhcmllcy10by1rZWVwLXVwLXdpdGgtc2Vzc2lvbmFibGUtYW5kLWFjY2Vzc2libGUtZHJpbmtpbmctdHJlbmRz0gEA","guidislink":false,"published":"Mon, 29 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=149, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yOS9UaWdlci1icmVha3MtYmVlci1tYWtpbmctYm91bmRhcmllcy10by1rZWVwLXVwLXdpdGgtc2Vzc2lvbmFibGUtYW5kLWFjY2Vzc2libGUtZHJpbmtpbmctdHJlbmRz0gEA?oc=5\" target=\"_blank\">Tiger breaks beer-making boundaries to keep up with 'sessionable and accessible' drinking trends<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tiger breaks beer-making boundaries to keep up with 'sessionable and accessible' drinking trends - FoodNavigator-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wNS8yOS9UaWdlci1icmVha3MtYmVlci1tYWtpbmctYm91bmRhcmllcy10by1rZWVwLXVwLXdpdGgtc2Vzc2lvbmFibGUtYW5kLWFjY2Vzc2libGUtZHJpbmtpbmctdHJlbmRz0gEA?oc=5\" target=\"_blank\">Tiger breaks beer-making boundaries to keep up with 'sessionable and accessible' drinking trends<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","source.href":"https:\/\/www.foodnavigator-asia.com","source.title":"FoodNavigator-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Somaek​ (soju and beer) is a popular alcoholic beverage combination in South Korea that has gained international fame, largely due to frequent mentions on Korean shows. With a goal of staying at the forefront of the beer industry, Tiger took inspiration from K-culture’s global prominence and developed its own version of the somaek​ drink. “In recent years, we noticed that drinking trends among Asian consumers across all age groups have been evolving. Among Gen Z consumers, there is a preference for drinks that are sessionable, and a willingness to experiment with different flavours. Additionally, there is a growing interest in alcoholic beverages that have an accessible taste profile and are less bitter. ​ “Tiger, best known for our signature lager brewed with malt, hops and yeast, has been moving beyond a single-product brand. Off the back of Tiger Crystal’s successful launch in 2019, we have continued to break new ground with the introduction of Tiger Soju Infused Lager. It is an easy-to-drink beer with a hint of sweetness and a refreshing aftertaste. We believe this twist to lager will appeal to a wider consumer base,” ​Gerald Yeo, Marketing Director at Asia Pacific Breweries Singapore, told FoodNavigator-Asia​. The Tiger Soju Infused Lager was launched in April and comes in two flavours, namely Gutsy Grape and Cheeky Plum, with an ABV of 5.5%. Available in 320ml single cans and in a pack of three cans, the beer can be found at all major supermarkets, convenience stores and petrol marts across Singapore, as well e-commerce platforms such as Shopee, Lazada and Amazon. It has also been rolled out in Vietnam, with the company’s other established markets to follow soon. “​We’ve seen positive feedback from consumers and trade partners, and are confident that like the rise of K-culture around the world, our latest innovation will woo more fans across our markets. As a first mover in the region, this launch reflects our commitment to put consumers at the heart of what we do, and to stay ahead of ever-evolving trends,” ​Yeo said. Celebrity effect​ Tiger is no stranger to engaging big-name personalities to front the brand. Last year, South Korean national footballing hero Son Heung-min starred in a Tiger campaign titled “The Golden Son”. In line with the launch of Tiger Soju Infused Lager, renowned South Korean artiste G-DRAGON has been chosen as its official global brand ambassador. “G-DRAGON is the leader of iconic K-pop group BIGBANG, and an international trendsetter of music, fashion and culture. As a brand known for its courageous spirit, G-DRAGON’s bold and progressive attitude while remaining true to himself perfectly embodies what Tiger stands for,”​ Yeo shared. This sentiment is echoed by the singer, who said: “Breaking barriers but still staying true to myself is one of the ways I resonate with Tiger. Together, I hope we can inspire everyone to uncage their inner passions while being unafraid of what others might say.” Apart from product innovation, Tiger is constantly looking at new ways to bring unique experiences to its consumers. For instance, the brand hosted a “Tiger Uncage Festival: Twist to the Night” event in May to commemorate its latest product release. It featured live performances by an all-Asian line-up, and multi-sensory elements targeted at sight, sound and smell. “As a brand born and brewed in Singapore, we take great pride in our Asian heritage, and Tiger Soju Infused Lager represents our efforts to celebrate the richness of Asian culture. At the same time, Tiger has always been bold in defying conventions and pursuing creative innovations. We want to continue pushing boundaries and to shape the future of beer,” ​Yeo reiterated.","filter_flag":1}
