{"title":"Clean energy is poised for growth in the new industrial age - Inhabitat","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA","guidislink":false,"published":"Tue, 09 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=129, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5\" target=\"_blank\">Clean energy is poised for growth in the new industrial age<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Clean energy is poised for growth in the new industrial age - Inhabitat","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5\" target=\"_blank\">Clean energy is poised for growth in the new industrial age<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","source.href":"https:\/\/inhabitat.com","source.title":"Inhabitat","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Production\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The International Energy Agency has just published its IEA’s Energy Technology Perspectives 2023 report, in which the IEA states that clean energy manufacturing is primed for substantial growth as world enters a “new industrial age.” The report published an estimate that clean technology manufacturing could soon be worth “hundreds of billions of dollars per year.” Across the globe, there has been a major (roughly 50%) increase in investment in clean energy. The IEA is reporting that today’s clean energy investment across the globe of 1.3 trillion U.S. dollars will rise to roughly 2 trillion dollars, in only a few years. Continue reading below Our Featured Videos This incredible growth in investment in sustainable technologies will boost growth in the energy sector and in auto manufacturing with the transition to EVs. Plus, it will contribute to growth in available products in solar, hydrogen, nuclear and wind power. Related: Largest US offshore wind farm approved in Virginia How quickly is sustainable energy growing in the U.S.? China is currently dominating the production and trade of most clean energies currently, but the U.S.’s recent Inflation Reduction Act and other energy bills are encouraging investment in U.S. energy infrastructure and clean energy manufacturing, so the U.S. is expected to become a major center of sustainable energy usage and manufacturing in the coming decade. Will current supply chain issues affect the growth of this budding sustainable industry? Here is the state of clean energy in the U.S., and where it is expected to go in the near future. The current state of clean energy in the U.S. The IEA’s report referred to “the dawn of a new industrial age,” and examined the state of manufacturing for wind turbines, heat pumps, batteries for electric vehicles, solar panels and electrolyzers for hydrogen power. The conclusion of the report was that “the global market for key mass-manufactured clean energy technologies” will be worth about $650 billion per year by 2030, a more than three-fold increase in size from today’s clean energy industry. And unlike previous reports from other outlets, this change is predicted to happen this decade, not half a century in the future. It is already happening now. “The related clean energy manufacturing jobs would more than double from 6 million today to nearly 14 million by 2030 and further rapid industrial and employment growth is expected in the following decades as transitions progress,” the IEA said. For comparison, eight million is the same number of jobs lost in 2 years at the beginning of the Great Recession. In March of 2021, by contrast, there were eight million job openings available as the COVID-19 pandemic shuffled the job market to remote and more flexible work arrangements, the peak of demand for talent. That’s a lot of jobs. Diversifying the supply chain for clean technologies would help bolster and protect the growth of the clean energy industry. But there are other challenges to this new industry’s rapid rise. Challenges to clean energy industry growth A notable recent challenge surely is still the supply chain instability. Disruptions to supply chains have been legendary in recent years due to COVID-19 disrupting manufacturing supply lines and facility operations. The IEA report warned of “potentially risky levels of concentration in clean energy supply chains — both for the manufacturing of technologies and the materials on which they rely.” The U.S. also will see China as a competitor for production of clean energy technologies and market control of global energy consumers, as it currently dominates 70% of both clean production and clean energy markets. World leaders have focused on their own country’s plans for energy independence, rather than working together globally to solve climate change. Competitive markets, while great for inspiring competitive product development, waste a lot of time and resources when countries need to compete over energy market control rather than collaborate. As climate change worsens, it is likely to cause more civil unrest, which further complicates the issue. Also problematic is the mining for rare minerals and metals critical to current battery technology to power clean energy devices. This mining is concentrated in a small number of countries, which leads to instability in the supply chain if mining runs dry or is interrupted by natural disasters or geopolitical conflict. The Democratic Republic of Congo produces over 70% of the world’s cobalt, and just three countries — Australia, Chile and China — account for more than 90% of global lithium production. What could help in this case is the development of technologies that don’t rely on rare materials, the science to synthesize needed materials, or the improvement of battery technologies to be more efficient, which is in progress. what could change in the new industrial age So where do we go in the new industrial age? Clean energy is predicted to change nearly everything about how we live, which isn’t a bad comparison with the last century’s rise of factories, the automobile, and unionized workers. Clean energy will change everything: the balance of global power, the way we move and cook and harvest electricity, how interdependent we are and our awareness of our impact on the planet. Here’s to hoping that the new industrial age will look like flying cars that make not one speck of pollution. It really could be coming this time. Maybe by 2030? Via CNBC Lead image via Pexels","filter_flag":1}
{"title":"Top U.S. clean energy trends to watch in 2023 - Inhabitat","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5","id":"CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA","guidislink":false,"published":"Fri, 12 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=132, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top U.S. clean energy trends to watch in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top U.S. clean energy trends to watch in 2023 - Inhabitat","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top U.S. clean energy trends to watch in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","source.href":"https:\/\/inhabitat.com","source.title":"Inhabitat","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Production\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"We believe that 2023 will be looked on as a turning point in the clean energy revolution and the race to save the planet. This was the point in time when solar and wind energy became cheaper to produce than traditional energy. 2023 is the year that municipalities invested heavily in a clean energy future, setting the stage for a majority of U.S. energy to be from renewable sources in the next couple of decades. What are the clean energy trends driving this sea change to a sustainable future? Here are our top picks for clean energy trends to watch in 2023. Continue reading below Our Featured Videos EV sales skyrocket with one million sold Electric cars are finally taking off, with over one million sold in the U.S. for the first time in 2023. Even though only 40% of Americans say their next car will be an EV, the interest in electric vehicles is going mainstream for the first time. Related: Hydrogen made of biomass revolutionizes clean energy And there are finally plenty of options of EVs to purchase, though the price of cars has been a challenge due to recent near double-digit inflation. Bloomberg is predicting that more Americans will drive EVs than will drive ICE cars by 2030, which means the EV revolution is happening this decade. We are in it now. Offshore wind takes flight In 2023, the U.S.’s first large-scale offshore wind farms are coming online. The U.S. currently only has two operational offshore wind farms, in Rhode Island and Virginia, with a total of seven turbines and capacity of 42 megawatts. It’s not a very significant contribution to the grid. By the end of the year, the first of a new set of gigantic offshore wind farms should be close to operational in the U.S. Vineyard Wind 1 will be located off of Massachusetts, with 800 megawatt capacity, and South Fork Wind will be located off of New York with 132 megawatt capacity. BloombergNEF reports another 5,400 megawatts are on track to finalize financing or begin construction in 2023. As solar and wind power continue to become less expensive than traditional alternative fuels to produce, we expect this to be the turning point when wind power really took off. Legislation changes the world Well, that’s not a headline we thought we would write, to be honest, but the U.S. government and other world governments deserve their props for what climate-targeted legislation they can produce to save the world in time to avoid catastrophic climate change. State lawmakers in Maryland, Massachusetts, Michigan and Minnesota are preparing to pass climate and clean energy legislation. The Inflation Reduction Act is driving heavy investment in U.S. manufacturing for the first time in decades for the sake of EV tax credits and other incentives. It comes at a time when clean technologies can power plants and produce sustainable products for the first time in modern history. According to the International Monetary Fund, the IRA is the most significant piece of climate legislation ever created in U.S. history, funneling $400 billion into climate change mitigation projects over the next decade. Managed correctly, the recent climate bills could shift the course of history. The headwinds against wind power The Inflation Reduction Act barely passed in 2022. Political instability and rancor in the U.S. continues to threaten climate goals that affect the entire world. But there are good signs that this time wind power is really here to stay. The IRA contains about $370 billion in tax credits and incentives for renewable energy and EVs, including extra incentives for companies making clean energy technology in the U.S. Where recent years have been dominated by partisan politics, now state governments are racing to meet climate objectives and realizing it pays to work together to build the heart of the sustainable energy industry in the U.S. for the next generation. “Congress has an important role to play in guiding the swift and effective implementation of the IRA,” said Jose Zayas, executive vice president of policy and programs for the American Council on Renewable Energy, a trade group. “The Treasury Department is still issuing guidance related to key provisions, which will have crucial implications for developers and homeowners seeking to take advantage of a suite of new clean energy tax credits. Congress must use its oversight authority to ensure prompt completion of guidance from Treasury.” In other words, the final challenge is implementation. Can these programs live up to their promises? While battery technology develops the capacity to power the future and more clean energy plants are pushed through financing and permitting, how we roll out our climate-oriented programs over the next decade will in part direct the course of history as we struggle into a sustainable future. Via Inside Climate News Lead image via Pexels","filter_flag":1}
