{"title":"NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers - NVIDIA Blog","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vbnZpZGlhbmV3cy5udmlkaWEuY29tL25ld3MvbnZpZGlhLWdyYWNlLWRyaXZlcy13YXZlLW9mLW5ldy1lbmVyZ3ktZWZmaWNpZW50LWFybS1zdXBlcmNvbXB1dGVyc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vbnZpZGlhbmV3cy5udmlkaWEuY29tL25ld3MvbnZpZGlhLWdyYWNlLWRyaXZlcy13YXZlLW9mLW5ldy1lbmVyZ3ktZWZmaWNpZW50LWFybS1zdXBlcmNvbXB1dGVyc9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vbnZpZGlhbmV3cy5udmlkaWEuY29tL25ld3MvbnZpZGlhLWdyYWNlLWRyaXZlcy13YXZlLW9mLW5ldy1lbmVyZ3ktZWZmaWNpZW50LWFybS1zdXBlcmNvbXB1dGVyc9IBAA","guidislink":false,"published":"Sun, 21 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=141, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vbnZpZGlhbmV3cy5udmlkaWEuY29tL25ld3MvbnZpZGlhLWdyYWNlLWRyaXZlcy13YXZlLW9mLW5ldy1lbmVyZ3ktZWZmaWNpZW50LWFybS1zdXBlcmNvbXB1dGVyc9IBAA?oc=5\" target=\"_blank\">NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NVIDIA Blog<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers - NVIDIA Blog","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vbnZpZGlhbmV3cy5udmlkaWEuY29tL25ld3MvbnZpZGlhLWdyYWNlLWRyaXZlcy13YXZlLW9mLW5ldy1lbmVyZ3ktZWZmaWNpZW50LWFybS1zdXBlcmNvbXB1dGVyc9IBAA?oc=5\" target=\"_blank\">NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NVIDIA Blog<\/font>","source.href":"https:\/\/nvidianews.nvidia.com","source.title":"NVIDIA Blog","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy-efficient systems\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"UK Research Alliance, GW4, Building 6x More Energy-Efficient Supercomputer for Climate Science, Medical Research and More ISC—NVIDIA today announced a supercomputer built on the NVIDIA Grace™ CPU Superchip , adding to a wave of new energy-efficient supercomputers based on the Arm® Neoverse™ platform. The Isambard 3 supercomputer to be based at the Bristol & Bath Science Park, in the U.K., will feature 384 Arm-based NVIDIA Grace CPU Superchips to power medical and scientific research, and is expected to deliver 6x the performance and energy efficiency of Isambard 2, placing it among Europe’s most energy-efficient systems. It will achieve about 2.7 petaflops of FP64 peak performance and consume less than 270 kilowatts of power, ranking it among the world’s three greenest non-accelerated supercomputers. The project is being led by the University of Bristol, as part of the research consortium the GW4 Alliance, together with the universities of Bath, Cardiff and Exeter. Isambard 3 joins a growing wave of NVIDIA Arm-based supercomputers around the world, with additional systems that include GPUs being built at the Swiss National Supercomputing Centre and the Los Alamos National Laboratory in the U.S. “As climate change becomes an increasingly existential problem, it’s vital for computing to embrace energy-efficient technologies,” said Ian Buck, vice president of hyperscale and HPC at NVIDIA. “NVIDIA is working alongside the Arm Neoverse ecosystem to provide a path forward for the creation of more energy-efficient supercomputing centers, driving important breakthroughs in scientific and industrial research.” “From climate change to medicine, supercomputing is already enabling academic and industry leaders to take on some of the world’s biggest challenges,” said Mohamed Awad, senior vice president and general manager of infrastructure at Arm. “Expanding on important areas of research requires a level of performance and energy efficiency that Arm Neoverse uniquely delivers, and through our collaboration with NVIDIA, we’re proud to bring this to life in the Isambard 3 system.” Isambard 3 to Supercharge Breakthroughs in Life Science, Medicine, More Isambard 3, to be built by Hewlett Packard Enterprise, will enable Europe’s scientific research community to supercharge breakthroughs in AI, life sciences, medical, astrophysics and biotech. It will be able to create detailed models of exceptionally complex structures, such as wind farms and fusion reactors, to help researchers unlock new advances in clean and green energy. The Arm-based NVIDIA Grace-powered system will also continue Isambard 2’s work of simulating molecular-level mechanisms to better understand Parkinson’s disease and find new treatments for osteoporosis and COVID-19. These compute-intensive applications benefit from the highest-performing cores, highest memory bandwidth and the optimal memory capacity per core provided by Grace. “Isambard 3’s application performance efficiency of up to 6x its predecessor, which rivals many of the 50 fastest TOP500 systems, will provide scientists with a revolutionary new supercomputing platform to advance groundbreaking research,” said Simon McIntosh-Smith, principal investigator for the Isambard project and professor of HPC at the University of Bristol. “The Arm-based NVIDIA Grace CPU enables the breakthrough energy efficiency required to push the boundaries of scientific discovery and solve some of humanity’s most difficult challenges.” Once the system goes into production in spring 2024, Bristol expects the number of registered users to increase significantly beyond the current 800. Accelerating Scientific Discovery NVIDIA’s accelerated computing platform comprises NVIDIA H100 Tensor Core GPUs , NVIDIA Grace CPU Superchips, NVIDIA Grace Hopper ™ Superchips , NVIDIA Quantum-2 InfiniBand networking and a full suite of NVIDIA AI and HPC software.","filter_flag":1}
{"title":"Electrification Charges Forward - EP Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZXBvbmxpbmUuY29tL0FydGljbGVzLzIwMjMvMDUvMTkvRWxlY3RyaWZpY2F0aW9uLUNoYXJnZXMtRm9yd2FyZC5hc3B40gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZXBvbmxpbmUuY29tL0FydGljbGVzLzIwMjMvMDUvMTkvRWxlY3RyaWZpY2F0aW9uLUNoYXJnZXMtRm9yd2FyZC5hc3B40gEA?oc=5","id":"CBMiTWh0dHBzOi8vZXBvbmxpbmUuY29tL0FydGljbGVzLzIwMjMvMDUvMTkvRWxlY3RyaWZpY2F0aW9uLUNoYXJnZXMtRm9yd2FyZC5hc3B40gEA","guidislink":false,"published":"Fri, 19 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=139, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZXBvbmxpbmUuY29tL0FydGljbGVzLzIwMjMvMDUvMTkvRWxlY3RyaWZpY2F0aW9uLUNoYXJnZXMtRm9yd2FyZC5hc3B40gEA?oc=5\" target=\"_blank\">Electrification Charges Forward<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EP Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Electrification Charges Forward - EP Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vZXBvbmxpbmUuY29tL0FydGljbGVzLzIwMjMvMDUvMTkvRWxlY3RyaWZpY2F0aW9uLUNoYXJnZXMtRm9yd2FyZC5hc3B40gEA?oc=5\" target=\"_blank\">Electrification Charges Forward<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EP Magazine<\/font>","source.href":"https:\/\/eponline.com","source.title":"EP Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy-efficient systems\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Electrification Charges Forward The path toward a sustainable future involves transitioning to clean energy and decreasing our reliance on fossil fuels. The introduction of the incandescent light bulb in the 1880s was the first spark that set humanity on the course of electrification. Although by 1925, only half of American homes had electricity, advances in electrical technology over the next decades greatly increased our dependence on power. In modern times, rapid advancements in emerging technologies, such as electric vehicles (EVs) and smart devices, requires further electrification and making the additional energy use that all these devices require safe and efficient. Electrification is defined as the transition from fossil fuels, including coal, natural gas and oil to clean, renewable energy sources. The challenges to updating the electrical grid to account for the impending energy demands and reliance are great. To fully electrify all systems, processes and devices in homes, commercial buildings and industrial facilities, a significant effort needs to be implemented to update infrastructure for the electrical grid to support the additional demand for energy. The Transition to Clean Energy Electricity today is still generated primarily by natural gas and coal, but as society pushes toward renewable, sustainable and low-carbon energy sources, so does the need for additional electrification. Devices that were once powered by oil and gas, vehicles and even household appliances, are now being powered by electricity. To accommodate these evolving needs, a major infrastructure upgrade to the utility grid presents a massive opportunity that will require substantial investments. The transition to clean energy has been boosted by federal funding and stimulus programs. The Infrastructure Investment and Jobs Act (IIJA) provides significant funding of $110 billion for energy and climate infrastructure. The Inflation Reduction Act of 2022 (IRA) provides an additional $369 billion for clean energy and climate investment for low-carbon technologies. This equates to $479 billion for new climate and energy spending. This funding will support advancements in EV charging infrastructure, advanced manufacturing production for sustainable products, advanced industrial facilities and even sustainable aviation fields. Transportation presents the biggest opportunity, as it is estimated by an S&P Global Mobility report that the U.S. will need to expand its charging infrastructure by eight times by 2030. Fast chargers will be needed at charging stations throughout the country for light vehicles and trucks to support the transition from gas-powered vehicles. Tax credits for alternative energy investments can present an additional incentive for consumers and businesses. The 179D deduction in the IRA enables building owners to claim a tax deduction for qualifying systems in their buildings. A tax deduction of up to $1.88 per square foot is available for new or existing buildings that install technology that reduces energy and power costs, which can help lower and offset costs for upgrading to energy-efficient systems and processes. Under the Internal Revenue Code Section 30D, if a consumer bought a new, qualified EV in 2022 or before, they may be eligible for a tax credit of up to $7,500. Solar photovoltaic (PV) systems are also eligible for a tax credit depending on the year it was installed. It ranges from a credit of 26 percent to 30 percent. An example of the evolution of electrification in homes is the transition from incandescent light bulbs to compact fluorescent light bulbs and now to LED light bulbs, as well as the shift from appliances powered by gas to those powered by electricity. Now the goal of electrification is to make the energy we use today more efficient in whatever setting we are in, whether it’s at home or in our offices. The evolution of electrification in buildings was amplified with the push for LEED-certified buildings, which began in 1993. LEED-certified buildings improve energy efficiency and lower carbon emissions. Now there’s a push for net zero buildings, which produce the same amount of energy as they use. According to the International Energy Agency (IEA), an investment of $27 trillion is required to reach net zero by 2050. Optimizing Energy Use and Resilience Discussions of electrification and the movement towards adopting the widespread use of EVs have proliferated in the media, but how possible is it to fully electrify all systems and processes? It may be possible but will require significant infrastructure upgrades and require monetary investments. According to International Energy Outlook 2021 published by the U.S. Energy Information Administration (EIA), the EIA predicts a nearly 50 percent increase in world energy use by 2050. This level of energy demand is going to require the development of infrastructure that is more energy efficient. E-mobility, or the electrification of transportation, as described by ESFI, is getting the most attention and the most monetary investments through government stimulus. It is one of the most visible advancements in electrification, as all larger vehicle manufacturers now have at least one type of EV on the market. There is a major opportunity to optimize energy use and resiliency of buildings while also lowering energy costs. For commercial buildings, lighting systems represent the biggest opportunity to be more energy efficient, while in industrial facilities, motors could be electrically driven. Buildings are charged based on electricity usage. Using too much electricity during peak hours can incur a surcharge. Installing energy storage allows a building to store energy for use during peak hours to avoid higher energy costs. Energy storage systems allow you to run on battery power and use off-peak energy from the grid to recharge. An opportunity for companies is to improve their Environmental, Social, and Governance (ESG) goals. ESG is described as an organization’s sustainable and ethical efforts. The Securities and Exchange Commission (SEC) is requiring quantifiable evidence of ESG efforts for certain registered investment advisers, advisers exempt from registration, registered investment companies and business development companies. This ensures businesses are providing an honest account of their sustainability efforts. This requirement will propel more businesses to be more energy efficient and socially conscious. Overcoming Energy Demands The three major challenges to increasing electrification include developing the infrastructure to handle increased energy use, the scale to which the infrastructure needs to be developed and supply chain delays. The supply chain is still suffering from COVID-19 pandemic-related labor shortages and shutdowns. There are also shortages of EV battery materials and transformers, which are essential to electrical transmission and distribution. If electricity demand is going to double, there is not enough power currently being generated or the infrastructure to support that growth. Our connected devices and round-the-clock connectivity depend on power. Losing power when all things are electrified will be detrimental. For industrial facilities, many operations today are not electrically generated, as most operate by natural gas, while many homes are also still heated by fossil fuels. It will take some time to move towards electrifying both of those systems. Another challenge will be paying more to help utilities build out all the new infrastructure. It costs a significant amount of money to become greener and more energy efficient. The infrastructure you build needs to be reliable because of our dependence on electricity and devices. Navigating the IIJA and IRA bills to stimulate all this change is also a challenge. Even if new infrastructure is built, the scale to which it needs to be developed is massive. Even if the money is there to develop it, it is a challenge to get the product to build it because of supply chain issues. Navigating the Electrified Future The scale to which the electrical grid infrastructure needs to be developed and upgraded to complete the transition to clean energy and achieve the goal of becoming net zero by 2050 is expansive. The monetary investment alone would be $27 trillion, and with a struggling supply chain, the acquisition of materials for this expansion will be challenging. However, with a federal government stimulus of $479 billion for climate and energy spending, these goals can be achieved. Electrification is charging ahead, so it is imperative that the additional demand for energy is utilized safely and efficiently. The transition to clean energy and less dependence on fossil fuels is the way of the future. These changes will ultimately allow businesses and consumers to operate as responsibly and consciously as possible to improve society as a whole. Navigating this new landscape can be difficult, but there are partners available and ready to assist you in improving the energy efficiency and sustainability of your building, business or facility. For more information about ESFI, visit esfi.org.","filter_flag":1}
{"title":"Aspire Pavers Partners With Duro-Last To Expand the Brand's Amenity Deck Program - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2FzcGlyZS1wYXZlcnMtcGFydG5lcnMtZHVyby1sYXN0LWV4cGFuZC1icmFuZCVFMiU4MCU5OXMtYW1lbml0eS1kZWNrLXByb2dyYW3SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2FzcGlyZS1wYXZlcnMtcGFydG5lcnMtZHVyby1sYXN0LWV4cGFuZC1icmFuZCVFMiU4MCU5OXMtYW1lbml0eS1kZWNrLXByb2dyYW3SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2FzcGlyZS1wYXZlcnMtcGFydG5lcnMtZHVyby1sYXN0LWV4cGFuZC1icmFuZCVFMiU4MCU5OXMtYW1lbml0eS1kZWNrLXByb2dyYW3SAQA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2FzcGlyZS1wYXZlcnMtcGFydG5lcnMtZHVyby1sYXN0LWV4cGFuZC1icmFuZCVFMiU4MCU5OXMtYW1lbml0eS1kZWNrLXByb2dyYW3SAQA?oc=5\" target=\"_blank\">Aspire Pavers Partners With Duro-Last To Expand the Brand's Amenity Deck Program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Aspire Pavers Partners With Duro-Last To Expand the Brand's Amenity Deck Program - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2FzcGlyZS1wYXZlcnMtcGFydG5lcnMtZHVyby1sYXN0LWV4cGFuZC1icmFuZCVFMiU4MCU5OXMtYW1lbml0eS1kZWNrLXByb2dyYW3SAQA?oc=5\" target=\"_blank\">Aspire Pavers Partners With Duro-Last To Expand the Brand's Amenity Deck Program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy-efficient systems\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"WASHINGTON, Iowa – Aspire Pavers, the innovative and sustainable material solutions brand, is pleased to announce its partnership with Duro-Last, the world's largest manufacturer of custom-fabricated thermoplastic roofing systems. Recently acquired by Brava Roof Tile, Aspire Pavers feature a patented grid that enables fast and easy installation with less labor. This paver system will now be added to Duro-Last’s product offerings as a part of the brand’s Amenity Deck program. “We are thrilled to join forces with Aspire Pavers and offer our clients this innovative and sustainable building solution,” says Erica Farver, Senior Business Manager of Roofing at Duro-Last. “Duro-Last and Aspire Pavers share brand ideologies, and by working together, we will be able to offer more people than ever before a recycled rooftop solution that is flexible, durable, and adds ease to installation.” The Duro-Last brand is recognized for its leadership in innovation and sustainability, with solutions ranging from cool roofs to energy-efficient systems, and its award-winning “Recycle Your Roof” program, which promotes circularity in roofing. Duro-Last is the first company in the United States to offer third-party verified environmental product declarations for its thermoplastic roofing solutions and the flagship Duro-Last membrane has achieved NSF\/ANSI 347 Gold certification. Duro-Last also published the first product-specific PVC environmental product declaration (EPD) in the commercial roofing industry. Similarly, Aspire Pavers prioritizes environmental consciousness in its brand pillars. The brand’s pavers use up to 95% post-consumer recycled material, including recycled scrap tire rubber and plastics. The sustainability factors of Aspire Pavers meet the requirements for Green Building projects, including LEED and Envision certifications. With one-third the weight of comparable concrete products and a cutting-edge grid system designed to reduce installation time, Aspire Pavers are ideal for paths, patios, rooftops, balconies, and decks. The patented grid system not only reduces installation time compared to traditional concrete pavers, but also facilitates creating patterns and designs more easily. The brand offers 13 colors, three paver sizes, and a variety of patterns for both form and function. “We’re looking forward to this partnership with Duro-Last and to expanding our reach to more customers,” says Lee Martucci, VP of Business Development at Aspire Pavers. \"Working alongside a renowned company like Duro-Last will allow us to continue to provide top-quality roofing solutions and enhance outdoor spaces with pavers that are both elegant and environmentally friendly.\" To learn more about Aspire Pavers’ product portfolio, visit aspirepavers.com. For more information on Duro-Last, visit www.duro-last.com. # # #","filter_flag":1}
