{"title":"Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5","id":"CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Specright's research reveals consumer preferences for product and packaging sustainability; finds most believe companies today are not accurately reporting on sustainability goals and metrics TUSTIN, Calif., Nov. 15, 2023 \/PRNewswire\/ -- More than three-quarters (80%) of consumers surveyed said they are more likely to trust companies that back up their sustainability claims with publicly shared data, and 25% actively track government regulations around sustainability to better understand how it impacts their favorite brands and products. That's according to a new survey by Specright , the leader in Specification Management software, with findings indicating that consumers today have a heightened awareness when it comes to sustainability and transparency from companies on their products and progress around sustainability goals. However, 69% of consumers don't believe companies today are accurately and honestly reporting on sustainability goals and metrics, and 40% are not comfortable purchasing products from companies that are not actively tracking toward sustainability goals. Amid this increased awareness, consumers are switching up their purchasing behaviors, with primary purchasers often putting their money toward more sustainable products. More than half (58%) of consumers indicated they are willing to spend more money on products that are deemed sustainable or environmentally friendly. Further, 74% of consumers indicated they are more likely to purchase from a company that is transparent about its sustainability practices (i.e., claiming carbon-neutrality, phasing out single-use plastics, using terms such as 'eco' or 'biodegradable,' etc.) and shares updates on progress toward sustainability goals frequently. Outside of making more sustainable purchasing decisions, consumers also have a desire to recycle and properly dispose of the products they buy but are putting the onus on companies and brands to tell them how to do so correctly. In fact, 82% of consumers say they are more likely to recycle products if companies and brands include the appropriate steps for how to recycle correctly directly on the product or packaging. This sentiment around sustainability can be expected to translate into 2024 purchasing decisions, as 71% of consumers revealed they plan to make more sustainable purchasing decisions next year. \"These results show consumers care about the sustainability of the products and packaging they purchase and the companies and brands they purchase from, and clearly companies have more work to do on this front,\" said Matthew Wright, founder and CEO of Specright. \"The results emphasize the importance of data and how it can influence a consumer's decision to purchase products, and many organizations today lack the data to back up their claims or even correctly track and report on sustainability goals, which can negatively impact business. As we move into 2024, it's imperative that companies organize and digitize critical product and packaging data to make reporting on sustainability as accurate as possible and even spark more sustainable product innovation.\" Additional survey findings revealed: Approximately 71% of consumers are more likely to believe a company's sustainability claims if they are printed directly on the product or packaging (i.e. similar to a nutritional label). More than half (53%) of consumers are willing to pay more money for a product with sustainable packaging versus a product with cheaper, non sustainable materials. While consumers are backing up their sustainability beliefs with their wallets, this can depend on certain factors like product or packaging material with consumers confirming they would pay more for: recycled cardboard (50%), cornstarch foam \/ water soluble packaging (48%), reusable plastic totes (62%), products with the terms like 'eco,' 'biodegradable' or 'recyclable' on packaging (55%), to name a few. More than two-thirds of consumers (67%) claim they don't know what the term greenwashing means. When it comes to holiday shopping this year, nearly two-thirds (62%) of consumers prefer to bundle items purchased from online retailers together and receive them at a later date as they believe it's more sustainable. Survey methodology: Specright surveyed 1,000 consumers above the age of 21 in the U.S. who indicated they are a primary purchaser in their household using the online insights platform Pollfish. This survey was completed in November 2023. ‍About Specright Specright is the first purpose-built, patented platform for Specification Management. Whether it's packaging, raw materials, formulas, products, or machines, Specright helps companies digitize, map, and take action across their supply chain to reduce costs, increase profitability, and drive sustainability. Specright serves customers across industries, including packaging, food and beverage, consumer packaged goods, pharmaceutical, retail, industrials, and more. Recognized as a leader in Specification Management, Specright was named one of Fast Company's Most Innovative Companies for 2023, had three executives honored as Supply & Demand Chain Executive Pros to Know in 2023 and won Food Logistics' 2022 Top Software & Technology Provider award. For more information, visit: www.specright.com . For media inquiries, contact: SHIFT Communications [email protected] SOURCE Specright","filter_flag":1}
{"title":"Amcor launches new sustainable medical laminates solutions - OutSourcing-Pharma.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3Lm91dHNvdXJjaW5nLXBoYXJtYS5jb20vQXJ0aWNsZS8yMDIzLzExLzA4L2FtY29yLWxhdW5jaGVzLW5ldy1zdXN0YWluYWJsZS1tZWRpY2FsLWxhbWluYXRlcy1zb2x1dGlvbnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3Lm91dHNvdXJjaW5nLXBoYXJtYS5jb20vQXJ0aWNsZS8yMDIzLzExLzA4L2FtY29yLWxhdW5jaGVzLW5ldy1zdXN0YWluYWJsZS1tZWRpY2FsLWxhbWluYXRlcy1zb2x1dGlvbnPSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3Lm91dHNvdXJjaW5nLXBoYXJtYS5jb20vQXJ0aWNsZS8yMDIzLzExLzA4L2FtY29yLWxhdW5jaGVzLW5ldy1zdXN0YWluYWJsZS1tZWRpY2FsLWxhbWluYXRlcy1zb2x1dGlvbnPSAQA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3Lm91dHNvdXJjaW5nLXBoYXJtYS5jb20vQXJ0aWNsZS8yMDIzLzExLzA4L2FtY29yLWxhdW5jaGVzLW5ldy1zdXN0YWluYWJsZS1tZWRpY2FsLWxhbWluYXRlcy1zb2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Amcor launches new sustainable medical laminates solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">OutSourcing-Pharma.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Amcor launches new sustainable medical laminates solutions - OutSourcing-Pharma.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3Lm91dHNvdXJjaW5nLXBoYXJtYS5jb20vQXJ0aWNsZS8yMDIzLzExLzA4L2FtY29yLWxhdW5jaGVzLW5ldy1zdXN0YWluYWJsZS1tZWRpY2FsLWxhbWluYXRlcy1zb2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Amcor launches new sustainable medical laminates solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">OutSourcing-Pharma.com<\/font>","source.href":"https:\/\/www.outsourcing-pharma.com","source.title":"OutSourcing-Pharma.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The company that develops and produces responsible packaging solutions made the announcement on Monday (November 6). Amcor is developing all-film packaging that is recyclable in the polyethylene stream and reduces the carbon footprint of the final package while maintaining performance requirements of device applications. Amcor says will help medical companies progress their sustainability goals without compromising patient safety. Called the new Amcor HealthCare Recycle-Ready Medical Laminates will be showcased at COMPAMED, an international trade fair for the medical technology sector, taking place November 13-16 in Düsseldorf, Germany. The solution is a mono-material polyethylene (PE) laminate that can be used for a wide range of packaging formats. It can replace non-recyclable with recycle-ready lidding for 3D thermoformed packages, used for drapes and protective materials, catheters, as well as injection and tubing systems. Another application of the laminates would be in 2D pouches for products such as wound care materials and gloves. “This launch demonstrates our commitment to innovation for the healthcare industry and showcases the incredible work of Amcor’s R&D experts. Our mono-polyethylene solution addresses the key issue of medical packaging recyclability and is a significant step towards helping the medical sector safely embrace more sustainable packaging solutions,” said Daniel Roiz, Sales and Marketing Director Amcor HealthCare EMEA. “We are committed to continuing to advance our portfolio towards delivering on our pledge to develop all of Amcor’s packaging to be recyclable or reusable by 2025.” The company says that the medical industry is changing and believes there is a need for more sustainable packaging practices to be introduced at scale without compromising device safety and performance, which are imperative for patient safety. The laminates, Amcor says, will enable medical device manufacturers to take a step forward in their sustainability journey, to make a real difference within healthcare. Anyone attending COMPAMED can find Amcor in Hall 8a \/ R11. The company is known for producing responsible packaging solutions for pharmaceutical, medical, food, home and personal care, and other products. The company is focused on making packaging that is increasingly lighter weight, recyclable, and reusable, and made using an increasing amount of recycled content. In fiscal year 2023, 41,000 Amcor people generated $14.7 billion in annual sales from operations that span 218 locations in 41 countries.","filter_flag":1}
{"title":"The Future Is Circular: How Companies Can Prepare to Grow in a Changing World - Bain & Company","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5iYWluLmNvbS9pbnNpZ2h0cy90aGUtZnV0dXJlLWlzLWNpcmN1bGFyLWhvdy1jb21wYW5pZXMtY2FuLXByZXBhcmUtdG8tZ3Jvdy1pbi1hLWNoYW5nZWQtd29ybGQtY2VvLXN1c3RhaW5hYmlsaXR5LWd1aWRlLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5iYWluLmNvbS9pbnNpZ2h0cy90aGUtZnV0dXJlLWlzLWNpcmN1bGFyLWhvdy1jb21wYW5pZXMtY2FuLXByZXBhcmUtdG8tZ3Jvdy1pbi1hLWNoYW5nZWQtd29ybGQtY2VvLXN1c3RhaW5hYmlsaXR5LWd1aWRlLTIwMjMv0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5iYWluLmNvbS9pbnNpZ2h0cy90aGUtZnV0dXJlLWlzLWNpcmN1bGFyLWhvdy1jb21wYW5pZXMtY2FuLXByZXBhcmUtdG8tZ3Jvdy1pbi1hLWNoYW5nZWQtd29ybGQtY2VvLXN1c3RhaW5hYmlsaXR5LWd1aWRlLTIwMjMv0gEA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5iYWluLmNvbS9pbnNpZ2h0cy90aGUtZnV0dXJlLWlzLWNpcmN1bGFyLWhvdy1jb21wYW5pZXMtY2FuLXByZXBhcmUtdG8tZ3Jvdy1pbi1hLWNoYW5nZWQtd29ybGQtY2VvLXN1c3RhaW5hYmlsaXR5LWd1aWRlLTIwMjMv0gEA?oc=5\" target=\"_blank\">The Future Is Circular: How Companies Can Prepare to Grow in a Changing World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Future Is Circular: How Companies Can Prepare to Grow in a Changing World - Bain & Company","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5iYWluLmNvbS9pbnNpZ2h0cy90aGUtZnV0dXJlLWlzLWNpcmN1bGFyLWhvdy1jb21wYW5pZXMtY2FuLXByZXBhcmUtdG8tZ3Jvdy1pbi1hLWNoYW5nZWQtd29ybGQtY2VvLXN1c3RhaW5hYmlsaXR5LWd1aWRlLTIwMjMv0gEA?oc=5\" target=\"_blank\">The Future Is Circular: How Companies Can Prepare to Grow in a Changing World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","source.href":"https:\/\/www.bain.com","source.title":"Bain & Company","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This article is part of Bain’s 2023 CEO Sustainability Guide Explore the report To thrive long term in a world in which humans annually consume 1.75 times the natural resources the earth can regenerate in 12 months, businesses must decouple growth from resource extraction. In addition to improving environmental sustainability, circularity offers companies in most industries a way to gain competitive advantage at significant scale and thrive in a future in which profits will be made differently. Circular practices like recovering resources, extending the life of products, and promoting a sharing economy offer valuable benefits, including greater business resilience, more efficient use of resources, and revenue growth from new customers, services, and innovation. Many business leaders recognize this. In a survey conducted by Bain & Company and the World Economic Forum in October 2022, 35% of executives ranked circularity as one of their organization’s highest priorities, the third highest tally after “optimize supply chain performance” and “operate sustainably.” And in a Bain survey, executives reported that they anticipate 30% growth in share of revenue from circularity between 2021 and 2030. Even so, most organizations operate today with a business model built for a linear world. These models won’t thrive in a circular economy. To unlock circularity’s true value, executives must transform two things: their material model—how they source and use resources—and their business model—how they generate revenue and profits (see Figure 1). Figure 1 To build sustainability and long-term economic value, companies must simultaneously redesign the way they use materials and how they construct their business model Insurgents like Back Market, a refurbished device marketplace, and the luxury reseller The RealReal are already doing that—disrupting industries with new ways of operating and earning revenue. Bain research has found that 45% of executives expect these types of new entrants to change their industry, and concern about the threat from insurgents is highest among those incumbent companies that have done the most planning for the circular transition. Incumbents are acting, too. Of 380 large global companies studied in 10 different industries, 55% have made specific, measurable circularity commitments, according to Bain research. These often focus on recycled inputs and waste reduction. Few have begun to really rethink their full business model, however, and that’s where much of circularity’s potential payoff often lies. Companies can begin to comprehensively build for a circular world by taking two important steps: 1. Define the circular ambition. From today’s linear ways of operating, circularity looks very costly. And the value it will add is often underestimated. To overcome that, companies must envision what the future will look like: where money will be spent, how profits will be earned, and which types of companies will earn them. This includes imagining how circular transformations will reshape interaction with customers, suppliers, and the broader ecosystem, and also how circularity models can help tackle pressing operating issues like scarce and diminishing resources, supply chain disruptions, regulation, and increasing environmental damage. For most companies, this transition is likely to evolve over the next decade, or potentially longer. Consider a trucking company that is in the midst of a multiyear redesign of its business for a profitable circular future. Triggered by three things—the technology breakthroughs that have fueled the growth of low-emitting electric and autonomous vehicles, usage-based business models, and the fight for recycled and scarce inputs—the company is planning for the possibility that, in the future, customers will buy access to trucking based on usage rather than owning their own trucks. At the same time, the company is incorporating circularity into how it competes in today’s marketplace, designing its trucks and components to be more modular and upgradable, and thereby longer lived. This also makes components easier to recover at the end of a vehicle’s useful life for use in remanufacturing. Because reuse extends component lifetime, it is one way to reduce Scope 3 emissions. Supporting sustainable, circular, cost-competitive inputs and boosting uptime also reduces emissions. And all these efforts reduce total operating expenses. In this way, thinking about its circular ambition is helping this trucking company position itself to defend its business and navigate potential regulatory changes. 2. Plan future profits. As new business models change how companies earn revenue and the more efficient use of resources reduces costs, the way profits are made will evolve as well. That’s why it’s important for every company to understand: 1) where and how it can make money in a circular world, 2) the stages at which its industry and market are likely to reach a level of adoption and maturity that justifies investment in that model, and 3) how that future should influence new products and services being created today. Innovative technology, evolving regulations, consumer and customer demand, supply chain volatility, and material scarcity are among the factors that will influence those answers. They won’t always be perfectly predictable, and executives may not know all the answers, but they can and should identify the signposts they need to watch out for, the signals that can indicate an acceleration in the shift to circularity, such as declining unit production costs or the development of supporting infrastructure. Consider how the increasing scarcity of materials like lithium and rare earth metals needed for electric vehicle (EV) batteries will shift a portion of car industry profits toward companies collecting, sorting, and recycling EV batteries. While it’s hard to predict exactly how this will play out, manufacturers with access to end-of-life batteries and recycling capabilities will have a strong strategic advantage in the future. To understand where companies can make money, it’s critical to understand how market structures will transition in the future and which segments of the value chain will have a disproportionate degree of influence on critical flows of needed resources. Recognizing that the level of influence and control in its industry will shift toward those participants who facilitate the reverse flow of used materials and products, a chemical company is developing a plastics recycling strategy to commercialize recycled materials and gain access to scarce feedstock of postconsumer packaging, including PET and recycled aluminum. This will be a key strategic advantage in the future when these materials become even more scarce. Once critical market transitions are identified, companies must develop strategies to access, shift, and influence them, both alone and through an ecosystem of partners and other participants. Actions to take now CEOs planning for a more efficient, resilient, and profitable circular future benefit from taking certain actions now: Identify strategic opportunities for which circularity can create and accelerate value: new customers, new sources of revenue and monetization models, supply chain resilience, sustainability, and access to scarce supply, among others. Determine how circularity is likely to evolve in your industry (adoption curves), the signals or signposts to watch for signs of increased momentum in customer adoption, and how production cost will come down over time (experience curves). Define the material and business models that will help position the company for maximum competitive advantage. Anticipate transitioning of market structures and resulting distribution of influence and control across the value chain and invest to influence and secure the flow of critical resources. Map out and start building the broader ecosystem partnerships required to scale your circular solutions. The authors would like to warmly thank Simone Doms, a practice director in Bain’s Sustainability & Responsibility practice in Munich, for her extensive contributions to this article.","filter_flag":1}
{"title":"NRF | Creating a circular retail economy - NRF News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vbnJmLmNvbS9ibG9nL2NyZWF0aW5nLWNpcmN1bGFyLXJldGFpbC1lY29ub2150gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vbnJmLmNvbS9ibG9nL2NyZWF0aW5nLWNpcmN1bGFyLXJldGFpbC1lY29ub2150gEA?oc=5","id":"CBMiNWh0dHBzOi8vbnJmLmNvbS9ibG9nL2NyZWF0aW5nLWNpcmN1bGFyLXJldGFpbC1lY29ub2150gEA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vbnJmLmNvbS9ibG9nL2NyZWF0aW5nLWNpcmN1bGFyLXJldGFpbC1lY29ub2150gEA?oc=5\" target=\"_blank\">NRF | Creating a circular retail economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NRF News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NRF | Creating a circular retail economy - NRF News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vbnJmLmNvbS9ibG9nL2NyZWF0aW5nLWNpcmN1bGFyLXJldGFpbC1lY29ub2150gEA?oc=5\" target=\"_blank\">NRF | Creating a circular retail economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NRF News<\/font>","source.href":"https:\/\/nrf.com","source.title":"NRF News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Select retailers attending NRF 2024: Retail’s Big Show this January in New York City will participate in an invitation-only sustainability workshop to imagine the future of retail. The workshop will explore how consumers and retailers can thrive in a more sustainable, circular retail economy. Popularized by the Ellen MacArthur Foundation, a circular system mimics nature where there is no waste because all waste becomes essential for other valuable purposes. NRF 2024: Retail's Big Show Browse photos, blog posts, videos and more from NRF 2024: Retail’s Big Show. Retailers are already exploring circular retail models that keep products in use as long as possible before they are ultimately recycled when they are no longer useful. Circular retail practices include, for example, resale retail models in which retailers sell or facilitate the sale of “gently worn” or “previously loved” products. It also includes selling products in reusable or refillable packaging to reduce packaging waste. The NRF circularity workshop will include retailers focused on fashion, electronics, grocery, personal care, furniture, luxury, home, hardware, general merchandise, thrift, chain restaurants and more. Retail executives with roles in legal, finance, marketing, merchandising, forward and reverse logistics, store operations and sustainability are attending. Each type of retailer and each retail role will bring unique perspectives to the industry-wide conversation. The discussion will address industry needs and concerns, including the following: Improving the consumer experience Consumers are demanding more sustainable products and services and retailers are making it easier for consumers to find them on store shelves and websites. Retailers are also exploring consumer preferences in a circular economy: How do different types of consumers want to return, repair, resell or recycle different types of products? Which types of products are they most interested in repairing or reselling? Do consumers want to see new products and used products side-by-side on store shelves and websites, or do they prefer buying new and used as separate experiences? What can retailers do to help consumers consider used, repaired or refurbished products before buying new? Scaling needed infrastructure Retailers cannot make the transition to circular retail models on their own because they are only one part of an evolving system of interconnected networks full of independent actors. The system involves, among many others, consumers, manufacturers, suppliers, recyclers and logistics providers. Successful circular systems need the participation of: Product designers and manufacturers to create affordable products made from recycled or other environmentally preferable materials, that are easy to repair, refurbish and upgrade for reuse or resale, and that can be easily recycled into their component parts and materials when they are no longer useful. Businesses that can affordably repair, refurbish and upgrade products despite the cost of highly skilled local labor markets and the costs of maintaining needed inventories of spare parts and materials. Recycling centers to collect and sort larger volumes of increasing varieties of materials. Most recycling centers can only handle limited types of materials, including paper, cardboard, metals and specific beverage containers. Recycling infrastructure will need to be scaled to collect larger volumes of electronics, fashion, furniture, small and large appliances and packaging, and the ability to separate those products into useful materials. Manufacturer demand for the collected materials to make new products must scale simultaneously to ensure the collected materials are put to good use. Local and regional distribution centers to handle both new products that are shipped on pallets of uniformly packaged units clearly labeled with size, color and style and returned or used products that arrive unpackaged and in random assortments. Unlike distribution centers for new products, return centers require additional dedicated space for sorting and evaluating products to determine which can be resold, which need to be repaired, refurbished or repackaged, and which must be recycled. Providing needed marketing support Sustainability Read up on NRF’s latest coverage of sustainability in retail. With everyone defining sustainability differently, retailers are careful how they talk about their sustainability efforts, including their efforts to support emerging circular solutions. Retailers must communicate accurate, meaningful and relevant sustainability information without overstating the impact of their efforts, avoiding both greenwashing and greenmuting. Moving toward circular business models creates unique challenges for retail and brand marketing teams because only 11% of consumers are familiar with the term “circularity.” A recent survey discovered that, among fashion-focused consumers who claim to know what circularity means, 19% mistakenly think it refers to cyclical fashion trends and 13% believe it references blood or air flow. Retailers need to be talking with consumers about circular solutions in ways that drive interest and demand, but they must do it while the needed infrastructure to support those solutions is still being built by other industries. Mapping additional retail industry needs Retailers will also use time at the sustainability workshop to continue developing relevant retail-focused metrics for the circular economy, creating retail industry benchmarks, and providing clarity around definitions and the roles\/activities that exist within the circular economy (e.g., reverse logistics, repair\/refurbish, marketing, resale, forward logistics, etc.). They will also continue exploring how and why circular retail operates differently within different retail verticals and what lessons can be drawn from ongoing pilot projects in different verticals, identifying the most significant revenue and cost-reduction opportunities within the circular economy for different types of retailers, and reviewing lessons learned from Europe. Retail executives who have not yet registered for the Circularity Workshop are encouraged to apply online. They can include the event as part of their full NRF 2024: Retail’s Big Show experience or register for the workshop as a separate stand-alone event. Both options provide retailers with a free Expo Pass to visit more than 1,000 exhibitors.","filter_flag":1}
{"title":"Dow funds seven new new business and sustainability projects to drive social impact - Dow Corporate","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5","id":"CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5\" target=\"_blank\">Dow funds seven new new business and sustainability projects to drive social impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dow Corporate<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dow funds seven new new business and sustainability projects to drive social impact - Dow Corporate","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5\" target=\"_blank\">Dow funds seven new new business and sustainability projects to drive social impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dow Corporate<\/font>","source.href":"https:\/\/corporate.dow.com","source.title":"Dow Corporate","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Selected projects are part of the company’s Business Impact Fund program Since 2016, the Impact Fund has supported 58 projects in 22 countries MIDLAND, Mich. – November 9, 2023 – Today, Dow (NYSE: DOW) announced its 2023 Business Impact Fund selections: seven projects that will help drive social impact and advance sustainability through collaboration. The annual fund brings together NGOs, nonprofit organizations and Dow customers to help solve global issues using Dow technology and employees’ expertise. \"Our Impact Fund is about helping to solve some of the world’s most pressing challenges while using our products for good and unlocking innovative business opportunities with our customers,” said Bob Plishka, global director of Strategic Corporate Partnerships and Dow Company Foundation president. “This year’s projects focus on addressing circularity and waste transformation initiatives while seeking to support society’s most vulnerable populations.” People help collect materials through Delterra's Rethinking Recycling program. Dow is collaborating with Delterra through Dow’s 2023 Business Impact Fund to support the program in Argentina. 2023 Business Impact Fund projects Argentina: Driving Change for Waste Traceability and Recycling Rates – Dow and Delterra are collaborating to improve the impact and transparency of waste management and recycling systems. Through an innovative material traceability tool using blockchain technology, recycled plastic can now be tracked from collection to new products and packaging. Tracking plastic allows companies to know exactly where their recycled materials are coming from. Dow also supports Delterra's Rethinking Recycling program in Bahía Blanca, intending to triple recycling rates by 2025. The project will help improve behaviors surrounding waste separation, recycling, and collection of materials. The project will increase recycling center capacity, help find material buyers and create jobs for cooperative waste workers. – Dow and Delterra are collaborating to improve the impact and transparency of waste management and recycling systems. Through an innovative material traceability tool using blockchain technology, recycled plastic can now be tracked from collection to new products and packaging. Tracking plastic allows companies to know exactly where their recycled materials are coming from. Dow also supports Delterra's Rethinking Recycling program in Bahía Blanca, intending to triple recycling rates by 2025. The project will help improve behaviors surrounding waste separation, recycling, and collection of materials. The project will increase recycling center capacity, help find material buyers and create jobs for cooperative waste workers. Brazil: Project REUSE (Fridge Recycling Expansion) – The next phase of Project REUSE, which focuses on enabling a circular economy for polyurethanes, will expand to the Southeast and Northeast regions of Brazil, combining efforts with an important value chain partner. The project’s initial phase successfully focused on recycling mattresses and sofas in one city in Brazil. The second phase explored refrigerator recycling in multiple cities in Brazil. Now, the expanded program will focus on a larger area in Brazil, providing recycling services to more consumers and helping the industry to achieve the 2024 Brazilian Extended Producer Responsibility goal to recollect and recycle 12% of total production. The project will continue to reduce improperly disposed waste, better manage refrigerant gases and help increase the amount of polyurethane recovered from equipment. – The next phase of Project REUSE, which focuses on enabling a circular economy for polyurethanes, will expand to the Southeast and Northeast regions of Brazil, combining efforts with an important value chain partner. The project’s initial phase successfully focused on recycling mattresses and sofas in one city in Brazil. The second phase explored refrigerator recycling in multiple cities in Brazil. Now, the expanded program will focus on a larger area in Brazil, providing recycling services to more consumers and helping the industry to achieve the 2024 Brazilian Extended Producer Responsibility goal to recollect and recycle of total production. The project will continue to reduce improperly disposed waste, better manage refrigerant gases and help increase the amount of polyurethane recovered from equipment. Mexico: Project Eztli – Eztli (an Indigenous word related to blood, life and vitality) is a shared value project focused on advancing inclusion by fostering awareness about menstrual hygiene needs, connecting Dow’s silicone innovation in menstrual cups, educational campaigns, and health information initiatives. In collaboration with for-profit and nonprofit organizations such as MEXFAM and United Way Mexico, the project will donate 80,000 menstrual cups to people in need in Mexico City, the State of Mexico and Queretaro City. The project also creates a strategic business opportunity for consumer rubber in the Mexican market. – Eztli (an Indigenous word related to blood, life and vitality) is a shared value project focused on advancing inclusion by fostering awareness about menstrual hygiene needs, connecting Dow’s silicone innovation in menstrual cups, educational campaigns, and health information initiatives. In collaboration with for-profit and nonprofit organizations such as MEXFAM and United Way Mexico, the project will donate menstrual cups to people in need in Mexico City, the State of Mexico and Queretaro City. The project also creates a strategic business opportunity for consumer rubber in the Mexican market. South Africa: Soap for Hope – Through a collaboration with Diversey – A Solenis Company, a leader in cleaning and hygiene solutions for industrial and institutional markets, and the Pebbles Project, a local NGO with decades of experience in education and health work services, this project aims to give a second life to soap bar waste from local hotels to the benefit of underserved communities in South Africa. Soap For Hope will engage, train and empower unemployed young adults and women to establish a collection network and recycling facility for used soap bars. In addition, a distribution network for the upcycled soap bars will be set up to promote sustainable sanitation and create a positive impact on local communities. – Through a collaboration with Diversey – A Solenis Company, a leader in cleaning and hygiene solutions for industrial and institutional markets, and the Pebbles Project, a local NGO with decades of experience in education and health work services, this project aims to give a second life to soap bar waste from local hotels to the benefit of underserved communities in South Africa. Soap For Hope will engage, train and empower unemployed young adults and women to establish a collection network and recycling facility for used soap bars. In addition, a distribution network for the upcycled soap bars will be set up to promote sustainable sanitation and create a positive impact on local communities. Thailand: Small Scale Pyrolysis Unit – Dow will partner with the Plastics Institute of Thailand to support a small enterprise that developed low-temperature heat induction-based pyrolysis technology to convert low-value used flexible plastic packaging into pyrolysis oil and further process into circular feedstock for the Dow-affiliated cracker in Map Ta Phut, Thailand. Reintroducing post-consumer flexible plastic film into the value chain is an opportunity to increase circularity in Thailand's community waste management system. – Dow will partner with the Plastics Institute of Thailand to support a small enterprise that developed low-temperature heat induction-based pyrolysis technology to convert low-value used flexible plastic packaging into pyrolysis oil and further process into circular feedstock for the Dow-affiliated cracker in Map Ta Phut, Thailand. Reintroducing post-consumer flexible plastic film into the value chain is an opportunity to increase circularity in Thailand's community waste management system. Ukraine: Recyclable Grain Bags – This project aims to support small and medium-sized farms and local industry by introducing a recyclable grain bag (sleeve) storage technology. With this technology, farmers impacted by the destruction of agricultural equipment have an opportunity to store their harvest in an easy and accessible way and preserve it until the point of usage or export, which helps prevent food waste. Dow is working with the Ukrainian Agrarian Council NGO and local business partners to simultaneously integrate a recycling concept for the bags to help close the loop and reduce plastic waste. United States: Taking Care of our Home – This project assesses the current recycling landscape and identifies strategies to improve recycling rates in key U.S. Gulf Coast communities where Dow operates. By uniting with our NGO partner, The Recycling Partnership, our goal is to boost residential and commercial recycling rates in these communities, which contain most of Dow’s manufacturing footprint in North America. Since launching in 2016, the Impact Fund has supported 58 projects in 22 countries totaling nearly $12 million in investments. To date, the Fund’s projects have achieved the following outcomes: >2,000 jobs created jobs created >13,400 MT materials recycled materials recycled >9,500 MT of plastic diverted from a landfill or environment of plastic diverted from a landfill or environment 46,000 acres of land protected Dow employees worldwide nominate potential projects, and a diverse committee representing business and functional leadership across the Company selects the winners. Projects must meet the following criteria: Have the potential to address critical social issues or advance sustainability initiatives Be scalable in their design and impact Engage Dow customers and value chain partners And create new business opportunities for Dow About Dow Dow (NYSE: DOW) combines global breadth; asset integration and scale; focused innovation and materials science expertise; leading business positions; and environmental, social and governance leadership to achieve profitable growth and help deliver a sustainable future. The Company's ambition is to become the most innovative, customer centric, inclusive and sustainable materials science company in the world. Dow's portfolio of plastics, industrial intermediates, coatings and silicones businesses delivers a broad range of differentiated, science-based products and solutions for its customers in high-growth market segments, such as packaging, infrastructure, mobility and consumer applications. Dow operates manufacturing sites in 31 countries and employs approximately 37,800 people. Dow delivered sales of approximately $57 billion in 2022. References to Dow or the Company mean Dow Inc. and its subsidiaries. For more information, please visit www.dow.com or follow @DowNewsroom on Twitter. ### For further information, please contact: Jess MacDonald 780-998-8426 jmacdonald1@dow.com Mary Fournier 989-636-7475 mkfournier@dow.com","filter_flag":1}
{"title":"Future-Built Companies Embrace Sustainability | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZnV0dXJlLWJ1aWx0LWNvbXBhbmllcy1lbWJyYWNlLXN1c3RhaW5hYmlsaXR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZnV0dXJlLWJ1aWx0LWNvbXBhbmllcy1lbWJyYWNlLXN1c3RhaW5hYmlsaXR50gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZnV0dXJlLWJ1aWx0LWNvbXBhbmllcy1lbWJyYWNlLXN1c3RhaW5hYmlsaXR50gEA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZnV0dXJlLWJ1aWx0LWNvbXBhbmllcy1lbWJyYWNlLXN1c3RhaW5hYmlsaXR50gEA?oc=5\" target=\"_blank\">Future-Built Companies Embrace Sustainability | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Future-Built Companies Embrace Sustainability | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZnV0dXJlLWJ1aWx0LWNvbXBhbmllcy1lbWJyYWNlLXN1c3RhaW5hYmlsaXR50gEA?oc=5\" target=\"_blank\">Future-Built Companies Embrace Sustainability | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Few Companies Lead the Way, but Sustainability Is a Competitive Advantage Pressure on companies to take action to slow the rate of climate change is growing from regulators, customers, investors, and other stakeholders. Yet many organizations are not delivering. In our Build for the Future research, approximately 80% of companies aspire to be sustainability leaders in the next three years, but less than 5% are systematically implementing advanced use cases to generate sustainability and societal benefits. Leading companies create a competitive advantage from sustainability in two major ways: Making the core sustainable. First, they innovate and transform their existing organization, operations (to reduce Scope 1 and Scope 2 emissions), and supply chain (Scope 3 emissions) to reduce their environmental impact and become more inclusive. In doing so, these companies mitigate risks to their business from climate-related disruptions, increased regulation, and other factors, becoming more resilient even as they reduce costs. For example, IKEA is shifting its business model to become fully circular across a range of initiatives by 2030. Furniture designs now emphasize renewable materials and recycled contents, with products that are built to be more durable and repairable. Driving new sustainable growth. Sustainability leaders also grow by innovating their business model, developing new offerings, and acquiring green businesses. Schneider Electric developed a new platform called EcoStruxure, which includes connected products and sensors, control hubs, apps, analytics, and services, all aimed at helping customers measure and improve their sustainability performance. Since launch, the platform has been deployed in almost 500,000 sites and now connects more than 1 billion devices, according to the company. Schneider Electric’s sustainability transformation has seen the company triple in size, growing from €9 billion in 2003 to €34 billion in revenues in 2022. Blueprint to Build for the Future in Sustainability One key finding from our research is that 36% of future-built companies are also leading in terms of sustainability, compared with just 4% for stagnating companies—a nine-fold increase. What separates these future-built companies? We have analyzed the differences and developed a Build for the Future framework. It includes six elements, each of which has a sustainability component: Leadership aligned around purpose and strategy , integrating sustainability and social impact goals. Leaders must articulate a compelling “why” that explains the underlying rationale to stakeholders. integrating sustainability and social impact goals. Leaders must articulate a compelling “why” that explains the underlying rationale to stakeholders. An agile, resilient operating model that gains an advantage from sustainability , reimagining business outcomes and developing new offerings that can catalyze sustainable growth. Companies need to create new strategies and options for the future, balancing risks and changing economics. Sustainability metrics need to be integrated into business models and employees’ roles. reimagining business outcomes and developing new offerings that can catalyze sustainable growth. Companies need to create new strategies and options for the future, balancing risks and changing economics. Sustainability metrics need to be integrated into business models and employees’ roles. A differentiated people advantage, by developing sustainability skills and capabilities. Employees need the right training and incentives, managers need sufficient autonomy, and upskilling efforts need to be rethought to include sustainability. Similarly, an inclusive culture helps all employees thrive and improves the overall employee value proposition. by developing sustainability skills and capabilities. Employees need the right training and incentives, managers need sufficient autonomy, and upskilling efforts need to be rethought to include sustainability. Similarly, an inclusive culture helps all employees thrive and improves the overall employee value proposition. A sustainability-oriented, innovation-driven culture, to bring new ideas to the challenge of sustainability, particularly as technology evolves. Companies need to report progress and celebrate success. to bring new ideas to the challenge of sustainability, particularly as technology evolves. Companies need to report progress and celebrate success. Embedded AI, to implement advanced use cases and scale those with the most potential. Many measurement and reporting solutions can operate autonomously, with AI doing the bulk of the work in analyzing data and generating insights to optimize the use of energy, materials, and other resources. to implement advanced use cases and scale those with the most potential. Many measurement and reporting solutions can operate autonomously, with AI doing the bulk of the work in analyzing data and generating insights to optimize the use of energy, materials, and other resources. A modern tech and data platform, to quickly identify sustainability priorities, rapidly identify opportunities, mitigate risks, and measure performance. Leaders should constantly assess and implement promising new digital solutions. Sustainability is a complex challenge, and companies simply cannot succeed through isolated, standalone efforts. Instead, they need an all-of-the-above approach, applying the six elements of the Build for the Future framework and integrating sustainability into their business model, their overall strategy, and everything they do. As our data shows, that approach yields a range of benefits. Perhaps the most important? Helping to protect the environment and better meet the needs of all stakeholders.","filter_flag":1}
{"title":"Don't Believe What Consumers Say When It Comes to Sustainability - The Business of Fashion","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA","guidislink":false,"published":"Fri, 24 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=328, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5\" target=\"_blank\">Don't Believe What Consumers Say When It Comes to Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business of Fashion<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Don't Believe What Consumers Say When It Comes to Sustainability - The Business of Fashion","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJ1c2luZXNzb2ZmYXNoaW9uLmNvbS9vcGluaW9ucy9zdXN0YWluYWJpbGl0eS9zdXN0YWluYWJpbGl0eS1zdXJ2ZXlzLWZhc2hpb24tY29uc3VtZXJzLWJsYWNrLWZyaWRheS_SAQA?oc=5\" target=\"_blank\">Don't Believe What Consumers Say When It Comes to Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Business of Fashion<\/font>","source.href":"https:\/\/www.businessoffashion.com","source.title":"The Business of Fashion","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"One of the world’s biggest shopping holidays takes place this week: Black Friday, a frenzy of heavily discounted excess consumption. The shopping hauls serve to spotlight one of many contradictions in the world of sustainable fashion: while consumers increasingly say they want more sustainable products, they’re not shopping like that way. Indeed, even as survey after survey reveals increasing investor and consumer preference for eco-conscious and socially responsible garments, companies like Shein continue to grow market share by selling $12 synthetic halter tops with short life spans. A survey of more than 20,000 people published by consultancy Bain & Company earlier this month reached the conclusion that consumers around the world are willing to pay 12 percent more for sustainable products. Another recent survey from NYU Stern Centre for Sustainable Business asserted that sustainable brands are growing at twice the rate of traditional labels. And a Harvard Business Review article written by Deloitte consultants concluded that retail is “fast approaching [a] tipping point” where shifts in consumption patterns give truly sustainable brands a real edge. But as they do every year, shoppers are expected to drop billions on new stuff this Friday, hunting down bargains with little care for sustainability credentials, making clear that the reality on the ground bears no resemblance to the sunny findings that populate consumer surveys. ADVERTISEMENT The following are five factors that explain the chasm between surveys and actual consumption. Poorly Constructed Surveys Consumer surveys are useful tools for surfacing basic information. For example, do you own a backpack? How old is your backpack? How much did you pay for your backpack? Questionnaires that seek to understand consumer motivations are far less helpful — people rarely give illuminating, or even truthful, answers to questions looking to understand why and how they shop. According to brand consultant and professor Mark Ritson, this is “partly because they will give you a false answer to impress you; partly because it depends on the other tradeoffs that they might have to make; partly because by question 42 you might as well be asking them in Klingon. But mostly because they simply don’t know the degree to which it influences them.” Intention vs Action In brief, people don’t do what they say. There is a clear intention versus action gap when it comes to consumer sustainability purchasing surveys. Indeed, according to Kantar, a global data insights and consultancy, 92 percent of people say they want to live a sustainable life, but only 16 percent are actively changing their behaviours in order to do so. When it comes to fast fashion, the intention versus action gap persists. More than half of the 46 percent of the British population who say that they avoid buying fast-fashion products bought something from a fast-fashion retailer last year. An Ill-Defined Concept Even for consumers who legitimately seek to align their purchasing with their intentions, buying “sustainably” can be next to impossible. After all, how would one determine what constitutes a “sustainable” shirt or pair of shoes? Is a product’s sustainability based on durability, wears per garment, water usage, carbon emissions or eutrophication? How should each of these factors be weighted? Is the data that underlies claims reliable? Just last year, the Norwegian Consumer Council sanctioned Norrøna and H&M for using the fashion industry’s most accepted assessment tool, the Higg Index, in their consumer communications, causing an industry kerfuffle. In turn, US, UK and EU government agencies are working to tighten regulations governing “green claims.” Even so, the underlying complexities (including industry reliance on a multi-tiered, global, shared, opaque supplier base) and tradeoffs inherent in fashion production conspire to make a simple definition of sustainable fashion elusive. ADVERTISEMENT Vested Interests The authors of surveys touting the ascension of sustainability have commercial interests that benefit from their findings. For example, between 2019 and 2020, Bain & Company completed over 500 consulting projects for clients that were focused on sustainability. They also own (or are equity holders in) a bevy of related sustainability service providers, including Persefoni (carbon accounting), Ecovadis (ratings), Sylvera (carbon offsets) and Jupiter (carbon risk analytics). New York University’s Stern Center for Sustainable Business receives some funding from corporations that promote sustainability or have their own sustainability practices. Like Bain, Deloitte has a sustainability consulting service and a growing practice focused on disclosure and reporting of environmental, social and governance data. A Flawed Premise Finally, the selling of sustainability has become so pervasive that the proposition itself often goes unquestioned. That is a mistake. How is it that buying ever more “sustainable” fashion products will ever result in a planet that is more sustainable? Where did we get the idea that “sustainable” practices such as resale or circularity will slow the purchases of new products, especially when brands are in the business of pushing new dopamine-induced satisfaction? Different from the declaration of the Deloitte consultants, I see evidence of tipping points related to planetary boundaries far more clearly than tipping points in consumer behaviour. Kenneth P. Pucker is a professor of practice at the Tufts Fletcher School. Ken worked at Timberland for 15 years and served as chief operating officer from 2000 to 2007.","filter_flag":1}
{"title":"Sustainability and Regulatory Pressures Continue to Drive New Crop Protection Products - Agribusiness Global","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL2Fncm9jaGVtaWNhbHMvc3VzdGFpbmFiaWxpdHktYW5kLXJlZ3VsYXRvcnktcHJlc3N1cmVzLWNvbnRpbnVlLXRvLWRyaXZlLW5ldy1jcm9wLXByb3RlY3Rpb24tcHJvZHVjdHMv0gGMAWh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vYWdyb2NoZW1pY2Fscy9zdXN0YWluYWJpbGl0eS1hbmQtcmVndWxhdG9yeS1wcmVzc3VyZXMtY29udGludWUtdG8tZHJpdmUtbmV3LWNyb3AtcHJvdGVjdGlvbi1wcm9kdWN0cy8_YW1w?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL2Fncm9jaGVtaWNhbHMvc3VzdGFpbmFiaWxpdHktYW5kLXJlZ3VsYXRvcnktcHJlc3N1cmVzLWNvbnRpbnVlLXRvLWRyaXZlLW5ldy1jcm9wLXByb3RlY3Rpb24tcHJvZHVjdHMv0gGMAWh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vYWdyb2NoZW1pY2Fscy9zdXN0YWluYWJpbGl0eS1hbmQtcmVndWxhdG9yeS1wcmVzc3VyZXMtY29udGludWUtdG8tZHJpdmUtbmV3LWNyb3AtcHJvdGVjdGlvbi1wcm9kdWN0cy8_YW1w?oc=5","id":"CBMiiAFodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL2Fncm9jaGVtaWNhbHMvc3VzdGFpbmFiaWxpdHktYW5kLXJlZ3VsYXRvcnktcHJlc3N1cmVzLWNvbnRpbnVlLXRvLWRyaXZlLW5ldy1jcm9wLXByb3RlY3Rpb24tcHJvZHVjdHMv0gGMAWh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vYWdyb2NoZW1pY2Fscy9zdXN0YWluYWJpbGl0eS1hbmQtcmVndWxhdG9yeS1wcmVzc3VyZXMtY29udGludWUtdG8tZHJpdmUtbmV3LWNyb3AtcHJvdGVjdGlvbi1wcm9kdWN0cy8_YW1w","guidislink":false,"published":"Tue, 28 Nov 2023 14:56:43 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=14, tm_min=56, tm_sec=43, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL2Fncm9jaGVtaWNhbHMvc3VzdGFpbmFiaWxpdHktYW5kLXJlZ3VsYXRvcnktcHJlc3N1cmVzLWNvbnRpbnVlLXRvLWRyaXZlLW5ldy1jcm9wLXByb3RlY3Rpb24tcHJvZHVjdHMv0gGMAWh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vYWdyb2NoZW1pY2Fscy9zdXN0YWluYWJpbGl0eS1hbmQtcmVndWxhdG9yeS1wcmVzc3VyZXMtY29udGludWUtdG8tZHJpdmUtbmV3LWNyb3AtcHJvdGVjdGlvbi1wcm9kdWN0cy8_YW1w?oc=5\" target=\"_blank\">Sustainability and Regulatory Pressures Continue to Drive New Crop Protection Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Agribusiness Global<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability and Regulatory Pressures Continue to Drive New Crop Protection Products - Agribusiness Global","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5hZ3JpYnVzaW5lc3NnbG9iYWwuY29tL2Fncm9jaGVtaWNhbHMvc3VzdGFpbmFiaWxpdHktYW5kLXJlZ3VsYXRvcnktcHJlc3N1cmVzLWNvbnRpbnVlLXRvLWRyaXZlLW5ldy1jcm9wLXByb3RlY3Rpb24tcHJvZHVjdHMv0gGMAWh0dHBzOi8vd3d3LmFncmlidXNpbmVzc2dsb2JhbC5jb20vYWdyb2NoZW1pY2Fscy9zdXN0YWluYWJpbGl0eS1hbmQtcmVndWxhdG9yeS1wcmVzc3VyZXMtY29udGludWUtdG8tZHJpdmUtbmV3LWNyb3AtcHJvdGVjdGlvbi1wcm9kdWN0cy8_YW1w?oc=5\" target=\"_blank\">Sustainability and Regulatory Pressures Continue to Drive New Crop Protection Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Agribusiness Global<\/font>","source.href":"https:\/\/www.agribusinessglobal.com","source.title":"Agribusiness Global","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Sustainability and Regulatory Pressures Continue to Drive New Crop Protection Products The crop protection industry is facing challenges such as climate change, an aging workforce, limited arable land, and the public’s demand for transparency and sustainable food, according to an article in AgriBusiness Global DIRECT. Traditional pesticides are under threat due to increasing scrutiny from consumers and governments, leading to the development of safer solutions. However, the industry is also facing regulatory uncertainty and a decline in political influence. Opposition groups are pitting environmental regulations against the introduction of new products, posing a threat to the industry. The Endangered Species Act and regulatory bottlenecks are also concerns for U.S. agriculture, particularly for small and medium-sized farms. Attacks on agchem undermine the industry’s financial foundation for reinvestment. Advertisement Despite these challenges, the industry recognizes the value of chemical inputs in agricultural productivity. Companies are investing in new-generation active ingredients with favorable regulatory profiles and developing digital systems for targeted application of chemicals. Manufacturers are adjusting their strategies to accommodate evolving attitudes and regulatory environments, focusing on more sustainable and eco-friendly solutions. Research and development efforts are shifting to China, with the country becoming a major player in bringing new molecules to market. However, shifting regulatory rules and requirements could limit the availability of these solutions outside of China. The industry acknowledges the need for a more sustainable approach to agriculture and is investing in R&D to develop innovative solutions. Collaboration between academia and the industry is crucial for the transformation towards sustainable agriculture. Compliance with regulations is a global issue, and manufacturers must navigate the laws of different countries and regions. Agricultural retailers can benefit from this by having a field-by-field knowledge of each customer’s restrictions and advising them on appropriate products and mitigation measures. Despite the challenges, there is optimism that the industry can feed a growing population while protecting species, improving water quality and soil health, and addressing climate concerns. The industry believes in the potential for another green revolution that produces more on fewer acres. Read more at AgriBusiness Global DIRECT.","filter_flag":1}
{"title":"New York solar installation exemplifies Medline's commitment to sustainability in construction, operations - Medline Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL25ld3Nyb29tLm1lZGxpbmUuY29tL3NvY2lhbC1yZXNwb25zaWJpbGl0eS9uZXcteW9yay1zb2xhci1pbnN0YWxsYXRpb24tZXhlbXBsaWZpZXMtbWVkbGluZXMtY29tbWl0bWVudC10by1zdXN0YWluYWJpbGl0eS1pbi1vcGVyYXRpb25zLWNvbnN0cnVjdGlvbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL25ld3Nyb29tLm1lZGxpbmUuY29tL3NvY2lhbC1yZXNwb25zaWJpbGl0eS9uZXcteW9yay1zb2xhci1pbnN0YWxsYXRpb24tZXhlbXBsaWZpZXMtbWVkbGluZXMtY29tbWl0bWVudC10by1zdXN0YWluYWJpbGl0eS1pbi1vcGVyYXRpb25zLWNvbnN0cnVjdGlvbi_SAQA?oc=5","id":"CBMinAFodHRwczovL25ld3Nyb29tLm1lZGxpbmUuY29tL3NvY2lhbC1yZXNwb25zaWJpbGl0eS9uZXcteW9yay1zb2xhci1pbnN0YWxsYXRpb24tZXhlbXBsaWZpZXMtbWVkbGluZXMtY29tbWl0bWVudC10by1zdXN0YWluYWJpbGl0eS1pbi1vcGVyYXRpb25zLWNvbnN0cnVjdGlvbi_SAQA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL25ld3Nyb29tLm1lZGxpbmUuY29tL3NvY2lhbC1yZXNwb25zaWJpbGl0eS9uZXcteW9yay1zb2xhci1pbnN0YWxsYXRpb24tZXhlbXBsaWZpZXMtbWVkbGluZXMtY29tbWl0bWVudC10by1zdXN0YWluYWJpbGl0eS1pbi1vcGVyYXRpb25zLWNvbnN0cnVjdGlvbi_SAQA?oc=5\" target=\"_blank\">New York solar installation exemplifies Medline's commitment to sustainability in construction, operations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medline Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New York solar installation exemplifies Medline's commitment to sustainability in construction, operations - Medline Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL25ld3Nyb29tLm1lZGxpbmUuY29tL3NvY2lhbC1yZXNwb25zaWJpbGl0eS9uZXcteW9yay1zb2xhci1pbnN0YWxsYXRpb24tZXhlbXBsaWZpZXMtbWVkbGluZXMtY29tbWl0bWVudC10by1zdXN0YWluYWJpbGl0eS1pbi1vcGVyYXRpb25zLWNvbnN0cnVjdGlvbi_SAQA?oc=5\" target=\"_blank\">New York solar installation exemplifies Medline's commitment to sustainability in construction, operations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medline Newsroom<\/font>","source.href":"https:\/\/newsroom.medline.com","source.title":"Medline Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"There are millions of reasons to celebrate the completion of Medline’s 7.3 megawatt community solar installation atop the company’s Montgomery, New York distribution center this summer. Most notably, the installation is expected to generate over 8.5 million kilowatt hours of clean power annually for the community power grid serving the Montgomery distribution center and neighboring Mid-Hudson communities—enough energy to power 1,600 homes while reducing carbon emissions by nearly 6,000 metric tons, the equivalent of taking more than 1,200 cars off the road, according to the New York State Energy Research and Development Authority (NYSERDA). The largest rooftop solar project in New York “This installation is the largest rooftop solar project in New York,” said David Sandbank, NYSERDA vice president of distributed energy resources & transportation, during a recent ribbon-cutting event. The agency provided $3 million toward the $8 million project.1 “This project provides so many benefits, not only to Medline, but to the utility territory as well,” said Sandbank. “Putting solar panels on a rooftop such as Medline’s, especially of this size, is reducing the need for power in an area that really needs that reduction, especially in times where there’s a peak load demand. So kudos to Medline for doing this.”","filter_flag":1}
{"title":"Crocs is taking its used shoes back in 10 states. Here's why - GreenBiz","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5\" target=\"_blank\">Crocs is taking its used shoes back in 10 states. Here's why<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Crocs is taking its used shoes back in 10 states. Here's why - GreenBiz","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2Nyb2NzLXRha2luZy1pdHMtdXNlZC1zaG9lcy1iYWNrLTEwLXN0YXRlcy1oZXJlcy13aHnSAQA?oc=5\" target=\"_blank\">Crocs is taking its used shoes back in 10 states. Here's why<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","source.href":"https:\/\/www.greenbiz.com","source.title":"GreenBiz","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Crocs launched a program in October to take back used shoes in 10 U.S. states, to keep old footwear out of landfills and explore new ways to reuse the material. It’s a big opportunity. An estimated 22 billion pairs of shoes are thrown out annually while roughly the same number are produced, according to industry stats. The fashion and apparel sector contributes about 8 percent of greenhouse gas emissions each year, according to the United Nations. Crocs announced a series of sustainability goals in 2021, but quietly delayed its plan to reach net zero by a decade to 2040 after the company reported a big increase in emissions between 2021 and 2022. Deanna Bratter, vice president and global head of sustainability for the Broomfield, Colorado-based company, said circular design and production principles are core to delivering on that commitment. \"When you think about the circular economy, sometimes people just think about waste and doing something with waste,\" Bratter said. \"But when we think about the concept of creating a circular economy, it requires a variety of solutions, a lot of creativity.\" Three things will help Crocs deliver, she said: Design changes that enable products to be used for longer. Considering the need for future deconstruction and recyclability. Finding sources for renewable inputs. From ‘gently used’ to ‘unwearable’ Crocs’ new collection program will produce metrics to help it better understand the social and operational challenges it faces, Bratter said. Rather than randomly assigning takeback locations on a nationwide basis, it picked states that represent a cross-section of attitudes about climate change: Colorado, Georgia, Illinois, Michigan, Massachusetts, Minnesota, Ohio, Pennsylvania, Virginia and Wisconsin. Retail locations in those states, about 50 in total, will include collection bins to make it simpler for consumers to drop off products. Crocs will accept shoes in any condition. \"Gently used\" ones will be donated to Soles4Souls, a nonprofit that works with entrepreneurs building secondhand apparel businesses. Those that are \"well-loved\" or \"unwearable\" will head back to Crocs, where product designers will experiment with ways to reuse the materials, Bratter said. Here are some questions Crocs hopes to answer with its collection program: Who is returning shoes? What marketing messages are working? Are consumers donating because of the social or environmental impact? What types of shoes are most commonly returned and how old are they? Do gently used or well-loved shoes dominate the bins? The goal is to expand nationally, Bratter said. Crocs chose the U.S. as its first foray into product take-back because it can transport them to other locations for processing more easily. What’s inside Crocs’ clogs The predominant material in Crocs’ clogs — more than 81 percent — is Croslite, a proprietary resin designed for durability and sourced predominantly from fossil fuels. Croslite is responsible for 35-40 percent of Crocs’ emissions, its largest single source, Bratter said. Crocs has committed to sourcing 50 percent of its Croslite from bio-based options by 2030. The two most prominent alternative sources are tall oil, a byproduct from paper mills, and used cooking oil. In 2022, only 2.2 percent of Croslite came from non-fossil sources, but Crocs is on track to meet 20 percent by the end of 2023, Bratter said. Crocs is also increasing its use of recycled material. The company uses manufacturing scraps in 6.5 percent of its Croslite, according to the company’s 2022 ESG report. It’s possible that unwearable shoes collected by Crocs could be ground down and used in future products, increasing that amount, Bratter said, but it hasn’t publicly set goals for how many of them will be converted. Baby steps rather than a big leap The entire footwear sector is under pressure to cut waste and reduce emissions, according to Paul Foulkes-Arellano, founder of Circuthon Consulting and co-author of a book about materials and sustainability. While he praised Crocs’ decision to partner with \"well-respected\" Soles4Souls, he characterized the footwear company’s overall circular economy strategy as nascent and said it’s “notoriously difficult” to make takeback programs work at scale. One advantage Crocs will have as it transitions is the makeup of Croslite. \"It’s principally a monomaterial, so once the few extra components are removed, it can be reground as material for new shoes,\" he said. Recycling a material that includes both fossil fuels- and plant-based resins is more difficult, he said. Other shoemakers are striving for higher percentages of reused material on a shorter timeline, Foulkes-Arellano said. \"The footwear industry is way behind the textiles industry in its understanding of environmental impacts.\"","filter_flag":1}
{"title":"FEATURE: Sustainability Drive - interior design - Business Jet Interiors","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5\" target=\"_blank\">FEATURE: Sustainability Drive - interior design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Jet Interiors<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"FEATURE: Sustainability Drive - interior design - Business Jet Interiors","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5\" target=\"_blank\">FEATURE: Sustainability Drive - interior design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Jet Interiors<\/font>","source.href":"https:\/\/www.businessjetinteriorsinternational.com","source.title":"Business Jet Interiors","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Representatives of aircraft OEM s and interior design firms discuss strategies for sustainability Anne Farken, associate director, sustainability and creative consulting, Designworks, a BMW Group Company Is sustainable design of growing interest to the market? GenZ can see through greenwashing quickly and expects companies to treat them as equals. Brands that really contribute to society and environment will make a deep connection to the next generation. What factors matter when trying to make sustainable choices? Designers need to think about environmental and social responsibility in terms of raw materials, production, transportation, product use, disposal and recycling. This will lead to the adoption of new business models that measure success in new ways. Should the industry improve how sustainability is talked about? A lot of the terminology has no standard definition – but I’m happy to share my understanding. ‘Eco-design’ considers environmental factors in design, while ‘sustainable design’ also includes social aspects. ‘Circular design’ aims to reduce waste and enhance resource efficiency, often utilising strategies like ‘product as a service’ and emphasising reparability and maintenance. ‘Regenerative design’ goes further, considering cultural and societal factors, actively contributing to the regeneration of eco-systems and communities. Words like ‘sustainability’ and ‘innovation’ have become vague buzzwords. At Designworks, we address sustainability in very specific terms at the start of every project. Together with our partners, we define the purpose of the project, formulate measurable goals and reflect on the questions we want to answer. We call this ‘design for intention’. How can companies best integrate sustainability into their culture? Firstly, by embracing that profitability and sustainability are not mutually exclusive. New key performance indicators (KPIs) are evolving to reflect this synergy. Secondly, it’s not enough to make sustainability an agenda item. Integrating external partners and nurturing cross-functional teams enhances the potential for fresh perspectives in future-proofed solutions. It’s equally vital to embed these changes in underlying structures. Thirdly, accept that change is positive! We’re transitioning from an industrial to a knowledge society, where creativity is pivotal for progress. Leveraging designers’ intuition and their expertise in utilising complexity, even within the realm of business strategy, is crucial for driving the transformation towards a future we all want to live in. Jay Beever, VP, Embraer Design Operations How have your design ideas progressed since the Praeterra concept? We’ve introduced sustainable recycled and upcycled materials into our new product development pipeline, so down the line we could have sustainability collections that people can pull from. For example, we’re looking at 3D-printing titanium for interior trim components, using leftover material from the production process in Brazil. I have sample parts in my office of our Phenom cupholder area, 3D-printed in titanium with a beautiful bead-blasted satin finish. It’s not plated, it’s made from scrap titanium dust. Praeterra had the Mokume-gane, made from folded-up metals, created into a billet. It didn’t need to be plated, because the grain work was the beauty. What new innovations have caught your eye? For instance, at EBACE I met with Paolo Foglizzo of Foglizzo Leather, which takes scrap leather, mixes it into a fibre mush, and creates a new leather sheet material, a composite with 15% polyester. I looked at it, smelled it; it’s leather. I’m absolutely thrilled with it. There’s limitations on colour right now, but that’ll expand. Suppliers are also sourcing hides from farms that raise cattle for food, which would otherwise be thrown away. And they can pick cattle that have been fed seaweed. Including seaweed in feed reduces a cow’s methane output dramatically. There’s a long chain of detail that goes into a material’s carbon footprint. Natalie Rodríguez, principal, Natalie Rodríguez Luxury Design Is sustainable design of growing interest to clients? There’s definitely been an increase in demand over the last few years. On a recent project the client took great interest in the undyed\/natural heather dye carpets Kalogridis unveiled at NBAA-BACE 2022. This customer also didn’t want to use materials with PFA substances – synthetic chemicals resistant to heat, grease, oil and water, and also resistant to degradation in the environment. We double checked with suppliers that PFAs weren’t used in the production of their materials or FR treatments. What factors matter when trying to make sustainable choices? My favourite factors to consider are positive environmental impact as well as anything that isn’t artificial, but rather, naturally sourced. Customers are also a driving factor – some requests might include all natural, plant-based materials, without any plastics or animal by-products, while some request to have seat leather, but to make sure everything is sustainably sourced and produced responsibly. What are the challenges to overcome to make more progress? There might be more hesitation to incorporate new ideas and products that are sustainable simply because they haven’t been used many times before. There might be questions regarding how long certain materials will hold up over time, and how colours from naturally sourced products really turn out in production since there is less control in colour variances or lack of a dye lot. What other solutions would you like to see developed by suppliers? I’m loving the direction suppliers are currently moving in – utilising resources found in our natural environment through new plant-based and recyclable materials, as well as natural dyes for colour. It would be wonderful to see more suppliers come out with their own sustainability lines to provide a variety of options. There are many beautiful sustainable materials that have been developed in other industries that would be great to use in aviation applications. It would be wonderful for suppliers to invest in having any new and innovative materials tested for applicable burn and\/or sliding friction and have the information readily available on the label and their website catalogue. This way aviation interior designers can select their materials with the utmost assurance. This would especially be applicable to suppliers looking to break into aviation, as those that are already in the industry are more likely to test\/certify anything new prior to offering these to designers. Tray Crow, director, interior design, Gulfstream Is sustainable design of growing interest to clients? Yes – certainly more so now than perhaps 10 years ago. It’s part of how we operate. The new galley on the G700 has a dual-zone trash compartment for example. That’s something we added so that flight attendants can separate recyclables to waste. Even in building aircraft, it’s always been about efficiency, and how we provide more for less. What are some of your sustainability efforts when it comes to materials? With our seat leather, all our patterns for the seats are digitised now. Everything’s cut on a Gerber cutter so we maximise the use of every hide. Specifying leather on high-wear surfaces is important because it’s a durable material – it lasts five times longer than most soft goods. Leather is a by-product of the meat industry and we’re diverting that from landfill. Any waste that we do have is donated either to charities or schools. Some of our waste leather has been turned into soccer balls for schools and communities in need. Everything that goes into our carpet is natural, down to the latex backing and the jute structure that provides the canvas. The tufting is either silk or wool, both rapidly renewable resources. One of our suppliers carries the Greenguard certification, so that’s available to our customers as well. About 40% of the veneer we specify is composite veneer that comes from rapidly renewable resources. Veneer maximises yield anyway, because it consists of thin sheets applied to a substrate. We also focus on lightweight elements such as honeycomb materials. How would you like to see the wider industry respond? Innovation is a shared responsibility for the whole industry. With our suppliers, how they’re bringing new products to market, and working on sustainability within their own processes – bringing that to the forefront is important. Judy Miller, allied ASID, Judy Miller Interior Design Is sustainable design of growing interest to clients? Wellness continues to be of interest to clients and the A&D industry, driving vendors to go green. Should the industry improve how sustainability information is presented? OEMs would benefit by being more transparent with their sustainable initiatives and practices in their advertising. They could promote how they benefit customer wellness and are lowering their environmental impact. Sustainable alternative fuel efforts are great, but there’s so much about interiors that could be shared as well. Are there any sustainability-focused ideas that have caught your eye recently? I’ve been very impressed with soft goods suppliers moving more and more into sustainable products. Tapis is a standout. How else might the industry make progress? I’d like to see OEMs and refurbishment centres using more sustainable\/green substrates, foams and adhesives, as well as water-based paints for interior and exterior paint applications. I’d also like to see materials recycled whenever possible when removed from aircraft interiors, especially in refurbishments, much like how clients are recycling kitchen appliances, and donating kitchen cabinets and furniture to places such as Habitat for Humanity ReStore. Sylvain Mariat, head of creative design and concepts, Airbus Corporate Jets Was sustainability a design factor for the first ACJ TwoTwenty completion? Yes certainly; at the beginning of the project, we agreed that most of the material suppliers would be located not far away from Comlux’s completion facility in Indianapolis, USA, to minimise carbon footprint. We have also focused on the origin of the wood veneer used for the interior fittings and we decided to use wood with the Forest Stewardship Council (FSC) label. In what other ways have you addressed sustainability? It’s not new for us to address sustainability with materials. For example, we work with a French partner on a solvent-free paint that we propose to our customers. We can also talk about leather. We recommend vegetable tanning to our customers instead of chemical tanning. For carpets we use wool and silk – natural materials rather than synthetic materials. Beyond the materials used, we encourage our suppliers to propose cabin designs with optimised weight, mainly through design conception or the use of innovative lightweight composite. How do you design a cabin to have a long life? A sustainable cabin means also designing to avoid having to replace large parts to perform small repairs. For example, we make partitions from a combination of parts so that if there is a scratch, we only need to remove and repair one small part. I also like using paint on cabinetry because it can contribute to saving weight; it is easier to maintain; and to extend the component’s life. How important is recyclability? Our approach to environmental responsibility doesn’t end at the design stage. During manufacturing, after delivery and even at the end of an aircraft’s service life, we continue to search for ways to reduce the environmental footprint of our aircraft. Airbus and Tarmac Aerosave have established a proven method for decommissioning, dismantling and recycling the entire Airbus aircraft product range in an environmentally responsible way. We are able to recycle more than 90% of an aircraft. Mindy Huang, sales engineering, Bombardier Is there a lot of interest in sustainability from clients? A lot. Sustainability is a huge movement. A lot of clients think it important to reduce their footprint, so we have a whole catalogue of options and take a scientific approach to studying CO 2 impact and water scarcity. An example is Eucalyptus veneer. Eucalyptus grows very fast and doesn’t need to be uprooted to harvest; you can cut it at the trunk and it’ll regrow. It’s a very sustainable material. What is the aim with your environmental product declarations (EPDs)? We have a sustainability team that produces the EPDs. That studies every single part that goes on an aircraft, so we’re very transparent about the impact of the product’s lifecycle on the environment. The scientific assessment that underpins the EPD helps Bombardier to optimise the design of its products according to sustainable criteria. Is there anything else you wanted to share? Bombardier’s ESG plan includes a commitment to invest over 50% of our R&D towards greener aircraft by 2025. This feature was first published in the September\/October 2023 edition of Business Jet Interiors International.","filter_flag":1}
{"title":"Artificial intelligence-driven scalability and its impact on the sustainability and valuation of traditional firms | Humanities ... - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjIxNC040gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjIxNC040gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjIxNC040gEA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjIxNC040gEA?oc=5\" target=\"_blank\">Artificial intelligence-driven scalability and its impact on the sustainability and valuation of traditional firms | Humanities ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Artificial intelligence-driven scalability and its impact on the sustainability and valuation of traditional firms | Humanities ... - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk5LTAyMy0wMjIxNC040gEA?oc=5\" target=\"_blank\">Artificial intelligence-driven scalability and its impact on the sustainability and valuation of traditional firms | Humanities ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The results are consistent with the research question and the model illustrated in the section “The model”. Section “From standard to AI-driven business planning: a sensitivity simulation” contains a sensitivity simulation, incorporating the impact on a hypothetical business plan of AI adoption. Section “A with-or-without simulation using network theory” is dedicated to a network theory without-or-with simulation that examines the same issues from a complementary side, showing how AI can increase the number of nodes and the intensity (internet traffic, monetary transactions, and, consequently, improved EBITDA) within the ecosystem. From standard to AI-driven business planning: a sensitivity simulation This empirical setting provides a theoretical background of the main accounting and financial indicators underlying sustainability issues and the interrelations among stakeholders, along with the potential impact of AI-driven savings. The AI-driven sensitivity analysis shows the potential effect of savings on the life-long parameters of the investment, consistently with the “without or with (AI-driven) approach” illustrated in the comparison between Figs. 3 and 4, and indicated in the methods. Fig. 3: Discounted cash flows ignited by AI. Effect of AI-driven sales and AI-reduced OPEX on Operating Cash Flows (OCF). Full size image Fig. 4: Standard procurement\/supply chain. Relationships in a supply chain with traditional firms. Full size image The income statement is a fundamental financial statement that serves as the “engine” behind profitability considerations and plays a crucial role in determining the overall financial health and sustainability of a company. The hypothetical impact on operating revenues and costs is the following: 1. A scenario with +10% revenues\/−10% costs; 2. A scenario with +5% revenues\/−5% costs. When conducting sensitivity analysis to estimate the impact of AI on financial performance, it is indeed reasonable to consider the potential repercussions on revenues and operating costs. The sensitivity analysis allows for the assessment of the potential variability in these factors, considering the potential benefits of AI integration. 1. Revenue increase: AI can enhance revenue generation through various means, such as improved customer targeting, personalized recommendations, or enhanced sales effectiveness. By leveraging AI technologies, companies can optimize their pricing strategies, identify new revenue streams, or develop innovative products or services. Sensitivity analysis considers the potential increase in revenues resulting from AI-driven improvements. 2. Operating cost decrease (OpEx): AI can bring cost-saving opportunities through automation, process optimization, and resource allocation efficiencies. By streamlining operations and reducing manual efforts, companies can potentially lower their operating costs. Sensitivity analysis considers the potential decrease in operating costs resulting from AI adoption, leading to improved profitability. The combined effect of revenue increase and operating cost decrease has a positive impact on financial and economic margins. It enhances the company’s financial performance, profitability, and value-creation potential. Sensitivity analysis helps estimate the magnitude of these improvements, allowing decision-makers to evaluate the potential benefits of AI integration and make informed choices. Unfortunately, this variability in revenues and costs is not still backed by empirical evidence and this justifies the use of sensitivity analysis. This idea is reinforced by taking into account that the use of bundled intangibles may cause about 10% variations both in higher revenues and lower costs. Empirical evidence shows that AI leads to EBIT or EBITDA improvements, because of both revenue increases and cost-cutting. According to McKinsey and Company (2022), “at least 5 percent of their organizations’ EBIT was attributable to AI in 2021, in line with findings from the previous two years”. The impact of AI on depreciation\/amortization is presumably small, and so is EBIT ≈ EBITDA. Other sources show similar results (Pifer, 2023; Pipeline, 2023; Appen, 2022; Oberlo, 2022; Statista, 2023; Zhang et al., 2021; Human-Centered Artificial Intelligence, 2022). This impact somewhat underestimates the long-term effect of AI (capacity to self-ignite virtuous processes) that can be dealt with as a “real option” to expand the business, with already undertaken investments. Real options analysis is a framework that is consistent with the concept of Net Present Value of Growth Opportunities (NPVGO). NPVGO is a calculation used to estimate the net present value per share of all future cash flows associated with growth opportunities, including new projects or potential acquisitions. NPVGO is typically fueled by innovative intangibles with hidden and still underexploited potential, such as AI. A sensitivity simulation applied to an ideal client—a company purchasing AI products—shows which is the impact on the economic and financial metrics and the corporate valuation of an increase in revenues (and decrease in OPEX). This case represents a basic simulation of the impact of adopting AI. The comparison of a simple network without AI with a smart AI-driven network including new nodes aligns with the “with or without” differential approach commonly used to estimate the value of intangibles. By applying the “with or without” differential approach and comparing the straightforward network without AI to the smart platform-driven network with AI integration, it is possible to quantitatively assess the impact on financial performance, value creation, and overall sustainability. This approach aligns with the traditional methodology used to estimate the value of intangibles and demonstrates the potential benefits of AI integration within the analyzed context, as illustrated in the International Valuation Standard 210 (par. 80.1). This empirical setting is fully compliant with the research question, a theoretical story that illustrates the main accounting and financial indicators associated with AI adoption, as well as the interrelations among stakeholders. Additionally, it highlights the sensitivity analysis to evaluate the impact of AI adoption on investment parameters by using the “without or with AI adoption” approach. The income statement of the AI-adopting company is the “engine” behind any profitability consideration. When a company adopts AI technologies, the resulting increase in revenues or decrease in operating expenses (OPEX) can significantly improve its financial and economic margins, as represented by EBITDA. These improvements have a positive impact on value creation. A brief comparison is illustrated in Table 4 where a sensitivity analysis applied to the base case, 5, and 10% growth in operating revenues (and a corresponding reduction in operating costs, mostly monetary OpEx) is reported in each column. Table 4 The adjacency matrix of a standard 3 × 3 network. Full size table The first column shows the base case of a standardized company that consequently adopts AI solutions, with increasing economic marginality. A with-or-without simulation using network theory Network theory analyzes the relationships, whether symmetric or asymmetric, between discrete objects through the representation of graphs. In this context, a network is typically defined as a graph where the edges and\/or nodes (vertices) possess attributes such as names or other characteristics. A network is said to be interdependent if it consists of a system of coupled networks where the nodes in one network depend on the vertices in the other networks. This interdependence is a key characteristic of complex ecosystems and can provide an innovative perspective on the interactions among different stakeholders. The impact of AI on the business model scalability can be explained in a complementary way, considering how AI can create additional nodes within a networked ecosystem, and how these nodes increase their connections, mainly in the form of digitized Internet traffic that hosts big data (AI-enhanced information) and monetary transactions. An example can be given by eCommerce digital platforms that exploit AI to reach new clients, with new transactions. AI impacts business value (Enholm et al., 2022) with technological and organizational enablers that use automation and augmentation to produce: First-order effects (process efficiency, improved productivity, greater precision and reduction of human errors, decision quality, organizational agility, structural redesign, process reengineering, etc.); Second-order effects (operational performance with new and enhanced products and services; higher economic\/financial growth and profitability, market-based performance with customer satisfaction, etc.). New and enhanced products and services represent a cornerstone of AI that can be explained through network theory, where new products are represented by additional nodes and their enhancement by stronger links. Multilayer networks explain dynamic networks’ intertemporal nature that evolve, incorporating AI growth factors. Temporal networks embed dynamic AI features—AI is an incremental and self-learning process that could ideally produce real options, incorporating free-of-charge expansion possibilities. Scalability can be interpreted with network theory applications, bridging physical nodes with their digital twins. Path-dependent upgrades, ignited by AI and machine learning applications, are dynamically consistent with intertemporal multilayer networks. As anticipated, AI is a forward-looking technology, fully consistent with the intertemporal nature of multilayer networks, where each “screenshot” represents an instant, dynamically linked to the following one. Multilayer networks are a type of network that involves multiple kinds of relations with multiplex or multidimensional configurations. In a multiplex network, the same set of nodes is connected through more than one type of link, leading to enhanced scalability and richer representation of relationships (Bianconi, 2018). 1. Multilayer networks go beyond the traditional network framework by incorporating multiple layers or dimensions of connectivity. They provide a more nuanced representation of relationships by capturing various types of relations, such as multiplex, multilayer, multilevel, and multi-relational connections. This extension allows for a more accurate and comprehensive understanding of real-world systems and their interdependencies. 2. Scalability features and bridging nodes: Multilayer networks are intrinsically fit for leveraging the scalability features previously examined. They can accommodate bridging or replica nodes that exist in multiple layers simultaneously. These bridging nodes facilitate connections and interactions across different layers, enabling the study of interlayer dependencies and the flow of information, resources, or influence between layers. This capability enhances the scalability and flexibility of the network representation. 3. Complex multidimensional networks: Multilayer networks, as a type of complex multidimensional network, offer valuable insights across various interdisciplinary fields. Their ability to capture multiple kinds of relations and interdependencies is particularly useful in understanding complex systems and phenomena. Whether analyzing social networks, biological networks, transportation networks, or economic networks, the multidimensional nature of multilayer networks can provide deeper insights into the dynamics, structure, and emergent properties of these systems. 4. Interdisciplinary insight: Multilayer networks serve as a valuable tool for interdisciplinary research. Their application can span diverse fields, including sociology, biology, physics, computer science, economics, and more. By incorporating multiple kinds of relations and interdependencies, multilayer networks enable researchers to study complex phenomena from a holistic perspective. They provide a common language and framework for analyzing and understanding the intricate relationships among elements within complex systems. Figures 4 and 5 back the “without-with” comparison, showing—with a simplified ecosystem’s wiring diagram—a standard company, and, respectively, an AI-driven network. Fig. 5: AI-driven procurement\/supply chain. Relationships in a supply chain with traditional and AI-driven firms. Full size image Network theory can contribute to explaining the nature of AI-driven scalability. AI adds incremental nodes to the existing ecosystem and improves the interrelation between pre-existing and new nodes. The model compares a “without” versus “with” scenario, consistent with the IVS 210 evaluation criteria for intangible assets, where a network without AI is compared with the same network when it incorporates AI-driven additional nodes and links (edges). This comparison allows us to sort out the incremental income (and cash flows) derived from the introduction of AI in the model. The model can be further extended in a dynamic—multilayer—dimension, where AI ignites self-driven growth. Figure 4 is described by the following points: 1. Invoicing to “traditional” clients; 2. Invoicing from “traditional” suppliers. Figure 5 is described by the following points: 1. Impact of AI on the target company; 2. Invoicing to “traditional” clients; 3. Interaction between “traditional” and AI-driven clients; 4. Interaction between AI and “traditional” clients (that become “augmented” or digitized); 5. AI creates new clients, increasing its revenues; 6. Interaction between the company and its “traditional” suppliers; 7. AI creates new suppliers; 8. The company interacts with AI-driven suppliers (cutting its OPEX); 9. AI interacts with “traditional” suppliers. The comparison of Figs. 4 and 5 shows that AI acts as a bridging (intermediating) hub which increases the number of nodes (vertices) and, consequently, the overall value and consistency of the network, but especially the quality and quantity of links. The value added to Fig. 5 (compared to Fig. 4) can be interpreted through the network theory analysis (Barabási, 2016). Network analysis involves measuring the degree of nodes, which refers to the number of links or connections a node has with other nodes in a network. The degree of a node provides insights into its connectivity and prominence within the network. This process is shown in Tables 4 and 5. In a digital ecosystem, where AI produces its effects, information produces valuable small data that, combined, become “big”. Even transactions, using fiat money or cryptocurrencies, convey useful financial information, making the AI-enhanced ecosystem financially sustainable. Table 5 The adjacency matrix of a digitized 6 × 6 network. Full size table The real finite network exemplified in Fig. 5 (or even 4) is a complex system. Interconnectivity can become vulnerable as any “blackout” may give rise to severe problems for the whole ecosystem. The links of Fig. 5 (numbered from 1 to 9) are bi-directional, therefore increasing the potential flow of data and transactions. In network theory, the relations among nodes in a network are commonly illustrated by using an adjacency matrix, represented by a square matrix that provides a concise representation of the connections or edges between nodes in a finite graph as in Figs. 4 or 5. The adjacency matrix represents a graph as the elements of the matrix indicate whether a pair of nodes are adjacent or not. Thus, the adjacency matrix is a symmetric and (0,1)-matrix with zeros on its diagonal as each node is not linked to itself. The degree of each node illustrates the number of links with other nodes and is mathematically expressed with a symmetric adjacency matrix that is Table 4 Fig. 4 (with 3 nodes) and Table 5 for Fig. 5 (6 nodes). Metcalfe’s Law is often used to estimate the value or impact of a network by taking into account the number of connected users or nodes within the system. The law states that the value of a network is proportional to the square of the number of users (n2). Thus, network Figure 4 = 9, and network Figure 5 = 36 where, for the sake of simplicity, we have assumed that the links in both networks are equally weighted. This underrates the effective value of the links since AI improves the edging intensity between any two linked nodes. The digital platform driven by AI has the potential to revolutionize network connectivity and efficiency. It minimizes paths and distances, operates continuously, and increases network connectedness. By leveraging AI algorithms, the platform optimizes resource utilization and enables scalability and flexibility. These advancements facilitate seamless interactions, enhance value-creation opportunities, and improve overall network performance. The platform minimizes the number of links among the other nodes and increases the network connectedness. For instance, it creates additional paths between disconnected nodes like banks and sub-contractors which are connected through the platform in Fig. 5 but not in Fig. 4). The mathematical analysis and comparison between the AI-mastered network and the original simple network can demonstrate the superior performance of the AI network. The advancements brought by the digital platform, coupled with AI capabilities, have the potential to enhance network robustness and resilience. The specific impact on bankability may depend on various contextual factors, industry dynamics, and the specific implementation of the AI-driven network. Nonetheless, the enhanced network performance and resilience offered by the digital platform and AI technologies provide a strong basis for positive effects on bankability.","filter_flag":1}
{"title":"Consumers say their environmental concerns are increasing due to extreme weather; study shows they're willing to ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NvbnN1bWVycy1zYXktdGhlaXItZW52aXJvbm1lbnRhbC1jb25jZXJucy1hcmUtaW5jcmVhc2luZy1kdWUtdG8tZXh0cmVtZS13ZWF0aGVyLXN0dWR5LXNob3dzLXRoZXlyZS13aWxsaW5nLXRvLWNoYW5nZS1iZWhhdmlvci1wYXktMTItbW9yZS1mb3Itc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxOTg1MjMzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NvbnN1bWVycy1zYXktdGhlaXItZW52aXJvbm1lbnRhbC1jb25jZXJucy1hcmUtaW5jcmVhc2luZy1kdWUtdG8tZXh0cmVtZS13ZWF0aGVyLXN0dWR5LXNob3dzLXRoZXlyZS13aWxsaW5nLXRvLWNoYW5nZS1iZWhhdmlvci1wYXktMTItbW9yZS1mb3Itc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxOTg1MjMzLmh0bWzSAQA?oc=5","id":"CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NvbnN1bWVycy1zYXktdGhlaXItZW52aXJvbm1lbnRhbC1jb25jZXJucy1hcmUtaW5jcmVhc2luZy1kdWUtdG8tZXh0cmVtZS13ZWF0aGVyLXN0dWR5LXNob3dzLXRoZXlyZS13aWxsaW5nLXRvLWNoYW5nZS1iZWhhdmlvci1wYXktMTItbW9yZS1mb3Itc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxOTg1MjMzLmh0bWzSAQA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NvbnN1bWVycy1zYXktdGhlaXItZW52aXJvbm1lbnRhbC1jb25jZXJucy1hcmUtaW5jcmVhc2luZy1kdWUtdG8tZXh0cmVtZS13ZWF0aGVyLXN0dWR5LXNob3dzLXRoZXlyZS13aWxsaW5nLXRvLWNoYW5nZS1iZWhhdmlvci1wYXktMTItbW9yZS1mb3Itc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxOTg1MjMzLmh0bWzSAQA?oc=5\" target=\"_blank\">Consumers say their environmental concerns are increasing due to extreme weather; study shows they're willing to ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Consumers say their environmental concerns are increasing due to extreme weather; study shows they're willing to ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NvbnN1bWVycy1zYXktdGhlaXItZW52aXJvbm1lbnRhbC1jb25jZXJucy1hcmUtaW5jcmVhc2luZy1kdWUtdG8tZXh0cmVtZS13ZWF0aGVyLXN0dWR5LXNob3dzLXRoZXlyZS13aWxsaW5nLXRvLWNoYW5nZS1iZWhhdmlvci1wYXktMTItbW9yZS1mb3Itc3VzdGFpbmFibGUtcHJvZHVjdHMtMzAxOTg1MjMzLmh0bWzSAQA?oc=5\" target=\"_blank\">Consumers say their environmental concerns are increasing due to extreme weather; study shows they're willing to ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Bain & Company finds more than 60% of businesses are off track to meet their sustainability goals, an increasingly conscious base of consumers and employees may be able to help NEW YORK, Nov. 13, 2023 \/PRNewswire\/ -- As extreme weather prompts growing environmental concern across the globe, new research from Bain & Company shows more than 60% of businesses are off track to meet their current sustainability goals. Progress will require a combination of technology, policy, and behavior change. An increasingly conscious base of consumers and employees may prove helpful. Bain & Company published today a major new study exploring the top sustainability concerns for business leaders, their customers, and their employees. \"We have spoken to thousands of executives about their sustainability ambitions and the associated trade-offs,\" said François Faelli, partner and head of the global Sustainability practice at Bain & Company. \"They know they have a key role to play in the energy and resources transition. Many view this as their legacy, but they are worried about the growing gap between their progress and public commitments. While it will not be easy, there are three levers CEOs must prioritize: policy, technology, and behavior. Bain's new research offers some promising news for businesses—their customers and employees are adaptable and eager to contribute along the path to progress.\" To get a broad sense of environmental concerns around the world, Bain surveyed 23,000 consumers. The results underscore the growing urgency of sustainability topics. Some 64% of people reported high levels of concern about sustainability. Most said their worries have intensified over the past two years and that their concern was first prompted by extreme weather. Surprising truths about consumers Bain's research reveals several surprising truths about consumers, dispelling some common misperceptions. Among them, the ideas that consumers won't pay more for sustainable products and that consumer behavior is fixed. Baby boomers are often just as concerned as Gen Z. Many companies have long viewed younger consumers as more focused on sustainability than their older counterparts, but the reality is not as clear-cut. For example, 72% of Gen Z consumers and 68% of boomers globally are very or extremely concerned about the environment, but in countries as diverse as India , France , and Japan , boomers are more concerned. Many companies have long viewed younger consumers as more focused on sustainability than their older counterparts, but the reality is not as clear-cut. For example, 72% of Gen Z consumers and 68% of boomers globally are very or extremely concerned about the environment, but in countries as diverse as , , and , boomers are more concerned. Both liberals and conservatives are concerned about the environment. In the US, 96% of consumers agree that the climate is changing. Among those concerned about the environment in the US, 85% of self-described liberal voters are very or extremely concerned about climate change, compared with 39% of conservative voters. Yet conservatives say they worry more about specific issues such as water, biodiversity loss, and air pollution. In the US, 96% of consumers agree that the climate is changing. Among those concerned about the environment in the US, 85% of self-described liberal voters are very or extremely concerned about climate change, compared with 39% of conservative voters. Yet conservatives say they worry more about specific issues such as water, biodiversity loss, and air pollution. Consumers are willing to pay a premium for sustainable products, 12% on average, but they are still priced too high. As concerns grow, consumers are looking to make environmentally sound choices and are willing to pay more for sustainable products. Yet, they often run into barriers. For example, consumers in the US are willing to pay an average premium of 11% for products with a minimized environmental impact. However, 28% is the average premium for products marketed as sustainable in the US. Consumers in fast growing markets, where Bain found environmental concerns to be highest—such as India , Indonesia , Brazil , and China—are willing to pay an even greater premium, between 15 and 20%. Consumers in the UK, Italy , Germany , and France , on the other hand, are only willing to pay between 8 and 10% extra. As concerns grow, consumers are looking to make environmentally sound choices and are willing to pay more for sustainable products. Yet, they often run into barriers. For example, consumers in the US are willing to pay an average premium of 11% for products with a minimized environmental impact. However, 28% is the average premium for products marketed as sustainable in the US. Consumers in fast growing markets, where Bain found environmental concerns to be highest—such as , , , and China—are willing to pay an even greater premium, between 15 and 20%. Consumers in the UK, , , and , on the other hand, are only willing to pay between 8 and 10% extra. Consumer behavior can change more quickly than many companies anticipate , with external factors such as government regulation heavily influencing the market. China began offering financial incentives on electric vehicles in 2009; now 19% of Chinese consumers report driving an electric car, compared with 8% of consumers globally. In England , the use of single-use supermarket plastic bags has fallen 98% since the government began requiring retailers to charge for them in 2015. , with external factors such as government regulation heavily influencing the market. began offering financial incentives on electric vehicles in 2009; now 19% of Chinese consumers report driving an electric car, compared with 8% of consumers globally. In , the use of single-use supermarket plastic bags has fallen 98% since the government began requiring retailers to charge for them in 2015. There is a disconnect between what consumers want and what most companies sell. Worldwide, 48% of consumers consider how products are used when thinking about sustainability. These consumers are more concerned about how a product can be reused, its durability, and how it will minimize waste. In contrast, most companies sell sustainable goods based on factors such as how they are made, their natural ingredients, and the farming practices deployed. These factors cause many consumers to conflate \"sustainable\" with \"premium.\" One result of this disconnect: Nearly half of all developed-market consumers believe that living sustainably is too expensive. By comparison, roughly 35% of consumers in fast-growing markets believe this. Worldwide, 48% of consumers consider how products are used when thinking about sustainability. These consumers are more concerned about how a product can be reused, its durability, and how it will minimize waste. In contrast, most companies sell sustainable goods based on factors such as how they are made, their natural ingredients, and the farming practices deployed. These factors cause many consumers to conflate \"sustainable\" with \"premium.\" One result of this disconnect: Nearly half of all developed-market consumers believe that living sustainably is too expensive. By comparison, roughly 35% of consumers in fast-growing markets believe this. Consumers struggle to identify sustainable products and don't trust corporations to make them. In Bain's survey, 50% of consumers said sustainability is one of their top four key purchase criteria when shopping. Yet they may be making decisions based on misconceptions. When asked to determine which of two given products generated higher carbon emissions, consumers were wrong or didn't know about 75% of the time. Consumers say they rely most on labels and certifications to identify sustainable products, yet most were unable to accurately describe the meaning behind common sustainability logos, such as organic production or Fairtrade. A lack of trust in corporations compounds the issue. Bain found only 28% of consumers trust large corporations to create genuinely sustainable products, compared to 45% who trust small, independent businesses. Four critical areas of focus for companies The momentum behind sustainability and dynamic shifts in consumer behavior have profound implications for any company. Bain sees four critical areas of focus. Devise a future-proof and flexible strategy. Few companies plan beyond the typical 3-year strategic planning window, and even those that do look out 5 to 10 years tend to focus on expectations for technology adoption. These plans fail to fully consider two other factors that move just as rapidly and with as big an impact: regulations and consumer behavior. Few companies plan beyond the typical 3-year strategic planning window, and even those that do look out 5 to 10 years tend to focus on expectations for technology adoption. These plans fail to fully consider two other factors that move just as rapidly and with as big an impact: regulations and consumer behavior. Acknowledge a fragmented consumer base. Companies need to deaverage consumers and innovate products and design propositions that appeal to different segments— local markets, consumers with different definitions of sustainability, and consumers with a range of purchasing motivations. Companies need to deaverage consumers and innovate products and design propositions that appeal to different segments— local markets, consumers with different definitions of sustainability, and consumers with a range of purchasing motivations. Test and learn to determine what works—and repeat. In such a fluid environment, companies can lean aggressively on marketing experimentation, using digital tools to quickly test the sustainability messages that resonate with different segments and adapt accordingly. It's a way to help consumers gain enough clarity to make decisions that are consistent with their values. In such a fluid environment, companies can lean aggressively on marketing experimentation, using digital tools to quickly test the sustainability messages that resonate with different segments and adapt accordingly. It's a way to help consumers gain enough clarity to make decisions that are consistent with their values. Get out in front of regulations. As we've seen throughout the world, government policy inevitably becomes a huge contributor to changing consumer behavior. Across all industries, companies need to be at the forefront of helping to shape the regulations affecting their business. A company's ability to anticipate policy shifts and build future-proof portfolios will help determine whether it can outpace competitors. Upskilling employees to rise to the challenge Bain found 75% of business leaders believe they have not embedded sustainability well into their business. The instinct of many CEOs is to prioritize external hiring to address all skill gaps, including in sustainability. Bain advocates for addressing sustainability's challenges through a combination of smart upskilling and cultivating a learning mindset. A new Bain survey of 4,700 people found 63% felt different skills and behaviors would be required for their company to execute on its ESG ambition or strategy. Yet only 45% of nonmanagers said their employer offers the reskilling and upskilling opportunities that would enable internal mobility. Despite almost every CEO saying they have a talent problem, few companies have defined what it means to be a great employer. In Bain's recent survey, 44% of respondents said it is easier to find a better opportunity outside of their company than within it. Bain is leading by example on this cause. The firm has committed to cultivating a growth mindset in its team, partnering with 12 world-class universities—including MIT, HEC Paris, and Melbourne Business School—to upskill its employees on ESG. To date, its consultants have completed over 17,000 hours of ESG training through the program. Editor's Note: For more information or interview requests, please contact Katie Ware at [email protected] or +1 646 562 8107. About Bain & Company Bain & Company is a global consultancy that helps the world's most ambitious change makers define the future. Across 65 cities in 40 countries, we work alongside our clients as one team with a shared ambition to achieve extraordinary results, outperform the competition, and redefine industries. We complement our tailored, integrated expertise with a vibrant ecosystem of digital innovators to deliver better, faster, and more enduring outcomes. Our 10-year commitment to invest more than $1 billion in pro bono services brings our talent, expertise, and insight to organizations tackling today's urgent challenges in education, racial equity, social justice, economic development, and the environment. We earned a platinum rating from EcoVadis, the leading platform for environmental, social, and ethical performance ratings for global supply chains, putting us in the top 1% of all companies. Since our founding in 1973, we have measured our success by the success of our clients, and we proudly maintain the highest level of client advocacy in the industry. SOURCE Bain & Company","filter_flag":1}
{"title":"Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5\" target=\"_blank\">Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvaG93LWVtZXJnaW5nLW1hcmtldHMtY2FuLXByZXBhcmUtZm9yLXRoZS1uZXctZXNnLXJlZ3VsYXRpb25z0gEA?oc=5\" target=\"_blank\">Why Emerging Markets Need to Prepare for the EU's New Climate and ESG Regulations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In December 2021, European leaders returned home from the COP26 climate conference in Glasgow determined to honor pledges to back their climate commitments with concrete action. Since then, the European Union has issued a flurry of regulations applying environmental, social, and governance (ESG) standards to trade. These measures are expected to significantly reduce CO 2 emissions, protect greener European producers from unfair competition, and discourage bad trade practices. Their greatest economic impact, however, will likely be felt not in the EU but in emerging markets. Few companies and governments in developing nations are prepared for what is about to hit them. In the absence of a real sense of urgency, concrete actions, and multilateral cooperation, many are in jeopardy of being shut out of their key export markets. Two of the most significant EU measures relate to climate. One is the Carbon Border Adjustment Mechanism (CBAM), which will soon place the same price on carbon emissions associated with materials produced in developing nations—including steel, aluminum, and chemicals—that producers in the EU now pay. The other is the EU Deforestation Regulation (EUDR), which bans the sale of commodities such as cocoa, coffee, palm oil, and timber harvested from recently cleared rainforest. This will affect important export industries in Latin America, Africa, and Southeast Asia. Taken together, these and other climate- and values-based measures amount to one of the biggest changes to global trade since the creation of the World Trade Organization in 1995. They will eventually affect virtually every significant emerging-market export sector. Emerging-market companies and governments must act now. The measures needed to remain competitive in Europe and in markets that adopt similar ESG rules can’t be implemented overnight. If they haven’t done so already, companies need to establish systems for documenting and reporting the greenhouse gas footprints and other data relating to their products and supply chains. And rather than merely react to new requirements as they arise, companies should adopt “smart compliance”—a pragmatic approach to fulfilling mandatory disclosure requirements. Companies also need a holistic strategy and game plan for decarbonizing and for improving their overall ESG performance. The Growing Sustainability Imperative The movement to get companies to adhere to ESG standards has been gaining momentum in advanced economies for decades. Now, the sustainability movement is hitting emerging markets at full force. These nations, which by 2050 are expected to account for 62% of the global economy and 88% of the population, are crucial to mitigating climate change. Although they emit less CO2 per capita than advanced economies, they account for around 85% of the global total—a share that’s projected to grow. Emerging-market companies are under intensifying pressure, not just from the demands of their trade partners, but from consumers, investors, regulators, and employees at home and abroad to back their commitments with verifiable action. (See Exhibit 1.)","filter_flag":1}
{"title":"Can Food and Agriculture Companies Raise Their Game? - Bain & Company","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5\" target=\"_blank\">Can Food and Agriculture Companies Raise Their Game?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Can Food and Agriculture Companies Raise Their Game? - Bain & Company","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL2Nhbi1mb29kLWFuZC1hZ3JpY3VsdHVyZS1jb21wYW5pZXMtcmFpc2UtdGhlaXItZ2FtZS1jZW8tc3VzdGFpbmFiaWxpdHktZ3VpZGUtMjAyMy_SAQA?oc=5\" target=\"_blank\">Can Food and Agriculture Companies Raise Their Game?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","source.href":"https:\/\/www.bain.com","source.title":"Bain & Company","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This article is part of Bain’s 2023 CEO Sustainability Guide Explore the report The global food system is an impressive human accomplishment. Over the past five decades, its vast productivity gains have greatly improved food security and substantially reduced the share of income that people need to spend for food. The food system has become so productive that it is now also helping to address other global issues, such as energy supply, through the growing use of biofuels. But, like virtually all other industries, food and agribusiness companies face mounting demands, from tackling the long-term health consequences of food products to fixing an outsized contribution to global climate and nature challenges. Today, agriculture consumes 70% of the world’s fresh water, and the food system more broadly contributes over one-third of all greenhouse gas emissions and is at the heart of the 20% of annual deaths attributed to poor diet. As a result, agriculture producers, consumer products companies, retailers, and others that make up the global food system are on the verge of coming under the same high-level scrutiny experienced by oil and gas companies. Elevating the ambition With this backdrop, food and agriculture companies have an urgent need to raise their ambitions on sustainability and health to build more future-proof and competitive businesses. There’s a lot at stake for companies that fail to take the aggressive steps required. Latecomers will face rising costs to address carbon requirements for their value chains, for example. Incumbent consumer goods companies will continue to cede growth to insurgents that are doing a better job of serving consumers’ rising demands for healthier food. Companies across the food chain will find themselves losing out amid the scarce supply of limited raw materials that meet environmental standards. They’re already lagging in the war for top talent. A telling fact: No agribusiness or food producer was named in the Fortune 100 Best Companies to Work For list in 2023. Acting now allows companies to turn risks into opportunities—new products, categories, and markets, or increased share of growth. By our analysis, food companies that seize the initiative can benefit from a potential 15% five-year revenue uplift compared with a 43% revenue decline for companies that fall behind based on a scenario of increasingly aggressive regulation. By changing product and ingredient portfolios, as well as where and how foods are produced, large food and agriculture companies can shift the food system toward healthier and more nutritious food—and healthier populations—while tipping the environmental impact from negative to a net positive. An integrated food systems ambition, once defined, will have strategic implications for agriculture and food businesses in three particularly critical areas: product portfolio, agricultural sustainability, and ways of working. Here are examples of winning approaches in each of those areas. Reinventing the portfolio Product portfolio reinvention will be a critical element of food system transformation for upstream and downstream companies alike. As an example of the scale of the issues at hand, one study determined that among 50,000 food products in the US, 73% is made up of ultraprocessed foods.1 Such foods are linked to a wide range of health issues, and reduced consumption is recommended in national dietary guidelines in places as diverse as Canada and Brazil. The need to transform portfolios is not limited to downstream players. For example, agricultural input portfolios may need to add seeds that support more diverse crops, or equipment and inputs to support more sustainable farming practices—in addition to supporting reduced fertilizer and chemical volumes through more precise application. Facing mounting pressure to offer healthier and more sustainable goods, companies can reevaluate their portfolio strategy to determine the product mix that will best help them meet those new demands without dismantling a core that has delivered decades of profitable growth. That means identifying and exiting the unfixable parts of the portfolio and spending more time and energy on the brands and products that have the fundamentals that will allow them to satisfy consumers' needs for delicious, healthy, and sustainable foods. When it comes to shifting food product portfolios toward better health, a common refrain from food company executives is that the indulgent segments of consumer goods categories are growing faster than the “better for you” segments. Indeed, in the US, consumption of ultraprocessed foods increased from 53.5% in 2001 to 57% in 2018, and the consumption of whole foods declined over the same period. However, many leaders are not accepting that such a shift is an either\/or decision, and the winners of the future will likely have more balanced portfolios than most food companies today. They will offer products that reduce trade-offs for consumers, introducing ones that can be delicious, healthy, and affordable. PepsiCo took a step in this direction when it started gradually lowering the amounts of sodium, saturated fat, and sugar in its snacks and beverages, with plans to bring them even lower—and to do it without consumers noticing. The company already has reached its 2025 target of producing 75% of its food portfolio volume with 1.1 grams or less of saturated fat per 100 calories. It also is advancing on its targets for reducing sodium and added sugars. This shift toward healthier portfolios will get a big push from sugar and salt taxes introduced, as well as from newly required health labeling on packages. Consider that around 85 jurisdictions around the world have implemented a form of sugar tax. Also at play: a flood of venture financing—roughly $13 billion—was invested into sustainable food systems technology and innovation globally in 2021. (By comparison, the total R&D budget for the top 10 global food companies was roughly $4 billion.) This magnitude of venture funding to solve the problems of health and sustainability shows these issues are already a major focus among private investors. Now, the question is whether food companies will get ahead of this imperative or be disrupted by it. In addition to aggressively reducing salt and sugar content in its products, Nestlé has turned to M&A to transform its portfolio. In the years 2017–22 the world’s largest food company made more than 20 acquisitions and sold 10 business units. During that period, total shareholder return rose by an annual 9.5%. Nestlé also has committed substantially more funds to sustainability efforts, more than $1 billion annually, twice as much as the next competitor. Accelerating agricultural transformation Almost all food and agriculture companies are way behind in their Scope 3 emissions reduction. Agricultural production contributes two-thirds of those emissions, which could be substantially reduced through more sustainable farming practices, such as regenerative agriculture for crops (see Figure 1). But adoption of these practices is low, and until companies can solve the scaling problem, they will fail to achieve their Scope 3 commitments. Most important, they will fail to realize the opportunity that exists for agriculture to reduce its own climate impact and be a positive contributor on the path to net zero and in other areas such as water and biodiversity. Figure 1 Addressing Scope 3 emissions through regenerative agriculture is a powerful opportunity to deliver on GHG commitments Reducing the food supply carbon footprint requires engagement across the food value chain—everyone from input and equipment providers, to farmers, to commodity traders and processors, to ingredient and food companies—and with a broader ecosystem of stakeholders such as governments, financial services providers, investors, and grower organizations. As far back as the 1980s, soil health was a growing concern for many stakeholders in the Canadian food system who wanted to generate acceptance for conservation tillage, a regenerative agriculture practice. After local farm associations spread awareness and provided technical expertise, equipment companies marketed new equipment, prototyped by entrepreneurial local farmers, that made conservation tillage compatible with mechanical seeding. Meanwhile, the federal government offered grants to reduce upfront costs of new equipment. As a result of coordinated ecosystem action, adoption of conservation tillage practices in Canada are now at almost 80%, substantially further ahead than other developed markets. Success calls for a paradigm shift for upstream and downstream companies: putting growers at the center, surrounded by the right conditions for making changes. We refer to these as the 4As of adoption. Awareness: Farmers must know about climate-smart and nature-positive practices and technologies—and have access to the technical expertise and support needed to implement them. Advantage: Farmers must have confidence that adopting new practices and technologies will deliver an attractive rate of return, both now and into the future. Access: The right inputs, tools, equipment, and methods must be available to farmers, when and where needed. Affordability: Upfront costs for farmers must be reasonable, with affordable financing available to support initial investments. Collaboration between players across the ecosystem is essential to establishing these 4A conditions for farmers, particularly for creating the economic case for change to growers (Advantage and Affordability), which our analysis shows is the biggest barrier to change. This requires involvement of players inside the value chain as well as those outside it, such as financial services providers. The Soil and Water Outcomes Fund is one such innovative, precompetitive partnership model, which brings together actors across the value chain (including Nutrien, Cargill, PepsiCo, Target, and ReHarvest Partners, a financial services provider) and the Iowa Soybean Association. SWOF aids farmers’ transition to regenerative agriculture through payments for carbon and water outcomes. While partnership models like SWOF are encouraging, still more investment is needed. Most regenerative practices are not widely adopted, and many have yet to be adopted on even 10% of the roughly 230 million acres of soy, corn, and wheat planted annually in the US. Changing the organization Just as important as what needs to be done is how companies mobilize their enterprises to progress on these priorities. For example, it requires cross-functional collaboration in newly established forums to factor the impact on sustainability or health in funding decisions. The food systems imperative will give rise to a new set of heroes. In food retailers, it will be the merchandisers. In consumer goods companies, it will be supply chain and procurement teams. They will be the ones driving Scope 3 decarbonization. But they won’t be able to do it alone. They will need to partner with brands and R&D functions to collaborate on how to address sustainability challenges in ways that deliver delicious and affordable products for consumers. As with any successful change to ways of working, this one starts with management alignment and commitment. As an example, General Mills’ Global Impact Governance Committee, which includes the company’s CEO, CFO, and group president, North America Retail, among others, has adopted and signed a formal charter that articulates its ownership over this enterprise mission. It is not a steering committee sitting in judgment of others’ efforts. Instead, it has taken on the responsibility of seeing General Mills’ mission through. In a global food system facing huge changes, winning companies will be those with unwavering support from the top—and with leaders willing to make the tough trade-off decisions that inevitably will be required. Getting started Companies can begin this journey into the future by asking and answering a series of fundamental questions. How are we contributing—both positively and negatively—to the health and environmental footprint of the food system? How might environmental, health, consumer, technology, and regulatory dynamics\/developments affect the food industry over the next 10 years? What will the agri-food company of the future—and our company—need to look like in 10 years? How do we scale our regenerative agriculture and portfolio reinvention priorities? How can we better mobilize our entire organization?","filter_flag":1}
{"title":"New Dentsply Sirona sustainability report shows Company made solid progress against goals for the third year in a row - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1kZW50c3BseS1zaXJvbmEtc3VzdGFpbmFiaWxpdHktcmVwb3J0LXNob3dzLWNvbXBhbnktbWFkZS1zb2xpZC1wcm9ncmVzcy1hZ2FpbnN0LWdvYWxzLWZvci10aGUtdGhpcmQteWVhci1pbi1hLXJvdy0zMDE5Nzg3NDUuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1kZW50c3BseS1zaXJvbmEtc3VzdGFpbmFiaWxpdHktcmVwb3J0LXNob3dzLWNvbXBhbnktbWFkZS1zb2xpZC1wcm9ncmVzcy1hZ2FpbnN0LWdvYWxzLWZvci10aGUtdGhpcmQteWVhci1pbi1hLXJvdy0zMDE5Nzg3NDUuaHRtbNIBAA?oc=5","id":"CBMirQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1kZW50c3BseS1zaXJvbmEtc3VzdGFpbmFiaWxpdHktcmVwb3J0LXNob3dzLWNvbXBhbnktbWFkZS1zb2xpZC1wcm9ncmVzcy1hZ2FpbnN0LWdvYWxzLWZvci10aGUtdGhpcmQteWVhci1pbi1hLXJvdy0zMDE5Nzg3NDUuaHRtbNIBAA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1kZW50c3BseS1zaXJvbmEtc3VzdGFpbmFiaWxpdHktcmVwb3J0LXNob3dzLWNvbXBhbnktbWFkZS1zb2xpZC1wcm9ncmVzcy1hZ2FpbnN0LWdvYWxzLWZvci10aGUtdGhpcmQteWVhci1pbi1hLXJvdy0zMDE5Nzg3NDUuaHRtbNIBAA?oc=5\" target=\"_blank\">New Dentsply Sirona sustainability report shows Company made solid progress against goals for the third year in a row<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Dentsply Sirona sustainability report shows Company made solid progress against goals for the third year in a row - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25ldy1kZW50c3BseS1zaXJvbmEtc3VzdGFpbmFiaWxpdHktcmVwb3J0LXNob3dzLWNvbXBhbnktbWFkZS1zb2xpZC1wcm9ncmVzcy1hZ2FpbnN0LWdvYWxzLWZvci10aGUtdGhpcmQteWVhci1pbi1hLXJvdy0zMDE5Nzg3NDUuaHRtbNIBAA?oc=5\" target=\"_blank\">New Dentsply Sirona sustainability report shows Company made solid progress against goals for the third year in a row<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Dentsply Sirona is committed to driving sustainability internally and enabling the industry to advance with confidence towards a more sustainable future. Three years ago, the company launched its sustainability strategy \"BEYOND: Taking action for a brighter world\" to positively contribute to environmental, social, and governance goals. CHARLOTTE, N.C., Nov. 6, 2023 \/PRNewswire\/ -- Dentsply Sirona, the world's largest manufacturer of professional dental products and technologies, published its third sustainability report in September, highlighting that the Company has continued to successfully take action to drive sustainability internally as well as within the dental industry. The 2022 sustainability report was launched at Dentsply Sirona World Las Vegas, the Company's annual flagship clinical education event for the dental industry. \"I'm pleased that in 2022 we once again demonstrated our commitment to sustainability and made solid progress against all our goals, be they environmental, social, or governance related. In fact, we are now in the process of setting our next set of goals to supersede the 2025 goals we have met ahead of time – reducing our Scope 1 and 2 Green House Gas emission intensity and water withdrawal intensity by 15%,\" said Erania Brackett, Dentsply Sirona's Senior Vice President, Orthodontic Aligner Solutions & Customer Experience, and Head of Sustainability. \"For me, a special highlight of the past year has been the launch of our Sustainability Educational Curriculum. It is our response to the need for more knowledge expressed by a large number of dentists in our global sustainability study. The curriculum is available online on DS Academy and aims to help empower dental professionals around the world with the knowledge they need to drive sustainability within their practices and labs.\" Selected 2022 highlights from environmental, social, and governance goals Dentsply Sirona's sustainability strategy is built on three pillars of action: \"Healthy Planet\" – striving to mitigate the environmental impact of the Company's operations; \"Healthy Smiles\" – improving oral health globally; supporting customers; and fostering a diverse, equitable, and inclusive Company culture; \"Healthy Business\" – maintaining and building trusted and responsible relationships with all stakeholders by establishing sustainable and safe practices across the business. Healthy Planet In 2022, Dentsply Sirona continued to reduce its Scope 1 and 2 Green House Gas emissions, water withdrawal, and total waste, in line with its strategy and targets. The Company has conducted energy and waste audits across several sites globally and is putting measures in place, such as solar panels at certain manufacturing sites, to further reduce on-site energy consumption and waste. Dentsply Sirona is increasingly using and developing digital tools and solutions to become a more sustainable business. DS Core, Dentsply Sirona's digital cloud-based platform operates on the Google Cloud Platform, which is powered by 100% renewable energy. Dentsply Sirona is also taking action to improve the sustainability of packaging materials associated with its products. This includes the use of more sustainable and recyclable packaging options such as replacing plastic bubble wrap and foam with paper, switching to commonly recycled plastics, and reducing the size of packaging boxes. Healthy Smiles Dentsply Sirona enabled and empowered 5.4 million healthy smiles in 2022. The Company has now reached more than 11.2 million smiles – nearly half of the 25 million smiles Dentsply Sirona aims to reach by 2025. To contribute to driving better access to oral healthcare globally, Dentsply Sirona has continued to support Smile Train to advance cleft care. Since 2021, the Company has supported more than 2,700 cleft surgeries and completed donations in cash and in-kind of over US$1 million. Dentsply Sirona and Smile Train have also entered a three-way partnership with the FDI World Dental Federation to develop a first-of-its-kind set of protocols for digital cleft treatment with the aim of increasing quality and access to oral care for patients with cleft around the world. The global digital treatment protocols were finalized and launched in 2023. In 2022, Dentsply Sirona also made progress towards its goal to achieve gender parity by 2025. Additionally, 55% of global hires in 2022 were diverse.1 The Company provided more than 7,000 clinical education and training courses across 75 countries in 2022, with over 416,000 clinical education course registrations from dentists, technicians, hygienists, dental assistants, and students. Healthy Business Dentsply Sirona has achieved gender pay parity in the US, its largest market, for professional managerial levels and is working diligently to close the small remaining international gap by 2025. \"The reason we continue to make great strides in our sustainability ambitions for the third year running lies in our culture of unity combined with an unwavering focus on providing superior solutions for patient and customer care and our unwavering determination to build a more sustainable business,\" says Simon Campion, President and Chief Executive Officer, Dentsply Sirona. \"With sustainability principles in our hearts and minds, we will continue to drive transformative innovations as well as cooperation across our industry to make a positive impact on the lives and health of millions of patients and the planet on which they live.\" The 2022 Dentsply Sirona Sustainability Report is available for Download on the website. IMAGES are available for Download on the website. 1 Diverse is defined as all global employees who self-identify as female, or people of color in the US. Press Contact Marion Par-Weixlberger | Vice President Public Relations & Corporate Communications Sirona Straße 1 | 5071 Wals bei Salzburg, Austria | T +43 (0) 662 2450-588 | F +43 (0) 662 2450-540 [email protected] | www.dentsplysirona.com Edelman GmbH Schöneberger Straße 15 | 10963 Berlin, Germany | T +49 221 82828 127 [email protected] | www.edelman.com About Dentsply Sirona Dentsply Sirona is the world's largest manufacturer of professional dental products and technologies, with over a century of innovation and service to the dental industry and patients worldwide. Dentsply Sirona develops, manufactures, and markets a comprehensive solutions offering including dental and oral health products as well as other consumable medical devices under a strong portfolio of world class brands. Dentsply Sirona's products provide innovative, high-quality and effective solutions to advance patient care and deliver better and safer dental care. Dentsply Sirona's headquarter is located in Charlotte, North Carolina. The company's shares are listed in the United States on NASDAQ under the symbol XRAY. Visit www.dentsplysirona.com for more information about Dentsply Sirona and its products. SOURCE Dentsply Sirona","filter_flag":1}
{"title":"Lumson showcases sustainable luxury beauty packaging, with a touch of fun - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdW1zb24tc2hvd2Nhc2VzLXN1c3RhaW5hYmxlLDIyODY4LGVu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdW1zb24tc2hvd2Nhc2VzLXN1c3RhaW5hYmxlLDIyODY4LGVu0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdW1zb24tc2hvd2Nhc2VzLXN1c3RhaW5hYmxlLDIyODY4LGVu0gEA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdW1zb24tc2hvd2Nhc2VzLXN1c3RhaW5hYmxlLDIyODY4LGVu0gEA?oc=5\" target=\"_blank\">Lumson showcases sustainable luxury beauty packaging, with a touch of fun<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lumson showcases sustainable luxury beauty packaging, with a touch of fun - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9sdW1zb24tc2hvd2Nhc2VzLXN1c3RhaW5hYmxlLDIyODY4LGVu0gEA?oc=5\" target=\"_blank\">Lumson showcases sustainable luxury beauty packaging, with a touch of fun<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Thanks to the originality and elegance of its numerous standard models that are designed in-house, and to first-rate decoration capabilities, Lumson offers high-end turnkey solutions within short lead times, for minimum order quantities comprised between 5,000 and 10,000 pieces. At Luxe Pack Monaco, from October 2 to 3, 2023, Lumson presented two new shapes – named Excelsa and Sublima – completing its Techno Airless Glass (TAG) range of pouch airless pumps assembled on glass bottles. These new luxury bottles were designed for prestige skincare products and make-up. “As far as beauty packaging is concerned, premiumisation and sustainability are concomitant trends,” Cécile Pompili, Marketing Strategic Manager at Lumson, told Premium Beauty News. Also unveiled at Luxe Pack, the new Infinity range includes four glass bottles (from 15 ml to 50 ml) and a 50 ml refillable glass jar with a removable PP cup. For increase sustainability credentials, Infinity items can be all produced using post-consumer recycled (PCR) Glass. Expanded Eco Balance range Last but not least, Lumson has expended its Eco Balānce range, which now features the Eco Dropper mono-material dropper and a jar with a new PP cover. The Eco Dropper is a coloured mono-material dropper that was designed to bring a breath of fresh air for this type of product, in addition to its environmental benefits. The components are made entirely of PP allowing to be easily declined in an original and coloured version. Of course, since these droppers are made of a single material, they can be easily recycled at the end of their life cycle. “This does not compromise technical performance, however: Eco Dropper provides the same precision and ease of use as traditional droppers,” claims Lumson. The collar and pipette are made of PP while the seal is made of polyolefin, a special elastomer compatible with the PP recycling chain. This solution simplifies end-of-life recycling, so that all the components can be processed along the same chain. The Eco Dropper can also be combined with PCR glass bottles for increased sustainability. To complete the range, Lumson has created a new 100% PP cover to replace the former PETG solution. The main challenge was not to compromise on the aesthetics for each of the three elements of the cover — outer\/inner\/sealing gasket – now only made of PP. The cover can be combined with Lumson’s Slim 58-diameter and De Luxe 66-diameter jars in both standard and refillable versions. For an even greener approach, the components can be made of PCR PP. And once again, the use of PP allows the brand to add a touch of colourful cheerfulness to the packaging solution!","filter_flag":1}
{"title":"Circular black masterbatch - PlasticsToday","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5\" target=\"_blank\">Circular black masterbatch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular black masterbatch - PlasticsToday","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL3N1c3RhaW5hYmlsaXR5L2NhYm90LWxhdW5jaGVzLWNpcmN1bGFyLWJsYWNrLW1hc3RlcmJhdGNo0gEA?oc=5\" target=\"_blank\">Circular black masterbatch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","source.href":"https:\/\/www.plasticstoday.com","source.title":"PlasticsToday","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Cabot Corp., a global manufacturer of black masterbatch, launched its new REPLASBLAK product family of circular black masterbatches with certified material. Black masterbatch is a combination of black carbon pigment, resin, and other additives in granular form used to color plastics. Three new products will be sold as the company’s first International Sustainability & Carbon Certification (ISCC Plus) certified black masterbatch products powered by Evolve Sustainable Solutions. Cabot’s recently launched Evolve Sustainable Solutions platform delivers products with sustainable content and reliable performance at an industrial scale across three categories — recovered, renewable, and reduced, said Cabot. Masterbatch suitable for packaging, automotive applications Increased environmental pressure is driving greater demand for black masterbatch products that support a circular economy and decrease greenhouse gas (GHG) emissions, the company said. The new products can be used in various applications in the automotive, agriculture, packaging, and building and construction segments. Cabot’s three new black masterbatch products powered by Evolve Sustainable Solutions under the recovered category include the following: REPLASBLAK rePE5475 100% circular black masterbatch leverages 100% ISCC Plus mass balance–certified material made from reclaimed carbon from end-of-life tire pyrolysis and mechanically recycled polyethylene. GHG emissions are reduced by more than 60% compared with standard black masterbatch and the material adheres to the ISCC Plus voluntary add-on GHG emission requirements, the company said. It supports medium tint strength, making the material suitable for compounding, recycling, injection molding, and sheet extrusion applications relevant to the automotive, agriculture, packaging, and building and construction segments. REPLASBLAK rePE5265 70% circular black masterbatch leverages 70% ISCC Plus mass balance–certified material made from mechanically recycled polyethylene. It reduces GHG emissions by nearly 50% in comparison to standard black masterbatch and adheres to the ISCC Plus voluntary add-on GHG emission requirements, the company said. It delivers high gloss and jet pigmentation in thermoplastics, making it suitable for compounding, recycling, injection molding, and sheet extrusion applications in the automotive segment. REPLASBLAK rePE5250 60% circular black masterbatch leverages 60% ISCC Plus mass balance–certified material made from mechanically recycled polyethylene. It reduces GHG emissions by nearly 50% in comparison to standard black masterbatch and adheres to the ISCC Plus voluntary add-on GHG emission requirements, the company said. It delivers high tint strength making it suitable for compounding, recycling, injection molding, and sheet extrusion applications relevant to the automotive segment. ISCC is a globally applicable certification system designed to ensure compliance with ecological and social requirements, GHG emission savings, and traceability, the company said. Mass balance accounting is designed to trace the flow of materials through a complex value chain, including recycled feedstock at plants. Circular value chains and certified feedstocks “As the largest global manufacturer of black masterbatch, we have the capacity and expertise to deliver innovative solutions that help our customers solve their sustainability challenges as well as meet our own sustainability objectives,” said Jeff Zhu, executive vice president and president, Performance Chemicals segment and Asia Pacific region. “Our new black masterbatch products powered by Evolve Sustainable Solutions will be manufactured at our plants in Pepinster and Loncin, Belgium, which recently achieved ISCC PLUS certification. This gives our customers third-party validation that our products are leveraging circular value chains and certified feedstocks in the product manufacturing process. With several projects at various stages of development, we are excited about our progress and look forward to continuing to collaborate with our customers and industry partners on building out our product pipeline to enable a more sustainable world,” said Zhu.","filter_flag":1}
{"title":"New TrailBlazer Pre-Rolls from The Pass are Designed with Sustainability in Mind - Chronogram","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg40gGMAWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg4P21lZGlhPUFNUCtIVE1M?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg40gGMAWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg4P21lZGlhPUFNUCtIVE1M?oc=5","id":"CBMifWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg40gGMAWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg4P21lZGlhPUFNUCtIVE1M","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg40gGMAWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg4P21lZGlhPUFNUCtIVE1M?oc=5\" target=\"_blank\">New TrailBlazer Pre-Rolls from The Pass are Designed with Sustainability in Mind<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Chronogram<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New TrailBlazer Pre-Rolls from The Pass are Designed with Sustainability in Mind - Chronogram","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg40gGMAWh0dHBzOi8vd3d3LmNocm9ub2dyYW0uY29tL2Nhbm5hYmlzL25ldy10cmFpbGJsYXplci1wcmUtcm9sbHMtZnJvbS10aGUtcGFzcy1hcmUtZGVzaWduZWQtd2l0aC1zdXN0YWluYWJpbGl0eS1pbi1taW5kLTE5Mzc3Mzg4P21lZGlhPUFNUCtIVE1M?oc=5\" target=\"_blank\">New TrailBlazer Pre-Rolls from The Pass are Designed with Sustainability in Mind<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Chronogram<\/font>","source.href":"https:\/\/www.chronogram.com","source.title":"Chronogram","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Anyone who has spent time on the trails will be familiar with “Pack it in, pack it out,” that trusty old adage that reminds visitors to do their part in preserving the great outdoors for all to enjoy. With the introduction of its new mini pre-roll five-packs, TrailBlazers, Berkshires-based recreational cannabis dispensary The Pass is making it easier than ever for lovers of all things green to keep their ecological footprints light. As an agricultural business whose Berkshire grow operation is intimately tied into the health of the local environment, it makes sense that the team at The Pass would come up with a product that helps customers enjoy their locally grown flower more responsibly. Made with sustainably produced hemp-based rolling papers, filters, and tips packaged in a crush-resistant, reusable tin, the TrailBlazers five-pack offers a sustainable alternative to single-use packaging. And it’s not just the materials that go into TrailBlazers that are designed for conscientious environmental impact. The Pass is also donating a portion of the proceeds from the sale of TrailBlazers to Berkshire Natural Resources Council (BNRC) and encouraging its own employees to walk the sustainable walk by providing them with opportunities to participate in twice-monthly trail clean-up efforts. “We are pleased to partner with The Pass and admire their commitment to making a positive impact on our region,” says President of BNRC Jenny Hansell. “Support from the business community is vital to the work BNRC does to conserve and care for more than 25,000 acres of field and forest in the Berkshires. There are many places and ways to enjoy the scenic views and vistas of the Berkshire landscape and we are looking forward to TrailBlazers playing a part in helping make the Berkshire outdoors accessible to all.” “The beauty of the Berkshires makes it a destination for nature-lovers and hiking fans everywhere and we’re always excited to see Appalachian Trail through-hikers and other outdoor enthusiasts visit our shop,” said Bill Packer, COO of The Pass. “TrailBlazers is one small way The Pass can help ensure these special places are preserved for future generations to come.” TrailBlazers are now available for sale in The Pass flagship store in Sheffield, with distribution throughout Massachusetts to dozens of cannabis dispensaries who carry Pass-produced products. For more information about TrailBlazers, visit The Pass blog. To stay up to date on new products and events, join The Pass mailing list, visit thepass.co, or follow along on Instagram. Visit the website at thepass.co for more info.","filter_flag":1}
{"title":"VF Corp publishes sustainability advances | Fashion & Retail News | News - Ecotextile News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5\" target=\"_blank\">VF Corp publishes sustainability advances | Fashion & Retail News | News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ecotextile News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"VF Corp publishes sustainability advances | Fashion & Retail News | News - Ecotextile News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmVjb3RleHRpbGUuY29tLzIwMjMxMTE0MzEzOTYvZmFzaGlvbi1yZXRhaWwtbmV3cy92Zi1jb3JwLXB1Ymxpc2hlcy1zdXN0YWluYWJpbGl0eS1hZHZhbmNlcy5odG1s0gEA?oc=5\" target=\"_blank\">VF Corp publishes sustainability advances | Fashion & Retail News | News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ecotextile News<\/font>","source.href":"https:\/\/www.ecotextile.com","source.title":"Ecotextile News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"DENVER - VF Corporation, which owns brands such as Timberland, Vans, Dickies and North Face, is claiming significant progress in its work to reduce its environmental impact in its newly published 2023 environmental and social responsibility report. The report, “Purpose. Driven\" shows that VF's sourcing of recycled polyester increased to 40% in 2022, an improvement from 36% the previous year, putting the group well on its way toward achieving its target to use 50% recycled polyester by 2026.","filter_flag":1}
{"title":"UV curing: How to enhance quality, reduce energy use and nurture sustainability with bio-based solutions - Medical Device Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5tZWRpY2FsZGV2aWNlLW5ldHdvcmsuY29tL3Nwb25zb3JlZC91di1jdXJpbmctaG93LXRvLWVuaGFuY2UtcXVhbGl0eS1yZWR1Y2UtZW5lcmd5LXVzZS1hbmQtbnVydHVyZS1zdXN0YWluYWJpbGl0eS13aXRoLWJpby1iYXNlZC1zb2x1dGlvbnMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5tZWRpY2FsZGV2aWNlLW5ldHdvcmsuY29tL3Nwb25zb3JlZC91di1jdXJpbmctaG93LXRvLWVuaGFuY2UtcXVhbGl0eS1yZWR1Y2UtZW5lcmd5LXVzZS1hbmQtbnVydHVyZS1zdXN0YWluYWJpbGl0eS13aXRoLWJpby1iYXNlZC1zb2x1dGlvbnMv0gEA?oc=5","id":"CBMilwFodHRwczovL3d3dy5tZWRpY2FsZGV2aWNlLW5ldHdvcmsuY29tL3Nwb25zb3JlZC91di1jdXJpbmctaG93LXRvLWVuaGFuY2UtcXVhbGl0eS1yZWR1Y2UtZW5lcmd5LXVzZS1hbmQtbnVydHVyZS1zdXN0YWluYWJpbGl0eS13aXRoLWJpby1iYXNlZC1zb2x1dGlvbnMv0gEA","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5tZWRpY2FsZGV2aWNlLW5ldHdvcmsuY29tL3Nwb25zb3JlZC91di1jdXJpbmctaG93LXRvLWVuaGFuY2UtcXVhbGl0eS1yZWR1Y2UtZW5lcmd5LXVzZS1hbmQtbnVydHVyZS1zdXN0YWluYWJpbGl0eS13aXRoLWJpby1iYXNlZC1zb2x1dGlvbnMv0gEA?oc=5\" target=\"_blank\">UV curing: How to enhance quality, reduce energy use and nurture sustainability with bio-based solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medical Device Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UV curing: How to enhance quality, reduce energy use and nurture sustainability with bio-based solutions - Medical Device Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5tZWRpY2FsZGV2aWNlLW5ldHdvcmsuY29tL3Nwb25zb3JlZC91di1jdXJpbmctaG93LXRvLWVuaGFuY2UtcXVhbGl0eS1yZWR1Y2UtZW5lcmd5LXVzZS1hbmQtbnVydHVyZS1zdXN0YWluYWJpbGl0eS13aXRoLWJpby1iYXNlZC1zb2x1dGlvbnMv0gEA?oc=5\" target=\"_blank\">UV curing: How to enhance quality, reduce energy use and nurture sustainability with bio-based solutions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Medical Device Network<\/font>","source.href":"https:\/\/www.medicaldevice-network.com","source.title":"Medical Device Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Recent years have seen a raft of new initiatives introduced across the coating and print industry that seek to move the meter towards a more sustainable future for the sector. Under the microscope are fossil feedstocks, energy usage and sustainable performance. New regulation includes the European Green Deal, which has a zero-pollution ambition for a toxic-free environment. It is calling for a clean and circular economy – involving design, sustainable products and waste regulations such as the Packaging and Packaging Waste Directive Revision. All of this is fostering innovation, and tailor-made bio-based products are one of the solutions. What are bio-based materials? The European Commission defines bio-based products as wholly or partly derived from materials of biological origin. As they are derived from renewable raw materials such as plants, bio-based products can help reduce carbon emissions and they can offer other advantages such as lower toxicity. Biomass absorbs CO2 during its growth, so bio-based products can help to reduce the carbon footprint of inks and coatings. Bio-based products also reduce dependence on fossil fuels, are renewable and can give new or superior properties compared to standard oil-based products. The chemistry of bio-based products “When disposed of, oil-based products always introduce extra CO2 into the atmosphere. With bio-based materials, the CO2 has previously been removed by the plants for photosynthesis and locked into the molecule we use,” says Alexander Thrift, technical sales manager at leading global supplier of UV-curing raw materials RAHN, who has worked in the ultraviolet industry for 30 years. RAHN’s scientists utilise these bio-based raw materials to create products used for UV curable polymers for use in various applications, including inks and coatings. Sometimes these products come from fermentation or industrial waste refining, making the process even more sustainable. From these materials, new products are created and then produced on a commercial scale. RAHN’s newest bio-based products include GENOMER 3143, which is good for clear coatings and adhesives, GENOMER 4293, the hardest product in the range and giving advantages in 3D printed products and GENOMER 3135, which exhibits excellent flexibility and low viscosity. So, how much bio-based material is in a product? Darren Lumber, RAHN’s technical key account manager, says: “We can calculate the percentage easily, but for our customers we need to measure it. That way, when creating a new product, we can show with confidence its bio-renewable content.” The standard measurement accepted in the industry is ASTM D6866 or EN 16440; both methods measure how much Carbon 14 is in the product in order to calculate how much biomass there is. For example, GENOMER 3143 and GENOMER 4293 have a bio-based content of 81% and 56%, respectively. They give impressive performance in a range of applications, offering high transparency and clarity, and low yellowing. They also have thermoplastic behaviour. How ultraviolet light curing is more sustainable When it comes to curing, UV light offers an environmentally friendly and efficient alternative for inks and coatings, heat sealable coatings, deep drawing, adhesives and 3D printing. Traditional printing inks contain solvents known as volatile organic compounds (VOCs), some of which can aggravate climate change, so the industry is trying to reduce them. As traditional curing is by evaporation, involving large ovens and a lot of time and energy, it is not environmentally friendly and often the solvent directly enters the atmosphere. In contrast, the UV curing process does not contain VOCs. UV rays initiate a chemical reaction that leads to an almost instant drying, or actually, curing of the liquid formulation into a solid state, without any need for water or solvents. “We want to help move the industry to sustainable curing,” says Lumber. “This could be going from a conventional solvent or water-based system to UV curing or producing sustainable products and better materials.” The benefits of UV curing UV curing units are small and compact. Their space-saving qualities lower production costs and energy consumption. Traditional mercury vapor UV lamps, whilst already more energy-efficient have been further improved with the introduction of LED UV technology. In fact, changing from mercury UV to LED UV can eliminate 7 tons of CO2 and give a 46% energy saving on an average printing press. UV curing results in a lower ink deposit and higher ink mileage. As UV inks are 100% solid, you can put less ink on the substrate compared with solvent or water-based inks. The result is a smaller dot and improved dot definition, resulting in a better-quality print. RAHN combines high-quality products, innovative expertise and comprehensive services to offer its customers tailor-made, integrated, sustainable solutions. “UV inks and coatings can be used to protect products and increase their life.”, says Lumber, “if you’re going to produce something, you want to produce it in a low-energy way, and you want to increase sustainable performance, because by extending the life of a product, you’re automatically improving its sustainability,”. To summarise the advantages of UV curing include: Higher production speeds No need to burn methane gas for ovens High and consistent quality of products Reduction of waste to landfill Lower pollution Conservation of natural resources A one-component system for easy handling Can be used in 3D printing, coatings, adhesives and electronics Are you ready to take your understanding of sustainability of UV curable inks and coatings to the next level? Explore fresh perspectives and actionable insights that can drive real change in your business practices and join Rahn on February 8th at 3pm London \/ 10am New York for an engaging webinar that promises to illuminate the path toward a more sustainable future.","filter_flag":1}
{"title":"Ericsson's sustainable waste management business venture - Sustainability Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL3RlY2gtYWkvZXJpY3Nzb25zLXN1c3RhaW5hYmxlLWUtd2FzdGUtbWFuYWdlbWVudC1idXNpbmVzcy12ZW50dXJl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL3RlY2gtYWkvZXJpY3Nzb25zLXN1c3RhaW5hYmxlLWUtd2FzdGUtbWFuYWdlbWVudC1idXNpbmVzcy12ZW50dXJl0gEA?oc=5","id":"CBMiX2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL3RlY2gtYWkvZXJpY3Nzb25zLXN1c3RhaW5hYmxlLWUtd2FzdGUtbWFuYWdlbWVudC1idXNpbmVzcy12ZW50dXJl0gEA","guidislink":false,"published":"Sat, 11 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=315, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL3RlY2gtYWkvZXJpY3Nzb25zLXN1c3RhaW5hYmxlLWUtd2FzdGUtbWFuYWdlbWVudC1idXNpbmVzcy12ZW50dXJl0gEA?oc=5\" target=\"_blank\">Ericsson's sustainable waste management business venture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sustainability Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ericsson's sustainable waste management business venture - Sustainability Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vc3VzdGFpbmFiaWxpdHltYWcuY29tL3RlY2gtYWkvZXJpY3Nzb25zLXN1c3RhaW5hYmxlLWUtd2FzdGUtbWFuYWdlbWVudC1idXNpbmVzcy12ZW50dXJl0gEA?oc=5\" target=\"_blank\">Ericsson's sustainable waste management business venture<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sustainability Magazine<\/font>","source.href":"https:\/\/sustainabilitymag.com","source.title":"Sustainability Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"What is Ericsson doing to reduce waste in landfills, and how does this play into net zero strategy? As the world grapples with the reality of an annual global production of 2 billion tonnes of municipal solid waste (MSW), we must explore solutions that mitigate this challenge and extend to waste that proliferates daily. Ericsson is actively reducing waste in landfills through its end-to-end solution that digitalises and connects the reverse supply chain, Ericsson Connected Recycling (ECR). This platform digitalizes the physical waste flows to promote circularity, reduce carbon emissions, and preserve raw materials. While initially targeting PET, OCC, organic and e-waste, the aim is to expand to any waste stream. Our approach empowers FMCG retailers to achieve three critical areas: comply with regulations, generate new revenue streams, and strive to reach zero waste. Initial pilots have demonstrated a remarkable 40% reduction in waste volumes for a major retailer and the inclusion of three materials into circular material flows. This approach significantly reduces landfill waste and aligns with our net-zero strategy, making a positive environmental impact while fostering sustainability. What are the obstacles in the supply chain that hinder recycling efforts, and how can ECR spot opportunities for retailers? Recycling is undeniably an effective means for managing waste, safeguarding our environment, and promoting societal well-being. However, within the industry lies several challenges that hinder its potential growth – primarily the lack of transparency and traceability. ECR offers a transformative solution by digitalising diverse waste ecosystems to create a transparent and interconnected platform that records each step of the recycling process. The platform can spot opportunities through: Real-time data on the location and status of materials, helping retailers identify bottlenecks or delays in the supply chain. on the location and status of materials, helping retailers identify bottlenecks or delays in the supply chain. Material tracking from disposal to their transformation into new products, enabling retailers to assess the efficiency of their recycling initiatives. from disposal to their transformation into new products, enabling retailers to assess the efficiency of their recycling initiatives. Regulatory compliance by providing a clear record of activities for reporting and legal requirements. by providing a clear record of activities for reporting and legal requirements. Revenue opportunities by connecting the buyers and sellers of waste and recycled materials, increasing material quantities and qualities on the market, to explore new monetisation opportunities. Overall, ECR empowers retailers to break down barriers, optimise their recycling efforts, and turn waste management into a sustainable and financially rewarding practice. What are the innovative approaches to waste management in the Middle East and Europe – and what can we learn from those on a global scale? In the Middle East and Europe, innovative approaches to waste management have emerged, offering valuable lessons on a global scale. Currently, waste management in Europe is locked into the hands of a few major players, given the regulatory environment. The region places more emphasis on a circular economy and strategies like community-based recycling and advanced sorting techniques. However, in the Middle East, approaches are centred around recognising the intrinsic value of raw materials within waste. By understanding that waste is a resource, not a problem, they’ve pioneered waste-to-value initiatives. This fundamental shift in mindset offers more flexibility and potential for new opportunities. There is also a valuable lesson to be learned by going back to basics. Globally, adopting circular design principles, enhancing transparency, and shifting to a waste-to-profit approach could be the key to major players achieving zero waste and a more sustainable future. What is the power of digitalisation\/connectivity in transforming the recycling industry and pioneering circularity? The potential of digitalisation in revolutionising the industry and championing circularity is profound. Digitalisation provides the ability to track and trace waste materials in real time, monitoring their transformation into new products. This transparency reduces inefficiencies, bottlenecks, and supply chain delays, enhancing recycling initiatives and helping businesses comply with regulations through clear records. It also allows organisations to explore new revenue opportunities by assessing the value of their waste. These digital and connectivity tools help transition the recycling industry towards a circular economy, where waste is viewed as a valuable resource. Circularity serves as a guiding principle in our pursuit of sustainability and a greener future. So addressing the world’s ever-growing waste problem through the digitalisation of reverse supply chains is paramount as we work to address the world’s growing waste problem. What top tips would you give to businesses looking to improve their recycling strategy? Businesses have the ability to significantly elevate their recycling strategies by transitioning from linear-consumption models of extraction, consumption and disposal to one focused on creating responsibility through value chain collaboration. There are a number of ways to improve your strategy, but consider embracing digitalization, fostering industry collaborations and a culture that allows for transparency and traceability. Adopting new approaches could enable businesses to streamline recycling processes, reduce waste, and contribute in a meaningful way to mitigating current waste challenges. It’s important to recognize the collective role we play in building a sustainable future. Together, we hold the key to achieving net zero objectives. ************************************************* For more insights into Sustainability - check out the latest edition of Sustainability Magazine and be sure to follow us on LinkedIn & Twitter Other magazines that may be of interest - EV Magazine | Energy Digital ********************************************* Net Zero LIVE will be hosted live from the QEII Centre, London on the 6th and 7th of March, and streamed globally via our virtual event platform Brella. Net Zero LIVE London will feature four LIVE themes, incorporating Sustainability LIVE, EV LIVE, Scope 3 LIVE, and Energy LIVE to deliver a holistic conference and exhibition experience with opportunities to connect with like-minded peers and actively contribute to crafting a sustainable future. Following Net Zero LIVE, viewers can also sign up for Sustainability LIVE Dubai and Singapore. Sign up to the The Global Sustainability & ESG Awards 2024, coming to London on the 11th September 2024. ********************************************* BizClik is a global provider of B2B digital media platforms that cover 'Executive Communities' for CEO's, CFO's, CMO's, Sustainability Leaders, Procurement & Supply Chain Leaders, Technology & AI Leaders, Cyber Leaders, FinTech & InsurTech Leaders as well as covering industries such as Manufacturing, Mining, Energy, EV, Construction, Healthcare + Food & Drink. BizClik, based in London, Dubai & New York offers services such as Content Creation, Advertising & Sponsorship Solutions, Webinars & Events.","filter_flag":1}
{"title":"Creating solutions that flex: sustainability and the future of flexo - Labels and Labeling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3BsYXRlcy1wbGF0ZW1ha2luZy9jcmVhdGluZy1zb2x1dGlvbnMtZmxleC1zdXN0YWluYWJpbGl0eS1hbmQtZnV0dXJlLWZsZXhv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3BsYXRlcy1wbGF0ZW1ha2luZy9jcmVhdGluZy1zb2x1dGlvbnMtZmxleC1zdXN0YWluYWJpbGl0eS1hbmQtZnV0dXJlLWZsZXhv0gEA?oc=5","id":"CBMid2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3BsYXRlcy1wbGF0ZW1ha2luZy9jcmVhdGluZy1zb2x1dGlvbnMtZmxleC1zdXN0YWluYWJpbGl0eS1hbmQtZnV0dXJlLWZsZXhv0gEA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3BsYXRlcy1wbGF0ZW1ha2luZy9jcmVhdGluZy1zb2x1dGlvbnMtZmxleC1zdXN0YWluYWJpbGl0eS1hbmQtZnV0dXJlLWZsZXhv0gEA?oc=5\" target=\"_blank\">Creating solutions that flex: sustainability and the future of flexo<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Creating solutions that flex: sustainability and the future of flexo - Labels and Labeling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3BsYXRlcy1wbGF0ZW1ha2luZy9jcmVhdGluZy1zb2x1dGlvbnMtZmxleC1zdXN0YWluYWJpbGl0eS1hbmQtZnV0dXJlLWZsZXhv0gEA?oc=5\" target=\"_blank\">Creating solutions that flex: sustainability and the future of flexo<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","source.href":"http:\/\/www.labelsandlabeling.com","source.title":"Labels and Labeling","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Sustainability ranks among top purchase decisions and is now an imperative Seven of 10 millennials have switched products due to sustainability concerns, and half of all consumers have changed food brands based on ESG concerns states the 2023 US Brand Sustainability Benchmark Report. Furthermore, the SEC is now requiring public companies to report Scope 3 emissions, those that come from a company’s supply chain. Companies like Wal-Mart, Nestle and Tyson have made drastic changes in their packaging. What can we do to ‘be the change’ required in the flexo industry? In the graphics packaging industry, MacDermid Graphics Solutions is a leader in innovation. With global patents and trademarks, the company’s research and development drive flexographic printing forward. Printers turn to MacDermid Graphics Solutions to ensure the expectations and demands of brand owners are met for every print job they deliver. Sustainability is a critical aspect of the supply chains the company participates in and is a key focus for both its business and its customers. MacDermid Graphics Solutions is focused on growth through sustainable chemistry, investments in equipment and plant infrastructure, as well as renewable sustainable materials. Sustainable chemistry Investigating renewable alternatives for plate products that reduce or eliminate solvents such as liquid and thermal platemaking continue to drive innovation. MacDermid Graphics Solutions is the only plate manufacturer that offers complete lines of both photopolymer sheet and liquid products. Liquid platemaking has a significant number of environmental advantages. For instance, In-Position Plates use 50 percent less photopolymer and weigh 70-80 percent less than solvent sheet plates, which can make a big impact in terms of plant safety and shipping costs. Everything makes a difference. Reviewing plate packaging and standardizing reusable shipping crates saves costs and materials. Watermarking is another impactful technology. For example, Digimarc's digital watermark technology is currently utilized in the Holy Grail 2.0 initiative being tested in Europe today. Investments in equipment and plant infrastructure A new state-of-the-art 100-foot photopolymer plate production line is coming online in Q4 2023. This is after significant qualification work to ensure that the product matches the same high-quality standards that MacDermid Graphics Solutions’ customers have come to expect from its parallel operation in Morristown, Tennessee. The new line located in Wigan, United Kingdom improves logistics and supply chain for customers in the EMEA region. The investment includes a new 2,800 SQM warehouse which has solar panels on the roof. The panels provide additional green energy to the site, which is already supplied with electricity from 100 percent renewable sources. Electric vehicle charging points have been installed outside the warehouse to support lower emission distribution in the future too. A fully equipped quality and development laboratory containing the latest flexo plate production equipment and supporting technologies is also near completion in the UK. The facility also uses electricity from 100 percent renewable sources. Joining forces with sustainability partners provides support for the entire flexo industry. The Consortium for Waste Circularity focuses on alternative means for repurposing printing waste including plates, blotter, substrate, etc. The pursuit of robust and flexible waste conversion solutions through education, research and outreach requires long-term solutions and need major investment from third party industry to deliver. We all can help sustain these important initiatives. MacDermid Graphics Solutions is a founding partner of The Flexo Xperience Center (FXC). The FXC moves flexo forward through industry collaboration, research, experimentation, and training, driving innovation throughout the printing process. The 32,000 sqft global center is a space that advances emerging technology projects in collaboration with over 35 co-suppliers. The FXC enables innovation and collaboration, granting hands-on access to the latest in flexo technology. The center supports capability for investing in research for optimizing use of recycled films for flexible package printing, or other alternatives such as transitioning print work from film to paper-based substrates and optimizing water-based ink printing technologies which includes plate selection. Converting flexographic plates into renewable sustainable material. MacDermid Graphics Solutions has developed a new process to recycle flexographic printing plates. This patent-pending technology called PlateCycle will start trials in North America by the end of this year. ‘Over 20 million lbs. of flexographic plates end up landfilled or used in waste-to-energy processes every year in the US alone. This compelled us to develop our own technology to expedite a renewable and sustainable way to eliminate this waste by focusing on total reuse,’ said Ryan Vest, director of innovation at MacDermid Graphics Solutions (MGS). Actively managing environmental issues is the company’s responsibility as a good corporate citizen. It is committed to protecting our planet by combating climate change, including contributing to a lower-carbon future, and being responsible water and waste stewards. It is an all-encompassing effort which involves innovation, investment and collaboration with partners, customers, and the entire supply chain to make a difference. These are just a few ways that you can contribute too. Contact MacDermid Graphics Solutions to get involved. About MacDermid Graphics Solutions MacDermid Graphics Solutions, a division of Element Solutions Inc, is a global leader in the manufacturing of photopolymer plates and equipment used in flexographic printing. MacDermid Graphics Solutions delivers high-quality graphic capabilities for package printing. The company’s mission is to provide a world-class customer experience, while meeting flexographic printing plate needs with award-winning technology. This is achieved through creating strategic value for its customers from start to finish. The company is an open provider and offers the best possible solutions via industry partnerships.","filter_flag":1}
{"title":"Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes - Yahoo Movies Canada","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5","id":"CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5\" target=\"_blank\">Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Movies Canada<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes - Yahoo Movies Canada","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5\" target=\"_blank\">Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Movies Canada<\/font>","source.href":"https:\/\/ca.movies.yahoo.com","source.title":"Yahoo Movies Canada","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"IF THE SHOE FITS: Recyclable footwear brand Rothy’s has appointed James Rogers as vice president of sustainability. Rogers will join the San Francisco-based company from The RealReal, where he has held the director of sustainability post since 2020. Prior to The RealReal, he held senior sustainability positions as The North Face, JCR Consulting and served as an adviser to VC fund Alante Capital, whose clients include the clothing brand Everlane. More from WWD Rogers will focus on accelerating Rothy’s circular economy initiatives, and use his manufacturing background to work to reduce the company’s environmental impact across its entire supply chain. “Under James’ leadership, Rothy’s will continue to push the boundaries of what is possible in sustainable fashion. We are committed to using recycled materials, reducing our environmental impact and creating a more sustainable future for our planet. I am confident that James’ appointment will help Rothy’s to remain a leader in sustainable fashion and to inspire others to follow suit,” said chief executive officer Stephen Hawthornthwaite. “From minimizing waste to enhancing energy efficiency to exploring new circular business models that extend the lifespan of their products, I’m eager to collaborate with stakeholders across the value chain to drive meaningful change. Rooted in sustainability from its inception, I firmly believe that Rothy’s is uniquely positioned to continue making a significant and lasting difference in the fashion industry at scale,” Rogers said. In February, the company’s wholly owned and operated factory in China became both LEED and TRUE Zero Waste certified. The direct-to-consumer brand makes shoes out of discarded plastic bottles and uses a 3D knitting process to eliminate waste in the production cycle. In 2022, the seven-year-old company launched a take-back program through its retail outlets, which then disassembles the shoe, sorts by material and recycles the components into new products. The company operates 18 stores in the U.S. A June 2023 photo of recently felled rainforest trees in Aceh province, Indonesia. BIOMASS DELUSION: Stand Earth’s latest report sheds unfavorable light on the fashion industry’s switch to burning biomass, which is billed as a renewable energy source by many brands that are seeking alternatives to coal and fossil fuels. The advocacy group’s report, titled Biomass Burning: The Fashion Industry’s False Phase-Out,” notes that using biomass — often wood pellets — increases deforestation and delays the switch to renewable sources such as solar and wind. Other materials burned can include what are billed as “green alternatives,” including rice husks, straw and palm shells. Biomass has been used widely across the fashion industry to knock down carbon emissions numbers, the report said. Contrary to intent, burning biomass can increase greenhouse gas and carbon emissions in a company’s supply chain, according to the report. The report does a deep dive into the supply chains and manufacturing lists of Uniqlo parent company Fast Retailing, Gap, H&M, Zara parent company Inditex, Nike and Puma that are touting biomass as a low-carbon alternative in the dyeing and finishing process. In an email to Stand Earth, Fast Retailing acknowledged that they “recognize the issue of biomass boilers and are currently acting across [its] supply chain to minimize their use.” The company added it plans to “take immediate action with [its] production partners, including a review of the use of these boilers with serious impacts.” Inditex said it sees “biomass as a transition solution as other alternatives are developed and scaled.” The fashion companies are increasingly using biomass as an alternative to coal throughout Asian factories, including Cambodia, China, India, Indonesia, Pakistan, South Korea, Taiwan, Thailand and Vietnam. Using the example of Cambodia, Stand Earth noted that roughly one-third of the 1,200 garment factories there burn 620 tons of forest wood every day, according to a 2021 study from the University of London. “The bottom line is that there’s no such thing as ‘sustainable biomass,’” said Stand Earth research specialist Xixi Zhang, who headed up the report. “The increased reliance on biomass boilers poses severe threats to our climate, ecosystems and human health, all while hindering the industry’s essential shift to renewable energy in Asia.” Best of WWD","filter_flag":1}
{"title":"One Water uses QR codes to incentivize recycling - Labels and Labeling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3N1c3RhaW5hYmlsaXR5L29uZS13YXRlci11c2VzLXFyLWNvZGVzLWluY2VudGl2aXplLXJlY3ljbGluZ9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3N1c3RhaW5hYmlsaXR5L29uZS13YXRlci11c2VzLXFyLWNvZGVzLWluY2VudGl2aXplLXJlY3ljbGluZ9IBAA?oc=5","id":"CBMiaWh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3N1c3RhaW5hYmlsaXR5L29uZS13YXRlci11c2VzLXFyLWNvZGVzLWluY2VudGl2aXplLXJlY3ljbGluZ9IBAA","guidislink":false,"published":"Thu, 23 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=23, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=327, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3N1c3RhaW5hYmlsaXR5L29uZS13YXRlci11c2VzLXFyLWNvZGVzLWluY2VudGl2aXplLXJlY3ljbGluZ9IBAA?oc=5\" target=\"_blank\">One Water uses QR codes to incentivize recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"One Water uses QR codes to incentivize recycling - Labels and Labeling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL2V1cm9wZS9uZXdzL3N1c3RhaW5hYmlsaXR5L29uZS13YXRlci11c2VzLXFyLWNvZGVzLWluY2VudGl2aXplLXJlY3ljbGluZ9IBAA?oc=5\" target=\"_blank\">One Water uses QR codes to incentivize recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","source.href":"http:\/\/www.labelsandlabeling.com","source.title":"Labels and Labeling","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Recycling tech company Polytag has partnered with One Water, one of the leading ethical hydration brands in the UK, to introduce unique QR codes printed onto selected products to incentivize recycling and provide invaluable insight into the lifecycle of the brand’s packaging. The collaboration, which follows Polytag’s successful partnerships with some of the biggest UK-based supermarkets, including Ocado, Co-op and Aldi, will provide One Water with a versatile marketing tool and set the stage for a new approach to traceability. When consumers scan Polytag’s GS1 Digital Link QR codes, they will be transported to the One Water website, which is dedicated to the company’s philanthropic activities. The discreetly placed QR codes enable One Water to take a step towards ensuring that its bottles can be traced through the supply chain. Polytag technology provides lifecycle data that can help inform a sustainability strategy, inspire new campaigns and make recycling even more rewarding for customers. Polytag technology also delivers an opportunity to improve the understanding of where products are purchased, consumed, and disposed of and how each person interacts with the packaging. While standard QR codes simply direct to a webpage, Polytag’s technology delivers numerous additional benefits to brands and retailers. Alongside the marketing opportunities, the company’s tags can be read throughout the supply chain, from POS to the recycling center. Alice Rackley, CEO of Polytag, commented, ‘This collaboration with One Water represents a significant milestone in leveraging technology for brand promotion while contributing to the betterment of society. ‘Through this initiative, we aim to redefine the way customers engage with brands and their stories. Our QR codes offer hyper-relevant content about the product the customer is holding, something no other QR code can do right now.’ Duncan Goose, founder of One Water, added, ‘We’re excited to embark on this journey with Polytag. Its QR-based technology enables our customers to connect with us and learn more about what we do while providing us with additional insights and opportunities to reduce our impact and future-proof our brand. This partnership further reinforces our commitment to being the UK’s leading ethical hydration brand.’","filter_flag":1}
{"title":"Winners of the Sustainable Beauty Awards 2023 unveiled in Paris - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi93aW5uZXJzLW9mLXRoZS1zdXN0YWluYWJsZS1iZWF1dHksMjI5MjXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi93aW5uZXJzLW9mLXRoZS1zdXN0YWluYWJsZS1iZWF1dHksMjI5MjXSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi93aW5uZXJzLW9mLXRoZS1zdXN0YWluYWJsZS1iZWF1dHksMjI5MjXSAQA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi93aW5uZXJzLW9mLXRoZS1zdXN0YWluYWJsZS1iZWF1dHksMjI5MjXSAQA?oc=5\" target=\"_blank\">Winners of the Sustainable Beauty Awards 2023 unveiled in Paris<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Winners of the Sustainable Beauty Awards 2023 unveiled in Paris - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi93aW5uZXJzLW9mLXRoZS1zdXN0YWluYWJsZS1iZWF1dHksMjI5MjXSAQA?oc=5\" target=\"_blank\">Winners of the Sustainable Beauty Awards 2023 unveiled in Paris<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"SUSTAINABLE BEAUTY AWARDS 2023 New Sustainable Product Award Weleda is winner with Skin Food Facial Cleansing Balm. Launched in 2022, the organic skin care product contains natural extracts and is UEBT and Natrue certified, as well as certified climate-neutral. Apivita is runner-up with Beevine Elixir Wrinkle & Firmness Lift Cream Light Texture, containing upcycled vine leaves and propolis. Sustainable Ingredient Award New Zealand’s Organic Bioactives is winner with OceanDerMX Lift & Firm Freeze Dried, Preservative Free. The skin care active contains organic botanical ingredients that are harvested by indigenous Māori women. It is produced using green extraction technology. And Taiwan-based ITRI is runner-up with I-Proteo, a new ingredient made by upcycling pineapple leaves. Sustainable Packaging Award The winner is DTS Europe with its Pacific pump. Launched in June 2023, the mono-material pump enables the entire packaging to be recycled without being dismantled. The pump can be used for skin care products and colour cosmetics. MacroHI is runner-up with its recycled HDPE packaging for its Aromase and juliArt beauty products. Sustainability Pioneer Award The joint winners are AAK Personal Care and Weleda. AAK Personal Care gets recognition for its direct impact partnerships with suppliers, industry organisations, and social enterprises. Weleda receives accolade for the sustainability of its new logistics centre in Schwäbisch Gmünd, Germany. It is certified platinum by the German Sustainable Building Council. The runner-up is O’ right which gets recognition for its net zero carbon emissions over several years. Sustainability Leadership Award Taiwan’s O’ right is the winner for its great sustainability endeavours. Apart from being a carbon-neutral organisation, the natural hair care company is using green electricity, sustainable packaging, and has developed formulations using upcycled and \/ or natural ingredients. Austrian natural cosmetics and supplements company Ringana is runner-up. ","filter_flag":1}
{"title":"Braskem launches first EVA grades with recycled raw material for footwear and sporting goods markets in Brazil - Braskem","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5icmFza2VtLmNvbS5ici93ZW5ldy9uZXdzLWRldGFpbC9icmFza2VtLWxhdW5jaGVzLWZpcnN0LWV2YS1ncmFkZXMtd2l0aC1yZWN5Y2xlZC1yYXctbWF0ZXJpYWwtZm9yLWZvb3R3ZWFyLWFuZC1zcG9ydGluZy1nb29kcy1tYXJrZXRzLWluLWJyYXppbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5icmFza2VtLmNvbS5ici93ZW5ldy9uZXdzLWRldGFpbC9icmFza2VtLWxhdW5jaGVzLWZpcnN0LWV2YS1ncmFkZXMtd2l0aC1yZWN5Y2xlZC1yYXctbWF0ZXJpYWwtZm9yLWZvb3R3ZWFyLWFuZC1zcG9ydGluZy1nb29kcy1tYXJrZXRzLWluLWJyYXppbNIBAA?oc=5","id":"CBMimwFodHRwczovL3d3dy5icmFza2VtLmNvbS5ici93ZW5ldy9uZXdzLWRldGFpbC9icmFza2VtLWxhdW5jaGVzLWZpcnN0LWV2YS1ncmFkZXMtd2l0aC1yZWN5Y2xlZC1yYXctbWF0ZXJpYWwtZm9yLWZvb3R3ZWFyLWFuZC1zcG9ydGluZy1nb29kcy1tYXJrZXRzLWluLWJyYXppbNIBAA","guidislink":false,"published":"Tue, 14 Nov 2023 18:26:26 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=18, tm_min=26, tm_sec=26, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5icmFza2VtLmNvbS5ici93ZW5ldy9uZXdzLWRldGFpbC9icmFza2VtLWxhdW5jaGVzLWZpcnN0LWV2YS1ncmFkZXMtd2l0aC1yZWN5Y2xlZC1yYXctbWF0ZXJpYWwtZm9yLWZvb3R3ZWFyLWFuZC1zcG9ydGluZy1nb29kcy1tYXJrZXRzLWluLWJyYXppbNIBAA?oc=5\" target=\"_blank\">Braskem launches first EVA grades with recycled raw material for footwear and sporting goods markets in Brazil<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Braskem<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Braskem launches first EVA grades with recycled raw material for footwear and sporting goods markets in Brazil - Braskem","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5icmFza2VtLmNvbS5ici93ZW5ldy9uZXdzLWRldGFpbC9icmFza2VtLWxhdW5jaGVzLWZpcnN0LWV2YS1ncmFkZXMtd2l0aC1yZWN5Y2xlZC1yYXctbWF0ZXJpYWwtZm9yLWZvb3R3ZWFyLWFuZC1zcG9ydGluZy1nb29kcy1tYXJrZXRzLWluLWJyYXppbNIBAA?oc=5\" target=\"_blank\">Braskem launches first EVA grades with recycled raw material for footwear and sporting goods markets in Brazil<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Braskem<\/font>","source.href":"https:\/\/www.braskem.com.br","source.title":"Braskem","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Braskem launches first EVA grades with recycled raw material for footwear and sporting goods markets in Brazil To increasingly develop innovative and sustainable solutions that promote the circular economy across industry, Braskem has launched this month two new EVA solutions produced from recycled raw material. The new compounds are part of the Wenew portfolio, Braskem's circularity ecosystem, and are the first products of this type to be launched by the Company in the market, consolidating its pioneering role in the sector. The two new grades offer benefits to the footwear and sporting goods sectors by bringing new and more sustainable options to the industry. These are produced from surplus scraps from the footwear industry, which enables this solid waste to be used adequately to create new products. Moreover, these two solutions give finished products greater mechanical resistance during physical efforts, which translates to quality, innovation and sustainability. One of the grades can be applied to sheets making up the tatami mats used in gyms, insoles of sneakers and yoga mats, while the other is injected into the midsole and outsole of shoes. The latter is produced from recycled raw material and contains 30% renewable resin obtained from sugarcane (renewable-origin EVA), which, depending on the final composition of the product, could contribute to a carbon-neutral solution or with near-zero emissions. For Fabiana Quiroga, Executive Officer - Circular Economy at Braskem in South America, the launch of new grades is aligned with the Company's commitments to sustainability. \"By 2030, Braskem's goal is to include 1 million tons of thermoplastic resins and chemical products with recycled content in its product portfolio, and to prevent 1.5 million tons of plastic waste from being sent to incineration or landfills or from being discarded in the environment\", she said. \"The new solutions will also contribute to the ESG journey of our partners as they offer clients, manufacturers and brand owners the opportunity for more sustainable development, resulting in less carbon emissions compared to resins of fossil origin\". Correctly addressing industrial waste from the footwear and sporting goods sectors to create high performance solutions in the market was a challenging mission. Juliani Capra da Silva, Application Engineer at Braskem, highlights the company's contribution to sustainability in these sectors based on these new solutions. \"Braskem has been working hard to drive all the links across the chain towards the circular economy. All these efforts and Braskem's pioneering spirit enabled us to develop the first recycled EVA grades in Brazil\", she said. \"What we are doing differently and innovatively is that we were are collecting the surplus EVA waste discarded by companies and transforming it into raw material for manufacturing new products, especially footwear, with less CO 2 emissions, while dealing with the challenge of sending to the right place waste that is difficult to allocate\". Note that both grades have the same technical properties as fossil-origin products, but with the positive attribute of reintegrating plastic waste into the production chain, thus preventing it from reaching nature.","filter_flag":1}
{"title":"ABB Capital Markets Day 2023: Setting new standards - ABB","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTEwMDk3L2FiYi1jYXBpdGFsLW1hcmtldHMtZGF5LTIwMjMtc2V0dGluZy1uZXctc3RhbmRhcmRz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTEwMDk3L2FiYi1jYXBpdGFsLW1hcmtldHMtZGF5LTIwMjMtc2V0dGluZy1uZXctc3RhbmRhcmRz0gEA?oc=5","id":"CBMiWWh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTEwMDk3L2FiYi1jYXBpdGFsLW1hcmtldHMtZGF5LTIwMjMtc2V0dGluZy1uZXctc3RhbmRhcmRz0gEA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTEwMDk3L2FiYi1jYXBpdGFsLW1hcmtldHMtZGF5LTIwMjMtc2V0dGluZy1uZXctc3RhbmRhcmRz0gEA?oc=5\" target=\"_blank\">ABB Capital Markets Day 2023: Setting new standards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABB<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ABB Capital Markets Day 2023: Setting new standards - ABB","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vbmV3LmFiYi5jb20vbmV3cy9kZXRhaWwvMTEwMDk3L2FiYi1jYXBpdGFsLW1hcmtldHMtZGF5LTIwMjMtc2V0dGluZy1uZXctc3RhbmRhcmRz0gEA?oc=5\" target=\"_blank\">ABB Capital Markets Day 2023: Setting new standards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABB<\/font>","source.href":"https:\/\/new.abb.com","source.title":"ABB","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Future focus on consistency in operating model, accelerating growth and continuous improvements Upgraded target for long-term comparable revenue growth to 5-7% Increased target for Operational EBITA margin target to 16-19% More ambitious 2030 and 2050 science-based net-zero targets ABB is hosting its Capital Markets Day today at its Electrification site in Frosinone, Italy. At the event, CEO Björn Rosengren, CFO Timo Ihamuotila, as well as the Presidents of ABB’s four business areas will give an update on ABB’s successful transformation, financial targets and how the company will benefit from key secular trends across its business areas. In addition, ABB’s Group Head of Sustainability will provide an update on the company’s sustainability agenda, including more ambitious 2030 and 2050 net-zero targets. Björn Rosengren said: “During the transformation period over the past three years, we aligned the ABB business portfolio to our purpose of enabling a more sustainable and resource-efficient future through our technology leadership in electrification and automation. We have achieved strong improvements in financial and sustainability performance during this phase, supported by increased accountability, transparency and speed thanks to our ABB Way operating model. “Having set new standards, we are now coming out of this transformation period, and the majority of our divisions have progressed towards a strategic growth mandate. They now focus on capturing the full potential of what in my view is a market sweet spot, at the heart of the transition towards electrification, energy security, energy efficiency, automation and digitalization. Achieving our previous margin target a year earlier than planned, and being a more agile unit with fast decision-making gives us the confidence to formulate stronger ambitions and lift our margin target. I am convinced that ABB is extremely well positioned – now and in future.” Higher ambitions following transformation phase As part of its updated financial framework, ABB is lifting its comparable revenue growth target to 5-7 percent through the economic cycle (from 3-5 percent previously). The target for acquired growth remains unchanged at 1-2 percent. The company is also raising its target for annual operational EBITA margin to 16-19 percent (from ≥ 15 percent previously) and updating its annual ROCE target to >18 percent (from 15-20 percent previously). In addition, the company is sharpening its objective for basic EPS growth through the economic cycle to at least high single-digit (from Basic EPS growth > revenue growth previously). ABB is also confirming its target of ~100% free cash flow conversion to net income. The update in growth ambitions is based on both external and internal factors including accelerating demand for sustainability-driven electrification and automation solutions as the world moves towards common emissions targets aligned with the 1.5°C target. Additional support for higher growth is grounded in new ways of working with ABB’s divisions that are accountable for growth and decision-making closer to the market as well as a reshaped portfolio around sustainability and resource efficiency through electrification and automation. The Group has increased the share of its divisions that are in growth mode now comprising approximately 70 percent of the Group’s revenues. The focus is on both organic growth, as well as M&A opportunities that can fill technology gaps, complement divisions’ offering for high growth markets, provide access to new geographies or enable market consolidation. ABB is aiming at 5 to 10 small to mid-size bolt-on acquisitions per year. Returns and cash generation driven by growth ambitions Timo Ihamuotila said: “We expect that our higher growth will also lead to higher profitability and cash generation. As a lever to reaching our new financial targets, we are taking the next step on our journey towards further improved quality of our revenues as well as capital efficiency and productivity. At the same time our capital allocation priorities remain unchanged.” ABB will also continue to invest in digital where it creates synergies with the company’s offering. As of 2022, approximately 57 percent of orders were related to the software and digitally enabled offering. Approximately 60 percent of R&D resources are focused on digital solutions which the company will continue to strengthen with bolt-on acquisitions. Between 2020 and 2023 ABB made 26 venture investments in the areas of technology and digital. ABB is reiterating its target of maintaining a strong investment grade rating. Its capital allocation principles remain unchanged: funding organic growth through research & development, channel and capex investments; paying a rising, sustainable dividend per share over time; executing value-creating acquisitions; and when applicable returning additional cash to shareholders through share buybacks. In the past 10 years ABB has returned more than $28 billion to shareholders – either via dividends or share buybacks. Sustainability: Ambitious 2030 and 2050 science-based net-zero targets ABB’s technologies are supporting all relevant sectors to optimize, electrify and decarbonize, enabling the energy transition to a net-zero future. In line with this mission, the company is today providing an update on how it is strengthening and accelerating its sustainability agenda with new targets and ambitions. Björn Rosengren said: “At ABB we have been enabling energy efficiency and electrification for over 140 years. Today, we are putting our leading technologies in electrification, automation, and digitalization to work to accelerate the energy transition. Our sustainability agenda is fully aligned with this mission. It focuses on enabling a low-carbon society, preserving resources, and promoting social progress in collaboration with our customers, suppliers, and partners.” ABB is taking a rigorous science-based net-zero targets approach in line with the net-zero standard of the Science Based Targets initiative (SBTi). The company has submitted its new targets to SBTi with validation expected in 2024. These include 1.5°C-aligned Scope 1 and 2 targets aiming at a CO 2 e emissions reduction of 80 percent by 2030 and 100 percent by 2050 versus a 2019 baseline. On a 12-month rolling average, ABB has now achieved a 72 percent reduction in Scopes 1 and 2 CO 2 e emissions versus 2019. Additionally, the company has set new Scope 3 CO 2 e emissions targets aiming at a reduction of 25 percent by 2030 and 90 percent by 2050 versus a 2022 baseline. With this more stringent approach, ABB is moving away from former carbon neutrality targets, which included the use of carbon offsets. Following the latest WBCSD avoided emissions guidance, ABB has also updated its ambition in this area and aims to enable its customers to avoid 600 megatons of CO 2 e emissions through products sold from 2022 to 2030. ABB helped its customers avoid 70 Mt of CO 2 e in 2022, across industry, transportation, buildings, data centers, and more. Note to editors: The Capital Markets Day can be followed on the ABB Investor Relations website from 8am CET today via the following link: https:\/\/capitalmarketsday.abb.com\/ Further details on ABB’s sustainability agenda can be found at https:\/\/global.abb\/group\/en\/sustainability ABB is a technology leader in electrification and automation, enabling a more sustainable and resource-efficient future. The company’s solutions connect engineering know-how and software to optimize how things are manufactured, moved, powered and operated. Building on more than 140 years of excellence, ABB’s ~105,000 employees are committed to driving innovations that accelerate industrial transformation. www.abb.com Important notice about forward-looking information This press release includes forward-looking information and statements which are based on current expectations, estimates and projections about the factors that may affect our future performance, including the economic conditions of the regions and industries that are major markets for ABB. These expectations, estimates and projections are generally identifiable by statements containing words such as “anticipates”, “expects,” “believes,” “estimates,” “plans”, “targets”, “aims” or similar expressions. However, there are many risks and uncertainties, many of which are beyond our control, that could cause our actual results to differ materially from the forward-looking information and statements made in this press release and which could affect our ability to achieve any or all of our stated targets or anticipated transactions. Some important factors that could cause such differences include, among others, business risks associated with the volatile global economic environment and political conditions, costs associated with compliance activities, market acceptance of new products and services, changes in governmental regulations and currency exchange rates and such other factors as may be discussed from time to time in ABB Ltd’s filings with the U.S. Securities and Exchange Commission, including its Annual Reports on Form 20-F. Although ABB Ltd believes that its expectations reflected in any such forward-looking statement are based upon reasonable assumptions, it can give no assurance that those expectations will be achieved. The foregoing list of factors is not exclusive and undue reliance should not be placed upon any forward-looking statements, including projections, which speak only as of the date made.","filter_flag":1}
{"title":"2024 aerospace and defense industry outlook - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvYWVyb3NwYWNlLWRlZmVuc2UvYWVyb3NwYWNlLWFuZC1kZWZlbnNlLWluZHVzdHJ5LW91dGxvb2suaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvYWVyb3NwYWNlLWRlZmVuc2UvYWVyb3NwYWNlLWFuZC1kZWZlbnNlLWluZHVzdHJ5LW91dGxvb2suaHRtbNIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvYWVyb3NwYWNlLWRlZmVuc2UvYWVyb3NwYWNlLWFuZC1kZWZlbnNlLWluZHVzdHJ5LW91dGxvb2suaHRtbNIBAA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvYWVyb3NwYWNlLWRlZmVuc2UvYWVyb3NwYWNlLWFuZC1kZWZlbnNlLWluZHVzdHJ5LW91dGxvb2suaHRtbNIBAA?oc=5\" target=\"_blank\">2024 aerospace and defense industry outlook<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2024 aerospace and defense industry outlook - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvYWVyb3NwYWNlLWRlZmVuc2UvYWVyb3NwYWNlLWFuZC1kZWZlbnNlLWluZHVzdHJ5LW91dGxvb2suaHRtbNIBAA?oc=5\" target=\"_blank\">2024 aerospace and defense industry outlook<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www2.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"1. Talent: A&D companies are addressing workforce challenges amid rising demand and changing workforce expectations The A&D industry is facing a new talent landscape that is mainly driven by increasing salary levels, increased employee mobility, a reevaluation of employee relationships with the workplace, and an intensely competitive job market. Evolving employee expectations, which have only amplified since the pandemic, have often made it challenging for A&D companies to attract, retain, and develop a skilled workforce. These workforce issues could prove to be a significant pain point for A&D companies as they begin to scale production operations to meet growing demand across the industry. Attracting talent The US A&D industry has surpassed prepandemic levels in terms of employment. In 2022, US-based A&D companies increased their workforce by 101,700 to 2.2 million, marking a 4.87% increase from 2021 and surpassing prepandemic 2019 levels of 2.18 million.3 Despite the rise in workforce numbers, A&D companies are likely to face talent shortages. These shortages may hamper production demands resulting from domestic travel increases and nations increasing their armament stockpiles. Currently, the industry is struggling to attract talent, ranging from technicians and manufacturers to engineers. One leading Asia-based engineering company noted that the shortage of technicians may lead to increased maintenance costs and impact fleet expansion forecasts.4 Furthermore, in the National Association of Manufacturers’ (NAM’s) 2023 third quarter manufacturers’ outlook survey, about three out of four surveyed US manufacturers stated that attracting and retaining a quality workforce is their primary business challenge.5 The manufacturing industry, including A&D manufacturing, is increasingly competing with other industries for skilled talent.6 A&D companies recognize this, as top talent with digital skills can be drawn to digital jobs within a multitude of areas, including automotive (for example, the battery electric vehicle and autonomous vehicle segments) and life sciences (for example, medical technology, and biotechnology). A&D companies may need to expand their strategies beyond compensation to accommodate the changing needs of the workforce. The US A&D industry has an annual average salary of US$108,900 which is approximately 55% above the national average.7 That said, many Gen Z employees are keen to have careers with broad impact and a purpose.8 These companies may attract talent with mission-focused marketing campaigns and undertake more strategic recruitment to ensure that the values of the employees and the company align. Retaining talent Despite a significant number of new hires, job openings in the manufacturing industry were still 604,000 in August 2023.9 Additionally, quits accounted for about 68% of total separations. To compete in a tightening labor market, A&D companies will likely address both talent attraction and, potentially more significantly, talent retention issues. The A&D industry has high requirements and expectations for its employees, including specific educational criteria and security clearances. This could necessitate a focus on retaining talent, especially with the increasing number of retirees. Historically, these companies have succeeded with a workforce that possesses deep experience and a strong connection to the company culture. Therefore, given the competitive state of the job market, it is important for the industry to retain highly qualified workers. A&D companies are using compensation and flexible work arrangements to enhance retention and turn the tide of employee attrition. This approach has been adopted by the manufacturing segment of the A&D industry where, according to Deloitte’s 2024 manufacturing industry outlook, there was a rise of 4% in the average hourly earnings of employees between the first quarter of fiscal year 2022 and the first quarter of fiscal year 2023. Additionally, the manufacturing industry has undergone a significant shift toward remote work over the last two years, during which there has been a 19% reduction in the average number of quits.10 The retention levels of A&D companies could plateau at a certain point if they continue to only offer flexibility benefits. According to the NAM’s 2023 second quarter manufacturers’ outlook survey, inflexible production, shift needs, and the creation of differences between workforce populations are some major challenges manufacturers face when offering such flexibility to workers.11 The industry will likely explore new avenues to both attract and retain talent. Pursuing and implementing emerging technology can help not only address profit margins, but also invigorate a workforce. Regardless of an employee’s job description, A&D companies may begin to consider initiating new programs that allow employees to engage with advanced technologies, which may include tech-based rotational programs or designated time to pursue passion projects within the company. Developing talent With an increasing number of retirements and an aging workforce (about 26% of the A&D workforce is over the age of 55),12 the industry should train younger professionals for long-term sustainable operations and security. A&D companies can upskill their workforce by developing more learning avenues in alignment with the technological evolution within the industry. These avenues may include: Working closely with colleges to create novel training and workforce development programs; Expanding internships, apprenticeships, and other career development initiatives; and Furthering cooperative research agreements with tier one research universities. Employees in the A&D sector, across all career levels, should be educated on the importance of cybersecurity and should possess a clear understanding of their specific responsibilities in upholding a secure environment.13 And in line with that, A&D companies’ workforce development strategies will not only attract and retain talent but can also help ensure a secure environment for them.","filter_flag":1}
{"title":"Fast Retailing transforms its business to balance sustainability with growth - Vietnam Investment Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vdmlyLmNvbS52bi9mYXN0LXJldGFpbGluZy10cmFuc2Zvcm1zLWl0cy1idXNpbmVzcy10by1iYWxhbmNlLXN1c3RhaW5hYmlsaXR5LXdpdGgtZ3Jvd3RoLTEwNjcyMC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vdmlyLmNvbS52bi9mYXN0LXJldGFpbGluZy10cmFuc2Zvcm1zLWl0cy1idXNpbmVzcy10by1iYWxhbmNlLXN1c3RhaW5hYmlsaXR5LXdpdGgtZ3Jvd3RoLTEwNjcyMC5odG1s0gEA?oc=5","id":"CBMia2h0dHBzOi8vdmlyLmNvbS52bi9mYXN0LXJldGFpbGluZy10cmFuc2Zvcm1zLWl0cy1idXNpbmVzcy10by1iYWxhbmNlLXN1c3RhaW5hYmlsaXR5LXdpdGgtZ3Jvd3RoLTEwNjcyMC5odG1s0gEA","guidislink":false,"published":"Fri, 10 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=314, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vdmlyLmNvbS52bi9mYXN0LXJldGFpbGluZy10cmFuc2Zvcm1zLWl0cy1idXNpbmVzcy10by1iYWxhbmNlLXN1c3RhaW5hYmlsaXR5LXdpdGgtZ3Jvd3RoLTEwNjcyMC5odG1s0gEA?oc=5\" target=\"_blank\">Fast Retailing transforms its business to balance sustainability with growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vietnam Investment Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fast Retailing transforms its business to balance sustainability with growth - Vietnam Investment Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vdmlyLmNvbS52bi9mYXN0LXJldGFpbGluZy10cmFuc2Zvcm1zLWl0cy1idXNpbmVzcy10by1iYWxhbmNlLXN1c3RhaW5hYmlsaXR5LXdpdGgtZ3Jvd3RoLTEwNjcyMC5odG1s0gEA?oc=5\" target=\"_blank\">Fast Retailing transforms its business to balance sustainability with growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vietnam Investment Review<\/font>","source.href":"https:\/\/vir.com.vn","source.title":"Vietnam Investment Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"There are eight brands under Fast Retailing’s management, namely UNIQLO, GU, Theory, PLST, Comptoir de Contonniers, Princesse tam.tam, J Brand, and Helmut Lang. The company is advancing its RE.UNIQLO initiative to promote the recycling or reuse of all UNIQLO products. Following the 2020 launch of its recycled down jacket, it has continued to pursue the development of additional clothing-to-clothing recycling products that use cashmere, wool, and cotton. Representatives on stage at the 2023 Fast Retailing Sustainability media briefing held on November 7 in Japan Koji Yanai, senior executive officer of Fast Retailing Group, said that the company takes responsibility for every LifeWear item it provides to customers. \"We are uncompromising, through product development, production, and post-sale, to ensure our products are used longer and with greater peace of mind. Together with our customers, local communities, and business partners, we continue to expand the possibilities of LifeWear, creating a business to enrich people's lives and societies around the world,\" Yanai said. UNIQLO launched its RE.UNIQLO initiative to promote the recycling or reuse of all its products. The UNIQLO Pre-Owned Clothes Project was piloted as part of this scheme. For the trial, a pop-up store selling used clothing was opened from October 11 to 22 at the UNIQLO Harajuku Store in Tokyo. Launched in September 2022 in London, the RE.UNIQLO STUDIO clothing repair and remake service has now expanded globally. Since September, the service has been available in 35 stores in 16 markets. Expanding its clothing-to-clothing recycling efforts, Fast Retailing is now developing new products using cashmere, wool, and cotton from UNIQLO products that are collected at stores. The company is working to establish a system for the end-to-end management of its supply chain, enabling it to directly apply quality, procurement, production, environmental, and workers rights standards across all stages of production. This includes specifying the raw materials and fabrics to use in the sewing stage right back to initial material procurement. Since the 2023 Spring\/Summer season, all UNIQLO products have been traceable back to raw material level. By August, the company identified spinning process suppliers to build trusted, long-term relationships for UNIQLO cotton products. Moving forward, Fast Retailing plans to extend a similar initiative for suppliers of all other materials. Fast Retailing's production bases are being diversified. Along with expanding production in its main manufacturing country of China, the proportion of items produced in Southeast Asia is also growing, with the domestic production rate in Indonesia and Vietnam surpassing 50 per cent. There are also plans to expand production in India, a growth area for the business. For greater visibility and control over raw material procurement, Fast Retailing is establishing a system to specify the production location and quality of raw materials at the planning stage, and to be able to trace these materials at any given time. Starting with cotton, it plans to expand this system to all materials. The business established a production partner code of conduct with the mills for UNIQLO cotton products in the spring of this year, and regular audits were introduced in August. Also, from August, UNIQLO and GU began disclosing sewing country information on the individual product pages on their online stores in select markets. By the end of FY\/2030, Fast Retailing has a target to reduce the greenhouse gas (GHG) emissions from the energy use at its facilities, including both stores and major offices, by 90 per cent compared to FY\/2019 levels. As of FY\/2022, the reduction stood at 45.7 per cent. Furthermore, it has a target of transitioning to totally renewable electricity at all Fast Retailing Group stores and offices worldwide by the end of FY\/2030. At the close of FY\/2022, this figure had reached 42.4 per cent. Targets have also been set to reduce GHG emissions related to raw material production, fabric making, and sewing for UNIQLO and GU products by 20 per cent by the end of FY\/2030. As of FY2022, the reduction was 6.2 per cent. Fast Retailing will continue to work closely with its partner factories on all these initiatives to achieve its targets. In terms of biodiversity initiatives, the group has published its Fast Retailing Group Biodiversity Conservation Policy. The company aims to achieve net positivity for biodiversity throughout its value chain over the long term. It has conducted qualitative and quantitative assessments of the biodiversity impacts and dependency risks in its value chain, identifying significant land-use impacts from cashmere, wool, and cotton production. For cashmere, Fast Retailing collaborated with researchers at the University of the Ryukyus in Japan, using satellite data to analyse the vegetation status at ranches supplying UNIQLO with cashmere. Sustainability Department personnel also visited the ranches to conduct field surveys. Regarding wool, plans are in place to replicate the efforts that have been made for cashmere, and with cotton, the applicability of renewable agriculture is being carefully studied.","filter_flag":1}
{"title":"Plans for Harry Styles's Pleasing, from new CEO Shaun Kearney - Vogue Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL2JlYXV0eS9wbGFucy1mb3ItaGFycnktc3R5bGVzcy1wbGVhc2luZy1mcm9tLW5ldy1jZW8tc2hhdW4ta2Vhcm5ledIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL2JlYXV0eS9wbGFucy1mb3ItaGFycnktc3R5bGVzcy1wbGVhc2luZy1mcm9tLW5ldy1jZW8tc2hhdW4ta2Vhcm5ledIBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL2JlYXV0eS9wbGFucy1mb3ItaGFycnktc3R5bGVzcy1wbGVhc2luZy1mcm9tLW5ldy1jZW8tc2hhdW4ta2Vhcm5ledIBAA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL2JlYXV0eS9wbGFucy1mb3ItaGFycnktc3R5bGVzcy1wbGVhc2luZy1mcm9tLW5ldy1jZW8tc2hhdW4ta2Vhcm5ledIBAA?oc=5\" target=\"_blank\">Plans for Harry Styles's Pleasing, from new CEO Shaun Kearney<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plans for Harry Styles's Pleasing, from new CEO Shaun Kearney - Vogue Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL2JlYXV0eS9wbGFucy1mb3ItaGFycnktc3R5bGVzcy1wbGVhc2luZy1mcm9tLW5ldy1jZW8tc2hhdW4ta2Vhcm5ledIBAA?oc=5\" target=\"_blank\">Plans for Harry Styles's Pleasing, from new CEO Shaun Kearney<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","source.href":"https:\/\/www.voguebusiness.com","source.title":"Vogue Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Pleasing is among a wave of digitally savvy brands that began selling directly to consumers via its own channels, which brings higher profit margins, while traditional department stores have seen sales decline. However, many multi-brand retailers are now updating their stores and offering brands more control over how their products are priced and displayed. Many DTC holdouts are also pivoting to wholesale in a bid to reach new customers as digital marketing costs rise. The decision to enter into fragrance appears to be a well-calculated move, experts say. While Pleasing experienced high consumer interest during its initial unveiling, there was a notable decline in engagement after October 2022, according to social analytics firm Brandwatch. Following the recent news of its fragrance line, online mentions of Pleasing witnessed an uptick by 4,286 per cent (between 2-5 November) compared to the median mention volume, data shows. Kearney declined to comment on Pleasing’s profitability, annual revenues or sales growth but says that “for a company so early on, it has been very impressive” and on its current path predicts “a really healthy trajectory over the next few years”. His goal is to build “a powerhouse lifestyle brand” that “really influences the conversation and truly impacts people’s lives”. Kearney explains: “It’s not just about the product; it’s about leading the conversation and being part of what’s happening in the world and offering a place that people trust and can meet.” Read More Why new celebrity fragrances keep coming Despite stiff competition, shifting consumer behaviour means there’s still money to be made from new fragrance launches. Victoria Beckham, Harry Styles and Millie Bobby Brown are among those embracing the opportunity. Pleasing’s retail space at Selfridges, which is inspired by its fragrance bottles as well as the golden days of early cinema, intertwines nostalgia with contemporary design elements — an approach that is reflective of its DNA, according to the brand. Customers can discover and sample through a vintage-style beauty counter. There will also be a trio of ticket booths, where visitors can collect a free “ticket”, spritzed individually with one of the fragrances, printed on archival paper that serves as physical keepsakes. Each day, visitors will discover surprises, such as confections and sporadic mini-shows performed by roaming artists. “Selfridges is a great destination for discovery [and] really allows us to bring Pleasing to existing customers but introduce it to a new audience, too,” says Kearney. The brand has a broad customer base that ranges from 10 to 85 years old, although the highest engagement comes from Gen Z and younger millennials, he says. Among Kearney’s goals for Pleasing is to capture older millennials, and striking partnerships with stores where they spend time and shop is key.","filter_flag":1}
{"title":"IBU Season 2023\/2024 set for new rules and higher sustainability standards - International Biathlon Union","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJpYXRobG9ud29ybGQuY29tL25ld3MvaWJ1LXNlYXNvbi0yMDIzLTIwMjQvMzBrWGVZc1o5RElSUWFxWHpyNHo2OdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJpYXRobG9ud29ybGQuY29tL25ld3MvaWJ1LXNlYXNvbi0yMDIzLTIwMjQvMzBrWGVZc1o5RElSUWFxWHpyNHo2OdIBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmJpYXRobG9ud29ybGQuY29tL25ld3MvaWJ1LXNlYXNvbi0yMDIzLTIwMjQvMzBrWGVZc1o5RElSUWFxWHpyNHo2OdIBAA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJpYXRobG9ud29ybGQuY29tL25ld3MvaWJ1LXNlYXNvbi0yMDIzLTIwMjQvMzBrWGVZc1o5RElSUWFxWHpyNHo2OdIBAA?oc=5\" target=\"_blank\">IBU Season 2023\/2024 set for new rules and higher sustainability standards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">International Biathlon Union<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IBU Season 2023\/2024 set for new rules and higher sustainability standards - International Biathlon Union","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmJpYXRobG9ud29ybGQuY29tL25ld3MvaWJ1LXNlYXNvbi0yMDIzLTIwMjQvMzBrWGVZc1o5RElSUWFxWHpyNHo2OdIBAA?oc=5\" target=\"_blank\">IBU Season 2023\/2024 set for new rules and higher sustainability standards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">International Biathlon Union<\/font>","source.href":"https:\/\/www.biathlonworld.com","source.title":"International Biathlon Union","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The IBU season 2023\/2024 is set to get underway with the opening BMW IBU World Cup in Östersund (SWE) on 25 November 2023 as new rules and sustainability commitments will be showcased for the first time. Östersund is one of nine World Cup Organising Committees this season, in addition to World Championship host Nove Mesto na Morave, to have voluntarily signed the IBU’s new Sustainability Charter. By signing the Charter, the Organising Committees have pledged to six commitments with concrete actions that help focus and fast-track efforts to reduce environmental impact while enhancing social legacies. The Charter is aligned with the IBU’s Sustainability Strategy 2020-2030 and is the latest step in making sustainability an integral part of the IBU’s event bidding and management process. It follows the contractual obligation on all hosts to measure and report their emissions, which has been in place since the 2021\/2022 season, and from the 2026-2030 event cycle onwards, sustainability obligations on all Organising Committees will become a key hosting criterion. In keeping with the IBU’s commitment to minimising its impact on the environment, the IBU will implement a full fluor ban this season to mitigate environmental and health concerns. The full ban from 2023\/2024 onwards was announced in March 2022 and the IBU has since engaged in regular dialogue and education seminars with National Federations (NFs), their teams and technicians. Most recently, in September 2023, a Seminar was held with team technicians from approximately 30 nations to work with the detection device, explore new products and application as well as learn about how to optimize cleaning methods. The flour test protocol will see skis tested before and after competition and a measuring procedure against pre-determined threshold zones will be enforced. Pre-competition, should athletes’ skis fall within the red threshold, they will be tested a second time and if they fail the test again will be given a red card and removed from competition. Each athlete will have the possibility to change their skis once in the season but a second red card will automatically result in a prohibition to start. Athletes whose skis fall above the post-competition threshold test will be disqualified. The implementation of the flour ban will not be the only new rule in place this season. The IBU Technical Committee has also decided on the following rule changes: in the Mixed Relays, each leg and gender will ski a 6km (3x2km) loop to facilitate course preparation and the conduction of the competition tightened rifle handle regulations at the shooting range to increase safety for athletes and participants extending the personal start right for the IBU Cup winners of the previous seasons to the first two World Cup stages (from only one stage previously.) This rule will be changed after next season so that the additional quota is not a personal start right any longer, but turns into an additional quota place for the National Federation of the IBU Cup winner for the first two World Cup stages of the next winter season The 2023\/2024 season will be held across 10 venues with the season finishing in North America in Soldier Hollow, Utah (USA) and Canmore, Alberta (CAN) in March. Over half a million spectators are expected to attend the season with the BMW IBU World Championships Biathlon in Nove Mesto na Morave on 7-18 February 2024 to draw the largest crowds. Photo: IBU","filter_flag":1}
{"title":"Uber bets big on India’s tech talent, incentivises innovation around sustainability - The Economic Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9jb21wYW55L2NvcnBvcmF0ZS10cmVuZHMvdWJlci1iZXRzLWJpZy1vbi1pbmRpYXMtdGVjaC10YWxlbnQtaW5jZW50aXZpc2VzLWlubm92YXRpb24tYXJvdW5kLXN1c3RhaW5hYmlsaXR5L2FydGljbGVzaG93LzEwNDk0MTU1Ny5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL25ld3MvY29tcGFueS9jb3Jwb3JhdGUtdHJlbmRzL3ViZXItYmV0cy1iaWctb24taW5kaWFzLXRlY2gtdGFsZW50LWluY2VudGl2aXNlcy1pbm5vdmF0aW9uLWFyb3VuZC1zdXN0YWluYWJpbGl0eS9hbXBfYXJ0aWNsZXNob3cvMTA0OTQxNTU3LmNtcw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9jb21wYW55L2NvcnBvcmF0ZS10cmVuZHMvdWJlci1iZXRzLWJpZy1vbi1pbmRpYXMtdGVjaC10YWxlbnQtaW5jZW50aXZpc2VzLWlubm92YXRpb24tYXJvdW5kLXN1c3RhaW5hYmlsaXR5L2FydGljbGVzaG93LzEwNDk0MTU1Ny5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL25ld3MvY29tcGFueS9jb3Jwb3JhdGUtdHJlbmRzL3ViZXItYmV0cy1iaWctb24taW5kaWFzLXRlY2gtdGFsZW50LWluY2VudGl2aXNlcy1pbm5vdmF0aW9uLWFyb3VuZC1zdXN0YWluYWJpbGl0eS9hbXBfYXJ0aWNsZXNob3cvMTA0OTQxNTU3LmNtcw?oc=5","id":"CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9jb21wYW55L2NvcnBvcmF0ZS10cmVuZHMvdWJlci1iZXRzLWJpZy1vbi1pbmRpYXMtdGVjaC10YWxlbnQtaW5jZW50aXZpc2VzLWlubm92YXRpb24tYXJvdW5kLXN1c3RhaW5hYmlsaXR5L2FydGljbGVzaG93LzEwNDk0MTU1Ny5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL25ld3MvY29tcGFueS9jb3Jwb3JhdGUtdHJlbmRzL3ViZXItYmV0cy1iaWctb24taW5kaWFzLXRlY2gtdGFsZW50LWluY2VudGl2aXNlcy1pbm5vdmF0aW9uLWFyb3VuZC1zdXN0YWluYWJpbGl0eS9hbXBfYXJ0aWNsZXNob3cvMTA0OTQxNTU3LmNtcw","guidislink":false,"published":"Sat, 04 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=308, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9jb21wYW55L2NvcnBvcmF0ZS10cmVuZHMvdWJlci1iZXRzLWJpZy1vbi1pbmRpYXMtdGVjaC10YWxlbnQtaW5jZW50aXZpc2VzLWlubm92YXRpb24tYXJvdW5kLXN1c3RhaW5hYmlsaXR5L2FydGljbGVzaG93LzEwNDk0MTU1Ny5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL25ld3MvY29tcGFueS9jb3Jwb3JhdGUtdHJlbmRzL3ViZXItYmV0cy1iaWctb24taW5kaWFzLXRlY2gtdGFsZW50LWluY2VudGl2aXNlcy1pbm5vdmF0aW9uLWFyb3VuZC1zdXN0YWluYWJpbGl0eS9hbXBfYXJ0aWNsZXNob3cvMTA0OTQxNTU3LmNtcw?oc=5\" target=\"_blank\">Uber bets big on India’s tech talent, incentivises innovation around sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Uber bets big on India’s tech talent, incentivises innovation around sustainability - The Economic Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9jb21wYW55L2NvcnBvcmF0ZS10cmVuZHMvdWJlci1iZXRzLWJpZy1vbi1pbmRpYXMtdGVjaC10YWxlbnQtaW5jZW50aXZpc2VzLWlubm92YXRpb24tYXJvdW5kLXN1c3RhaW5hYmlsaXR5L2FydGljbGVzaG93LzEwNDk0MTU1Ny5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL25ld3MvY29tcGFueS9jb3Jwb3JhdGUtdHJlbmRzL3ViZXItYmV0cy1iaWctb24taW5kaWFzLXRlY2gtdGFsZW50LWluY2VudGl2aXNlcy1pbm5vdmF0aW9uLWFyb3VuZC1zdXN0YWluYWJpbGl0eS9hbXBfYXJ0aWNsZXNob3cvMTA0OTQxNTU3LmNtcw?oc=5\" target=\"_blank\">Uber bets big on India’s tech talent, incentivises innovation around sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","source.href":"https:\/\/m.economictimes.com","source.title":"The Economic Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"ET Spotlight (You can now subscribe to our (You can now subscribe to our Economic Times WhatsApp channel It has been 10 years since Uber started its journey in India, to the point where the word ‘Uber’ is a verb today. To grasp the extent of this transformative journey and to gain insights into its future projects, Shantheri Mallaya, Editor News for ETCIO, had a free-wheeling chat with Manikandan Thangarathnam, Senior Director, Engineering, Uber India, where he took us through the new product innovations and the way ahead for Uber in India.We have close to 1,500 techies within our twin tech centres in India. I just completed three years at Uber, and we have grown significantly in the last three years. Back then, the teams across Hyderabad and Bengaluru were about 300 to 350 strong. While it's almost a 5x growth in terms of numbers for us now, it's much more than just the pure numbers. The projects being led out of our offices in India have a global footprint and impact our vision worldwide.All the tech related to taxis is built from our India centres. Taxis present an interesting challenge because supply is the constraint, while demand is high. In India, everyone needs a cab, but there’s a shortage of cabs. When you hail a taxi from the street, you often find drivers waiting for customers. So, we thought of the best fit, a win-win solution for both. Customers are waiting, and drivers are waiting, how can we bring them together? To solve this, we have partnered with a lot of taxi services, integrating them into our platform. We’ve been committed to building trust with taxi partners. Our vision is to have all taxis worldwide on Uber by 2025. To achieve this, we focus on building trust with taxi drivers to help them get Uber rights as part of their day-to-day routine so that they can maximise their earnings. We have already launched in 33 countries, and we are already witnessing success in regions like Hong Kong, Poland, and Sweden. Recently, in the US too, we’ve also tied up with major taxi companies in New York, San Francisco, and Los Angeles in the United States, marking significant progress. Currently, the question is about how to make it global.If you're thinking about all taxis on Uber, that's a big vision, right? One of our approaches is to reach out to taxi services and encourage them to install the Uber app, and once they install the app, they start getting the Uber rides. On the other hand, if they are already used to a specific app, they can continue to do so and still magically get access to Uber rides. How is it possible? We have exposed some third-party APIs. We have integrated their back-end with our API so that our request flows through their APIs to their driver app. So, that is magic for taxi drivers as they start getting Uber trips without having to switch to our app. These are the two approaches we have undertaken to see how quickly we can achieve our vision to get all taxis under the Uber umbrella.As a company, we are heavily invested in sustainability. In 2020, Dara (Uber CEO Dara Khosrowshahi) stated our goal to be a sustainable mobility platform. That's where we want to head as a company. In fact, we set some clear targets last year: by 2025, 50% of mobility in Europe is expected to run on sustainable mobility platforms, and by 2030, we aim to realise this vision in the US, Canada, and Europe. By 2040, we envision a global shift towards sustainable mobility. To make this happen, we’ve launched the Sustainovate Startup Challenge, which we believe would provide great opportunities for startups, especially on the mobility side, to innovate with a green future in mind. We've also recently announced a one crore cash prize for deserving companies. We are not looking for IP or any related assets as part of this. We simply want to encourage those companies and see how we can support them to enable their success by providing them with the right mentorship and partnership. As we are committed to sustainability, we believe it's important for these efforts to take place across various platforms. This ensures that the appropriate individuals leverage resources to tackle pertinent issues through an environmentally friendly lens, which will lead to holistic growth and help us to realise our vision.When we bring in sustainability tech, it is not about introducing yet another category of cars. Here, it is a completely different thing altogether. When we say Uber Green and sustainability tech, there are a lot of factors that come into the picture. For example, one of the core parameters is around battery charging, and how much distance a car can travel with the charge left in its battery. This needs to be part of our matching algorithm. Let's say the battery can do only 100 kilometres. In this case, the algorithm needs to know the right car to pair riders with.Most cars, depending on the range, can go up to 200 kilometres, and some can even cover 500 kilometres. If a customer requests an intercity trip of 200 to 250 kilometres, and an electric vehicle (EV) nearby has a range of only 100 kilometres, it wouldn't make sense to assign that specific ride. Implementing such changes is more complex than simply acquiring battery information. Uber's operational structure, including the driver app, rider app, and the intermediary Uber cloud, involves many variables such as the driver's location and ongoing trips. Many decisions are based on direct costs, yet monitoring the car's battery level relies on the signals provided by the vehicle.The good part is Uber is ahead in this game, as we have already thought about sustainability as our vision, and it has been years since we started working on this. We already have some of these systems active and working in several cities of the world. And that's why Uber Green was launched in India. We will continue to see these kinds of launches and improvements on the technology side to support our sustainability mission.Generally, if you take a lot of countries, the infrastructural capability to support mobility needs is slightly lesser than what mobility requires. So that means more people need to travel on a faster, safer and more reliable route. We can take multiple solutions to solve this problem. One of the approaches is putting more people inside a single vehicle. This is achieved through services like Group Rides, wherein four people can share one car, effectively reducing carbon emissions and achieving other environmental benefits.Another thing that we are working on is the Uber Bus. There’s a difference with this product in the sense that it's not going to come to your doorstep. There are fixed routes that have been charted looking at data from passenger and traffic loads in individual cities. It's not like the driver can take whatever roads they want to. So, what should be the routes? What should be the timing of the rides for gaining maximum passengers? What should be the ticketing mechanism? On the driver's side, how do we help the driver to reach the station on time? How do we help the driver to know who is going to onboard on which station? There was a completely different tech that needed to be built from scratch, where each of these problems was solved from an engineering perspective, using the latest, industry-leading technologies.We are invested in solving the problem of how we can club more people together in a single vehicle to reduce carbonisation, in addition to the other sustainability measures that I discussed.We have observed that people are looking for reliable, safer and faster ways to move. The interesting part is that this is not going to change even after ten years. In the next decade, if I talk to a customer, they're always going to prefer a reliable, safer, faster, cheaper ride. So, when you have these kinds of products, which are not going to change over a period of time, that means you can solve problems through deep tech, and come up with groundbreaking innovative solutions.One of the new products we have built and are working to enhance is Uber Reserve, which is aimed to solve the issue of reliability by making schedules more predictable for drivers. We’re also focusing on airport travel. Airports are one place where we see Uber has been the majority of the use case as people generally do not drive to the airport using their personal vehicles. We have recently launched a feature in some markets where riders have the option to integrate their flight number while booking their airport trips, which helps let us know what time their flight is landing, and this ensures that we ‘reserve’ their ride to be there when they land. If the flight gets postponed, their reservation gets postponed accordingly.One of our priority products for India from a tech standpoint is Intercity. We are now taking Intercity to a whole new level of tech integration. We observed people booking Intercity rides to go from place A to B, and that many of them returned to their town within the same day. We’ve built a way where people can keep the car to themselves so that they can come back the same day or even the next day. The return trip feature brings Uber’s tech superiority to add convenience to the intercity taxi industry, which has traditionally been rather unorganised.As a company, we will continue to invest in increasing the experience of on-demand products. Equally, we are also investing in all these types of new verticals where we are going to give new product offerings to the customer, targeting a whole new set of riders across the world who have never experienced the magic of Uber.Two things here. One is, as I spoke about, a diverse set of talent is something that you can get in India much faster. The second aspect is adaptability to technology. If you take the time period between 2005 to 2010, that had an overpowering focus on cloud computing. We had a strong talent pool in India invested in solving challenges around it. This was the time when a lot of companies decided to discontinue their desktop services and focus solely on a mobile-first approach. There was a need for the best Android & IOS engineers, and India was able to adapt to that demand quickly and to build the talent base to cater to that requirement. Then came crypto, and then came AI. Technology keeps changing, but how quickly talent can adapt to that and build a surplus of talent in that space is important because big companies will continue to adopt and build around the latest technology.Whenever we look for things on the latest technology front, we have always found ways by which we can hire the right talent in India. This gave us a very good opportunity to go big in India. The adaptability here is exceptional. I feel the Indian education system provides a solid base; it is designed around core fundamentals, giving a rock-solid foundation to students so that when things are about to change, these foundations and fundamentals help them navigate the change and adapt faster. Traditionally, they used to offer BTech in Computer Science, but now they also offer BTech in IT. Recently, I've been seeing institutions offering BTech courses in Artificial Intelligence and Data Science, which is commendable. So those are the things that I am seeing emerging from India's standpoint, where the Indian talent pool’s adaptability towards latest technology is excellent, and this is helping global companies like Uber to leverage and grow big here.","filter_flag":1}
{"title":"Most innovative new products for CES 2024 named - Gadget","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiHWh0dHBzOi8vZ2FkZ2V0LmNvLnphL2NlczIwMjQv0gEjaHR0cHM6Ly9nYWRnZXQuY28uemEvY2VzMjAyNC8_YW1wPTE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiHWh0dHBzOi8vZ2FkZ2V0LmNvLnphL2NlczIwMjQv0gEjaHR0cHM6Ly9nYWRnZXQuY28uemEvY2VzMjAyNC8_YW1wPTE?oc=5","id":"CBMiHWh0dHBzOi8vZ2FkZ2V0LmNvLnphL2NlczIwMjQv0gEjaHR0cHM6Ly9nYWRnZXQuY28uemEvY2VzMjAyNC8_YW1wPTE","guidislink":false,"published":"Tue, 21 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=325, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiHWh0dHBzOi8vZ2FkZ2V0LmNvLnphL2NlczIwMjQv0gEjaHR0cHM6Ly9nYWRnZXQuY28uemEvY2VzMjAyNC8_YW1wPTE?oc=5\" target=\"_blank\">Most innovative new products for CES 2024 named<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gadget<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Most innovative new products for CES 2024 named - Gadget","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiHWh0dHBzOi8vZ2FkZ2V0LmNvLnphL2NlczIwMjQv0gEjaHR0cHM6Ly9nYWRnZXQuY28uemEvY2VzMjAyNC8_YW1wPTE?oc=5\" target=\"_blank\">Most innovative new products for CES 2024 named<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gadget<\/font>","source.href":"https:\/\/gadget.co.za","source.title":"Gadget","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainability\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Click to share on Pinterest (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to share on Reddit (Opens in new window) Click to email a link to a friend (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) More than 500 Innovation Awards honorees were arrowed down to 36 winners across 29 categories – with AI featuring on its own for the first time. The Consumer Technology Association (CTA) has named 36 products as the year’s ‘Best of Innovation’ for the CES Innovation Awards. The CES 2024 Innovation Awards honorees included more than 500 products, honouring outstanding design and engineering in consumer technology across 29 categories. These were narrowed down to 36 overall winners. More than 3,000 submissions were received: a record high and a 40% increase over CES 2023. Each year, an independent panel of industry expert judges, including members of the media, designers and engineers, reviews and rates submissions based on innovation, functionality, aesthetic, and design. Those rated the highest across all categories receive the Best of Innovation designation. For the CES 2024 program, the top two categories by number of submissions were ‘Digital health’ and ‘Sustainability, eco-design & smart energy.’ This trend underscores the rapid pace of innovation in sectors that promise to solve big global challenges and improve human lives – a major theme at the show as CTA partners with the UN Trust Fund for Human Security and World Academy of Art and Science (WAAS) to advance human security. For the first time, the Best of Innovation list for CES 2024 includes a product from the ‘Human Security’ category, introduced at CES 2023. The Awards also feature a new category: artificial intelligence (AI). The AI category received 7% of all applications, underscoring that innovators are increasingly recognising the transformative potential of AI in shaping the future of technology. AI will also be pervasive throughout the CES 2024 show floor and conference programming. The full Best of Innovation list and all 522 Innovation Award honorees will be announced during CES 2024, where many of the products will appear in the Innovation Awards Showcase at CES, located in the Venetian Expo. The Best of Innovation honorees for 2024 include: AirFarm Company: Midbar Co., Ltd. Product Category: Human Security for All AirJet Mini – Solid-State Active Cooling Chip for Electronic Devices Company: Frore Systems Product Category: Embedded Technologies AVEIR Dual chamber (DR) Leadless Pacemaker System Company: Abbott Product Category: Digital Health Bose QuietComfort Ultra Headphones Company: Bose Product Category: Headphones & Personal Audio FINTIN V1 : The Most Accessible Qwerty-Communicator Company: ONECOM.CO.,LTD. Product Category: Mobile Devices, Accessories & Apps Gun Detection System Company: Bosch Product Category: Artificial Intelligence Hestia Company: VAONIS Product Category: Digital Imaging\/Photography Honda Motocompacto Company: Honda Product Category: Vehicle Tech & Advanced Mobility HP Spectre Fold Company: HP Inc. Product Category: Computer Hardware & Components IINK – 4D Food Printing System for Future Food Company: Top Table Inc. Product Category: Food & AgTech Interactive Transparent Window Company: AUO Corporation Product Category: In-Vehicle Entertainment ITX181225 Company: I-TEN SA Product Category: Sustainability, Eco-Design & Smart Energy JBL Authentics 500 Company: Harman International Corp Product Category: Headphones & Personal Audio Mand.ro Mark 7D Company: Mand.ro Co. Ltd. Product Category: Accessibility & Aging Tech MEMS Hybrid Micromotor for Electronics Company: SILMACH Product Category: Embedded Technologies Motionsleep Company: 10minds co. ltd. Product Category: Smart Home NAD M66 Company: NAD Electronics Product Category: Audio\/Video Components & Accessories Phantom Company: Afference Product Category: XR Technologies & Accessories RoWok by SJW Robotics Company: SJW Robotics (Appetronix) Product Category: Robotics Seller Canvas Company: STUDIO LAB Product Category: Artificial Intelligence Sevvy Smart Cooker Company: Sevvy B.V. Product Category: Home Appliances Silk Charge&Go IX Company: WS Audiology Product Category: Wearable Technologies SQPV Glass Company: inQs Co., Ltd. Product Category: Smart Cities Trip.PASS-Mobile passport platform Company: Lordsystem Product Category: Financial Technologies Venu 3 Company: Garmin Product Category: Sports & Fitness WILLCOOK Company: WILLTEX.CO.,LTD. Product Category: Home Appliances zkVoting: Blockchain-based voting at the Poll Station Company: Zkrypto Inc. Product Category: Cybersecurity & Personal Privacy","filter_flag":1}
