{"title":"Virtuous circle: Work from Ansys on plastics recycling - Develop3D","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZGV2ZWxvcDNkLmNvbS9zaW11bGF0aW9uL3ZpcnR1b3VzLWNpcmNsZS13b3JrLWZyb20tYW5zeXMtb24tcGxhc3RpY3MtcmVjeWNsaW5nL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZGV2ZWxvcDNkLmNvbS9zaW11bGF0aW9uL3ZpcnR1b3VzLWNpcmNsZS13b3JrLWZyb20tYW5zeXMtb24tcGxhc3RpY3MtcmVjeWNsaW5nL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vZGV2ZWxvcDNkLmNvbS9zaW11bGF0aW9uL3ZpcnR1b3VzLWNpcmNsZS13b3JrLWZyb20tYW5zeXMtb24tcGxhc3RpY3MtcmVjeWNsaW5nL9IBAA","guidislink":false,"published":"Tue, 16 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=136, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZGV2ZWxvcDNkLmNvbS9zaW11bGF0aW9uL3ZpcnR1b3VzLWNpcmNsZS13b3JrLWZyb20tYW5zeXMtb24tcGxhc3RpY3MtcmVjeWNsaW5nL9IBAA?oc=5\" target=\"_blank\">Virtuous circle: Work from Ansys on plastics recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Develop3D<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Virtuous circle: Work from Ansys on plastics recycling - Develop3D","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vZGV2ZWxvcDNkLmNvbS9zaW11bGF0aW9uL3ZpcnR1b3VzLWNpcmNsZS13b3JrLWZyb20tYW5zeXMtb24tcGxhc3RpY3MtcmVjeWNsaW5nL9IBAA?oc=5\" target=\"_blank\">Virtuous circle: Work from Ansys on plastics recycling<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Develop3D<\/font>","source.href":"https:\/\/develop3d.com","source.title":"Develop3D","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"A recent collaboration between simulation software developer Ansys, several recycling companies and a producer of automotive parts has demonstrated how recycled plastics could be more widely used in products, to the benefit of the environment Recycling plastics is an obvious solution to a huge pollution problem, but most of us have only a naïve understanding of how it works. There’s a lot of sorting and chopping involved to make plastic pieces small enough to flow into a mixer, and there are chemical additives used as binders or flow enablers needed to enhance the properties of the resulting material. Even after all that, a recycler still can’t be sure if the recycled plastics will be useful to potential customers seeking to turn them into new products. Aesthetically, a recycled version will probably not look good enough to be used on the exterior of a product, so it’s typically placed out of view, like behind a car bumper or sandwiched between two pieces of metal. The recycled plastic may not have the same strength as the equivalent virgin plastic material, and the strength will vary from batch to batch. This is because the recyclable materials in any municipal waste stream vary depending on what’s being thrown away at any given time, and hence are typically a blend of similar plastics. So, how can recyclers and their customers determine and keep track of the physical properties of recycled plastics and effectively deal with the inherent variability of these properties? Through a recent project with three UK companies, Ansys believes the answer lies in a process that best combines four of its technologies into a streamlined workflow. Making it easier To make it easier for recyclers and their customers to produce viable recycled plastics and use them in products, Ansys collaborated with Impact Recycling, Impact Solutions, and Far-UK to undertake the Plastic Recycling in Stochastic Modelling (PRISM) Project. Advertisement Advertisement Stochastic refers to randomness. It’s in understanding the randomness of the feedstock and the resulting physical properties of the recycled plastic that simulation can be of huge value to the recycling process. Impact Recycling, which offers a sustainable solution for recycling post-consumer products, can successfully recycle upwards of 80% of the plastic municipal waste it handles. However, that still leaves an expensive 20% on which it must pay taxes to send to landfills or incinerators. Companies like Far-UK, a producer of automotive parts for niche vehicles, could potentially save a lot of money in manufacturing while offering a more sustainable product by using recycled materials from companies like Impact Recycling. But that’s providing these materials meet the exacting requirements of the original equipment manufacturers (OEMs) to which it sells. Part of the challenge lies in presenting these materials as a viable alternative to the virgin polymers that automotive OEMs have been using for decades. “These companies need to understand when they have to use virgin materials and when they can use a recycled material instead,” says Donna Dykeman, R&D manager for collaborative R&D at Ansys. And that’s where Ansys simulation solutions come in, she adds. The simulation workflow combined four Ansys simulation products: Ansys Granta MI, Ansys SpaceClaim, Ansys optiSLang, and Ansys LS-DYNA. Together, these simulation tools were used to optimise workflows to handle the uncertainty of material properties and screen geometries for applications to replace virgin plastics with recycled ones. “Granta MI stores the materials data. Then, LS-DYNA was used to create the material card based on test data. The card was validated against test coupon geometries and subcomponent geometries – for example, a beam under various loading conditions. This first step of testing and material card generation was performed by Far-UK,” Dykeman explains. “Next, we used optiSLang to create a workflow with SpaceClaim and LS-DYNA to vary the geometry of candidate parts and the material properties until an optimal design was reached. When an OEM specifies a property or geometry tolerance that must be met, the outcome of the optimisation process suggests which property requires improvement, and by how much.” Designed for shocks Ansys used this workflow to design a plastic honeycomb made of recycled materials to be installed behind the surface of a car bumper to absorb the shock of a crash. After proposing an initial geometry for the honeycomb, engineers performed LS-DYNA crash testing to see how well the structure absorbed and dispersed the energy of the crash. Ansys optiSLang was used to find the optimal design by minimising mass and displacement while maximising the accumulated energy of the honeycomb. Through a parametric study involving an iterative series of simulations, Ansys determined the optimal geometry of the bumper – such as the type of honeycomb structure, how thick the cells should be, bumper dimensions, and where mass could be removed from the benchmark steel bumper to achieve the allowable displacement before contact with more trunk components. “Ansys optiSLang is able to help designers find where the sweet spot of a design is through automation by running hundreds to thousands of simulations until it converges on an optimal design,” says Dykeman. Wide impact The impact of the project was widespread. Costs for manufacturing the recycled material fell, while production levels grew from 400 to 700 tonnes a year, allowing recyclers to meet the high demand-versus-supply of recycled plastics in light of the 30% tax on virgin plastics for consumer packaging. Far-UK, as a producer of automotive parts, benefited from the chance to explore how to manage the variability of materials from recyclate in design, with the aim of introducing materials with lower costs and carbon footprint in the future. It also used Ansys simulation tools to generate and validate the material card for use across wider applications. PRISM showcases how material circularity and better eco design can be achieved by applying the right solvers connected with a simulation digital thread, tidying up the issues of highly variable material properties. This article first appeared in DEVELOP3D Magazine DEVELOP3D is a publication dedicated to product design + development, from concept to manufacture and the technologies behind it all. To receive the physical publication or digital issue free, as well as exclusive news and offers, subscribe to DEVELOP3D Magazine here","filter_flag":1}
{"title":"Plastic recycling is failing – here's how the world must respond - The Conversation","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9wbGFzdGljLXJlY3ljbGluZy1pcy1mYWlsaW5nLWhlcmVzLWhvdy10aGUtd29ybGQtbXVzdC1yZXNwb25kLTIwNjMzONIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9wbGFzdGljLXJlY3ljbGluZy1pcy1mYWlsaW5nLWhlcmVzLWhvdy10aGUtd29ybGQtbXVzdC1yZXNwb25kLTIwNjMzONIBAA?oc=5","id":"CBMiYGh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9wbGFzdGljLXJlY3ljbGluZy1pcy1mYWlsaW5nLWhlcmVzLWhvdy10aGUtd29ybGQtbXVzdC1yZXNwb25kLTIwNjMzONIBAA","guidislink":false,"published":"Tue, 30 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=150, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9wbGFzdGljLXJlY3ljbGluZy1pcy1mYWlsaW5nLWhlcmVzLWhvdy10aGUtd29ybGQtbXVzdC1yZXNwb25kLTIwNjMzONIBAA?oc=5\" target=\"_blank\">Plastic recycling is failing – here's how the world must respond<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Conversation<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Plastic recycling is failing – here's how the world must respond - The Conversation","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9wbGFzdGljLXJlY3ljbGluZy1pcy1mYWlsaW5nLWhlcmVzLWhvdy10aGUtd29ybGQtbXVzdC1yZXNwb25kLTIwNjMzONIBAA?oc=5\" target=\"_blank\">Plastic recycling is failing – here's how the world must respond<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Conversation<\/font>","source.href":"https:\/\/theconversation.com","source.title":"The Conversation","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Recycling was once considered the obvious solution to the excessive amount of new (or virgin) plastic produced each year. This is no longer realistic. Global recycling capacity simply cannot keep up with the taking, making and wasting of natural resources. Growing mountains of plastic waste are accumulating in the poorest countries as affluent nations such as the UK ship their recycling overseas. But some nations are importing far more plastic waste than they can possibly recycle. The recycling process itself also creates problems. A new report by Greenpeace and the International Pollutants Elimination Network has revealed how plastics which are made with or come into contact with toxic chemicals, such as flame retardants, can contaminate the recycling process by spreading these toxins through subsequent batches of plastic waste. Another recent study showed that recycling facilities can release hundreds of tonnes of microplastics into the environment each year. Only 6-9% of all plastic ever produced has been sent for recycling. Although plastic and other waste is collected for recycling in most countries, the amount of material that is remade into the same or similar products (what is called closed-loop recycling) is extremely low. Only 2% of plastic waste is recycled in a closed loop and not turned into something of lower quality, which is called downcycling. Recycling can not fully replace virgin material as it can only be recycled twice before losing necessary properties, and so most recycling results in a downgraded material that cannot be used for the same purpose. A more sustainable approach would prioritise preventing plastic waste by taking action at earlier stages of a plastic product’s lifecycle: reducing how much plastic is ultimately made, reusing what exists and replacing plastic with alternative materials where appropriate. Reduce Manufacturers must stop making so much unnecessary plastic to reduce the amount entering the economy. There is no case for making plastics that are impossible to collect, reuse or recycle, or are toxic. Yet they are abundant: think multilayered sachets, thin films and wrappers. These should be phased out as a priority. Global caps on plastic production could restrict its use to reusable products and packaging, reducing the pressure on recycling systems. You can refuse single-use packaging when shopping if alternatives are available and affordable. Choose loose vegetables, or products wrapped in packaging that can be refilled. Reuse Using the plastic you already have for as long as possible reduces the amount of new products and packaging that need to be made and how much waste is ultimately sent for recycling. Roughly 250 billion single-use coffee cups are used worldwide every year – a figure that could be slashed by governments setting national mandates for reusable cups and bottles. This might involve shops, cafés and other venues providing reusable packaging for any products they sell and ensuring each one is used, tracked, washed, returned and replenished for the next consumer cycle. Substitute Metals, glass, or paper can be used instead of plastic, but there is no universal sustainable alternative. The most appropriate material depends on the item’s use. The environmental consequences of any material should be rigorously assessed across its entire life cycle – from production to use and disposal – to ensure it does more good than harm. And such assessments must consider all social, environmental and economic costs. Read more: Ranked: the environmental impact of five different soft drink containers The true cost of making, distributing and disposing of plastic is estimated to be more than ten times greater than what the customer pays for the product. Including the hidden costs of environmental damage and human misery arising from pollution in the price of virgin plastic, by taxing manufacturers or retailers for instance, could boost the economic case for alternatives. Recycling can still be useful Not all plastics can be reused, especially medical devices. When all alternatives have been exhausted, recycling keeps material in the economy and temporarily delays the need for more virgin plastic. But the existence of recycling shouldn’t justify making more plastic. Recycling must not pollute. Manufacturers should only make plastics which can be recycled via methods proven to be safe and clean, and ban toxic additives. Simple labelling can help consumers make informed decisions about how, where and what to either reuse or recycle, which would help prevent recycling loads becoming contaminated with non-recyclable waste and toxins. Plastics sent for recycling should be treated in the most socially and environmentally responsible way. High-income countries which export waste to poorer countries for cheap recycling do so without guarantees that infrastructure exists to manage this waste where it ends up. The result is waste leaking into the environment, and toxic plastic blocking drainage channels and causing floods. Some of this is burned outdoors, which comes with its own risks to health and the environment. Banning or restricting exports would help. Precarious workers in the informal waste sector collect, sort and sell recyclable materials and carry out 60% of global recycling. Waste reclaimers endure poor health and low pay but their extensive knowledge is invaluable and must be acknowledged. Policies to protect their rights and improve their livelihoods are needed. Read more: Waste pickers risk their lives to stop plastic pollution – now they could help shape global recycling policies Countries meeting in Paris for the second of five rounds of negotiations for an international treaty to end plastic pollution will discuss all areas of the plastic lifecycle - from the extraction of material to manufacturing, use and disposal. Banning unnecessary plastics, toxic additives and waste exports should be high on the agenda, along with schemes to encourage reuse and repair. Don’t have time to read about climate change as much as you’d like? Get a weekly roundup in your inbox instead. Every Wednesday, The Conversation’s environment editor writes Imagine, a short email that goes a little deeper into just one climate issue. Join the 10,000+ readers who’ve subscribed so far.","filter_flag":1}
{"title":"Restaurants In Unincorporated LA County Are Now Banned From Using Plastics. What To Know About The New ... - LAist","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL2xhaXN0LmNvbS9uZXdzL2NsaW1hdGUtZW52aXJvbm1lbnQvcmVzdGF1cmFudHMtaW4tdW5pbmNvcnBvcmF0ZWQtbGEtY291bnR5LWFyZS1ub3ctYmFubmVkLWZyb20tdXNpbmctcGxhc3RpY3Mtd2hhdC10by1rbm93LWFib3V0LXRoZS1uZXctb3JkaW5hbmNl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL2xhaXN0LmNvbS9uZXdzL2NsaW1hdGUtZW52aXJvbm1lbnQvcmVzdGF1cmFudHMtaW4tdW5pbmNvcnBvcmF0ZWQtbGEtY291bnR5LWFyZS1ub3ctYmFubmVkLWZyb20tdXNpbmctcGxhc3RpY3Mtd2hhdC10by1rbm93LWFib3V0LXRoZS1uZXctb3JkaW5hbmNl0gEA?oc=5","id":"CBMimgFodHRwczovL2xhaXN0LmNvbS9uZXdzL2NsaW1hdGUtZW52aXJvbm1lbnQvcmVzdGF1cmFudHMtaW4tdW5pbmNvcnBvcmF0ZWQtbGEtY291bnR5LWFyZS1ub3ctYmFubmVkLWZyb20tdXNpbmctcGxhc3RpY3Mtd2hhdC10by1rbm93LWFib3V0LXRoZS1uZXctb3JkaW5hbmNl0gEA","guidislink":false,"published":"Mon, 01 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=121, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL2xhaXN0LmNvbS9uZXdzL2NsaW1hdGUtZW52aXJvbm1lbnQvcmVzdGF1cmFudHMtaW4tdW5pbmNvcnBvcmF0ZWQtbGEtY291bnR5LWFyZS1ub3ctYmFubmVkLWZyb20tdXNpbmctcGxhc3RpY3Mtd2hhdC10by1rbm93LWFib3V0LXRoZS1uZXctb3JkaW5hbmNl0gEA?oc=5\" target=\"_blank\">Restaurants In Unincorporated LA County Are Now Banned From Using Plastics. What To Know About The New ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LAist<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Restaurants In Unincorporated LA County Are Now Banned From Using Plastics. What To Know About The New ... - LAist","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL2xhaXN0LmNvbS9uZXdzL2NsaW1hdGUtZW52aXJvbm1lbnQvcmVzdGF1cmFudHMtaW4tdW5pbmNvcnBvcmF0ZWQtbGEtY291bnR5LWFyZS1ub3ctYmFubmVkLWZyb20tdXNpbmctcGxhc3RpY3Mtd2hhdC10by1rbm93LWFib3V0LXRoZS1uZXctb3JkaW5hbmNl0gEA?oc=5\" target=\"_blank\">Restaurants In Unincorporated LA County Are Now Banned From Using Plastics. What To Know About The New ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LAist<\/font>","source.href":"https:\/\/laist.com","source.title":"LAist","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Keep up with LAist. If you're enjoying this article, you'll love our daily morning newsletter, How To LA. Every weekday, you'll get fresh, community-driven stories that catch you up with our independent local news. Subscribe L.A. County’s new plastics ordinance officially went into effect on Monday. That means if you’re dining in a restaurant in the unincorporated areas of L.A. County , you should no longer see single-use plastic foodware or Styrofoam. The ordinance : Phases out single-use foodware that is not compostable or recyclable, including all plastic items and compostable products that don’t meet certain requirements. Phases out the sale or rental of what’s commonly known as Styrofoam. Requires that full-service restaurants use reusable food serviceware for dine-in customers. Enforcement will be phased in for different food providers over the next two years. Street vendors are exempt for now. Food trucks will have 18 months to reach compliance. Temporary food providers such as farmers markets, caterers, or community event organizers will have two years. According to the county, financial penalties will be a last resort. Violations could result in fines up to $100 per day per violation up to a maximum of $1,000 per year. The ordinance does not apply to the county’s 88 incorporated cities, although many of them — including the city of Los Angeles — have or are considering plastics bans of their own. Trash and climate impacts Plastic makes up the vast majority of L.A. County’s litter, according to research by UCLA commissioned by the county to help it write its plastics ordinance . And most plastic — more than 85% — isn’t recycled. Instead, it fills up landfills or ends up in the street and gets flushed into storm drains and ultimately the ocean, causing harmful and deadly consequences to ocean life. It also costs a lot for the public. According to that UCLA research, taxpayers foot the bill for around $420 million every year in beach cleanup and waste prevention efforts. Changes in policy in China, which used to take in the majority of the world’s plastics, along with increased use of single-use plastics during the height of the COVID-19 pandemic, have only worsened the problem. Global waste practices disrupted China has long received and recycled the majority of the world’s plastic waste. But in early 2018, the country implemented the “National Sword” policy, significantly cutting how much and what kind of plastic waste it would accept. That move stalled the global recycling industry and forced cities and counties around the globe to reckon with new ways to deal with their plastic waste. Plastic not only trashes landscapes and oceans, it also has a major climate problem. Pretty much all plastics are made from oil, a fossil fuel in the family of gas and coal. Burning fossil fuels creates the bulk of pollution driving human-caused global heating. As the world has started to shift away from fossil fuels, the oil industry has been doubling down on plastics, seeing the sector as its largest potential for growth as demand for gas-fueled cars and trucks declines in the transition to electric transportation. Plastic production has been steadily increasing since 1950, and a recent study found that without sufficient government guardrails, plastic production largely via the oil industry is likely to at least double by 2040 . A piecemeal approach and a plastic law to rule them all From plastic bag bans, to taxing certain harmful materials, to rethinking the waste cycle, there are lots of strategies to tackle the plastics problem better locally. L.A. County decided to focus its ordinance on foodware in large part because most recycling facilities in greater L.A. don’t take single-use foodware plastics, which are small and often heavily contaminated (with food of course). It creates a vicious cycle that promotes making even more plastic foodware, said Rita Kampalath, L.A. County’s acting chief sustainability officer. She said the moment has arrived for more holistic approaches to reducing plastic waste, and that enforcing this ordinance is one essential step. “We sort of need to rethink what is necessary versus what is just convenient,” Kampalath said. So far local governments have largely led the way in moving such policies forward — 151 cities and counties in California have banned plastic at some level, or introduced other efforts to phase out plastics. The city of L.A., for example, is in the process of rolling out 14 measures to tackle plastic and non-recyclable materials. Those efforts expand an existing plastic bag ban and required city-run facilities to immediately take on “zero-waste” policies, including eliminating single-use plastics and using more compostable materials. Though local efforts have helped significantly reduce plastic use in some areas , such a piecemeal approach has kept progress slow and the amount of plastics has only continued to grow worldwide. Those types of bans haven’t been statewide and certainly are not global. But momentum is gaining. A state law passed last year aims to address plastic pollution throughout the products’ life cycle, putting an unprecedented level of responsibility on manufacturers and companies to curb their impact. The law is likely to influence international policies, as talks continue around a global treaty to tackle plastic production and pollution . California's plastic law Read more on what California’s new plastics law says here. Challenges and opportunities ahead One big challenge is that many new products are coming out, including those claiming to be compostable or recyclable. Even large-scale composting facilities — which are expanding as cities and counties work to comply with the state’s law to divert food waste from landfills — say they don’t take many certified compostable materials. Kampalath said that’s why the county’s ordinance includes a tiered system for compostable materials, with the preference being for fully fiber-based materials (such as paper, wood or cardboard) that could technically be composted at home. “If those types of materials or products aren't available, that’s where we start getting into those areas that are a little bit more complicated,” Kampalath said. “But it's not a free-for-all … It's also, frankly, something where we need to work with composting facilities to figure out what is going to be acceptable.” Ultimately Kampalath said that’s why the approach can’t simply be to replace the materials within the system, but rather rethink the system as a whole. “It's not a really simple story, unfortunately, but we're looking at it as a work in progress to get where we want to,” Kampalath said. “This is a problem that’s been decades and decades in the making and it's just not something that we're going to solve overnight.”","filter_flag":1}
{"title":"Victoria's Secret isn't keeping its 'Forever Bra' a secret - The Cool Down","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy92aWN0b3JpYXMtc2VjcmV0LWZvcmV2ZXItYnJhLXJlY3ljbGVkLW1hdGVyaWFscy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy92aWN0b3JpYXMtc2VjcmV0LWZvcmV2ZXItYnJhLXJlY3ljbGVkLW1hdGVyaWFscy_SAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy92aWN0b3JpYXMtc2VjcmV0LWZvcmV2ZXItYnJhLXJlY3ljbGVkLW1hdGVyaWFscy_SAQA","guidislink":false,"published":"Tue, 23 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=143, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy92aWN0b3JpYXMtc2VjcmV0LWZvcmV2ZXItYnJhLXJlY3ljbGVkLW1hdGVyaWFscy_SAQA?oc=5\" target=\"_blank\">Victoria's Secret isn't keeping its 'Forever Bra' a secret<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Cool Down<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Victoria's Secret isn't keeping its 'Forever Bra' a secret - The Cool Down","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnRoZWNvb2xkb3duLmNvbS9ncmVlbi1idXNpbmVzcy92aWN0b3JpYXMtc2VjcmV0LWZvcmV2ZXItYnJhLXJlY3ljbGVkLW1hdGVyaWFscy_SAQA?oc=5\" target=\"_blank\">Victoria's Secret isn't keeping its 'Forever Bra' a secret<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Cool Down<\/font>","source.href":"https:\/\/www.thecooldown.com","source.title":"The Cool Down","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Forever Bra will keep these materials out of landfills by using them to create new products or energy. Victoria's Secret is taking a step toward sustainability with its new Forever Bra. The Forever Bra's pads are made of recyclable materials that can be made into new bras once you're done with them. Customers can simply return their Forever Bra to any U.S. Victoria's Secret location, where the pads will be removed and prepared for recycling. If your bra is still in good condition, it might be donated, giving the garment a second life. Some bra pads are made with polyurethane foam, a kind of plastic that can't easily be recycled or reused efficiently. The Forever Bra uses pads made with plant-based materials that allow recycling. The bras are made with modal, an eco-friendly alternative to cotton made from wood pulp. Victoria's Secret says it uses modal sourced from responsibly managed forests, meaning the wood pulp doesn't come from old-growth or endangered trees. Not every part of the bra is recyclable. The bits of plastic and metal that make up the bra's clasps and underwire will be removed from the bras and converted into electricity at waste-to-energy plants, according to Bloomberg's report. Join our newsletter Good news, green hacks, and the latest cool clean tech — straight to your inbox every week! Our clothes and textiles produce a lot of waste. In fact, about 85% of textiles in the U.S. (most of which are clothes) end up in landfills or incinerated (based on the most recently reported EPA data). The fabric of many bras can take up to 200 years to break down, while the metal and plastic pieces of bras can take between 100 and 400 years to degrade. The Forever Bra will keep these materials out of landfills by using them to create new products or energy (though waste-to-energy incineration also has its pros and cons environmentally). Victoria's Secret isn't the only company looking to keep bras out of landfills. More and more companies and organizations are providing customers with opportunities to donate or recycle their bras. Lingerie company Harper Wilde's Recycle, Bra program accepts any brand of old bras or underwear and recycles them into clothes, rugs, and other textiles — or breaks them down for second uses such as in insulation or cleaning cloth. Free the Girls, a nonprofit providing economic opportunities for victims of human trafficking, accepts new and gently used bras for donation. So the next time you're looking to get rid of an old bra, don't just toss it; there are plenty of organizations that will turn your trash into someone else's treasure. Join our free newsletter for cool news and actionable info that makes it easy to help yourself while helping the planet.","filter_flag":1}
{"title":"12 Social Enterprise Business Ideas and Business Models - Causeartist","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LmNhdXNlYXJ0aXN0LmNvbS9zb2NpYWwtZW50ZXJwcmlzZS1idXNpbmVzcy1pZGVhcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LmNhdXNlYXJ0aXN0LmNvbS9zb2NpYWwtZW50ZXJwcmlzZS1idXNpbmVzcy1pZGVhcy_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vd3d3LmNhdXNlYXJ0aXN0LmNvbS9zb2NpYWwtZW50ZXJwcmlzZS1idXNpbmVzcy1pZGVhcy_SAQA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LmNhdXNlYXJ0aXN0LmNvbS9zb2NpYWwtZW50ZXJwcmlzZS1idXNpbmVzcy1pZGVhcy_SAQA?oc=5\" target=\"_blank\">12 Social Enterprise Business Ideas and Business Models<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Causeartist<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"12 Social Enterprise Business Ideas and Business Models - Causeartist","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LmNhdXNlYXJ0aXN0LmNvbS9zb2NpYWwtZW50ZXJwcmlzZS1idXNpbmVzcy1pZGVhcy_SAQA?oc=5\" target=\"_blank\">12 Social Enterprise Business Ideas and Business Models<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Causeartist<\/font>","source.href":"https:\/\/www.causeartist.com","source.title":"Causeartist","query":"https:\/\/news.google.com\/rss\/search?q=\"Recyclable materials\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"In an era characterized by a growing emphasis on social and environmental responsibility, social enterprises have emerged as powerful solutions to address pressing global challenges. These innovative ventures combine the entrepreneurial spirit with a deep commitment to making a positive impact on society and the planet. By leveraging market-based strategies, social enterprises harness their resources and expertise to tackle issues such as poverty, inequality, climate change, education, and healthcare. With their unique ability to generate both financial returns and social value, social enterprise business ideas have gained significant traction, attracting passionate entrepreneurs, investors, and consumers who seek purpose-driven solutions. In this dynamic landscape, social enterprise stands as a beacon of hope, demonstrating that businesses can thrive while driving meaningful change. Social Enterprise Business Ideas Eco-Friendly Product Manufacturing Create and sell sustainable products such as reusable bags, eco-friendly cleaning supplies, or solar-powered gadgets. The eco-friendly product manufacturing business model centers around producing and promoting sustainable and environmentally friendly products. It recognizes the urgent need to reduce the ecological footprint of manufacturing processes and consumer goods, aiming to minimize waste, conserve resources, and mitigate the impact on the environment. At its core, the business model focuses on developing and manufacturing products using sustainable materials and processes. This includes utilizing recycled, upcycled, biodegradable, renewable, and non-toxic materials as alternatives to traditional materials that have harmful environmental impacts. The eco-friendly product manufacturing model prioritizes the use of responsibly sourced materials, such as organic fibers, sustainably harvested wood, and non-toxic dyes and coatings. The business model also encompasses efficient and environmentally conscious manufacturing practices. This includes optimizing production processes to minimize waste generation, energy consumption, and greenhouse gas emissions. It may involve implementing circular economy principles, such as recycling or reusing materials, and adopting eco-design approaches that consider the entire lifecycle of the product. To sustain the eco-friendly product manufacturing business model, partnerships and collaborations are often established. These collaborations may involve working with suppliers, research institutions, and other like-minded businesses to develop and source sustainable materials. Additionally, partnerships with retailers and e-commerce platforms can help increase the market reach and visibility of eco-friendly products. Community-Supported Agriculture (CSA) Start a farm and sell produce directly to local consumers through a subscription-based CSA model. The Community-Supported Agriculture (CSA) business model is a unique approach to agriculture that fosters a direct connection between farmers and their local communities. Rooted in the principles of mutual support and sustainable farming practices, CSA offers an alternative to conventional food production and distribution systems. In a CSA, members of the community become active participants in the agricultural process by purchasing shares or memberships directly from the farmer or farm cooperative. In return, they receive a regular supply of fresh, seasonal produce throughout the growing season. This model promotes transparency, accountability, and a sense of shared responsibility, as consumers have a direct stake in the success of the farm and the quality of the food they receive. CSA not only ensures a reliable market for farmers, but it also strengthens the local food system, promotes environmental stewardship, and builds stronger community bonds. By supporting local agriculture and enjoying the benefits of fresh, nutritious food, CSA members actively contribute to a more sustainable and resilient food system for themselves and future generations. Fair Trade Coffee Shop Open a coffee shop that exclusively serves fair trade coffee, supporting small-scale farmers and promoting ethical sourcing. The Fair Trade coffee shop business model embodies a commitment to ethical sourcing, social responsibility, and sustainable practices. Fair Trade principles ensure that coffee farmers in developing countries receive fair prices for their crops, enabling them to improve their livelihoods and invest in their communities. In a Fair Trade coffee shop, every cup of coffee served is sourced from certified Fair Trade cooperatives or small-scale farmers who adhere to rigorous social, environmental, and economic standards. By establishing direct relationships with these producers, Fair Trade coffee shops foster transparency and long-term partnerships based on mutual respect and trust. Beyond sourcing, Fair Trade coffee shops prioritize creating a positive impact throughout their entire supply chain. They emphasize environmentally friendly practices, such as using organic or shade-grown coffee beans and promoting sustainable farming methods that preserve biodiversity. These shops also strive to provide fair and safe working conditions for their own employees, paying fair wages, offering training and development opportunities, and cultivating a supportive work environment. By embracing the Fair Trade coffee shop model, entrepreneurs not only contribute to the well-being of coffee farmers and their communities but also tap into a growing consumer demand for ethical and socially responsible products. These establishments serve as catalysts for change, inspiring other businesses to adopt fair trade principles and driving industry-wide transformation towards a more equitable and sustainable coffee trade. Recycling and Upcycling Establish a business that collects and repurposes recyclable materials or transforms waste into valuable products. The recycling and upcycling business model champions the ideals of environmental sustainability, resource conservation, and creative innovation. It operates on the premise that waste can be transformed into valuable resources through innovative processes and products. Recycling involves the collection and processing of materials such as paper, plastic, glass, and metal to be reprocessed into new products. On the other hand, upcycling takes the concept further by repurposing discarded materials into higher-value items with enhanced functionality or aesthetic appeal. Recycling and upcycling businesses play a crucial role in diverting waste from landfills and reducing the environmental impact of production processes. By collecting and processing recyclable materials, these businesses contribute to the conservation of natural resources, the reduction of energy consumption, and the prevention of pollution associated with the extraction and manufacturing of virgin materials. Furthermore, by upcycling materials that would otherwise be considered waste, they encourage creativity and offer sustainable alternatives to conventional products. Skill Training for Underprivileged Youth Provide vocational training and employment opportunities to disadvantaged young individuals, empowering them with marketable skills. The Skill Training for Underprivileged Youth business model focuses on empowering and uplifting disadvantaged young individuals by providing them with essential skills and training opportunities. This model recognizes that access to quality education and vocational training can be a transformative force in breaking the cycle of poverty and creating sustainable livelihoods. The business model typically involves partnering with local communities, non-profit organizations, and government agencies to identify underprivileged youth who lack access to formal education or vocational training. Through various training programs, these young individuals are equipped with practical skills and knowledge that are in demand in the job market. The training may encompass a wide range of fields such as computer literacy, technical skills, entrepreneurship, communication, and personal development. To sustain the model, the business seeks support through grants, sponsorships, and partnerships with corporations, foundations, and government entities that share a commitment to social impact. These collaborations provide financial resources, infrastructure, and expertise necessary for delivering effective training programs. Additionally, the business may also explore revenue-generating avenues, such as offering fee-based training services to individuals or organizations outside the target group. The success of this business model lies in its ability to provide not only technical skills but also comprehensive support to underprivileged youth. This may include mentorship, career counseling, job placement assistance, and ongoing support to ensure their successful integration into the workforce. By addressing both skill gaps and social barriers, this model aims to empower young individuals to become self-reliant, contribute to their communities, and realize their full potential. Socially Responsible Fashion Brand Launch a clothing line that promotes ethical manufacturing practices, fair wages, and sustainable materials. The socially responsible fashion brand business model combines the principles of sustainability, ethical sourcing, and social impact to create a positive and transformative approach to the fashion industry. This model recognizes the significant environmental and social challenges associated with conventional fashion practices and seeks to address them through responsible and mindful business practices. At the core of this business model is a commitment to sustainable sourcing and production methods. Socially responsible fashion brands prioritize the use of environmentally friendly materials, such as organic cotton, recycled fabrics, and natural dyes, to minimize their ecological footprint. They also strive to reduce waste and adopt circular economy principles by incorporating upcycling, recycling, and garment repair programs into their operations. In addition to environmental sustainability, these brands are deeply invested in ensuring fair and ethical treatment throughout their supply chains. They work closely with suppliers and manufacturers to ensure safe and fair working conditions for garment workers, paying fair wages, and promoting workers’ rights. Socially responsible fashion brands often seek certifications such as Fair Trade, Global Organic Textile Standard (GOTS), or other recognized standards to provide transparency and accountability in their sourcing practices. Moreover, these brands prioritize transparency and consumer education. They share the stories behind their products, highlighting the artisans, communities, and sustainable practices involved in the production process. By fostering consumer awareness, they encourage responsible purchasing decisions and promote a shift towards conscious consumption. To sustain this business model, socially responsible fashion brands often adopt a direct-to-consumer approach or engage in partnerships with like-minded retailers. They may also collaborate with local artisans, cooperatives, and marginalized communities to create unique and culturally significant designs that preserve traditional craftsmanship and support local economies. Mobile Healthcare Clinics Develop mobile healthcare units that provide medical services to underserved communities, especially in remote areas. The mobile healthcare clinics business model is a dynamic and innovative approach to delivering medical care and healthcare services directly to underserved communities. These clinics, often housed in specially equipped vehicles, bring healthcare professionals, equipment, and resources to areas with limited access to healthcare facilities or where barriers such as transportation or distance prevent individuals from seeking timely medical attention. The mobile healthcare clinics model aims to bridge the gap in healthcare disparities by providing comprehensive and preventive healthcare services to vulnerable populations. These clinics are designed to be flexible and adaptable, offering a wide range of medical services such as general check-ups, vaccinations, health screenings, diagnostic tests, minor treatments, and health education. Key components of the mobile healthcare clinics model include highly trained healthcare professionals, including doctors, nurses, technicians, and support staff. These professionals provide essential medical care and education, addressing the specific healthcare needs of the target community. The clinics are equipped with necessary medical equipment, diagnostic tools, and medications to ensure quality care is provided on-site. To sustain the mobile healthcare clinics, partnerships with government agencies, non-profit organizations, and healthcare institutions are often forged. These collaborations may provide funding, operational support, and access to additional resources, enabling the clinics to reach a larger number of underserved individuals. Renewable Energy Solutions Offer installation and maintenance services for solar panels, wind turbines, or other renewable energy systems to reduce carbon emissions. The Renewable Energy Solutions business model revolves around harnessing and promoting sustainable sources of energy to meet the world’s growing energy demands while reducing environmental impact. This model recognizes the urgent need to transition from fossil fuels to renewable energy sources, such as solar, wind, hydro, geothermal, and bioenergy, to combat climate change and achieve a sustainable future. At its core, the business model focuses on developing, implementing, and managing renewable energy projects. This includes the installation and operation of renewable energy systems, such as solar panels, wind turbines, or hydroelectric plants, to generate clean and reliable energy. Additionally, the model encompasses energy storage solutions to store excess renewable energy for use during periods of low generation. The renewable energy solutions business model often involves various key components. These include technology and infrastructure development, resource assessment, project financing, regulatory compliance, and ongoing maintenance and monitoring of energy systems. Companies operating within this model work closely with government agencies, research institutions, and investors to ensure the successful implementation and scaling of renewable energy projects. To sustain the business model, revenue streams may come from multiple sources. These include selling generated renewable energy to utility companies through power purchase agreements, offering energy management and consulting services, providing equipment installation and maintenance, or even engaging in energy trading within local or regional markets. Community-Based Tourism Organize sustainable and responsible tours that benefit local communities economically and culturally. The Community-Based Tourism (CBT) business model centers around empowering local communities and fostering sustainable development through tourism activities. It aims to create a mutually beneficial relationship between travelers and communities, allowing visitors to experience the local culture, traditions, and natural resources while generating economic opportunities and preserving the community’s heritage. At the heart of the CBT business model is active community involvement and ownership. Local residents actively participate in decision-making, planning, and management processes, ensuring that tourism activities align with their cultural values, aspirations, and environmental priorities. By actively engaging community members, CBT promotes social inclusivity, cultural preservation, and a sense of pride and ownership over the tourism initiatives. CBT businesses often offer a diverse range of experiences, including homestays, guided tours, cultural performances, handicraft demonstrations, and immersive activities that provide visitors with an authentic and interactive understanding of the community’s way of life. These experiences are often designed to be small-scale, low-impact, and respectful of the environment and local traditions. The CBT business model typically involves capacity building and training programs for community members, equipping them with the necessary skills to engage with visitors and manage tourism-related activities effectively. This may include training in hospitality, language skills, guiding techniques, and entrepreneurship, enabling community members to take an active role in welcoming and hosting travelers. To sustain the CBT business model, it is essential to establish partnerships and collaborations with tourism organizations, travel agencies, and government entities. These partnerships can provide marketing support, access to wider networks, and technical assistance while ensuring compliance with legal and regulatory requirements. Socially Conscious Food Truck Operate a food truck that serves healthy, locally sourced meals, with a portion of profits supporting hunger relief programs. The socially conscious food truck business model combines the popularity and mobility of food trucks with a deep commitment to social and environmental responsibility. It aims to offer delicious, high-quality food while addressing pressing societal issues and promoting sustainable practices within the food industry. At its core, the socially conscious food truck model places a strong emphasis on the sourcing and preparation of ingredients. These food trucks prioritize local, organic, and ethically sourced ingredients, supporting local farmers and sustainable agricultural practices. By sourcing ingredients responsibly, they aim to minimize their ecological footprint and promote the health and well-being of both consumers and the environment. Additionally, the food truck model often incorporates social impact initiatives into its operations. This may involve partnering with local non-profit organizations or community projects to address food insecurity, support marginalized communities, or promote social causes. For instance, some socially conscious food trucks may donate a portion of their profits to charitable organizations or implement “buy one, give one” models, where a meal is donated for each meal purchased. Moreover, the socially conscious food truck business model actively engages with customers, fostering awareness and education about sustainable and socially responsible food practices. Food truck operators often share information about the sourcing of ingredients, the benefits of sustainable food choices, and the impact of their social initiatives. By engaging customers in these conversations, they aim to inspire individuals to make informed choices about their food consumption and support businesses that prioritize social and environmental well-being. To sustain the socially conscious food truck model, collaboration and partnerships are vital. This may involve collaborations with local farmers, food cooperatives, and other socially conscious businesses to ensure a reliable supply chain of sustainable ingredients. Additionally, working with event organizers, community festivals, and corporate clients can provide opportunities to reach a wider audience and spread their message of social consciousness. Sustainable Packaging Solutions Develop and sell environmentally friendly packaging alternatives, such as biodegradable or compostable materials. The sustainable packaging solutions business model is built on the premise of providing environmentally friendly alternatives to traditional packaging materials and practices. It recognizes the urgent need to reduce waste, conserve resources, and mitigate the environmental impact of packaging throughout its lifecycle. At its core, the business model focuses on developing and offering sustainable packaging options that prioritize materials with lower environmental footprints. This includes utilizing recyclable, compostable, biodegradable, and renewable materials as alternatives to single-use plastics and other non-recyclable packaging options. These materials may include bio-based plastics, paperboard, bamboo, mushroom-based packaging, and other innovative materials that are sourced responsibly and have minimal impact on the environment. The sustainable packaging solutions business model also encompasses design and innovation. Companies within this model strive to create packaging solutions that are lightweight, space-efficient, and optimized for transportation and storage. This minimizes the carbon footprint associated with packaging logistics and reduces waste generation throughout the supply chain. To sustain the business model, partnerships and collaborations are crucial. Sustainable packaging companies often work closely with product manufacturers, retailers, and e-commerce platforms to integrate sustainable packaging solutions into their operations. This collaboration may involve providing consulting services, customized packaging designs, and supply chain management to ensure the successful implementation of sustainable packaging strategies. Microfinance Initiatives Create a microfinance organization that provides small loans and financial services to aspiring entrepreneurs in low-income communities, enabling them to start or expand their businesses. The microfinance business model revolves around providing financial services to individuals and small businesses who lack access to traditional banking services. It aims to address financial inclusion, alleviate poverty, and promote entrepreneurship by offering small loans, savings accounts, and other financial products tailored to the needs of underserved communities. At the core of the microfinance initiatives business model is the belief in the potential and capabilities of individuals to lift themselves out of poverty given access to financial resources. These initiatives typically target low-income individuals, marginalized groups, and micro-entrepreneurs who face barriers in accessing formal financial institutions due to lack of collateral, limited credit history, or geographical constraints. Microfinance initiatives operate by establishing specialized financial institutions, such as microfinance banks, credit unions, or non-profit organizations. These institutions provide small loans, often referred to as microcredit, to individuals and businesses to support income-generating activities, expand existing businesses, or cover emergency expenses. In addition to credit, microfinance initiatives may also offer savings accounts, insurance products, and financial education to empower individuals with financial knowledge and resilience. To sustain the microfinance initiatives business model, a combination of funding sources is typically utilized. This may include a mix of commercial investments, grants, donations, and government support. Additionally, microfinance institutions often operate on a self-sustaining model, where the interest earned from loan repayments helps cover operational costs and further expand the reach of financial services.","filter_flag":1}
