{"title":"Recycling FAQ","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fwww.rit.edu%2fsustainablecampus%2frecycling-faq&c=17820183830922000471&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fwww.rit.edu%2fsustainablecampus%2frecycling-faq&c=17820183830922000471&mkt=en-us","summary":"When materials are properly recycled, they can be made in new products and let raw materials have to be ... Glass that is processed in mixed recycling Material Recovery Facilities (MRF), is typically ...","published":"Thu, 01 Aug 2019 02:08:00 GMT","published_parsed":"time.struct_time(tm_year=2019, tm_mon=8, tm_mday=1, tm_hour=2, tm_min=8, tm_sec=0, tm_wday=3, tm_yday=213, tm_isdst=0)","news_source":"Rochester Institute of Technology","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycling FAQ","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"When materials are properly recycled, they can be made in new products and let raw materials have to be ... Glass that is processed in mixed recycling Material Recovery Facilities (MRF), is typically ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Material recovery\" \"new products\"&format=rss","text":"Plastic bottles, jugs, jars and tubs are the main types of containers accepted for recycling. Acceptable plastic containers are frequently found in kitchens and bathrooms. Bottles: are defined with a neck or mouth smaller than the base. Drink bottles are the most common, but even squeeze bottles (like ketchup or dish soap) and pump or spray bottles (like hand soap and cleaning products) are acceptable. Jugs: are plastic containers with a neck smaller than the base, and have handle. Milk, vinegar, laundry detergent, and windshield fluid are examples of acceptable jugs. Jars: are wide mouth containers that typically close with a screw cap. Peanut butter, mayonnaise, and sauce are examples of acceptable plastic jars. Tubs: are containers with a mouth the same size or larger than the base and generally have a separate snap-on lid. Dairy products such as butter, margarine, and sour cream are examples of acceptable plastic tubs. Single-serve yogurt containers are also acceptable. Even though more and more types of packaging are now made from plastic, not everything is recyclable. Size, shape, and the type of plastic all play a role in recyclability. Recycle plastics by shape, not by number. If it is a plastic bottle, jug, jar or tub then:","filter_flag":1}
{"title":"Trackers Placed in Amazon Packaging Reveal What Really Happens to Store Drop-Off Recycling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fgizmodo.com%2fgateway%2ftrackers-placed-in-amazon-packaging-reveal-what-really-1851352607&c=14293307053273207001&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fgizmodo.com%2fgateway%2ftrackers-placed-in-amazon-packaging-reveal-what-really-1851352607&c=14293307053273207001&mkt=en-us","summary":"From there, this plastic, known as “film,” will go to a specialized facility and be turned into new products. The problem ... fraction of Amazon’s plastic packaging makes it to a material recovery ...","published":"Mon, 17 Jun 2024 20:57:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=17, tm_hour=20, tm_min=57, tm_sec=0, tm_wday=0, tm_yday=169, tm_isdst=0)","news_source":"Gizmodo","news_image":"http:\/\/www.bing.com\/th?id=OVFT.YixtM8q2AjdHA7Gpne906y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":200.0,"news_imagemaxheight":200.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Trackers Placed in Amazon Packaging Reveal What Really Happens to Store Drop-Off Recycling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"From there, this plastic, known as “film,” will go to a specialized facility and be turned into new products. The problem ... fraction of Amazon’s plastic packaging makes it to a material recovery ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Material recovery\" \"new products\"&format=rss","text":"This story was originally published by Grist. Sign up for Grist’s weekly newsletter here. Feeling guilty about all those blue-and-white plastic Amazon bags piling up around the house? Fear not — they can be recycled! At least, that’s what the packaging says. For years now, Amazon’s plastic bags, bubble-lined mailers, and air pillows have featured the ubiquitous “chasing arrows” recycling symbol along with the words “store drop-off.” The idea is simple: Since most curbside recycling programs don’t accept this type of plastic — it’s too expensive to process and can clog machines — consumers can instead leave it at retail stores across the country. From there, this plastic, known as “film,” will go to a specialized facility and be turned into new products. The problem, however, is that the system doesn’t seem to be working. An investigation published Tuesday by the nonprofits Environment America and U.S. Public Interest Research Group, or U.S. PIRG, suggests that only a small fraction of Amazon’s plastic packaging makes it to a material recovery facility, the term for operations that sort glass, metal, plastic, and other items for recycling. The packaging is much more likely to end up in a landfill, incinerator, export terminal, or in the hands of a company that downcycles plastic film into things like benches. The report adds to a growing body of evidence suggesting that store drop-off programs are an ineffective solution to the escalating plastic pollution crisis. According to environmental groups, these programs help justify the ongoing production of single-use plastic, helping manufacturers and retailers evade accountability while alleviating consumer guilt. “The store drop-off system is really not working, and plastic film is not recyclable,” said Jenn Engstrom, state director of U.S. PIRG’s California chapter and a co-author of the report. To find out what happens to Amazon’s plastic packaging, U.S. PIRG and Environment America attached small tracking devices — mostly Apple AirTags — to 93 bundles of Amazon plastic packaging marked for store drop-off and deposited them at retailers in 10 states. These stores, which were listed in an online directory, included mostly supermarkets like Safeway, Sprouts, Publix, Fred Meyer, QFC, and Whole Foods, although some bundles were placed at outlets like Kohl’s or Home Depot. The report authors were able to determine the fate of about half the bundles, since, as expected, many of the trackers likely died before reaching a final destination. Of those that survived, 13 went to a landfill, two went to a waste incinerator, and three went to the Port of Los Angeles, suggesting that the bundles were destined for processing or disposal overseas. Only four trackers eventually made their way to a material recovery facility that sorts plastics for recycling. U.S. PIRG and Environment America said they were able to contact three of those facilities: Two specifically said they do not accept Amazon packaging, and the third said it accepts only paper and cardboard. Two dozen trackers ended up in the hands of Trex, a company that makes benches and decking out of discarded plastic. But U.S. PIRG and Environment America question whether Trex is using Amazon packaging in its products; the contents of store drop-off bins are often littered with food and beverages, likely rendering this plastic too contaminated to use in manufacturing. Trex did not respond to Grist’s request for comment, but a similar company reports getting 70 to 80 percent of its plastic from “back-of-the-house shrink wrap,” referring to the material wrapped around shipping pallets, which tends to be cleaner than postconsumer plastic. Meanwhile, a Trex executive told Bloomberg News last year that there is not enough demand for recycled material to make store drop-off successful. “All the claims the companies are making are just greenwashing,” he told Bloomberg. “Recycling’s failed.” While USPIRG and Environment America’s investigation may be the largest of its kind, it isn’t the first to find flaws in the store drop-off system. Last year, Bloomberg tracked 30 bundles of packaging and wrappers marked with the store drop-off icon and found that 13 of them — more than 40 percent — ended up at U.S. landfills. Just four made it to locations that can recycle plastic. A similar effort from ABC News found that about half of 46 bundles of plastic bags went to landfills and incinerators, while only four went to facilities “that say they are involved with recycling plastic bags.” Jan Dell, an independent chemical engineer and founder of the environmental nonprofit The Least Beach Cleanup, has been deploying her own trackers too. Since December 2022, she hasn’t traced a single bundle of film labeled for store drop-off to U.S. facilities that can turn the material into new bags. Twelve bundles have been sent to a landfill or waste station, and one to an incinerator. Four appeared to have traveled to Mexico, Vietnam, or Malaysia, countries that generally lack adequate recycling infrastructure. “They’re absolutely lying with these labels,” Dell said. The store drop-off system has “never worked, it was never true.” The labels in question are produced by an initiative called How2Recycle, which began selling them to big companies in 2012 — supposedly to clear up confusion among consumers and retailers about which products could be recycled. The initiative issues several versions of the recycling icon, with the one marked “store drop-off” reserved for products, like plastic bags and film, that aren’t accepted in curbside recycling programs. The store drop-off labels direct consumers to How2Recycle’s website, which links to a directory of retail locations with ]collection receptacles. Until last year, that directory was found at BagandFilmDirectory.org and featured more than 18,000 locations — but the consulting firm managing it shut it down following ABC News’ investigation, citing a lack of “real commitment from the industry,” as well as insufficient funding. Many of the locations listed did not actually have a receptacle, while the Target and Walmart locations appeared to be disposing of, rather than recycling, much of the film they received. “There’s more of an illusion of stuff getting recycled than there actually is because there is an imbalance in supply and demand,” Nina Butler, CEO of the consulting firm, told ABC News. How2Recycle now links customers to a different directory hosted at Earth911. How2Recycle did not respond to Grist’s request for comment. As scrutiny has increased over the use of the store drop-off label, some companies have pledged to stop using it altogether. Mondelez, which owns brands including Oreo and Ritz, said in March 2023 that it plans to phase out the label by 2025. Dell said she’s also noticed the label’s disappearance from packaging sold by Target and Georgia Pacific, a company that sells toilet paper, paper towels, and other pulp products. Target and Georgia Pacific did not respond to Grist’s request for comment. Read Next: Inside the industry push to label your yogurt cup ‘recyclable’ Amazon, for its part, did not respond to Grist’s questions about its use of the store drop-off label. When Dell asked the company, during a Zoom meeting in 2020 that she shared with Grist, to provide evidence that its packaging is widely recycled through the store drop-off program — as required by California law — an Amazon spokesperson told the state recycling commission that the company has “really high confidence that store drop-off is a solution that is available in California.” Pat Lindner, Amazon’s vice president of mechatronics and sustainable packaging, told Grist that the company has no control over how its packaging is handled “once it has been disposed of by municipalities or recycling centers.” A spokesperson said the company is investing in better recycling infrastructure while also reducing plastics use overall. As of last year, for example, Amazon has eliminated plastic from shipments delivered in Europe, likely in response to EU regulations banning several categories of single-use plastic. The company also eliminated plastic packaging in India after Prime Minister Narendra Modi pledged to ban single-use plastic nationwide by 2022. In the U.S. last year, Amazon launched an automated fulfillment center in Euclid, Ohio, that uses paper exclusively instead of plastic packaging, and the company said it’s ramping up a program to ship items in their original packages instead of extra plastic ones. The company also said in a 2022 sustainability report that it was “phasing out padded bags containing plastics in favor of recyclable alternatives,” but the spokesperson did not address Grist’s request to clarify the timeline for this transition. Environmental advocates agree that Amazon has made progress, but say it should be doing more to reduce the hundreds of millions of pounds of single-use plastic trash it generates every year — and that it should remove the How2Recycle symbol from its packaging. In California, where state legislation often sets a national standard, a truth-in-advertising law signed by the governor in 2021 may soon restrict the use of store drop-off labels unless companies can prove that the system is effective. A separate law will require single-use plastic packaging sold in the state to be demonstrably recycled at least 65 percent of the time by 2032, a threshold that may push manufacturers toward paper, which is far easier to recycle. This article originally appeared in Grist at https:\/\/grist.org\/accountability\/amazon-says-its-plastic-packaging-can-be-recycled-an-investigation-finds-it-usually-isnt\/. Grist is a nonprofit, independent media organization dedicated to telling stories of climate solutions and a just future. Learn more at Grist.org","filter_flag":1}
{"title":"Inside the Industry Push to Label Your Yogurt Cup ‘Recyclable’","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fgizmodo.com%2fgateway%2finside-the-industry-push-to-label-your-yogurt-cup-recy-1849652108&c=6882283067572922517&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fgizmodo.com%2fgateway%2finside-the-industry-push-to-label-your-yogurt-cup-recy-1849652108&c=6882283067572922517&mkt=en-us","summary":"It’s usually less economical to sort out polypropylene for recycling than to simply discard it and make new products from virgin material ... shows that only half of the country’s 373 material ...","published":"Tue, 18 Jun 2024 05:14:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=18, tm_hour=5, tm_min=14, tm_sec=0, tm_wday=1, tm_yday=170, tm_isdst=0)","news_source":"Gizmodo","news_image":"http:\/\/www.bing.com\/th?id=OVFT.YixtM8q2AjdHA7Gpne906y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":200.0,"news_imagemaxheight":200.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Inside the Industry Push to Label Your Yogurt Cup ‘Recyclable’","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"It’s usually less economical to sort out polypropylene for recycling than to simply discard it and make new products from virgin material ... shows that only half of the country’s 373 material ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Material recovery\" \"new products\"&format=rss","text":"This story was originally published by Grist. You can subscribe to its weekly newsletter here. Plastic recycling labels are everywhere: The ubiquitous “chasing arrows” symbol adorns everything from plastic bags and water bottles to kids’ toys. Most commonly, these symbols appear with a number — 1 through 7 — that identifies the type of plastic resin a product is made of. A number 1, for instance, corresponds to polyethylene terephthalate, or PET — the stuff that makes up water bottles. Number 6 is for polystyrene, used in foam cups and trays. The plastics industry insists these icons were never meant to indicate a product’s recyclability, even though that is how they are often perceived by consumers. In fact, most plastics are not recyclable, largely because there is no market for materials labeled 3 through 7. But that hasn’t stopped the widespread use of the chasing arrows. With no federal program to evaluate products’ recyclability and issue labels for them, third-party organizations have stepped in to play this role instead. One organization in particular, How2Recycle, has devised an elaborate hierarchy with several versions of its own recycling symbol, which it sells to hundreds of companies ranging from Lowe’s to Beyond Meat. The organization, whose parent nonprofit is based in Virginia, says it analyzes waste management systems nationwide to figure out whether companies’ products and packaging are recyclable and then issues a corresponding label. It’s ostensibly an attempt to clear up confusion among consumers about what should and shouldn’t go into the blue bin. The group describes its markers as “recycling labels that make sense.” This summer, How2Recycle declared a big victory for the companies it sells labels to: It now considers a wide set of products made from polypropylene, or PP — the resin corresponding to the number 5 — to be “widely recyclable,” meaning the organization thinks that more than 60 percent of Americans have access to a curbside or drop-off recycling program that accepts them. Polypropylene accounts for about 14 percent of the U.S.’s plastic production. The announcement makes polypropylene tubs, bottles, and jars — things like yogurt containers and ketchup bottles — eligible for How2Recycle’s top-tier recycling label: a chasing arrows symbol with no qualifications. But industry experts and environmental advocates have raised their eyebrows. Based on federal recycling data, independent national waste management surveys, and firsthand accounts from material sorting facilities, polypropylene recycling isn’t nearly as widespread as How2Recycle’s labeling implies. Even if PP products were technically accepted by facilities that serve a majority of Americans — which researchers say they are not — polypropylene is much more commonly landfilled or incinerated than turned into new products. This is because it is often filled with toxic chemical additives or contaminated with food waste, both of which make it difficult to turn it into new products. It’s usually less economical to sort out polypropylene for recycling than to simply discard it and make new products from virgin material. “Post-consumer PP packaging and products have never been recyclable or recycled … above a few percent,” said Jan Dell, an independent chemical engineer and founder of the advocacy group The Last Beach Cleanup. Through How2Recycle, she said, plastic and packaging companies are “creating their own non-verified data” and ignoring key provisions of the Federal Trade Commission’s Green Guides, a set of requirements meant to prevent companies from making deceptive claims about the environmental benefits of their products. As a result, Dell said, the industry has been allowed to deepen the public’s confusion about recycling, gulling people and policymakers into thinking that it will be able to keep pace with plastic manufacturers’ plans to dramatically scale up production. How2Recycle is part of a labyrinth of organizations and industry membership programs that promote “sustainable materials management.” When it officially launched in 2012, the organization branded itself as an attempt to clear up confusion among consumers about what they could recycle. Many companies — including Yoplait, Costco, REI, and Microsoft — were quick to sign on, eager to affix How2Recycle’s labels to their products. The program took the onus off of individual companies for claims about recyclability. How2Recycle would do all the necessary research into specific products’ recycling rates and community access to recycling programs, allowing participants to rest assured that their recycling labels were compliant with federal law. Today, more than 400 companies pay annual membership fees to place How2Recycle labels on their packages, including Amazon, Clif Bar, Walmart, Johnson & Johnson, and Starbucks. At the top of How2Recycle’s labeling hierarchy is a simple “chasing arrows” recycling symbol, which the organization gives to products that it says are accepted by curbside or drop-off recycling programs that serve at least 60 percent of the American population. This is the label that How2Recycle said in late July some polypropylene products would now be eligible for. Previously, in 2020, the organization had downgraded PP products from the unqualified chasing arrows to a “Check Locally” label that instructed consumers to verify whether their community’s recycling program would accept them. “As rigid polypropylene access, sortation, and end markets are on an upward trend across the U.S., we are excited to upgrade this packaging format,” Caroline Cox, How2Recycle’s director, said in a press release this summer. However, other sources paint a very different picture of the United States’ plastic recycling landscape — especially for polypropylene, which is far more difficult to turn into new products than How2Recycle’s labels make it seem. “It is not possible that 60 percent of Americans have access to established recycling systems that accept PP packaging of any type,” Dell, of The Last Beach Cleanup, said. First, she explained, industry data suggests that only 60 percent of Americans have access to any recycling program, let alone one that accepts polypropylene containers. Most facilities only accept plastics that are easier to recycle, such as bottles made of PET. And additional data that Dell is compiling for 2022 shows that only half of the country’s 373 material recovery facilities, or MRFs — specialized plants that process and sort all the items people toss in their blue bins — say they accept polypropylene tubs, one of the most recyclable PP products out there (think margarine containers and cottage cheese cups). As a result, only 28 percent of Americans have access to recycling programs that accept these polypropylene containers. “Overall accessibility for plastic recycling has dropped, if anything,” said John Hocevar, Greenpeace’s oceans campaign director. In recent years, labor shortages and high prices for recycled materials have caused cuts in curbside recycling programs, and many MRFs have stopped accepting most plastic resins. What’s more, Hocevar and others argue that the accessibility of recycling programs is a distraction from a more important metric: the real recycling rate. Just because polypropylene is collected doesn’t mean it will ultimately be recycled. According to the most recent available data from the Environmental Protection Agency, only 2.7 percent of polypropylene “containers and packaging” were recycled in 2018. If you include all forms of polypropylene, that number falls to just 0.6 percent. One reason PP is difficult to recycle is that it’s not as clean or pure as other kinds of plastic. Unlike products made from PET or high-density polyethylene (HDPE) — labeled with the numbers 1 and 2, respectively — polypropylene products, labeled with the number 5, often contain toxic additives that make it difficult to turn them back into usable items. Another reason is that PP is typically collected in bales of mixed plastic that include a variety of resins labeled with the numbers 3 through 7. In order to be recycled, PP must be picked out of these bales and then sold to an extremely limited number of facilities that will actually accept that plastic. (​​In 2020, Greenpeace estimated that the U.S. only had enough processing capacity to recycle less than 5 percent of its PP waste.) The whole process is prohibitively expensive, especially since the final product must be competitively priced against virgin plastics. According to the EPA, the U.S. generated more than 8 million tons of polypropylene waste in 2018, the most recent year for which data are available. Jeff Donlevy, a member of California’s Statewide Commission on Recycling Markets and Curbside Recycling and general manager of Ming’s Recycling, a company based in northern California, said that many facilities continue to accept polypropylene — even if they have no intention of recycling it — because of outdated, 10-or-more-year contracts with cities. At the time when many of these contracts were signed, MRFs said they would accept polypropylene because they could send mixed plastic bales to China for sorting and recycling. But in 2018, when China enacted its “National Sword” policy and closed its borders to most plastic waste imports, U.S. MRFs were saddled with a glut of resins that are uneconomical and logistically difficult to turn into new products. Of the roughly 80 MRFs in California, Donlevy said the vast majority are not recycling plastics made of resins labeled number 3 and above. This includes polypropylene, number 5. Most facilities are “just landfilling whatever number 5 they get,” he said. How2Recycle says on its website that it takes four factors into account when determining a product’s recyclability — collection, sortation, reprocessing, and end markets — but it is not transparent about the exact methodology it uses to evaluate these criteria. Much of its data comes from an industry report conducted by How2Recycle’s parent organization that looks at a “non-random” sample of large recycling programs throughout the U.S., along with a random sample of recycling programs in smaller communities. In the most recent edition of the report, these censuses consisted of web searches for each recycling program to determine what kinds of plastic they accept. Environmental advocates question the results of these analyses, but they say the larger issue is that How2Recycle fails to say anything about the real recycling rate of PP products. Again, the “widely recyclable” label is only supposed to reflect a material’s acceptance by curbside and drop-off recycling programs. But this information is not printed on the organization’s unconditional recycling labels. Donlevy said this oversight “misleads the public.” It may also contravene sustainable packaging guidelines from the Federal Trade Commission, or FTC, a government agency that promotes consumer protection. By slapping recycling labels without qualifiers onto polypropylene tubs and other containers, How2Recycle appears to be ignoring key provisions of the FTC’s Green Guides, a set of detailed but nonbinding requirements for claims about products’ environmental benefits. The U.S. government does not have a program to issue or approve recycling labels, so this is the primary check for labels created by private groups. At the broadest level, the FTC says it is deceptive to “misrepresent, directly or by implication, that a product or package is recyclable.” This means that companies should not use a recycling label without qualifiers — like How2Recycle’s gold standard chasing arrows symbol — unless they can prove that recycling facilities for their labeled products are available to at least 60 percent of consumers. Critically, the commission also calls on companies to substantiate that these facilities “will actually recycle, not accept and ultimately discard” labeled products. Marketers “should not assume that consumers or communities have access to a particular recycling program merely because the program will accept a product,” the FTC says in the Green Guides’ statement of basis and purpose. Although the guides aren’t legally binding, activity that is inconsistent with them can be used as evidence of a violation of the FTC Act’s provisions on “Unfair or Deceptive Acts or Practices” and can result in fines or additional rulemaking. State governments can also cite the Green Guides when building false advertising or consumer protection cases. Dell lamented that the FTC has never, to her knowledge, taken action to stop a company from misusing an unqualified recycling label. But courts have. Take, for example, a 2018 lawsuit filed by a consumer against Keurig over claims that the company’s polypropylene coffee pods were “recyclable.” Keurig argued that its labels were consistent with the Green Guides, but a U.S. District Court in California disagreed and refused to dismiss the case. The court said that even if the coffee pods were technically collected by municipal recycling programs, they were not in practice being recycled. Keurig settled the case this year for $10 million and has changed the labels on its coffee pods. Greenpeace argues that How2Recycle is using similar sleight with its own labels, claiming recyclability with insufficient substantiation. “Polypropylene does not come close to meeting the requirements” for recycling labels laid out by the FTC, the organization said in a press release. It is neither accepted at recycling facilities that serve 60 percent of the population nor actually recycled at a significant rate. In response to Grist’s request for comment, Paul Nowak — executive director of How2Recycle’s parent organization, GreenBlue — said that How2Recycle’s labels not only satisfy the Green Guides’ requirements but “go beyond them.” Although How2Recycle does not have internal data on the real recycling rate for polypropylene, Nowak said How2Recycle has reviewed “letters of support” from MRFs saying that they plan to expand their recycling capacity for polypropylene. Nowak declined to share these letters with Grist. How2Recycle’s website offers some clarification. Although the organization claims to consider “sortation” and “reprocessing” for products that will feature its labels, How2Recycle explains online that it ultimately does not take into account the real-world recycling rate when evaluating a product’s recyclability — in contrast to definitions of recyclability from other organizations, like the Ellen MacArthur Foundation, an international nonprofit that advocates for a circular economy. Nowak insists that How2Recycle spent “several months” verifying data on the increased recyclability of polypropylene. But Dell thinks there’s an irresolvable conflict of interest at play, since How2Recycle and the organizations whose data it cites are run and funded by companies that make and sell plastics. “We’ve got all these front groups funded by the plastics and products industry to create and perpetuate the myth that plastics are recyclable,” she said. The recent push to make polypropylene “widely recyclable” started outside How2Recycle, with a separate industry group called the Recycling Partnership — a nonprofit whose board of directors includes executives for major brands and plastic industry groups: Keurig Dr. Pepper, Nestlé, the Association of Plastic Recyclers, and the American Beverage Association, among others. The organization lists roughly 80 “funding partners” on its website, including two of North America’s main petrochemical industry trade groups, the American Chemistry Council and the Plastics Industry Association. In 2020, a few months after How2Recycle downgraded PP products to only be eligible for the “Check Locally” label, the Recycling Partnership launched a new initiative — directly funded by many plastic brands and industry trade groups — to “ensure the long-term viability of polypropylene.” The Recycling Partnership claims it contributed to a spike in polypropylene recycling over the past two years through a series of 24 grants worth $6.7 million. The group did not respond to Grist’s request for more information, but a press release notes that the funding helped “support sorting improvements and community education across the U.S.” According to the Recycling Partnership, these grants increased the amount of polypropylene recovered by 25 million pounds annually. Now, the group says its proprietary “National Recycling Database” shows 65 percent of Americans having access to PP recycling. According to Nowak, the Recycling Partnership approached How2Recycle with this data in early 2022, requesting that How2Recycle reevaluate its labeling for polypropylene. After what Nowak described as a lengthy evaluation process, he said the data matched what he was seeing with How2Recycle’s own analysis, as well as information provided by an outside consulting firm. In response to Grist’s request for comment, the consulting firm said it provided How2Recycle with access-to-recycling data and “end market” research to show there is a market for polypropylene that ultimately does get recycled. The firm did not share data on polypropylene’s real recycling rate and told Grist to reach out to the Recycling Partnership. How2Recycle, meanwhile, has its own web of connections to big brands and the plastics industry. The group’s parent organization, the Sustainable Packaging Coalition, is an industry working group whose members include Procter and Gamble, Coca-Cola, and the ExxonMobil Chemical Company, as well as a host of other plastic makers. GreenBlue, the umbrella organization that houses How2Recycle and the Sustainable Packaging Coalition, has a board of directors that includes executives from the Dow Chemical Company, Mars, the packaging companies Printpack and Westrock, and more. Nowak said he is aware of concerns over potential conflicts of interest, but that How2Recycle’s parent organizations are “very careful about who we start to work with.” At How2Recycle, he added, “we stay neutral in all that.” Dell has often spoken of the plastic labeling landscape as the “wild, wild West,” with “no sheriff in town” to protect consumers from deceptive recycling claims. The FTC, whose Green Guides may soon be updated for the first time since 2012, declined to comment on How2Recycle’s labeling system, and environmental advocates have expressed frustration that the commission hasn’t done more to enforce the guidelines. Without stronger government regulation, Dell said, “How2Recycle and the product companies have filled the void to become the deciders” of what should and shouldn’t bear the recycling label. But states are catching on. California passed nation-leading legislation last year making it illegal for companies to use the chasing arrows on products that are not actually being turned into new products. (In this case the state, rather than How2Recycle, will determine recyclability, and it will take into account both collection and the real recycling rate.) The law is expected to eliminate recycling symbols on virtually all plastic packaging that isn’t made of number 1 or number 2 resins, since those are the only kinds of plastic currently being recycled with significant regularity. It could have an impact on other states, too — if plastic manufacturers decide it is too cumbersome to create new product lines for the California market, they could decide to remove recycling symbols for the whole country. Hocevar of Greenpeace said the California bill is an important step in the right direction and called on other states to adopt similar policies. Environmental advocates have also cheered a separate effort from the California attorney general’s office, which announced in April that it was launching an investigation into the petrochemical industry’s “aggressive campaign to deceive the public” about the feasibility of recycling. To truly address the plastic pollution crisis, Hocevar and others say that the top priority should be turning off the tap — limiting the production of plastic that ultimately has to be dealt with. In the U.S., perhaps the most promising move in this direction is the proposed Break Free From Plastic Pollution Act, a far-reaching federal bill that would ban carryout plastic bags and other single-use plastic products, require plastics companies to launch and finance programs to manage the waste they produce, and place a moratorium on new petrochemical facilities until the EPA can undertake a comprehensive assessment of the industry’s environmental impact. In the meantime, Donlevy said that companies should stop trying to trick consumers into feeling good about their plastic consumption. “Producers have to realize they’re using plastic for their benefit and for the consumers’ benefit, which is fine,” he said. “But to put a recycling symbol and say that that cottage cheese or cream cheese or sour cream container is recyclable? You don’t need to do that, that’s not a part of the sales pitch. … The only plastics that are really getting recycled in the U.S. are number 1 and number 2 bottles.”","filter_flag":1}
{"title":"Can Semiconductor Chips be Recycled?","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fwww.azonano.com%2farticle.aspx%3fArticleID%3d6764&c=7769358327941345376&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2fwww.azonano.com%2farticle.aspx%3fArticleID%3d6764&c=7769358327941345376&mkt=en-us","summary":"Advancements in semiconductor recycling aim to reduce e-waste and environmental impact, with innovative separation and recovery techniques.","published":"Mon, 24 Jun 2024 04:38:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=4, tm_min=38, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"AZoNano","news_image":"http:\/\/www.bing.com\/th?id=OVFT.l676XgKzjebEGMZfjA2yuy&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":314.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Can Semiconductor Chips be Recycled?","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Advancements in semiconductor recycling aim to reduce e-waste and environmental impact, with innovative separation and recovery techniques.","query":"https:\/\/www.bing.com\/news\/search?q=\"Material recovery\" \"new products\"&format=rss","text":"Semiconductor chips, made primarily from silicon or germanium, are tiny electronic devices that form the basic building blocks of most electronic circuits. These chips power devices ranging from smartphones to computers and enable functionalities like GPS, smart cards, and data communications.1 Image Credit: jiang jie feng\/Shutterstock.com Innovative methods, such as open-loop recycling and integrated circuit reuse, have been developed to minimize environmental impact and optimize resource use. These advancements highlight the crucial role of recycling in sustaining the growth of the semiconductor industry and ensuring environmental protection. Semiconductor Chips in Modern Technology As semiconductor chips become more integral to modern technology, concerns over electronic waste (e-waste) grow due to the environmental and health risks posed by toxic materials. Recycling e-waste, including semiconductors, is essential for mitigating these risks, offering sustainable solutions like refurbishment, reuse, and material recovery.2,3 However, recycling semiconductors presents unique challenges due to their complex composition, requiring innovative approaches in both design and infrastructure.4 The semiconductor industry is at a critical point where advancements in recycling technologies and increased eco-conscious consumer demand drive the need for sustainable practices and regulatory compliance. From stringent laws to eco-friendly manufacturing initiatives, the journey towards semiconductor circularity involves both environmental stewardship and technological innovation.5,6 Environmental Risks Posed by the Semiconductor Industry The semiconductor industry has substantial environmental impacts throughout its lifecycle, from manufacturing to disposal.7 Research highlights high energy consumption, water usage, and greenhouse gas emissions, particularly with nanoscale integrated circuits that escalate resource usage.8 Hazardous chemicals employed in manufacturing pose health risks for workers, amplifying occupational safety concerns. Improper disposal further compounds these issues, as semiconductor chips in landfills can leach toxic substances into ecosystems, endangering both wildlife and human health.2 The complexity of semiconductor recycling compounds these challenges. Although strides are being made in sustainable manufacturing practices and recycling infrastructure, achieving circularity remains a significant task.9 Designing for recyclability and implementing efficient recycling methods are critical steps toward mitigating environmental impacts. Regulatory measures and consumer demand for eco-conscious products further compel semiconductor manufacturers to prioritize sustainability.5 Collaborative efforts between industry, academia, and policymakers are essential for fostering innovation and implementing sustainable practices.5 Through collective action, the semiconductor industry can minimize its ecological footprint while continuing to drive technological advancement. Current Recycling Techniques Current recycling techniques for semiconductor chips aim to maximize resource recovery while minimizing environmental impact. Methods such as direct ionic vaporization delicately reclaim semiconductor workpieces while preserving substrate purity and enabling the removal of unsuccessful conductive columns and layers.10,11 Techniques for recycling semiconductor packages on circuit boards involve polishing, solder ball removal, and the formation of new solder balls on a gold plating layer.12 Innovative recycling devices, such as those employing breaking treatments and detection mechanisms, efficiently separate semiconductors in products, streamlining the recycling process.4 Additionally, open-loop recycling, a process where materials are recycled into new products of lower quality, and integrated circuit reuse, which involves repurposing chips for other applications, offer promising avenues for maximizing resource utilization.13,14 Concurrent advancements in electronics design prioritize recyclability, with manufacturers increasingly incorporating sustainable materials and processes into semiconductor production. Case studies like Samsung's recycled semiconductor trays and Infineon's greenhouse gas reduction plans underscore the industry's commitment to sustainability. However, challenges persist, demanding ongoing research and investment to realize semiconductor circularity.15.16 As regulations tighten and consumer demand for eco-conscious products rises, the impetus for recycling innovation intensifies, positioning the semiconductor industry on the cusp of a greener future. Innovations in Recycling Technology Innovations in recycling technology within the semiconductor industry are critical for achieving sustainability and circular economy goals. Researchers have developed advanced recycling devices that efficiently separate semiconductors within products.4 Furthermore, the utilization of self-reducing briquettes derived from steel sludge in cupola furnace charge has been explored, emphasizing the vital role of minimizing CO2 emissions through recycling.17 In developing countries, innovative techniques for managing solid waste, including recycling and composting, promise significant breakthroughs in waste reduction and the creation of valuable products. These strides contribute to reducing waste volume and greenhouse gas emissions while offering new economic opportunities through sustainable recycling practices. As consumer demand for eco-conscious products grows and global regulations on electronics sustainability tighten, semiconductor manufacturers must invest in research to drive recycling innovations forward.6 The rapid advancement in recycling technologies and electronics design, coupled with consumer demand and regulatory pressures, brings the goal of recycled semiconductors increasingly within reach. More from AZoNano: Nanowires: Definition, Properties, and Applications References and Further Reading [1] Shuchen, H., et al. (2023) Assessing the contribution of semiconductors to the sustainable development goals (SDGs) from 2017 to 2022. Heliyon. doi: 10.1016\/j.heliyon.2023.e21306 [2] Xianglan, Z., et al. (2023) Emission and occupational health risk assessment of harmful contaminants in various processes in a typical semiconductor manufacturing industry building. Indoor and Built Environment. doi: 10.1177\/1420326X231161807. [3] Qi, W., et al. (2023) Environmental data and facts in the semiconductor manufacturing industry: An unexpected high water and energy consumption situation. Water Cycle. doi: 10.1016\/j.watcyc.2023.01.004. [4] Nazia, P., et al. (2020) Innovations in Recycling for Sustainable Management of Solid Wastes. Innovative Wate Management Technologies for Sustainable Development. doi: 10.4018\/978-1-7998-0031-6.ch010. [5] Mélanie, D., et al. (2021) Achieving Circular and Efficient Production Systems: Emerging Challenges from Industrial Cases. Advances in Production Management Systems. doi: 10.1007\/978-3-030-85910-7_55. [6] José, A., et al. (2021) Recycling Technology Innovation as a Source of Competitive Advantage: The Sustainable and Circular Business Model of a Bicentennial Company. Sustainability. doi: 10.3390\/su13147723. [7] Sunbal, S., et al. (2019) History and Major Types of Pollutants in Electronic Waste Recycling. Electronic Waste Production. doi: 10.1007\/978-3-030-26615-8_1. [8] Eleanor, M., et al. (2021) Green Nanofabrication Opportunities in the Semiconductor Industry: A Life Cycle Perspective. Nanomaterials. doi: 10.3390\/nano11051085. [9] Veena, S., et al. (2023) Rethinking circular economy for electronics, energy storage, and solar photovoltaics with long product life cycles. MRS Bull. doi: 10.1557\/s43577-023-00519-2. [10] Zheng, G., et al. (2021) Layer-Scale and Chip-Scale Transfer Techniques for Functional Devices and Systems: A Review. Nanomaterials. doi: 10.3390\/nano11040842. [11] Beers, A., et al. (2024) Reclamation and recycling of semiconductor workpieces. [Online] Justia. Available at: https:\/\/patents.justia.com\/inventor\/andrew-beers [12] Bingbing, W. (2017) Review of solid state recycling of aluminum chips. Resour Conserv Recycl. doi: 10.1016\/j.resconrec.2017.06.004. [13] Katrina, K., et al. (2023) Circular plastics technologies: open loop recycling of waste plastics into new chemicals. Physical Sciences Reviews. doi: 10.1515\/psr-2022-0178. [14] Kwame, N., et al. (2023) Building Trust in Microelectronics: A Comprehensive Review of Current Techniques and Adoption Challenges. Electronics. doi: 10.3390\/electronics12224618. [15] Samsung. (2024) Samsung Semiconductor: technologies for a sustainable future. [Online] Samsung. Available at: https:\/\/semiconductor.samsung.com\/sustainability\/environment\/ [16] Infineon. (2024) Environmental sustainability and climate protection. [Online] Infineon. Available at: https:\/\/www.infineon.com\/cms\/en\/about-infineon\/sustainability\/Environmental-Sustainability-and-Climate-Protection\/gases\/ [17] Silvie, B., et al. (2019) Innovated Technologies of Recycling of Metallic Wastes – Modification of Existing Industrial Processes. New Trends in Production Engineering. doi: 10.2478\/ntpe-2019-0100. Disclaimer: The views expressed here are those of the author expressed in their private capacity and do not necessarily represent the views of AZoM.com Limited T\/A AZoNetwork the owner and operator of this website. This disclaimer forms part of the Terms and conditions of use of this website.","filter_flag":1}
{"title":"Fire at Kilgore plant affects curbside recycling in Smith County cities","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2ftylerpaper.com%2fnews%2flocal%2ffire-at-kilgore-plant-affects-curbside-recycling-in-smith-county-cities%2farticle_e1eb067c-2a58-11ef-b6b4-6bf7c310ba34.html&c=2071204193215095776&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5ce7ac0b4e78ab652b317918332d&url=https%3a%2f%2ftylerpaper.com%2fnews%2flocal%2ffire-at-kilgore-plant-affects-curbside-recycling-in-smith-county-cities%2farticle_e1eb067c-2a58-11ef-b6b4-6bf7c310ba34.html&c=2071204193215095776&mkt=en-us","summary":"Another Smith County city has announced its recycling program will be impacted after a destructive fire at a recycling center in Kilgore.","published":"Tue, 18 Jun 2024 15:40:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=18, tm_hour=15, tm_min=40, tm_sec=0, tm_wday=1, tm_yday=170, tm_isdst=0)","news_source":"Tyler Morning Telegraph","news_image":"http:\/\/www.bing.com\/th?id=OVFT.PgXyA_CtQyMmdm8LtAlHlC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":367.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fire at Kilgore plant affects curbside recycling in Smith County cities","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Another Smith County city has announced its recycling program will be impacted after a destructive fire at a recycling center in Kilgore.","query":"https:\/\/www.bing.com\/news\/search?q=\"Material recovery\" \"new products\"&format=rss","text":"Managing Editor Managing editor of the Tyler Morning Telegraph and ETX View Magazine. Alabama native and Troy University alumna who moved to East Texas in late 2020. While my main role is to lead our newsroom, I often find myself reporting on crime, business and breaking news, and I write for ETX View on a regular basis. I love what I do and strongly believe in the mission of local journalism. Story ideas, questions, etc. are always welcome at santana@mrobertsmedia.com or 903-237-7749.","filter_flag":1}
