{"title":"Bangladesh: Unlocking climate finance for enterprises - PreventionWeb","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5\" target=\"_blank\">Bangladesh: Unlocking climate finance for enterprises<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PreventionWeb<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bangladesh: Unlocking climate finance for enterprises - PreventionWeb","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnByZXZlbnRpb253ZWIubmV0L25ld3MvdW5sb2NraW5nLWNsaW1hdGUtZmluYW5jZS1taWNyby1zbWFsbC1hbmQtbWVkaXVtLXNpemVkLWVudGVycHJpc2VzLWNvYXN0YWwtYmFuZ2xhZGVzaNIBAA?oc=5\" target=\"_blank\">Bangladesh: Unlocking climate finance for enterprises<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PreventionWeb<\/font>","source.href":"https:\/\/www.preventionweb.net","source.title":"PreventionWeb","query":"https:\/\/news.google.com\/rss\/search?q=\"Climate-friendly Practices\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Makame Mahmud and Jubaer Rashid of CDKN Asia share their insights on a project that assessed climate financing opportunities for Micro, Small and Medium-Sized Enterprises (MSMEs) in Bangladesh's southwestern coastal areas. The region is known for agriculture, aquaculture and handicrafts, with women entrepreneurs playing a significant role. Sector-specific impacts are identified and key recommendations are outlined for improving the climate resilience of MSMEs in the region. Bangladesh is one of the most vulnerable countries to climate change in the world. This is due, in large part, to its geographical location and socioeconomic conditions. Rising temperatures, changing precipitation patterns and more frequent extreme weather events such as cyclones and flooding have significantly impacted the country's economy and people’s livelihoods. Increasing salinity in the coastal areas is a particularly difficult challenge for Bangladesh. The southwestern coastal regions comprise 19 districts that cover 32% of the country’s land area and have a combined population of 35 million people. Seawater is intruding into sources of freshwater, making the water unsuitable for drinking and irrigation. Salinity impacts 26% of the country, making it a significant problem for the agriculture and fisheries sectors, in addition to causing forced migration and displacement of coastal communities that rely on farming and fishing for their livelihoods. MSMEs are important components of the economy in coastal regions. Often the primary source of income and employment for local communities, MSMEs are also highly vulnerable to the adverse effects of climate change, which impact infrastructure, disrupt supply chains and reduce demand for products and services, making it difficult for them to operate effectively. To address the potential climate financing opportunities for MSMEs, from 2019 to 2021, CDKN Asia implemented a knowledge-basis project, Assessing Investment Opportunities for Micro, Small and Medium Enterprises in Southwest Bangladesh. The project’s primary objective was to investigate climate change vulnerabilities, existing gender-sensitive adaptation practices and potential adaptation investment options for MSMEs located in the coastal districts of Satkhira, Bagerhat and Khulna. Challenges for MSMEs in coastal districts Satkhira, Bagerhat and Khulna are located in the southwestern region of Bangladesh and have a combined population of more than 12 million people. The region is known for agricultural and aquaculture activities such as rice cultivation, shrimp farming and fishing. The three districts contributed 75% of the total shrimp yield between 2002 and 2017. Most of the economic activities in these districts are driven by MSMEs, which are vital in providing jobs and incomes to the local communities. The project identified the most important sectors among MSMEs, district-wise. In Satkhira, these are shrimp and crab farms, vegetable and fish farms, livestock and poultry, seeds, fertilisers and insecticides, boutiques, tailors, handicrafts and nurseries. In Bagerhat, the sectors include coconut and natural products, shrimp and crab farms, vegetable and fish farms, livestock and poultry, boutiques, tailors and handicrafts. In Khulna, the sectors include agro-processing and frozen foods, jute, handicrafts and women entrepreneurship. Notably, in Khulna, a significant number of women entrepreneurs are active in the handicrafts, tailoring and beauty sectors, generating employment opportunities for women workers. MSMEs in several districts of Bangladesh, including the project areas, face challenges such as limited access to finance, shortages of skilled labour and inadequate infrastructure. Additionally, they grapple with climate change impacts such as flooding, waterlogging, saline intrusion and cyclones. These climate impacts damage infrastructure, disrupt supply chains and reduce the demand for products and services, thus increasing financial and operational challenges for MSMEs and making them more vulnerable. Sectoral impacts The project identified specific sectoral impacts. For instance, shrimp farming is becoming unsustainable due to increasing salinity, drought, declining water quality and various diseases affecting shrimp species. In the livestock and poultry sectors, high temperatures, erratic rainfall and humidity are impacting animal health and production work, necessitating increased training and investments. The handicrafts sector is facing issues of insufficient financing, health problems among workers and climate change impacts on raw materials. These challenges encompass disrupted growth cycles and reduced access to essential materials such as bamboo, jute and wood — posing challenges for artisans. Changes in rainfall patterns and rising temperatures are affecting jute yield. Furthermore, the scarcity of water supply and poor road infrastructure have contributed to a decline in the production of jute related products. Despite jute's potential as a sustainable and climate-friendly material, it struggles to compete with plastic due to inadequate enforcement of the mandatory Jute Packaging Act. In addition to infrastructure upgrades, there is an urgent need to introduce climate-resilient jute varieties capable of year-round cultivation. Increased cyclones and saline water intrusion result in embankment erosion, reducing their effectiveness in protecting against coastal flooding. Additional investments are required for embankment repairs and improvements. Reinforcing these structures with resilient materials and technologies is crucial to improving their durability and protecting against flooding. For repairing embankments. In the nursery sector, there is a need to invest in training, consultation with experts and modern equipment and to facilitate loans with easier terms as well as better terms for leased land to adapt to changing weather patterns. Investment is also needed for introducing hybrid and resilient varieties of coconuts and betel nuts, the production of which is decreasing due to salinity. Project outcomes and recommendations The project studied the MSMEs' vulnerability to climate change impacts as well as the adaptation measures currently in place. Climate risks such as sea-level rise, flooding and cyclones were identified after in-depth research and consultations with various stakeholders. The assessment of the adaptation practices focused on gender-sensitive approaches that could help ensure that the most vulnerable groups were not left behind. Secondly, the project fostered partnerships between key stakeholders such as governmental organisations, the private sector and non-governmental organisations\/civil society to raise awareness of and promote a coordinated effort towards investment in building climate-resilient MSMEs and to identify such investment options. The project’s findings led to several key recommendations: Key investment areas or additional areas for expenditure by businesses due to climate vulnerability: Relocating plants: Invest in retrofitting or relocating plants, managing hazardous waste, addressing health hazards for workers and dealing with logistical challenges caused by public infrastructure failure. Additionally, they can develop new products such as jute-based items, coconut shell products, handlooms and more. Jute is a natural fibre extracted from the bark of the white jute plant (Corchorus capsularis) and tossa jute (C. olitorius). It is often called the \"Golden Fibre\" due to its shiny appearance. Jute fibre is 100% bio-degradable and recyclable, making it environmentally friendly. Cultivating jute in crop rotations also enriches the soil fertility for the next crop. A hectare of jute plants consumes about 15 tonnes of carbon dioxide and releases 11 tonnes of oxygen. The crop takes around 120 days (from April\/May to July\/August) to fully mature. Hazardous waste: Proper storage and disposal of hazardous waste is crucial to prevent environmental contamination from waterlogging and other climate-related hazards. Significant investment from the government and private sector can help relevant manpower develop their knowledge capacity to manage sustainable hazardous waste management more efficiently in compliance with National and International Guidelines. Health hazards: Investment should cover health hazard costs for workers, as it can significantly affect productivity when employees have health problems. Workers health should be considered for investment because businesses may shift worker costs, but expenses for health, absenteeism and turnover can lead to missed opportunities. Climate resilient species: Immediate action is imperative to prioritise agriculture and livestock species that can withstand the effects of climate change. Significant investment can help grow the aquaculture sector by doing research and introducing climate resilient species for aquaculture (e.g. saline-adaptive shrimp varieties), poultry, livestock or crops (e.g. round-the-year, climate-resistant jute) Facilitating adaptation: Investing in new products to reduce adaptation, such as water desalination plants and jute-based products. New innovative business models: Adoption of new or innovative business models, e.g. mangrove-based pisciculture. Training and capacity building: Investment in training and capacity building of business owners and workers about climate change, vulnerability and adaptation. Adaptation initiatives: Investment in peer learning and up scaling of successful adaptation initiatives. Corporate social responsibility: Investment in corporate social responsibility efforts aligned with adaptation, e.g. reforestation. Minimising the financial gap: It is evident from the project's findings that a multi-faceted approach is required to tackle the challenges encountered by MSMEs in these districts. Crucial measures that are needed for overcoming the issue of creditworthiness include facilitating contacts with financial institutions, identifying risk factors and providing advisory support. Collaboration with research organisations and multi-stakeholder platforms to identify financing gaps as well as recommendations on policy support and financial incentives are also crucial. The development of standards and tools to assess climate vulnerability, adaptation requirements and investment needs can aid in integrating climate considerations into project assessments for financing adaptation investment. Moreover, promoting jute packaging (an environmentally friendly substitute for plastic packaging like jute bags, floor coverings etc.), providing healthcare facilities and organising awareness campaigns to reduce illnesses among workers are measures that are recommended for mitigating climate vulnerabilities and enhancing the overall performance of MSMEs. Conclusion The MSME sector in Bangladesh is a critical component of the economy, with nearly 10 million SMEs contributing 23% to the GDP, 80% of the jobs in the industrial sector and 25% of the total labour force. The World Bank has found that the country has a financing gap of USD 2.8 billion in the MSME sector, with 60% of the women’s SMEs needing more collateral. Improving the MSMEs’ resilience and adaption to climate change is crucial and providing them more access to climate finance can play a vital role in achieving these goals. By promoting the development of climate-resilient businesses and value chains, local economies can become more diversified and less reliant on vulnerable sectors. The project’s valuable outputs and recommendations can help both public and private financial institutions identify the most important investment areas for enhancing the resilience of MSMEs in the southwestern coastal region of Bangladesh. They can also provide insights to policymakers and investors into the current state of MSMEs and their exposure to climate risks. Providing climate finance can help to significantly enhance MSMEs' resilience and help them adapt to changing environmental conditions. This can involve improving their access to finance, technical assistance and capacity building to help them implement climate-friendly practices and technologies. Furthermore, climate finance can support the creation of new climate-resilient businesses and value chains that diversify local economies and reduce their dependence on vulnerable sectors. Providing climate finance to MSMEs in coastal areas can result in a more resilient and sustainable economy. Most importantly, by analysing the economic, social and environmental factors that affect MSMEs' performance and sustainability, the project has identified potential areas for investment that could help build their climate resilience.","filter_flag":1}
