{"title":"5 Renewable Energy Companies To Support In 2023 - EARTH.ORG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5","id":"CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA","guidislink":false,"published":"Mon, 16 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=16, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5\" target=\"_blank\">5 Renewable Energy Companies To Support In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EARTH.ORG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 Renewable Energy Companies To Support In 2023 - EARTH.ORG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLWh0dHBzOi8vZWFydGgub3JnL3JlbmV3YWJsZS1lbmVyZ3ktY29tcGFuaWVzL9IBAA?oc=5\" target=\"_blank\">5 Renewable Energy Companies To Support In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EARTH.ORG<\/font>","source.href":"https:\/\/earth.org","source.title":"EARTH.ORG","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Companies committed to making alternative energy sources more widely available are becoming more significant and well-known as the world shifts away from fossil fuels and its reliance on fossil fuels. Whether it be in the form of solar, wind, hydroelectricity, geothermal energy, or biofuel, these businesses are not only working to reduce reliance on fossil fuels but also offer potentially promising investment possibilities. Here are 5 renewable energy companies to look out for in 2023. — The market for renewable energy was valued at $881.7 billion in 2020, and Allied Market Research estimates that it will nearly double in size by 2030. In addition, their analysis shows that 7% of the world’s energy needs are currently met by all renewable energy sources put together. Renewable energy sources will continue to be primarily used to produce electricity, which is anticipated to make up over 30% of the world’s electricity demand this year. The largest contribution, hydropower, is expected to account for 16% of the world’s electricity needs, followed by wind, solar, and biofuels at 6%, 4%, and 3%, respectively. You might also like: Renewables on Track to Become Largest Source of Global Electricity by 2025, IEA Says 5 Top Renewable Energy Companies To Support In 2023 1. Canadian Solar Canadian Solar Inc. is a solar energy company with headquarters in Ontario that specialises in the design, production, and sale of solar modules, inverters, system kits, and utility-level products. The company, which was founded in 2001, has subsidiaries across six continents and has active clients in over 160 nations. The business adheres to fair trade practices and neither buys conflict minerals nor uses child labor. For Canadian Solar, the well-being of its more than 13,500 workers is of utmost importance. It also takes environmental protection and conservation very seriously. In fact, the business keeps reducing the amount of water and electricity used during the production process in an effort to stop climate change. Additionally, the company incorporated the UN Sustainable Development Goals (SDGs) into its business plan by doing things like providing solar panels to a hospital in Sierra Leone. 2. Brookfield Renewable Partners L.P. (BEP) Located in Canada, Brookfield Renewable is a company that owns and manages renewable energy assets. The corporation has a global portfolio of renewable energy-generating installations. In addition to its primarily focused on hydroelectric power operations, it also owns and manages wind, solar, distributed generation, and storage facilities. Currently, the company employs more than 3,200 employees just in its renewable energy division. It is a leader in the field of renewable energy and one of the biggest producers of hydroelectricity, which accounted for 50% of the company’s portfolio in 2022. Moreover, Brookfield’s portfolio, like other companies on this list, has made significant strides in reducing its emissions. More specifically, the company is able to save about 29 million metric tonnes of CO2 emissions, equivalent to the emissions of approximately 6 million vehicles. Around 6,000 power-generating facilities with a combined capacity of about 24,000MW spread across North America, South America, Asia, India, China, and Europe are part of this renewable power business. 3. Vestas Wind Systems Vestas Wind Systems is a Denmark-based wind energy company. It creates, produces, and installs wind turbines. The business also runs a service component that offers service contracts, replacement parts, and related services. The company provides wind turbines for numerous nations across the world. By designing, producing, installing, developing, and maintaining wind energy and hybrid projects all around the world, 29,000 employees contribute to making the world a better place every single day. Their sustainable energy solutions have already prevented 1.5 billion tonnes of CO2 from being released into the environment and contributed to a more sustainable energy system, with +145GW of wind turbines installed in 85 countries. 4. Clearway Energy One of the biggest owners of renewable energy generating facilities in the US is Clearway Energy. With extremely effective natural gas-powered facilities, it complements its portfolio of wind and solar energy. Additionally, Clearway sells its power through PPAs, which give the business a consistent stream of income. In 2022, the company sold its thermal division, bringing in $1.35 billion in cash that is being reinvested in the expansion of its operations. Clearway Energy now anticipates that, as a result of its transactions, it will be able to increase its dividend toward the high end of its target range of 5 to 8% annually through at least 2026. It plans to keep up it’s good financial standing in the interim. In the upcoming years, the company is expected to further expand its activities in the renewable energy sector while also generating significant value for shareholders. 5. SolarEdge Technologies (SEDG) Last on our list of renewable energy companies is SolarEdge Technologies, an Israeli-based company founded in 2006. SEDG specialises in inverter systems for solar projects all around the world. The business has also started to develop other smart energy solutions using its experience in inverters. Through a series of acquisitions, it has increased the range of products it offers. These new products and services address a number of energy market segments, including solar, storage, electric vehicle charging, batteries, uninterruptible power supplies (UPS), electric vehicle powertrains, and grid services solutions. Although SolarEdge presently rules the solar hardware market, its future is likely to be influenced by energy storage. Developers of residential solar energy systems like SunPower, Sunrun, and Tesla are combining their energy storage systems into what are essentially power plants that can provide electricity as needed. In order to add value to all parties and establish a long-term new cash flow stream, they can charge an in-home energy storage system while power is cheap and discharge into the grid when electricity is expensive using control systems. You might also like: 4 Sustainable Aviation Fuel Companies Leading the Way to Net-Zero Flying","filter_flag":1}
{"title":"United, Tallgrass, and Green Plains Form Joint Venture to Develop New Sustainable Aviation Fuel Technology Using ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VuaXRlZC10YWxsZ3Jhc3MtYW5kLWdyZWVuLXBsYWlucy1mb3JtLWpvaW50LXZlbnR1cmUtdG8tZGV2ZWxvcC1uZXctc3VzdGFpbmFibGUtYXZpYXRpb24tZnVlbC10ZWNobm9sb2d5LXVzaW5nLWV0aGFub2wtMzAxNzM0Njk1Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VuaXRlZC10YWxsZ3Jhc3MtYW5kLWdyZWVuLXBsYWlucy1mb3JtLWpvaW50LXZlbnR1cmUtdG8tZGV2ZWxvcC1uZXctc3VzdGFpbmFibGUtYXZpYXRpb24tZnVlbC10ZWNobm9sb2d5LXVzaW5nLWV0aGFub2wtMzAxNzM0Njk1Lmh0bWzSAQA?oc=5","id":"CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VuaXRlZC10YWxsZ3Jhc3MtYW5kLWdyZWVuLXBsYWlucy1mb3JtLWpvaW50LXZlbnR1cmUtdG8tZGV2ZWxvcC1uZXctc3VzdGFpbmFibGUtYXZpYXRpb24tZnVlbC10ZWNobm9sb2d5LXVzaW5nLWV0aGFub2wtMzAxNzM0Njk1Lmh0bWzSAQA","guidislink":false,"published":"Tue, 31 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=31, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=31, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VuaXRlZC10YWxsZ3Jhc3MtYW5kLWdyZWVuLXBsYWlucy1mb3JtLWpvaW50LXZlbnR1cmUtdG8tZGV2ZWxvcC1uZXctc3VzdGFpbmFibGUtYXZpYXRpb24tZnVlbC10ZWNobm9sb2d5LXVzaW5nLWV0aGFub2wtMzAxNzM0Njk1Lmh0bWzSAQA?oc=5\" target=\"_blank\">United, Tallgrass, and Green Plains Form Joint Venture to Develop New Sustainable Aviation Fuel Technology Using ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"United, Tallgrass, and Green Plains Form Joint Venture to Develop New Sustainable Aviation Fuel Technology Using ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VuaXRlZC10YWxsZ3Jhc3MtYW5kLWdyZWVuLXBsYWlucy1mb3JtLWpvaW50LXZlbnR1cmUtdG8tZGV2ZWxvcC1uZXctc3VzdGFpbmFibGUtYXZpYXRpb24tZnVlbC10ZWNobm9sb2d5LXVzaW5nLWV0aGFub2wtMzAxNzM0Njk1Lmh0bWzSAQA?oc=5\" target=\"_blank\">United, Tallgrass, and Green Plains Form Joint Venture to Develop New Sustainable Aviation Fuel Technology Using ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"United, Tallgrass, and Green Plains will invest up to a combined $50 million in the joint venture – Blue Blade Energy – to develop the technology United has entered into an offtake agreement with Blue Blade Energy for up to 135 million gallons of ethanol based SAF annually and up to 2.7 billion gallons in total United has invested in more SAF production than any other airline CHICAGO and DENVER and OMAHA, Neb., Jan. 31, 2023 \/PRNewswire\/ -- United Airlines, Tallgrass, and Green Plains Inc. today announced a new joint venture – Blue Blade Energy – to develop and then commercialize a novel Sustainable Aviation Fuel (SAF) technology that uses ethanol as its feedstock. If the technology is successful, Blue Blade is expected to proceed with the construction of a pilot facility in 2024, followed by a full-scale facility that could begin commercial operations by 2028. The offtake agreement could provide for enough SAF to fly more than 50,000 flights annually between United's hub airports in Chicago and Denver.* Blue Blade's new SAF technology was developed by researchers at the U.S. Department of Energy's Pacific Northwest National Laboratory (PNNL), a leading center for technological innovation in sustainable energy. SAF, which uses non-petroleum feedstock, is a low-carbon alternative to traditional jet fuel that offers up to 85%** lower lifecycle greenhouse gas emissions. \"The production and use of SAF is the most effective and scalable tool the airline industry has to reduce carbon emissions and United continues to lead the way,\" said United Airlines Ventures President Michael Leskinen. \"This new joint venture includes two expert collaborators that have the experience to construct and operate large-scale infrastructure, as well as the feedstock supply necessary for success. Once operational, Blue Blade Energy has the potential to create United's largest source of SAF providing up to 135 million gallons of fuel annually.\" United, Tallgrass, and Green Plains will each provide their unique industry expertise to help develop the joint venture. Under this collaborative approach: Tallgrass will manage research and development of the technology, including pilot plant development, and will manage the construction of the production facility. Green Plains will supply the low-carbon ethanol feedstock, and use its ethanol industry expertise to manage operations once the pilot facility is constructed. United Airlines will assist with SAF development, fuel certification and into-wing logistics, and has also agreed to purchase up to 2.7 billion gallons of SAF produced from the joint venture. \"At Tallgrass, we are striving to innovate how we deliver the energy that powers our nation and enables our quality of life,\" said Alison Nelson, Vice President, Business Development at Tallgrass. \"Air travel uniquely connects people and improves lives, and the advancement of this novel SAF technology presents a meaningful opportunity to reduce emissions from aviation. We are excited to partner with industry leaders United Airlines and Green Plains on this initiative.\" If the technology is commercialized, the location of Blue Blade's initial plant would allow easy access to low-carbon feedstock from Green Plains' Midwest ethanol production facilities. While the initial SAF facility intends to use ethanol, the technology has the capability to work with any alcohol-based feedstock as its fuel source. \"Our transformation to a true decarbonized biorefinery model has positioned Green Plains to help our customers and partners reduce the carbon intensity of their products by producing low-carbon proteins, oils, sugars and now decarbonized ethanol to be used in SAF,\" said Todd Becker, President and CEO of Green Plains. \"This partnership with world class organizations like United Airlines and Tallgrass, shows the value creation that is possible with our low-carbon platform. The potential impact of this project is a gamechanger for US agriculture, aligning a strong farm economy and a robust aviation transport industry focused on decarbonizing our skies.\" Blue Blade Energy marks one of the largest direct investments from United Airlines Ventures (UAV), United's corporate venture arm, into SAF. Launched in 2021, UAV targets startups, upcoming technologies, and sustainability concepts that will complement United's goal of net zero emissions by 2050 without relying on traditional carbon offsets. United has aggressively pursued strategic investments in SAF producers and revolutionary technologies including carbon capture, hydrogen-electric engines, electric regional aircraft and air taxis. *Assuming current regulations requiring SAF to be blended with conventional jet fuel are removed to allow for the use of unblended SAF. **Based on United’s current SAF supply About United United's shared purpose is \"Connecting People. Uniting the World.\" From our U.S. hubs in Chicago, Denver, Houston, Los Angeles, New York\/Newark, San Francisco and Washington, D.C., United operates the most comprehensive global route network among North American carriers. United is bringing back our customers' favorite destinations and adding new ones on its way to becoming the world's best airline. For more about how to join the United team, please visit www.united.com\/careers and more information about the company is at www.united.com. United Airlines Holdings, Inc., the parent company of United Airlines, Inc., is traded on the Nasdaq under the symbol \"UAL\". For further information about our environmental impact, review United's Corporate Responsibility Report and Annual Report on Form 10-K, available at crreport.united.com and ir.united.com. About Tallgrass Tallgrass is a leading energy infrastructure company focused on safely, reliably and sustainably delivering the energy and services that fuel homes and businesses and enable quality of life. We are committed to being at the forefront of efforts to decarbonize our world. An investor group led by Blackstone Infrastructure Partners, which includes Enagás SA, GIC, NPS and USS, owns the outstanding equity interests in Tallgrass. Learn more at Tallgrass.com. About Green Plains Inc. Green Plains Inc. (NASDAQ:GPRE) is a leading biorefining company focused on the development and utilization of fermentation, agricultural and biological technologies in the processing of annually renewable crops into sustainable value-added ingredients. This includes the production of cleaner low-carbon biofuels, renewable feedstocks for advanced biofuels and high-purity alcohols for use in cleaners and disinfectants. Green Plains is an innovative producer of Ultra-High Protein and novel ingredients for animal and aquaculture diets to help satisfy a growing global appetite for sustainable protein. The Company also owns a 48.8% limited partner interest and a 2.0% general partner interest in Green Plains Partners LP. For more information, visit www.gpreinc.com. United Cautionary Note Concerning Forward-Looking Statements This press release contains certain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 relating to, among other things, plans and projections regarding the company's financial position, results of operations, market position, capacity, fleet, product development and business strategy as well as the company's ESG goals, targets, commitments, strategies and initiatives and related business and stakeholder impacts. All statements that are not statements of historical facts are, or may be deemed to be, forward-looking statements. Such forward-looking statements are based on historical performance and current expectations, estimates, forecasts and projections about our future financial results, plans, objectives, goals, targets, commitments, strategies and initiatives and involve inherent risks, assumptions and uncertainties, known or unknown, including internal or external factors that could delay, divert or change any of them, that are difficult to predict, may be beyond our control and could cause our future financial results, plans, objectives, goals, targets, commitments, strategies and initiatives to differ materially from those expressed in, or implied by, the statements. These risks, assumptions, uncertainties and other factors include, among others, any failure to meet stated ESG goals, targets, commitments, strategies and initiatives in the time frame expected or at all as a result of many factors, including changing societal, market, competitive, regulatory or stakeholder expectations, a delay or failure of any project to be fully developed or become operational or to produce sustainable aviation fuel or other ESG-related product in the amounts contemplated or at all, a delay or failure of any technology to be fully developed or become functional or marketable or to serve the purpose for which it was designed, and any delay or inability of United Airlines to realize the expected benefits of the joint venture. No forward-looking statement can be guaranteed. Forward-looking statements in this press release should be evaluated together with the many risks and uncertainties that affect United's business and market, particularly those identified in the \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Risk Factors\" sections in United's Annual Report on Form 10-K for the year ended December 31, 2021, as updated by our subsequent Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other filings with the Securities and Exchange Commission. Risks and uncertainties related to United's environmental compliance, climate commitments and climate strategy are further described in Part I, Item 1A. Risk Factors of United's Annual Report on Form 10-K for the fiscal year ended December 31, 2021—\"We are subject to many forms of environmental regulation and liability and risks associated with climate change and may incur substantial costs as a result. In addition, failure to achieve or demonstrate progress towards our climate goals may expose us to liability and reputational harm.\" The statements included in this document are made only as of the date of this document and except as otherwise required by applicable law or regulation, United Airlines undertakes no obligation to publicly update or revise any statement, whether as a result of new information, future events, changed circumstances or otherwise. In particular, United Airlines reserves the right to change, amend, supplement or abandon some or all of the statements regarding goals, targets, commitments, strategies, initiatives, intentions and other statements from time to time without notice. In addition, some of our disclosures in this press release are estimates or based on assumptions due to inherent measurement uncertainties. For example, United has entered into purchase agreements to buy more SAF production than any other airline based on publicly available future purchase agreements for SAF of certain airlines as of the date hereof. Tallgrass Cautionary Note Concerning Forward-Looking Statements Disclosures in this news release contain forward-looking statements. All statements, other than statements of historical fact, included in this press release that address activities, events or developments that management expects, believes or anticipates will or may occur in the future are forward-looking statements. Without limiting the generality of the foregoing, forward-looking statements contained in this press release specifically include the combined potential investment amount in the Blue Blade Energy joint venture, the potential amount of SAF to be acquired by United under the offtake agreement, the development and commercialization of the SAF technology, expectations regarding construction of a pilot facility and full-scale facility, including the dates of completion and commercial operation for such facilities, the expected usage of SAF by United under the offtake agreement, the industry expertise of the joint venture members that is expected to be used to help develop the joint venture, the benefits of the location of Blue Blade's initial plant, and the other potential benefits and capabilities of the SAF technology. Such statements are subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of Tallgrass, which may cause actual results to differ materially from those implied or expressed by the forward-looking statements, and other important factors that could cause actual results to differ materially from those projected, including those set forth in reports and financial statements made available by Tallgrass. Any forward-looking statement applies only as of the date on which such statement is made, and Tallgrass does not intend to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law. Green Plains Inc. Cautionary Note Concerning Forward-Looking Statements All statements, other than statements of historical fact, included in this press release that address activities, events or developments that management expects, believes or anticipates will or may occur in the future are forward-looking statements. Without limiting the generality of the foregoing, forward-looking statements contained in this press release specifically the investment in the joint venture and the expected size and benefits of the sustainable aviation fuel production project under development. Such statements are subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of Green Plains, which may cause actual results to differ materially from those implied or expressed by the forward-looking statements, and other important factors that could cause actual results to differ materially from those projected, including those set forth in reports and financial statements made available by Green Plains. Any forward-looking statement applies only as of the date on which such statement is made. Green Plains does not intend to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law. SOURCE United Airlines","filter_flag":1}
{"title":"Berlin’s green unicorn Enpal to get €215 million cash boost to supercharge its mission of creating a more sustainable ... - EU-Startups","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5ldS1zdGFydHVwcy5jb20vMjAyMy8wMS9iZXJsaW5zLWdyZWVuLXVuaWNvcm4tZW5wYWwtdG8tZ2V0LWUyMTUtbWlsbGlvbi1jYXNoLWJvb3N0LXRvLXN1cGVyY2hhcmdlLWl0cy1taXNzaW9uLW9mLWNyZWF0aW5nLWEtbW9yZS1zdXN0YWluYWJsZS1zb2NpZXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5ldS1zdGFydHVwcy5jb20vMjAyMy8wMS9iZXJsaW5zLWdyZWVuLXVuaWNvcm4tZW5wYWwtdG8tZ2V0LWUyMTUtbWlsbGlvbi1jYXNoLWJvb3N0LXRvLXN1cGVyY2hhcmdlLWl0cy1taXNzaW9uLW9mLWNyZWF0aW5nLWEtbW9yZS1zdXN0YWluYWJsZS1zb2NpZXR5L9IBAA?oc=5","id":"CBMioQFodHRwczovL3d3dy5ldS1zdGFydHVwcy5jb20vMjAyMy8wMS9iZXJsaW5zLWdyZWVuLXVuaWNvcm4tZW5wYWwtdG8tZ2V0LWUyMTUtbWlsbGlvbi1jYXNoLWJvb3N0LXRvLXN1cGVyY2hhcmdlLWl0cy1taXNzaW9uLW9mLWNyZWF0aW5nLWEtbW9yZS1zdXN0YWluYWJsZS1zb2NpZXR5L9IBAA","guidislink":false,"published":"Tue, 10 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=10, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5ldS1zdGFydHVwcy5jb20vMjAyMy8wMS9iZXJsaW5zLWdyZWVuLXVuaWNvcm4tZW5wYWwtdG8tZ2V0LWUyMTUtbWlsbGlvbi1jYXNoLWJvb3N0LXRvLXN1cGVyY2hhcmdlLWl0cy1taXNzaW9uLW9mLWNyZWF0aW5nLWEtbW9yZS1zdXN0YWluYWJsZS1zb2NpZXR5L9IBAA?oc=5\" target=\"_blank\">Berlin’s green unicorn Enpal to get €215 million cash boost to supercharge its mission of creating a more sustainable ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EU-Startups<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Berlin’s green unicorn Enpal to get €215 million cash boost to supercharge its mission of creating a more sustainable ... - EU-Startups","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioQFodHRwczovL3d3dy5ldS1zdGFydHVwcy5jb20vMjAyMy8wMS9iZXJsaW5zLWdyZWVuLXVuaWNvcm4tZW5wYWwtdG8tZ2V0LWUyMTUtbWlsbGlvbi1jYXNoLWJvb3N0LXRvLXN1cGVyY2hhcmdlLWl0cy1taXNzaW9uLW9mLWNyZWF0aW5nLWEtbW9yZS1zdXN0YWluYWJsZS1zb2NpZXR5L9IBAA?oc=5\" target=\"_blank\">Berlin’s green unicorn Enpal to get €215 million cash boost to supercharge its mission of creating a more sustainable ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EU-Startups<\/font>","source.href":"https:\/\/www.eu-startups.com","source.title":"EU-Startups","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Berlin-based Enpal, one of the fastest-growing companies in Europe’s energy sector at the moment, has just revealed it is set to pick up an additional €215 million in growth financing. The startup is certainly making an impact, helping create a more sustainable energy future for Europe and positively impacting the planet as a result. As the new year rolls in, it’s a time to reflect and consider the changes we can make for the better – changes in approaches and perspectives that can have more positive impacts on our lives and society. One major thing we all need to reflect on, and something we are increasingly considering, is the climate crisis. In 2022, the gravity of the escalating crisis came to a pinnacle as the energy system across the continent came under never-seen-before pressure and the reality of the fragility of our society came to light. Now, across the continent, the urgency of transitioning to more stable, more dependable and more planet-positive energy alternatives has reached an all-time high. Renewable energy sources are the future – there can be no doubt about that – and there is a range of options available. The challenge is to make access to these sources available to everyone across the continent and to do so fast and without friction. Berlin-based Enpal aims to help achieve this, accelerating the energy transition with accessible solar technology. It was Germany’s first ‘green’ unicorn and has already gotten the backing of the stars of the climate action space, including Leonardo DiCaprio. Now, the startup has secured an additional cash investment, getting 2023 off to a bright start. Enpal founder and CEO Mario Kohle: “Fighting climate change is the greatest challenge of the 21st century. We want to help tackle this global issue by putting solar panels on every roof, a battery into every home, and an electric vehicle with a charger in front of every door. We are thrilled to have high-profile global cleantech investors on board to support our mission to make clean energy simple, affordable, and accessible for every household. By joining forces, we can multiply our efforts to reduce carbon emissions and we will pave the way towards a more sustainable society.” Funding details €215 million raised in growth capital as part of a Series D funding round It was led by TPG Rise Climate with Westly Group and Activate Capital, two additional major climate investors coming on board. Existing investors such as HV Capital (with support from the European Investment Bank), SoftBank Vision Fund II Capital, Princeville Climate Technology, also participated, once again increasing their commitments. It comes just weeks after an €855 million raise Edward Beckley, Partner at TPG and Senior member of the TPG Rise Climate investing team, said: “Enpal’s success and rapid growth in Germany – Europe’s largest residential solar market – puts the company in a great position to grow into new markets, products and services and establish itself as the leading player in the sector. As fossil fuel prices remain elevated and governments enact policy to accelerate the energy transition, we continue to believe in the importance of home decarbonization across Europe. We are delighted to partner with Enpal to bring their user-friendly, end-to-end solution to more homes across Germany and broader Europe.” Founded in 2017, Enpal, led by Mario Kohle, has the vision to make it easier for homeowners to switch to solar energy. It offers a complete package consisting of a solar system, energy storage, its own green electricity tariff and a smart home environment on a subscription basis. Enpal offers the first integrated package for a climate-neutral home including PV systems, energy storage, EV chargers, green electricity tariffs and smart energy managers. What’s more, the company rents out the systems which democratise access to solar energy, taking away often sky-high upfront costs, and also provides an all-inclusive care-free package. Viktor Wingert, Co-founder and Chief Investment Officer of Enpal, said: “Building the largest renewable community is the challenge of our lifetime. We require strong investors and financing partners to continue our path. This latest funding round, in addition to the recently secured 855m EUR in refinancing by Blackrock Alternatives, ING, Pricoa Private Capital, Unicredit and Infranity, puts us in a unique position to grow faster and stronger in 2023 and beyond. Winning the trust of such high-caliber partners in a challenging macroeconomic environment leaves us very humble, but more eager than ever to deliver on our vision.” We chatted with Mario Kohle, the founder and CEO, in 2022 to learn about how he has grown the firm to one of Europe’s fastest-growing energy companies in Europe. Back then, he told us to dare to dream big – and it looks like the company are certainly doing that. It currently counts about 30k customers, installing over 2000 solar energy systems per month. Steve Westly, founder and managing partner of Westly Group: “Clean energy has been front and centre of everything we do at Westly Group from day one, and we strongly believe in Enpal’s vision to connect humankind to become a renewable community. We are proud to partner with Enpal on the mission to make renewable energy easy, accessible, and affordable for everyone, and fight the climate crisis on a global scale.” The additional growth capital will allow Enpal to add new products, expand to new markets and further develop Enpal’s multi-awarded smart energy platform. . By responding to the increased customer demand and expanding beyond the German market, Enpal aims to fulfil their vision of creating a global renewable-energy community. Enpal closed 2022 with over €400 million in revenue. This funding reflects another major milestone and sets the company on track to continue growing profitably whilst delivering a tangible positive impact for European consumers. Jochen Cassel, Chief Financial Officer of Enpal, said: “Enpal has just finished an incredible year: We have successfully quadrupled our growth while for the first time delivering a healthy profit. We are now in full control to continue our growth trajectory, become cash flow positive, and further invest into our customers and products.”","filter_flag":1}
{"title":"Heat Pumps for Multifamily Homes - ACHR NEWS","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNDc1MDMtaGVhdC1wdW1wcy1mb3ItbXVsdGlmYW1pbHktaG9tZXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNDc1MDMtaGVhdC1wdW1wcy1mb3ItbXVsdGlmYW1pbHktaG9tZXPSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNDc1MDMtaGVhdC1wdW1wcy1mb3ItbXVsdGlmYW1pbHktaG9tZXPSAQA","guidislink":false,"published":"Mon, 23 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=23, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=23, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNDc1MDMtaGVhdC1wdW1wcy1mb3ItbXVsdGlmYW1pbHktaG9tZXPSAQA?oc=5\" target=\"_blank\">Heat Pumps for Multifamily Homes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ACHR NEWS<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Heat Pumps for Multifamily Homes - ACHR NEWS","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNDc1MDMtaGVhdC1wdW1wcy1mb3ItbXVsdGlmYW1pbHktaG9tZXPSAQA?oc=5\" target=\"_blank\">Heat Pumps for Multifamily Homes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ACHR NEWS<\/font>","source.href":"https:\/\/www.achrnews.com","source.title":"ACHR NEWS","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"✕ In the past, heat pumps were typically installed in single-residence homes, but nowadays, the technology has evolved and can be used in many other building applications — such as multifamily homes. While legislation like the Inflation Reduction Act (IRA) might be enough to motivate some building owners to make the change to high-efficiency heat pumps, others might need more convincing. Mark Reding, ducted systems product manager at Johnson Controls, explained that in multifamily homes, overall savings are not always a driving factor for HVAC replacements because tenants are often the only ones who see their monthly utility costs. This leaves building managers with limited data to justify any investments in more efficient technology, he said. One solution to this problem is the Green Lease program, which was launched in 2014 by the U.S. Department of Energy’s Better Buildings Alliance and the Institute for Market Transformation. According to Reding, the program allows both the tenant and the building owner to share insight into utility expenses. “This information can then be used to develop strategies for investing in mutually beneficial capital improvements such as HVAC system upgrades,” he explained. “Multifamily building managers can [also] take advantage of IRA incentives to help offset the cost of system investments.” Reding added that programs such as the DOE’s Cold Climate Heat Pump Challenge are expected to encourage the adoption of heat pumps in buildings, as the specifications of these new systems will likely translate into multifamily housing. Although nearly all multifamily homes can at least be partially electrified with heat pumps, Reding said the most common retrofit obstacle is when building managers try to reuse existing components to reduce costs. He added that the best way to overcome this problem is by recommending systems that already operate with similar parts. Factors to Consider Though different types of heat pumps, such as variable refrigerant flow (VRF) and mini-split systems, can all work well in multifamily homes, Dennis Cobb, senior director - business development, Mitsubishi Electric Trane HVAC US (METUS), said the application and size of the project can help determine what product to use. He added that factors such as the capability of the building, as well as what region a building might be located in, can all affect product choice. CONVENIENCE: Wall-mounted mini-split units can allow homeowners to easily adjust heating and cooling to their own personal comfort. (Courtesy of METUS) “As far as cold climates or southern climates, VRF may make a better solution than mini splits on larger buildings,” he noted. Cobb said when it comes to replacing existing systems in older multifamily homes, sometimes a backup electric heating source does not need to be provided because heat pumps are capable of going down to zero degrees (or even lower) while still maintaining their heating capacity. This eliminates the need for a power grid upgrade, he explained, which can provide end users and building owners with significant savings. He added that this extra capital can then be reinvested into the building or be used to upgrade systems to higher efficiency mini-split or VRF products. The ownership of these homes also comes into play. For example, when dealing with individually owned units in an apartment building, Cobb said the process is typically much longer, as more steps are involved in getting the approval to install new equipment. If the homes are owned by a single person or entity, then he said the owner would make the decision for the whole building. Cobb noted that sometimes when an owner is short-lived — for example, those who buy properties to renovate or flip them — it might be harder to persuade them to invest in a new HVAC system. “Our challenge is to convince them that whatever they put in that building is going to be an asset for them to sell the building, as well as an asset for the new ownership behind it,” he explained. “At that point, we're really talking about energy efficiency and longevity and a return on investment for them.” Clean Heat for All As trends in electrification and decarbonization continue to grow, more building owners and homeowners have been trying to replace old equipment to meet new standards. However, making this change can be complicated when it comes to multifamily homes, which are often found in large cities. New York City is an example of an urban area that is working to close its green energy gap through its “Clean Heat for All Challenge”. Organized by the New York City Housing Authority (NYCHA), New York Power Authority (NYPA), and New York State Energy Research and Development Authority (NYSERDA), the Challenge aims to address NYC Local Law 97, which states that the city must cut greenhouse gas emissions from its housing developments by 40% by 2030 and 80% by 2050. “Municipalities are really trying to shift their buildings to meet the new laws promoting electrification and decarbonization,” said David Leezer, retail AC R&D team leader at Midea America. “Taking advantage of this opportunity, we submitted a bid on the Clean Heat for All Challenge and won the bid to supply 20,000 units.” Leezer said packaged window heat pumps (PWHP) are a unique new technology that could help multifamily homes make the shift from fossil fuels to more sustainable energy sources. When creating new products for multifamily homes, however, he noted that manufacturers should consider that every building might require different methods of installation. For example, he said that when designing PWHPs for the Challenge, Midea had incorporated an adjustable “bridge section” to the product because windowsill depths can vary across housing units. This addition made the unit more accessible for different applications. According to Leezer, one of the biggest challenges when designing the window-mounted unit was how to manage condensate. He said Midea’s aim with the product was to self-contain the condensate without the risk of it dripping down the building or freezing in extreme temperatures. About 30-36 units will be going through testing during the winter of 2023, Leezer said, and the proposed start for installation in NYC multifamily buildings will be in 2024. - David Rames Senior product manager Midea America “The contractor should ask for this training because there's going to be more and more inverter technology penetration into the market in the future. They can't be scared of it.” Education is Key Though many incentives have been designed to encourage the installation of more efficient HVAC technology, David Rames, senior product manager at Midea America, said these incentives will not do much good if the general public is not informed about them. “Heat pumps, by nature, are more expensive than air conditioners. So in order to drive the consumer to make the change, you have to incentivize them,” he explained. “People's understanding of heat pumps and what heat pumps are is usually not there — that education to the general consumer and general public is kind of a challenge.” The importance of proper education even goes past the consumers. Rames said as HVAC technology evolves and improves over the years, manufacturers have the responsibility to connect with their distribution partners and work on educating contractors about each product and proper installation methods. He added that when it comes to multifamily building applications, it is important to let contractors know that they should embrace the new challenge and technology. “The contractor should ask for this training because there's going to be more and more inverter technology penetration into the market in the future,” Rames said. “They can't be scared of it.”","filter_flag":1}
{"title":"India's State of Maharashtra Announces Strategic Energy Partnership with Gogoro and Belrise Industries to Build $2.5 ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi0gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZGlhcy1zdGF0ZS1vZi1tYWhhcmFzaHRyYS1hbm5vdW5jZXMtc3RyYXRlZ2ljLWVuZXJneS1wYXJ0bmVyc2hpcC13aXRoLWdvZ29yby1hbmQtYmVscmlzZS1pbmR1c3RyaWVzLXRvLWJ1aWxkLTItNS1iaWxsaW9uLWJhdHRlcnktc3dhcHBpbmctaW5mcmFzdHJ1Y3R1cmUtMzAxNzIzMzM3Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi0gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZGlhcy1zdGF0ZS1vZi1tYWhhcmFzaHRyYS1hbm5vdW5jZXMtc3RyYXRlZ2ljLWVuZXJneS1wYXJ0bmVyc2hpcC13aXRoLWdvZ29yby1hbmQtYmVscmlzZS1pbmR1c3RyaWVzLXRvLWJ1aWxkLTItNS1iaWxsaW9uLWJhdHRlcnktc3dhcHBpbmctaW5mcmFzdHJ1Y3R1cmUtMzAxNzIzMzM3Lmh0bWzSAQA?oc=5","id":"CBMi0gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZGlhcy1zdGF0ZS1vZi1tYWhhcmFzaHRyYS1hbm5vdW5jZXMtc3RyYXRlZ2ljLWVuZXJneS1wYXJ0bmVyc2hpcC13aXRoLWdvZ29yby1hbmQtYmVscmlzZS1pbmR1c3RyaWVzLXRvLWJ1aWxkLTItNS1iaWxsaW9uLWJhdHRlcnktc3dhcHBpbmctaW5mcmFzdHJ1Y3R1cmUtMzAxNzIzMzM3Lmh0bWzSAQA","guidislink":false,"published":"Tue, 17 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=17, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZGlhcy1zdGF0ZS1vZi1tYWhhcmFzaHRyYS1hbm5vdW5jZXMtc3RyYXRlZ2ljLWVuZXJneS1wYXJ0bmVyc2hpcC13aXRoLWdvZ29yby1hbmQtYmVscmlzZS1pbmR1c3RyaWVzLXRvLWJ1aWxkLTItNS1iaWxsaW9uLWJhdHRlcnktc3dhcHBpbmctaW5mcmFzdHJ1Y3R1cmUtMzAxNzIzMzM3Lmh0bWzSAQA?oc=5\" target=\"_blank\">India's State of Maharashtra Announces Strategic Energy Partnership with Gogoro and Belrise Industries to Build $2.5 ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"India's State of Maharashtra Announces Strategic Energy Partnership with Gogoro and Belrise Industries to Build $2.5 ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZGlhcy1zdGF0ZS1vZi1tYWhhcmFzaHRyYS1hbm5vdW5jZXMtc3RyYXRlZ2ljLWVuZXJneS1wYXJ0bmVyc2hpcC13aXRoLWdvZ29yby1hbmQtYmVscmlzZS1pbmR1c3RyaWVzLXRvLWJ1aWxkLTItNS1iaWxsaW9uLWJhdHRlcnktc3dhcHBpbmctaW5mcmFzdHJ1Y3R1cmUtMzAxNzIzMzM3Lmh0bWzSAQA?oc=5\" target=\"_blank\">India's State of Maharashtra Announces Strategic Energy Partnership with Gogoro and Belrise Industries to Build $2.5 ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The State of Maharashtra India Partners with Gogoro & Belrise Industries on $2.5 billion Battery Swapping Infrastructure Post this The companies plan to build a smart energy infrastructure in Maharashtra that is open and accessible and establishes battery swapping and smart battery stations as a leading source for mobility and energy storage. The deployment is also expected to accelerate job growth throughout the smart energy, electric vehicle, and sustainability value chain. In addition to the smart infrastructure, the partnership is also expected to foster smart electric vehicle manufacturing and assembly in the state. \"It is indeed a remarkable moment for the State, this will perhaps be the largest green partnership of this nature worldwide,\" -a sentiment echoed by Hon. Chief Minister Shri. Eknath Shinde. \"As a national leader in sustainability, it is important for the State of Maharashtra to embrace new technologies that are open, accessible and enable dynamic solutions that can accelerate the transition to smarter sustainable cities and set an example that other states in India can follow,\" said Devendra Fadnavis, The Deputy Chief Minister of Maharashtra. \"We are partnering with Gogoro and Belrise to deploy the world's largest and most innovative smart energy infrastructure to utilize battery swapping for solving the unique and distributed energy challenges we face daily. This project will enable new alternatives to the fossil fuels solutions many of our residents use today.\" \"The future of smart sustainable cities and countries is not about a single company or government but about a community coming together to instill a new way of thinking and a new way of utilizing sustainable energy in an open and accessible way. This partnership represents the future and this new way of thinking - not just about sustainable transportation, but about an entirely new system. That is why we truly believe in building open and accessible infrastructure that will uplift the entire ecosystem,\" said Horace Luke, founder, and CEO of Gogoro. \"Together, the State of Maharashtra, Belrise Industries and Gogoro plan to shift energy usage and establish this new sustainable economy that will encourage jobs creation, establish new technical and sustainable industrial capabilities, and ultimately increase state exports.\" The battery swapping infrastructure expects to begin deploying across the State of Maharashtra in 2023 which will leverage Gogoro's smart energy ecosystem including smart battery stations, swapping technologies, network management solutions, and will provide numerous innovations to the state, contributing in the areas of smart city design and development, energy storage stations & systems, smart mobility sharing, smart electric vehicles, demand response services and distributed energy storage, smart agriculture, among other applications. \"Clean energy is the future, and now is the time for Indian businesses to begin their transition to a new model of sustainable operations. As a manufacturing leader in India's transportation industry, we are embracing this for our own business, customers, and communities,\" said Shrikant Badve, Managing Director, Belrise Industries. \"Today we are partnering with Gogoro, a global innovation leader in smart sustainable energy and India's most industrious state of Maharashtra to deploy the largest portable battery swapping infrastructure of its kind to enable a new generation of products and services that Maharashtra's residents can embrace.\" With more than 120 million residents, Maharashtra is India's largest economy and industrialized State with a gross domestic product of more than US$450 billion that accounts for 16-percent of India's industrial output. About The State of Maharashtra Maharashtra is one of the 28 states within the Republic of India. Maharashtra is known as India's growth engine due to its large contribution to India's GDP. It is also nationally recognized as the most advanced in terms of manufacturing and services sector. Maharashtra has consistently topped India's ranking in terms of FDI received. Mumbai, the capital of Maharashtra is a global world class city. https:\/\/www.maharashtra.gov.in\/1125\/Home About Gogoro Founded in 2011 to rethink urban energy and inspire the world to move through cities in smarter and more sustainable ways, Gogoro leverages the power of innovation to change the way urban energy is distributed and consumed. Gogoro Network is a new generation of distributed smart energy infrastructure that is optimized for swappable battery refueling and architected for intelligent bidirectional demand response and energy storage that is a key building block of a smart grid. Gogoro has quickly become an innovation leader in battery swapping, energy storage, connected vehicles, electric propulsion systems, smart battery design, and advanced cloud services that utilize artificial intelligence to manage battery availability and safety. The challenge is massive, but the opportunity to disrupt the status quo, establish new standards, and achieve new levels of sustainable growth in densely populated cities is even greater. For more information, visit www.gogoro.com\/news and follow Gogoro on Twitter: @wearegogoro. About Belrise Group (erstwhile Badve Group of Industries) Belrise Group is a leading Tier-1 automotive system manufacturer in India that accounts for one third of all two-wheel and three-wheel chassis made in India. With consolidated group revenue of $700 Mn (USD), Belrise Group has 29 state-of-the-art facilities across India that specialize in automotive component manufacturing for the 2-wheeler, 3-wheeler and 4-wheeler passenger, and commercial vehicle segments. The company's diverse product portfolio includes metal fabrication, polymer processing, foundry, mirror and suspensions systems, amongst others. With the evolution of EVs, Belrise group is geared up to offer products for the entire product ecosystem in the EV value chain. For more information, visit www.belriseindustries.com and follow Belrise Industries on LinkedIn. Forward Looking Statements This communication contains forward looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward looking statements generally relate to future events or Gogoro's future financial or operating performance. In some cases, you can identify forward looking statements because they contain words such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"going to,\" \"could,\" \"intends,\" \"target,\" \"projects,\" \"contemplates,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential\" or \"continue\" or the negative of these words or other similar terms or expressions that concern Gogoro's expectations, strategy, priorities, plans or intentions. Forward-looking statements in this communication include, but are not limited to, the potential of the partnership between Gogoro, Belrise Industries (erstwhile known as Badve Engineering Ltd) and the government of Maharashtra (the \"partnership), including the ability of such partnership to achieve its goals and projections of market opportunity, the potential timeline for the deployment of the battery swapping infrastructure in Maharashtra, the potential amount of investment in the partnership, the potential growth in India, the capability of Gogoro's technology, Gogoro's business plans and statements by Gogoro's founder and chief executive officer, Belrise Industries' Managing Director and government officials of the government of Maharashtra. Gogoro's expectations and beliefs regarding these matters may not materialize, and actual results in future periods are subject to risks and uncertainties that could cause actual results to differ materially from those projected, including risks related to the impact of the COVID-19 pandemic, risks related to macroeconomic factors including inflation and consumer confidence, risks related to political tensions, Gogoro's ability to effectively manage its growth, Gogoro's ability to launch and ramp up the production of its products and control its manufacturing costs and manage its supply chain issues, Gogoro's risks related to ability to expand its sales and marketing abilities, Gogoro's ability to expand effectively into new markets, foreign exchange fluctuations, Gogoro's ability to develop and maintain relationships with its partners, risks associated with formalizing the partnership, including reaching an agreement on the terms of the partnership and the timing of formalizing the partnership, risks related to operating in the India, regulatory risks and Gogoro's risks related to strategic collaborations, risks related to the India market and other international markets, alliances or joint ventures including Gogoro's ability to enter into and execute its plans related to strategic collaborations, alliances or joint ventures in order for such strategic collaborations, alliances or joint ventures to be successful and generate revenue, Gogoro's ability to raise additional capital, the risks related to the need for Gogoro to invest more capital in strategic collaborations, alliances or joint ventures, and the risk of Gogoro having to update the accounting treatment for its joint ventures. The forward looking statements contained in this communication are also subject to other risks and uncertainties, including those more fully described in Gogoro's filings with the Securities and Exchange Commission (\"SEC\"), including in Gogoro's Form 20-F for the year ended December 31, 2021, which was filed on May 2, 2022 and in its subsequent filings with the SEC, copies of which are available on our website and on the SEC's website at www.sec.gov. The forward looking statements in this communication are based on information available to Gogoro as of the date hereof, and Gogoro disclaims any obligation to update any forward looking statements, except as required by law. SOURCE Gogoro","filter_flag":1}
{"title":"The best sustainable tech gadgets you can buy in 2023 - Gadget Flow","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdGhlZ2FkZ2V0Zmxvdy5jb20vYmxvZy9iZXN0LXN1c3RhaW5hYmxlLXRlY2gtZ2FkZ2V0cy15b3UtY2FuLWJ1eS1pbjIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdGhlZ2FkZ2V0Zmxvdy5jb20vYmxvZy9iZXN0LXN1c3RhaW5hYmxlLXRlY2gtZ2FkZ2V0cy15b3UtY2FuLWJ1eS1pbjIwMjMv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vdGhlZ2FkZ2V0Zmxvdy5jb20vYmxvZy9iZXN0LXN1c3RhaW5hYmxlLXRlY2gtZ2FkZ2V0cy15b3UtY2FuLWJ1eS1pbjIwMjMv0gEA","guidislink":false,"published":"Wed, 25 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=25, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=25, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdGhlZ2FkZ2V0Zmxvdy5jb20vYmxvZy9iZXN0LXN1c3RhaW5hYmxlLXRlY2gtZ2FkZ2V0cy15b3UtY2FuLWJ1eS1pbjIwMjMv0gEA?oc=5\" target=\"_blank\">The best sustainable tech gadgets you can buy in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gadget Flow<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The best sustainable tech gadgets you can buy in 2023 - Gadget Flow","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vdGhlZ2FkZ2V0Zmxvdy5jb20vYmxvZy9iZXN0LXN1c3RhaW5hYmxlLXRlY2gtZ2FkZ2V0cy15b3UtY2FuLWJ1eS1pbjIwMjMv0gEA?oc=5\" target=\"_blank\">The best sustainable tech gadgets you can buy in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gadget Flow<\/font>","source.href":"https:\/\/thegadgetflow.com","source.title":"Gadget Flow","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The best sustainable tech gadgets you can buy in 2023 Lauren Wadowsky on under Daily Digest Byunder Want tech that's more eco-friendly? Then check out our picks for the most sustainable tech gadgets of 2023. They boast recycled materials, solar charging, and more. Mill compost bin in a kitchen setup You love your tech. But all those plastic cases and wires are definitely rough on the planet. So what’s a gadget enthusiast to do? Go for the most sustainable tech gadgets of 2023. These products are packed with features and use sustainable materials. Many also optimize power use. Check them out below. Related: Most interesting tech gadgets of 2023—robots, smart home, AI, STEM & more Charge your devices with a cord that has a 2-in-1 sustainable design: the Native Union Belt Cable Duo. It uses 100% recycled PET braiding and has both USB-C and Lightning connectors in 1 head. Then, your earbuds can put environmental plastic to use when you buy the Urbanears Boo Tip. They’re made from recycled plastics and have comfortable silicone tips. Enjoy your favorite tech responsibly when you choose the sustainable products below. 1. The Logitech BRIO 300 Full HD Webcam uses at least 48% plastic and has a stylish speckled look. Buy it for $69.99 on the official website. Logitech BRIO 300 Full HD Webcam on a monitor Need a new webcam? Go for one that gives used plastics new life with the Logitech BRIO 300 Full HD Webcam. It’s made of at least 48% recycled plastic. Meanwhile, the webcam has 1080p resolution and auto-light correction. 2. The Native Union Belt Cable Duo dual connector Type-C cable comprises 100% recycled PET braiding. Buy it for $49.99 on the company’s website. Native Union Belt Cable Duo in Kraft Charge your devices while keeping the Earth in mind when you have the Native Union Belt Cable Duo dual connector Type-C cable. Its cable features 100% recycled PED braiding. Then, the strap uses 75% recycled bonded leather paired with recycled housings (100% rTPU and 20% rTPE). 3. The JBL Go 3 Eco and Clip 4 Eco Bluetooth speakers bring you great sound in a sustainable design. They’re coming soon, starting at $49.95 on the official website. JBL Go 3 Eco on a dock Take your favorite music on the go, sustainably, with the JBL Go 3 Eco and Clip 4 Eco Bluetooth speakers. Their main construction uses 90% PCR plastic, while the speaker grills have 100% recycled fabric. The JBL Go 3 Eco offers a pocket-size shape, and the JBL Clip 4 Eco delivers big bass and 10 hours of playtime. They’re some of the most sustainable tech gadgets of 2023. 4. The Garmin Instinct Crossover Solar rugged hybrid smartwatch powers in the sun. It costs $549.99 on the brand’s website. Garmin Instinct Crossover intro video Enjoy military standards and tactical features in a smartwatch with the Garmin Instinct Crossover Solar rugged hybrid smartwatch. Connecting to Android and Apple devices, it meshes well with your everyday life. Best of all, it recharges in the sun, so you never have to worry about batteries. 5. The Acer eKinekt BD 3 bike desk lets you work, exercise, and make electricity to charge your devices. It’s coming soon for $999. Acer eKinekt BD in a home office There are many good reasons to add the Acer eKinekt BD 3 bike desk to your office. Not only does it get you moving, but it also allows you to generate electricity that can power your devices. Add to that the PCR Plastic design and different pedaling modes, and you’ve got one of the most sustainable office desks around. 6. The Mill compost bin and membership help reduce global food waste in a stylish and stink-free way. Reserve yours today for $33 on the official website. Mill compost bin in a kitchen Home food waste is pretty damaging to the planet. The creators of the Mill compost bin and membership have a plan. Their minimalist bin dries, shrinks, and deodorizes your food trash overnight, so there are no smells. Then, the company mails your compost back to farms. 7. The Urbanears Boo Tip true wireless earbuds have a design made of recycled plastics and a comfy fit. Buy them for $69.99 on the official website. Urbanears Boo Tip in Charcoal Black Go for earbuds that are gentler on the planet with the Urbanears Boo Tip true wireless earbuds. As some of the best sustainable tech gadgets of 2023, they boast recycled plastic from bottles, air conditioner units, and more. Moreover, they fit well and offer a limited full-charge capacity of 90%, ensuring more extended battery use. 8. The Schneider Home integrated energy management system gives you easy control over solar, EV charging, and more. Contact the brand for pricing. Schneider Home informational video Want to manage your sustainable energy more easily at home? Check out the Schneider Home integrated energy management system. It puts all your energy endpoints and home appliances onto 1 interface where you can prioritize how energy is used. Even better, it works with an app. 9. The Oakywood Slim Charging Pad has an eco-friendly wood design and uses an ecological wax oil coating. Get it for $70 on the company website. Oakywood Slim Charging Pad and a keyboard Make charging your wireless devices greener with the Oakywood Slim Charging Pad. It offers a classic eco-friendly wood design with a non-toxic wax oil coating. What’s more, the charging speed automatically adjusts to your smartphone model and goes up to 15W. 10. The Solios Curve Solar Watch charges with natural and artificial light and features a recycled stainless steel case. Purchase it for $320 on the official website. Solios Curve Solar Watch with a black case Buy a watch you can feel good about when you go for the Solios Curve Solar Watch. You’ll love charging with both natural and artificial light. Also, the case uses certified recycled stainless steel, making it one of the most sustainable tech gadgets of 2023. 11. The EcoFlow Glacier portable refrigerator offers a direct solar charging option and efficient energy savings. It’s coming soon for a to-be-announced price. EcoFlow Glacier side view Enjoy fresh ice while you travel with the EcoFlow Glacier portable refrigerator. Interestingly, it has both a plug-in battery and an ice maker. It lets you chill your food anywhere thanks to direct solar charging. Tech gadgets can be gentler on the environment, and these gadgets prove our point. What sustainable tech products do you use? Tell us about them in the comments. Want more news, reviews, and guides from Gadget Flow? Follow us on Apple News, Google News, Feedly, and Flipboard. If you use Flipboard, you should check out our Curated Stories. We publish 3 new stories every day, so make sure to follow us.","filter_flag":1}
{"title":"3D Printing Industry Executive Survey 2023, Additive Manufacturing Experts tackle the greatest engineering challenges ... - 3D Printing Industry","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovLzNkcHJpbnRpbmdpbmR1c3RyeS5jb20vbmV3cy8zZC1wcmludGluZy1pbmR1c3RyeS1leGVjdXRpdmUtc3VydmV5LTIwMjMtYWRkaXRpdmUtbWFudWZhY3R1cmluZy1leHBlcnRzLXRhY2tsZS10aGUtZ3JlYXRlc3QtZW5naW5lZXJpbmctY2hhbGxlbmdlcy1vZi10aGUtY29taW5nLWRlY2FkZS0yMjA0MTgv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovLzNkcHJpbnRpbmdpbmR1c3RyeS5jb20vbmV3cy8zZC1wcmludGluZy1pbmR1c3RyeS1leGVjdXRpdmUtc3VydmV5LTIwMjMtYWRkaXRpdmUtbWFudWZhY3R1cmluZy1leHBlcnRzLXRhY2tsZS10aGUtZ3JlYXRlc3QtZW5naW5lZXJpbmctY2hhbGxlbmdlcy1vZi10aGUtY29taW5nLWRlY2FkZS0yMjA0MTgv0gEA?oc=5","id":"CBMitQFodHRwczovLzNkcHJpbnRpbmdpbmR1c3RyeS5jb20vbmV3cy8zZC1wcmludGluZy1pbmR1c3RyeS1leGVjdXRpdmUtc3VydmV5LTIwMjMtYWRkaXRpdmUtbWFudWZhY3R1cmluZy1leHBlcnRzLXRhY2tsZS10aGUtZ3JlYXRlc3QtZW5naW5lZXJpbmctY2hhbGxlbmdlcy1vZi10aGUtY29taW5nLWRlY2FkZS0yMjA0MTgv0gEA","guidislink":false,"published":"Fri, 27 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=27, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovLzNkcHJpbnRpbmdpbmR1c3RyeS5jb20vbmV3cy8zZC1wcmludGluZy1pbmR1c3RyeS1leGVjdXRpdmUtc3VydmV5LTIwMjMtYWRkaXRpdmUtbWFudWZhY3R1cmluZy1leHBlcnRzLXRhY2tsZS10aGUtZ3JlYXRlc3QtZW5naW5lZXJpbmctY2hhbGxlbmdlcy1vZi10aGUtY29taW5nLWRlY2FkZS0yMjA0MTgv0gEA?oc=5\" target=\"_blank\">3D Printing Industry Executive Survey 2023, Additive Manufacturing Experts tackle the greatest engineering challenges ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">3D Printing Industry<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"3D Printing Industry Executive Survey 2023, Additive Manufacturing Experts tackle the greatest engineering challenges ... - 3D Printing Industry","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovLzNkcHJpbnRpbmdpbmR1c3RyeS5jb20vbmV3cy8zZC1wcmludGluZy1pbmR1c3RyeS1leGVjdXRpdmUtc3VydmV5LTIwMjMtYWRkaXRpdmUtbWFudWZhY3R1cmluZy1leHBlcnRzLXRhY2tsZS10aGUtZ3JlYXRlc3QtZW5naW5lZXJpbmctY2hhbGxlbmdlcy1vZi10aGUtY29taW5nLWRlY2FkZS0yMjA0MTgv0gEA?oc=5\" target=\"_blank\">3D Printing Industry Executive Survey 2023, Additive Manufacturing Experts tackle the greatest engineering challenges ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">3D Printing Industry<\/font>","source.href":"https:\/\/3dprintingindustry.com","source.title":"3D Printing Industry","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Our first article looked at the future of 3D printing, with additive manufacturing experts gazing into a crystal ball to forecast the trends for 2023 in the industry. The 2023 3D Printing Industry Executive survey broadens the scope and asks 3D printing insiders two questions. What is the greatest engineering challenge of the coming decade? What technology will be required to solve this? Approaches to answering this question varied, some chose to tackle challenges specific to advancing additive manufacturing in the next ten years. At the forefront of executives’ minds are approaches to lowering cost-per-part, ensuring quality is maintained, and how AM can leverage its core advantages to the full? Process Automation and the combination of AI approaches to the additive ecosystem, including intelligent production management systems, part design, and physics-informed neural networks, are covered. How does Moore’s Law relate to 3D printing, and what technologies are on the rise? Tying everything together, a recurrent word: Production. Other respondees take an alternative approach. What is the bigger picture, and how will technology be deployed to address critical global issues such as decarbonization, the electrification of transportation, green energy production and Industry 4.0? What will combining 3D printing with emerging technologies such as computational material discovery, synthetic biology, or robotics yield? Again, a broad range of respondees were surveyed, from end users such as Czinger Vehicles to the largest manufacturers of 3D printing systems, software, and materials. And despite the featured image, not one mentioned flying cars. Settle in and enjoy the insights from the experts below. Engineering challenges for the next decade word cloud. Image by 3D Printing Industry What do 3D printing experts predict for 2023? Read part one of our annual 3D Printing Industry Executive Survey here. Subscribe to our free newsletter for regular news, analysis, and insights into additive manufacturing. Want to add your insight? We welcome contributions from everyone in the industry, get in touch. Dr. Brent Stucker, Chief Technology Officer – Additive Manufacturing, 3D Systems I believe the greatest engineering challenge of the coming decade will be the electrification of transportation. This is due to the fact that vehicle electrification has significant challenges associated with energy generation, grid stability, distributed charging of vehicles, battery technology, and optimization of vehicle components for electrical propulsion rather than internal combustion propulsion. We are already seeing additive manufacturing (AM) playing a role in each of these areas, but I think there is still a larger role for AM to accelerate vehicle production and performance as well as electricity generation, transmission, and storage. In order for AM to make an even larger impact, it will be necessary to make significant advancements in technologies, materials, and processes. I think the ability to use multiple materials within one system to build complex multi-material shapes at higher precision and productivity will be a key enabler. When thinking about energy generation and the grid, the goal is to capture a higher percentage of the incoming energy, whether that’s solar, wind, fossil fuel, hydropower, or nuclear. To achieve more efficient energy capture we need complex metal parts from high-temperature materials. AM facilitates this while also enabling efficiencies through parts consolidation. This will also be useful for key components in the grid such as switches and transformers. All of that power we’ve now generated and distributed needs to be stored in batteries and efficiently used to power the vehicle. I foresee AM playing a critical role in the production of next-generation batteries and electric motors. Current battery designs involve complex layers of multiple materials; as such a multi-material additive manufacturing approach compatible with battery-relevant materials at battery-relevant feature resolutions could upend battery design. Similarly, electric motors could shift from nearly monolithic designs to integrating coils built into structural elements or other components. This can result in better thermal management as well as reduced weight, which in turn can help improve efficiency and performance. Being able to process several materials within the same 3D printer takes parts consolidation and efficiency to a whole new level for batteries and electric motors. In addition, the standard benefits of AM to other industries, including the ability to bring new products to market more quickly with less assembly and manual labor, can help accelerate electric vehicle transformations as demand increases. Guy Menchick, Chief Technology Officer, Stratasys As manufacturers worldwide continue to feel the pressure of increased costs throughout the supply chain, the greatest challenge to overcome, almost universally, is being able to drive down costs to remain competitive. For 3D printing specifically, the same is true: it is critical to continue driving down the cost per part, so that we can continue displacing traditional manufacturing with additive manufacturing in more applications. At the same time, we must maintain and improve essential properties that are critical for performance, such as accuracy, surface finish, and mechanical properties. This is predominantly dependent on two key factors: systems and materials. In order to drive down system costs, we need to interrupt the tight correlation among inkjet and DLP technologies between resolution, throughput and price. Increasing resolution means smaller drops. Small drops slow throughput. To compensate, more print heads are often added, which increases price. Fortunately, these 3D printing technologies have been following ‘Moore’s Law’, which essentially means that system speeds and capabilities will roughly double every couple of years without any increase to the original prices. In a nutshell, this means that many of the Stratasys solutions currently enabling industrial parts production – from P3 to SAF and more – will all be set to enjoy a significant performance gain in coming years, without this necessarily being reflected in the base cost. Stratasys’ J35 Pro 3D printer is being used to produce key prototypes for radio products. Photo via Stratasys. Nikolai Zaepernick, Chief Business Officer & Managing Director, EOS A big challenge lies on the cost side. Making the most of additive manufacturing for large-scale production and the sustainability possibilities requires to be mindful of bottom-line concerns. The challenge is to reduce cost-per-part along the entire value chain whilst keeping quality promises. For a start there is huge potential to reduce cost-per-part and open new applications by reducing supports in metal 3D printing. By shifting to support-free, we are improving the AM process economically, environmentally and with regard to time. (Not needing to construct supports during the build means less of the material in the powder bed will be melted, it increases the build rate and the support removal costs.) In the future, new support free software tools will help create even better parameters and exposure strategies to further optimize the production process. This will include shorter exposure time, less material consumption and saving post-processing resources. Frank Carsten Herzog, Founder and Managing Director, HZG Group The biggest engineering challenge will be to transfer the processes of 3D printing to industrial production. This involves achieving a high level of reliability, customizability, reproducibility, and speed in AM production, while reducing costs so that it can be used for high-volume manufacturing of parts and products. An enormous task! When it comes to 3D printers, we will see more machines that successfully combine the advantages of established systems that have so far operated in separate solutions. Precision vs. speed, robustness vs. openness to materials – these points will no longer be mutually exclusive, making technology attractive to a broader range of customers. There is also a high potential for software. The high manual design effort will be reduced by intelligent software, for example. Users will benefit, as will production, as machines can be controlled more efficiently. Dr. Gregory Hayes, Senior Vice President Applied Technology, EOS North America One of the largest engineering challenges we will face as an industry in the coming decade will be the complexity of energy, specifically green energy production and energy storage. Wind, solar, fusion, and fission all have the manufacturing challenges that require additive manufacturing due to their unique and intricately designed components. Further, decreasing energy consumption through distributed manufacturing can aid new energy production by requiring less energy globally. Environmental impact will also be a challenge as we continue forging new solutions, leveraging the beneficial derivative nature of AM to lessen customer organization’s footprint on our environment. A 3D printed aerospike rocket engine designed using Hyperganic Core. Photo via EOS. Andre Wegner, CEO, Authentise The greatest engineering challenge is to shorten the time it takes to turn an idea into a part. All other manufacturing and engineering challenges come second to this, as shortening this cycle will allow us to develop better, more sustainable products, adapted to local realities. Three technologies are critical to making this happen: First, we need to develop a semantic that will allow us to communicate ideas in words, not geometries. Geometrical designs, even annotated ones, are black boxes that clearly communicate only a fraction of the ideas used to generate them. Customer drivers, machine\/material restrictions, and engineering experience are all lost. A new semantic that allows us to communicate in words would allow algorithms to determine new options for manufacturing when any input changes – as described below. Secondly, we need to deliver generalized algorithmic tools that allow us to take the semantic input and define production processes, parameters and designs. These tools are already in development, but are scarcely used beyond topology optimization. This has to change – the speed and volume of data now available to make production decisions from historical, production or in-use sources exceeds human capability and imagination. Thirdly, we need machines fully capable of expressing their capabilities. Not only as designed, but based on the usage profile and environment. Algorithms must be able to query: Given your usage profile, what tolerance are you able to maintain?, alongside many other queries. Wayne Davey, Global Head Go-to-Market, HP Personalization and 3D Printing One of the most obvious challenges we will face in not just the years, but the months to come, is that of climate change. As we move into the new year, sustainability will continue to remain top of the agenda for brands and businesses alike, which will move away from being just a trend, to a requirement. Therefore, as organisations accelerate their sustainability initiatives, manufacturers, brands and other organisations must be looking at their business and workflow processes holistically, to ensure that they’re delivering end-to-end solutions with a lower environmental impact. That includes everything from the materials they offer and where they source it from and how they recycle or reuse those materials, right through to the manufacturing technology they use and how they deal with waste. 3D printing is a viable option to help companies transform into more sustainable businesses. According to HP’s Digital Manufacturing Trends Report, around 50% of global digital manufacturing and 3D decision makers are interested in exploring the technology further for its impact in promoting a circular economy, and therefore reducing the number of materials used in production and simplifying and creating additional value from production systems. Additive manufacturing is proving its ability to do so in the packaging industry. It provides an option to help businesses make smarter decisions whilst also utilising more sustainable solutions. Molded fiber is widely recognised as an eco-friendly and biodegradable alternative to traditional plastic packaging, and eliminates the need for harmful material disposal methods. 3D printing technology will need to continue to evolve, opening up opportunities for use in increased industries and for a wider range of products. With the trajectory of the 3D printing industry so far, it seems likely that technology will continue to innovate and upgrade allowing for more exciting use cases to emerge. A fleet of industrial 3D printers on the production floor – HP Jet Fusion 5200. Image via HP. Dr. Johannes Homa, CEO, Lithoz Over the coming decade there will be a clear “race for efficiency” to overcome the biggest obstacle currently faced by mankind – climate change. Working towards eco-friendly solutions and overcoming such problems will be the major priority of engineering over the next decade. Sourcing renewable energy, enabling new and more sustainable materials and most of all reducing the amount of energy required during production are the top focuses for companies right now – and the key to it all is higher efficiency. As such, innovators will increasingly consider ceramics as a powerful and sustainable solution which can keep pace with the demands of technological innovation. The integral advantages of ceramics over metals and polymers in terms of durability, biocompatibility and flexibility prove why they are gaining a growing share of the market and will offer a real boost in the race for efficiency. From a technological viewpoint, 3D printing will as a first step redesign existing parts to be more efficient. In a second phase, manufacturers will use this technique to create an entirely new generation of sustainable and powerful components. While this technology will be used to improve parts, it is important to also drive the progress of the technology itself forward. Next generations of 3D printing techniques will be developed and released over the coming decade, allowing for the ever faster realisation of increasingly complex and accurate components. A gear 3D printed using zirconia-toughened alumina and alumina. Each zone has different strength properties. Photo via Lithoz. Bas de Jong, COO, 3YOURMIND As distributed manufacturing models continue to evolve and gain new adoption, one of the biggest engineering challenges will be standardizing production processes for additive manufacturing and qualifying parts to scale. Today, many manufacturers equipped with print-on-demand technology utilize proprietary methods or units of measurement. In a distributed manufacturing model, this practice presents part replication challenges that can vary in quality and performance across production sites or part suppliers. To resolve this, there needs to be a two-pronged approach. First, there needs to be buy-in from major original equipment manufacturers and material manufacturers to collaborate with standardization organizations to create a unified vision for what practices should be standardized and why. In addition, software and machine vendors will play a critical role in executing these production standards across different software tools while protecting intellectual property information. Although the challenge is less on engineers to find solutions, it will create a substantial collaborative effort between manufacturing entities protective of design patents and production recipes and vendors and suppliers that provide services across multiple regions or organizations. Sona Dadhania, 3D Printing Analyst, IDTechEx Shifting energy infrastructure from fossil-fuel based sources to renewable energy sources is critical to the fight against climate change. There are a whole host of technologies required to implement renewable energy, one of which is energy storage, a topic often discussed at IDTechEx. For example, the demand for batteries for stationary energy storage grows as electrical grids need to store excess electricity generated from energy sources like photovoltaics. Additionally, renewable energy generation capacity, across many sources like solar, wind, and nuclear, needs to dramatically increase to successfully reduce dependence on fossil-fuel generated power. An important contributor to facilitating this renewable energy transition is additive manufacturing. Not only can additive manufacturing be used to improve the performance, efficiency, and safety of certain sustainable energy sources like wind turbines, but it can also be used to reduce the costs of the installation of renewable energy sources, thus quickening this transition. Additionally, the traditional benefits of 3D printing such as customization of parts and enabling of localized manufacturing and supply chains will help the renewable energy transition occur globally. Kevin Nicholds, CEO, Equispheres Over the next decade, we need to transform our production systems and energy usage to a sustainable model. This is a big-picture challenge that won’t have a single solution, but additive manufacturing will be a significant enabler of the range of solutions that bring together more efficient and resilient supply chains, more energy-efficient transportation and production fueled by sustainable energy, higher levels of recyclability and less waste generation. By permitting more efficient and complex designs, 3D printing enables solutions like improved battery technology and lighter, stronger vehicles. It also has the potential to be a more sustainable manufacturing option, but to realize that advantage at the scale we need requires broader adoption and significantly improved efficiencies. I think the solution is collaboration. Bring the manufacturing knowledge from folks who have been doing large-scale manufacturing for decades and utilize that knowledge to design AM systems and processes. As AM evolves from primarily a R&D and prototyping technology, we are seeing more teamwork. Both companies and individuals with long histories of manufacturing are looking at the AM paradigm in new ways, and this has led to more innovations. I think we need to continue to push collaboration between the technology experts and the manufacturing experts to accelerate the adoption of AM in a way that will make it more capable of helping to solve big-picture challenges, by being faster, more cost effective, and more sustainable as a manufacturing process. John Kawola, CEO, Boston Micro Fabrication While there are multiple technical barriers, material science and full closed loop process control need to reach a level to ensure 3D printing can meet technical needs and meet the control\/quality requirements manufacturers demand. Most 3D printing materials are approximations of standard engineering grade materials. These approximations need to be more aligned. Process control has been implemented in manufacturing for many years. There needs to be development to more seriously apply this to additive. Krzysztof Wilk, R&D Director, 3DGence Previous years showed us how fragile current supply chains are. Companies will seek material and logistics savings and maintain a high level of security for components supply. To make this possible, companies will adapt their infrastructure by equipping it with AI-enabled intelligent production management systems, maximizing the efficiency of local and distributed machine parks. The spread of modern manufacturing technologies will allow for the reduction of material inventories. Digitization of warehouses and on-demand production supported with AI, and machine learning, virtual and augmented reality, all of those tools are going to be crucial in modern manufacturing. An essential role in the development of technology will be played by the energy transition, accelerating the emergence of modern solutions that increase energy independence as well as have a positive impact on reducing climate change. Further, into the coming decade, it will be possible to expect the development of new energy and manufacturing technologies to support the expansion of infrastructure beyond our planet. New production systems, energy storage, automated manufacturing of equipment and spare parts in space or the construction of habitats on other planets using locally available raw materials will allow for an ever-widening expansion of human activities beyond the home planet. Arjen Evertse, General Manager Sales EMEA, Mimaki Europe From Mimaki’s perspective, it is expanding on the materials we can use in our 3D printing, which will take our 3D technology to new heights, greatly expanding the possible applications. Ensuring that, no matter the characteristics of the material, they are able to jet through an inkjet head, without compromising on stability or print quality, will be a significant challenge. Knowing what technology will be needed to solve this is certainly another part of that challenge, requiring significant material research and technological development. Mimaki has turned 3D printing into an art with the Mimaki 3D printer 3DUJ-553. Photo by Michael Petch. Ted Sorom, CEO & Co-founder, Mantle The greatest engineering challenge of the coming decade is also the biggest looming opportunity; how to harness the power of artificial intelligence (AI) software to reshape the world of manufacturing. Increasingly, manufacturing equipment is able to gather critical process data, but how to most effectively leverage AI to analyze this data and proactively change manufacturing processes in a way that increases efficiency and productivity, while also reducing costs has yet to be determined. Dr. Cora Leibig, CEO and Founder, Chromatic 3D Materials The greatest engineering challenge of the coming decade will be creating robotics that can accomplish complex tasks with simple instructions — for example, tools to assist the elderly with household tasks. To achieve this, we’ll need manufacturing technology that can be tailored to meet very specific demands. Gavin Jeffries, Founder and CTO, Fluicell AB In the last decade, 3D printing has transitioned from being a prototyping tool for aiding the design process, to now being an essential manufacturing technology, enabling functional parts to be manufactured in ways impossible using conventional tooling. In the coming decade, I would expect to see a similar transition to occur in the 3D bioprinting space, where we will transition away from simple construct demonstrations of printing biological material, to generating essential living tissue sections for pharmaceutical development as well as for therapeutic use. The focus will likely be on patient-specific human tissues, either allogeneic or autologous, with emphasis on establishing personalised bioprinted solutions. When building patient-specific tissues, 3D bioprinting is only the first step in a complex process. Technologies will need to be established to monitor, quality control, and evaluate the function of one-of-a-kind samples. These will likely need to be non-destructive and ideally non-contact techniques, such as holographic phase microscopes and electrical impedance monitoring, to preserve the integrity and function of the tissues. New delivery technologies will also need to be established to utilise the therapeutic benefits while protecting the tissues from immune responses. National networks and regulatory bodies are now beginning to participate in this journey, and responses are now being seen by actions such as the 2022 FDA modernisation act and the upswing of entities such as ATMP (Advanced Therapeutic Medical products) networks and 3R (Reduce, Replace, Refine) implementation, both focussing on transitioning toward using designed tissues instead of animals or simple biological systems. Luo Xiao-fan, CEO, Polymaker For most additive manufacturing technologies, I think process complexity is still the biggest technical challenge. Unlike most traditional manufacturing technologies, 3D printing has many process variables, and there is a highly coupled relationship between process, material and geometric structure; the traditional process development and optimization paradigm can no longer adapt to the highly complex process characteristics of 3D printing. This has also led to a series of challenges that the 3D printing industry is still facing: process development and optimization take a long time, printing process control is difficult, quality consistency is low, performance is unpredictable, and so on. To solve this problem, this requires the coordination of many technologies. First of all, we need to improve the construction of the physical model of the printing process. Academia has done a lot of work in the past few years, and it should be said that a good foundation has been laid. What is needed next is to develop simulation software based on these accurate and verified physical models as the main tool for studying the 3D printing process, and at the same time establish a matching, standardized database of equipment, materials and processes. With this foundation, the application of process development, optimization and control can be built based on specific technologies and application requirements; the technical possibilities here are relatively rich, and it can be combined with artificial intelligence and data science to achieve efficient process optimization , It can also be combined with online monitoring of hardware to realize closed-loop control of the printing process, and can also be connected with design software to form a complete closed-loop from design to production. The realization of the above technologies requires a lot of investment and multi-disciplinary efforts, but this is also the technical threshold that must be solved for additive manufacturing to further realize its potential and truly become a mainstream manufacturing technology. We (Polymaker) have also made a lot of investment and made a lot of progress with many partners in the past few years. In 2023, we will have more profound solutions to face to the market, and here you can also look forward to it. Hardik Kabaria, Vice President of Software, Carbon There are certain pain points in the design and manufacturing space that will need to be addressed through integrated engineering solutions over the next few years. For example, as engineers design products, there’s a significant amount of manual labor that can be repetitive during the design process for mechanical and electrical components while utilizing CAD and CAE software packages. Just in the last couple of years, there have been significant advancements toward automating design processes to counteract this, with tools like physics-informed neural networks being applied to problems in the CAD and CAE world. Engineers are also challenged by fragmented processes. Prototyping processes used in the design stage are not connected to the actual manufacturing process, particularly around development timelines and estimated cost per part. This disconnect can lead to friction, limitations on innovation, and delayed time to market. However, there are advancements being made in the additive manufacturing industry that provide more alignment between the prototyping and manufacturing processes, and I anticipate that this will become more streamlined over the next few years. For example, Carbon has created a software solution, Design Engine, that unifies the product design, development, and manufacturing process to help designers and engineers move seamlessly from idea to design and final production. Similarly, engineers currently need to deal with feedback loops between metrology of the manufactured parts and the intended design that aren’t automated or mature. Our industry as a whole is reinventing the design process for the manufacturers of physical components for products – from printed circuit boards and chips to large mechanical parts like turbine blades and wings for aircraft – so these feedback loops will get better but it will take time. Over time, as the systems and processes develop and mature, product development cycles will become more efficient, advanced, and streamlined, which will help companies create better products and bring them to market faster. A Carbon 3D printer fleet at an Oechsler facility. Photo via Oechsler. Shon Anderson, CEO, B9Creations As environment, social, and governance (ESG) factors continue to become a growing concern for businesses, sustainability will pose the greatest engineering challenge of the coming decade. While additive is widely acknowledged as contributing to reducing the manufacturing sector’s impact on the environment, from reduction of waste vs. subtractive manufacturing to reducing carbon footprint and part travel by printing on-site, we will start to see a shift toward companies needing to address their ESG impact – from 3D printed parts through post-processing waste streams. Eric Bert, SVP Commercial, InkBit Focusing on our own industry, dimensional accuracy, material properties, and cost-per-part are still challenges to be resolved. AM has to be able to compete with traditional manufacturing methods and win on those factors, and I believe high throughput inkjet is the answer in most cases. It is a priority for Inkbit to drive the cost-per-part down and to be competitive with traditional technologies, as well as other AM processes, whilst delivering the dimensional accuracy and overall structural quality people come to AM for. Material properties are also a crucial factor, again designers shouldn’t have to choose between material and form, as they can’t have both because AM doesn’t offer the material but traditional doesn’t allow for complex geometries, AM is supposed to offer true freedom of design, but in truth we’re still working towards that, often because material choice is still limited. And of course this is what we’re working on at Inkbit, our materials are formulated for durability, to be impact-resistant and withstand long-term UV exposure, and we’re developing more all the time; we use closed-loop feedback control to guarantee repeatable dimensional accuracy and the productivity of our system helps us to deliver very competitive cost-per-part. Inkbit’s 3D printer can produce multi material objects at high volumes. Clip via Inkbit. Alessio Lorusso, CEO & Founder, Roboze Our experience in the additive manufacturing of parts with high-performance thermoplastic materials has demonstrated in recent years its ability to integrate into traditional production processes, offering as the first tangible advantage in the short term the reduction of production costs and delivery times. The next 10 years will be key in increasing end-user awareness of the benefits of industrial additive manufacturing. This will lead to new challenges that we think will be played out on two distinct levels: sustainability and the integration of technology into all stages of production. Roboze is already working on both fronts, proposing not only innovative technologies and materials, favored by our strong nature in the research and development of completely new and competitive ecosystems, but also more sustainable business and financial models. Edward Feng, Founder & CEO, Raise3D Regarding development in the last thirty years, what are the challenges for the 3D printing market for the next decade? I would like to summarize using the TOE framework: T for Technology, O for Organizational structure, and E for Environment. The biggest challenges in the next ten years probably exist within these three aspects. In terms of technology, it refers to the compatibility between old and new technical routes, such as possible iterations of technology and whether automation can support it, how to combine this with traditional CNC, or partially replace traditional manufacturing methods. At an organizational level, a team and its paradigm need to be in line with the pace at which things are developed to absorb new technology, such as 3D printing. It is important for an organization to measure whether they can afford to have a certain tolerance for innovation failure, whether the profit from re-innovation meets the expectation, or if the cost reduction is worth the efforts of adopting 3D printing technology. Additionally, in terms of the environment, the organization needs to be aware that government policy and industrial competition can affect an enterprise’s priority for 3D printing when the intention is to empower a current business. In the real world, TOE readiness is different in Europe, the United States, and in Asia when faced with new technology. The differences exist even between fields, industries, and companies. Therefore, I think that TOE diversity will be the top problem to be solved in order to implement 3D printing in the next ten years. Jason Fullmer, Chief Operating Officer, Formlabs The greatest engineering challenges in the coming decade are supporting the increasing demand for mass customization and designing supply chains for new technologies that are faster, more nimble, and equally as cost-effective as today’s systems. 3D printing supports both of these challenges, enabling efficient, cost-effective onshore production and providing the ability to customize consumer guides at scale without increasing material or labor costs. For example, Formlabs Automation Ecosystem provides a three-time increase in productivity while saving up to 80% on labor, lowering cost per part by 40%, and reducing packaging waste up to 96%. With the ability to manage multi-user, multi-material printer fleets, the Automation Ecosystem enables continuous production so users can send multiple prints to run overnight and into the weekend, making mass production a reality. Philipp Kramer, CTO & Co-founder, DyeMansion Even as devices become more energy efficient, we are facing a huge rise in demand for energy due to population growth and rising incomes, resulting in more money being spent on products and services. We often rely on new technologies to fight climate change, but the improvement of already existing technologies will have a huge impact as well. Planning, manufacturing, and installing sustainable energy sources, such as solar panels or batteries, requires highly skilled people and a lot of effort. Let’s take installing solar panels on the roof of our house as an example. Somebody needs to plan it, parts need to be manufactured, and highly trained technicians need to install it. Automating parts of this process and reducing the need for skilled people (e.g., via AR) will be key to meeting the rising energy demand. DyeMansion’s VaporFuse surfacing system, the Powerfuse S, has received two new process innovations. Photo via DyeMansion. Dr. Vladimir Navrotsky, Additive Manufacturing Chief of Technology, Siemens Energy The greatest engineering challenges of the coming decade are undoubtedly the decarbonization of industries and the energy transition. I strongly believe that additive manufacturing will play a significant role in solving this challenge. Gas turbines that run on biofuels and green hydrogen will still be needed in the future energy mix. AM-designed gas turbine burners allow even installed turbines to be upgraded so they can use of up to 100 percent hydrogen. AM-designed and manufactured high-temperature alloy turbines blades and vanes will significantly increase turbine efficiency and as a result reduce fuel consumption and emissions. Using AM to produce fuel cells and heat exchanges will drastically enhance their efficiency and reliability. Finally, recycling AM components will reduce material demand and emissions. Max Siebert, CEO, Replique I see two major challenges for the engineering industry: persistent supply chain disruptions and climate change. Decentralised manufacturing with a digital inventory can play a critical role in developing greener and more resilient processes by eliminating physical inventory and producing only the quantity needed, anytime, anywhere. 3D printing has already established itself as a serious production method to achieve this goal. However, in the coming years, more training and education in companies and universities will be required to truly scale up. In addition, costs must come down for 3D printing to be used in mass production. In my eyes, pellet printing is an innovative example of how cost reduction can be achieved by streamlining the material manufacturing process to fewer steps. Paul Holt, Founder, Photocentric The biggest challenge in engineering is to develop sustainable solutions for automated mass manufacture. Key to success will be the development of smart software that increases process efficiency in terms of energy, time and materials savings through the use of big data. From a hardware viewpoint, the design of modular systems that are scalable will be the answer to fulfil the needs of parts on demand. Finally, creating recyclable materials suited to the industrial requirements for mass production will complete the ecosystem. Xavier Martínez Faneca, CEO, BCN3D One of the biggest challenges facing manufacturing in the coming decade is the need for greater autonomy and control in the production process. This includes the ability to produce products locally, customize them to meet specific needs, and have more control over supply chains. However, currently, 3D printing technologies have not yet reached the level of maturity needed to fully unlock this potential. One solution to this challenge is the development of advanced 3D printing technologies that could become the pivotal point of manufacturing, such as VLM (Viscous Lithography Manufacturing). This technology has the potential to give companies full control over the fabrication life-cycle of their products, from design to final production. Ao Danjun, CEO, Creality The greatest challenge is how to achieve 5-10 times higher printing speed than the current one while balancing print quality and ensuring success rate. In addition, the range of printing materials for high-speed 3D printers, especially industrial-grade 3D printing materials, needs to be expanded. 3D printing is a multidisciplinary technology that involves efforts from multiple sides. We will work with partners in various fields to create a synergy and empower Industry 4.0 by leveraging the power of 3D printing. Doug Kenik, Director, SW Product Management, Markforged As we look at the manufacturing landscape and the evolution of requirements over the past years, we see the industry heading in an exciting direction. Two emerging trends will influence the industry: supply chain disruption and localization to increase efficiency, and the speed of development in a digital world – which has yet to be matched in the physical world. The collision of these two trends will surface a manufacturing and engineering challenge, demanding further manufacturing disruption to increase efficiencies and bridge the gap between physical and digital in a shorter amount of time. This is a manifestation of on-demand requirements at scale, as well as business drivers to iterate quickly and suppress costly overhead. Overcoming this challenge will require maturing localized manufacturing, such as additive manufacturing, to augment traditional processes, and combine it with digital automation through data and software to increase efficiencies in traditional and emerging manufacturing. Efficiencies through automation will be realized quickly but can only be leveraged with the correct combination of data and software. A screenshot of the UI when using the Simulation feature on Markforged’s Eiger software. Image via Markforged. Jason Vagnozzi, Global Vice President of Additive Manufacturing, Braskem The promotion of green engineering to reduce the carbon footprint of traditional manufacturing is an important trend we are keeping a close eye on. We believe that additive manufacturing can help play a key role in helping companies to develop a more sustainable approach to manufacturing. Steffen Schmidt, CTO, Danish AM Hub Real sustainable manufacturing will be a big challenge. Too many companies greenwash their image with minor changes to their internal energy usage in their own production and are satisfied with only this minor effort. But they seldom address the real challenge: To change the products they produce and how they produce it. The Scope1 and 2 emission reductions are more or less of a one-off – not bringing a continuous reduction to our global CO2 emissions. The only way to change this is by knowledge, so both the customer and the manufacturer know of and acknowledge the importance of sustainable products and production. Training and dissemination of knowledge are key, and every manufacturer of 3D printers, CAD, and 3D print-related software needs to implement and support this. Professor Moataz Attallah, The Advanced Materials Processing Lab. (AMPLAB), University of Birmingham The Ukrainian-Russian war has identified sustainable energy as the key engineering challenge. 3D printing may play a great role in speeding up the uptake of both renewable and sustainable energy sources. I hope to see 3D printing being used in the construction of nuclear reactors and their components, either by concrete 3D printing or 3D printing of reactor components. A key game changer would be the development of nuclear fusion. 3D printing can be used to produce the components that are meant to handle the extreme conditions in nuclear fusion, particularly the cooled plasma-facing components. Sylvia Monsheimer, Head of Industrial 3D Printing, Evonik Industries AG A major engineering challenge in the next decade will be realizing the first large-scale industrial lighthouse applications. Admittedly, this presupposes various aspects such as faster processes, more application-specific materials, data handling and automation along the entire production chain as well as proven scaling effects. In the end, no single technology will be able to unbind 3D printing at scale – it is more of an integrated production chain which is the decisive point. At Evonik, we expect a decade of new infinite 3D applications across all industries contributing to our capability to develop the right high-performance materials and expand our production capacities along the market growth to create trust and actively shape the market and thus being always stay one step ahead. Alexandre d’Orsetti, CEO, Sculpteo The greatest challenge of the upcoming decade will be in the design, and availability of 3D models. We’ve seen a vast hardware expansion in the past, but 3D models are still somehow complicated to make. Nevertheless, we are starting to see some automation in the modeling of 3D files, as well as powerful simulation tools that are required to convince the market and provide reliability on parts. Machine manufacturers, material developers, and service providers have a main challenge of constantly improving the technology to meet the repeatability, quality, properties, and cost per part which are requested by customers to unlock new applications and especially bigger series. Gareth Neal, Business Development Manager EMEA & Israel, 3D Printing & Advanced Applications, Xaar In one word – energy! The development of energy solutions, from solid state batteries to hydrogen fuel cells, and the role that digital manufacturing techniques can play in enabling these technologies and markets will be increasingly important over the next decade. The ability to digitally print any shape, to exacting specifications with appropriate materials will save time and significantly reduce costs in relation to today’s analogue processes. Here new capabilities such as Xaar’s High Viscosity Technology and particle loading capability will enable developments at a usable resolution and speed, driving new Additive Manufacturing applications in this growing sector. Greg Brown, VP of Technology, Velo3D Thermal management\/distortion as systems get more productive and parts get larger and hotter. Some legacy solutions to these problems on smaller systems (eg. utilizing thick build plates to prevent part deformation, adding machining stock to parts, “ghost parts” to avoid part overheating) are not keeping up as systems get bigger and faster. Tight integration of part slicing, in-situ metrology, hardware and simulation are going to be needed to continue pushing up system productivity and lowering printed $\/kg while maintaining high quality associated with laser powder bed fusion. Aerospace components 3D printed on a Sapphire system. Image via VELO3D. Dr. Gerald Mitteramskogler, CEO, Incus One of the upcoming challenges for the European industry is to reach energy and climate targets for 2030 with carbon footprint mitigation. 3D printing in general will help to develop the best technological solutions. At Incus, we highly believe that our Lithography-based Metal Manufacturing technology will enable innovation, and there will be an Incus product involved in solving future challenges. Ewan Baldry, Chief Engineer, Czinger Vehicles Scaling the technology is probably the greatest challenge, but one that is being met head-on by Divergent and Czinger. In 2022 alone, we have seen vast improvements in all aspects of the technology from design, printing, postprocessing, and automated assembly – new materials, new machines, new processes, all developed in-house. What seems clear is that making significant progress requires a holistic approach. At Divergent, we have engineers and technologists addressing everything that contributes to the increasing commercial viability of the technology’s application. Engineers and technologists who are laser-focused on all areas, from materials scientists developing the powders we print, surface treatments we use, and adhesives we bond with, to AM engineers contributing to the design and development of the printers we use and the most efficient use of those printers, software\/CAE\/optimization engineers who are accelerating the design process to allow us to exploit the real power of 3D printing and so produce components and assemblies that are optimized in terms of the material and energy that is needed to create them. We lucky people at Czinger have all this technology at our fingertips that we are using to create a hypercar that we believe has so many “world’s firsts,” demonstrating one of our brand pillars, “Revolutionary Technology.” The relationship between Divergent and Czinger (we are all on the same site in Torrance) offers a unique, symbiotic opportunity on many levels. In creating products, Czinger’s demands\/ desires help to drive the technology that Divergent is creating – Czinger engineers push the Divergent team to enable the realization of their ideas. In Czinger, Divergent has an in-house, real-world application to hone and validate their technology and, in turn, offer it to the broader automotive industry – a trickle-down effect. It is the creation of companies like Divergent and Czinger, focused on figuring it all out and not just bits of it that will enable the technology to scale and become the way all things are made in the future. Vadim Fomichev, Sales Director, Thor3D 3D printing offers huge opportunities for manufacturers and our forecast assumes that not only small businesses, but also heavy industry is interested in mastering 3D printers. On a big scale swift mass production is crucial, and printing speed remains a challenge. To overcome the limits of 3D printing speed, the engineers have to solve probably the biggest dilemma of their life. Sometimes the nozzle has to go slow to allow the substance to cool down, so you can add the next layer, yet mass production demands to follow strict deadlines. The second challenge is self-sufficiency. Think of modern assembly lines, where robotic manipulators do the job? A dozen of these robots need only one operator. Will the engineers be able to make 3D printers automatic and reliable enough, so a big production will need only one or two operators to manage them? Carlos Zwikker, Chief Commercial Officer, AM-Flow The greatest engineering challenge of the coming decade will be that of creating Smart AM Factories. In the past, we have focused on the main message that the key driver to growing the AM market is reducing cost per part. And we believe this is still true now and most likely to continue to be a relevant message in the coming years. Although the market keeps growing, scaling AM output is inhibited by manual labor. The cost of manual labor is an inhibitive factor in scaling AM production output. Workflow automation is a prerequisite to reducing cost per part and is the basis of creating Smart AM Factories. And the reduced cost per part brings us to more applications with a viable business case, and these viable business cases are what drive further growth. The engineering challenge for the next decade will be to move from non-communicating verticals – MES platform, printer, post-processing workstations, etc. – to a fully connected end-to-end digital thread throughout an AM production facility. We are just at the beginning of this journey as this journey runs in parallel with the maturity of printing technology and AM manufacturing processes. AM-Flow sees itself as a driving force and the provider of hard- & software workflow automation solutions for the Smart AM Factory of the future, and we proactively seek collaboration with all other companies contributing to the digital chain of events of the Smart AM Factory of tomorrow. We think there will be closer collaboration between all companies addressing the puzzle of automating 3D print factories. For the end customer, building a Smart AM Factory is more than just acquiring more printers, several post-processing units, workflow automation, etc. François Leclerc, Program Manager, Creaform The upcoming decade will undoubtedly be filled with many challenges, one of which appears to be time to market, i.e., the time required to develop and produce new (or newer generation) products. With workforce getting more and more sparce, there will be an increasing pressure on businesses to develop products faster. Any technology helping to speed product development will inevitably help to solve this problem. Of course, 3D scanning being a major asset when it comes to bringing existing objects into digital processes will certainly be a major contributor. Once data has been captured with a 3D scanner, software to process and use the data will also be a critical aspect to consider. Every step of the process will be more and more critical, and no waste of time will be acceptable. Sam O’Leary, CEO, SLM Solutions I’m not sure I can tell you the problem, but I can tell you that whatever it is, we will find a way to solve it through collaboration, innovation, and open architecture. François Leclerc, Program Manager, Creaform The future of 3D printing will be industrial or not, that’s the challenge. This is why at 3DCeram we have made a technological choice, that of the automatable top down. This choice is unquestionable in an industrial context for mass production. We know that in order to produce a lot, you need large build platforms, which are also versatile and on which it is also possible to print big parts! As we know, moving to the industrial stage implies a production rate which requires automation of the process. And this will have to be done with a user-friendly software interface, the different stages of 3D printing will then be controlled in an intelligent way, with AI, launching the run and monitoring the printing, then automated filtration and cleaning systems, to obtain the final part, ready for firing! At Formnext, in November, we presented a semi-automatic line that will enable relevant production rates to be reached with few personnel, for manufacturers who wish to integrate 3D printing into their production workshops. Ma Jin-song, General Manager, UnionTech The major challenge is realizing product performance through production requirements, which means high efficiency, high consistency, and high stability with low cost, in the middle and long run, to realizing distributive manufacturing. Solutions include: 1. Design: Adoption of new design platforms, DfAM, etc. 2. Material breakthrough: 3D printing materials, as the driving force for the development of the 3D printing industry, have always played a pivotal role in the development of the industry. Therefore, 3D printing materials are an important basis for developing 3D printing technology. To a certain extent, the development of materials is one of the main factors which determine whether 3D printing can have a wider application. We expect that in 2023 and the future, the material properties, implementation of gradient materials, and multi-material printing will be further developed. 3. Printing costs will be lowered further lowered to meet the trend for greater volumes in production. 4. Post-processing technology will be further developed: currently the post-processing is complex and costly 5. Digital manufacturing process chain will be further enhanced to incorporate the demand for agile business models shaped by 3D printing. 6. The trend of equipment’s inter-communication, as well as parameter sets, will be required as the process chain gets integrated. Li Tao, Chairman & CEO, Shining 3D The engineering challenge is “accuracy” and “speed.” It is mainly reflected in the challenge of achieving fast, stable, and consistent manufacturing capabilities. How to achieve product quality consistency and improve the standardization of the manufacturing process is also the value that Shining 3D focuses on when positioning each product and solution to the market. In particular, compared with the process of subtractive manufacturing and mold manufacturing, the 3D printing process has more variables in terms of controlling the quality of printed products. How to monitor and trace the quality of the whole process will be a system engineering challenge, which involves the comprehensive application of engineering technologies such as various sensors, 3D measurement of internal structure and appearance, plus the analysis ability provided by software algorithms and AI. The natural beauty of 3D printing lies in manufacturing more complex organic structures. With the increasingly stringent requirements on the quality control of printed parts, this also poses higher challenges to the two-dimensional imager and three-coordinate dimension measurement technology. Therefore, Shining 3D high-precision 3D scanning and inspection solutions are also being used more and more in the full-scale measurement of additively manufactured parts. To meet the fast-lane development of the value chain, it is believed that the systematic integration of various engineering technologies related to quality control is critically important. Gui Pei-yan, CEO, HeyGears The development and application of a digital chain is a significant challenge that must be faced in the development of additive manufacturing because data is the key element throughout intelligent production. To deal with challenges, two issues are closely related. On the one hand, the digital chain requires the effective connection of 3D printing hardware with software to form an integrated and digital solution based on actual application requirements. Therefore, professional technologies such as digital material, artificial intelligence, software, and big data processing are worthy of attention and investment. On the other hand, consideration should be given to the consumer’s mindset. In the medium and long term, the increase in consumer consumption patterns and changes in consumption habits will create a higher level of demand for 3D printing applications. This will enhance the development and growth of high-tech 3D printing commodities and high-quality service providers. The popularization path of technology can be traced, with the landing and promotion of digital applications in more fields, 3D printing will play a bigger role in our life, bringing more convenience and benefits. It is necessary to deal with the challenges through investment in technology research and development, to attract, reserve, and continuously invest in talents. Technological development can bring beautiful changes to people’s lives. The key point is to always start from application requirements, combine industrial capabilities with underlying 3D printing digital technology, and intelligently integrate production processes such as data collection, data management, model design, 3D printing equipment, 3D printing materials, and post-processing. The popularization of lowering the barrier of applied 3D printing technology compared with the research and development efforts aimed at the high-end intelligent manufacturing market will co-exist. With the continuous development of 3D printing products for new applications, I believe that the 3D printing industry will bring more benefits to people in the future. Jin Tian-shi, Managing Director, Voxeljet China The next ten years will be a decade that additive manufacturing technology, and customer needs, will interact and shape each other. The value logic of 3D printing is model-free and high-performance. In this decade, we will see 3D printing and traditional manufacturing get work together with each other. The main challenge for 3D printing for mass production applications is to reduce the overall cost, to improve the stability of the equipment, and to ensure the consistency of the quality of printed products. To solve these problems, we must focus on the continuous comprehensive improvement of equipment, materials, processes, and automation. Taking sand mold printing as an example, we will see the emerge of mass production projects of complex sand cores with an annual output of 10,000 pieces and super large sand molds with a single piece of 10 meters big and a single weight of more than 100 tons. In order to meet the above requirements, technologies such as sand material recycling, robots, automatic detection, automatic logistics, and new post-processing techniques will emerge and be gradually promoted and applied. Roger Uceda, Technology Transfer Director, CIM UPC The biggest challenge for the next 10 years will not be to produce a part using 3D printing that meets the requirements for which it has been designed, but to manufacture thousands or millions of parts, with complete confidence that all of them will meet these requirements. For this reason it is necessary to work on two aspects, the first is standardization, essential to give legal coverage to those products that we manufacture. And the second, more important, is to be sure that the parts we produce actually have the right mechanical, thermal, optical… properties. In the case of 3D printing, knowledge in manufacturing processes and materials will not be enough. The particularities of this technology will require full traceability of the material used, as well as each and every parameter with which it has been manufactured. In CIM UPC we work not only to develop new 3D printing technologies, but in all that involves modeling parts that are being manufactured, with real-time monitoring systems that allow full traceability on the process, being able to guarantee that 100% of the parts that are manufactured are within specifications. James DeMuth, CEO, Seurat Technologies Generating massive amounts of clean energy is going to be one of our greatest challenges for many decades to come. Followed close behind by access to material resources. There are of course many technologies that will take part in solving this, initially focused on intermittent renewables such as solar, wind, and tidal, evolving to steady load generating sources such as geothermal, hydro, and ultimately nuclear fusion. The race is still on to determine which solutions to fusion (and geothermal) will be the most effective, but the world will benefit from competition and a diverse solution set. If history has taught us anything, it is that we often find our greatest discoveries not in what we are seeking, but what we find along the way. The technologies that result from the pursuit of fusion (next-gen lasers, next-gen high power magnetics) will have untold applications that unlock new potentials and capabilities. Our company, Seurat, was born out of the pursuit of fusion, leveraging the lasers for fusion, but applied to material processing to achieve high throughput, high quality, and economical part production competing with conventional manufacturing. Joan Horvath and Rich Cameron, co-founders, Nonscriptum LLC Assuming we are focusing on just engineering challenges in the 3D printing universe, the first few decades of 3D printer development were focused largely on hardware development and experimentation. The last five years or so have mostly been driven by new materials innovation. The next frontier is reliability and ease of use, and we expect software to automate some of the know-how of expert users will be the next big set of improvements. Advances in AI and in machine vision may make key contributions to automated slicing, printing, and part validation in the next decade. David J Webb, 50th Anniversary Professor of Photonics, Aston University Aging workforce is a problem in engineering many Engineers are in 40-60 years age group, with no experience of additive even 30+ have little this means more education is needed to show the benefits of additive as an engineering solution so the promotion of additional courses for people already in the workplace such as CPD will be seen as essential moving forward. Education needs to be on both software and technology advancement and needs to be considered as a mainstream manufacturing technology not hobbyist or for research based This applies also to the medical community where 3D software like “Mimix” is being used to view CT and MRI scans to help in surgery. Additive can help take this further by using techniques for slicing and printing to produce 3D models of patients’ bones, organs and veins, again to help in diagnosis and surgery Ryohei Yuasa, Researcher, Head of material design Digital Manufacturing and Design Research Center for Emergent Circularity, Keio University We will see an acceleration of attempts to link materials, products, and social systems, such as the Digital Product Passport. More and more products will be made with detailed information on materials and design to reduce the burden of recycling and disposal. Companies will be asked whether they are able to disclose information on the grade name level of the materials they use. Aurélien Fussel, 3D Printing Program Manager + Additive Manufacturing Senior Expert Services Operations, Alstom The three main challenges are: training, training and… training. I do my best to support the change of mindset regarding design rules for 3D printing (DfAM) by organising elearning, webinars and classrooms. From a simulation software point of view, Finite Element parameters are more and more mature even if final validation on the test bench is still mandatory for critical 3D-printed parts. The fastest change occurs when people are touching 3Dprinted parts and asking how they can use this technology daily. Taso Arima, CEO and Co-Founder, IperionX The next decade will not only bring significant challenges to the field of engineering but also to supply chain management, This includes resource scarcity and efficiency. With a finite supply of raw materials, recycling and reusing materials is a crucial strategy for meeting the growing demand of consumers. The implementation of circular technologies is an essential solution for preserving natural resources and ensuring sustainable production. Take your smartphone as an example, the average device uses an array of critical minerals including copper, tellurium, lithium, cobalt, manganese, tungsten, and more. As demand for smartphones and other consumer electronics grows, so does the strain on the supply of these critical minerals. The UN reports that only 20% of e-waste is recycled annually, leaving the rest to fill and contaminate our landfills. Implementing circular technologies is necessary to reduce our impact on the environment for both the extraction of mineral resources and their post-consumer lifetimes. Frank Roberts, President, 6K Additive Additive manufacturing included, of course, but also with conventional manufacturing, the appetite for more advanced materials will continue to be a focus for many advanced applications. However, the emphasis on ESG will continue to rise as countries and individual companies add more regulations and emphasis on carbon footprint. The intersection of the two issues is where the challenge will grow. A newly developed material may not meet the ESG requirements, and\/or the production method may cause environmental issues. Does the mere fact that its new or that its sustainable drive the price point too high for volume production? Cost and sustainability will all need to converge to bring new materials with a sustainable element to market. Geo-political events, wars, pandemics, and semiconductor chip shortages have all brought supply chain volatility to the forefront of challenges across the globe. A focus not only for the US but for every country is supply chain independence and the ability to recycle material that already exists in many places, including retired military equipment, end-of-life parts, and subtractive technology machine shops, to name a few. The ability to recover precious metals that exist in these components is one challenge, but also the ability to convert the materials back into a usable product at costs that are actually lower than virgin material will present a second challenge. Leapfrog technologies will be key to helping to process critical materials for new applications we haven’t even seen yet. Ian Falconer, Founder, Fishy Filaments Climate change. Direct capture of carbon emissions will be required to bridge the divide between the global haves and have nots, but its no excuse for the haves to ignore technologies and practices that minimise future carbon emissions. We need to link capture with utilisation as an oil replacement. Direct atmospheric and industrial capture of emissions is a waste management issue every bit as much as it is a technological development issue. In recent years we’ve seen public perception change with regards to using the ocean as a general dump for land based waste. There is an analogy with using the atmosphere as a dump for industrial waste gases but the public does not yet make that same connection, perhaps because we don’t see songbirds wrapped in solid bands of CO2 and we can’t organise community-level CO2 picks that empower individuals. There is no positive end of the physical engagement spectrum for carbon emissions, only geographic or population-level negative impacts, and that limits how the communicating professions can direct attention to the issue. So we need to see a set of tech that enables direct capture and re-use of carbon and methane emissions by businesses and organisations, but without the need to mobilise the general public. That means they have to be cheap or preferably profitable. Storage through materialisation and resale, rather than burial, is a means to replace crude oil and natural gas and that might enable profitable carbon capture without excessive taxpayer subsidy. Franco Cevolini, CEO, CRP Technology From my perspective, the challenges that we shall face are a few. Even if some of them are less immediate or less obvious, they can still lead to great benefits and an effective strategy. The first concerns the switch to an efficient production level where all the stages and issues typical of the mass production process have to be properly addressed: from efficient order execution to packaging and production process optimization. We as a group are investing not only in new technological solutions but in a combination of technological upgrade with personnel skills implementation. Now more than ever, achieving excellence requires an understanding of production impact in terms of parts reliability. This is and has always been a focal issue of additive manufacturing, where a variety of factors have to be carefully categorized, controlled, and thoroughly monitored. Quality system in the Additive Manufacturing process still represents a long path where a complete array of activities have to be focused, coordinated and deployed. Among these Process Automation is acquiring huge importance. The additive technology has evolved, and its possible applications are constantly growing with the adoption of new models. Of course this expansion needs to be guided and requires setting new routines to improve the results already achieved. This is a delicate upgrade as automation is commonly connected to large-scale numbers while here, it has to coexist with low volumes and quite a few variables playing an important role. Stephan Beyer, Co-founder & Chief Venture Officer, nFrontier Quality of parts, costs, availability are key and can be solved with the existing technologies….no need to invent more of them. But two true and remaining challenges remain. Sustainability and digital. Automated design, digital twins, CAM \/ PLM integration are just a few open issues where digital tools still have to be developed. Secondly, AM still has to prove its impact on sustainability, not only green washing. John Olhoft, President, LulzBot Bridging the gap between 3D Design and physical object creation. As it stands right now there are a large number of remarkable innovators and engineers that are either too intimidated by or lack the time to invest in 3D Design. I believe that more intuitive software, coupled with the quick wins available with 3D Printing, will help to make 3D Design less of a hurdle during the next decade. John E. Barnes, Managing Director, and Laura Ely, Director of Programs, The Barnes Global Advisors The greatest engineering challenge is here: Creating the right team. How do we create technical teams with the right skills to solve complex problems of the decade? How do we inform management whose job it is to sustain the business with increasingly complex technical evolutions? The future is the team. The future is knowledge. And the future is technology. But technology without knowledge to absorb, understand and utilize is pointless. The future is a team sport because the future is complex. We need more brains, and we need more openness to tap into the brain potential regardless of sex, race, religion, or anything else. We just need brains that are interested in solving these problems. Steven Camilleri, CTO and Co-Founder, SPEE3D One of the key issues is the development of new technology that solves problems more sustainably than before with better efficiency and less waste and excess. This should be a key goal, especially for the 3D printing industry. For example, 3D printing should not be limited to just creating new parts; it should also be used more and more for repairing, restoring and modifying parts. Solving problems by making parts close to the point of need eliminates the transport energy and emissions that would otherwise be needed to move the parts around. Metal 3D printing, (particularly our cold spray process,) is one of the most efficient ways to do this since it produces parts responsibly, quickly and inexpensively. Technologies need to be developed that allow the simple and convenient manufacture of new parts using material recovered from old parts – this is really only possible at the moment with metal materials. All of the trends point to a continued increase in attention toward 3D printing as a tool for making parts and solving problems more sustainably. Joshua M. Pearce, Ph.D., John M. Thompson Chair in Information Technology and Innovation, Western University The greatest challenge we have is to eliminate our dependence on fossil fuels, their pollution and thus climate destabilization. We can do this with a combination of solar photovoltaics, which already produce the least expensive electricity on the planet and offset coal (coal air pollution already kills 52,000 Americans every year ). Electrification of heating (solar-powered heat pumps are already economic in the northern US and Canada ) and can replace much of our natural gas use. Finally, electrification of transportation can be accomplished with electric vehicles, which are also already economic. Interestingly, in all of these, cases we are manufacturing constrained for photovoltaics, heat pumps and EVs (particularly batteries). We have also witnessed 3D printing reducing manufacturing time, fabricating superior products, and saving costs. There is already some evidence of this in these fields (e.g. 3D printing low-cost solar racking). In the future, I think we can expect to see 3D printed PV, heat exchangers in heat pumps, and electric batteries to help us kick the fossil fuel addiction. Dr. Ingo Ederer, CEO, voxeljet Well, this is a tough question. From my point of view, humans need to get away from fossil and move to renewable energy sources in big scale. Wind and solar energy must be available at low cost and, last but not least, we need suitable storage technologies. Manufacturing technologies play a major role in solving these issues, as they are associated with product costs but also product efficiency. In this respect, 3DP will also play a key role in mastering these tasks. Alan “Pooch” Puccinelli, Founder, Repkord LLC We’re working with antiquated manufacturing paradigms and oftentimes relying on suppliers overseas to produce the parts we need economically. Political factors as well as energy and shipping cost increases are making this less and less attractive as time goes on. Rather than relying on massive manufacturing hubs we need to develop smaller systems of distributed manufacturing that allow us to minimize transportation costs and move more towards on demand fabrication that can pivot readily based on regional demand. The issue in my mind isn’t one of technology but logistics and business savvy. Communities need to be better empowered to produce their own goods both as a means of independence and supporting their local economies. Thomas Batigne, CEO, Lynxter Flexible functional A.M. x10 times faster for the same quality and cost. Data driven manufacturing software, embedded monitoring, and CAD\/CAM, effectors optimisation & smart suggestion for the user should allow this. It requires a massive commitment from all kinds of engineering & PhDs. to achieve it, and a significant time to have it adopted. That’ll keep us busy! Dr. Wilderich Heising, Partner and Associate Director, Boston Consulting Group (BCG) Looking at the high level of quality in the parts that we could witness at Rapid and Formnext in 2022 it makes me very confident, that AM is here to stay. Quality has reached very decent levels that allow us to move from prototyping into manufacturing and end-use parts production. This transition will be a major unlock for the growth in AM in the years to come across many industries. However, mastering the transition from prototyping to manufacturing will also be one of the key challenges to overcome for the 3D printing industry. I believe that we will not see a “one-size-fits-all” technology that caters for the manifold needs of the various current and future applications in 3D printing. That means that we will need to see further advancements on the various technologies out there to be fully fit for purpose for specific applications. But we should not look at a technology alone, we need to consider the interplay between material, technology and software and must optimize this ecosystem as a whole to offer solutions for specific customer needs and not just a tech offering. This will be a key step in advancing the additive manufacturing industry. Angel Llavero, CEO, Meltio From our point of view, we are convinced that in the coming years we will see increasing demand from various industries for installing hybrid 3D printing systems in their local production centers. We are calling that process Hybridizing metal 3D printing solutions for the industrial sector. At Meltio, we saw this need a few years ago, and that is why we patented our wire laser metal 3D printing technology, whose head can be integrated into a CNC machine or a robotic arm. Industries in mining, oil, and gas, defense, automotive, aerospace, and engineering education centers, among others, are no longer looking to install dozens of metal 3D printers to manufacture parts, but are interested in installing hybrid manufacturing systems that include the ability to manufacture 3D metal parts in shorter times and with lower costs and high levels of part reliability on their CNC equipment. This is an industrial revolution in manufacturing thanks to metal 3D printing that Meltio is and will respond to in the future by innovating with new hardware and software solutions. In the factory floor of the future, I am sure that we will see these hybrid systems installed alongside CNC mills, molding setups, drill presses, lathes, and other familiar setups in the traditional and subtractive manufacturing world. The interplay continues with 3D-printed molds and other parts for conventional equipment. This is a new paradigm for metal AM: the factory floor of the future look like for efficient manufacturing and to produce metal printed parts locally. Dr.-Ing. Vincent Morrison, CEO, AIM3D GmbH With the broad usage of AM in series production we will have to solve the situation that the scrap rate of the AM process is still quite high compared to other well-known production processes. Even when you consider the fact that material extrusion and powder bed fusion processes can reach high recycling rates, the recycling of scrap parts will not solve this situation, as machine time and energy are still lost, even if the material could be reused. To overcome this, the challenge for all AM processes is to stabilize their scrap rate well below 2%, even under high throughputs. The main problem – and therefore the problem to solve for the AM world – are the high number of parameters to be monitored while printing, especially if you take the long build time of the parts into account. Typical approaches like in-process part inspection with laser sensors are far too slow and will destroy the economical parameters of the printers. Based on this, we need to change our view on the process control by using high-performance PLCs and new sensor approaches with their respective possibilities. Maybe we will also need to implement complex neural AI process controls into the machines to cope with the high amount of data and process state spaces. Ramsey Stevens, CEO, nano3Dprint In the next ten years, the most significant engineering challenge for 3D-printed electronics will be creating efficient, economical, and scalable methods of fabricating high-performance electronics. Additive manufacturing has the potential to revolutionize the way electronic devices are made; it empowers users to mass produce flexible electronic devices and structures on a wide array of substrates. However, technical challenges need to be overcome for this to happen, like developing new classes of 3D printable inks and materials with higher resolution, higher performance, and stability. To create advanced multi-material electronic devices accurately and rapidly, we must develop new 3D printing techniques that allow for the simultaneous printing of multiple materials and integration of different functionalities. This will require advancements in software and control algorithms to achieve quick, efficient production of high-quality printed electronics. It will also require developing precise, fast, and energy-efficient hardware. To automate the design, optimization, and process control that enables faster prints, we’ll need new machine learning solutions. To ensure that printed parts adhere to the specifications and standards, updated quality assurance methods will also need to be created and enforced. An interdisciplinary approach is necessary to solve these challenges – it will involve working collaboratively with materials science, chemistry, physics, and engineering experts. Bradley Rothenberg, CEO, nTopology The greatest engineering challenge of this decade is reversing climate change. There isn’t just one magic technology that’s required to solve this, rather, it will take a collective effort across industry requiring new processes of design. 3D printing and advanced engineering will help in opening up design space to deliver products that we could only once dream about. For example, some of our customers are working on nuclear fusion, sustainable agriculture and reducing our carbon footprint. One thing I know for sure is that legacy ways of design will not lead to the innovations required to tackle climate change. We now have an entire new generation of engineers trained in an AM-first way of thinking. I am excited about their potential to really help us solve this major human problem. Jarek Pieniazek, New Offer Development Manager, Sinterit The growing political conflicts of economic powers will slow down the trend of global production. Thus, domestic production will increase. The biggest challenges will be the use of limited resources and problems with energy costs and production. There is no single technology, but leveraging more local sources will certainly be critical. It is is a place for 3D printing and low-volume production. The ever-improving accuracy and repeatability of printouts will be a challenge, but the price per print will be a key. René Kreissl, Head of Business Unit Additive Manufacturing, TRUMPF With our focus on industrializing Metal AM technologies, one of the greatest challenges that we will face, is increasing the productivity of our systems while maintaining high part quality. This is extremely important to enlarge the AM use-cases and increasing the suitability of AM for large volume serial production, for example for the automotive industry. Great engineering challenges, will always require great engineered solutions and unlocking technological worlds for generations to come, is what we do at TRUMPF. For our TruPrint PBF systems, we already integrating several new technology approaches that will boost productivity and part quality many folds. One of such innovations is the hybrid manufacturing or ‘Preform’ option that we launched for the TruPrint 5000 at Formnext 2022. We consider it as an important milestone in the industrialization of additive technologies to combine technologies whenever it makes sense. Furthermore, another feature is an automation feature for our smallest machine, the TruPrint 1000, wherein up to four substrate plates can be automatically produced without the need for stopping the PBF process. Stay curious – we will see some massive technological leaps this decade and we are happy to be on the front seat. Read more: Who is leading the 3D Printing Industry? Winners of the 3D Printing Industry Awards. What does the future of 3D printing for the next ten years hold? Did the experts get the trends in 3D printing for last year right? Found this article useful? To stay up to date with the latest 3D printing news, don’t forget to subscribe to the 3D Printing Industry newsletter or follow us on Twitter or liking our page on Facebook. While you’re here, why not subscribe to our Youtube channel? featuring discussion, debriefs, video shorts and webinar replays. Are you looking for a job in the additive manufacturing industry? Visit 3D Printing Jobs for a selection of roles in the industry. Featured image shows engineers throughout history in futuristic scenarios, Leonardo da Vinci in a flying car, Archimedes on Mars, Isambard Kingdom Brunel at a hydrogen farm and Bill Gates communicating via a neural link with a tesselated Elon Musk.","filter_flag":1}
{"title":"NGK Decides construction of a new R&D building ~ Accelerating the development and promoting early ... - Mynewsdesk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9uZ2staW5zdWxhdG9ycy9wcmVzc3JlbGVhc2VzL25nay1kZWNpZGVzLWNvbnN0cnVjdGlvbi1vZi1hLW5ldy1yLWFuZC1kLWJ1aWxkaW5nLWFjY2VsZXJhdGluZy10aGUtZGV2ZWxvcG1lbnQtYW5kLXByb21vdGluZy1lYXJseS1jb21tZXJjaWFsaXphdGlvbi1vZi1wcm9kdWN0cy1yZWxhdGVkLXRvLXRoZS1kaWdpdGFsLXNvY2lldHktMzIyNDM0NNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9uZ2staW5zdWxhdG9ycy9wcmVzc3JlbGVhc2VzL25nay1kZWNpZGVzLWNvbnN0cnVjdGlvbi1vZi1hLW5ldy1yLWFuZC1kLWJ1aWxkaW5nLWFjY2VsZXJhdGluZy10aGUtZGV2ZWxvcG1lbnQtYW5kLXByb21vdGluZy1lYXJseS1jb21tZXJjaWFsaXphdGlvbi1vZi1wcm9kdWN0cy1yZWxhdGVkLXRvLXRoZS1kaWdpdGFsLXNvY2lldHktMzIyNDM0NNIBAA?oc=5","id":"CBMi4AFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9uZ2staW5zdWxhdG9ycy9wcmVzc3JlbGVhc2VzL25nay1kZWNpZGVzLWNvbnN0cnVjdGlvbi1vZi1hLW5ldy1yLWFuZC1kLWJ1aWxkaW5nLWFjY2VsZXJhdGluZy10aGUtZGV2ZWxvcG1lbnQtYW5kLXByb21vdGluZy1lYXJseS1jb21tZXJjaWFsaXphdGlvbi1vZi1wcm9kdWN0cy1yZWxhdGVkLXRvLXRoZS1kaWdpdGFsLXNvY2lldHktMzIyNDM0NNIBAA","guidislink":false,"published":"Tue, 03 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=3, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9uZ2staW5zdWxhdG9ycy9wcmVzc3JlbGVhc2VzL25nay1kZWNpZGVzLWNvbnN0cnVjdGlvbi1vZi1hLW5ldy1yLWFuZC1kLWJ1aWxkaW5nLWFjY2VsZXJhdGluZy10aGUtZGV2ZWxvcG1lbnQtYW5kLXByb21vdGluZy1lYXJseS1jb21tZXJjaWFsaXphdGlvbi1vZi1wcm9kdWN0cy1yZWxhdGVkLXRvLXRoZS1kaWdpdGFsLXNvY2lldHktMzIyNDM0NNIBAA?oc=5\" target=\"_blank\">NGK Decides construction of a new R&amp;D building ~ Accelerating the development and promoting early ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mynewsdesk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NGK Decides construction of a new R&D building ~ Accelerating the development and promoting early ... - Mynewsdesk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi4AFodHRwczovL3d3dy5teW5ld3NkZXNrLmNvbS9uZ2staW5zdWxhdG9ycy9wcmVzc3JlbGVhc2VzL25nay1kZWNpZGVzLWNvbnN0cnVjdGlvbi1vZi1hLW5ldy1yLWFuZC1kLWJ1aWxkaW5nLWFjY2VsZXJhdGluZy10aGUtZGV2ZWxvcG1lbnQtYW5kLXByb21vdGluZy1lYXJseS1jb21tZXJjaWFsaXphdGlvbi1vZi1wcm9kdWN0cy1yZWxhdGVkLXRvLXRoZS1kaWdpdGFsLXNvY2lldHktMzIyNDM0NNIBAA?oc=5\" target=\"_blank\">NGK Decides construction of a new R&amp;D building ~ Accelerating the development and promoting early ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mynewsdesk<\/font>","source.href":"https:\/\/www.mynewsdesk.com","source.title":"Mynewsdesk","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"NGK INSULATORS, LTD. (hereinafter “NGK”) has decided to build a new R&D building at its head office site in order to encourage the development of products related to a digital society (“DS”). By consolidating human resources and facilities for new product and production technology development, we will shorten the lead time from basic research to product launch and achieve early commercialization of new DS-related products. In the NGK Group’s medium- to long-term vision NGK Group Vision: \"Road to 2050,\" contributing to DS has been positioned as a social issue that should be addressed. NGK has also set the goal New Value 1000 (NV1000) under which it aims to create a new business with sales of ¥100 billion by 2030, and to achieve this, it plans to invest ¥300 billion in R&D over a 10-year period from fiscal 2021. This investment will include the construction of the new R&D building and enhancement of facilities and equipment to accelerate the development of DS-related products. NGK aims to achieve ¥50 billion of the NV1000 target from sales of new DS-related products. The new R&D building will be used for development of new DS-related products such as new wafers for applications including wireless communications, optical networks, and in-vehicle sensors for automatic driving, and microheaters for semiconductor mounting equipment. In addition to the introduction of bonding and processing equipment for 8-inch size wafers, which are expected to be in demand going forward, a clean room will be installed for analysis and experimentation of cutting-edge semiconductor processes. This building will also be equipped with a photovoltaic power generation system on the roof for energy-saving. In the future, perovskite solar cells (*) will be installed on the walls, and renewable energy generated by the entire building will be used to reduce CO2 emissions. Going forward, the NGK Group will provide new value for society by leveraging its unique ceramics technologies to develop and commercialize products that contribute to the DS field. *Perovskite Solar Cell: A new type of solar cell that uses a material with a crystal structure called perovskite. They are thin, light weight and flexible, enabling them to be installed and generate power on wall surfaces and other places impossible for solar cells until now. NGK has invested in EneCoat Technologies Co., Ltd. (Kyoto), which is involved in development of perovskite solar cells. NGK Invests in Perovskite Solar Cell Spin-off from Kyoto University (March 28, 2022) Outline of the new R&D building Location : 2-56, Suda-cho, Mizuho, Nagoya 467-8530, Japan (Head Office site) Building area : Approx. 1,800 m2 Total floor area : Approx. 7,200 m2 Purpose : Development of new DS-related products Capital investment : Approx. ¥10.0 billion Start of operations : June 2025 ","filter_flag":1}
{"title":"European Union launches second edition of Circular Economy Competition - GhanaWeb","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5","id":"CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA","guidislink":false,"published":"Thu, 19 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=19, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5\" target=\"_blank\">European Union launches second edition of Circular Economy Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GhanaWeb<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"European Union launches second edition of Circular Economy Competition - GhanaWeb","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigQFodHRwczovL3d3dy5naGFuYXdlYi5jb20vR2hhbmFIb21lUGFnZS9OZXdzQXJjaGl2ZS9FdXJvcGVhbi1Vbmlvbi1sYXVuY2hlcy1zZWNvbmQtZWRpdGlvbi1vZi1DaXJjdWxhci1FY29ub215LUNvbXBldGl0aW9uLTE2OTgyNTfSAQA?oc=5\" target=\"_blank\">European Union launches second edition of Circular Economy Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GhanaWeb<\/font>","source.href":"https:\/\/www.ghanaweb.com","source.title":"GhanaWeb","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Press Releases of Thursday, 19 January 2023 Source: European Union The European Union presents the second edition of the Circular Economy Competition in line with their support to Ghana to meet SDG Goal 12 i.e., “responsible consumption and production”. It is a contest that aims at supporting small businesses and start-ups operating in the circular economy ecosystem in Ghana. The EU is looking to support innovative ideas and projects that aim to promote resource efficiency and thinking in Ghana across relevant sectors and help unlock the potential of re-thinking the production and delivery of sustainable choices to make these accessible, affordable, and available to the masses in Ghana. The circular economy is not only about waste or transforming waste through reuse and upcycling into new products. It also offers the potential for an economic boost through resource efficiency and industrial transformation. It aims to maintain the value of products, materials, and resources for as long as possible by returning them to the product cycle at the end of their use, while minimizing the generation of waste. The fewer products we discard, the fewer materials we extract, and the better for our environment. This process starts at the very beginning of a product’s lifecycle. Smart product design and production processes can help save resources, avoid inefficient waste management and create new business opportunities. The first CEC was held in Accra and aired on GH One TV and The European Union's official YouTube channel, with 20 shortlisted circular economy business contestants participating. They were - Kasi Coal, AY Farms, Mending Banana & Plantain Stem Papers, Ecocent Recycling LTD, Ento Farms, Podash Processing Company, Sustainable Energy, Makola Gh, and Tiger House LTD amongst others. Ento farms emerged winners after a keen contest and won GHC 65000 in seed funding for their business. They used the funds to expand their facility, purchase equipment, and open a second factory in cape coast. The CEC project aims to create greater economic and employment opportunities for Ghanaians by promoting and supporting sustainable and circular businesses. Interested applicants should visit www.EU-CEC.COM to apply. Application is open from now to 4th February 2023. Solutions envisaged should clearly aim at delivering impact, pursue sustainability and be scalable or replicable post-competition- at the local and national level. Only 20 shortlisted contestants will be selected to participate in the 2023 Circular Economy Competition with the hope to win GHC 100,000 in seed money. Selected contestants will get the opportunity to have intense training with Venture Capitalists, Marketing Guru, and Circular Economy Experts. The Circular Economy Competition is presented by the European Union and supported by GhanaWeb. ","filter_flag":1}
{"title":"CES 2023: Jackery LightTent-AIR is a revolution for campers - Basic Tutorials","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmFzaWMtdHV0b3JpYWxzLmNvbS9uZXdzL2Nlcy0yMDIzLWphY2tlcnktbGlnaHR0ZW50LWFpci1pcy1hLXJldm9sdXRpb24tZm9yLWNhbXBlcnMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmFzaWMtdHV0b3JpYWxzLmNvbS9uZXdzL2Nlcy0yMDIzLWphY2tlcnktbGlnaHR0ZW50LWFpci1pcy1hLXJldm9sdXRpb24tZm9yLWNhbXBlcnMv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vYmFzaWMtdHV0b3JpYWxzLmNvbS9uZXdzL2Nlcy0yMDIzLWphY2tlcnktbGlnaHR0ZW50LWFpci1pcy1hLXJldm9sdXRpb24tZm9yLWNhbXBlcnMv0gEA","guidislink":false,"published":"Mon, 09 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=9, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmFzaWMtdHV0b3JpYWxzLmNvbS9uZXdzL2Nlcy0yMDIzLWphY2tlcnktbGlnaHR0ZW50LWFpci1pcy1hLXJldm9sdXRpb24tZm9yLWNhbXBlcnMv0gEA?oc=5\" target=\"_blank\">CES 2023: Jackery LightTent-AIR is a revolution for campers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Basic Tutorials<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CES 2023: Jackery LightTent-AIR is a revolution for campers - Basic Tutorials","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vYmFzaWMtdHV0b3JpYWxzLmNvbS9uZXdzL2Nlcy0yMDIzLWphY2tlcnktbGlnaHR0ZW50LWFpci1pcy1hLXJldm9sdXRpb24tZm9yLWNhbXBlcnMv0gEA?oc=5\" target=\"_blank\">CES 2023: Jackery LightTent-AIR is a revolution for campers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Basic Tutorials<\/font>","source.href":"https:\/\/basic-tutorials.com","source.title":"Basic Tutorials","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"At CES 2023, Jackery not only presented its new energy storage units from the Pro series. The company for modern and sustainable energy solutions also presented something completely new with the Jackery LightTent-AIR. Behind it is a tent that can serve as a power source while camping with the help of solar energy generation. Jackery LightTent-AIR provides electricity while camping The fact that mobile energy storage is becoming increasingly popular can also be seen at this year’s CES in Las Vegas. After all, Jackery, one of the most renowned manufacturers of so-called power stations, is also represented at the technology trade show in the Nevada desert. But not only the new solar generators Pro 1500 and Pro 3000 were presented. With the Jackery LightTent-AIR, the company also had something completely new in tow that could revolutionize camping in the future. It was not without reason that Jackery took home the CES Best of Innovation Award. The tent, which looks a bit like a futuristic space capsule, has integrated solar cells. Together, these are said to absorb a whopping 1,200 watts of power. 6 times the power of Jackery’s largest panel For comparison, the largest panel available from the manufacturer to date is the Jackery SolarSaga 200W Solar Panel (Geizhals\/Amazon). The Jackery LightTent-AIR consequently comes up with six times the power. But where to put the generated energy? According to the manufacturer, the energy can be stored either in the storage modules of the tent itself or in a suitable power station such as the Jackery Explorer 1000 Pro (test). But away from the power harvesting capabilities, the Jackery LightTent-AIR also appears to simply be a good tent. During the presentation, there was talk of it being able to accommodate 4 to 5 people. This should ensure a family vacation including power supply. Especially fans of camping vacations in remote regions without campgrounds or corresponding alternatives with electricity could get their holy grail here. By the way, Jackery installs the solar cells in the side walls, which run diagonally upwards. As a result, they always offer the optimal angle of incidence to be able to collect solar energy in the best possible way. The manufacturer does not yet specify the battery capacity of the tent itself. However, it can be assumed that the purchase of an additional power station might be advisable. This way, you can also bridge the sun-free time during longer excursions. For those who are afraid of sleeping in a tent composed of solar cells and batteries, Jackery reassures them with its safety features. For example, the Jackery LightTent-AIR is said to be made of a fabric with PVC coating, which is not only waterproof, but fireproof to boot. Price and Availability For best conditions, the tent should be shined with full sun. However, this also raises a big question mark. After all, the interior of a tent is known to heat up quite quickly when summer weather is at its best. In the case of the Jackery LightTent-AIR, batteries and solar cells are then added to the mix, which in turn radiate heat as part of the energy generation process, according to experience. The manufacturer itself states that the tent is supposed to have good thermal insulation. Only a practical test will show whether this is really true. When the first people will be able to take a seat in their own Jackery LightTent-AIR, however, is another question mark. After all, we know neither when nor at what price the futuristic tent will be launched. But it is certainly exciting!","filter_flag":1}
