{"title":"Dinesh Nirmal - IBM Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiJmh0dHBzOi8vbmV3c3Jvb20uaWJtLmNvbS9EaW5lc2gtTmlybWFs0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiJmh0dHBzOi8vbmV3c3Jvb20uaWJtLmNvbS9EaW5lc2gtTmlybWFs0gEA?oc=5","id":"CBMiJmh0dHBzOi8vbmV3c3Jvb20uaWJtLmNvbS9EaW5lc2gtTmlybWFs0gEA","guidislink":false,"published":"Tue, 31 Jan 2023 00:00:02 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=31, tm_hour=0, tm_min=0, tm_sec=2, tm_wday=1, tm_yday=31, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiJmh0dHBzOi8vbmV3c3Jvb20uaWJtLmNvbS9EaW5lc2gtTmlybWFs0gEA?oc=5\" target=\"_blank\">Dinesh Nirmal<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">IBM Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dinesh Nirmal - IBM Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiJmh0dHBzOi8vbmV3c3Jvb20uaWJtLmNvbS9EaW5lc2gtTmlybWFs0gEA?oc=5\" target=\"_blank\">Dinesh Nirmal<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">IBM Newsroom<\/font>","source.href":"https:\/\/newsroom.ibm.com","source.title":"IBM Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Senior Vice President, Products, IBM Software Dinesh Nirmal leads products for IBM Software. He is responsible for new products and innovation, the company’s software product and technology direction, location strategy, support and ecosystem development. A recognized industry thought leader, Dinesh is known for applying his deep expertise in AI, intelligent automation, machine learning, digital labor, data and AI governance, and data science to help advise customers on their digital transformation journeys and address their most pressing challenges. Dinesh has spent more than 25 years at IBM. Previously, he was General Manager for Data, AI and Automation at IBM, responsible for driving the business strategy, technology development, operations, sales and marketing, and overall financial performance for IBM’s Data, AI and Automation Software portfolio. Under his leadership, Dinesh also further strengthened IBM’s hybrid cloud and AI capabilities through the acquisition of several market-leading companies, including databand.ai (data observability), Turbonomic (application resource management), Instana (application performance monitoring), WDG Automation (RPA) and myInvenio (process and task mining). Prior to that, he held concurrent roles as Chief Product Officer for Cloud Paks, leading IBM’s hybrid cloud platform strategy, and Vice President of Development for IBM Cloud Integration, where he rebuilt the business to focus on automation. He has held several other leadership roles at IBM, including Vice President of Development for IBM Data and AI. In this role, Dinesh led the transformation to factor AI into every part of the software and hardware portfolio and drove new customer engagements with some of the largest enterprises in the world. An international event speaker and writer, Dinesh has participated in tech industry events and conferences including Bloomberg's Intelligent Automation series, AI Summit, O'Reilly AI Conference, Strata Data Conference, IBM Think, IBM Community Festival and more. He has been interviewed in and authored guest columns for publications including Insider, WSJ CIO Journal, Forbes, Economic Times, TechCrunch, VentureBeat, CIO.com, InformationWeek, ZDNet and more. Dinesh was honored in the 2022 Ascend A-List awards. He also serves on the Board of R Consortium to help guide the open-source R language and is an advisor for Accel.AI.","filter_flag":1}
{"title":"Global Enterprise Software Market Report 2023: Industry to Reach $404 Billion by 2028 at an 11.1% CAGR - Yahoo Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nbG9iYWwtZW50ZXJwcmlzZS1zb2Z0d2FyZS1tYXJrZXQtcmVwb3J0LTA5MjgwMDM3Ny5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nbG9iYWwtZW50ZXJwcmlzZS1zb2Z0d2FyZS1tYXJrZXQtcmVwb3J0LTA5MjgwMDM3Ny5odG1s0gEA?oc=5","id":"CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nbG9iYWwtZW50ZXJwcmlzZS1zb2Z0d2FyZS1tYXJrZXQtcmVwb3J0LTA5MjgwMDM3Ny5odG1s0gEA","guidislink":false,"published":"Thu, 05 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=5, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nbG9iYWwtZW50ZXJwcmlzZS1zb2Z0d2FyZS1tYXJrZXQtcmVwb3J0LTA5MjgwMDM3Ny5odG1s0gEA?oc=5\" target=\"_blank\">Global Enterprise Software Market Report 2023: Industry to Reach $404 Billion by 2028 at an 11.1% CAGR<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Enterprise Software Market Report 2023: Industry to Reach $404 Billion by 2028 at an 11.1% CAGR - Yahoo Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nbG9iYWwtZW50ZXJwcmlzZS1zb2Z0d2FyZS1tYXJrZXQtcmVwb3J0LTA5MjgwMDM3Ny5odG1s0gEA?oc=5\" target=\"_blank\">Global Enterprise Software Market Report 2023: Industry to Reach $404 Billion by 2028 at an 11.1% CAGR<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance<\/font>","source.href":"https:\/\/finance.yahoo.com","source.title":"Yahoo Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Company Logo enterprise-software-market-size.jpg enterprise-software-market-size.jpg Dublin, Jan. 05, 2023 (GLOBE NEWSWIRE) -- The \"Global Enterprise Software Market Size, Share & Industry Trends Analysis Report By Deployment (On-premise and Cloud), By Type, By Enterprise Size (Large Enterprises and Small & Medium Enterprises), By End-use, By Regional Outlook and Forecast, 2022 - 2028\" report has been added to ResearchAndMarkets.com's offering. The Global Enterprise Software Market size is expected to reach $404 billion by 2028, rising at a market growth of 11.1% CAGR during the forecast period. Market Growth Factors Enhancements In Software And Business Processes With the rising use of automation and techniques like lean manufacturing, industries have seen an increase in their efficiency, which can also be seen with business software. Routine tasks are being automized so that employees can concentrate more on other important tasks. Organizations may also eliminate slow or inaccurate tasks from the workflow. Enterprises can now point out problems and their solutions at early stages with the use of process mapping tools to trace assets and workflows throughout the organization. The leading players in the market are competing with diverse innovative offerings to remain competitive in the market. The below illustration shows the percentage of revenue shared by some of the leading companies in the market. The leading players of the market are adopting various strategies in order to cater demand coming from the different industries. The key developmental strategies in the market are Acquisitions. Increasing Use Of Customer Relationship Management Software And Big Data Analytics CRM oversees the management of a company's relationship with its customers more precisely. CRM has features like sales force automation, contact management, and marketing automation which assist businesses in customer satisfaction and sales. More businesses are moving towards big data analytics tools to provide them with solutions as these organizations are starting to deal with huge volumes of data. These solutions help to make better business decisions as they provide market trends and valuable insights into customer behavior. Market Restraining Factors High Implementation And Adoption Cost Of The Software Using enterprise software drains a huge amount of capital, and time and takes skills. Due to the project planning, installation, system configuration, and training the implementation process is usually long which adds up to the high cost of the enterprise software. In addition to that, an organization may also need updated network equipment, new hardware, and security software installations, which also add up the costs. Requirement of employees and maintenance of the system will also increase the expenditure. Type Outlook Based on the Type, the Enterprise Software Market is segmented into Customer relationship management, Business intelligence, Content management, Enterprise resource planning, Human Resource Management, Supply Chain Management, and Others. The supply chain management segment witnessed a significant revenue share in the enterprise software market in 2021. A supply chain creates finished products out of raw materials that are to be delivered to the customers. It consists of a complex system of activities and organizations like manufacturers, raw material suppliers, distributors, customers, and retailers. Deployment Outlook By Deployment, the Enterprise Software Market is classified into Cloud and On-premise. The on-premise segment procured the largest revenue share in the enterprise software market in 2021. It is due to the ability to provide consistent services and enhanced data security without an internet connection. Moreover, on-premise software provides flexible system access to multiple users without affecting the speed of data transmission. Organization gets more control in their hands while using on-premise software while also including data security. Enterprise Size Outlook Based on the Enterprise Size, the Enterprise Software Market is bifurcated into Large Enterprises and Small & Medium Enterprises. The large-enterprise segment garnered the highest revenue share in the enterprise software market in 2021. A business operation like marketing, talent management, sales, inventory management, and production of large enterprises is overseen by enterprise software. To reduce workforce costs and human intervention these enterprises are automizing their various business processes, which boosts the demand for enterprise software with Machine learning (ML) and Artificial intelligence (AI). End-use Outlook On the basis of End-use, the Enterprise Software Market is categorized into BFSI, Government & Education, Healthcare, IT & Telecom, Manufacturing, Retail, Transportation, and Others. The government & education segment recorded a remarkable revenue share in the enterprise software market in 2021. There is growth in the government & education sector due to the need for automizing management to carry out business processes. The demand for these solutions is also increased by the advancement of administrative modules. Regional Outlook Region-wise, the Enterprise Software Market is analyzed across North America, Europe, Asia Pacific, and LAMEA. The North American region procured the highest revenue share in the enterprise software market in 2021. It is due to the rising usage of cloud-based enterprise software solutions due to the low maintenance and high efficiency. End-use companies raised their investments as they opt for digitalizing their businesses. Strategic partnerships between industry players and technology providers increase to raise their revenues from the market. Key Market Players List of Companies Profiled in the Report: IBM Corporation Microsoft Corporation Oracle Corporation Salesforce.com, Inc. SAP SE Broadcom Inc. (CA Technologies, Inc.) Hewlett Packard Enterprise Company Zoho Corporation Pvt. Ltd. Epicor Software Corporation SYSPRO Key Topics Covered: Chapter 1. Market Scope & Methodology Chapter 2. Market Overview Chapter 3. Competition Analysis - Global Chapter 4. Global Enterprise Software Market by Deployment Chapter 5. Global Enterprise Software Market by Type Chapter 6. Global Enterprise Software Market by Enterprise Size Chapter 7. Global Enterprise Software Market by End-use Chapter 8. Global Enterprise Software Market by Region Chapter 9. Company Profiles Companies Mentioned IBM Corporation Microsoft Corporation Oracle Corporation Salesforce.com, Inc. SAP SE Broadcom Inc. (CA Technologies, Inc.) Hewlett Packard Enterprise Company Zoho Corporation Pvt. Ltd. Epicor Software Corporation SYSPRO For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/9lla69 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment CONTACT: CONTACT: ResearchAndMarkets.com Laura Wood,Senior Press Manager press@researchandmarkets.com For E.S.T Office Hours Call 1-917-300-0470 For U.S.\/ CAN Toll Free Call 1-800-526-8630 For GMT Office Hours Call +353-1-416-8900 ","filter_flag":1}
{"title":"Why effective HR tech leadership is key to market value - People Management Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBlb3BsZW1hbmFnZW1lbnQuY28udWsvYXJ0aWNsZS8xODExMTAzL3doeS1lZmZlY3RpdmUtaHItdGVjaC1sZWFkZXJzaGlwLWtleS1tYXJrZXQtdmFsdWXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBlb3BsZW1hbmFnZW1lbnQuY28udWsvYXJ0aWNsZS8xODExMTAzL3doeS1lZmZlY3RpdmUtaHItdGVjaC1sZWFkZXJzaGlwLWtleS1tYXJrZXQtdmFsdWXSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnBlb3BsZW1hbmFnZW1lbnQuY28udWsvYXJ0aWNsZS8xODExMTAzL3doeS1lZmZlY3RpdmUtaHItdGVjaC1sZWFkZXJzaGlwLWtleS1tYXJrZXQtdmFsdWXSAQA","guidislink":false,"published":"Tue, 24 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=24, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBlb3BsZW1hbmFnZW1lbnQuY28udWsvYXJ0aWNsZS8xODExMTAzL3doeS1lZmZlY3RpdmUtaHItdGVjaC1sZWFkZXJzaGlwLWtleS1tYXJrZXQtdmFsdWXSAQA?oc=5\" target=\"_blank\">Why effective HR tech leadership is key to market value<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">People Management Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why effective HR tech leadership is key to market value - People Management Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnBlb3BsZW1hbmFnZW1lbnQuY28udWsvYXJ0aWNsZS8xODExMTAzL3doeS1lZmZlY3RpdmUtaHItdGVjaC1sZWFkZXJzaGlwLWtleS1tYXJrZXQtdmFsdWXSAQA?oc=5\" target=\"_blank\">Why effective HR tech leadership is key to market value<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">People Management Magazine<\/font>","source.href":"https:\/\/www.peoplemanagement.co.uk","source.title":"People Management Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"In the digital economy, leaders must effectively develop HR tech to increase their companies' market value. Effective leadership in HR tech can help businesses to achieve sustained change and eventually a higher degree of effectiveness. In the absence of this effective leadership, businesses lose the required direction to achieve a high degree of competitiveness and market value, and cannot implement a successful change to adapt to today’s digital economy. Strong HR tech leadership is one of the most important issues that organisations are facing today. Today's economy is more digital than ever, and organisations are taking on a new meaning. HR tech helps many organisations solve their issues of cyber security and operational risk management. But does effective HR tech leadership cause the prices of products and services to increase? This may be true at first, but the digital divide is here to stay, and investing in digital products and services will replace analog systems of the past. Therefore, the first shift in the organisation’s leadership to augment HR tech is to move towards reducing costs and increasing profits through effective leadership. Our interviews with 81 HR managers in a wide range of industries from eight countries (Australia, China, South Korea, the United States and four European countries) tell us there is a significant relationship between market value and effective HR tech leadership. Many leadership development sessions are built around new systems and better and more improved ways of conducting business. As organisations develop strong leadership in HR tech, eventually, their market value will grow. Organisations that focus only on profitability without considering the importance of HR tech achieve a lower market value compared to their competitors. Let the data speak Our findings indicate that there are several logical reasons behind the relationship between market value and strong HR tech leadership. Consistent with previous studies, this research has also shown that the first reason is that, when businesses have effective leadership in HR tech, they achieve a level of complexity that will mean the competition is unable to imitate them. This acts as an important strategic flank for organisations to achieve a high level of competitive advantage. Second, effective HR tech leadership acts as a suggested attempt to reduce costs which, if announced, offers a temporary bounce up in the stock price. Companies that effectively lead HR tech with extensive investment have a higher potential to reduce costs compared to other organisations. For example, our research shows that many successful organisations in East Asia, especially in countries such as South Korea and China, develop HR tech leadership as an important weapon in competition with American, Australian and European businesses. They drastically reduce costs and increase the profit and market value of their organisations. Also, Korean and Chinese companies have brought the leadership of HR tech to a level of optimal performance that can minimise the time between the product development life cycle and the management of the relationships with customers and the supply chain of goods and services. This eventually adds to the flow of cash more quickly in their organisations. How to better lead HR tech Our findings suggest that leaders design and implement an integrated information technology system that allows the organisation’s departments and employees to communicate with each other all over the world. At the same time, this integrated and extensive system, which has led to the growth of complexity and competitive advantage of the company, has also reduced the chances of competitors imitating them. In addition, this organisational design provides an important role in the growth of innovation by sharing ideas and communication. A successful example of this integrated IT system can be seen in Alibaba, which, compared to many of its international competitors, such as Amazon, has reached an amazing level of cost reduction and innovative growth. The second suggestion, based on research, is to use new project management techniques and design an organisational culture that is suitable for the HR tech of organisations: ‘level three leadership’. Jim Clawson coined the phrase, which focuses on vision, purpose, values, stories, music and symbols. The training and development of human resources should also become an inseparable part of the strategic leadership of organisations. Working together in strategic human resource management can bridge the digital divide. In fact, this proposal is to maximise the role of HR tech in the supply chain and communication with customers so that costs can be reduced as much as possible. The next suggestion is to train active leaders in the IT sector with management and business methods so that the maximum possible result can be achieved in this combination of IT with the supply chain and communication with customers. We recommend Clawson’s book, Level Three Leadership for leaders. Leaders are more important than ever today and they must be aware of the importance of HR tech in their companies' market value and the vital role of solutions that can facilitate effective leadership in HR tech. In this article, we have shown that to manage new challenges and achieve a higher level of market value compared to competitors, leaders should start implementing solutions that facilitate the effective leadership of HR tech. This is a secret weapon of market value in today's digital economy. Mostafa Sayyadi is senior management consultant at The Change Leader Consulting, and Michael Provitera is associate professor of organisational behaviour at Barry University and author of Mastering Self-Motivation","filter_flag":1}
{"title":"Vapes – a burning issue - Circular Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmNpcmN1bGFyb25saW5lLmNvLnVrL2luc2lnaHQvdmFwZXMtYS1idXJuaW5nLWlzc3VlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmNpcmN1bGFyb25saW5lLmNvLnVrL2luc2lnaHQvdmFwZXMtYS1idXJuaW5nLWlzc3VlL9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmNpcmN1bGFyb25saW5lLmNvLnVrL2luc2lnaHQvdmFwZXMtYS1idXJuaW5nLWlzc3VlL9IBAA","guidislink":false,"published":"Tue, 03 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=3, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmNpcmN1bGFyb25saW5lLmNvLnVrL2luc2lnaHQvdmFwZXMtYS1idXJuaW5nLWlzc3VlL9IBAA?oc=5\" target=\"_blank\">Vapes – a burning issue<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Circular Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vapes – a burning issue - Circular Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmNpcmN1bGFyb25saW5lLmNvLnVrL2luc2lnaHQvdmFwZXMtYS1idXJuaW5nLWlzc3VlL9IBAA?oc=5\" target=\"_blank\">Vapes – a burning issue<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Circular Online<\/font>","source.href":"https:\/\/www.circularonline.co.uk","source.title":"Circular Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Britain’s latest addiction, e-cigarettes, is creating a mountain of hard-to-recycle waste that often ends up in landfill. James Richards examines the scale of the problem. E-cigarettes, or ‘vapes’, are more popular than ever. Research by public health charity Action on Smoking and Health (ASH) published this year found that 4.3 million people in Great Britain are now vapers. And while vaping has been heralded as a ‘healthier’ alternative to cigarettes, the habit is causing all sorts of problems for waste managers and the environment. Although they come in many shapes and sizes, most vapes have the same basic functionality: a battery-powered metal coil that heats up the ‘e-liquid’ (usually containing nicotine) into an aerosol, which is inhaled by the user. They generally fall into two categories – reusable or disposable. Reusable vapes can be recharged by the user, the battery replaced and the vaping liquid refilled. Disposable vapes are designed to be used and discarded. A headache for waste managers For Ray Parmenter, head of policy and technical at CIWM, the complex nature of the products is causing a major headache for the sector. ‘Vapes come in many forms, and their sheer diversity makes it very difficult to deal with as a waste stream,’ he says. ‘Each unit is typically composed of plastics, metals, a lithium battery, and some have LED lights, sensors and even microprocessors. The fact they lock up so many valuable resources into a hard-to-recycle unit makes them an anathema to waste managers.’ Some vapes can be dismantled, allowing the user to dispose of the different elements into the correct waste streams. In general, any electrical component would have to be consigned to e-waste recycling. Some vapes can be dismantled, allowing the user to dispose of the different elements into the correct waste streams. In general, any electrical component would have to be consigned to e-waste recycling. However, the vape ‘chamber’ is often a mixture of glass and plastic, which presents even diligent users with a dilemma. And, unless all the pieces are cleaned, there is a risk of introducing liquid nicotine into the environment. However, according to consultant and CIWM trustee Duncan Simpson, even if the vape unit is disposed of correctly as e-waste, the problems don’t end there. ‘Due to the complex combination of materials – and the possibility of left-over nicotine in the unit – they have to be dismantled by hand in order to dispose of the elements appropriately, which is labour intensive and expensive,’ he said. Resources up in smoke The bottom line is that consumers find it hard to recycle vapes. This has resulted in huge quantities of e-cigarettes being binned every year. Indeed, recent research by Material Focus has found that, of the almost half a billion vapes (reusable and disposable) bought annually in the UK, a third are thrown away, which amounts to three million per week. The cost in resource terms is staggering: Material Focus estimates that the volume of all vapes sent to landfill or incineration each year contains around 23 tonnes of lithium, the equivalent to 2,884 electric vehicle batteries. ‘Beyond the enormous squandering of resources, vapes disposed of in residual waste streams pose a fire risk,’ says Simpson. ‘If units that contain batteries end up inside bins or recycling vehicles, and are crushed, they may be punctured and self-combust, igniting the dry waste around them.’ Single-use vapes The problem is particularly acute around disposable vapes. Typically, these cheap, single-use units last for around 1-5 days (although some promise longer lifespans). Many of these come pre-charged and are ready to use right out of the box. This level of convenience means they are extremely popular: Material Focus suggests that 14 million single-use vapes are bought each week. For Parmenter, disposable vapes are the perfect example of how not to design a product. ‘Who thought this was a good idea? It’s a classic example of designers paying no heed whatsoever to the end of life of the product,’ he said. The issue is compounded by the fact that, according to research by industry body the UK Vaping Industry Association (UKVIA), up to 60 per cent of disposable vapes being sold in the UK are actually illicit – either non-compliant with domestic laws or counterfeit. Speaking to conveniencestore.co.uk in August, UKVIA director general John Dunne admitted this was a ‘huge concern’, and revealed his organisation ‘receives between 200 and 400 reports of illegal sellers in the UK every month’. The littering issue Unfortunately, many of these unregulated units are being sold illegally to young people. Research by ASH has found that almost half of 18-24-year-olds are using disposable vapes. Although some disposable vapes are capable of being dismantled and recycled, the all-in-one design seems to be driving increased instances of littering. ‘Anecdotally, it’s easy to see that disposable vapes are creating a littering problem,’ says Parmenter. ‘One finds them scattered around outside schools, discarded by children who presumably don’t have the inclination or awareness to at least put them in the bin. And a glance at the average pavement or car park will confirm this is becoming a more widespread problem.’ Legislation and control One potential solution would be to operate a type of deposit-return system, says Simpson, reimbursing people financially if they return the vapes to the place where they bought them. Simpson points out that vapes are covered by existing waste regulations. Indeed, these units are classed as waste electrical and electronic equipment (WEEE) under UK law, meaning that producers or importers of WEEE products have a responsibility under the regulations to make sure they are recycled, and to place themselves on a register. Sellers of electrical items – such as vapes – are also obliged under the regulations to offer a take-back service for customers on the purchase of equivalent items. Either that, or they join the Distributor Takeback Scheme (DTS), under which they will pay a fee that supports the local authority’s recycling efforts, and provide information to customers about recycling points. However, in the absence of a collection scheme for vapes, those retailers offering a take-back service would be faced with the same disposal dilemma as individuals. One potential solution would be to operate a type of deposit-return system, reimbursing people financially if they return the vapes to the place where they bought them. One recent investigation by Sky News found that neither the manufacturer or importer of two of the leading vape brands were listed on the WEEE register. Simpson suggests that the existing regulations would ideally be tweaked to take account of these relatively new products. He also acknowledges the need to ‘drive illicit players’ from the shelves, but notes a desire among legitimate producers to create a properly regulated market. ‘Some consumers and producers want to do the right thing’, he says. ‘To enable this, we need to corral the right people together – the regulators, producers and waste professionals – and come up with a clear system with which to present to consumers.’ For Parmenter, the existing battery take-back scheme could be a template for an e-cigarette recycling service. ‘The model is certainly there,’ he says. ‘And once we have sufficient volume, there’s a greater likelihood that waste companies will innovate and create a process – most likely using robotics – that can safely and efficiently dismantle and recycle vapes on an industrial scale.’","filter_flag":1}
{"title":"Siemens expands its digitalization portfolio for the Indian mach ... - Siemens press release","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcHJlc3Muc2llbWVucy5jb20vaW4vZW4vcHJlc3NyZWxlYXNlL3NpZW1lbnMtZXhwYW5kcy1pdHMtZGlnaXRhbGl6YXRpb24tcG9ydGZvbGlvLWluZGlhbi1tYWNoaW5lLXRvb2wtaW5kdXN0cnktZW5oYW5jZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcHJlc3Muc2llbWVucy5jb20vaW4vZW4vcHJlc3NyZWxlYXNlL3NpZW1lbnMtZXhwYW5kcy1pdHMtZGlnaXRhbGl6YXRpb24tcG9ydGZvbGlvLWluZGlhbi1tYWNoaW5lLXRvb2wtaW5kdXN0cnktZW5oYW5jZdIBAA?oc=5","id":"CBMifmh0dHBzOi8vcHJlc3Muc2llbWVucy5jb20vaW4vZW4vcHJlc3NyZWxlYXNlL3NpZW1lbnMtZXhwYW5kcy1pdHMtZGlnaXRhbGl6YXRpb24tcG9ydGZvbGlvLWluZGlhbi1tYWNoaW5lLXRvb2wtaW5kdXN0cnktZW5oYW5jZdIBAA","guidislink":false,"published":"Thu, 19 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=19, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcHJlc3Muc2llbWVucy5jb20vaW4vZW4vcHJlc3NyZWxlYXNlL3NpZW1lbnMtZXhwYW5kcy1pdHMtZGlnaXRhbGl6YXRpb24tcG9ydGZvbGlvLWluZGlhbi1tYWNoaW5lLXRvb2wtaW5kdXN0cnktZW5oYW5jZdIBAA?oc=5\" target=\"_blank\">Siemens expands its digitalization portfolio for the Indian mach ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Siemens press release<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Siemens expands its digitalization portfolio for the Indian mach ... - Siemens press release","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcHJlc3Muc2llbWVucy5jb20vaW4vZW4vcHJlc3NyZWxlYXNlL3NpZW1lbnMtZXhwYW5kcy1pdHMtZGlnaXRhbGl6YXRpb24tcG9ydGZvbGlvLWluZGlhbi1tYWNoaW5lLXRvb2wtaW5kdXN0cnktZW5oYW5jZdIBAA?oc=5\" target=\"_blank\">Siemens expands its digitalization portfolio for the Indian mach ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Siemens press release<\/font>","source.href":"https:\/\/press.siemens.com","source.title":"Siemens press release","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Achim Peltz, CEO of Motion Control, Digital Industries, Siemens AG, said, “The machine tool industry in India can harness the enormous potential of production data for designing, realizing and optimizing operations to achieve scale and profitability. Our portfolio for the Machine Tool Industry enables flexible and sustainable action both in the construction of machines and in their application.” SINUMERIK One – the digital native CNC With SINUMERIK One, Siemens offers the technology to easily create and work with digital twins of machine tools. With its integrated SIMATIC S7-1500F PLC, it offers up to 10 times faster PLC cycle times. This helps SINUMERIK One to be fully integrated into the TIA Portal engineering framework, enabling standardization of all engineering tasks for machine builders and users. Integrated functions like virtual commissioning and realistic process simulation opens up new possibilities for machine manufacturers & users alike. This significantly reduces the product development phase, time-to-market & even production cycle times. Today over 70% of Indian OEMs have already adopted SINUMERIK One to accelerate their digital transformation journey. Industrializing Additive Manufacturing Siemens is the only service provider of integrated software and automation solutions under one roof for industrial use of Additive Manufacturing (AM). This enables the creation, manufacturing and use of additive applications, including high-volume production which covers the entire end-to-end value chain, from industrial AM users as well as AM machine builders. Siemens Xcelerator for digital transformation Siemens announced the availability of solutions tailor-made for the Machine Tool Industry in India as part of the Siemens Xcelerator, the open digital business platform. These solutions meet the requirements of companies in areas such as machine building, fabricated metals, aerospace, vehicle manufacturing, electronics, power, energy manufacturing and medical equipment. Siemens Xcelerator for machine tools, includes selected portfolio of IoT-enabled hardware, software, as well as a marketplace. The Siemens Xcelerator marketplace has applications using Industrial Edge technology like Protect MyMachine, Analyze MyWorkpiece and others which enable unparalleled safety and workpiece quality. Various MindSphere applications like Manage MyMachines and Analyze MyPerformance\/OEE are also available on the marketplace that provide intelligent resource management across the shopfloor. The market place has additional solutions that help in optimizing the process workflows in shopfloor, manage tools efficiently and increase productivity. Some of these applications offer broader connectivity even for CNC machines that are not equipped with SINUMERIK. This means that nothing stands in the way of a shop floor-wide connection of machines. With these offerings, machine builders and users can ensure they can build a machine or component faster, better and more efficiently while enhancing productivity. Siemens is showcasing these offerings at IMTEX 2023 from 19th to 25th January 2023 under the motto “Accelerate digitalization for machine tool manufacturing”.","filter_flag":1}
{"title":"Top 10 Use Cases of Digital Twin in the Year 2023 - Analytics Insight","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz0gFpaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz0gFpaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz0gFpaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz","guidislink":false,"published":"Sat, 07 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=7, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz0gFpaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz?oc=5\" target=\"_blank\">Top 10 Use Cases of Digital Twin in the Year 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Analytics Insight<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Use Cases of Digital Twin in the Year 2023 - Analytics Insight","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz0gFpaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2RhdGEtc2NpZW5jZS90b3AtMTAtdXNlLWNhc2VzLW9mLWRpZ2l0YWwtdHdpbi1pbi10aGUteWVhci0yMDIz?oc=5\" target=\"_blank\">Top 10 Use Cases of Digital Twin in the Year 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Analytics Insight<\/font>","source.href":"https:\/\/www.analyticsinsight.net","source.title":"Analytics Insight","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Due to its astounding results, digital twin technology has attracted more traction. Technology is introduced at a time when businesses are changing how they operate, communicate with their customers, and create new products and services. So, over the past year, the demand for digital twin has grown. Tools for creating digital twins are becoming more powerful, effective, and user-friendly. Additionally, they are utilizing USD and glTF, two prominent formats, to link various procedures and tools collectively. A range of use cases of Digital Twin is changing how work is carried out in several industries, people are seeking use cases of Digital Twin in 2023. The Digital Twin in 2023 will be a big thing as it going to accurately predict the present phase and future phases of physical parts through their counterparts. Here are the","filter_flag":1}
{"title":"EGA unveils aluminium recycling initiative amid sustainability push - The National","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy50aGVuYXRpb25hbG5ld3MuY29tL2NsaW1hdGUvcm9hZC10by1uZXQtemVyby8yMDIzLzAxLzE1L2VnYS11bnZlaWxzLWFsdW1pbml1bS1yZWN5Y2xpbmctaW5pdGlhdGl2ZS1hbWlkLXN1c3RhaW5hYmlsaXR5LXB1c2gv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy50aGVuYXRpb25hbG5ld3MuY29tL2NsaW1hdGUvcm9hZC10by1uZXQtemVyby8yMDIzLzAxLzE1L2VnYS11bnZlaWxzLWFsdW1pbml1bS1yZWN5Y2xpbmctaW5pdGlhdGl2ZS1hbWlkLXN1c3RhaW5hYmlsaXR5LXB1c2gv0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy50aGVuYXRpb25hbG5ld3MuY29tL2NsaW1hdGUvcm9hZC10by1uZXQtemVyby8yMDIzLzAxLzE1L2VnYS11bnZlaWxzLWFsdW1pbml1bS1yZWN5Y2xpbmctaW5pdGlhdGl2ZS1hbWlkLXN1c3RhaW5hYmlsaXR5LXB1c2gv0gEA","guidislink":false,"published":"Sun, 15 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=15, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy50aGVuYXRpb25hbG5ld3MuY29tL2NsaW1hdGUvcm9hZC10by1uZXQtemVyby8yMDIzLzAxLzE1L2VnYS11bnZlaWxzLWFsdW1pbml1bS1yZWN5Y2xpbmctaW5pdGlhdGl2ZS1hbWlkLXN1c3RhaW5hYmlsaXR5LXB1c2gv0gEA?oc=5\" target=\"_blank\">EGA unveils aluminium recycling initiative amid sustainability push<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The National<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EGA unveils aluminium recycling initiative amid sustainability push - The National","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy50aGVuYXRpb25hbG5ld3MuY29tL2NsaW1hdGUvcm9hZC10by1uZXQtemVyby8yMDIzLzAxLzE1L2VnYS11bnZlaWxzLWFsdW1pbml1bS1yZWN5Y2xpbmctaW5pdGlhdGl2ZS1hbWlkLXN1c3RhaW5hYmlsaXR5LXB1c2gv0gEA?oc=5\" target=\"_blank\">EGA unveils aluminium recycling initiative amid sustainability push<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The National<\/font>","source.href":"https:\/\/www.thenationalnews.com","source.title":"The National","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Emirates Global Aluminium, the UAE’s largest industrial company outside the oil and gas sector, has teamed up with beverage producers, can makers and waste management companies to launch an aluminium recycling initiative in the UAE amid the country's push for a greener economy. The Aluminium Recycling Coalition aims to drive a “step-change” in recycling the metal in the UAE and to promote aluminium recycling by consumers, particularly beverage cans, EGA said in a statement. The coalition includes EGA, Abu Dhabi Waste Management Company (Tadweer), Aujan Coca-Cola Beverages Company, Coca-Cola Al Ahlia Beverages Company, BeeahTandeef, Pepsi-bottler Dubai Refreshment, Canpack, Crown Bevcan, Dulsco Group and France-based resource management group Veolia. “Aluminium demand is expected to grow worldwide by between 50 per cent and 80 per cent by 2050, because of the key role of this infinitely recyclable material in achieving net zero,” said Mariam Almheiri, UAE Minister of Climate Change and Environment. “Co-operation throughout the value chain, such as the Aluminium Recycling Coalition, will speed the decarbonisation of our economy in line with the Net Zero by 2050 strategic initiative.” A March 2022 study by the International Aluminium Institute (IAI), a body representing the global primary aluminium industry, showed that more than 70 per cent of the material used in aluminium cans is recycled into new products — almost double that of glass (34 per cent) and plastic (40 per cent). It also found that aluminium cans best support a circular economy, and that compared with aluminium cans, more glass and plastic bottles end up in landfills because they are not collected. The UAE's Aluminium Recycling Coalition will \"enhance the UAE’s position as a global leader in international efforts towards green development, support our 2031 goals on the circular economy and contribute to building a knowledge-based economy that is more resilient and competitive\", Abdullah bin Touq, UAE Minister of Economy, said. Recycling plastic bottles to earn free Abu Dhabi bus rides - in pictures Workers collect plastic bottles for recycling. Nilanjana Gupta \/ The National Last year, EGA announced plans to build an aluminium recycling plant with a capacity of 150,000 tonnes per year as it looks to decarbonise its operations. EGA was also the first Middle East-based company to join the Aluminium Stewardship Initiative, a global body that sets sustainability standards for the industry. “Recyclability is one reason aluminium is so important for human progress, but every day as a society we throw too much of this valuable metal away,\" Abdulnasser bin Kalban, chief executive of EGA, said. \"By championing the Aluminium Recycling Coalition, EGA aims to increase aluminium recycling rates in the UAE to the benefit of our society and economy.\" The UAE is aiming to achieve net zero by 2050 with new investments worth Dh600 billion ($163.5 billion) planned in clean and renewable energy sources over the next three decades. EGA, one of the world's largest aluminium producers, has smelters in Abu Dhabi and Dubai. The company is developing its own technology to decarbonise operations and reduce emissions. Its aluminium is shipped to more than 50 countries. EGA generates about Dh20 billion in economic activity yearly and supports more than 60,000 jobs in the UAE. The aluminium sector accounts for 1.4 per cent of the UAE economy.","filter_flag":1}
