{"title":"New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit - Grist","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5","id":"CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5\" target=\"_blank\">New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grist<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit - Grist","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vZ3Jpc3Qub3JnL2FjY291bnRhYmlsaXR5L25ldy15b3JrLWNhbGxzLXBlcHNpY29zLXBsYXN0aWMtcG9sbHV0aW9uLWEtcHVibGljLW51aXNhbmNlLWluLWZpcnN0LW9mLWl0cy1raW5kLWxhd3N1aXQv0gEA?oc=5\" target=\"_blank\">New York calls PepsiCo's plastic pollution a 'public nuisance' in first-of-its-kind lawsuit<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Grist<\/font>","source.href":"https:\/\/grist.org","source.title":"Grist","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Plastic trash produced by the company PepsiCo has become a “persistent and dangerous form of plastic pollution” for residents of the Buffalo River watershed in upstate New York, according to a new lawsuit filed Wednesday. The suit, brought by New York Attorney General Letitia James, is one of the first legal challenges from a state against a major plastic producer. It draws on a 2022 investigation from James’ office in which PepsiCo-branded plastic packaging was found to be by far the most significant contributor to plastic waste clogging the Buffalo River and its tributaries. Out of nearly 2,000 pieces of plastic trash collected at 13 sites along the waterways, PepsiCo products — which include brands like Aquafina, Cheetos, Gatorade, and Lay’s — accounted for more than 17 percent of those with identifiable branding. All that plastic litter is breaking down into tiny fragments — microplastics — that are winding up in Buffalo’s water supply and the fish that people eat. Some of the chemicals contained in microplastics are carcinogenic, and researchers have raised concerns that the particles could cause reproductive dysfunction and other maladies. “PepsiCo’s irresponsible packaging and marketing endanger Buffalo’s water supply, environment, and public health,” James said in a statement. To support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How The New York lawsuit includes a “public nuisance” claim and requests that the state’s Supreme Court require PepsiCo to reduce the amount of plastic packaging entering the Buffalo River and remediate pollution that has already occurred. It also invokes consumer protection law: Although PepsiCo has “long been aware” of the environmental and human health risks posed by single-use plastic products, the AG’s office says PepsiCo has obscured these risks in communications to the public — in part by promoting plastics recycling and the promise of a so-called “circular economy,” in which plastic products can be endlessly reprocessed rather than eventually turned into waste. New York Attorney General Letitia James Spencer Platt \/ Getty Images One PepsiCo communication cited in the lawsuit says the company’s plastic recycling strategy will “keep the material in the circular economy.” Most plastics — including all of PepsiCo’s snack food wrappers — cannot be recycled, and even the company’s plastic soda bottles can only be turned into a new bottles a few times before they have to be junked. Nationally, only 5 percent of plastics are ever turned into new products. Meanwhile, PepsiCo has repeatedly missed or failed to make progress toward its own targets for plastic reduction and the use of recycled content. Most recently, the company reported an 11 percent increase in virgin plastic use between 2020 and 2022, despite a commitment to reduce virgin plastic by 20 percent by 2030. Between 2018 and 2022, it also reported a decrease in the fraction of its plastic packaging that was reusable, recyclable, or compostable. To support our nonprofit environmental journalism, please consider disabling your ad-blocker to allow ads on Grist. Here's How In response to Grist’s request for comment, PepsiCo said it is “serious about plastic reduction and effective recycling.” ”This is a complex issue and requires involvement from a variety of stakeholders, including businesses, municipalities, waste-reduction providers, community leaders, and consumers,” a spokesperson said via email. According to a national waste audit coordinated by the nonprofit Break Free From Plastic Pollution, PepsiCo has been among the top three companies creating the most pieces of plastic litter every year since 2018. Only the Coca-Cola Company has consistently produced more plastic litter. Environmental nonprofits have repeatedly sued PepsiCo and other companies over their use of plastic and claims about recyclability, but these suits have been less common at the state level. Last year, Connecticut’s attorney general filed a truth-in-advertising lawsuit against Reynolds Consumer Products, arguing that the company labeled its Hefty trash bags as recyclable “despite full knowledge that their bags were incompatible with recycling facilities in Connecticut.” Minnesota’s attorney general filed a similar lawsuit earlier this year, targeting both the Hefty manufacturer and Walmart. Volunteers pick up trash along the Buffalo River in upstate New York. Courtesy of Buffalo Niagara Waterkeeper Those suits, however, did not invoke public nuisance law — something that makes the PepsiCo case “new and very exciting,” according to Bethany Davis Noll, executive director of the State Energy and Environment Impact Center at the NYU School of Law. She could think of only one other ongoing public nuisance lawsuit related to plastic pollution, filed in 2020 by the nonprofit Earth Island Institute against companies including PepsiCo and Coca-Cola. Public nuisance has played a more prominent role in recent lawsuits filed by attorneys general against manufacturers of PFAS, or “forever chemicals,” which have tainted drinking water supplies worldwide. The New York lawsuit seeks to require PepsiCo to attach a warning label to any single-use plastic products sold in the Buffalo region, conveying plastics’ risks to public health and the environment. It also seeks civil penalties, restitution, and disgorgement of any profits it made through sales in the Buffalo region that were found to have been illegal under New York state’s consumer protection laws. Rachel Karasik, a senior policy associate at the Duke University Nicholas Institute for Energy, Environment, and Sustainability, said a successful case could spur PepsiCo to invest in reuse systems throughout the Buffalo area. In the absence of a New York state-wide extended producer responsibility law for plastic packaging — a policy that makes plastic producers financially responsible for the waste they produce — Karasik also said litigation could yield financing for plastic cleanup and collection activities. Noll hoped the New York attorney general’s case would inspire more legal challenges elsewhere. Plastic pollution is “prevalent all around the country,” she told Grist. “We’ve got to figure out a way to get companies to stop lying about how this stuff is recyclable.”","filter_flag":1}
{"title":"Dow funds seven new new business and sustainability projects to drive social impact - Dow Corporate","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5","id":"CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5\" target=\"_blank\">Dow funds seven new new business and sustainability projects to drive social impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dow Corporate<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dow funds seven new new business and sustainability projects to drive social impact - Dow Corporate","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vY29ycG9yYXRlLmRvdy5jb20vZW4tdXMvbmV3cy9wcmVzcy1yZWxlYXNlcy8yMDIzLWRvdy1idXNpbmVzcy1pbXBhY3QtZnVuZC1zZXZlbi1uZXctcHJvamVjdHMuaHRtbNIBAA?oc=5\" target=\"_blank\">Dow funds seven new new business and sustainability projects to drive social impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dow Corporate<\/font>","source.href":"https:\/\/corporate.dow.com","source.title":"Dow Corporate","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Selected projects are part of the company’s Business Impact Fund program Since 2016, the Impact Fund has supported 58 projects in 22 countries MIDLAND, Mich. – November 9, 2023 – Today, Dow (NYSE: DOW) announced its 2023 Business Impact Fund selections: seven projects that will help drive social impact and advance sustainability through collaboration. The annual fund brings together NGOs, nonprofit organizations and Dow customers to help solve global issues using Dow technology and employees’ expertise. \"Our Impact Fund is about helping to solve some of the world’s most pressing challenges while using our products for good and unlocking innovative business opportunities with our customers,” said Bob Plishka, global director of Strategic Corporate Partnerships and Dow Company Foundation president. “This year’s projects focus on addressing circularity and waste transformation initiatives while seeking to support society’s most vulnerable populations.” People help collect materials through Delterra's Rethinking Recycling program. Dow is collaborating with Delterra through Dow’s 2023 Business Impact Fund to support the program in Argentina. 2023 Business Impact Fund projects Argentina: Driving Change for Waste Traceability and Recycling Rates – Dow and Delterra are collaborating to improve the impact and transparency of waste management and recycling systems. Through an innovative material traceability tool using blockchain technology, recycled plastic can now be tracked from collection to new products and packaging. Tracking plastic allows companies to know exactly where their recycled materials are coming from. Dow also supports Delterra's Rethinking Recycling program in Bahía Blanca, intending to triple recycling rates by 2025. The project will help improve behaviors surrounding waste separation, recycling, and collection of materials. The project will increase recycling center capacity, help find material buyers and create jobs for cooperative waste workers. – Dow and Delterra are collaborating to improve the impact and transparency of waste management and recycling systems. Through an innovative material traceability tool using blockchain technology, recycled plastic can now be tracked from collection to new products and packaging. Tracking plastic allows companies to know exactly where their recycled materials are coming from. Dow also supports Delterra's Rethinking Recycling program in Bahía Blanca, intending to triple recycling rates by 2025. The project will help improve behaviors surrounding waste separation, recycling, and collection of materials. The project will increase recycling center capacity, help find material buyers and create jobs for cooperative waste workers. Brazil: Project REUSE (Fridge Recycling Expansion) – The next phase of Project REUSE, which focuses on enabling a circular economy for polyurethanes, will expand to the Southeast and Northeast regions of Brazil, combining efforts with an important value chain partner. The project’s initial phase successfully focused on recycling mattresses and sofas in one city in Brazil. The second phase explored refrigerator recycling in multiple cities in Brazil. Now, the expanded program will focus on a larger area in Brazil, providing recycling services to more consumers and helping the industry to achieve the 2024 Brazilian Extended Producer Responsibility goal to recollect and recycle 12% of total production. The project will continue to reduce improperly disposed waste, better manage refrigerant gases and help increase the amount of polyurethane recovered from equipment. – The next phase of Project REUSE, which focuses on enabling a circular economy for polyurethanes, will expand to the Southeast and Northeast regions of Brazil, combining efforts with an important value chain partner. The project’s initial phase successfully focused on recycling mattresses and sofas in one city in Brazil. The second phase explored refrigerator recycling in multiple cities in Brazil. Now, the expanded program will focus on a larger area in Brazil, providing recycling services to more consumers and helping the industry to achieve the 2024 Brazilian Extended Producer Responsibility goal to recollect and recycle of total production. The project will continue to reduce improperly disposed waste, better manage refrigerant gases and help increase the amount of polyurethane recovered from equipment. Mexico: Project Eztli – Eztli (an Indigenous word related to blood, life and vitality) is a shared value project focused on advancing inclusion by fostering awareness about menstrual hygiene needs, connecting Dow’s silicone innovation in menstrual cups, educational campaigns, and health information initiatives. In collaboration with for-profit and nonprofit organizations such as MEXFAM and United Way Mexico, the project will donate 80,000 menstrual cups to people in need in Mexico City, the State of Mexico and Queretaro City. The project also creates a strategic business opportunity for consumer rubber in the Mexican market. – Eztli (an Indigenous word related to blood, life and vitality) is a shared value project focused on advancing inclusion by fostering awareness about menstrual hygiene needs, connecting Dow’s silicone innovation in menstrual cups, educational campaigns, and health information initiatives. In collaboration with for-profit and nonprofit organizations such as MEXFAM and United Way Mexico, the project will donate menstrual cups to people in need in Mexico City, the State of Mexico and Queretaro City. The project also creates a strategic business opportunity for consumer rubber in the Mexican market. South Africa: Soap for Hope – Through a collaboration with Diversey – A Solenis Company, a leader in cleaning and hygiene solutions for industrial and institutional markets, and the Pebbles Project, a local NGO with decades of experience in education and health work services, this project aims to give a second life to soap bar waste from local hotels to the benefit of underserved communities in South Africa. Soap For Hope will engage, train and empower unemployed young adults and women to establish a collection network and recycling facility for used soap bars. In addition, a distribution network for the upcycled soap bars will be set up to promote sustainable sanitation and create a positive impact on local communities. – Through a collaboration with Diversey – A Solenis Company, a leader in cleaning and hygiene solutions for industrial and institutional markets, and the Pebbles Project, a local NGO with decades of experience in education and health work services, this project aims to give a second life to soap bar waste from local hotels to the benefit of underserved communities in South Africa. Soap For Hope will engage, train and empower unemployed young adults and women to establish a collection network and recycling facility for used soap bars. In addition, a distribution network for the upcycled soap bars will be set up to promote sustainable sanitation and create a positive impact on local communities. Thailand: Small Scale Pyrolysis Unit – Dow will partner with the Plastics Institute of Thailand to support a small enterprise that developed low-temperature heat induction-based pyrolysis technology to convert low-value used flexible plastic packaging into pyrolysis oil and further process into circular feedstock for the Dow-affiliated cracker in Map Ta Phut, Thailand. Reintroducing post-consumer flexible plastic film into the value chain is an opportunity to increase circularity in Thailand's community waste management system. – Dow will partner with the Plastics Institute of Thailand to support a small enterprise that developed low-temperature heat induction-based pyrolysis technology to convert low-value used flexible plastic packaging into pyrolysis oil and further process into circular feedstock for the Dow-affiliated cracker in Map Ta Phut, Thailand. Reintroducing post-consumer flexible plastic film into the value chain is an opportunity to increase circularity in Thailand's community waste management system. Ukraine: Recyclable Grain Bags – This project aims to support small and medium-sized farms and local industry by introducing a recyclable grain bag (sleeve) storage technology. With this technology, farmers impacted by the destruction of agricultural equipment have an opportunity to store their harvest in an easy and accessible way and preserve it until the point of usage or export, which helps prevent food waste. Dow is working with the Ukrainian Agrarian Council NGO and local business partners to simultaneously integrate a recycling concept for the bags to help close the loop and reduce plastic waste. United States: Taking Care of our Home – This project assesses the current recycling landscape and identifies strategies to improve recycling rates in key U.S. Gulf Coast communities where Dow operates. By uniting with our NGO partner, The Recycling Partnership, our goal is to boost residential and commercial recycling rates in these communities, which contain most of Dow’s manufacturing footprint in North America. Since launching in 2016, the Impact Fund has supported 58 projects in 22 countries totaling nearly $12 million in investments. To date, the Fund’s projects have achieved the following outcomes: >2,000 jobs created jobs created >13,400 MT materials recycled materials recycled >9,500 MT of plastic diverted from a landfill or environment of plastic diverted from a landfill or environment 46,000 acres of land protected Dow employees worldwide nominate potential projects, and a diverse committee representing business and functional leadership across the Company selects the winners. Projects must meet the following criteria: Have the potential to address critical social issues or advance sustainability initiatives Be scalable in their design and impact Engage Dow customers and value chain partners And create new business opportunities for Dow About Dow Dow (NYSE: DOW) combines global breadth; asset integration and scale; focused innovation and materials science expertise; leading business positions; and environmental, social and governance leadership to achieve profitable growth and help deliver a sustainable future. The Company's ambition is to become the most innovative, customer centric, inclusive and sustainable materials science company in the world. Dow's portfolio of plastics, industrial intermediates, coatings and silicones businesses delivers a broad range of differentiated, science-based products and solutions for its customers in high-growth market segments, such as packaging, infrastructure, mobility and consumer applications. Dow operates manufacturing sites in 31 countries and employs approximately 37,800 people. Dow delivered sales of approximately $57 billion in 2022. References to Dow or the Company mean Dow Inc. and its subsidiaries. For more information, please visit www.dow.com or follow @DowNewsroom on Twitter. ### For further information, please contact: Jess MacDonald 780-998-8426 jmacdonald1@dow.com Mary Fournier 989-636-7475 mkfournier@dow.com","filter_flag":1}
{"title":"What should be done with the millions of used tyres? - Polytechnique Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvbHl0ZWNobmlxdWUtaW5zaWdodHMuY29tL2VuL2NvbHVtbnMvZW5lcmd5L3doYXQtc2hvdWxkLWJlLWRvbmUtd2l0aC10aGUtbWlsbGlvbnMtb2YtdXNlZC10eXJlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvbHl0ZWNobmlxdWUtaW5zaWdodHMuY29tL2VuL2NvbHVtbnMvZW5lcmd5L3doYXQtc2hvdWxkLWJlLWRvbmUtd2l0aC10aGUtbWlsbGlvbnMtb2YtdXNlZC10eXJlcy_SAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LnBvbHl0ZWNobmlxdWUtaW5zaWdodHMuY29tL2VuL2NvbHVtbnMvZW5lcmd5L3doYXQtc2hvdWxkLWJlLWRvbmUtd2l0aC10aGUtbWlsbGlvbnMtb2YtdXNlZC10eXJlcy_SAQA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvbHl0ZWNobmlxdWUtaW5zaWdodHMuY29tL2VuL2NvbHVtbnMvZW5lcmd5L3doYXQtc2hvdWxkLWJlLWRvbmUtd2l0aC10aGUtbWlsbGlvbnMtb2YtdXNlZC10eXJlcy_SAQA?oc=5\" target=\"_blank\">What should be done with the millions of used tyres?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Polytechnique Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What should be done with the millions of used tyres? - Polytechnique Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvbHl0ZWNobmlxdWUtaW5zaWdodHMuY29tL2VuL2NvbHVtbnMvZW5lcmd5L3doYXQtc2hvdWxkLWJlLWRvbmUtd2l0aC10aGUtbWlsbGlvbnMtb2YtdXNlZC10eXJlcy_SAQA?oc=5\" target=\"_blank\">What should be done with the millions of used tyres?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Polytechnique Insights<\/font>","source.href":"https:\/\/www.polytechnique-insights.com","source.title":"Polytechnique Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In 2021, 53.8 mil­lion tyres – across all cat­e­gories – were placed on the mar­ket1. That’s more than 567,000 tonnes of a mix­ture of rub­ber, car­bon, sil­i­ca, steel, tex­tiles, and chem­i­cals. And yet tyres have a lifes­pan of just a few years… Do you know what hap­pens to our used tyres? In the same year, over 532,000 tonnes of tyres were col­lect­ed, giv­ing a nation­al col­lec­tion rate of 111.5%2! Since 2003, organ­i­sa­tions that place tyres on the French mar­ket – man­u­fac­tur­ers, dis­trib­u­tors, etc. – have been oblig­ed to take respon­si­bil­i­ty for tyres at the end of their life cycle, based on the prin­ci­ple of extend­ed pro­duc­er respon­si­bil­i­ty (EPR). In Europe, despite there being no spe­cif­ic leg­is­la­tion gov­ern­ing the sec­tor, two direc­tives apply. As a result, many Euro­pean coun­tries are imple­ment­ing EPR or oth­er schemes to ensure the col­lec­tion of used tyres. In a study of 51 coun­tries around the world3, it is esti­mat­ed that more than 17 mil­lion tonnes of end-of-life tyres are col­lect­ed each year, leav­ing 8 mil­lion tonnes uncol­lect­ed. Chi­na, the Unit­ed States, Europe, Cana­da, India and South Korea are among the biggest and\/or best collectors. We need to recov­er used tyres in one way or another Copié ! Once they have been col­lect­ed, they can be recy­cled in a vari­ety of ways. In France in 2021, 15% of used tyres will be reused. Most of the used tyres col­lect­ed (46.8%) are recov­ered for ener­gy pur­pos­es, almost exclu­sive­ly in cement works. In this case, instead of using fos­sil fuels, tyres are used as an alter­na­tive fuel to pro­duce the ener­gy need­ed for cement kilns. The final way of recov­er­ing used tyres is through recy­cling. By 2021, 35.8% of used tyres will be recy­cled. Reduced to aggre­gate, melt­ed down in cement works or steel­works, or shred­ded: a whole range of new lives open up for tyres recov­ered as mate­ri­als. “Most of the tyres we recy­cle are trans­formed into mould­ed objects – such as speed bumps – sport pitch­es, drainage mate­r­i­al or are used in steel­works to replace some of the anthracite”, explains Jean-Philippe Fau­re from Ali­a­pur. In 2010, the organ­i­sa­tion assessed the envi­ron­men­tal impact of sub­sti­tut­ing end-of-life tyres for prod­ucts from dif­fer­ent sec­tors4. The ben­e­fits are clear for Astro­turf, mould­ed objects and cement works, but min­i­mal for reten­tion basins. A num­ber of envi­ron­men­tal indi­ca­tors exist. For exam­ple, sub­sti­tu­tion for Astro­turf avoids the emis­sion of 3 tonnes of CO 2 equiv­a­lent for each tonne of used tyres recov­ered. The process also uses 15 m3 less water. Mate­r­i­al recov­ery from used tyres is the pre­ferred method of recov­ery under the Envi­ron­ment Code5, after re-use. How­ev­er, most end-of-life tyres are recov­ered in the form of ener­gy. “This sit­u­a­tion is spe­cif­ic to France; we don’t see the same trends in oth­er Euro­pean coun­tries,” explains Jean-Philippe Fau­re. “But it’s a one-off sit­u­a­tion and linked to recent Euro­pean reg­u­la­tions – aimed at ban­ning the incor­po­ra­tion of microplas­tics and the use of rub­ber gran­u­lates in syn­thet­ic sports pitch­es.” Anoth­er obsta­cle to recy­cling is the pos­si­ble out­lets. “We need to recov­er used tyres in one way or anoth­er, and the ener­gy recov­ery require­ments of cement works mean that they can absorb large vol­umes. We need to cre­ate ways of recov­er­ing mate­ri­als that require large vol­umes, and there­fore with suf­fi­cient added val­ue.” says Ludovic Moulin. Tougher reg­u­la­tions could, how­ev­er, push the indus­try to increase the pro­por­tion of end-of-life tyres recy­cled. “In 2020, the anti-waste law imposed a new tight­en­ing-up on the sec­tor: com­pa­nies must be accred­it­ed,” explains Thomas Grandin. This require­ment will be laid down in a decree and an order6 in 2023, set­ting out the spec­i­fi­ca­tions for the sector’s eco-organ­i­sa­tions. These impose recy­cling tar­gets on the tyres col­lect­ed: from 40% in 2024 to 42% in 2028 of the quan­ti­ties of waste col­lect­ed. “We have also not­ed that social accep­tance is a bar­ri­er, but there is no tech­ni­cal bar­ri­er to recy­cling,” asserts Jean-Philippe Faure. Aiming for zero waste thanks to pyrolysis Tyres are made up of over 200 dif­fer­ent mate­ri­als. But ful­ly devel­oped sep­a­ra­tion process­es do exist. The aim is to iso­late the dif­fer­ent com­po­nents to offer prod­ucts with a high added val­ue. “For some years now, the trend has been towards the devel­op­ment of pyrol­y­sis,” points out Ludovic Moulin. By heat­ing the tyre to a very high tem­per­a­ture and in the absence of oxy­gen, it is pos­si­ble to recov­er a num­ber of prod­ucts: car­bon black, pyrol­y­sis oil, steel-met­al rein­force­ments, gas, tex­tiles, etc. Although still mar­gin­al in many coun­tries, this process is the main way of recov­er­ing end-of-life tyres in Chi­na, Thai­land, Indone­sia and Mex­i­co, “because of insuf­fi­cient or non-exis­tent envi­ron­men­tal con­straints,” explains Ludovic Moulin. “Between the health cri­sis and fears about raw mate­r­i­al sup­plies, the cir­cu­lar econ­o­my is gain­ing momen­tum and the mar­ket is now open­ing up to these new prod­ucts,” com­ments Thomas Grandin. In Europe, Miche­lin has announced the cre­ation of the first pyrol­y­sis site with Swedish start-up Envi­ro, which is set to han­dle 1 mil­lion tonnes of used tyres by 2030. “Oth­er projects are under­way in Ger­many (Pyrum Inno­va­tions), Spain (L4T and Green­val Tech­nolo­gies) and the UK (Bold­er Indus­tries),” adds Jean-Philippe Fau­re. “This approach is set to take off in the next few years.” Fund­ed by the Euro­pean Union and coor­di­nat­ed by Miche­lin, the Black Cycle project7 aims to demon­strate the via­bil­i­ty of the cir­cu­lar econ­o­my for pyrol­y­sis. The con­sor­tium aims to opti­mise the pyrol­y­sis process. The aim? Zero waste. Both the car­bon black and the pyrol­y­sis oil – trans­formed into car­bon black – recov­ered will be entire­ly reused to man­u­fac­ture new tyres. Oth­er projects aim to explore new ways of recov­er­ing used tyres. “Pub­lic works are the most promis­ing sec­tor for the future,” says Jean-Philippe Fau­re. “For exam­ple, there is a need for new types of back­fill, capa­ble of absorb­ing shock and being light and flex­i­ble.” Recy­cled tyres could even be incor­po­rat­ed into pave­ments using a mix­ture of recy­cled con­crete and rub­ber aggre­gates8. In France, the joint lab­o­ra­to­ry for advanced mate­ri­als recy­cled by vapother­mol­y­sis (Mar­vapol) is also work­ing on the cre­ation of new prod­ucts to make the most of used tyres. “Vapother­mol­y­sis is a ther­mo­chem­i­cal sep­a­ra­tion process, on the bor­der­line between pyrol­y­sis and solvol­y­sis [editor’s note: a dis­so­lu­tion process using a sol­vent],” explains Ludovic Moulin. “We use super­heat­ed steam at ambi­ent pres­sure to sep­a­rate the rein­forc­ing fillers from the rub­ber.” What is the advan­tage of vapother­mol­y­sis? This sep­a­ra­tion process pro­duces recy­cled car­bon black with dif­fer­ent prop­er­ties that are of inter­est to man­u­fac­tur­ers. “The out­put oil is also recov­ered as a mate­r­i­al, a prod­uct that is now of inter­est to the chem­i­cal indus­try,” com­ments Ludovic Moulin. A pletho­ra of pos­si­bil­i­ties are open­ing up for tyre recy­cling in the future. Anaïs Marechal","filter_flag":1}
{"title":"Defra considering provision to offset closed-loop systems in packaging regs - Resource.co","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9kZWZyYS1jb25zaWRlcmluZy1wcm92aXNpb24tb2Zmc2V0LWNsb3NlZC1sb29wLXJlY3ljbGluZy1zeXN0ZW1zLXBhY2thZ2luZy1yZWdz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9kZWZyYS1jb25zaWRlcmluZy1wcm92aXNpb24tb2Zmc2V0LWNsb3NlZC1sb29wLXJlY3ljbGluZy1zeXN0ZW1zLXBhY2thZ2luZy1yZWdz0gEA?oc=5","id":"CBMia2h0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9kZWZyYS1jb25zaWRlcmluZy1wcm92aXNpb24tb2Zmc2V0LWNsb3NlZC1sb29wLXJlY3ljbGluZy1zeXN0ZW1zLXBhY2thZ2luZy1yZWdz0gEA","guidislink":false,"published":"Fri, 10 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=314, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9kZWZyYS1jb25zaWRlcmluZy1wcm92aXNpb24tb2Zmc2V0LWNsb3NlZC1sb29wLXJlY3ljbGluZy1zeXN0ZW1zLXBhY2thZ2luZy1yZWdz0gEA?oc=5\" target=\"_blank\">Defra considering provision to offset closed-loop systems in packaging regs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource.co<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Defra considering provision to offset closed-loop systems in packaging regs - Resource.co","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9kZWZyYS1jb25zaWRlcmluZy1wcm92aXNpb24tb2Zmc2V0LWNsb3NlZC1sb29wLXJlY3ljbGluZy1zeXN0ZW1zLXBhY2thZ2luZy1yZWdz0gEA?oc=5\" target=\"_blank\">Defra considering provision to offset closed-loop systems in packaging regs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource.co<\/font>","source.href":"https:\/\/resource.co","source.title":"Resource.co","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Following its consultation on the draft Producer Responsibility Obligations (Packaging and Packaging Waste) Regulations , Defra is requesting additional information as it considers implementing a provision to support closed-loop recycling systems. This comes after feedback, received during consultation on the legislation, to allow producers managing packaging in a closed-loop system to exclude this material from their household disposal fees obligations. In response, the Government has said it will consider a ‘narrow expansion’ to the offsetting provisions, to assist producers who have established processes to recover and recycle material within their own business operations, where this is aligned with the environmental objectives of extended producer responsibility (EPR). This proposal will potentially amend provision in the draft regulations that enables producers to offset some of their household disposal fees obligations. As it currently stands, this will be permitted in specific circumstances, such as when the material is not collected at kerbside by more than 75 per cent of local authorities or when the packaging items are intended for reuse or refilling. Defra is calling on businesses – while welcoming other relevant stakeholders – to complete a survey to assist it on how it may be able to accommodate closed-loop recycling within the EPR framework. It is also hosting a stakeholder workshop on 20 November to discuss the process in greater detail. What is closed-loop recycling? A closed-loop recycling system refers to one in which producers collect their own waste – in this instance packaging – before using recyclate to manufacture another product within the same product category. A significant advantage of closed-loop recycling is that it allows a continuous flow of resources – new products are manufactured with recycled content, and used, before being recycled into new products again – reducing the strain on natural resources and driving the transition towards the circular economy. There have been concerns that the incoming EPR regulations will disincentive investments into closed-loop recycling systems. Under the regulations, companies have voiced fears that despite investing in a closed-loop system, they will be taxed as if their products are entering the waste system.","filter_flag":1}
{"title":"Industry welcomes Environment Ministers' packaging plan - PKN Packaging News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnBhY2thZ2luZ25ld3MuY29tLmF1L2xhdGVzdC9pbmR1c3RyeS13ZWxjb21lcy1lbnZpcm9ubWVudC1taW5pc3RlcnMtcGFja2FnaW5nLXBsYW7SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnBhY2thZ2luZ25ld3MuY29tLmF1L2xhdGVzdC9pbmR1c3RyeS13ZWxjb21lcy1lbnZpcm9ubWVudC1taW5pc3RlcnMtcGFja2FnaW5nLXBsYW7SAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LnBhY2thZ2luZ25ld3MuY29tLmF1L2xhdGVzdC9pbmR1c3RyeS13ZWxjb21lcy1lbnZpcm9ubWVudC1taW5pc3RlcnMtcGFja2FnaW5nLXBsYW7SAQA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnBhY2thZ2luZ25ld3MuY29tLmF1L2xhdGVzdC9pbmR1c3RyeS13ZWxjb21lcy1lbnZpcm9ubWVudC1taW5pc3RlcnMtcGFja2FnaW5nLXBsYW7SAQA?oc=5\" target=\"_blank\">Industry welcomes Environment Ministers' packaging plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PKN Packaging News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Industry welcomes Environment Ministers' packaging plan - PKN Packaging News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LnBhY2thZ2luZ25ld3MuY29tLmF1L2xhdGVzdC9pbmR1c3RyeS13ZWxjb21lcy1lbnZpcm9ubWVudC1taW5pc3RlcnMtcGFja2FnaW5nLXBsYW7SAQA?oc=5\" target=\"_blank\">Industry welcomes Environment Ministers' packaging plan<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PKN Packaging News<\/font>","source.href":"https:\/\/www.packagingnews.com.au","source.title":"PKN Packaging News","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Peak industry bodies and packaging manufacturers have welcomed the Australian Environment Ministers’ recently announced plans to implement a collaborative, national approach to packaging regulation, along with a focus on design standards and traceability. The country’s Environment Ministers met in Adelaide and agreed to develop ambitious national targets to protect nature, critical next steps to transition Australia to a circular economy, and practical on-ground actions to boost conservation. The Ministers agreed that Federal Government will step up as the new regulator of packaging standards, and will mandate how packaging is designed, will set minimum recycled content requirements, and prohibit harmful chemicals being used. “Australia’s new Federal national packaging laws will provide regulatory certainty and consistency, and make businesses take responsibility for the 6.7 million tonnes of packaging they place on the Australian market,” the Ministers’ stated in their communique. “Strengthened regulation will drive investment, minimise waste and support circular economy outcomes, industries and jobs. “Better packaging design makes it easier to reduce waste and to reuse, recycle or compost packaging waste. Creating demand for recycled content will also increase recycling rates.” The Australian Packaging Covenant Organisation (APCO) was first to respond to PKN following the announcement last Friday. Chris Foley, APCO CEO, said: “This announcement by Environment Ministers is exactly what APCO and our members have been seeking: a strong regulatory framework that will underpin the transition to a circular economy for packaging in Australia. Two measures specified by Ministers – mandatory design standards and recycled content requirements – will effectively bookend the system and drive increased collection and recycling. APCO’s members identified these measures as key in during the national consultation roadshow APCO conducted in August this year.” Foley told PKN that APCO’s attention – and that of policy makers – will now turn to the all-important detail that will give effect to the Ministers’ announcement and create the business confidence and investment certainty needed. Important questions to consider, he said, will include: How prescriptive will the design standards be and how quickly will they seek to drive change? What data is needed and how will it be collected? What role will extended producer responsibility (EPR) schemes play? “Building on the consultation we have conducted with our members over the past 12 months, APCO will undertake another major round of consultation with members in the first half of 2024. In the meantime, we will maintain regular communication with policy makers and keep our members informed of progress,” Foley said. The Australian Food and Grocery Council (AFGC) said that the announcement is fundamental for a closed loop on packaging, particularly soft plastics in Australia, and says for a true circular economy to occur, all sections of the supply chain need to collaborate and move forward together.” “Any increase in the use of recycled content relies on sufficient collection and processing of that material here in Australia. Mandatory design standards are essential for a circular economy, but importantly require a recycling system to process the material Australians collect at home,” a Council spokesperson said. “Traceability of recycling material will provide confidence for Australians to recycle, brands the confidence to procure recycled content, and the broader supply chain the confidence to invest in recycling infrastructure, creating local jobs. “A circular economy for soft plastics is a huge opportunity for Australia economically and environmentally. We look forward to being part of the solution and continuing to collaborate with the entire supply chain to reduce landfill, create jobs and to close the loop on soft plastics.” Rigid plastic packaging manufacturer Pact Group has welcomed the regulatory reforms for packaging, with CEO and managing director, Sanjay Dayal, saying that implementing strict design standards and mandating minimum recycled content quotas for all packaging will “turbo-charge” Australia’s circular economy, particularly for plastics. “Plastic packaging that is designed effectively, that is recyclable and recycled properly can stay in the circular economy almost indefinitely,” Dayal said. “The transition to more sustainable packaging has progressed slowly in Australia to date because we have been relying on voluntary targets and the goodwill of industry leaders. These regulatory reforms will bring about a step change in the packaging industry and help divert huge volumes of plastic waste from landfill, improve our environment, and create more jobs in Australia’s circular economy. \"Better collection and sorting of waste, along with improved labelling requirements for packaging would help increase the quantity and quality of available recyclable material. “As an integrated plastic recycling and packaging manufacturer, Pact stands ready to embrace the reforms and help our customers transition to more sustainable packaging options.” The decision to move from voluntary to mandating national packaging targets have also been welcomed by the Boomerang Alliance, who said it awaits the next stage in a full-scale collection and reprocessing scheme and less plastic in the environment. “This is the first step in a revolution in how Australia handles packaging waste and pollution,’’ said Jeff Angel, director of Boomerang Alliance. “There also needs to be a focus on reducing the amount of plastic, growing reuse, and industry funding of the circular economy engine. It’s their responsibility and I’m sure consumers want far less environmental damage from packaging and plastic pollution. ‘’Voluntary approaches by the sector over the last two decades have failed and the Boomerang Alliance has submitted a best practice scheme that will make a real difference.’’ Ministers have endorsed a national traceability framework, which they said will be key to driving the reuse of recovered plastics, glass and other materials into new products. Ministers also agreed on a framework that will accelerate product stewardship by better coordinating work across governments, including WA leading on tyres and NSW leading on solvents. According to the Ministers, product stewardship schemes will play a key role in holding producers accountable for managing their waste and driving circularity. However, they said that these schemes are not open-ended, and where industry does not respond sufficiently, government will regulate.","filter_flag":1}
{"title":"Malakoff Geared To Support Malaysia's Environmental Goals - BusinessToday","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuY29tLm15LzIwMjMvMTEvMjcvbWFsYWtvZmYtZ2VhcmVkLXRvLXN1cHBvcnQtbWFsYXlzaWFzLWVudmlyb25tZW50YWwtZ29hbHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuY29tLm15LzIwMjMvMTEvMjcvbWFsYWtvZmYtZ2VhcmVkLXRvLXN1cHBvcnQtbWFsYXlzaWFzLWVudmlyb25tZW50YWwtZ29hbHMv0gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuY29tLm15LzIwMjMvMTEvMjcvbWFsYWtvZmYtZ2VhcmVkLXRvLXN1cHBvcnQtbWFsYXlzaWFzLWVudmlyb25tZW50YWwtZ29hbHMv0gEA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuY29tLm15LzIwMjMvMTEvMjcvbWFsYWtvZmYtZ2VhcmVkLXRvLXN1cHBvcnQtbWFsYXlzaWFzLWVudmlyb25tZW50YWwtZ29hbHMv0gEA?oc=5\" target=\"_blank\">Malakoff Geared To Support Malaysia's Environmental Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessToday<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Malakoff Geared To Support Malaysia's Environmental Goals - BusinessToday","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuY29tLm15LzIwMjMvMTEvMjcvbWFsYWtvZmYtZ2VhcmVkLXRvLXN1cHBvcnQtbWFsYXlzaWFzLWVudmlyb25tZW50YWwtZ29hbHMv0gEA?oc=5\" target=\"_blank\">Malakoff Geared To Support Malaysia's Environmental Goals<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessToday<\/font>","source.href":"https:\/\/www.businesstoday.com.my","source.title":"BusinessToday","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The ever-present threat of climate change coupled with the rise in greenhouse gases have presented global challenges that require immediate actions by governments and all stakeholders. Malaysia has reportedly announced the aspiration to achieve a net-zero greenhouse gas emissions target as early as 2050 and has joined the 2021 Global Methane Pledge that aims to reduce global methane emission by at least 30% from 2020 levels. For individuals, we have a responsibility to be sustainable in our daily consumption but for larger scale efforts, one of the keys in reducing methane and carbon dioxide emissions is through solid waste management solutions. It is also more urgent than ever as our landfills are overwhelmed. According to the Malaysian Investment Development Authority (Mida), by 2022, the amount of municipal solid waste (MSW) is expected to rise to 14 million metric tonnes annually, enough to fill the Petronas Twin Towers every week. As the population grows, the amount of commercial and domestic waste will also rise. This calls for a more efficient and environmentally friendly way to manage waste. This is where Malakoff Corporation Berhad (Malakoff) steps in. After undergoing a corporate rebranding exercise, the company has emerged as an important organisation that plays a pivotal role in the country’s environmental agenda. With a tagline “Enhancing Life, Enriching Communities”, Malakoff has identified three business pillars: Malakoff Green Solutions, Malakoff Environmental Solutions and Malakoff Energy. Through its Malakoff Environmental Solutions pillar, Malakoff is the only energy company that provides solid waste management and public cleansing, infrastructure cleansing and waste solutions, integrated facility management, recycling, marine and hazardous waste solutions, water desalination and waste-to-energy in the country. The pillar is divided into three main segments: concession (solid waste management and public cleansing) which is managed by Alam Flora Sdn Bhd (Alam Flora), a wholly owned subsidiary of Malakoff; non-concession (including infrastructure cleansing and waste solutions) and WTE, managed by Alam Flora Environmental Solutions (AFES), a member of the Malakoff Group. Reducing Waste with Minimal Impact on the Environment Alam Flora is one of the largest concession holders of Malaysia’s national solid waste management and public cleansing privatisation project. The company provides comprehensive waste management services to several concession areas in Peninsular Malaysia, among them are Kuala Lumpur, Putrajaya, and Pahang. Operating within the Solid Waste and Public Cleansing Management Act of 2007, Alam Flora adopted various processes in overseeing the operations of collection, discarding and maintenance that are compliant with local and international standards. Part of the company’s bigger agenda is to increase recycling capacity in line with national targets. One way that they achieve this is through Fasiliti Inovasi Kitar Semula (FIKS) in Putrajaya, a one-stop centre for the public to learn about recycling processes and waste management. Fasiliti Inovasi Kitar Semula (FIKS) in Putrajaya FIKS is the first-ever waste management and recycling education centre in Malaysia, with a recycling knowledge hub, mini library, recycling and buy-back centre and 3R boutique – which collects gently used clothing to be sold at reasonable prices with the proceeds going to charity. Besides that, Integrated Recycling Facility (IRF) is also available at the centre, where all the recyclable materials are sorted and processed to end-user manufacturers to be reprocessed into secondary raw material and new products. Apart from FIKS, AFES has also launched its Recovery Initiative Sustainable Eco-Facility (RISE Kuala Lumpur) on 15 September this year, in Gombak, Selangor to lead the way in implementing the circular economy model and commit to sustainability. With advanced facilities and equipped with a semi-auto sorting machine, the facility receives different types of recyclable wastes from municipal solid waste, which will be repurposed to reduce its impact on the environment. Supporting Sustainable Waste Management with Policies Malakoff, through its subsidiaries, is also pushing for the government to introduce certain policies to have greater impact in its recycling and waste reduction efforts. Policies and systems such as Extended Producer Responsibility (EPR) and Polluter Pays Principle (PPP) have been introduced in other countries including Japan and other European countries but have yet to be introduced in Malaysia. EPR is a policy in which producers are held responsible for the products they manufacture once those products are no longer useful to consumers. On the other hand, PPP is implemented to ensure that the party responsible for producing pollution pays for the damage inflicted on the natural environment. Other solutions include landfill tax (paid in addition to normal landfill rates), and the Pay-As-You-Throw (PAYT) system treats trash services like other utilities, where households pay a variable rate based on the amount of waste they generate, implemented through a flat fee for each garbage bag used. Ultimately, the enactment of any policies or acts that reduce waste consumption, will reduce waste generation and from being sent to the landfills and most importantly, be more sustainable in the long term. Having taken on the role, Alam Flora is steadfast in ensuring wastes are managed in a responsible manner. No easy feat! Enriching Communities In supporting one of the nation’s circular economy roadmaps, Malaysia Plastic Sustainability Roadmap 2021 – 2030, Alam Flora and AFES have implemented ingenious solutions in waste management. Alam Flora has introduced 3R on Wheels which aims to create public awareness of recycling and, offering mobility for the public to take part in recycling activities either at public events or residential areas. Meanwhile, the company has partnered with Nestle Malaysia through its subsidiary AFES to launch a kerbside programme in 15 townships in Greater Kuala Lumpur. This is to recover post-consumer packaging in one hand, and in the other, to enhance consumer awareness of how to recycle the packaging effectively. They have also deployed its first on site Port Reception Facilities (PRF) in Malaysia to deal with marine waste from ship liners berthing at Northport. Clearly, the group is knee-deep in solving the country’s waste matters in an efficient and sustainable manner with its end-to-end solutions. Aside from the reduction of waste, Malakoff is also exploring the Waste-to-Energy (WTE) sector, as part of its sustainable practices. WTE technology involves turning waste materials, particularly non-recyclable and biodegradable waste, into usable heat, electricity, or fuel. This reduces waste while offering economic and environmental benefits. WTE minimises the release of methane into the atmosphere, which can be fatal at high levels as it can replace oxygen and cause asphyxiation. Moving Forward with Sustainability in Mind Through Malakoff Environmental Solutions business pillar, Malakoff plans to venture into local projects and expansion opportunities abroad, at the back of its commitment to maintain environmental sustainability and reducing carbon emission of its operation. With its vast experience in waste management and environmental solutions, the company is looking to provide waste solutions to more businesses including commercial organisations and ports. In October this year, Malakoff had proposed to acquire a 49% stake in a solid waste management company, E-Idaman Sdn Bhd to expand its waste management and environmental portfolio in the northern region of Peninsular Malaysia and establish a stronger foothold in this evolving environmental business landscape. The company is also planning to expand its services to new concession areas within Malaysia such as Labuan, Kelantan and Terengganu. In addition to championing the municipal solid waste market through the expansion of business areas, there are several opportunities for Malakoff to grow into integrated hazardous waste operations which include the collection, treatment and disposal of medical, industrial and construction waste. Medical hazardous waste, e-waste and construction waste are also expected to grow at a rate of 10%, 4.7% and 4.1%, respectively, providing Malakoff with growth opportunities in the non-concession segment. A sustainably- driven company, Malakoff is committed to enhancing lives and enriching communities. Malakoff aspires and works towards driving change to realise the country’s ambitions of carbon neutrality and a circular economy by offering extensive skills in waste management and environmental solutions for a healthier and cleaner future for Malaysians.","filter_flag":1}
