{"title":"LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5","id":"CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA","guidislink":false,"published":"Wed, 09 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=221, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5\" target=\"_blank\">LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xycy1hbm5vdW5jZXMtZ3JhbmQtb3BlbmluZy1vZi10aGUtZXhjaGFuZ2UtYS1yZXZvbHV0aW9uYXJ5LW1hdGVyaWFsLXJlY292ZXJ5LWZhY2lsaXR5LXBpb25lZXJpbmctYS1uZXctZXJhLW9mLXN1c3RhaW5hYmxlLXdhc3RlLW1hbmFnZW1lbnQtYW5kLXJlY3ljbGluZy0zMDE4OTY4NTAuaHRtbNIBAA?oc=5\" target=\"_blank\">LRS Announces Grand Opening of The Exchange, a Revolutionary Material Recovery Facility Pioneering a New Era of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The new $50 million facility sets the stage for LRS to significantly and sustainably divert more materials from the region's landfills and reduce the overall carbon footprint of the waste and recycling process. ROSEMONT, Ill., Aug. 9, 2023 \/PRNewswire\/ -- LRS — the nation's fifth largest independent waste diversion, recycling and portable services provider — proudly announces the grand opening of The Exchange, a state-of-the-art material recovery facility (MRF) revolutionizing waste management and recycling practices. The new facility is located in the Stockyards neighborhood of Chicago and marks LRS' pursuit to reshape the future of waste and recycling to lessen environmental impact across the Midwest. The Exchange marks a significant milestone in LRS' mission to foster positive change within the industries and communities it serves through responsible waste practices. The Exchange boasts an impressive processing capacity of 25 tons of recyclables per hour and plans for future expansion to 35 tons per hour, playing a pivotal role in enhancing waste diversion efforts in the Chicagoland area. \"The Exchange stands as a powerful embodiment of our vision to become the safest, most innovative waste recycler globally,\" said John Larsen, Chief Operating Officer at LRS. \"It symbolizes our unwavering dedication to spearhead transformative change, not only within our industry but also within the communities we have the privilege to support.\" The facility — which is positioned within LRS' 25-acre eco-park and creates a centralized location to house over 140 waste and recycling trucks to reduce transportation costs and emissions — is equipped to handle various types of waste, including single-stream recyclables, non-hazardous and non-special Municipal Solid Waste (MSW), and other recyclable materials. It uses cutting-edge sorting equipment, including six optical sorters, a CP Auger Screen and three Fire Rover Units, all managed by a skilled team of 11 sorting staff members. The Exchange is projected to divert 224 million pounds of recyclables annually, resulting in thousands of tons of avoided CO2 emissions. The Exchange has not only made significant strides in environmental sustainability, but has also made a positive economic impact on the community. The facility has created over 50 new permanent positions and generated 95 construction jobs. Additionally, it supplies viable recyclable materials to numerous mills in the Midwest, contributing to regional economic development. \"Chicago is proud to welcome The Exchange Facility, a new and technologically advanced recycling sorting facility within city limits that marks an important step in our journey toward sustainable waste management,\" said Department of Streets and Sanitation Commissioner Cole Stallard. \"The Exchange builds efficiencies into our municipal recycling operations, helping us move closer to our waste diversion goals, and ultimately a cleaner, greener, and more resilient Chicago.\" To celebrate this momentous achievement, LRS is hosting a grand opening of The Exchange on August 9, 2023. The event includes a ribbon-cutting ceremony and a celebration following at Marz Brewing Company. Local city officials, the Mayor's Office, long-term partners, members of the media, LRS team members, and more are attending the event. The development of The Exchange was made possible through an investment of over $50 million, along with crucial capital support from a range of different investors, including Closed Loop Partners, a leading circular economy investment firm. In partnership with Closed Loop Partners, LRS aims to integrate new technologies into the facility and bolster potential end markets for recycled materials, furthering the establishment of robust circular systems in the region. \"Closed Loop Partners' Infrastructure Group is proud to invest in leading private and public organizations advancing infrastructure and technologies for materials circularity,\" says Jennifer Louie, managing director, Closed Loop Infrastructure Group, Closed Loop Partners. \"LRS is a leader in building the infrastructure for a circular economy in the Chicagoland region. With capital from our Closed Loop Infrastructure Fund, Circular Plastics Fund and Beverage Fund, we are thrilled to work with the LRS team to improve recycling systems in one of the largest cities in the U.S. Establishing strong partnerships with industry stakeholders remains a core tenet of our work at Closed Loop Partners and we are excited to have the support of the American Beverage Association in this project through Every Bottle Back and our Closed Loop Beverage Fund.\" In addition to the grand opening of The Exchange, LRS is proud to partner with the City of Chicago, Department of Streets of Sanitation (DSS) to unveil the Blue Cart Recycling Map. The City's Blue Cart program provides bi-weekly recycling services via LRS and DSS trucks to single-family homes and multi-unit buildings with four or fewer units in Chicago. The Blue Cart Recycling Map showcases the journey of Chicago's recycling and shares how and where material is sorted as well as tonnage data of recycled materials. Check out the map on DSS's website . The grand opening of The Exchange builds on a transformative beginning to 2023 for LRS. This period included the regionalization of all company operations and the strategic acquisition of Michiana Recycling and Disposal, as well as Environmental Recycling & Disposal and Moen Transfer Station. These impressive business moves serve as a strong indicator of the continued growth and progress that awaits LRS throughout the remainder of this year. For more information about LRS and its groundbreaking facility, The Exchange, please visit lrsrecycles.com . About LRS LRS is among the nation's leading independent waste diversion, recycling and portable services providers. Since 2013, LRS has specialized in delivering an exceptional customer experience for millions of residential and commercial customers across nine states: Illinois, Wisconsin, Iowa, Indiana, Michigan, Minnesota, Kansas, Arkansas and Tennessee. Diversified and growing, LRS also offers affordable roll-off container services, C&D recycling, portable restroom rentals, on-site storage and temporary fencing. LRS owns and operates more than 70 facilities and thrives on the passion of nearly 2,300 full-time employees. The company provides safe, innovative, sustainability-driven services to clean and beautify the cities, neighborhoods, and communities it serves. To learn more visit www.LRSrecycles.com . Media Contact: Meghan Kelly lrs@spoolmarketing.com (630) 360-0020 SOURCE LRS","filter_flag":1}
{"title":"New Recycling Facility Redefines ‘State of the Art’ - Business West","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vYnVzaW5lc3N3ZXN0LmNvbS9ibG9nL25ldy1yZWN5Y2xpbmctZmFjaWxpdHktcmVkZWZpbmVzLXN0YXRlLW9mLXRoZS1hcnQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vYnVzaW5lc3N3ZXN0LmNvbS9ibG9nL25ldy1yZWN5Y2xpbmctZmFjaWxpdHktcmVkZWZpbmVzLXN0YXRlLW9mLXRoZS1hcnQv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vYnVzaW5lc3N3ZXN0LmNvbS9ibG9nL25ldy1yZWN5Y2xpbmctZmFjaWxpdHktcmVkZWZpbmVzLXN0YXRlLW9mLXRoZS1hcnQv0gEA","guidislink":false,"published":"Thu, 17 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=229, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vYnVzaW5lc3N3ZXN0LmNvbS9ibG9nL25ldy1yZWN5Y2xpbmctZmFjaWxpdHktcmVkZWZpbmVzLXN0YXRlLW9mLXRoZS1hcnQv0gEA?oc=5\" target=\"_blank\">New Recycling Facility Redefines ‘State of the Art’<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business West<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Recycling Facility Redefines ‘State of the Art’ - Business West","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vYnVzaW5lc3N3ZXN0LmNvbS9ibG9nL25ldy1yZWN5Y2xpbmctZmFjaWxpdHktcmVkZWZpbmVzLXN0YXRlLW9mLXRoZS1hcnQv0gEA?oc=5\" target=\"_blank\">New Recycling Facility Redefines ‘State of the Art’<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business West<\/font>","source.href":"https:\/\/businesswest.com","source.title":"Business West","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"What Goes Around… Frank Antonacci says he’s lost track of how many tours he’s led of the All American Material Recovery Facility (MRF) in Berlin, Conn., which handles material from across the Nutmeg State and Western Mass. “Suffice it to say, it’s a big number,” said Antonacci, a principal with Murphy Road Recycling, an operator of several recycling facilities, which, in partnership with Van Dyk Recycling Solutions, suppliers of the system’s equipment, opened the state-of-the-art facility in early 2022. Since then, in addition to overseeing this intriguing operation, which processes more than 50 tons of recyclable material an hour, Antonacci and Jonathan Murray, director of Operations for Murphy Road Recycling, have been leading individuals and groups through the massive facility to show them what goes on there and why this operation is among the most advanced of its kind in the country — and the world, for that matter. And there have been many different constituencies donning the bright orange vests, hardhats, and audio systems needed to hear and be heard over the din of countless conveyer belts and sorting machinery. These include elected officials, business leaders, public-works crews, press members (including BusinessWest), and, perhaps most importantly, representatives of the companies that buy the recyclables — and many of them have made the trip to Berlin. What they take in is a facility that was built with three primary goals in mind: to increase the quantity, quality, and purity of recyclables; to provide an innovative and safe working environment; and to have the flexibility to adapt to ever-evolving consumer habits (more on that later) and recycling market conditions. And more than a year after it opened to considerable fanfare, this MRF is accomplishing all three, especially with regard to the purity of recyclables, said both Antonacci and Murray, noting that this is something that communities, states, and those buying the recovered products are demanding. “Today’s curbside material isn’t what it was 10 or 15 years ago. Then, it was heavy on newspaper and relatively clean. Today, everyone reads news online and orders everything from the internet. Today’s stream is full of small cardboard boxes and shipping envelopes and requires that we, as recyclers, innovate and change our thinking around the sorting of recyclables.” The fully integrated system, replete with artificial intelligence and high-tech scanners, is dedicated to the maximum recovery of all recyclable material, with several second-chance mechanisms in place to make sure valuable material doesn’t slip through the cracks, said Murray, adding that the design includes state-of-the-art equipment to target paper, cardboard, boxboard, glass, and five types of plastic. Elaborating, he said the system first separates paper from aluminum and other metals and plastic and then digs deeper to identify and sort different types of plastic, such as the PET (polyethylene terephthalate) used to make water and soda bottles, and HDPE (high-density polyethylene) used to make food and beverage containers, shampoo bottles, cleaning-product bottles, and similar products. “The optical scanners are trained; they’re learning all the time to know what the makeup of a PET bottle is,” Murray explained. “If a scanner’s job is to pick PET bottles, it knows it by reading the makeup of the bottle. Everything else travels on to the next optical scanner, which may be looking for HDPE or milk jugs or laundry detergent bottles; it scans for those and shoots those out. “The scanners are actually looking for the makeup of what’s in that material,” he went on. “It shoots a blast of air to kick it out or leave it in, and they’re trained at the factory and adjusted, so if we’re seeing a higher level of PET in the mix than HDPE, we can make adjustments so it will recognize that quicker and make sure we’re getting it all out.” For this issue, BusinessWest toured the massive facility in Berlin and talked with Antonacci and Murphy about this operation, the evolving recycling market, and how the Berlin MRF redefines what would be considered state-of-the-art in this industry. Leaving Little to Waste Murray calls it the “Amazon effect.” That’s a term he and others in this industry use to describe the influence of that giant corporation on life in general — and especially the world, and business, of recycling. “Today’s curbside material isn’t what it was 10 or 15 years ago,” he noted. “Then, it was heavy on newspaper and relatively clean. Today, everyone reads news online and orders everything from the internet. Today’s stream is full of small cardboard boxes and shipping envelopes and requires that we, as recyclers, innovate and change our thinking around the sorting of recyclables.” And these sentiments effectively and concisely explain what the All American Material Recovery Facility is all about — innovation and changing how people think about recycling and waste-disposal diversion. “We took a significant amount of risk and leveraged our expertise, as well as a very strong team, to develop what we have here.” The facility, and the roughly $40 million invested in it, represent another entrepreneurial venture, and gambit, undertaken by the Antonacci family, which was recognized by BusinessWest as its Top Entrepreneurs in 2018 for their creation of an eclectic and highly successful stable of businesses, with ‘stable’ being one of the operative words. Indeed, this large and impressive portfolio includes a horse farm, Lindy Farm in Somers, which has bred and trained a string of champion trotters; Sonny’s Place in Somers (named after the patriarch of the family, Frank’s grandfather, Guy ‘Sonny’ Antonacci), a huge and continually growing family-entertainment venue; GreatHorse, the high-end, horseracing-themed private golf club created on the site of the former Hampden Country Club; and Murphy Road Recycling. All of these ventures represented considerable investments and risks, Antonacci said, adding that the MRF in Berlin is no different. “You’ll see many of the same themes throughout this facility as you would at our other operations,” he explained. “We took a significant amount of risk and leveraged our expertise, as well as a very strong team, to develop what we have here.” The company looked at a number of recycling facilities starting in 2018 and made the decision to buy the Berlin facility in 2020, at the height of COVID. “It was a considerable risk and investment at that point,” he went on. “But we knew that there would be life after COVID, and we believed that the region really needed a reliable, scalable solution to handling the growing amount of single-stream material.” By single-stream, he noted that recyclables from businesses and consumers come with various materials mixed together, often with materials that shouldn’t be placed in recycling bins but are anyway — from batteries to electronic devices. This venture represents the expansion and modernization of an existing recycling facility, Antonacci said, adding that everything about the facility is state-of-the-art, a phrase he used early and often in this conversation, because it’s certainly warranted. “We integrated tried-and-true mechanical separation though screens with optical technology,” he noted as he talked about what is really the heart of this operation. “We have machines that are optically looking at the material to polish any contamination or any mixture of different grades of recycling, and that’s done through highly advanced camera systems with artificial intelligence.” Reading Material The facility handles recyclables from roughly 100 communities in Connecticut and Western Mass., Antonacci explained, noting that materials from many communities in the 413 are aggregated and then brought to Berlin for processing. Overall, it handles upwards of 1,000 tons of material per day, a huge jump from the 350 tons a day handled by the largest facilities in the area prior to the opening of the MRF in Berlin. Beyond size and scope, this facility stands out for many other reasons. Indeed, the operation employs a dozen optical scanners that can identify and separate materials based on their chemical composition, and utilizes robotics and AI to perform additional quality control. “The quality of the material that we’re able to glean from the blue-bin mix is really remarkable,” Antonacci said. “Leveraging our expertise and that of Van Dyk Recycling Solutions, we’ve moved the industry forward a generation with the design of this plant, based not only on the scale, but on the quality of the materials coming out of here.” As they were developing the Berlin facility, those at Murphy Road toured a number of recycling operations in this region and other parts of the country, Murray said, with an eye toward adopting best practices and technologies. But there are some things being done here that would be considered unique and groundbreaking, he went on. This includes a dual-feed system set in parallel lines, Antonacci said, adding that this is a different approach to preparing materials for final processing. Other innovations include the picking stations, where employees handle quality control, which are enclosed in dust-controlled, climate-controlled boxes which place a premium on worker comfort and safety. “We went through a painstaking effort of keeping people away from places that could harm them,” he told BusinessWest. “We invested heavily in automation to further increase the safety and productivity of the facility.” Beyond these safety features, the facility was designed to effectively handle ongoing evolution in consumer habits and thus the recycling stream. As he talked about this and pointed to the streams of paper moving along conveyer belts, Murray noted that, despite declines in readership, a large amount of newsprint still winds up in recycling bins. “We took a significant amount of risk and leveraged our expertise, as well as a very strong team, to develop what we have here.” But these same bins are being increasingly dominated by both cardboard packaging — that aforementioned ‘Amazon effect’ — as well as myriad kinds of plastic, aluminum, and tin cans. Overall, the bins are cleaner than they were years ago, he went on, adding that the overall quality of the end product — what is ultimately sold to companies to make new products — is a function of how effectively the different materials, especially the many types of plastics, are separated. And this is where the All American MRF stands out from other facilities. Elaborating, Antonacci said this facility’s sorting capabilities extend to polypropylene, used to make everything from yogurt containers to margarine tubs; from Dunkin’ Donuts coffee cups to the packaging for to-go food products. “This is something that has historically been hard to separate,” he explained. “But we have both the optical technology to look for polypropylene number 5, which those containers are made out of, and there’s also a laser on our optical machine that enables us to see those black plastics — the to-go containers — which most facilities can’t.” Bottom Line There are ever-larger amounts of polypropylene #5 winding up recycling bins, and the ability to separate it from everything else is becoming increasingly important, said Antonacci, adding that this is just one of the reasons why he and Murray are giving so many tours these days. People want to see what separates this facility from most others — with the emphasis on separates. It not only represents state-of-the-art in this industry, it defines it.","filter_flag":1}
{"title":"Rolling car tires into the global circular economy - Mongabay.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8wOC9yb2xsaW5nLWNhci10aXJlcy1pbnRvLXRoZS1nbG9iYWwtY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8wOC9yb2xsaW5nLWNhci10aXJlcy1pbnRvLXRoZS1nbG9iYWwtY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5","id":"CBMiVWh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8wOC9yb2xsaW5nLWNhci10aXJlcy1pbnRvLXRoZS1nbG9iYWwtY2lyY3VsYXItZWNvbm9teS_SAQA","guidislink":false,"published":"Mon, 21 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=233, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8wOC9yb2xsaW5nLWNhci10aXJlcy1pbnRvLXRoZS1nbG9iYWwtY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5\" target=\"_blank\">Rolling car tires into the global circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mongabay.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rolling car tires into the global circular economy - Mongabay.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vbmV3cy5tb25nYWJheS5jb20vMjAyMy8wOC9yb2xsaW5nLWNhci10aXJlcy1pbnRvLXRoZS1nbG9iYWwtY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5\" target=\"_blank\">Rolling car tires into the global circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mongabay.com<\/font>","source.href":"https:\/\/news.mongabay.com","source.title":"Mongabay.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"More than 1 billion car tires reach the end of their life each year, and dealing with the resulting waste is an escalating management headache the world over. But long before tires are thrown away, they leave behind a trail of environmental harm stretching from tropical forests, along supply chains, and to consumers. Limited rubber traceability risks deforestation, experts warn, while other research shows that tire wear releases potentially toxic microplastic pollution. It needn’t be this way: Circular economy solutions — reducing, reusing and recycling materials in closed loops — could offer tire pollution solutions. However, these solutions come with limitations and trade-offs. A tire redesign is greatly needed to increase longevity, as is the cultivation of new sources of deforestation-free rubber, and alternative end-of-life strategies that emphasis recycling of the dozens of components found in tires. But given the complex makeup of today’s tires, there won’t be one simple solution. Imagine a heap of a billion vehicle tires towering overhead, the total number humanity throws away in just one year — worn-out tires tossed into landfills, burned, or littering the landscape. While that’s a visually distressing image, the harm tires do starts where they’re sourced, with current and future car fleets leaving an environmental trail stretching from tropical rainforests to rubber plantations to global roadsides, along waterways, and even into the atmosphere — impacting global biodiversity and human health. Experts say that applying a circular economy model to tire production and disposal could limit massive resource demand, while simultaneously turning this globally vexing waste stream back into valuable materials. But no matter the solution, the complex composition of the average tire — containing more than 400 chemicals and compounds — means there’s no single silver-bullet solution to this persistent problem. A toxic conundrum Tires typically start their life’s journey in the tropics, with rubber produced predominantly by smallholder farmers on monocrop plantations. Current production methods risk ongoing deforestation and harm to biodiversity, along with uncertain livelihoods for farmers. Some 70% of the world’s natural rubber ends up in car tires with most coming from tropical countries such as Thailand, Indonesia and Malaysia. But natural rubber is just one component found in a modern tire. Like the cars they’re fitted to, tires are composite products, made of steel and hundreds of chemicals and compounds that give them durability and strength. Unpacking tire environmental impacts is complicated, say experts, partly due to that complexity, and also due to the lack of publicly available data on tire ingredients. What is known is that tire impacts are spread far and wide: Rolling on roads wears them down, releasing microplastic particulates everywhere — making them one of the most common pollutants in Earth’s oceans today, according to research. “We know enough to say that it is possibly the biggest, and possibly the least well understood, environmental problem related to transportation,” says Nick Molden, CEO of Emissions Analytics, a company that conducts research into tire wear. Some tire waste kills. A tire additive known as 6PPD, for example, has been identified as particularly alarming. The mass die-off of coho salmon in the U.S. Pacific Northwest has been linked to tire wear via chemical pollution in the form of this antioxidant. As it protects tires, 6PPD transforms into 6PPD-quinone, a highly toxic chemical. Edward Kolodziej, who led the team that made the discovery and a researcher at the University of Washington Tacoma, describes 6PPD-quinone as possibly one of the most toxic substances known to aquatic species. Since its discovery, researchers have found 6PPD and 6PPD-quinone in fresh- and saltwater, ocean sediments, air, soil, and human urine; yet its overall ecological and health impacts remain unknown. Many other tire chemicals lack sufficient study as to risk. Chemical-laden tires at the end of their life pose a serious waste management headache. Landfilling them is no solution; no matter where they’re dumped, heaps of aging tires become a pollution source as they break down, leaching toxins into soils and aquifers. Burning tires, another common practice, merely transfers that toxic burden from soils and waters to the sky. Research shows that open burning can emit carbon monoxide, nitrogen dioxide, sulfur dioxide, particulate matter, and other compounds at potentially harmful levels, posing a risk to human health. Circling the tire economy At its core, the circular economy seeks to reduce, reuse and recycle materials in closed loops, with zero waste as the ultimate goal. Tires are prime circularity candidates, say analysts, because when discarded they retain a wealth of useful materials. But getting at those materials, processing them, and making a profit doing so is a major challenge. “Successful ELT [end-of-life tire] management systems … foster circular flows of materials … and avoid the unregulated dumping of tires,” says Gavin Whitmore, senior communications manager at the Tire Industry Project (TIP), a group that includes some of the world’s major tire manufacturers. But ELT recovery is woefully inadequate today. A 2019 TIP report noted that in 45 countries surveyed, just 42% of end-of-life tires were used in material recovery and 15% in energy recovery. Some common management options include shredding tires into small rubber pellets for use as construction filler, in rubber-modified asphalt, or in artificial sports pitches. Millions of waste tires become alternative energy, dubbed tire-derived fuel, burned in kilns for the production of cement, steel, pulp and paper. This market is only set to grow in coming years, say analysts, due to its low cost and reported reduced carbon emissions. Some argue that tire-derived fuel could even lessen the heavy environmental footprint of the cement and paper industries, while helping dispose of tire waste. TIP notes that “energy recovery can be a particularly efficient way to deal with high volumes of ELT and eliminate long-standing stockpiles because it is generally technically straightforward to implement” while “the use of ELT as an alternative fuel is also encouraged to reduce CO 2 emissions.” But some experts argue that these common disposal routes — grinding down tires or burning them — amount to little more than downcycling, failing to maximize the full potential for material reuse of waste tires. Not surprisingly, some of these trumpeted solutions are also plagued by their own environmental issues. Researchers in Ireland, for example, found that the spreading of rubber crumb on artificial sports pitches is a source of microplastics and may pose health concerns due to the toxic chemicals locked up in the materials. The European Union is aiming to ban this widespread practice, potentially leaving a backlog of tires to be disposed of properly. Making old tires new again: Reusing and recycling Two other solutions tipped to deal with tire waste on a large scale offer the promise of circularity: devulcanization and pyrolysis, both of which could ultimately make new tires out of old, according to analysts. “The most important part of the circular economy for tires is getting the original product back into its intended application,” says Jon Visaisouk, chief operating officer of Tyromer. His company produces devulcanized rubber from used tires, which can replace some raw materials in new tire production. Currently, the firm can process between 100,000 and 150,000 waste tires per year, he says. Devulcanization is a promising low-energy solution for dealing with tires en masse, but has its limitations from a circularity perspective, according to Niles Beadman, a patent attorney with Mewburn Ellis: “You can’t use that devulcanized product as 100% raw material. You would still typically mix it in with some virgin raw material,” he explains, claiming that pyrolysis shows more promise. Pyrolysis works by heating tires in the absence of air to break them down. This turns waste tires into separate reusable materials such as recovered carbon black for new tires, oils that can be upgraded to alternatives to diesel, and gases to loop back in and power the whole system, reducing its energy intensity. Prior to the pyrolysis process, the tire’s steel is stripped for reuse. Pyrolysis is often referred to by advocates as “environmentally safe” and a vital tire waste solution. “What we’re bringing to the table is a solution that is not only environmentally friendly, but can work at scale to actually make a dent in the problem,” says Vianney Vales, CEO of Wastefront in Norway, which uses pyrolysis. But to break tires down into those useful products, the energy-intensive pyrolysis process creates multiple waste streams, is linked to significant air and water pollution, and produces carbon emissions. Pakistan banned the use of pyrolysis units last year due to toxic pollution concerns. One frequent problem with pyrolysis is the quality of products made by the process, says Dina Czajczyńska, a researcher at Wrocław University of Science and Technology in Poland. Another “really important environmental issue” is highly toxic sulfur emissions — meaning that, without desulfurization of emissions and of the products themselves, pyrolysis can be environmentally harmful, she says. “What we are trying to do is solve this [tire] problem without having an impact on the environment around us,” says Thomas Sörensson, CEO of Scandinavian Enviro Systems, a Sweden-based company that employs pyrolysis. “We use the latest technology for reducing emissions, taking care of sulfur, and have put in place a system that is meeting the highest environmental regulations.” Practiced conscientiously, pyrolysis may have the potential to convert massive amounts of tires into renewable products, say some experts. A Wastefront facility under construction in northern England could absorb about 20% of the U.K.’s annual waste tire output once it goes live in 2024, according to Vales. But as other experts underscore, the environmental footprint of widespread pyrolysis use as a tire solution could be large if not appropriately managed and regulated. “This is going to be a crucial part of the circular economy for cars and plastics more generally. How can we extract value and recycle these millions of waste tires?” asks Molden, who notes that while pyrolysis offers a “major opportunity” for tire recycling, “you have to [power] it with green energy, and you have to make sure you don’t create all sorts of toxic waste that has to be dumped somewhere in the process.” Circular rubber sources Dealing with mountains of end-of-life tires is only part of the sustainability challenge facing the tire industry and the automotive sector at large. A recent report by the Zoological Society of London (ZSL) underlines the lack of transparency in rubber supply chains, risking unseen links to deforestation and wider biodiversity harm. Given that the projected demand for tires is set to increase year-on-year, unabated by the switch to electric vehicles, more rubber will be required, which may put tropical forests deeper in harm’s way. To this end, tire manufacturers are investigating alternative natural rubbers, such as Russian dandelion, from which limited quantities of tires are already made. These innovative sources could serve as substitutes to tropically-sourced rubber. “The major problem that we’re facing is higher demand for natural rubber in the next few years,” says Dirk Prüfer, a professor of plant biotechnology at the University of Münster in Germany whose work focuses on producing rubber from Russian dandelion. He says alternative rubbers could supply at least some of future demand, without endangering biodiversity-rich areas and tropical forests. The Russian dandelion, for example, can grow on so-called marginal lands, and doesn’t compete with food crops, he says. However, ZSL sustainable business specialist Sam Ginger says he doubts the efficacy of this solution. “It would be a big distraction to try and start establishing huge plantations of dandelion without solving the [sustainability] issues that [already exist] within the rubber supply chain,” he says. That new source would distract from the problems faced by the “6 million smallholder farmers that are currently dependent on this industry.” Experts also underline the need for increased regenerative agricultural practices if supply chain circularity is to be achieved. Ginger says the natural rubber industry already offers multiple opportunities in this space, working with farmers to put regenerative and agroforestry practices in place to support both biodiversity and farmers’ livelihoods. Stefano Savi, director of the Global Platform for Sustainable Natural Rubber, says that fundamentally “we need to change the [tire production] system so that the farmers become entrepreneurs.” “Today, most of the farmers are extractors of these commodities and deplete natural resources because they’re not geared towards [sustainably] managing the land,” he notes. Like Ginger, he says that by helping smallholders apply circular principles, including pesticide reduction and better water management, then “you will be able to do more with less. You will be able to have a better system.” But such changes are all predicated on fully tracing and creating transparency in supply chains, and will require wider collaborations from industries such as car manufacturers. Ginger adds: “To make a truly transformative effort across the whole supply chain, you need to have carmakers involved. They need to be contributing funds to any sort of sustainability effort across the whole supply chain, all the way down to the smallholders.” Achieving circularity and ‘using less cars’ Tires are just one component of the wider circularity challenges facing the auto industry. But tires represent a fast-growing, thorny problem, as vehicle use worldwide increases material demand. Tire wear, too, is predicted to get worse as EVs become more prevalent, in part due to their bulkier weight, likely exacerbating associated microplastic and chemical pollution from problematic tire components. Solutions are urgently needed now, researchers say. Kolodziej especially emphasizes the need to find a safe alternative to 6PPD, which should be a priority for the industry. “I think there’s still a lot of discussion around what should be evaluated in that chemical screening process to develop the circular economy” in order to “reuse, remanufacture and recycle things like tires.” But not all experts are convinced that a materially focused vision of circularity, and particularly recycling, will be enough to reduce tire-associated environmental problems. Czajczyńska, for example, emphasizes the need to reduce overall consumption: “We have to think about using less cars, using more bicycles and public transportation to avoid the problem of [tire] waste,” she says. “Because no matter how well you process or treat waste tires, [they] will always produce some emissions or another waste product.” Kaustubh Thapa, a researcher at Utrecht University in the Netherlands, agrees that a “better solution” would be to offer alternatives that reduce the need for ever more tire production now and in the future. “I think that when the circular economy is very technocratic and material-focused, it just shifts some problems to other parts,” he says. “If we want to fix these challenges in a systematic way, then we need to also include the social dimension in the circular economy.” Banner image: Increasing tire longevity, repairing and reusing component parts, are all tire circular solutions. A plant in Spain, operated by Life for Tyres Group and funded by the European Union, aims to recover materials (such as carbon black) and produce synthetic fuels (including biogas) from 26 million metric tons of end-of-life tires each year, equivalent to around 9% of Spain’s annual use. Image by Egor Myznik via Unsplash (Public domain). FEEDBACK: Use this form to send a message to the author of this post. If you want to post a public comment, you can do that at the bottom of the page. Citations: Tian, Z., Zhao, H., Peter, K. T., Gonzalez, M., Wetzel, J., Wu, C., … Kolodziej, E. P. (2021). A ubiquitous tire rubber-derived chemical induces acute mortality in coho salmon. Science, 371(6525), 185-189. doi:10.1126\/science.abd6951 Johannessen, C., Saini, A., Zhang, X., & Harner, T. (2022). Air monitoring of tire-derived chemicals in global megacities using passive samplers. Environmental Pollution, 314, 120206. doi:10.1016\/j.envpol.2022.120206 Cao, G., Wang, W., Zhang, J., Wu, P., Zhao, X., Yang, Z., … Cai, Z. (2022). New evidence of rubber-derived quinones in water, air, and soil. Environmental Science & Technology, 56(7), 4142-4150. doi:10.1021\/acs.est.1c07376 Du, B., Liang, B., Li, Y., Shen, M., Liu, L., & Zeng, L. (2022). First report on the occurrence of N-(1,3-Dimethylbutyl)-N′-phenyl-p-phenylenediamine (6PPD) and 6PPD-quinone as pervasive pollutants in human urine from South China. Environmental Science & Technology Letters, 9(12), 1056-1062. doi:10.1021\/acs.estlett.2c00821 Jimoda, L. A., Sulaymon, I. D., Alade, A. O., & Adebayo, G. A. (2017). Assessment of environmental impact of open burning of scrap tyres on ambient air quality. International Journal of Environmental Science and Technology, 15(6), 1323-1330. doi:10.1007\/s13762-017-1498-5 Shakya, P. R., Shrestha, P., Tamrakar, C. S., & Bhattarai, P. K. (2008). Studies on potential emission of hazardous gases due to uncontrolled open-air burning of waste vehicle tyres and their possible impacts on the environment. Atmospheric Environment, 42(26), 6555-6559. doi:10.1016\/j.atmosenv.2008.04.013 Nadal, M., Rovira, J., Díaz-Ferrero, J., Schuhmacher, M., & Domingo, J. L. (2016). Human exposure to environmental pollutants after a tire landfill fire in Spain: Health risks. Environment International, 97, 37-44. doi:10.1016\/j.envint.2016.10.016 Yasar, A., Rana, S., Moniruzzaman, M., Nazar, M., Tabinda, A. B., Haider, R., … Ullah, S. (2021). Quality and environmental impacts of oil production through pyrolysis of waste tyres. Environmental Technology & Innovation, 23, 101565. doi:10.1016\/j.eti.2021.101565 Campbell-Johnston, K., Calisto Friant, M., Thapa, K., Lakerveld, D., & Vermeulen, W. J. (2020). How circular is your tyre: Experiences with extended producer responsibility from a circular economy perspective. Journal of Cleaner Production, 270, 122042. doi:10.1016\/j.jclepro.2020.122042","filter_flag":1}
{"title":"Fletcher Building to replace old particleboard line in Taupo with new Fine OSB plant - Lesprom Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3Lmxlc3Byb20uY29tL2VuL25ld3MvRmxldGNoZXJfQnVpbGRpbmdfdG9fcmVwbGFjZV9vbGRfcGFydGljbGVib2FyZF9saW5lX2luX1RhdXBvX3dpdGhfbmV3X0ZpbmVfT1NCX3BsYW50XzEwODkxOS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3Lmxlc3Byb20uY29tL2VuL25ld3MvRmxldGNoZXJfQnVpbGRpbmdfdG9fcmVwbGFjZV9vbGRfcGFydGljbGVib2FyZF9saW5lX2luX1RhdXBvX3dpdGhfbmV3X0ZpbmVfT1NCX3BsYW50XzEwODkxOS_SAQA?oc=5","id":"CBMifGh0dHBzOi8vd3d3Lmxlc3Byb20uY29tL2VuL25ld3MvRmxldGNoZXJfQnVpbGRpbmdfdG9fcmVwbGFjZV9vbGRfcGFydGljbGVib2FyZF9saW5lX2luX1RhdXBvX3dpdGhfbmV3X0ZpbmVfT1NCX3BsYW50XzEwODkxOS_SAQA","guidislink":false,"published":"Thu, 03 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=215, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3Lmxlc3Byb20uY29tL2VuL25ld3MvRmxldGNoZXJfQnVpbGRpbmdfdG9fcmVwbGFjZV9vbGRfcGFydGljbGVib2FyZF9saW5lX2luX1RhdXBvX3dpdGhfbmV3X0ZpbmVfT1NCX3BsYW50XzEwODkxOS_SAQA?oc=5\" target=\"_blank\">Fletcher Building to replace old particleboard line in Taupo with new Fine OSB plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Lesprom Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fletcher Building to replace old particleboard line in Taupo with new Fine OSB plant - Lesprom Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3Lmxlc3Byb20uY29tL2VuL25ld3MvRmxldGNoZXJfQnVpbGRpbmdfdG9fcmVwbGFjZV9vbGRfcGFydGljbGVib2FyZF9saW5lX2luX1RhdXBvX3dpdGhfbmV3X0ZpbmVfT1NCX3BsYW50XzEwODkxOS_SAQA?oc=5\" target=\"_blank\">Fletcher Building to replace old particleboard line in Taupo with new Fine OSB plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Lesprom Network<\/font>","source.href":"https:\/\/www.lesprom.com","source.title":"Lesprom Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Image: Project discussions at the Laminex site in Taupo between Paul Thorn, Fletcher Wood Products, Capital Works Manager at Fletcher Building (right) and Dieffenbacher Project Manager Ralph Fink (left) \/ Dieffenbacher New Zealand’s Fletcher Building Limited has ordered a complete CEBRO plant for the production of Fine OSB from German machine and plant manufacturer Dieffenbacher. The plant will be built at Fletcher Building’s Laminex site in Taupo, in the center of the North Island. The capital costs are estimated at $275 million. The new plant will include Dieffenbacher’s new Belt Dryer. Along with digitalization, advanced plant engineering and operational excellence, sustainability is one of the four pillars of Dieffenbacher’s smart plant concept CEBRO. The Belt Dryer has a low thermal energy consumption. It works at lower temperatures than drum dryers and can use low-calorific energy from the waste heat of other plant components that would otherwise remain unused. Furthermore, it can be used in combination with cogeneration. Image: Grey and translucent blue indicates new plant and equipment to be built beside existing end-of-life plant which will be decommissioned on completion \/ Fletcher Building Limited “It’s only a small part of our new plant, but the Belt Dryer is a perfect example of Dieffenbacher’s advanced solutions,” says Paul Thorn, Fletcher Wood Products, Capital Works Manager at Fletcher Building. “We chose Dieffenbacher for this important project because we are assured that they will help us move our business forward.” Fletcher Building’s new CEBRO plant will have the flexibility to produce Fine OSB and conventional OSB. Fine OSB is a special type of board consisting of an OSB core layer covered top and bottom by layers of particleboard. It combines OSB’s excellent mechanical properties with the surface quality of particleboard. Besides the new Belt Dryer, Dieffenbacher will supply an energy plant, a debarking line, purchased material infeed, strand production, a MAIER Impact Mill, the screening and air grading, material recovery, glue preparation, glue dosing and gluing systems, the forming station and forming line, a CPS+ continuous press with Press Emission Control System, raw board handling, pneumatic systems, electrics and automation, the digitalization solution EVORIS and the digital service platform MyDieffenbacher. In addition, Dieffenbacher subsidiary B. Maier Zerkleinerungstechnik GmbH is responsible for engineering the entire wood yard up to the strander. The new CEBRO plant will replace a particleboard production line featuring an almost 50-year-old single-opening press supplied by Dieffenbacher to Fletcher Building in 1974. “It’s remarkable that our old press served us so well and for so long. With the right maintenance, we believe our new Dieffenbacher plant will last at least as long,” says Thorn. Construction in Taupo will begin in early 2024. Start-up is scheduled for the fourth quarter of the same year, and full-scale production by mid-2025. After a ramp-up period, company expects to generate mid-cycle EBIT of approximately $40 million and return on funds employed (ROFE) at or above 15%.","filter_flag":1}
