{"title":"Start-ups set out to make coffee more sustainable - Financial Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2RiZmQ0M2NmLWE0MjEtNGUyOS05Yzc0LTczYzY1MzQyMjBlNtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2RiZmQ0M2NmLWE0MjEtNGUyOS05Yzc0LTczYzY1MzQyMjBlNtIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2RiZmQ0M2NmLWE0MjEtNGUyOS05Yzc0LTczYzY1MzQyMjBlNtIBAA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2RiZmQ0M2NmLWE0MjEtNGUyOS05Yzc0LTczYzY1MzQyMjBlNtIBAA?oc=5\" target=\"_blank\">Start-ups set out to make coffee more sustainable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Start-ups set out to make coffee more sustainable - Financial Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2RiZmQ0M2NmLWE0MjEtNGUyOS05Yzc0LTczYzY1MzQyMjBlNtIBAA?oc=5\" target=\"_blank\">Start-ups set out to make coffee more sustainable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Times<\/font>","source.href":"https:\/\/www.ft.com","source.title":"Financial Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Print this page Coffee is a versatile drink: a stimulant, a social catalyst, a source of endless debate about roasts and terroir for coffee snobs. But, in Colombia, the world’s third-largest producer, it has found yet another use: as a building material. Thanks to Bogotá-based construction firm Woodpecker, which turns husks left over from coffee production into building boards, nearly 70,000 people now live or study inside homes and schools made from coffee waste. Woodpecker is not alone in trying to harness the potential of by-products from one of the world’s favourite drinks. As global caffeine levels go from high to stratospheric, start-ups around the world are proposing solutions for the sector’s growing waste problem. Some 3bn cups of coffee are drunk around the world every day and demand is surging. Consumption has doubled since the 1990s as burgeoning middle classes in countries such as India and Indonesia have increased their intake. China had one Starbucks outlet in 1999; now it is on track to have 9,000 by 2025. This generates a lot of waste: each year, millions of tonnes of methane-generating spent coffee grounds go to landfill, along with many of the disposable cups used by coffee outlets. Further up the supply chain, the processing of coffee berries into beans creates farm waste — in the form of husks, pulp, and contaminated water. New ways of packaging coffee — such as the aluminium cartridges that have helped turn it from a commodity into a luxury product in rich countries — only create new streams of waste. Sales of Nestlé’s Nespresso pods were boosted by the Covid-19 pandemic but, while the company encourages recycling, it also says that this happens to only about a third of the pods it produces. This year, Nespresso rolled out compostable pods in France and Switzerland, although Guillaume Le Cunff, the coffee-maker’s chief executive, insists that both the aluminium and biodegradable versions are “absolutely sustainable”. “The more choice we bring, the more chance we have to embrace circularity,” he says, adding that other methods of making coffee, such as in cafetières, often use water and ground beans less precisely than pod machines, leading to greater carbon emissions — a point supported by a recent study. Ready for recycling? New ways of consuming coffee create new streams of waste © Getty Images Le Cunff is not alone in emphasising circularity. The climate and biodiversity crises — and the associated pressure from investors to meet more stringent environmental, social and governance (ESG) criteria — are pushing industries worldwide to explore circular economy principles, which aim to eliminate waste from economic systems. In September, the International Coffee Organization, a trade body, announced the creation of a Center for Circular Economy in Coffee. Based in Turin, its goal is “accelerating the circular transition in the coffee supply chain”. Vanúsia Nogueira, the ICO’s executive director, says that “fostering circular economy solutions will help . . . [transform] waste into new job and income opportunities”. In Woodpecker’s case, the opportunity is to make a lightweight, easily transportable material that can be used for construction in remote areas of Colombia — meeting demand for social housing. After experimenting with different types of natural fibre, it settled on a composite of coffee husks — of which there is a plentiful supply in Colombia — and plastic, as these offer the qualities it seeks. “Coffee husks give you the strength . . . while the plastic gives you the durability,” explains chief executive Alejandro Franco. The firm’s colourful houses are certified as earthquake safe, he adds. “The lighter the construction, the more it dances with an earthquake.” Other companies are starting from the opposite end of the coffee life cycle: with spent grounds. In Germany’s capital, Berlin, for example, Kaffeeform is taking an elegantly circular approach, turning coffee grounds into reusable cups. According to chief executive and founder Julian Nachtigall-Lechner, cafés — which would normally pay a fee to dispose of their grounds — are happy to hand them over instead to Kaffeeform’s fleet of cyclists, who bring them to a processing hub in the middle of the city. Only 10 per cent of the $200bn generated annually by the coffee industry stays in producing countries There, they are turned into new products — including cups that end up back in the very cafés that supplied the raw materials. It is a “good story” for Berlin’s hipster coffee shops to tell their customers, says Nachtigall-Lechner. The coffee industry’s sustainability challenges extend beyond waste, however. Coffee consumption is expected to double by 2050, with growth particularly strong in Asia and Africa. But rising temperatures are slashing yields and threatening to render up to half of the world’s current coffee farmland unusable. Growers, many of whom are in poor countries, are struggling to make a living. Only 10 per cent of the $200bn generated annually by the industry stays in producing countries. At the same time, coffee production is driving deforestation. It is one of the commodities targeted by new EU rules banning the import of products linked to deforestation from the end of next year. All of this casts doubt on whether the sector can meet increasing demand. Cole Shephard, founder of US-based start-up the Green Coffee Company, says the current supply chain model must be overhauled to create a system that is sustainable and profitable. While most producers source from a patchwork of smallholders via middlemen, Green Coffee, which operates in Colombia, controls the whole supply chain, allowing it to pay growers more and to embrace a circular economy model that, it says, generates bigger profits. The firm, which closed a $25mn series C equity fundraising round in June, is developing ways to turn pulp from coffee processing into a range of products, including fertiliser and flour. It will also ferment the pulp to produce ethanol. Most coffee is grown by farmers who have less than one hectare, so trying to amass pulp from them would be a long and cumbersome process — not what is needed for ethanol production at scale. So Green Coffee, which describes itself as Colombia’s largest producer, now owns around 4,000 hectares and has nearly 14mn trees, enabling it to centralise this process. The start-up has poured $8mn into building a distillery, which will deliver a return on investment of 18 months, says chief executive Boris Wüllner. Once it is up and running, the firm will produce 12,000 litres of pure ethanol a day, he says. Green Coffee is always trying to see “how we can take the garbage from the farm” and use it to “make a profit” to give back to investors, says Wüllner. “That’s our circular economy approach.”","filter_flag":1}
{"title":"ESGL Holdings Limited (NASDAQ: ESGL) Announces Multi-Year Contract Renewal with Singapore Refining Company ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiwgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMS8yNy8yNzg2NTE0LzAvZW4vRVNHTC1Ib2xkaW5ncy1MaW1pdGVkLU5BU0RBUS1FU0dMLUFubm91bmNlcy1NdWx0aS1ZZWFyLUNvbnRyYWN0LVJlbmV3YWwtd2l0aC1TaW5nYXBvcmUtUmVmaW5pbmctQ29tcGFueS1Qcml2YXRlLUxpbWl0ZWQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiwgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMS8yNy8yNzg2NTE0LzAvZW4vRVNHTC1Ib2xkaW5ncy1MaW1pdGVkLU5BU0RBUS1FU0dMLUFubm91bmNlcy1NdWx0aS1ZZWFyLUNvbnRyYWN0LVJlbmV3YWwtd2l0aC1TaW5nYXBvcmUtUmVmaW5pbmctQ29tcGFueS1Qcml2YXRlLUxpbWl0ZWQuaHRtbNIBAA?oc=5","id":"CBMiwgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMS8yNy8yNzg2NTE0LzAvZW4vRVNHTC1Ib2xkaW5ncy1MaW1pdGVkLU5BU0RBUS1FU0dMLUFubm91bmNlcy1NdWx0aS1ZZWFyLUNvbnRyYWN0LVJlbmV3YWwtd2l0aC1TaW5nYXBvcmUtUmVmaW5pbmctQ29tcGFueS1Qcml2YXRlLUxpbWl0ZWQuaHRtbNIBAA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiwgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMS8yNy8yNzg2NTE0LzAvZW4vRVNHTC1Ib2xkaW5ncy1MaW1pdGVkLU5BU0RBUS1FU0dMLUFubm91bmNlcy1NdWx0aS1ZZWFyLUNvbnRyYWN0LVJlbmV3YWwtd2l0aC1TaW5nYXBvcmUtUmVmaW5pbmctQ29tcGFueS1Qcml2YXRlLUxpbWl0ZWQuaHRtbNIBAA?oc=5\" target=\"_blank\">ESGL Holdings Limited (NASDAQ: ESGL) Announces Multi-Year Contract Renewal with Singapore Refining Company ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ESGL Holdings Limited (NASDAQ: ESGL) Announces Multi-Year Contract Renewal with Singapore Refining Company ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiwgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMS8yNy8yNzg2NTE0LzAvZW4vRVNHTC1Ib2xkaW5ncy1MaW1pdGVkLU5BU0RBUS1FU0dMLUFubm91bmNlcy1NdWx0aS1ZZWFyLUNvbnRyYWN0LVJlbmV3YWwtd2l0aC1TaW5nYXBvcmUtUmVmaW5pbmctQ29tcGFueS1Qcml2YXRlLUxpbWl0ZWQuaHRtbNIBAA?oc=5\" target=\"_blank\">ESGL Holdings Limited (NASDAQ: ESGL) Announces Multi-Year Contract Renewal with Singapore Refining Company ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"SINGAPORE, Nov. 27, 2023 (GLOBE NEWSWIRE) -- Environmental Solutions Group Holdings Limited (NASDAQ: ESGL) (“ESGL” or the “Company”), a leading carbon neutral, innovative enviro-tech company regenerating industrial waste into circular products, today announced a multi-year contract renewal with Singapore Refining Company Private Limited (“SRC”). On November 15, 2023, Environmental Solutions (Asia) Pte Ltd, a wholly owned subsidiary of ESGL, renewed its Used Catalyst Disposal Contract with SRC. Under the contract, ESGL will continue to provide used catalyst waste disposal services to SRC through December 31, 2025. In response to the contract renewal, Mr. Quek stated, \"SRC is an important customer to ESGL. We are delighted to continue to collaborate with the petrochemical industry to bring circular economy solutions. The renewal for 2 years is a testament to the Company's strategy, execution, and long-term potential with the support of our long term partners like SRC.\" About ESGL Holdings Limited ESGL Holdings Limited (“ESGL”) is a holding company incorporated as an exempted company under the laws of the Cayman Islands. At the forefront of driving sustainable waste management solutions, ESGL is dedicated to revolutionizing waste transformation with an emphasis on innovative technology and a commitment to preserving the environment. ESGL conducts all its operations through its operating entity incorporated in Singapore, Environmental Solutions (Asia) Pte. Ltd. For more information, including the Company’s filings with the SEC, please visit https:\/\/esgl.asia. About Singapore Refining Company Private Limited Singapore Refining Company Private Limited (SRC) is a joint venture between Singapore Petroleum Company Limited and Chevron Singapore Pte. Ltd. Located on Jurong Island, the petrochemical hub of Singapore, SRC operates a refinery that is capable of processing 290,000 barrels of crude oil per day to produce fuel products and chemical feedstocks that are supplied to domestic markets and overseas export markets under the brand labels of its shareholders. Forward-Looking Statements Certain statements in this press release may be considered to contain certain “forward-looking statements” within the meaning of “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as: “target,” “believe,” “expect,” “will,” “shall,” “may,” “anticipate,” “estimate,” “would,” “positioned,” “future,” “forecast,” “intend,” “plan,” “project” and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. Examples of forward-looking statements include, among others, statements made in this press release regarding anticipated future financial and operating performance and results, including estimates for growth, gross margins, adjusted EBITDA, potential regional expansion, development of new products, partnerships, customer relationships, demand for waste processing, and sales of circular products. Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on ESGL management’s current beliefs, expectations, and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks, and changes in circumstances that are difficult to predict and many of which are outside of our control. Actual results and outcomes may differ materially from those indicated in the forward-looking statements. Therefore, you should not rely on any of these forward-looking statements. A further list and description of risks and uncertainties can be found in documents filed with the Securities and Exchange Commission (“SEC”) by ESGL and other documents that the Company may file or furnish with the SEC, which you are encouraged to read. Any forward-looking statement made by us in this press release is based only on information currently available to the Company and speaks only as of the date on which it is made. The Company undertakes no obligation to publicly update any forward-looking statement, whether written or oral, that may be made from time to time, whether as a result of new information, future developments, or otherwise, except as required by law. Investor Contact Crocker Coulson, CEO, AUM Media +1 (646) 652-7185 crocker.coulson@aummedia.org Company Contact ir@esgl.asia","filter_flag":1}
{"title":"Reboxed® secures £1.6 million Seed investment led by ACF Investors - UK Tech Investment News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnVrdGVjaG5ld3MuaW5mby8yMDIzLzExLzIxL3JlYm94ZWQtc2VjdXJlcy0xLTYtbWlsbGlvbi1zZWVkLWludmVzdG1lbnQtbGVkLWJ5LWFjZi1pbnZlc3RvcnMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnVrdGVjaG5ld3MuaW5mby8yMDIzLzExLzIxL3JlYm94ZWQtc2VjdXJlcy0xLTYtbWlsbGlvbi1zZWVkLWludmVzdG1lbnQtbGVkLWJ5LWFjZi1pbnZlc3RvcnMv0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LnVrdGVjaG5ld3MuaW5mby8yMDIzLzExLzIxL3JlYm94ZWQtc2VjdXJlcy0xLTYtbWlsbGlvbi1zZWVkLWludmVzdG1lbnQtbGVkLWJ5LWFjZi1pbnZlc3RvcnMv0gEA","guidislink":false,"published":"Tue, 21 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=325, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnVrdGVjaG5ld3MuaW5mby8yMDIzLzExLzIxL3JlYm94ZWQtc2VjdXJlcy0xLTYtbWlsbGlvbi1zZWVkLWludmVzdG1lbnQtbGVkLWJ5LWFjZi1pbnZlc3RvcnMv0gEA?oc=5\" target=\"_blank\">Reboxed® secures £1.6 million Seed investment led by ACF Investors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UK Tech Investment News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Reboxed® secures £1.6 million Seed investment led by ACF Investors - UK Tech Investment News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnVrdGVjaG5ld3MuaW5mby8yMDIzLzExLzIxL3JlYm94ZWQtc2VjdXJlcy0xLTYtbWlsbGlvbi1zZWVkLWludmVzdG1lbnQtbGVkLWJ5LWFjZi1pbnZlc3RvcnMv0gEA?oc=5\" target=\"_blank\">Reboxed® secures £1.6 million Seed investment led by ACF Investors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">UK Tech Investment News<\/font>","source.href":"https:\/\/www.uktechnews.info","source.title":"UK Tech Investment News","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular economy solutions\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"London, UK, 21 November 2023: Reboxed®, a sustainable tech startup with a mission to help solve the e-waste crisis by rehoming 100 million electronic devices by 2030, has secured £1.6 million in seed funding led by ACF Investors. Founded in 2020 during the first Covid lockdown by friends Phil Kemish and Matt Thorne, Reboxed provides out-of-the-box solutions for retailers and businesses to accelerate the move to a circular economy. The company will use the funds to drive growth and further develop its retail partner programmes and Reboxed for business service. Technology consumption generates more than 50 million tonnes of e-waste every year, with each new device creating an average carbon footprint equivalent to 79kg of CO2. Consumers and retailers are increasingly turning to recommerce solutions to cut down CO2 emissions, with 22 million people in Britain considering buying a refurbished phone. Reboxed® has built a leading brand and recommerce platform connecting businesses and customers with a better and more sustainable way to buy and sell technology. It offers premium refurbished and pre-owned devices including phones, laptops, tablets and smart watches through a “like new” experience that focuses on quality, consistency and a genuinely circular approach. The company has rapidly grown by enabling clients in the telecom sector such as Three Mobile launch a refurbished technology offering to customers of SMARTY, its sim-only brand, without having to invest in the infrastructure. Reboxed’s historic investors include Ali-A, a YouTuber with over 20 Million subscribers, ex-founders of Mazuma and Envirophone, Martin McCourt ex-CEO of Dyson, Nick Beighton ex-CEO of ASOS, and the Ministry Of Sound group. Phil Kemish, Co-founder and CEO of Reboxed® said: “We want to give everyone access to high quality, great value tech, with a flexible, hassle-free experience. Mounting ESG pressures means that businesses are looking for integrated solutions that will help them achieve their climate goals. Reboxed’s sustainable services help businesses do just that. This latest investment will be used to expand our growing team, build out our technology stack and scale the brand.” Tim Mills, Managing Partner, ACF Investors: “Awareness of the need for sustainability is fundamentally changing the retail landscape and driving a trend toward more responsible consumption. Recommerce is leading the way and is now growing 11 times faster than traditional retail. But too often the price of sustainability is an unnecessarily compromised customer experience, hence we are delighted to be backing the Reboxed team as they shift the benchmark and for the first time give UK consumers access to premium “like new” products, with all the benefits of recommerce.” ENDS About Reboxed® Reboxed® is a B2B2C and B2B recommerce platform that gives out of the box solutions for retailers and businesses to accelerate the move to a circular economy. Reboxed® embed their branded solutions with trusted partners to distribute to their customers or employees, enabling them to instantly launch a branded sustainable technology category. Reboxed® has partnered with retailers such as SMARTY (part of Three Mobile), Lebara Mobile and Airtime rewards to scale circular economy solutions for consumer electronics. About ACF Investors www.acfinvestors.com Launched in 2011, ACF Investors (formerly the Angel CoFund) is a privately managed and commercially focused venture capital fund that works alongside sector smart business angels to invest in high-potential SMEs across the UK, directly providing funding to support exceptional businesses. To date, ACF Investors has supported 117 companies, including such names as Ebury, Gousto, Creo Medical, and Form3, providing more than £75 million in direct investment alongside more than £450 million from business angels and other investors, making it one of the most active early-stage investors in the country.","filter_flag":1}
