{"title":"Mott Corporation Announces New Facility, 100+ New Jobs to Expand Clean Energy Business - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vdHQtY29ycG9yYXRpb24tYW5ub3VuY2VzLW5ldy1mYWNpbGl0eS0xMDAtbmV3LWpvYnMtdG8tZXhwYW5kLWNsZWFuLWVuZXJneS1idXNpbmVzcy0zMDE3NTM2NTQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vdHQtY29ycG9yYXRpb24tYW5ub3VuY2VzLW5ldy1mYWNpbGl0eS0xMDAtbmV3LWpvYnMtdG8tZXhwYW5kLWNsZWFuLWVuZXJneS1idXNpbmVzcy0zMDE3NTM2NTQuaHRtbNIBAA?oc=5","id":"CBMijAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vdHQtY29ycG9yYXRpb24tYW5ub3VuY2VzLW5ldy1mYWNpbGl0eS0xMDAtbmV3LWpvYnMtdG8tZXhwYW5kLWNsZWFuLWVuZXJneS1idXNpbmVzcy0zMDE3NTM2NTQuaHRtbNIBAA","guidislink":false,"published":"Wed, 22 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=53, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vdHQtY29ycG9yYXRpb24tYW5ub3VuY2VzLW5ldy1mYWNpbGl0eS0xMDAtbmV3LWpvYnMtdG8tZXhwYW5kLWNsZWFuLWVuZXJneS1idXNpbmVzcy0zMDE3NTM2NTQuaHRtbNIBAA?oc=5\" target=\"_blank\">Mott Corporation Announces New Facility, 100+ New Jobs to Expand Clean Energy Business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mott Corporation Announces New Facility, 100+ New Jobs to Expand Clean Energy Business - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21vdHQtY29ycG9yYXRpb24tYW5ub3VuY2VzLW5ldy1mYWNpbGl0eS0xMDAtbmV3LWpvYnMtdG8tZXhwYW5kLWNsZWFuLWVuZXJneS1idXNpbmVzcy0zMDE3NTM2NTQuaHRtbNIBAA?oc=5\" target=\"_blank\">Mott Corporation Announces New Facility, 100+ New Jobs to Expand Clean Energy Business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"FARMINGTON, Conn., Feb. 22, 2023 \/PRNewswire\/ -- Mott Corporation announced today that it is opening a new 65,000 square foot facility near its headquarters in Farmington, which will house at least 100 new, local employees helping to grow its clean energy business. The new facility will double Mott's production capacity for its custom-designed engineering solutions, and the total investment will be tens of millions of dollars over the coming years. CT Governor Ned Lamont, Senator Richard Blumenthal, Representative Jahana Hayes, Mott President & CEO Boris Levin, Mott BOD JP Van Rooy Mott is a global leader in producing ultra-thin, porous metal sheets, which are a critical component in the generation of green hydrogen, a low-emission fuel that will be essential for the world's energy transition. Global demand for hydrogen is expected to increase fivefold by 2050, yet less than 5% of the world's hydrogen is produced sustainably. Mott's titanium Porous Transport Layers (PTLs) are the thinnest in the world, allowing for the most efficient and cost-effective production of green hydrogen. \"This investment will bolster Connecticut's role as a home for innovation in clean energy, one of the fastest-growing industries there is,\" said Boris Levin, CEO of Mott Corporation. \"Mott has pioneered unique technology that the world's leading energy producers need to generate green hydrogen, and the new facility will dramatically expand our production capacity. We're able to do that in part because, as an employee-owned company, we're able to recruit the best talent – and give our employees a share in our success. I'm very grateful to Governor Lamont, Senator Blumenthal, and all of our elected officials for advocating for cutting-edge companies like ours that are growing and creating jobs in Connecticut.\" \"Mott is helping lead Connecticut's growth as an advanced manufacturing hub, and creating jobs for our communities,\" said Governor Ned Lamont. \"We are proud to celebrate Mott's expansion and are committed to supporting advanced manufacturing in our state.\" \"The expansion of Mott Corporation is an enormous win for Connecticut and for bringing manufacturing jobs back to the U.S.,\" said Senator Richard Blumenthal. \"This new facility will bolster production of clean energy technology – helping lead the transition away from fossil fuels – and add over 100 jobs to our advanced manufacturing workforce. I am proud to join Mott in this celebration and will continue to advocate for funding to support their growth in our state.\" \"In Congress, we passed the CHIPS and Science Act and the Inflation Reduction Act to jump-start the workforce and bring manufacturing back to the United States,\" said Representative Jahana Hayes. \"I am pleased that the Mott Corporation is addressing the semiconductor supply issue and creating job opportunities that provide clean energy solutions in the Fifth District and Connecticut.\" About Mott Corporation Mott is a 100% employee-owned company, and it is one of the world's most innovative manufacturers, providing filtration and flow control solutions to cutting edge industries including semiconductor, clean energy, aerospace, and healthcare. Mott's engineered solutions help build and improve our technological world, with applications from satellites and cell phones to implantable medical devices and green hydrogen facilities. Media Contact: Mott Corporation, Patricia Cruickshanks, Marketing Manager, [email protected] SOURCE Mott Corporation","filter_flag":1}
{"title":"Exro Partners with Greentech Renewables SW to Bring Energy Storage Systems to Commercial Building Owners ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2V4cm8tcGFydG5lcnMtd2l0aC1ncmVlbnRlY2gtcmVuZXdhYmxlcy1zdy10by1icmluZy1lbmVyZ3ktc3RvcmFnZS1zeXN0ZW1zLXRvLWNvbW1lcmNpYWwtYnVpbGRpbmctb3duZXJzLWFjcm9zcy10aGUtdXNhLTMwMTc0MDExNS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2V4cm8tcGFydG5lcnMtd2l0aC1ncmVlbnRlY2gtcmVuZXdhYmxlcy1zdy10by1icmluZy1lbmVyZ3ktc3RvcmFnZS1zeXN0ZW1zLXRvLWNvbW1lcmNpYWwtYnVpbGRpbmctb3duZXJzLWFjcm9zcy10aGUtdXNhLTMwMTc0MDExNS5odG1s0gEA?oc=5","id":"CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2V4cm8tcGFydG5lcnMtd2l0aC1ncmVlbnRlY2gtcmVuZXdhYmxlcy1zdy10by1icmluZy1lbmVyZ3ktc3RvcmFnZS1zeXN0ZW1zLXRvLWNvbW1lcmNpYWwtYnVpbGRpbmctb3duZXJzLWFjcm9zcy10aGUtdXNhLTMwMTc0MDExNS5odG1s0gEA","guidislink":false,"published":"Tue, 07 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=38, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2V4cm8tcGFydG5lcnMtd2l0aC1ncmVlbnRlY2gtcmVuZXdhYmxlcy1zdy10by1icmluZy1lbmVyZ3ktc3RvcmFnZS1zeXN0ZW1zLXRvLWNvbW1lcmNpYWwtYnVpbGRpbmctb3duZXJzLWFjcm9zcy10aGUtdXNhLTMwMTc0MDExNS5odG1s0gEA?oc=5\" target=\"_blank\">Exro Partners with Greentech Renewables SW to Bring Energy Storage Systems to Commercial Building Owners ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Exro Partners with Greentech Renewables SW to Bring Energy Storage Systems to Commercial Building Owners ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2V4cm8tcGFydG5lcnMtd2l0aC1ncmVlbnRlY2gtcmVuZXdhYmxlcy1zdy10by1icmluZy1lbmVyZ3ktc3RvcmFnZS1zeXN0ZW1zLXRvLWNvbW1lcmNpYWwtYnVpbGRpbmctb3duZXJzLWFjcm9zcy10aGUtdXNhLTMwMTc0MDExNS5odG1s0gEA?oc=5\" target=\"_blank\">Exro Partners with Greentech Renewables SW to Bring Energy Storage Systems to Commercial Building Owners ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The agreement with Greentech Renewables Southwest positions Exro's Cell Driver™ Energy Storage System into Greentech's extensive sales channel for solar and EV charging applications Greentech Renewables Inc. is one of the largest distributors of renewable energy products in the United States with over 80 locations in major solar markets. The non-exclusive partnership will accelerate and amplify Exro's market presence by targeting Greentech's growing demand for energy storage in commercial and industrial applications as well as EV charging stations in the Southwestern U.S., one of the world's largest markets. Exro's Cell Driver ™ will occupy a central role in Greentech's portfolio for commercial and industrial applications, enhancing Greentech's offerings by providing a comprehensive storage solution to its diverse customer base in addition to its already established solar panel offerings. ™ Exro and Greentech's innovative storage solutions support the United States' leading clean energy initiatives, setting a new standard for quality, reliability, and affordability, and encouraging adoption to a sustainable electrified world in transportation and energy storage. CALGARY, AB, Feb. 7, 2023 \/PRNewswire\/ - Exro Technologies Inc. (TSX: EXRO) (OTCQB: EXROF) (the \"Company\" or \"Exro\"), a leading clean technology company that has developed new generation power control electronics that expand the capabilities of electric motors and batteries, is pleased to announce that it has entered into a channel partnership agreement (\"the agreement\") with Greentech Renewables Southwest (\"Greentech\"), a division of Consolidated Electrical Distributors (\"CED\") Greentech, one of the largest solar equipment distributors in the United States. The agreement aligns with Exro's targeted go-to-market strategy for its Cell Driver™ Energy Storage System (\"Cell Driver™\") product offering, partnering with leading clean energy integrators that provide expertise and scalability to amplify and accelerate market penetration to commercial and industrial (\"C&I\") customers. Greentech Renewables logo (CNW Group\/Exro Technologies Inc.) \"We are thrilled to welcome Greentech as our first U.S. partner as we build a network of leading integrators and customers that will support taking Cell Driver to market in the multi-billion dollar commercial and industrial space,\" said Exro CEO Sue Ozdemir. \"As one of the largest solar solutions providers in the U.S., Greentech is a highly reputable partner through which our Cell Driver can be marketed, sold, distributed, and serviced. Partnering allows Exro the operational and financial flexibility to focus on its core products. For our shareholders, the partnership provides visibility on one of the near-term pathways to revenue for our differentiated product offering in the under-serviced commercial and industrial sector in one of the largest solar markets in the world - the sun belt of the southwestern United States.\" Channel Partnership Agreement Framework The non-exclusive partnership will accelerate and amplify Exro's market presence, targeting Greentech's growing demand for energy storage in C&I applications as well as EV charging stations. The primary objectives for 2023 are to successfully introduce the Cell DriverTM product to Greentech's network of commercial integrators. These objectives are contemplated to be met in two phases beginning with the development of a joint sales and marketing plan, including a pilot project. Several sites are being evaluated for the pilot. The second phase of the agreement will see Greentech, along with its network of solar installers, providing a flexible product demand forecast on a rolling 12 and 24 month period over the 5-year term of the agreement. The energy storage system, consisting of Exro's Cell Driver™ integrated with Greentech's solar panel products and services, will be designed to serve as a flexible energy asset, a value-add that supports peak shaving and grid reliability, while also having potential applications for fully off-grid projects. For more on peak shaving visit: Load Shifting: What Is It and How Does It Work? (exro.com). Partnering with the Leader in Renewable Energy Solutions in the United States Greentech Renewables Southwest is a nation-wide distributor in the renewables industry, providing customers with the appropriate tools and informational resources to design, sell, and install energy storage solutions efficiently and cost-effectively. With over 80 locations in major solar markets in the U.S., Greentech offers extensive on-site inventory and logistics support in addition to financing, design, and engineering services, to meet the unique needs of its customer network of solar installers and developers. Exro's Cell Driver™ will occupy a central role in Greentech's portfolio for commercial and industrial applications. This will enhance Greentech's offerings by providing a comprehensive storage solution to its diverse customer base, in addition to its already established solar panel offerings. Exro's Cell Driver™ – The World's Safest and Most Advanced Energy Storage System Solar panels have one job: They collect energy from sunlight and transform it into electricity. But they can make that energy only when the sun is shining. That's why the ability to store solar energy for later use is important: It helps to keep the balance between electricity generation and demand. Simply put, a solar-plus-storage system is a battery system that is charged by a connected solar system. Many solar-energy system owners are looking at ways to connect their system to a battery so they can use that energy at night or in the event of a power outage. According to Bloomberg's NEF Global Energy Storage Market Report for 2022, the global market for stationary energy storage is forecast to reach US$125+ billion by 2030. Exro's Cell Driver™ is positioned to capture this rapidly expanding use case market for energy storage. With the global push towards sustainable clean energy solutions, the market outlook for stationary energy storage continues to grow. Stress on utility grids has resulted in rolling blackouts in places such as California, Texas, Arizona and more. These blackouts, combined with inflated peak rate charges for electricity, highlight the growing need for flexible backup energy storage solutions, particularly for commercial and industrial applications. The Exro Cell Driver™ provides an increased depth of control over battery cells, resulting in superior charging, deeper discharge rates, enhanced safety, and continuous operation. This enables commercial and industrial buildings to manage energy consumption, safeguard against grid outages, store energy produced on-site, and realize benefits through peak shaving and load shifting. Cell Driver™ is also equipped with Exro's proprietary Battery Control System™, that actively manages cells based on their State-of-Charge (SoC) and State-of-Health (SoH). This enables micro-protection mechanisms to electronically isolate faults, significantly reducing chances of thermal runaways, without any disruptions to system operation. Combined, the Exro Cell Driver™ confronts challenges facing the stationary energy storage market and also provides an optimal solution for influx of retired electric vehicle batteries with its active cell balancing functionalities by repurposing into a second life in stationary energy storage. Exro's Cell Driver™ remains on schedule to complete UL Certification in late Q2 2023 – certification required to connect to the power grid in North America. Product Inquiry Contact Please see link to the Exro's Cell Driver™ product catalog: Exro-Cell-Driver-Catalog.pdf Greentech is now accepting orders for Cell Driver™ for delivery in Q3 2023. Exro and Greentech Southwest will be offering technical and sales training on an ongoing basis to support product introduction to electrical and solar contractors. Interested parties may contact: Exro Technologies Livio Filice SVP Sales - Energy Storage [email protected] +1.905.929.7522 Greentech Renewables Southwest Cole Eaton Business Development - SW Division [email protected] +1.480.407-7100 ABOUT EXRO TECHNOLOGIES INC. Exro Technologies Inc. is a leading clean technology company that has developed new generation power control electronics that change how the world optimizes energy by expanding the capabilities of electric motors and batteries. The company's innovative technologies serve to bridge the performance-cost gap in e-mobility (Coil Driver™) and stationary energy storage (Cell Driver™), and act to accelerate adoption towards a circular electrified economy by delivering more with less – minimum energy for maximum results. For more information visit our website at www.exro.com. To view our Corporate Presentation visit us at www.exro.com\/investors Visit us on social media @exrotech. CAUTIONARY STATEMENT REGARDING FORWARD LOOKING STATEMENTS This news release contains forward-looking statements and forward-looking information (together, \"forward-looking statements\") within the meaning of applicable securities laws. All statements, other than statements of historical facts, are forward-looking statements. Generally, forward-looking statements can be identified by the use of terminology such as \"plans\", \"expects\", \"estimates\", \"intends\", \"anticipates\", \"believes\" or variations of such words, or statements that certain actions, events or results \"may\", \"could\", \"would\", \"might\", \"will be taken\", \"occur\" or \"be achieved\". Forward looking statements involve risks, uncertainties and other factors disclosed under the heading \"Risk Factors\" and elsewhere in the Company's filings with Canadian securities regulators, that could cause actual results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking statements. Although the Company believes that the assumptions and factors used in preparing these forward-looking statements are reasonable based upon the information currently available to management as of the date hereof, actual results and developments may differ materially from those contemplated by these statements. Readers are therefore cautioned not to place undue reliance on these statements, which only apply as of the date of this news release, and no assurance can be given that such events will occur in the disclosed times frames or at all. Except where required by applicable law, the Company disclaims any intention or obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. This information is qualified in its entirety by cautionary statements and risk factor disclosure contained in filings made by the Company with the Canadian securities regulators, including the Company's annual information form for the financial year ended December 31, 2021, and financial statements and related MD&A for the financial year ended December 31, 2021, filed with the securities regulatory authorities in certain provinces of Canada and available at www.sedar.com . Should one or more of these risks or uncertainties materialize, or should assumptions underlying the forward-looking information prove incorrect, actual results may vary materially from those described herein as intended, planned, anticipated, believed, estimated or expected. Although the Company has attempted to identify important risks, uncertainties and factors which could cause actual results to differ materially, there may be others that cause results not to be as anticipated, estimated or intended. The Company does not intend, and does not assume any obligation, to update this forward-looking information except as otherwise required by applicable law. Neither the Toronto Stock Exchange nor the Investment Industry Regulatory Organization of Canada accepts responsibility for the adequacy or accuracy of this press release. SOURCE Exro Technologies Inc.","filter_flag":1}
{"title":"Mopeka partners with Victron Energy - LP Gas - LP Gas magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmxwZ2FzbWFnYXppbmUuY29tL21vcGVrYS1wYXJ0bmVycy13aXRoLXZpY3Ryb24tZW5lcmd5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmxwZ2FzbWFnYXppbmUuY29tL21vcGVrYS1wYXJ0bmVycy13aXRoLXZpY3Ryb24tZW5lcmd5L9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmxwZ2FzbWFnYXppbmUuY29tL21vcGVrYS1wYXJ0bmVycy13aXRoLXZpY3Ryb24tZW5lcmd5L9IBAA","guidislink":false,"published":"Wed, 08 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=39, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmxwZ2FzbWFnYXppbmUuY29tL21vcGVrYS1wYXJ0bmVycy13aXRoLXZpY3Ryb24tZW5lcmd5L9IBAA?oc=5\" target=\"_blank\">Mopeka partners with Victron Energy - LP Gas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LP Gas magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mopeka partners with Victron Energy - LP Gas - LP Gas magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmxwZ2FzbWFnYXppbmUuY29tL21vcGVrYS1wYXJ0bmVycy13aXRoLXZpY3Ryb24tZW5lcmd5L9IBAA?oc=5\" target=\"_blank\">Mopeka partners with Victron Energy - LP Gas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LP Gas magazine<\/font>","source.href":"https:\/\/www.lpgasmagazine.com","source.title":"LP Gas magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Mopeka partners with Victron Energy Mopeka, a provider of sonar tank monitoring solutions and accessories, partnered with Victron Energy on the launch of Victron’s Venus OS v 2.90. Users of Cerbo GX and other Victron GX models can now wirelessly integrate with the MopekaIOT range of mobile and cloud sensors and monitor their water and propane usage within the GX environment using their GX device or remotely using any internet-connected device via their VRM Portal. The Mopeka Pro Check family of sonar sensors uses BLE (Bluetooth Low Energy), a wireless technology that allows devices to be networked within a range of about 10 meters while consuming less power compared to standard Bluetooth technology. The sensors feature ultrasonic sensing for water and LPG tanks in horizontal or vertical cylinders and mount to the bottom of those tanks by magnets. The liquid level, temperature and sensor battery voltage are streamed wirelessly to the GX device.","filter_flag":1}
{"title":"NextEra Energy is once again recognized as No. 1 in its industry on Fortune's list of 'World's Most Admired Companies' - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LWlzLW9uY2UtYWdhaW4tcmVjb2duaXplZC1hcy1uby0xLWluLWl0cy1pbmR1c3RyeS1vbi1mb3J0dW5lcy1saXN0LW9mLXdvcmxkcy1tb3N0LWFkbWlyZWQtY29tcGFuaWVzLTMwMTczNzg1MC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LWlzLW9uY2UtYWdhaW4tcmVjb2duaXplZC1hcy1uby0xLWluLWl0cy1pbmR1c3RyeS1vbi1mb3J0dW5lcy1saXN0LW9mLXdvcmxkcy1tb3N0LWFkbWlyZWQtY29tcGFuaWVzLTMwMTczNzg1MC5odG1s0gEA?oc=5","id":"CBMiqQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LWlzLW9uY2UtYWdhaW4tcmVjb2duaXplZC1hcy1uby0xLWluLWl0cy1pbmR1c3RyeS1vbi1mb3J0dW5lcy1saXN0LW9mLXdvcmxkcy1tb3N0LWFkbWlyZWQtY29tcGFuaWVzLTMwMTczNzg1MC5odG1s0gEA","guidislink":false,"published":"Thu, 02 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=33, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LWlzLW9uY2UtYWdhaW4tcmVjb2duaXplZC1hcy1uby0xLWluLWl0cy1pbmR1c3RyeS1vbi1mb3J0dW5lcy1saXN0LW9mLXdvcmxkcy1tb3N0LWFkbWlyZWQtY29tcGFuaWVzLTMwMTczNzg1MC5odG1s0gEA?oc=5\" target=\"_blank\">NextEra Energy is once again recognized as No. 1 in its industry on Fortune's list of 'World's Most Admired Companies'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NextEra Energy is once again recognized as No. 1 in its industry on Fortune's list of 'World's Most Admired Companies' - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25leHRlcmEtZW5lcmd5LWlzLW9uY2UtYWdhaW4tcmVjb2duaXplZC1hcy1uby0xLWluLWl0cy1pbmR1c3RyeS1vbi1mb3J0dW5lcy1saXN0LW9mLXdvcmxkcy1tb3N0LWFkbWlyZWQtY29tcGFuaWVzLTMwMTczNzg1MC5odG1s0gEA?oc=5\" target=\"_blank\">NextEra Energy is once again recognized as No. 1 in its industry on Fortune's list of 'World's Most Admired Companies'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"NextEra Energy ranked No. 1 in the electric and gas utilities industry and received the highest overall company scores across all industries in Florida JUNO BEACH, Fla., Feb. 2, 2023 \/PRNewswire\/ -- NextEra Energy, Inc. (NYSE: NEE) announced it has been named to Fortune's 2023 list of the \"World's Most Admired Companies\" and ranked No. 1 in the electric and gas utilities industry for the 16th time in 17 years. NextEra Energy, whose principal businesses are Florida Power & Light Company (FPL) and NextEra Energy Resources, LLC, also received the highest overall company scores across all industries in Florida. \"We are honored to be recognized again on Fortune's prestigious list as the leader within our industry,\" said John Ketchum, NextEra Energy chairman, president and chief executive officer. \"This recognition reflects our success in executing our long-term strategy of delivering low-cost clean energy solutions to our customers in Florida and across the nation, while giving back to the communities that we serve and generating value to our shareholders and all our stakeholders. Our team of 15,000 talented professionals work every day to identify ways to improve our business so that we can deliver even more value to our customers. With the hard work, perseverance and commitment to excellence of our employees, we are shaping how energy is produced and delivered while advancing a sustainable energy future.\" In the electric and gas utilities industry, NextEra Energy ranked No. 1 for six of the nine rated attributes, including innovation, people management, use of corporate assets, financial soundness, long-term investment value and quality of products\/services. Performance highlights for NextEra Energy include: Leading the world in wind, solar and battery storage energy – NextEra Energy is the world's largest generator of renewable energy from the wind and sun and a world leader in battery storage. NextEra Energy Resources continues to advance its position as the leading developer and operator of wind, solar and battery storage projects, adding more than 8,000 megawatts (MW) to its backlog in 2022. Also in 2022, FPL, the national leader in solar energy, placed approximately 450 MW of cost-effective solar in service, and began construction of the FPL Cavendish NextGen Hydrogen Hub – Florida's first-of-its-kind \"green hydrogen\" facility – which is scheduled to open later this year. – NextEra Energy is the world's largest generator of renewable energy from the wind and sun and a world leader in battery storage. NextEra Energy Resources continues to advance its position as the leading developer and operator of wind, solar and battery storage projects, adding more than 8,000 megawatts (MW) to its backlog in 2022. Also in 2022, FPL, the national leader in solar energy, placed approximately 450 MW of cost-effective solar in service, and began construction of the FPL Cavendish NextGen Hydrogen Hub – Florida's first-of-its-kind \"green hydrogen\" facility – which is scheduled to open later this year. Investing in American infrastructure – In 2022, NextEra Energy invested more than $19 billion in clean energy infrastructure, making NextEra Energy among the largest capital investors across any industry in the U.S. – In 2022, NextEra Energy invested more than in clean energy infrastructure, making NextEra Energy among the largest capital investors across any industry in the U.S. Providing outstanding value for shareholders – NextEra Energy outperformed the S&P 500 Index by nearly 10% in 2022. In terms of total shareholder return, NextEra Energy has outperformed the S&P 500 Index and the S&P 500 Utilities Index on a three, five-, 10- and 15-year basis. Over the past 15 years, NextEra Energy has outperformed nearly all of the other companies in the S&P 500 Utilities Index and more than tripled the average total shareholder return of the index. – NextEra Energy outperformed the S&P 500 Index by nearly 10% in 2022. In terms of total shareholder return, NextEra Energy has outperformed the S&P 500 Index and the S&P 500 Utilities Index on a three, five-, 10- and 15-year basis. Over the past 15 years, NextEra Energy has outperformed nearly all of the other companies in the S&P 500 Utilities Index and more than tripled the average total shareholder return of the index. Delivering clean, low-cost energy – NextEra Energy has one of the lowest emissions profiles of any utility in North America . In 2021, sulfur dioxide, nitrogen oxides and carbon dioxide rates were 98%, 74% and 51% lower, respectively, than the U.S. electric power sector average. In 2022, NextEra Energy announced Real Zero ™ , the most ambitious carbon-emissions-reduction goal ever set by an energy producer, seeking to eliminate carbon emissions from its operations by no later than 2045, while leveraging low-cost renewables to drive energy affordability for customers. A significant portion of NextEra Energy's plan to eliminate carbon emissions is designed to take place at FPL, which intends to achieve Real Zero across its operations at zero incremental cost for customers, relative to alternatives, and to keep FPL customer bills among the lowest in the country, just as they have been for more than a decade. – NextEra Energy has one of the lowest emissions profiles of any utility in . In 2021, sulfur dioxide, nitrogen oxides and carbon dioxide rates were 98%, 74% and 51% lower, respectively, than the U.S. electric power sector average. In 2022, NextEra Energy announced Real Zero , the most ambitious carbon-emissions-reduction goal ever set by an energy producer, seeking to eliminate carbon emissions from its operations by no later than 2045, while leveraging low-cost renewables to drive energy affordability for customers. A significant portion of NextEra Energy's plan to eliminate carbon emissions is designed to take place at FPL, which intends to achieve Real Zero across its operations at zero incremental cost for customers, relative to alternatives, and to keep FPL customer bills among the lowest in the country, just as they have been for more than a decade. Providing outstanding customer value – Consistently one of the nation's cleanest and most reliable electric utilities, FPL continues to deliver on its outstanding value proposition of low bills, high reliability, outstanding customer service and clean energy solutions for 5.8 million customers in Florida . In 2022, FPL's relentless focus on productivity and making smart capital investments for the benefit of customers helped keep residential customer bills the lowest among Florida investor-owned utilities and more than 30% below the national average. – Consistently one of the nation's cleanest and most reliable electric utilities, FPL continues to deliver on its outstanding value proposition of low bills, high reliability, outstanding customer service and clean energy solutions for 5.8 million customers in . In 2022, FPL's relentless focus on productivity and making smart capital investments for the benefit of customers helped keep residential customer bills the lowest among Florida investor-owned utilities and more than 30% below the national average. Providing outstanding reliability – FPL was recognized in 2022 for the seventh time in eight years as being the most reliable electric utility in the nation. Last year, FPL delivered its best-ever service reliability and was named a recipient of the ReliabilityOne ™ National Reliability Excellence Award. The prestigious award, presented by PA Consulting, reflects FPL's continued focus on customer service, technology deployment, operational successes and data analytics. – FPL was recognized in 2022 for the seventh time in eight years as being the most reliable electric utility in the nation. Last year, FPL delivered its best-ever service reliability and was named a recipient of the ReliabilityOne National Reliability Excellence Award. The prestigious award, presented by PA Consulting, reflects FPL's continued focus on customer service, technology deployment, operational successes and data analytics. Responding to unprecedented natural disasters – In 2022, FPL responded to two major storms in Florida with hurricanes Ian and Nicole. Hurricane Ian made landfall as a high-end category 4 hurricane and one of the most powerful and destructive storms ever to make landfall in the continental U.S. Yet, with significant preparation and valuable storm-hardening investments, FPL restored service to about two-thirds of the more than 2.1 million affected customers after the first full day of restoration, the fastest restoration rate in FPL's history for a major hurricane. Within eight days, FPL had restored service to essentially all FPL customers who were able to safely accept power. View the complete results for Fortune's 2023 list of the \"World's Most Admired Companies.\" NextEra Energy, Inc. NextEra Energy, Inc. (NYSE: NEE) is a leading clean energy company headquartered in Juno Beach, Florida. NextEra Energy owns Florida Power & Light Company, which is America's largest electric utility that sells more power than any other utility, providing clean, affordable, reliable electricity to approximately 5.8 million customer accounts, or more than 12 million people across Florida. NextEra Energy also owns a competitive clean energy business, NextEra Energy Resources, LLC, which, together with its affiliated entities, is the world's largest generator of renewable energy from the wind and sun and a world leader in battery storage. Through its subsidiaries, NextEra Energy generates clean, emissions-free electricity from seven commercial nuclear power units in Florida, New Hampshire and Wisconsin. NextEra Energy has been recognized often by third parties for its efforts in sustainability, corporate responsibility, ethics and compliance, and diversity. NextEra Energy is ranked No. 1 in the electric and gas utilities industry on Fortune's 2023 list of \"World's Most Admired Companies,\" recognized on Fortune's 2021 list of companies that \"Change the World\" and received the S&P Global Platts 2020 Energy Transition Award for leadership in environmental, social and governance. For more information about NextEra Energy companies, visit these websites: www.NextEraEnergy.com, www.FPL.com, www.NextEraEnergyResources.com. SOURCE NextEra Energy, Inc.","filter_flag":1}
{"title":"Masdar Makes Strategic Investment in One of the World's Largest Geothermal Players, Growing Clean Energy Portfolio ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hc2Rhci1tYWtlcy1zdHJhdGVnaWMtaW52ZXN0bWVudC1pbi1vbmUtb2YtdGhlLXdvcmxkcy1sYXJnZXN0LWdlb3RoZXJtYWwtcGxheWVycy1ncm93aW5nLWNsZWFuLWVuZXJneS1wb3J0Zm9saW8tMzAxNzU1NDQxLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hc2Rhci1tYWtlcy1zdHJhdGVnaWMtaW52ZXN0bWVudC1pbi1vbmUtb2YtdGhlLXdvcmxkcy1sYXJnZXN0LWdlb3RoZXJtYWwtcGxheWVycy1ncm93aW5nLWNsZWFuLWVuZXJneS1wb3J0Zm9saW8tMzAxNzU1NDQxLmh0bWzSAQA?oc=5","id":"CBMiqAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hc2Rhci1tYWtlcy1zdHJhdGVnaWMtaW52ZXN0bWVudC1pbi1vbmUtb2YtdGhlLXdvcmxkcy1sYXJnZXN0LWdlb3RoZXJtYWwtcGxheWVycy1ncm93aW5nLWNsZWFuLWVuZXJneS1wb3J0Zm9saW8tMzAxNzU1NDQxLmh0bWzSAQA","guidislink":false,"published":"Fri, 24 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=55, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hc2Rhci1tYWtlcy1zdHJhdGVnaWMtaW52ZXN0bWVudC1pbi1vbmUtb2YtdGhlLXdvcmxkcy1sYXJnZXN0LWdlb3RoZXJtYWwtcGxheWVycy1ncm93aW5nLWNsZWFuLWVuZXJneS1wb3J0Zm9saW8tMzAxNzU1NDQxLmh0bWzSAQA?oc=5\" target=\"_blank\">Masdar Makes Strategic Investment in One of the World's Largest Geothermal Players, Growing Clean Energy Portfolio ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Masdar Makes Strategic Investment in One of the World's Largest Geothermal Players, Growing Clean Energy Portfolio ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hc2Rhci1tYWtlcy1zdHJhdGVnaWMtaW52ZXN0bWVudC1pbi1vbmUtb2YtdGhlLXdvcmxkcy1sYXJnZXN0LWdlb3RoZXJtYWwtcGxheWVycy1ncm93aW5nLWNsZWFuLWVuZXJneS1wb3J0Zm9saW8tMzAxNzU1NDQxLmh0bWzSAQA?oc=5\" target=\"_blank\">Masdar Makes Strategic Investment in One of the World's Largest Geothermal Players, Growing Clean Energy Portfolio ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Investment in Indonesian-based Pertamina Geothermal Energy marks Masdar's entry into geothermal energy Increases Masdar's footprint in the Asia-Pacific region and gives company access to second-largest geothermal market in the world Geothermal is a stable, dispatchable, clean renewable resource, which helps to balance intermittency of wind and solar ABU DHABI, UAE, Feb. 24, 2023 \/PRNewswire\/ -- Masdar, a global clean energy powerhouse, is entering the geothermal energy sector, through a strategic investment in Pertamina Geothermal Energy (PGE), one of the world's largest geothermal players. The investment marks Masdar's entry into geothermal energy, in the second-largest geothermal market in the world. Geothermal energy plant in Indonesia (PRNewsfoto\/Masdar) HE Dr Sultan Al Jaber, UAE Minister of Industry and Advanced Technology, and Chairman, Masdar, said, \"Achieving the 1.5C target set out in the Paris Accords will require humanity to leverage all sources of low-carbon energy, including sources that are currently under-utilized, like geothermal. Through its investment in PGE, Masdar is demonstrating its continuing commitment to Indonesia's energy transition and its support of one of the major focus areas of the upcoming COP28, which is to provide practical energy security solutions while reducing emissions.\" Ahmad Yuniarto, Chief Executive Officer, PGE, said, \"We look forward to working with Masdar in the areas which complement and grow further our capabilities to be a world class green energy company, with the largest geothermal capacity globally. We endeavor to develop 600 megawatts (MW) in additional installed capacity over the next five years to support Indonesia's renewable energy mix.\" Mohamed Jameel Al Ramahi, Chief Executive Officer, Masdar, said, \"Masdar's strategic investment in PGE will complement our already strong footprint in Indonesia, the world's second largest geothermal market. We are especially excited to add geothermal energy to our clean energy portfolio, a clean energy source that can deliver dispatchable power 24 hours a day, which further underscores our position as a global leader in delivering clean energy solutions that help drive the global energy transition.\" Indonesia has a goal of increasing its installed geothermal capacity from 2.8 gigawatts (GW) in 2022 to 6.2 GW by 2030. The Government is targeting net-zero emissions by 2060 and having renewables provide 23 percent of the energy mix by 2023. PGE has been operating geothermal facilities in Indonesia for the last 40 years, with a portfolio capacity exceeding 1.87 GW. Geothermal energy harnesses the heat generated within the Earth's core to provide a constant energy source, unlike solar or wind, which are intermittent in nature. Geothermal energy plants also have high-capacity factors, meaning they can run at maximum power for longer periods. These attributes mean geothermal energy could potentially play a significant role in the clean energy transition, helping nations with a high concentration of geothermal activity to reduce carbon emissions. The PGE investment is the latest in Masdar's ongoing effort to expand and increase its strategic partnerships in the Asia-Pacific region. Masdar is already developing the region's largest floating solar facility – the 145-MW Cirata Floating Solar PV Plant in Indonesia – and last year signed an agreement with Tuas Power, EDF Renewables, and PT Indonesia Power to explore development of up to 1.2 GW solar capacity in Indonesia for export to Singapore. Masdar recently announced a new shareholding structure and additional focus on green hydrogen, making it one of the largest clean energy companies of its kind. With a goal of achieving 100 GW renewable energy capacity and green hydrogen production of 1 million tonnes per annum annually by 2030, the new Masdar is a clean energy powerhouse that will spearhead the UAE's Net Zero by 2050 Strategic Initiative and drive the global energy transition. For more information please visit: http:\/\/www.masdar.ae and connect: facebook.com\/masdar.ae and twitter.com\/masdar About Masdar Abu Dhabi Future Energy Company (Masdar) is the UAE's clean energy champion and one of the largest companies of its kind in the world, advancing the development and deployment of renewable energy and green hydrogen technologies to address global sustainability challenges. Established in 2006, Masdar is today active in over 40 countries, helping them to achieve their clean energy objectives and advance sustainable development. Masdar is jointly owned by Abu Dhabi National Oil Company (ADNOC), Mubadala Investment Company (Mubadala), and Abu Dhabi National Energy Company (TAQA), and under this ownership the company is targeting a renewable energy portfolio capacity of at least 100 gigawatts (GW) by 2030 and an annual green hydrogen production capacity of up to 1 million tonnes by the same year. This material is distributed by Daniel J. Edelman, Inc. on behalf of Masdar. Additional information is available at the Department of Justice, Washington, DC. Photo - https:\/\/mma.prnewswire.com\/media\/2009443\/Masdar_Indonesia_Geothermal.jpg Logo - https:\/\/mma.prnewswire.com\/media\/1973446\/Masdar_Logo.jpg SOURCE Masdar","filter_flag":1}
{"title":"Highland Electric Fleets Appoints Brian Buccella as Chief Commercial Officer, Elevating its Bench of Mobility and ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMitwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpZ2hsYW5kLWVsZWN0cmljLWZsZWV0cy1hcHBvaW50cy1icmlhbi1idWNjZWxsYS1hcy1jaGllZi1jb21tZXJjaWFsLW9mZmljZXItZWxldmF0aW5nLWl0cy1iZW5jaC1vZi1tb2JpbGl0eS1hbmQtZW5lcmd5LWV4cGVydHMtMzAxNzUyMzExLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMitwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpZ2hsYW5kLWVsZWN0cmljLWZsZWV0cy1hcHBvaW50cy1icmlhbi1idWNjZWxsYS1hcy1jaGllZi1jb21tZXJjaWFsLW9mZmljZXItZWxldmF0aW5nLWl0cy1iZW5jaC1vZi1tb2JpbGl0eS1hbmQtZW5lcmd5LWV4cGVydHMtMzAxNzUyMzExLmh0bWzSAQA?oc=5","id":"CBMitwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpZ2hsYW5kLWVsZWN0cmljLWZsZWV0cy1hcHBvaW50cy1icmlhbi1idWNjZWxsYS1hcy1jaGllZi1jb21tZXJjaWFsLW9mZmljZXItZWxldmF0aW5nLWl0cy1iZW5jaC1vZi1tb2JpbGl0eS1hbmQtZW5lcmd5LWV4cGVydHMtMzAxNzUyMzExLmh0bWzSAQA","guidislink":false,"published":"Wed, 22 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=53, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpZ2hsYW5kLWVsZWN0cmljLWZsZWV0cy1hcHBvaW50cy1icmlhbi1idWNjZWxsYS1hcy1jaGllZi1jb21tZXJjaWFsLW9mZmljZXItZWxldmF0aW5nLWl0cy1iZW5jaC1vZi1tb2JpbGl0eS1hbmQtZW5lcmd5LWV4cGVydHMtMzAxNzUyMzExLmh0bWzSAQA?oc=5\" target=\"_blank\">Highland Electric Fleets Appoints Brian Buccella as Chief Commercial Officer, Elevating its Bench of Mobility and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Highland Electric Fleets Appoints Brian Buccella as Chief Commercial Officer, Elevating its Bench of Mobility and ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2hpZ2hsYW5kLWVsZWN0cmljLWZsZWV0cy1hcHBvaW50cy1icmlhbi1idWNjZWxsYS1hcy1jaGllZi1jb21tZXJjaWFsLW9mZmljZXItZWxldmF0aW5nLWl0cy1iZW5jaC1vZi1tb2JpbGl0eS1hbmQtZW5lcmd5LWV4cGVydHMtMzAxNzUyMzExLmh0bWzSAQA?oc=5\" target=\"_blank\">Highland Electric Fleets Appoints Brian Buccella as Chief Commercial Officer, Elevating its Bench of Mobility and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Former Bird and Segway executive moves from micromobility to electric school bus fleets to help scale equitable and accessible clean energy solutions BEVERLY, Mass., Feb. 22, 2023 \/PRNewswire\/ -- Highland Electric Fleets , the leading provider of fleet electrification-as-a-service, today appointed Brian Buccella as its new Chief Commercial Officer. An industry veteran in the mobility space, Buccella brings more than 20 years of business strategy, policy efforts, and market growth experience to Highland's team. As CCO, Buccella will oversee Highland's commercial efforts to help school districts, municipalities, and third-party fleet managers across the U.S. upgrade their diesel school bus fleets to electric. Highland Electric Fleets Chief Commercial Officer Brian Buccella Before joining Highland, Buccella served as SVP of Global Policy & Consumer Products at electric micromobility company Bird, spearheading strategic government partnerships and a robust consumer products portfolio. Before that, he served as VP of Business Development & Marketing at vehicle manufacturer Segway, where he was responsible for developing strategic partnerships, driving business development initiatives and supporting the expansion of the company's electric vehicle product portfolio. Now, Buccella will continue his work in transportation electrification by scaling Highland's business through a customer-first, data-driven approach. He will be at the helm of nurturing Highland's partnerships with federal agencies, state and local governments, school districts and dealer channels. \"Clean electric transportation is a critical element of a resilient, sustainable future. I'm excited to help Highland accelerate electric school bus deployment around the U.S. and Canada,\" said Buccella. \"With increasing interest in fleet electrification, it's a great time to join a fast-growing company in a dynamic sector that is making fleet electrification simpler, more affordable, and more accessible than ever.\" On top of serving as the finance engine spurring school bus fleet electrification, Highland is demonstrating idle electric school buses' largely untapped potential to boost communities' energy resilience. Since its founding in 2019, Highland has helped Montgomery County Public Schools (MCPS) in Maryland deploy the country's largest electric school bus fleet and was the first in the U.S. to use electric school buses in a commercial vehicle-to-grid (V2G) program, in Beverly, Massachusetts. \"Highland's achievements to date are a testament to the team we have built, and it is with immense pleasure that we welcome Brian to the company,\" said Highland CEO & founder Duncan McIntyre. \"With decades of experience in electric mobility, Brian has shepherded companies all the way from seed stage through IPO. We're thrilled to have an industry expert like him on board as Highland continues to grow.\" About Highland Electric Fleets Highland Electric Fleets is the leading provider of electrification-as-a-service for school districts, governments, and fleet operators in North America. Founded in 2019, Highland offers a unique suite of products that make it simple and affordable to upgrade to electric fleets today. Active in 30 states and Canada, Highland is responsible for the first use of electric school buses in a commercial vehicle-to-grid (V2G) program and the largest electric school bus project in the United States to date. To learn more, visit https:\/\/highlandfleets.com. Media contacts Mission Control Communications for Highland [email protected] SOURCE Highland Electric Fleets","filter_flag":1}
{"title":"KOHLER HERITAGE COLORS REVEALS ITS TWO TOP SHADES AT KBIS 2023 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMva29obGVyLWhlcml0YWdlLWNvbG9ycy1yZXZlYWxzLWl0cy10d28tdG9wLXNoYWRlcy1hdC1rYmlzLTIwMjMtMzAxNzM3OTcyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMva29obGVyLWhlcml0YWdlLWNvbG9ycy1yZXZlYWxzLWl0cy10d28tdG9wLXNoYWRlcy1hdC1rYmlzLTIwMjMtMzAxNzM3OTcyLmh0bWzSAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMva29obGVyLWhlcml0YWdlLWNvbG9ycy1yZXZlYWxzLWl0cy10d28tdG9wLXNoYWRlcy1hdC1rYmlzLTIwMjMtMzAxNzM3OTcyLmh0bWzSAQA","guidislink":false,"published":"Thu, 02 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=33, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMva29obGVyLWhlcml0YWdlLWNvbG9ycy1yZXZlYWxzLWl0cy10d28tdG9wLXNoYWRlcy1hdC1rYmlzLTIwMjMtMzAxNzM3OTcyLmh0bWzSAQA?oc=5\" target=\"_blank\">KOHLER HERITAGE COLORS REVEALS ITS TWO TOP SHADES AT KBIS 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"KOHLER HERITAGE COLORS REVEALS ITS TWO TOP SHADES AT KBIS 2023 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMva29obGVyLWhlcml0YWdlLWNvbG9ycy1yZXZlYWxzLWl0cy10d28tdG9wLXNoYWRlcy1hdC1rYmlzLTIwMjMtMzAxNzM3OTcyLmh0bWzSAQA?oc=5\" target=\"_blank\">KOHLER HERITAGE COLORS REVEALS ITS TWO TOP SHADES AT KBIS 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"KOHLER, Wis., Feb. 2, 2023 \/PRNewswire\/ -- Kohler Co. announced the results of the Kohler Heritage Colors voting campaign at a special reveal hosted February 1 in the Kohler booth at the Kitchen & Bath Industry Show 2023, Las Vegas. The two shades – Spring Green and Peachblow – were selected from Heritage Colors' original six shade palette and will be offered exclusively in limited quantities and while supplies last on some of Kohler's most iconic and best-selling designs. The limited edition collection will be available for purchase in Summer 2023 through Kohler Signature Stores and Kohler Experience Centers nationwide. Heritage Color Campaign activations will run throughout 2023 with multiple initiatives to continue the celebration of Kohler's color story. Kohler Historic Color-Spring Green Kohler Heritage Color-Peachblow The exclusive product designs include: Memoirs ® Two-Piece Concealed Toilet Two-Piece Concealed Toilet Memoirs 24\" Pedestal Lavatory or Console Table Artifacts ® Freestanding Bath with Heritage Colors Exterior, White Interior and Claw Feet available in Black, White or Chrome finishes Freestanding Bath with Heritage Colors Exterior, White Interior and Claw Feet available in Black, White or Chrome finishes San Souci ® One-Piece Skirted Toilet One-Piece Skirted Toilet Vox ® Rectangular Vessel with Deck Rectangular Vessel with Deck Farmstead® Kitchen Sink with Heritage Colors Exterior, White Enamel Interior and Exposed Legs The Heritage Colors reveal followed a lively panel discussion, \"In Celebration of Color,\" moderated by design expert and published author, Sophie Donelson, who was joined by color authorities and award-winning, multi-disciplinary designers, Jonathan Adler, Justina Blakeney, and Isabel Ladd. A special toast by Kohler Chair and Chief Executive Officer, David Kohler, closed the day's events. Heritage Colors, part of Kohler's 150th Anniversary celebration, honors the company's color story that has been almost a century in the making, with six curated shades hand-selected from the Kohler archives for the campaign. While the palette of Spring Green (1927-1944); Lavender (1927-1944); Peachblow (1934-1973); Sunrise (1953-1969); Avocado (1967-1979); and Pink Champagne (1973-1979), draws from some of Kohler's most colorful past introductions, the vintage colorways remain remarkably fresh and of-the-moment. Kohler Co., founded in 1873, began its 150th year of delivering first-to-market innovations with the Heritage Colors campaign, paying homage to an innovative movement within the Kohler design legacy and its introduction of vibrant, colorful products that began to great acclaim in 1927. This heralded moment created a cataclysmic shift within residential design, moving turn-of-the-century America away from the utilitarian white fixtures of the day by introducing color into bathrooms and kitchens – bringing warmth and personality into every home – and gracious living into everyday life. For more information on the Heritage Colors campaign, visit www.kohler.com\/forever-in-color. About Kohler Co. Founded in 1873 and headquartered in Kohler, Wisconsin, Kohler Co. is one of America's oldest and largest privately held companies comprised of more than 40,000 associates. With more than 50 manufacturing locations worldwide, Kohler is a global leader in the design, innovation and manufacture of kitchen and bath products; luxury cabinetry, tile and lighting; engines, generators, and clean energy solutions; and owner\/operator of two, five-star hospitality and golf resort destinations in Kohler, Wisconsin, and St. Andrews, Scotland. Kohler's Whistling Straits golf course recently hosted the 43rd Ryder Cup. The company also develops solutions to address pressing issues, such as clean water and sanitation, for underserved communities around the world to enhance the quality of life for current and future generations. For more details, please visit kohlercompany.com. CONTACT: Robin L. Richter Kohler Co. Public Relations Email: [email protected] SOURCE Kohler Co.","filter_flag":1}
{"title":"Top 20 Solar Electric Power Generation Companies In 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTIwLXNvbGFyLWVsZWN0cmljLWNvbXBhbmllcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTIwLXNvbGFyLWVsZWN0cmljLWNvbXBhbmllcy_SAQA?oc=5","id":"CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTIwLXNvbGFyLWVsZWN0cmljLWNvbXBhbmllcy_SAQA","guidislink":false,"published":"Sat, 25 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=25, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=56, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTIwLXNvbGFyLWVsZWN0cmljLWNvbXBhbmllcy_SAQA?oc=5\" target=\"_blank\">Top 20 Solar Electric Power Generation Companies In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 20 Solar Electric Power Generation Companies In 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTIwLXNvbGFyLWVsZWN0cmljLWNvbXBhbmllcy_SAQA?oc=5\" target=\"_blank\">Top 20 Solar Electric Power Generation Companies In 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Top 20 Solar Electric Power Generation companies in 2023 Solar electric power generation companies are companies that specialize in producing electricity from the sun through the use of photovoltaic (PV) panels or concentrating solar power (CSP) systems The solar electric power generation industry in India has seen significant growth in recent years. The Indian government has set a target of installing 100 gigawatts (GW) of solar capacity by 2022, which has driven growth in the sector. As of 2022, India has become one of the largest markets for solar power, with a total installed capacity of over 40 GW. The government has implemented various policies and incentives to support the growth of the industry, such as the Jawaharlal Nehru National Solar Mission, which aims to increase the use of solar energy in the country. Several Indian companies have emerged as key players in the solar power generation industry, including: Adani Green Energy Tata Power Solar Systems ReNew Power Hero Future Energies Azure Power ACME Solar Vikram Solar Jaiprakash Power Ventures IL&FS Energy Development Company AMP Energy Mahindra Susten SoftBank Energy L&T Infrastructure Development Projects JSW Energy Kolkata-based Sumant Sinha-led ReNew Power BHEL Suzlon Energy SunEdison Mytrah Energy Reliance Power These companies are involved in various aspects of the industry, including manufacturing, project development, engineering, procurement, construction (EPC) services, and operation and maintenance services. It’s worth noting that the solar energy sector in India is highly competitive, and rankings can change rapidly based on new developments and projects. Adani Green Energy Adani Green Energy Limited (AGEL) is a subsidiary of the Adani Group, one of India’s largest conglomerates. AGEL is a leading player in the Indian renewable energy sector and is focused on developing, building, owning, and operating utility-scale solar and wind power assets in India. The company has a target of achieving 25 GW of renewable energy capacity by 2025 and is well on its way to achieving this goal. As of 2022, Adani Green Energy had an installed capacity of over 10 GW, making it one of the largest renewable energy companies in India. The company is involved in various aspects of the renewable energy industry, including project development, engineering, procurement and construction (EPC) services, and operation and maintenance services. Adani Green Energy is committed to reducing India’s dependence on fossil fuels and promoting the use of clean, renewable energy. The company is contributing to the growth of the Indian renewable energy sector and is a key player in the country’s efforts to meet its renewable energy targets. Tata Power Solar Systems Tata Power Solar Systems Limited is a subsidiary of Tata Power, one of India’s largest integrated power companies. Tata Power Solar is a leading player in the Indian solar energy sector and has been involved in the industry for over three decades. The company is focused on the design, manufacture, and sale of solar photovoltaic (PV) modules and systems, as well as providing engineering, procurement, and construction (EPC) services for solar projects. Tata Power Solar has a strong reputation for quality and reliability and has supplied solar modules and systems to customers in more than 100 countries. In addition to its core business, Tata Power Solar is involved in various other aspects of the renewable energy sector, including project development, operation and maintenance, and energy storage. The company is committed to reducing the cost of solar energy and making it accessible to a wider range of customers. Tata Power Solar is playing a significant role in the growth of the Indian solar energy sector and is contributing to the country’s efforts to achieve its renewable energy targets. ReNew Power ReNew Power is a leading independent renewable energy company in India. The company was founded in 2011 and has since become one of the largest renewable energy companies in the country. ReNew Power is focused on developing, building, owning, and operating renewable energy assets, including wind and solar power. As of 2022, the company had a total installed capacity of over 10 GW, with a presence in 18 states in India. ReNew Power is committed to reducing India’s dependence on fossil fuels and promoting the use of clean, renewable energy. The company is contributing to the growth of the Indian renewable energy sector and is a key player in the country’s efforts to meet its renewable energy targets. In addition to its core business, ReNew Power is involved in various other aspects of the renewable energy sector, including project development, engineering, procurement and construction (EPC) services, and operation and maintenance services. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. ReNew Power has received several awards and recognition for its contributions to the renewable energy sector in India and is playing a significant role in the growth of the industry. Hero Future Energies Hero Future Energies is a subsidiary of Hero Group, one of India’s largest conglomerates. The company is focused on the development, construction, and operation of renewable energy assets, including wind and solar power. Hero Future Energies was founded in 2013 and has since become one of the largest renewable energy companies in India. As of 2022, the company had a total installed capacity of over 2 GW, with a presence in 13 states in India. The company is committed to reducing India’s dependence on fossil fuels and promoting the use of clean, renewable energy. Hero Future Energies is contributing to the growth of the Indian renewable energy sector and is a key player in the country’s efforts to meet its renewable energy targets. In addition to its core business, Hero Future Energies is involved in various other aspects of the renewable energy sector, including project development, engineering, procurement and construction (EPC) services, and operation and maintenance services. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. Hero Future Energies is playing a significant role in the growth of the Indian renewable energy sector and is committed to making clean energy accessible and affordable to customers in India. Azure Power Azure Power is a leading independent solar power producer in India. The company was founded in 2008 and has since become one of the largest renewable energy companies in the country. Azure Power is focused on developing, building, owning, and operating solar power assets in India. As of 2022, the company had a total installed capacity of over 4 GW, with a presence in 18 states in India. Azure Power is committed to reducing India’s dependence on fossil fuels and promoting the use of clean, renewable energy. The company is contributing to the growth of the Indian renewable energy sector and is a key player in the country’s efforts to meet its renewable energy targets. In addition to its core business, Azure Power is involved in various other aspects of the renewable energy sector, including project development, engineering, procurement and construction (EPC) services, and operation and maintenance services. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. Azure Power has received several awards and recognition for its contributions to the renewable energy sector in India and is playing a significant role in the growth of the industry. The company is committed to making clean energy accessible and affordable to customers in India and is dedicated to providing high-quality and reliable solar power solutions to its customers. ACME Solar ACME Solar is a leading independent renewable energy company in India. The company is focused on the development, construction, and operation of solar power assets in India and is one of the largest independent solar power producers in the country. As of 2022, the company had a total installed capacity of over 6 GW, with a presence in 17 states in India. ACME Solar is committed to reducing India’s dependence on fossil fuels and promoting the use of clean, renewable energy. The company is contributing to the growth of the Indian renewable energy sector and is a key player in the country’s efforts to meet its renewable energy targets. In addition to its core business, ACME Solar is involved in various other aspects of the renewable energy sector, including project development, engineering, procurement and construction (EPC) services, and operation and maintenance services. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. ACME Solar has received several awards and recognition for its contributions to the renewable energy sector in India and is playing a significant role in the growth of the industry. The company is committed to making clean energy accessible and affordable to customers in India and is dedicated to providing high-quality and reliable solar power solutions to its customers Vikram Solar Vikram Solar is a leading manufacturer and provider of solar photovoltaic (PV) products and services in India. The company was founded in 2006 and has since become one of the largest solar PV companies in the country. Vikram Solar specializes in the design, engineering, manufacturing, and installation of solar panels and other solar PV products. The company also provides various services, including project development, engineering, procurement, and construction (EPC) services, and operation and maintenance services. As of 2022, Vikram Solar has a strong presence in the Indian solar PV market and has a growing global presence, with operations in several countries. The company is committed to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. In addition to its core business, Vikram Solar is involved in various other aspects of the renewable energy sector, including research and development, product design, and manufacturing. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. Vikram Solar is dedicated to providing high-quality and reliable solar PV products and services to its customers and is playing a significant role in the growth of the Indian and global renewable energy sectors. Jaiprakash Power Ventures Jaiprakash Power Ventures Limited (JPVL) is an Indian power company that was established in 1994. The company is part of the Jaypee Group, which is one of the largest infrastructure companies in India. JPVL is involved in the development and operation of power generation and distribution projects in India. The company has a portfolio of thermal and hydropower plants with a total installed capacity of over 5 GW. In addition to its core business, JPVL is involved in various other aspects of the power sector, including project development, engineering, procurement and construction (EPC) services, and operation and maintenance services. JPVL has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. The company is committed to meeting the energy needs of India’s growing population and is dedicated to providing high-quality and reliable power solutions to its customers. As of 2022, JPVL is a leading player in the Indian power sector and is playing a significant role in the growth of the industry. The company is committed to reducing India’s dependence on fossil fuels and promoting the use of clean, renewable energy, and is actively involved in the development of renewable energy projects in the country. IL&FS Energy Development Company IL&FS Energy Development Company (IEDC) is a subsidiary of IL&FS, which is one of India’s largest infrastructure development and finance companies. IEDC was established in 1989 and is focused on the development of renewable energy projects in India. IEDC is involved in various aspects of the renewable energy sector, including project development, engineering, procurement and construction (EPC) services, and operation and maintenance services. The company has a strong presence in the Indian solar and wind energy markets and has developed several large-scale renewable energy projects in the country. As of 2022, IEDC had a total installed capacity of over 2 GW and was playing a significant role in the growth of the Indian renewable energy sector. The company is committed to reducing India’s dependence on fossil fuels and promoting the use of clean, renewable energy. In addition to its core business, IEDC is involved in various other aspects of the infrastructure development and finance sector, including project finance, infrastructure development, and asset management. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. IEDC is dedicated to providing high-quality and reliable renewable energy solutions to its customers and is committed to making clean energy accessible and affordable to people in India and around the world. AMP Energy AMP Energy is a renewable energy company that is focused on developing, building, and operating clean energy projects around the world. The company is part of the AMP Capital Group, which is one of the largest investment management firms in Asia-Pacific. AMP Energy specializes in the development of solar, wind, and energy storage projects and has a strong presence in several key markets, including India, Australia, and Europe. The company is committed to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. As of 2022, AMP Energy had a portfolio of several large-scale renewable energy projects and was playing a significant role in the growth of the global renewable energy sector. The company is dedicated to providing high-quality and reliable clean energy solutions to its customers and is committed to making renewable energy accessible and affordable to people around the world. In addition to its core business, AMP Energy is involved in various other aspects of the renewable energy sector, including research and development, product design, and manufacturing. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. Mahindra Susten Mahindra Susten is a subsidiary of the Mahindra Group, one of India’s largest conglomerates. The company was established in 2008 and is focused on the development, construction, and operation of renewable energy projects in India and around the world. Mahindra Susten specializes in the development of solar and energy storage projects and has a strong presence in several key markets, including India, the United States, and Europe. The company is committed to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. As of 2022, Mahindra Susten had a total installed capacity of over 1 GW and was playing a significant role in the growth of the Indian and global renewable energy sector. The company is dedicated to providing high-quality and reliable clean energy solutions to its customers and is committed to making renewable energy accessible and affordable to people around the world. In addition to its core business, Mahindra Susten is involved in various other aspects of the renewable energy sector, including research and development, product design, and manufacturing. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. SoftBank Energy SoftBank Energy is a subsidiary of SoftBank Group, a Japanese multinational conglomerate. The company was established in 2020 and is focused on the development, construction, and operation of renewable energy projects around the world. SoftBank Energy specializes in the development of solar and wind energy projects and has a strong presence in several key markets, including India, the United States, and Europe. The company is committed to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. As of 2022, SoftBank Energy had a total installed capacity of several GWs and was playing a significant role in the growth of the global renewable energy sector. The company is dedicated to providing high-quality and reliable clean energy solutions to its customers and is committed to making renewable energy accessible and affordable to people around the world. In addition to its core business, SoftBank Energy is involved in various other aspects of the renewable energy sector, including research and development, product design, and manufacturing. The company has a strong reputation for quality and innovation and is well-regarded by investors and customers alike. L&T Infrastructure Development Projects L&T Infrastructure Development Projects Limited (L&T IDPL) is a subsidiary of Larsen & Toubro Limited (L&T), one of India’s largest engineering and construction companies. L&T IDPL was established in 2009 and is focused on the development, construction, and operation of infrastructure projects, including renewable energy projects, in India and around the world. L&T IDPL specializes in the development of solar and wind energy projects and has a strong presence in several key markets, including India, the Middle East, and Africa. The company is committed to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. As of 2022, L&T IDPL had a total installed capacity of over 1 GW and was playing a significant role in the growth of the Indian and global renewable energy sector. The company is dedicated to providing high-quality and reliable clean energy solutions to its customers and is committed to making renewable energy accessible and affordable to people around the world. In addition to its core business, L&T IDPL is involved in various other aspects of the infrastructure sector, including the development of roads, bridges, ports, and airports. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. JSW Energy JSW Energy is a subsidiary of JSW Group, one of India’s largest conglomerates. The company was established in 1994 and is focused on the generation and distribution of electricity in India and around the world. JSW Energy operates thermal and renewable energy projects and has a strong presence in several key markets, including India, the United States, and Europe. JSW Energy has a significant portfolio of renewable energy assets, including wind and solar energy projects, and is committed to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. As of 2022, JSW Energy had a total installed capacity of over 3 GW and was playing a significant role in the growth of the Indian and global energy sectors. The company is dedicated to providing high-quality and reliable energy solutions to its customers and is committed to making energy accessible and affordable to people around the world. In addition to its core business, JSW Energy is involved in various other aspects of the energy sector, including the development of transmission and distribution networks and the exploration and production of natural resources. The company has a strong reputation for quality and innovation and is well-regarded by investors and customers alike. Kolkata-based Sumant Sinha-led ReNew Power ReNew Power is an Indian renewable energy company based in Kolkata and led by CEO Sumant Sinha. The company was established in 2011 and is focused on the development, construction, and operation of renewable energy projects in India and around the world. ReNew Power specializes in the development of wind and solar energy projects and has a strong presence in several key markets, including India, the United States, and Europe. As of 2022, ReNew Power had a total installed capacity of over 17 GW and was one of the largest renewable energy companies in India. The company is dedicated to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. ReNew Power has received recognition for its innovative approach to renewable energy and has won several awards and accolades, including the “Best Renewable Energy Company” award from the Economic Times in 2021. The company is committed to providing high-quality and reliable clean energy solutions to its customers and is dedicated to making renewable energy accessible and affordable to people around the world. In addition to its core business, ReNew Power is involved in various other aspects of the renewable energy sector, including research and development, product design, and manufacturing. The company has a strong reputation for quality and innovation and is well-regarded by investors and customers alike. BHEL BHEL, or Bharat Heavy Electricals Limited, is an Indian engineering and manufacturing company based in New Delhi. The company was established in 1964 and is one of the largest power equipment manufacturers in India. BHEL is engaged in the design, engineering, manufacture, construction, testing, commissioning, and servicing of a wide range of products and services for the power generation, transmission, and distribution sectors. BHEL has a strong presence in several key markets, including India, the Middle East, Africa, and Southeast Asia. The company is dedicated to providing high-quality and reliable energy solutions to its customers and is committed to making energy accessible and affordable to people around the world. In addition to its core business, BHEL is involved in various other aspects of the energy sector, including the development of renewable energy projects, such as wind and solar power plants, and the exploration and production of natural resources. The company has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. As of 2022, BHEL had a total installed capacity of over 35 GW and was playing a significant role in the growth of the Indian and global energy sectors. BHEL is committed to innovation and is constantly developing new products and services to meet the changing needs of its customers and the energy sector as a whole. Suzlon Energy Suzlon Energy is an Indian renewable energy company based in Pune. The company was established in 1995 and is focused on the development, construction, and operation of wind energy projects in India and around the world. Suzlon Energy is one of the largest wind turbine manufacturers in India and has a strong presence in several key markets, including India, Europe, the Americas, and Asia. As of 2022, Suzlon Energy had a total installed capacity of over 5 GW and was playing a significant role in the growth of the Indian and global renewable energy sector. The company is dedicated to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. Suzlon Energy is committed to providing high-quality and reliable wind energy solutions to its customers and is dedicated to making renewable energy accessible and affordable to people around the world. In addition to its core business, Suzlon Energy is involved in various other aspects of the renewable energy sector, including research and development, product design, and manufacturing. The company has received recognition for its innovative approach to renewable energy and has won several awards and accolades, including the “Best Renewable Energy Company” award from the Economic Times in 2022. Suzlon Energy has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. SunEdison SunEdison was a global renewable energy company that was based in the United States. The company was established in 2003 and was focused on the development, construction, and operation of solar and wind energy projects around the world. At its peak, SunEdison was one of the largest renewable energy companies in the world, with a strong presence in several key markets, including the United States, Europe, and Asia. Unfortunately, SunEdison filed for bankruptcy in 2016, which resulted in the dissolution of the company. The bankruptcy of SunEdison was due to a combination of factors, including high levels of debt, aggressive expansion, and a significant drop in the price of solar panels. Despite its bankruptcy, SunEdison had a significant impact on the renewable energy sector and helped to promote the use of clean, renewable energy around the world. The company was known for its innovative approach to renewable energy and was well-regarded by investors and customers alike. SunEdison’s legacy continues to influence the renewable energy sector, and its achievements serve as a reminder of the potential of clean, renewable energy to transform the world. Mytrah Energy Mytrah Energy is an Indian renewable energy company that was established in 2007. The company is focused on the development, construction, and operation of wind and solar energy projects in India and around the world. Mytrah Energy has a strong presence in several key markets, including India, Africa, and the Middle East. As of 2022, Mytrah Energy had a total installed capacity of over 2 GW and was playing a significant role in the growth of the Indian and global renewable energy sector. The company is dedicated to reducing the world’s dependence on fossil fuels and promoting the use of clean, renewable energy. Mytrah Energy is committed to providing high-quality and reliable renewable energy solutions to its customers and is dedicated to making renewable energy accessible and affordable to people around the world. In addition to its core business, Mytrah Energy is involved in various other aspects of the renewable energy sector, including research and development, product design, and manufacturing. The company has received recognition for its innovative approach to renewable energy and has won several awards and accolades, including the “Best Renewable Energy Company” award from the Economic Times in 2022. Mytrah Energy has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. Reliance Power Reliance Power is an Indian energy company that was established in 2007. The company is part of the Reliance Group, one of India’s largest business conglomerates. Reliance Power is focused on the development, construction, and operation of power projects in India and around the world, including both conventional and renewable energy projects. As of 2022, Reliance Power had a total installed capacity of over 11 GW and was playing a significant role in the growth of the Indian power sector. The company has a strong presence in several key markets, including India, the Middle East, and South Asia. In addition to its core business, Reliance Power is involved in various other aspects of the energy sector, including research and development, product design, and manufacturing. Reliance Power has a strong reputation for quality and reliability and is well-regarded by investors and customers alike. The company has received recognition for its innovative approach to power generation and has won several awards and accolades, including the “Best Power Company” award from the Economic Times in 2022. In addition to its business activities, Reliance Power is committed to social and environmental responsibility and is dedicated to reducing its impact on the environment. The company is actively involved in various initiatives to promote sustainability and has received recognition for its efforts in this area.","filter_flag":1}
