{"title":"Observing the Megatrends of New Zealand's Green Economy | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA","guidislink":false,"published":"Mon, 07 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=219, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5\" target=\"_blank\">Observing the Megatrends of New Zealand's Green Economy | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Observing the Megatrends of New Zealand's Green Economy | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvb2JzZXJ2aW5nLW1lZ2F0cmVuZHMtbmV3LXplYWxhbmQtZ3JlZW4tZWNvbm9tedIBAA?oc=5\" target=\"_blank\">Observing the Megatrends of New Zealand's Green Economy | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"To realise these economic opportunities, while preserving and enhancing New Zealand’s natural environment and mitigating the impact of climate change, BCG has explored five fast- growing opportunities for New Zealand’s green economy: Eco-tourism: Delivering tourism through more environmentally sustainable travel, business practices, and tourism experiences. Sustainable construction: Developing more sustainable homes, buildings, and infrastructure, including leveraging the country’s strong position in biogenic building materials. Low carbon energy system: Capitalising on New Zealand’s highly renewable electricity system to attract low-carbon industry and enable the net zero transition through electrification of transport, heat, and industrial processes. Sustainable food production: Producing world-leading natural and sustainable food through premium product development, aggressive investment in R&D to reduce agricultural emissions, and adoption of best practice technologies to improve productivity. Green consumer products: Developing premium retail products with lower environmental impact, transparent supply chains enabled by digitisation, and clear sustainability metrics to attract a growing segment of customers that value sustainability. 1. Eco-tourism Tourism is a vital part of New Zealand’s economy. Domestic tourism expenditure has remained relatively stable at $25 billion per year from pre-COVID levels to current levels in the year ended March 2023. 1 1 Stats NZ, 2023, Tourism satellite account: Year ended March 2023 Notes: 1 Stats NZ, 2023, Tourism satellite account: Year ended March 2023 However, international tourism expenditure declined by ~90% during COVID from NZD$18 billion per year pre-COVID to NZD$2 billion in the year ended March 2022. As a result, tourism fell from ~20% of New Zealand’s exports to just 2%. The most recent data is brighter international tourism levels in March 2023 were ~20% below pre-COVID levels. As New Zealand emerges from the pandemic, eco-tourism is an opportunity to reinvigorate the tourism sector and the 100% Pure New Zealand brand. According to Tourism New Zealand data, people actively considering travel to New Zealand score the country highly on its pristine landscapes and scenery, and connection to the land relative to other destinations. 2 2 Tourism New Zealand, 2023, Active Considerer reports Notes: 2 Tourism New Zealand, 2023, Active Considerer reports Two global trends are changing the nature of tourism Rise in eco-tourism: Consumer awareness of the environmental footprint of their travel is on the rise, with 81% of travellers stating that sustainable travel is important. 3 3 Corporate Traveller, 2022, Sustainability in Travel: How to Make a Positive Impact Notes: 3 Corporate Traveller, 2022, Sustainability in Travel: How to Make a Positive Impact 36% of travellers stated they would be willing to pay up to 10% more for air travel with a lower carbon footprint. 4 4 Statista, 2020, Willingness to pay more for a flight with smaller environmental impact Notes: 4 Statista, 2020, Willingness to pay more for a flight with smaller environmental impact Demand for premium travel: Consumers are looking for more premium travel experiences. The average spend per traveller in New Zealand grew by 18% in the last three years. 5 5 Tourism New Zealand, 2023, Tourism data Notes: 5 Tourism New Zealand, 2023, Tourism data Many travellers that are seeking premium tourism experiences also want these experiences to be environmentally sustainable. The global eco-tourism industry is forecast to grow to NZD$700 billion by 2030, 6 6 imarc Group, 2022, “Ecotourism Market: Global Industry Trends, Share, Size, Growth, Opportunity and Forecast” Notes: 6 imarc Group, 2022, “Ecotourism Market: Global Industry Trends, Share, Size, Growth, Opportunity and Forecast” at 14% per year. New Zealand is well placed to build a more prosperous and sustainable eco- tourism industry that meets these changing consumer needs. New Zealand can harness the rise in eco-tourism Support sustainable air travel for international visitors to New Zealand: For most international travellers, New Zealand is a remote destination which is a potential threat to the tourism industry as concerns over the carbon footprint of air miles rise. In the future, potential visitors to New Zealand may choose a destination closer to home if air travel to the country is not sustainable. Anticipating this changing consumer preference, Air New Zealand has committed to at least 10% sustainable aviation fuel by 2030 and has set a target for net zero emissions by 2050. 7 7 Air New Zealand, Flight NZ0™ Notes: 7 Air New Zealand, Flight NZ0™ Policy support for decarbonising international travel to New Zealand is likely to be required to protect New Zealand’s tourism industry over the longer term. Drive low environmental footprint tourism within New Zealand: While improving sustainable travel to New Zealand is vital, it is also important to ensure tourism within the country becomes more sustainable. Low-emissions domestic transport options include e-bike rentals, electric hire car hires, electric buses, electric trains, and sustainable domestic flights. Sustainable accommodation and environmentally friendly tourist experiences are also important. A number of initiatives are underway, such as Waka Kotahi, New Zealand’s leading transport agency, facilitating a nationwide network of fast charging stations for electric vehicles every 75 km along state highways. 8 8 NZ Transport Agency, 2022, National guidance for public electric vehicle charging infrastructure Notes: 8 NZ Transport Agency, 2022, National guidance for public electric vehicle charging infrastructure Additionally, the tourism industry’s 12 Tourism Sustainability Commitments, including nature restoration and waste elimination, have been signed by over 1,800 businesses across New Zealand. 9 9 Tourism Industry Aotearoa, 2023, Tourism Sustainability Commitments Directory Notes: 9 Tourism Industry Aotearoa, 2023, Tourism Sustainability Commitments Directory Make the most of New Zealand’s natural environment: Natural attractions are one of the primary reasons tourists visit New Zealand, and while consumers are becoming more environmentally conscious, they are also looking for more premium eco-tourism services and experiences – and they are willing to pay more for them. International visitors to New Zealand are generally enchanted by its natural beauty, and there is an opportunity to consider how this can be further leveraged to reinvigorate the tourism industry. 2. Sustainable Construction Construction is a major part of New Zealand’s economy, contributing NZD$21 billion (7% of GDP) in 2019 and employing 275,000 workers (10% of the workforce). 10 10 Construction Sector Accord NZ, 2021, Construction Sector Accord Progress Report Notes: 10 Construction Sector Accord NZ, 2021, Construction Sector Accord Progress Report Adoption of sustainable construction materials in New Zealand will result in an increasingly low-carbon built environment. New Zealand already has a unique advantage in this area due to its leading position in biogenic building materials. The environmental impact of residential housing in New Zealand is 16 kg CO 2 eq\/m2\/year, roughly one-third of the international median of 50 kg CO 2 eq\/m2\/year, predominantly driven by the use of more wooden materials in New Zealand. 11 11 Buildings, Dani et al., 2022, “A Comparative Study on the Life Cycle Assessment of New Zealand Residential Buildings”, p.3 Notes: 11 Buildings, Dani et al., 2022, “A Comparative Study on the Life Cycle Assessment of New Zealand Residential Buildings”, p.3","filter_flag":1}
{"title":"California's first full-scale direct air capture hub awarded $11.8 million - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIxL2NhbGlmb3JuaWFzLWZpcnN0LWZ1bGwtc2NhbGUtZGlyZWN0LWFpci1jYXB0dXJlLWh1Yi1hd2FyZGVkLTExLTgtbWlsbGlvbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIxL2NhbGlmb3JuaWFzLWZpcnN0LWZ1bGwtc2NhbGUtZGlyZWN0LWFpci1jYXB0dXJlLWh1Yi1hd2FyZGVkLTExLTgtbWlsbGlvbi_SAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIxL2NhbGlmb3JuaWFzLWZpcnN0LWZ1bGwtc2NhbGUtZGlyZWN0LWFpci1jYXB0dXJlLWh1Yi1hd2FyZGVkLTExLTgtbWlsbGlvbi_SAQA","guidislink":false,"published":"Mon, 21 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=233, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIxL2NhbGlmb3JuaWFzLWZpcnN0LWZ1bGwtc2NhbGUtZGlyZWN0LWFpci1jYXB0dXJlLWh1Yi1hd2FyZGVkLTExLTgtbWlsbGlvbi_SAQA?oc=5\" target=\"_blank\">California's first full-scale direct air capture hub awarded $11.8 million<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"California's first full-scale direct air capture hub awarded $11.8 million - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA4LzIxL2NhbGlmb3JuaWFzLWZpcnN0LWZ1bGwtc2NhbGUtZGlyZWN0LWFpci1jYXB0dXJlLWh1Yi1hd2FyZGVkLTExLTgtbWlsbGlvbi_SAQA?oc=5\" target=\"_blank\">California's first full-scale direct air capture hub awarded $11.8 million<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"From pv magazine USA The U.S. Department of Energy (DOE) recently awarded up to $11.8 million in funding to a consortium or organizations, including utility Southern California Gas Company (SoCalGas), which is looking to build California’s first full-scale direct air capture and storage network of hubs. This funding will be used to study a regional carbon management hub in California’s Kern County, following which the consortium plans to build similar facilities in other parts of the state. The group includes nearly 40 organizations, including representatives from industry, government, technology, and labor and workforce development. The hub could be able to remove more than 1 million metric tons of carbon dioxide every year, or the equivalent of eliminating 220,000 gasoline vehicles on the road annually. In addition to bringing California closer to its climate goals, each hub could also provide high-paying and permanent jobs and workforce development programs, according to Carbon TerraVault Holdings, a subsidiary of the California Resources Corporation, which assembled the consortium. The timeline for getting the hub operational will depend on the timing of further DOE funding for the development and construction stages, Richard Venn, a spokesperson for the California Resources Corporation, told pv magazine USA. The direct air capture industry is in an early stage and provides a tremendous opportunity for many states and regions to invest in a new clean technology industry that will remove carbon dioxide from the air and deliver significant co-benefits to local communities, Venn added. “According to the Intergovernmental Panel on Climate Change (IPCC), carbon removal methods such as DAC are key to mitigation pathways aimed at keeping global warming to below 1.5 degrees Celsius,” said Venn. Popular content Direct air capture technology involves separating carbon dioxide from the air, and either storing it underground permanently or using it in products that contain carbon, like concrete. At least 27 direct air capture plants have been commissioned worldwide, and plans for another 130 facilities are at various stages of development, according to the International Energy Agency. The California funding is part of a larger DOE effort to invest in engineered carbon removal. Last week the agency announced up to $1.2 billion in funding to develop two commercial-scale direct air capture facilities in Texas and Louisiana, which are collectively expected to remove more than 2 million metric tons of carbon dioxide emissions from the atmosphere every year. The DOE’s investment lays the foundation for a direct air capture industry that will be crucial to tackling climate change, according to Jennifer Granholm, U.S. Secretary of Energy. “Cutting back on our carbon emissions alone won’t reverse the growing impacts of climate change; we also need to remove the CO2 that we’ve already put in the atmosphere…” said Granholm. The DOE also selected 19 additional projects – including the California hub – to support the earlier stages of project development, such as feasibility assessments. “Our research has shown that carbon management, when combined with electrification and clean fuels, delivers the most affordable, resilient and technologically proven path to full carbon neutrality,” said Maryam Brown, president of SoCalGas. The utility’s role in the project includes a front-end engineering design study on transporting the captured carbon to permanent storage. The DOE funding will be used in 2024 to conduct studies on the planned facilities in Kern County, Carbon TerraVault said. The consortium could begin developing and constructing the facility in 2025, and plans to put out additional funding requests next year as well.","filter_flag":1}
{"title":"COSORI UNVEILS 26-QUART CERAMIC AIR FRYER OVEN THAT IS EASY TO USE, COOK WITH, AND CLEAN - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Nvc29yaS11bnZlaWxzLTI2LXF1YXJ0LWNlcmFtaWMtYWlyLWZyeWVyLW92ZW4tdGhhdC1pcy1lYXN5LXRvLXVzZS1jb29rLXdpdGgtYW5kLWNsZWFuLTMwMTkwNjQzNS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Nvc29yaS11bnZlaWxzLTI2LXF1YXJ0LWNlcmFtaWMtYWlyLWZyeWVyLW92ZW4tdGhhdC1pcy1lYXN5LXRvLXVzZS1jb29rLXdpdGgtYW5kLWNsZWFuLTMwMTkwNjQzNS5odG1s0gEA?oc=5","id":"CBMijgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Nvc29yaS11bnZlaWxzLTI2LXF1YXJ0LWNlcmFtaWMtYWlyLWZyeWVyLW92ZW4tdGhhdC1pcy1lYXN5LXRvLXVzZS1jb29rLXdpdGgtYW5kLWNsZWFuLTMwMTkwNjQzNS5odG1s0gEA","guidislink":false,"published":"Tue, 22 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Nvc29yaS11bnZlaWxzLTI2LXF1YXJ0LWNlcmFtaWMtYWlyLWZyeWVyLW92ZW4tdGhhdC1pcy1lYXN5LXRvLXVzZS1jb29rLXdpdGgtYW5kLWNsZWFuLTMwMTkwNjQzNS5odG1s0gEA?oc=5\" target=\"_blank\">COSORI UNVEILS 26-QUART CERAMIC AIR FRYER OVEN THAT IS EASY TO USE, COOK WITH, AND CLEAN<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"COSORI UNVEILS 26-QUART CERAMIC AIR FRYER OVEN THAT IS EASY TO USE, COOK WITH, AND CLEAN - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Nvc29yaS11bnZlaWxzLTI2LXF1YXJ0LWNlcmFtaWMtYWlyLWZyeWVyLW92ZW4tdGhhdC1pcy1lYXN5LXRvLXVzZS1jb29rLXdpdGgtYW5kLWNsZWFuLTMwMTkwNjQzNS5odG1s0gEA?oc=5\" target=\"_blank\">COSORI UNVEILS 26-QUART CERAMIC AIR FRYER OVEN THAT IS EASY TO USE, COOK WITH, AND CLEAN<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"ANAHEIM, Calif., Aug. 22, 2023 \/PRNewswire\/ -- VeSync Co's premier kitchen appliance company, COSORI, today announced the launch of its 26-Quart Ceramic Air Fryer Oven. This cutting-edge appliance combines 13 cooking functions with new easy-to-clean technology for an unparalleled cooking and cleaning experience. This new kitchen dynamo furthers COSORI's mission to promote nutritious, healthy living. The COSORI 26-Quart Ceramic Air Fryer Oven is one of the most versatile and intuitive kitchen companions. Key features include: Easy-to-Use Superior experience: The new COSORI Air Fryer Oven has an easy-to-use, knob-styled panel and simplified user interface with a clean display set at a 12-degree incline so users don't have to bend over to view the screen. The new COSORI Air Fryer Oven has an easy-to-use, knob-styled panel and simplified user interface with a clean display set at a 12-degree incline so users don't have to bend over to view the screen. Large size, small footprint: It has a large viewing window and interior light, along with a sizeable 26.4-quart capacity that can fit a 12-inch pizza, five-pound whole chicken, nine pieces of toast, or 12 pounds of turkey. And it's compact in design to save counter space. Easy-to-Cook Multi-cooking, multi-layer device: The 13 versatile cooking functions include Air Fry, Air Roast, Air Bake, Air Sous Vide, Bagel, Bake, Broil, Dehydrate, Pizza, Proof, Reheat, Toast, and Warm. Additionally, it cooks more types of food at a time with five levels of racks and one burner...this oven can even be used as a stove! The 13 versatile cooking functions include Air Fry, Air Roast, Air Bake, Air Sous Vide, Bagel, Bake, Broil, Dehydrate, Pizza, Proof, Reheat, Toast, and Warm. Additionally, it cooks more types of food at a time with five levels of racks and one burner...this oven can even be used as a stove! Fast, precision cooking: Top, bottom and rear heating elements provide fast and even cooking, while higher fan speed (3150 RPM) and precise temperature control lead to better results. Easy-to-Clean Easy to clean: No more tough-to-reach cleaning as the oven includes sealed ceramic heating elements that lay flat (top and bottom). The non-stick coating allows for effortless wiping down of the inner cavity. The accessories are dishwasher safe, and the removable splash guard makes for convenient cleaning and replacement. Everything is enclosed within a sleek stainless-steel outer shell that is easy to wipe down. \"We are committed to delivering products that enhance the lives of our customers and elevate their experience in the kitchen,\" said Grace Yang CEO and founder of VeSync Ltd. Co. \"We've thoughtfully designed the premium 26-Quart Ceramic Air Fryer Oven to enable health-conscious home chefs who have a wide array of cooking needs to easily prepare wholesome, nutritious and delicious dishes for their families. With its spacious interior and easy-to-clean design, our customers can spend less time in the kitchen and more time with their families.\" The COSORI 26-Quart Ceramic Air Fryer Oven has an MSRP of $299.99 with all available accessories (casserole pan, roasting rack, sheet tray, wire rack, air fry basket, thermometer, and splash guard) or $259.99 with introductory accessories (roasting rack, baking sheet, wire rack, air fryer basket and splash guard). It is available now at COSORI.com and Amazon. About COSORI Launched in 2016, COSORI offers award-winning products with advanced smart technology that equip users to enjoy wholesome, homemade food. The brand's collection of innovative kitchen appliances focuses on helping individuals and families achieve restaurant-quality food and an overall improved lifestyle. As part of the VeSync family of brands, COSORI has received global recognition for its award-winning, innovative designs, and has garnered millions of satisfied customers worldwide. Awards include Newsweek America's Best Home and Garden Brands 2022, iF Design Award, German Innovation Award, and more. To learn more, visit COSORI.com. SOURCE COSORI","filter_flag":1}
{"title":"Recycling of Polyurethane Foam Takes a Step Forward - AZoCleantech","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5","id":"CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA","guidislink":false,"published":"Wed, 02 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=214, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5\" target=\"_blank\">Recycling of Polyurethane Foam Takes a Step Forward<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoCleantech<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycling of Polyurethane Foam Takes a Step Forward - AZoCleantech","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zMzgwMtIBAA?oc=5\" target=\"_blank\">Recycling of Polyurethane Foam Takes a Step Forward<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoCleantech<\/font>","source.href":"https:\/\/www.azocleantech.com","source.title":"AZoCleantech","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Investigators from Aarhus University have now demonstrated, in collaboration with partners from the industry, that straightforward chemistry can do more from polyurethane foam than just extract vital raw materials; the most significant component can also be reused repeatedly in new mattresses. Image Credit: Aarhus University When scientists from Aarhus University announced a new and cost-effective method of breaking polyurethane (PU) plastic into its original components, which can then be recycled into new PU material instead of ending up in landfills or incinerators, it caused a bit of a stir back in 2022. The same scientists have now demonstrated that the method can be used to address flexible foam polyurethane in collaboration with Plixxent A\/S, Dan-Foam Aps, and the Danish Technological Institute as part of the Danish RePURpose consortium. Researchers have broken down approximately one and a half kilos of foam mattresses, retrieved its major components, and used one of them, polyol, as a raw material in a new piece of mattress. The scientists replaced 64% of the mattress without compromising quality by using “fresh” polyol, which is majorly produced from crude oil, with polyol extracted from the old mattress. Researchers have also illustrated that the method can be repeated many times. In other words, the polyol can be extracted and reused from polyurethane foam. The findings were recently published in the American Chemical Society’s scientific journal ACS Sustainable Chemistry & Engineering. Much Needed Solution This advances us one step closer to a circular economy for flexible PU foam. It is also urgently needed. Since it is difficult to recycle, the vast majority of global PU waste is disposed of in landfills. Because PU cannot be melted, it cannot be molded into new products like many other plastics. In 2021, the global PU market was 24.7 million tons, and it is anticipated to reach 29 million tons by 2029. Flexible PU foam used in mattresses accounts for approximately 30% of the market. The PU family of advanced plastic materials, which has a wide range of properties and uses, is not just used in mattresses. It is also utilized in a wide range of products, including furniture, footwear, toys, paints, fillers, insulation, automobiles, wind turbines, and other aircraft. Requires Waste Control Solvolysis is a process that Aarhus University chemists invented and patented that involves placing the material under pressure with hot tert-amyl alcohol and a small amount of caustic potash to dissolve the chemical bonds in PU. The entire PU market may not be supported by this method, according to the researchers. There are too many variants of PU. Our technique can push society towards a circular economy for PU mattresses. But if recycling is to put and end to landfilling and incineration, industry and society need full control of waste streams. The problem is that each manufacturer of PU-based materials has its own unique recipe. Steffan Kvist Kristensen, Study Co-Author and Assistant Professor, Interdisciplinary Nanoscience Center, Aarhus University Journal Reference: Johansen, M. B., et al. (2023). Closed-Loop Recycling of Polyols from Thermoset Polyurethanes by tert-Amyl Alcohol-Mediated Depolymerization of Flexible Foams. ACS Sustainable Chemistry & Engineering. doi.org\/10.1021\/acssuschemeng.3c01469.","filter_flag":1}
{"title":"Energy UK report warns Britain could fall behind other countries vying for clean energy investment - transportandenergy - Transport + Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3RyYW5zcG9ydGFuZGVuZXJneS5jb20vMjAyMy8wOC8yMS9lbmVyZ3ktdWstcmVwb3J0LXdhcm5zLWJyaXRhaW4tY291bGQtZmFsbC1iZWhpbmQtb3RoZXItY291bnRyaWVzLXZ5aW5nLWZvci1jbGVhbi1lbmVyZ3ktaW52ZXN0bWVudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3RyYW5zcG9ydGFuZGVuZXJneS5jb20vMjAyMy8wOC8yMS9lbmVyZ3ktdWstcmVwb3J0LXdhcm5zLWJyaXRhaW4tY291bGQtZmFsbC1iZWhpbmQtb3RoZXItY291bnRyaWVzLXZ5aW5nLWZvci1jbGVhbi1lbmVyZ3ktaW52ZXN0bWVudC_SAQA?oc=5","id":"CBMijQFodHRwczovL3RyYW5zcG9ydGFuZGVuZXJneS5jb20vMjAyMy8wOC8yMS9lbmVyZ3ktdWstcmVwb3J0LXdhcm5zLWJyaXRhaW4tY291bGQtZmFsbC1iZWhpbmQtb3RoZXItY291bnRyaWVzLXZ5aW5nLWZvci1jbGVhbi1lbmVyZ3ktaW52ZXN0bWVudC_SAQA","guidislink":false,"published":"Mon, 21 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=233, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3RyYW5zcG9ydGFuZGVuZXJneS5jb20vMjAyMy8wOC8yMS9lbmVyZ3ktdWstcmVwb3J0LXdhcm5zLWJyaXRhaW4tY291bGQtZmFsbC1iZWhpbmQtb3RoZXItY291bnRyaWVzLXZ5aW5nLWZvci1jbGVhbi1lbmVyZ3ktaW52ZXN0bWVudC_SAQA?oc=5\" target=\"_blank\">Energy UK report warns Britain could fall behind other countries vying for clean energy investment - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Energy UK report warns Britain could fall behind other countries vying for clean energy investment - transportandenergy - Transport + Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3RyYW5zcG9ydGFuZGVuZXJneS5jb20vMjAyMy8wOC8yMS9lbmVyZ3ktdWstcmVwb3J0LXdhcm5zLWJyaXRhaW4tY291bGQtZmFsbC1iZWhpbmQtb3RoZXItY291bnRyaWVzLXZ5aW5nLWZvci1jbGVhbi1lbmVyZ3ktaW52ZXN0bWVudC_SAQA?oc=5\" target=\"_blank\">Energy UK report warns Britain could fall behind other countries vying for clean energy investment - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","source.href":"https:\/\/transportandenergy.com","source.title":"Transport + Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"A new report from Energy UK details measures introduced recently by the United States and the European Union, as well as other countries like China, Japan and India, in order to incentivise investment in clean energy. Published on the first anniversary of the Inflation Reduction Act (IRA), the report highlights what the US and other major economies are doing to attract investment in clean technologies, leading to calls for the UK to respond in kind. Funding The Future is the latest report in Energy UK’s Clean Growth Gap series produced in partnership with Oxford Economics. The IRA, for example, has a total budget of $369 billion for the period 2023-2031 with the majority of this funding in the form of tax credits to reward private investment in clean technology, transport and manufacturing. Although many of its provisions only become effective at the start of the year, early indicators featured in the report point to the impact these are already having. Funding announced for new factories in the automotive and battery sectors since the IRA was passed is more than 20 times higher than it was in 2021 while share prices for US based companies specializing in low-carbon technology have also been boosted. The EU responded to the IRA with its Green Deal Industrial Plan (albeit with a wider scope than the IRA) incorporating funding from two existing programmes – Repower EU (€270bn) and the Recovery and Resilience Fund (€250bn) – with support also available through other initiatives, along with the relaxation of State Aid rules and other regulatory requirements. The report also details how China, whose $546 billion spend amounted to near half of the world’s clean technology investments in 2022, has unveiled a $72.3 billion packages of tax breaks for electric vehicles. Japan already has a $18 billion Green Innovation Fund in place and aims to realise $1 trillion in public-private investment to finance its green transition over the next 10 years, while the Indian Government has this year promised to make $4.3 billion in investments towards its own transition. Such measures have increased the calls for the UK to respond to this challenge or risk losing its world-leading position in clean energy. Although the UK is currently a dominant player in offshore wind and is the only economy out of the world’s eight largest to produce more electric and hybrid vehicles than traditional cars, it is also forecast to have the slowest growth in low-carbon electricity generation of these economies between now and the end of the decade. Low levels of expected investment are a significant factor in this forecast with the UK performing below most other OCED nations when it comes to incentives for investment. Energy UK’s Chief Executive Emma Pinchbeck said: “The IRA has been a game changer for the investment landscape and as this report shows, other key markets are already responding. The UK’s world-leading role in the development of clean energy has given us strengths in terms of expertise and experience – but we have no divine right to this position. “With growing global competition for private investment that can choose its location, a failure to respond will quickly see us fall behind and jeopardise ambitious targets for increasing our own sources of clean energy and decarbonising our whole economy. While we can’t necessarily replicate what the US has done, resting on our laurels and missing out on the economic boost such investment offers our country would be a very serious mistake.” Image courtesy of Shutterstock. Share this: LinkedIn Twitter Facebook Email ","filter_flag":1}
{"title":"PERSIL® PROCLEAN® INTENSE FRESH® LAUNDRY DISCS RECOGNIZED AS \"TOP SCENT-SATIONAL DISCS\" IN ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcnNpbC1wcm9jbGVhbi1pbnRlbnNlLWZyZXNoLWxhdW5kcnktZGlzY3MtcmVjb2duaXplZC1hcy10b3Atc2NlbnQtc2F0aW9uYWwtZGlzY3MtaW4tZ29vZC1ob3VzZWtlZXBpbmdzLTIwMjMtYmVzdC1jbGVhbmluZy0tb3JnYW5pemluZy1hd2FyZHMtMzAxOTE0NDk5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcnNpbC1wcm9jbGVhbi1pbnRlbnNlLWZyZXNoLWxhdW5kcnktZGlzY3MtcmVjb2duaXplZC1hcy10b3Atc2NlbnQtc2F0aW9uYWwtZGlzY3MtaW4tZ29vZC1ob3VzZWtlZXBpbmdzLTIwMjMtYmVzdC1jbGVhbmluZy0tb3JnYW5pemluZy1hd2FyZHMtMzAxOTE0NDk5Lmh0bWzSAQA?oc=5","id":"CBMixgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcnNpbC1wcm9jbGVhbi1pbnRlbnNlLWZyZXNoLWxhdW5kcnktZGlzY3MtcmVjb2duaXplZC1hcy10b3Atc2NlbnQtc2F0aW9uYWwtZGlzY3MtaW4tZ29vZC1ob3VzZWtlZXBpbmdzLTIwMjMtYmVzdC1jbGVhbmluZy0tb3JnYW5pemluZy1hd2FyZHMtMzAxOTE0NDk5Lmh0bWzSAQA","guidislink":false,"published":"Thu, 31 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=243, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcnNpbC1wcm9jbGVhbi1pbnRlbnNlLWZyZXNoLWxhdW5kcnktZGlzY3MtcmVjb2duaXplZC1hcy10b3Atc2NlbnQtc2F0aW9uYWwtZGlzY3MtaW4tZ29vZC1ob3VzZWtlZXBpbmdzLTIwMjMtYmVzdC1jbGVhbmluZy0tb3JnYW5pemluZy1hd2FyZHMtMzAxOTE0NDk5Lmh0bWzSAQA?oc=5\" target=\"_blank\">PERSIL® PROCLEAN® INTENSE FRESH® LAUNDRY DISCS RECOGNIZED AS \"TOP SCENT-SATIONAL DISCS\" IN ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PERSIL® PROCLEAN® INTENSE FRESH® LAUNDRY DISCS RECOGNIZED AS \"TOP SCENT-SATIONAL DISCS\" IN ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcnNpbC1wcm9jbGVhbi1pbnRlbnNlLWZyZXNoLWxhdW5kcnktZGlzY3MtcmVjb2duaXplZC1hcy10b3Atc2NlbnQtc2F0aW9uYWwtZGlzY3MtaW4tZ29vZC1ob3VzZWtlZXBpbmdzLTIwMjMtYmVzdC1jbGVhbmluZy0tb3JnYW5pemluZy1hd2FyZHMtMzAxOTE0NDk5Lmh0bWzSAQA?oc=5\" target=\"_blank\">PERSIL® PROCLEAN® INTENSE FRESH® LAUNDRY DISCS RECOGNIZED AS \"TOP SCENT-SATIONAL DISCS\" IN ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"STAMFORD, Conn., Aug. 31, 2023 \/PRNewswire\/ -- The makers of Persil® ProClean® laundry detergent announced today that the Persil® ProClean® Intense Fresh® Scent Laundry Discs™ were recognized in Good Housekeeping's 2023 Best Cleaning & Organizing Awards as \"Top Scent-Sational Discs\" in the Cleanest Clothing Category. Select winners can be found in the September 2023 issue of Good Housekeeping, on stands now with the full list available online at: https:\/\/www.goodhousekeeping.com\/home-products\/a44372491\/cleaning-and-organizing-awards-2023\/. Persil x Good Housekeeping Launched this year, the Persil Intense Fresh Discs are formulated with Advanced Deep Clean Technology with a long-lasting freshness that ensures laundry is cleaned right the first wash all while removing odors and adding up to 100 days of freshness, out of storage. The Good Housekeeping Cleaning Lab got impressive results from the detergent during the testing process, \"especially on tough stains like, chocolate and mustard, and testers agreed, it left clothes smelling clean and fresh.\" \"At Henkel, we are constantly looking for ways to innovate and meet the needs of consumers through our products,\" said Matt Bernick, Senior Brand Manager at Persil ProClean. \"The recognition of our Persil Intense Fresh Discs by Good Housekeeping's 2023 Best Cleaning & Organizing Awards is a testament to our dedication to providing a premium clean. We're proud to offer people nationwide a convenient and easy-to-use option that provides laundry with our signature deep cleaning technology, all with an added fresh scent boost.\" Persil Intense Fresh Discs feature deep cleaning technology, which includes: stain-fighting enzymes that break down stains, patented performance boosters to ensure dazzling whites, and anti-graying technology to ensure vibrant fabrics. Moreover, the Discs include added scent boost and freshness technology to tackle odors. Additionally, the formula is clean-rinsing and low-sudsing, which is optimal for great performance in all machine types (including HE). The formula enables energy efficient loads by delivering a premium clean in cold water settings. Its Advanced Deep Clean Technology fights odors at the source, is loaded with a signature scent for powerful freshness, and cares for clothes while delivering a deep clean, right down to the fibers. Good Housekeeping Cleaning Lab experts and a team of engineers, scientists and dedicated consumer testers set out to recognize the best performing, most innovative organizers and cleaning products, tools and appliances that get the job done the first time. They used established protocols and lab equipment to assess cleaning performance across categories, and reviewed labeling, product manuals and websites for clarity and thoroughness of directions, safety information and more. Consumers then weighed in, providing real life feedback on how the products worked in their own homes and for their families, how they compared to the products they currently use and if they would continue using them. For specific stain-fighting instructions, general laundry tips and tricks, and to find a store with Persil ProClean laundry detergent near you, visit www.persillaundry.com. You can also follow @PersilProClean on Facebook, Instagram, TikTok and YouTube.com. About Persil® ProClean® Persil® ProClean® is a premium laundry detergent brand packed with cutting-edge technology that delivers fiber care, stain removal and long-lasting freshness. Launched in the U.S. in 2015, Persil ProClean detergent goes deep into fabrics to achieve a deep clean. With a growing portfolio of products (including Liquid Detergent and Discs) as the hero of laundry day, Persil ProClean detergent helps people everywhere achieve high standards of cleanliness. Persil ProClean detergents have also earned the Good Houskeeping Seal and Persil ProClean Intense Fresh® Scent Laundry Discs™ were recognized in Good Houskeeping's 2023 Best Cleaning and Organizing Awards. Persil ProClean +OXI Laundry Discs™ were previously recognized in Good Housekeeping's 2021 Best Cleaning and Organizing Awards, in the 'Superbly Spotless Laundry\" category. Visit www.persillaundry.com for more information. About Henkel in North America Henkel's portfolio of well-known brands in North America includes Schwarzkopf® hair care, Dial® soaps, Persil®, Purex®, and all® laundry detergents, Snuggle® fabric softeners as well as Loctite®, Technomelt® and Bonderite® adhesives. With sales close to 6.5 billion US dollars (6 billion euros) in 2022, North America accounts for 27 percent of the company's global sales. Henkel employs over 8,000 people across the U.S., Canada and Puerto Rico. For more information, please visit www.henkel-northamerica.com, and on X (formerly known as Twitter) @Henkel_NA . Photo material is available at www.henkel-northamerica.com\/press Brand Contact: Agency H5 (on behalf of Persil ProClean) Contact: Brittni Wade Phone: 714-553-7218 Email: [email protected] SOURCE Persil","filter_flag":1}
{"title":"Briefing material: Deputy Minister Simon Kennedy 2019 - Innovation, Science and Economic Development Canada","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaXNlZC1pc2RlLmNhbmFkYS5jYS9zaXRlL3RyYW5zaXRpb24tbWF0ZXJpYWxzLWlzZWQvZW4vYnJpZWZpbmctYmluZGVyLWRlcHV0eS1taW5pc3Rlci1zaW1vbi1rZW5uZWR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaXNlZC1pc2RlLmNhbmFkYS5jYS9zaXRlL3RyYW5zaXRpb24tbWF0ZXJpYWxzLWlzZWQvZW4vYnJpZWZpbmctYmluZGVyLWRlcHV0eS1taW5pc3Rlci1zaW1vbi1rZW5uZWR50gEA?oc=5","id":"CBMia2h0dHBzOi8vaXNlZC1pc2RlLmNhbmFkYS5jYS9zaXRlL3RyYW5zaXRpb24tbWF0ZXJpYWxzLWlzZWQvZW4vYnJpZWZpbmctYmluZGVyLWRlcHV0eS1taW5pc3Rlci1zaW1vbi1rZW5uZWR50gEA","guidislink":false,"published":"Wed, 16 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaXNlZC1pc2RlLmNhbmFkYS5jYS9zaXRlL3RyYW5zaXRpb24tbWF0ZXJpYWxzLWlzZWQvZW4vYnJpZWZpbmctYmluZGVyLWRlcHV0eS1taW5pc3Rlci1zaW1vbi1rZW5uZWR50gEA?oc=5\" target=\"_blank\">Briefing material: Deputy Minister Simon Kennedy 2019<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation, Science and Economic Development Canada<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Briefing material: Deputy Minister Simon Kennedy 2019 - Innovation, Science and Economic Development Canada","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaXNlZC1pc2RlLmNhbmFkYS5jYS9zaXRlL3RyYW5zaXRpb24tbWF0ZXJpYWxzLWlzZWQvZW4vYnJpZWZpbmctYmluZGVyLWRlcHV0eS1taW5pc3Rlci1zaW1vbi1rZW5uZWR50gEA?oc=5\" target=\"_blank\">Briefing material: Deputy Minister Simon Kennedy 2019<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation, Science and Economic Development Canada<\/font>","source.href":"https:\/\/ised-isde.canada.ca","source.title":"Innovation, Science and Economic Development Canada","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The following package is designed to provide you with an overview of our diverse work and we look forward to briefing you on specific issues and files in the coming days and weeks. We wish you the very best as you embark on this great adventure, and know that we stand ready to help advance the Government's mandate and support your vision as we go beyond 2020. We are already seeing significant progress through the Innovation and Skills Plan. CanCode has supported over a million students in gaining the digital skills needed for the jobs of the future. Business-led Innovation Superclusters are expected to create ecosystems, produce anchor firms, and pool access to cutting-edge research and highly skilled talent. There remains, however, a lot more to be done. With the expected slowing economy and impending transition to a new mandate, we look forward to your leadership and direction as we continue to push the boundaries and build a nation of innovators. ISED has a mandate that spans the country, the globe, and beyond. Our ambition is to transform the entire Canadian economy. From bringing high-speed internet to all Canadians to offering support for firms of all sizes to grow and export to markets around the world, ISED is there. Through initiatives such as Superclusters and the Economic Strategy Tables, we are fostering a culture of collaboration and innovation that builds strong partnerships between businesses, academics and government counterparts at all levels. Moreover, as economic growth and creation of good jobs requires innovation and engagement across the country, ISED's regional presence and programming builds upon local strengths to support regional growth. Finally, trust and privacy are imperative for Canadians to fully participate and benefit from the digital economy. That is why ISED recently launched Canada's Digital Charter. This principled approach will not only protect Canadians' privacy and personal data but also leverage Canada's unique talents in order to shape an innovative and people-centred digital economy. A long tradition, but certainly not traditional. The last several years have been an exciting time at ISED. We gained a new name. We welcomed more Ministers. And, we are leading the charge to make Canada recognized as an innovative and globally competitive economy. The data-driven, digital economy is here and ISED is at the forefront. The Innovation and Skills Plan, an ambitious redesign of our micro-economic policy framework, is leading the charge. Recognizing that innovation and skills are the core drivers of economic growth, the Government has committed REDACTED for innovation and skills programming and REDACTED for science at ISED in this mandate alone. Let's begin with your team. Every day, thousands of talented Canadians come to work at ISED throughout the country. They come for the challenge of identifying, creating, and supporting innovative initiatives and leading edge policies that make a real difference in people's lives and help shape Canada's economic future. ISED is a superb place to work but don't just take our word for it. In 2019, your new department was selected as one of Canada's Top 100 Employers, the NCR's Top Employers, and Canada's Best Diversity Employers – the triple crown. Joining such winning organizations as Suncor and Shopify, ISED is recognized as offering a wide variety of unique career opportunities while prioritizing professional development in a collaborative, inclusive, and respectful work environment for all. ISED continues to pioneer innovative workplace initiatives such as the Digital Lounge, our drop-in PayHub, Inclusion Symposiums, and a dedicated ISED Ombudsman for Mental Health and Employee Well-Being to promote a healthy workplace. On behalf of the over 5000 employees at ISED and more than 16,000 personnel from our portfolio partners, congratulations on your appointment! You will be leading an organization steeped in history, bursting with variety, and filled with (we believe) fantastic people. A list of key domestic and international engagement and speaking opportunities can be provided separately. Introduction meetings with key stakeholders and to provide an opportunity for engagement on MTP thinking. Key external speakers could be invited to stimulate thinking. A forward agenda and list of speakers can be provided under separate cover. Weekly meetings would provide the opportunity for regular MTP\/transition engagements with the ISED management team, as well as planning to support an incoming government. Introduction meetings with key stakeholders and to provide an opportunity for engagement on MTP thinking. Could be individual meetings with Presidents or roundtable style meetings. Other interested DMs could also be invited to join discussions. Introduction meetings with your management team, employees, and portfolio colleagues. Regular governance meetings which you may wish to continue include: Please find below some suggested early engagements for you in the first few months of your mandate. ISED officials are available to support you as required with stakeholder engagement and provide further recommendations on key early outreach. Advancing ISED's mandate is based on a partnership-driven approach, engaging widely with stakeholders across the innovation continuum to better understand the challenges that businesses and innovators face and in developing solutions (and buy-in) to address them. This approach includes: playing a convening role across government on key horizontal priorities; regular engagement with key stakeholders at both the Departmental and Ministerial level; participation in key international fora and events; collaboration with P\/Ts; national consultations on innovation and digital frameworks; and business-led solutions such as Superclusters and Economic Strategy Tables to build ecosystems and partner with business on advancing Canada's competitiveness. There also exists a number of ad hoc committees designed to either support ISED-specific functions and structures (i.e., Regulators Table, RDA Committee, Portfolio Heads) or our employees throughout their career at ISED, such as InterConnex (for young professionals), the ISED Inclusiveness Committee, the Managers' Community, and the Mental Health Network. Alongside these oversight and guidance committees, ISED has a suite of corporate committees, at all levels of management, designed to support our corporate, HR, evaluation and service delivery strategies, as is common practice for most federal government departments. These Committees include: DGPC partners with DGMAC via joint meetings and other mechanisms to ensure ongoing alignment of the policy and management agendas. The Chairs are members of both committees, and are permanent observers of the Departmental Management Committee. DGMAC is responsible for reviewing and providing recommendations on corporate strategies, policies, plans and initiatives affecting the management of the Department and the stewardship of its resources – its people, finances, information, systems, services and assets – prior to their review by the Departmental Management Committee. DGPC provides a forum to ensure that policy initiatives benefit from consultation and collaboration, and are consistent with the Department's overall policy agenda. DGPC serves as the discussion forum for departmental exercises that feed into the Federal Budget, Speech from the Throne, medium term planning and transition efforts. Further, it maintains a linkage to the Department's research agenda to ensure alignment of policy and research priorities. DGPC is responsible for informing DMC policy discussions and supporting sound decision-making to ensure that ISED has a coherent policy agenda and well-designed policies, programs and services. To achieve this objective, DGPC is mandated to discuss, provide guidance, and develop ideas and options on the policy agenda prior to review by the DMC. RMC is supported by the Investment Oversight Committee (IOC) and the Digital Services Oversight Committee (DSOC). The IOC is chaired by the CFO and is responsible for providing assurance that proposals for large investments, via financial assistance programs, major purchases or large projects, represent a sound use of resources for the Department. DSOC is chaired by the Associate DM and provides strategic advice and recommendations to ensure that ISED's digital improvement initiatives are coordinated and departmental services leverage digital technologies. RMC, chaired by the Associate DM, is the senior management Committee at ISED principally occupied with corporate stewardship. This Committee is responsible for oversight on investments and resource allocation. DMC meets weekly, and is supported by a number of other committees, including: DMC ensures that ISED's priorities, plans, projects, initiatives, activities and resources are well- integrated and align with Government priorities, while equipping Senior management with the information they need to enact the Committee decisions within their own organizations. DMC is primarily an open Committee, except when the Chair (ISED DM) chooses to hold in camera sessions. The Committee often invites guest speakers who provide insight and knowledge on a range of issues pertinent to the mandate, such as micro and macroeconomic trends, REDACTED, and long-term economic impacts of social and technological changes. DMC is the senior decision-making committee in the department, and its objective is to advance the ISED mandate and priorities by ensuring the Department has an effective, coherent suite of policies, programs and management practices in place. These Committees are designed around the decision-making processes they support, and are therefore designed to be adaptable to the changing nature of Departmental requirements and structure. We look forward to tailoring these governance structures to meet your needs. The other internal Committees that act as feeders to the broader issues-based DMC have increasingly focused areas of interest, be they policy, management, evaluation, or program-based. These Committees act as important fora for senior managers at ISED to discuss departmental initiatives, programs, and investment decisions; they provide an opportunity for frank discussion around oversight, guidance and strategic advice, as well as the larger questions surrounding the policy and corporate directions the Department will follow. ISED's governance committees have been established to guide policy decisions as well as to provide corporate oversight. These committees have remained flexible as the ISED portfolio has expanded over the last mandate. Although the central anchor Committee at ISED is the Departmental Management Committee (DMC), an additional Portfolio Heads Committee has been established. This Committee is chaired by the DM of ISED, and is scheduled as required with the portfolio heads, and provides an opportunity to encourage horizontal information flow as well as to discuss the ongoing implementation of the Innovation and Skills Plan and broad issues of interest to the portfolio. The Senior ADM of the Strategic and Innovation Policy Sector also holds weekly calls with her RDA counterparts to ensure policy cohesion across the regional footprint of the ISED portfolio. There are various sources of revenues generated by ISED: ISED has the authority to re-spend collected revenues to defray the related expenditures of a specific activity or service. This authority is granted annually by Parliament. For expenses such as superannuation, Canada Pension Plan, and severance pay, that are not incurred directly by ISED. Inflow of cash or receivables from the sale of goods or the rendering of services. For transfers of money (as a grant or a contribution) to an individual, an organization or another government. For the acquisition or development of capital assets (when capital expenditures exceed $5 million.) For expenses incurred in the course of delivering program outputs, such as personnel costs, office supplies, repair and maintenance, consulting fees, operating leases, etc. * Salary expenses account for 71% of ISED's operating budget, with a workforce of 3,640 employees. There are also 1,655 employees (30%) that are paid by the revenue stream. These resources support the implementation of Budget 2019 measures that will eventually be folded into the regular votes under the DRF. These resources support the management of the department, including finance, human resources, information technology, etc. Ensures Canada becomes a global leader in clean technologies. Canadian companies are globally competitive and achieve high growth. Canada is a location and destination of choice for investment, growth and tourism. Canadian innovators have simplified access to tools and support. Ensures world-leading superclusters are grown in Canada. Canadian businesses invest more in research and development (R&D). Canada has world leading-research capacity. Ensures Canada has a highly skilled workforce that is equipped for jobs in an innovative and high-growth economy. Canadian communities are connected to and use digital infrastructure. Canada's entrepreneurs represent all segments of Canadian society. Parliament has provided the Minister with legislative tools to, among other things, provide financial assistance, establish commissions, grant licences, approve foreign investments and appoint officials. These tools are found in the Department of Industry Act, which establishes the Department, and grants the Minister a broad array of powers, duties and functions that are that are put into practice through subject-specific legislation (and their regulations). The Department supports the Minister's roles by proposing policies and amendments to these Acts and their regulations, as appropriate, to address changing priorities and policies, issues, and to implement the Government's mandate. Enabling legislation: Competition Act, Consumer Packaging and Labelling Act (except as it relates to food), Textile Labelling Act , and Precious Metals Marking Act Note: The President & CEO's order in council appointment is in effect until December 1, 2019 Through this initiative, STC will undertake engagement and outreach with Indigenous Peoples and organizations to support the development and management of indigenous data. Through this initiative, STC is laying the foundation to meet the evolving information needs of a data driven society through a whole-of- government approach to: Crown Corporations are arms-length from Government and are governed by a Board of Directors appointed by the Governor in Council on the recommendation of the Ministers of ISED. Departmental Corporations and other Agencies have a relationship to the Ministers which is operationally similar to Government departments with some important exceptions. For example, the Granting Councils (Natural Sciences and Engineering Research Council of Canada and Social Sciences and Humanities Research Council of Canada) make research funding decisions based on the outcomes of independent peer review processes. In addition to the Regional Development Agencies, the ISED Portfolio is made up of the following organizations WD also supports businesses and communities through existing grants and contributions programming and other actions. The department delivers new programs in the West such as the Regional Economic Growth through Innovation initiative and the Women Entrepreneurship Strategy. WD will help build an economy that is empowering and inclusive, in particular to women, Indigenous Peoples and youth. WD will help innovative western clusters to scale-up and capture global markets, such as clean technology, life sciences, value-added agriculture, and advanced manufacturing. Grow West: The Western Canada Growth Strategy sets priorities for diversification, trade, skills, and communities. The strategy includes key federal actions across a range of federal departments who will each move solutions forward and ensure a vibrant future for the West. The President is appointed by the Governor in Council and is responsible for the administration of the Agency's operations and its employees. WD was established to promote the development and diversification of the economy of western Canada and to advance the interests of the west in national economic policy, program and project development and implementation. Implementing the Pan-Territorial Growth Strategy: a roadmap to guide the Agency over the next 5 years through four interrelated areas of action: skilled workforce, infrastructure investment and development, resource development and diversification and innovation. Pilimmaksaivik (Federal Center of Excellence for Inuit Employment in Nunavut) at CanNor serves as the \"central coordinating office\" to provide a whole-of-government, integrated Government of Canada response to Inuit employment development needs for federal departments with offices in Nunavut. CanNor coordinates federal participation in the territorial environmental review processes and maintains the Crown consultation record for major projects. South of the 60th parallel, this responsibility is held by Natural Resources Canada. Delivering a suite of grant and contribution programming which fosters economic and business development including targeting foundational barriers to fueling growth in the territories such as economic infrastructure deficit and skills gap. The President is appointed by the Governor in Council and is responsible for the administration of the Agency's operations and its employees. CanNor works in the territories to support the conditions for a sustainable, diversified and innovative economy in collaboration with Northerners\/Indigenous people, businesses, organizations, other federal departments and other levels of government. Launched in 2018, the Prosperity and Growth Strategy for Northern Ontario is the Government of Canada's targeted approach to regional economic development that supports the Innovation and Skills Plan and builds on collaborations with government and community partners. FedNor relies on its relationships with provincial and federal partners, municipalities, post-secondary institutions, business associations, community economic development organizations, and the not-for-profit sector to deliver on its mandate. FedNor focuses on outreach and collaboration efforts that engage local community leaders and stakeholders. It also plays an advocacy role on behalf of Northern Ontario at the national level. FedNor promotes economic growth through the delivery of regional and national grants and contributions programs The Deputy Minister of ISED is also the Deputy Minister of FedNor. Lisa Setlakwe is responsible for FedNor as Assistant Deputy Minister, Strategy and Innovation Policy Sector. FedNor is the Government of Canada's economic development organization for Northern Ontario that promotes economic development and diversification, job creation and sustainable, self-reliant communities. FedDev also provides services to businesses and entrepreneurs and acts as a convenor for southern Ontario stakeholders A Regional Growth Strategy has been developed after consultations across the province. It offers insights from stakeholders on futures areas of focus as we work towards building a stronger southern Ontario In addition to its core programming, FedDev plays an important role as a federal delivery agent for national programs, such as the Community Futures Program, Women Entrepreneurship Strategy, Steel and Aluminum Initiative and the Canadian Experiences Fund. The Regional Economic Growth through Innovation program offers a simplified suite of innovation programming, designed to better meet the needs of clients and stakeholders. The Agency's activities are focused on supporting the Innovation and Skills Plan, fostering inclusive growth, and advancing the interests of the region. The President is appointed by the Governor in Council and is responsible for the administration of the Agency's operations and its employees. To strengthen regional capacity for innovation, economic development and growth by making targeted investments to stimulate economic growth, create jobs and drive innovation in Canada's most populous region.. Budget 2019 announced that FedDev would be made permanent. Leading the Federal Strategy on Innovation and Growth for the Quebec Regions (launched in November 2018) The Regional Economic Growth through Innovation program offers a simplified suite of innovation programming, designed to better meet the needs of clients and stakeholders. Strengthen the vitality of collectivities by supporting engagement towards economic diversification, promoting and developing regional assets and attractiveness (e.g., tourism) and delivering programs in Quebec. Foster regional economic growth through innovation by supporting business scale-up and productivity, as well as the development of regional innovation ecosystems. The President is appointed by the Governor in Council and is responsible for the administration of the Agency's operations and its employees. CED promotes the long-term economic development of the regions of Quebec by giving special attention to those where slow economic growth is prevalent or opportunities for productive employment are inadequate ACOA has made the issue of skills and labour shortages in Atlantic Canada a priority by working at better understanding the issue, developing policy options, and by engaging internal and external stakeholders. The Atlantic Growth Strategy is a pan-Atlantic, federal- provincial initiative that focuses on joint priorities including: skilled workforce\/immigration; innovation; trade and investment; clean growth and climate change; and infrastructure. ACOA has organized itself around priority files (food, tourism, advanced manufacturing, ocean, startup ecosystem, immigration, indigenous economic development, clean growth, access to national programs, and program simplification) to improve the region's competitiveness in strategic sectors and address key business challenges. The President is appointed by the Governor in Council and is responsible for the administration of the Agency's operations and its employees. To increase opportunity for economic development in Atlantic Canada and, more particularly, to enhance the growth of earned incomes and employment opportunities in that region. In addition to the RDAs, ISED has five regional offices that provide regional intelligence, support and coordination. The RDAs recently announced Regional Economic Growth through Innovation, a nationally coordinated, regionally tailored program focused on business productivity\/scale up and regional innovation ecosystems. The nationally consistent program ensures that all Canadian businesses have the same access to necessary supports. RDAs make strategic risk capital investments in companies through repayable contributions that help drive innovation, grow companies and help them export. RDAs were integrated into the ISED portfolio in 2015, they adopted a common set of priorities, while continuing to deliver the services and programs tailored to the specific needs of communities in each region. Conflict Prevention and Early Resolution develops and implement initiatives to promote a collaborative workplace culture. This unit is also responsible for the management and promotion of the Employee Assistance Program. The team of conflict prevention practitioners provides consultations, coaching, facilitated discussions\/mediation, group interventions and training to ISED employees in an impartial and confidential manner. The Centre also provides a forum for HR practitioners, HR experts and mental health champions to share best practices and innovative solutions in the area of mental health in the workplace. More than 200 events have been delivered last fiscal year, reaching out to more than 8,000 public servants across Canada. The Centre delivers workshop with keynote speakers in the area of mental health, wellness, diversity and inclusion in alignment with the National Standard for Psychological Health and Safety in the Workplace. In order to support and equip employees with tools and share best practices in the management of highly productive employees and teams, the Centre works on building capacity and changing culture in the area of mental health and employee well-being. The Office of the Ombudsman provides resources, tools and support to all employees of ISED, in order to maintain a highly productive and healthy workplace. In alignment with the Public Service Renewal Agenda of an agile, equipped and inclusive workforce, and the values of promoting a healthy and productive work environment, the Ombudsman for Mental Health and Employee Well-Being offers a safe, confidential and impartial environment to employees to have informal conversations on workplace issues, including harassment and mental health. The Ombudsman creates a venue to explore options for resolving workplace issues, including harassment, through informal processes. Fosters a more agile, inclusive and equipped ISED to deliver on the department's broad policy, program, regulatory, legislative and service mandate. Works with all of ISED's 7 sectors to shape and steward a compelling ISED brand that reflects an organization with innovation in its name. Actively monitors the 24\/7 media cycle and micro targets specific demographics and subsets of the population, and gathers information from stakeholders such as civil society, PTs, municipalities, Indigenous organizations, global partners, post-secondary institutions and professional associations. A key strategic partner in ISED program success, from the gathering of Public Opinion Research and other evidence to support decision-making, through consultation, to the first public announcement, and through ongoing promotion for the lifecycle of the program. A trusted source of information that businesses, investors and researchers rely on. Informs Canadians about government programs and services to start, grow and help businesses compete in a global economy. Connects ISED and Ministers (Bains, Duncan, Joly, Ng, Jordan, Leblanc\/Morneau) with the Canadian public and supports communications for 17 portfolio partners. Through over 400 ministerial events annually and hundreds of media contributions, CMB reaches national, regional, local and commercial specific audiences through our digital channels, including web and social media, television, radio and print. CMB actively seeks to break through a competitive environment with proactive, targeted media, marketing and online strategies. Supports audit and evaluation functions, Department Audit Committee (DAC) and Performance Measurement and Evaluation Committee (PMEC); Directs development and implementation of practice standards and audit quality assurance regime; Acts as a liaison with External Audit Agencies (e.g. Office of the Auditor General, Office of the Comptroller General). Evaluation results are used to: inform decisions around program resources, improvements and renewal; support Treasury Board submissions and Memoranda to Cabinet; and contribute to corporate reporting (e.g., Departmental Results Report). Develops and implements a multi-year evaluation plan to provide objective, evidence-based assessments of Departmental program spending focusing on relevance and performance. Develops and implements risk-based audit plans and performs assurance and advisory engagements to provide senior management with independent assurance regarding governance, risk management and control processes. Fulfills ISED's obligations under Treasury Board's (TB) policies, directives and standards on internal audit and Policy on Results for evaluation. Provides independent, professional and quality audit and evaluation services, founded on sound values and ethics, to support informed decision-making and enhanced performance and accountability. An advisory body which conducts independent reviews, provides recommendations and advises the Commissioner when making quasi-judicial decisions which principally concern the review of rejected patent applications. By delegated authority, the Trademarks Opposition Board (TMOB) acts on behalf of the Registrar with respect to two types of proceedings: opposition proceedings and expungement proceedings. Delivery of Intellectual Property (IP) Awareness and Education Program to Canadian innovators and businesses; service excellence strategy; client service centre; marketing and communications. Administration and registration of trademarks, geographical indications, official marks, industrial designs, and copyrights under the Trademarks Act, the Copyright Act and the Industrial Designs Act. CIPO is also an International Searching Authority (ISA) and International Preliminary Examining Authority (IPEA) under the Patent Cooperation Treaty administered by the World Intellectual Property Organization. Administration of the patent system under the Patent Act, including the substantive examination of applications and the granting of patents in Canada. Manages ISED's financial resources and provides expert advice on the design, implementation and monitoring of ISED's Grants and Contributions programs. Supports employees and the department by providing direction and services in support of diversity, mental health, talent management, workforce planning, classification, staffing, occupational health and safety, training, compensation, as well as labour relations and employee assistance programs. Provides advice to senior management and the Department's Chief Financial Officer on the strategic alignment of programs (and internal services) and reports on whether they are collectively achieving intended results. It coordinates ISED's enterprise business management process and management governance model, drafts parliamentary reporting and supports the Department with Centres of Expertise in Risk and Performance Management. Manages contracts and materiel assets, oversees the department's financial operations, establishes and implements financial policies and systems, and provides quality assurance and internal control functions. Ensures that ISED employees can work in a safe, secure environment and have the accommodations they need. The branch ensures the safety and protection of the department's employees, safe-guards information and assets from compromise, and ensures continuity of departmental operations and services during security events, disruptions and emergencies. Special operating agency; the Superintendent of Bankruptcy is a Governor in Council appointee with independent and quasi-judicial authorities; regulates and oversees the insolvency system in Canada; contributes to an efficient marketplace by maintaining the integrity of the national insolvency system, thereby strengthening confidence of investors, creditors and the public in the Canadian economy. The agency develops and enforces the laws for marketplace transactions; approves and certifies measurement technologies; investigates complaints of suspected inaccurate measurement; oversees private sector organizations recognized to perform inspections; and monitors marketplace accuracy performance. Oversees the legislative and regulatory frameworks governing trade measurement in Canada, supporting a fair and competitive marketplace by ensuring the accuracy and reliability of financial transactions involving measurement. Federal incorporation and post-incorporation services; creating policies and regulations that allow small, medium and large corporations, entrepreneurs and not-for-profit organizations to perform corporate transactions easily and efficiently. Responsible for horizontal policy coordination on small business related matters, advancing inclusive entrepreneurship to increase the economic participation of underrepresented groups such as women (through the Government of Canada's Women Entrepreneurship Strategy), Indigenous Canadians and others; developing policies and programs to foster vibrant start-up and scale-up ecosystems; implementing financing policies and programs such as implementation of new venture capital programming and the Canada Small Business Financing Program; Oversight of the Business Development Bank of Canada's relationship with the government; coordinating ISED's role in advancing social innovation and social finance for Canada; coordinating consumer protection policies through the Office of Consumer Affairs; and advancing policies supporting co- operatives. Office of Consumer Affairs is no longer a branch the functions (consumer policy) were realigned under the Small Business Branch. Delivers contribution programs to increase high-speed broadband coverage, improve security, access and affordability, enhance digital skills and literacy, and provide Internet access to technology keeping Canadians at the leading edge of the digital economy. Develops spectrum management regulatory and operational policies and procedures; authorizes and manages radio spectrum (excluding satellite services); investigates radio-communications interference across the country; updates legislative and regulatory instruments as required. Develops spectrum licensing policies; conducts spectrum auctions; works with auction consultants on the development of sophisticated software and bidder training; monitors international developments; reviews spectrum regulation best practices and metrics to ensure ongoing effort and improvement. Develops technical standards, regulations and band plans; regulates telecommunications terminal and wireless equipment; works to improve the security of the national telecommunications and information infrastructure against cyber-attack. Federal government's primary laboratory for research and development in advanced telecommunications with a focus on wireless. Solves spectrum challenges to maximize the economic and social benefits from radio frequency spectrum; supports other government departments in resolving critical wireless communications issues. Note: Fiona Gilfillan has been designated by the attorney general to take on the role as the crown's deponent in a major litigation process. Fiona will continue to play a leadership role in the management of STS to the extent that her duties for the court case allow. Also responsible for the Science, Technology and Innovation Council Secretariat and implementing the Post-Secondary Institutions Strategic Investment Fund Advises on clean technology financial initiatives, including working with the Business Development Bank of Canada and Export Development Canada on clean technology project finance. Led by Andrew Noseworthy, Assistant Deputy Minister Clean Technologies, Innovation, Science and Economic Development Canada, and Federal Co-Chair, First Ministers' Meeting Working Group on Clean Technology, Innovation and Jobs. Advising on the work of the Natural Sciences and Engineering Research Council of Canada and the Social Sciences and Humanities Research Council of Canada Leads on intramural science; renewal of federal science infrastructure; development of integrated and horizontal science and research policy agenda and engagement with 20 science-based departments agencies specific policy areas, including environmental policy, clean technology policy and antimicrobial resistance; international and intergovernmental relations; liaison with the National Research Council of Canada; trend analysis on science and on research and development expenditures and activities; and identifying and developing roadmaps for key science issues and provide science and research policy, program and investment advice to the Deputy Minister and Minister. Also shares responsibility for the Clean Growth Hub with Natural Resources Canada, a whole-of-government initiative focused on supporting clean technology companies and projects, improving federal program coordination, and enabling tracking and reporting on clean technology results across government Delivery of Innovative Solutions Canada, a research & development program that supports the growth and commercialization efforts of companies by issuing government challenges and facilitating the testing of prototypes. Delivery of the Innovation Superclusters Initiative, which pulls together large firms, innovative small and medium- sized enterprises, and post-secondary and industry-relevant research institutions, business leaders to build business-led innovation superclusters at scale. Delivery of the Strategic Innovation Fund, which supports innovation projects across all industrial and technology sectors that help position Canada to prosper in the global knowledge-based economy. Responsible for delivery of Innovation Canada's new platform (innovation.canada.ca), the Accelerated Growth Service, and BizPaL, which simplify and streamline the processes that innovators use to access support, permits and licenses from across government to start and grow their businesses. Responsible for performance measurement, governance and delivery of the IP Centre of Expertise. Also responsible for the adoption of digital technology, digital process, digital mindset and culture at ISED to spur digital innovation in the successful delivery of our strategic priorities. Supports the Economic Strategy Tables towards economic growth and innovation in key sectors, and coordinates departmental efforts in helping industry to find, develop and retain talent, including the establishment of Skills Hubs with industry Chief Executive Officers (CEO). Policy development, and business intelligence and analysis for a wide range of sectors, including manufacturing, food processing, life sciences and consumer products. Automotive and digital technologies policy development, as well as business intelligence and analysis; Space, defence, marine and aerospace policy development, as well as business intelligence and analysis. Through defence and coast guard procurements, application of the Industrial and Technological Benefits Policy to generate economic benefits for Canada. Responsible for intelligence gathering, and acting as a public-face on behalf of ISED in the regions. Responsible for corporate governance, competition, bankruptcy and insolvency, intellectual property, Standards Council of Canada relationship, Canada's Digital Charter (with SRRB), privacy (including Personal Information Protection and Electronic Documents Act ), and anti-spam (including Canadian Anti-Spam Legislation). Responsible for the Telecommunications Act; broadband, wireless and Internet policy; and international telecom agreements and treaty binding organizations. Responsible for establishing a formal structure to support federal-provincial-territorial policy and portfolio analysis and coordination; international and Canada–U.S. relations and trade policy; support for domestic and international artificial intelligence initiatives; and regional liaison. Responsible for the government's microeconomic policy agenda, the federal budget, the Innovation and Skills Plan, Canada's Digital Charter (with MFPB), strategy, policy integration, economic research and analysis, delivery and results, Statistics Canada portfolio relationship, organisation for Economic Cooperation and Development grants program, GBA+, and the data office. Digital technologies are changing the nature of competition in the global economy which is creating new opportunities Funding for innovation programing increased but the number of innovation programs reduced by 2\/3 Each supercluster is represented by an industry-led, not-for-profit organization that acts as a central organizing body responsible for executing the supercluster strategy to achieve the objectives of the ISI. In Budget 2017, the Government committed $950 million over five years to strengthen Canada's most promising clusters. Industry partners in the superclusters must match federal contributions dollar for dollar. For the first time, high income countries have more people aged 65+ than under 15 Support businesses to think and act globally, grow, take on risk and participate in global supply chains. Improve competitive intensity of Canadian industries and reinforce framework policies and institutions to anticipate and respond to global economic shifts. The Honourable Bill Morneau assumed responsibilities related to intergovernmental affairs and internal trade while Minister LeBlanc is on a temporary leave of absence. Minister LeBlanc is primarily supported by the Privy Council Office. In support of Minister LeBlanc, ISED continues to provide policy support to advance ongoing internal trade negotiations including providing resources to PCO. Minister Jordan is primarily supported by Infrastructure Canada. ISED supports the Minister on the coordination and delivery of broadband programming in rural and remote areas through such initiatives as the Connect to Innovate program. Minister Joly's main initiative being developed out of ISED is the Federal Tourism Growth Strategy. This strategy is based in developing the supply side of tourism offerings across Canada and aims to drive growth in rural areas as well as urban centres, as opposed to the traditional focus of increasing tourism demand. The Strategy is centered around three initiatives: the Canadian Experiences Fund (administered by the Regional Development Agencies), which has already commenced funding projects across the country; and two remaining initiatives under development, a new Economic Strategy Table dedicated to the visitor economy, and the establishment of Regional Tourism Investment Groups. These groups will be co-led by Destination Canada (a Crown corporation within the ISED portfolio) and the Regional Development Agencies, designed to bring together partners from all levels of government in order to better align investments in tourism products across the federal government, and across jurisdictions, and to attract more private investment to the sector. Work on Minister Joly's mandate is divided between ISED and Canadian Heritage. Her primary support at ISED is provided through the office of Deputy Minister Guylaine Roy. The Government has taken a focused approach to start-ups and scale-ups, but work remains in order to help SMEs maximize their export potential, adopt digital technologies, and attract a highly skilled workforce. This commitment to SMEs is borne out through programs such as the Venture Capital Catalyst Initiative (VCCI), which will increase late-stage Venture Capital available to Canadian entrepreneurs, through a federal investment to support innovative Canadian companies. In addition, the Export Diversification Strategy led by Global Affairs Canada, is supported by ISED with a commitment to inclusive growth for SMEs through initiatives like the Women's Entrepreneurship Strategy. From basic and applied R&D, through commercialization, market development, and finally scale-up and market expansion, Canadian businesses have access to a number of initiatives. ISED works with portfolio partners and other government departments to deliver investments and programs like the Strategic Innovation Fund (SIF), the NRC's Industrial Research Assistance Program (NRC-IRAP), regionally tailored innovation programming delivered by the Regional Development Agencies (RDAs), and assistance from the Canadian Trade Commissioner Service. These initiatives represent a whole-of- government approach designed to help SMEs develop new ideas, grow their business, and access new markets. ISED work in support of Minister Ng's mandate is focused on support to Small and medium-sized enterprises (SMEs) in order for them to become globally competitive exporters. The government of Canada's recent restructuring of its innovation programming supports SMEs across the full innovation continuum, and the ISED innovation platform acts as the single-window access point for business. The Council on Science and Innovation (CSI) is currently being established as an independent advisory body mandated to provide ISED with expert advice on policy issues related to science and innovation. This council replaces the Science, Technology and Innovation Council (STIC) as a more transparent body. The CSI's advice will support the Government of Canada's efforts to strengthen the science and research ecosystem and stimulate innovation across the country's economy. Recent Budget investments have provided funding to support graduate students, to stabilize the Canadian Foundation for Innovation, and to support the implementation of a Digital Research Infrastructure Strategy (DRI). The strategy will help ensure researchers across all disciplines in Canada's academic community have access to the tools they need to harness big data and conduct world-class research. Budget 2019 also proposed the establishment of a Strategic Science Fund to support third-party science and research organizations. It will operate using a principles-based framework for allocating federal funding that utilizes competitive, transparent processes. ISED is continuing its work to advance the design of the Fund, through a review of the third-party organizations in collaboration with several federal departments and agencies, as well as TPOs, the CSA and the Canadian Research Coordinating Committee. Work in support of Minister Duncan's mandate is being undertaken at ISED to create a more inclusive research ecosystem while renewing emphasis on the importance of sound science advice and evidence-informed decision-making. In Budget 2018, we saw the single largest investment in fundamental research in Canada's history of almost $4 billion including funding to renew federal labs and provide needed infrastructure. In 2017, Dr. Mona Nemer was also appointed as our Chief Science Advisor (CSA). The next phase of the ISP will be to fully realize a competitive, data-driven, digital economy accessible to all Canadians across the whole of the country. As the innovation ecosystem shifts to one that is built on intangible assets like intellectual property and data, ISED is committed to developing strategies that continue to foster advancements in areas including artificial intelligence, advanced manufacturing, and technology adoption; all of which have significant economic and social benefits. Embracing digital and data-driven technologies provides an opportunity to push the boundaries of what is possible. This push for change, however, must be underpinned by a sense of trust and transparency between citizens, companies, and governments. That is why ISED's policy thinking in the digital and data sphere will continue to be not only innovative, but also people-centered and inclusive. Since 2016 and the election of a new government, ISED has led the development of an integrated, whole of government Innovation and Skills Plan (ISP) for Canada. While Canada's economic growth has kept pace with other G7 countries, it is accepted that we are entering into a period of slow economic global growth – and ISED's role in developing innovation policies and programs will be central to ensuring Canada remains competitive. Traditionally, we have addressed slower productivity through strong macro-economic frameworks supported by tax incentives that promote innovation. The ISP was developed to establish a balance of indirect and direct supports, and focus on ecosystems and the benefits they create through new initiatives such as Innovation Superclusters, the Economic Strategy Tables, and the Strategic Innovation fund. These initiatives make up a significant re-imagining of innovation programming that builds on strong collaboration with the private sector to drive growth. In order to provide support as you step in to your role as Deputy Minister within this wide-ranging portfolio, below you will find a brief overview of key Ministerial initiatives. ISED is a department mandated to foster a growing, competitive and knowledge-based Canadian economy. The larger ISED portfolio contains 16 agencies and supports four Ministerial mandates. ISED works toward a policy agenda that focusses around three pillars: efficient marketplace regulation; science, technology and innovation; and, support for business. To this point, there has been little discussion of a recession in Canada. Scotiabank's recession probability model suggested that the likelihood of a recession occurring over the 2019-20 period is low but rising. It explains that the yield curve inverted in March, as three-month T-bills ended the month at 1.67% while the 10-year government bond rate was 1.62%. However, the fact that consumer confidence grew each month from January to March suggests that conditions for a recession are still benign. Based on these factors, Scotiabank's model-implied probability to of a recession emerging in Canada in 2020 was 11%. That said, if Canadian consumer confidence were to start deteriorating in the coming months, the probability of a recession would rise. In Canada, there is a consensus that the economy is entering into a period of slower growth. GDP growth is expected to decline from just under 2.0% in 2018 to 1.3% this year, as global trade conflicts and related uncertainty are weighing on business sentiment and holding back economic activity. Looking further ahead, economic growth is forecast to strengthen to slightly above potential in 2020 and 2021, reflecting a moderate expansion in consumption, a recovery in housing, and an improvement in the combined contribution of exports and business investment. There is a consensus among forecasters that China's economy is set to gradually slow from the 6.6% estimated for 2018 to around 6.0% by 2020, as the negative effects of escalating tariffs and weakening external demand have added pressure to an economy that is already in the midst of a structural slowdown and in need of regulatory strengthening to rein in a high dependency on debt. If the slowdown turns out to be more pronounced than expected, there could be significant reverberations throughout the global economy given China's strong trade linkages around the world. According to the OECD, a decline of 2 percentage points in the growth rate of domestic demand in China over a two-year period would lower global GDP growth by close to 0.4 percentage points in the first year, with the impact being relatively more severe in Japan, commodity-producing economies, and other economies in East Asia. Furthermore, spillovers from a slowdown in China would be larger if monetary policymakers around the world were not able to react properly. In Europe, business sentiment continues to be dampened by headwinds from political and trade uncertainties, with industrial production being hit particularly hard. Economic growth is projected to remain weak over the near-term, as fading intra-area trade growth, high political uncertainty, and moderating confidence suggest that weakness in demand might persist. In Germany, a broad-based deterioration in recent monthly indicators has increased the likelihood of a recession. In particular, multiple setbacks have contributed to four consecutive quarterly declines in industrial production, and an escalation of the US-China trade war could further exacerbate the economy's weaknesses. Furthermore, a deep slump in Germany's manufacturing sector has increasingly spread disruption in supply chains throughout Europe. In Italy, preliminary data indicate that growth was flat in the second quarter, which is fuelling speculation of a return to recession after the economy managed to edge up 0.1% in the first quarter, the only instance of positive growth realized in the last five quarters. Additionally, fresh political uncertainty could weaken an already fragile economic outlook. Meanwhile, risks associated with Brexit continue to inhibit investment in the UK, as the unprecedented uncertainty associated with possibility of a no-deal separation has weighed on the UK economy. Of note, a recent Bank of England survey has revealed that business confidence has continued to worsen and investment intentions are at their lowest point since January 2010. The National Association for Business Economists (NABE) recently surveyed 300 of its members and found that nearly three-quarters of them believe that the US will enter into a recession by the end of 2021. Specifically, 2% expect a recession to begin this year, 38% call for one to commence in 2020, while 34% expected one the following year. In the previous survey, conducted in February, a similar proportion of economists (77%) expressed the view that a recession would emerge by 2021. However, the main difference between the two surveys is that more economists now expect the recession to begin later than they did in February. Even if a recession does not occur in the foreseeable future, a slowdown in US economic growth could have a significant impact on the global economy, as it has served as an important driver of growth during a period when other major economies had slowed. The notion that a recession could emerge in the US in the near-term is gaining some traction. For instance, the Federal Reserve Bank of New York has developed a recession-probability tracker based on yield curves, which puts the chance of a recession emerging over the 12-month period preceding next July at 31.48%, slightly lower than the preceding month, but still the second-highest level on record since July 2008. The Federal Reserve Bank of Cleveland obtained a similar result in its own analysis of yield curves, which put the probability of the economy being in recession by next July at 35.4%, down slightly from 37.8% in June, but still among the highest levels on recent record (see Graph). It should be noted that these results do not consider the inversion of the yield curve in mid-August, which is widely accepted as a harbinger of possible recession. This occurred because market traders rushed to buy longer-term government bonds, which drove down the 10-year bond yields to the point that they fell below those of three-month bills. GDP growth in the US is projected to moderate from nearly 3.0% in 2018 to below 2.0% in 2020, as the temporary boost provided by the Tax Cuts and Jobs Act (TCJA) and increased federal government spending continue to fade. The US economy managed to rebound from a weak fourth quarter to advance 3.1% in the first quarter of 2019, before falling closer to 2.0% in the second quarter. The strong first quarter growth was supported by net exports and inventories, which have been volatile in the face of trade actions, while domestic demand was softer than expected and tariffs contributed to weaker imports. These developments suggest that momentum will likely slow over the remainder of the year. If that is the case, then US economy may have already joined in the slowdown that is underway in Europe, China and a number of other strategically important countries, after managing robust growth while other economies faltered in the second half of 2018. Forecasters have identified a number of factors that may have contributed to the recent downward revisions and represent significant risks going forward, including the possible emergence of a global recession. Among the most cited are the ongoing trade tensions between the US and China, which have weighed on global business sentiment and economic activity. There are concerns that a further escalation of this situation could lower foreign demand to the point of disrupting global value chains and reducing commodity prices. Another key risk being considered by forecasters is the uncertainty surrounding the final outcome of Brexit, as a no-deal separation between the UK and Europe, which would likely be disruptive and generate negative cross-border spillovers, remains a distinct possibility. There is also the possibility that a faster-than-expected deceleration of economic growth in China could further weaken growth prospects. Past experience has demonstrated that concerns about the performance of China's economy have the ability to trigger abrupt, wide-reaching sell-offs in financial and commodity markets, which puts significant pressure on China's trading partners, commodity exporters, and other emerging markets. The latest forecasts released project that global economic growth will ease in 2019 and 2020, with some downgrading their earlier projections. In particular, forecasts by the Bank of Canada, IMF, and the OECD call for global economic growth to slow from around 3.6% in 2018 to closer to 3.0% in 2019, before improving slightly the following year (see Table). Global growth has already slowed sharply over the past year, particularly in the latter half of 2018, with only a slight improvement in the first quarter of 2019. This weakness is largely a reflection of deep recessions in some emerging-market economies and widespread weakness in industrial sectors. Thus far, most of the slowdown has been concentrated in the manufacturing sector, though the service sector has also softened in recent months. Most forecasters generally agree that global economic growth will slow this year. While this is consistent with earlier forecasts, a new development is growing concern about the possible emergence of a global recession in the near-term, as trade headwinds are aggravating economic slowdowns in some countries, and bond markets are reeling globally. We also provide short summaries of economic outlooks for large economies and regions (e.g., the US, Europe, China, and Canada). Given that Canada is a small open economy that is highly integrated with that of the US, the recently signed CUSMA has reduced trade policy uncertainty and the associated drag on business investment to some extent, even though ratification is still pending (Bank of Canada, Global Affairs Canada). Also, Canadian non-energy exports should receive a boost from the recent removal of US steel and aluminium tariffs (Bank of Canada, 2019, Global Affairs Canada). However, the Bank of Canada still estimates that trade policy uncertainty will dampen Canadian exports by around 1.5% by the end of 2021, as the US and China have not yet managed to reach an agreement on their trade dispute, which is contributing to a broad-based slowdown of global economic activity and a moderation in the growth of both trade and business investment (Bank of Canada, July 2019). In a recent update, Finance Canada estimated Canada's tax competitiveness relative to some of our closest competitors. It showed that Canada's average marginal effective tax rate is the lowest among G- 7 nations and below the average for OECD countries. Canada also has an overall tax rate that is significantly lower than that of the US, with an average tax advantage of 4.6 percentage points (Department of Finance, 2019). The US implemented tax reforms at the beginning of last year (January 2018) aimed at improving the competitiveness of the American tax regime, which included lowering corporate tax rates, and removing a long-standing structural incentives for US–based multinationals to invest abroad and defer the repatriation of foreign profits. In response, Canada sought to mitigate the erosion its previous tax advantage relative to the US by recently introducing new tax incentives designed to encourage investment and support technology adoption. Specific measures included allowing the full cost of machinery and equipment used in manufacturing and processing of goods to be written off immediately for tax purposes, allowing specified clean energy equipment to be eligible for an immediate full write-off of the entire cost, and implementing an accelerated capital cost allowance to allow businesses of all sizes to claim a larger deduction for the depreciation of their capital investments (Fall Economic Statement, 2018). The Canadian economy is also facing large shifts in employment and skills as the world becomes increasingly digitalized, with automation expected to replace 9% jobs over the next 10-20 years and create 2.4 million jobs over the next 4 years alone (RBC, 2018). These new jobs and tasks will require a different mix of skills, which will have large implications for the workforce. Canada has a good foundation for knowledge and a well-educated population, ranking 2nd in the OECD for 25 to 34 year-olds with postsecondary degrees and 2nd for business upskilling of high-skilled employees. However, many new jobs will be in the ICT field, for which Canada is ranked 24th for ICT graduates' representation in all tertiary graduates (OECD, 2017). As automation takes over many tasks, new mixes of skills will be in demand, with more emphasis on problem solving, as well as analytical, digital and interpersonal skills across all occupations. Digital adoption and embracing new technology-enabled business practices are believed to fuel productivity, economic growth, and international competitiveness. Yet, Canadian firms are slow adopters of new technology (e.g., 21st in OECD for e-commerce, OECD 2017). This is particularly challenging in an era of increasing global competition for leadership in digital and data-driven domains. Canada's overall support to business R&D (direct and indirect) declined in the 2009-2016 period in real terms, whereas other countries have maintained or increased their support for business R&D. Canada's rank among OECD countries also fell from 4th in 2009 for its overall support to business R&D to 13th in 2016. Increases in direct support (i.e., R&D grants and contracts) were not substantial enough to off-set the sharp decline in tax credits. While Canada's R&D support is still geared toward tax credits, its overall R&D support mix (indirect-to-direct ratio) is more balanced in 2016 compared to 2009. Business research & development (R&D) and Information and Communications Technology (ICT) investment are seen as key factors to ensure long-term productivity, sustainable economic growth and high living standard for Canadians. However, Canadian businesses are still under-investing in ICT at 50% of US investment in computer software and databases per worker in 2014 (CSLS, 2016). Similarly, Canada's business R&D relative to GDP has declined since the early 2000s and, as a result, Canada now trails most OECD countries (22nd in 2017). Global trade tensions are still expected to weigh on Canada's outlook for overall exports, while limited transportation capacity will restrain the expansion of energy exports. Looking ahead, Canadian exports are expected to grow moderately over the near-term, supported by an ongoing expansion of foreign demand. During that time, non-commodity exports are expected to post relatively broad- based growth with the notable exception of the auto sector, due in part to changes to the production mandates of Canadian motor vehicle assemblers. Services exports are expected to continue expanding at a strong pace, leading to further gains in its share of non-commodity exports. Energy exports are expected to be flat this year before posting moderate growth during 2020-21 (Bank of Canada, July 2019). Canada posted a merchandise trade surplus of $763 million in May, as total exports rose 4.6% to a record $53.1 billion, with widespread gains across most product sections (Statistics Canada, 2019). Monthly data suggest that wage gains are increasing with the overall strength in the labour market. According to Bank of Canada estimates, wages increased by almost 2.5% in the second quarter of 2019, up from around 2.0% in the first quarter (Bank of Canada, July 2019). Canada added 195,800 jobs in 2018, driven entirely by full-time work. However, this was considerably lower than the previous year, when 417,400 jobs were created to represent Canada's strongest year of job creation since 2002. Canada's labour market is off to a strong start in 2019, as 247,500 jobs have already been added, largely on account the 106,500 jobs created in April alone. These results contributed to the unemployment rate falling to 5.4% in May, the lowest level since comparable data became available in 1976 (Statistics Canada, 2019). The improved global economic growth performance over this past year (and forecasts of 3.8% in 2018 and 3.9% in 2019) is largely a result of monetary and fiscal policy, with self-sustaining economic growth yet to be achieved (OECD, 2018). As such, productivity growth will be an important factor affecting economic growth and prosperity in Canada going forward. But productivity growth continues lag behind, slowing down among advanced economies since the early 2000s, with particular sluggishness following the global financial crisis. For Canada, multifactor productivity rose a modest 0.1% in 2016, contributing to a 0.5% rise in labour productivity overall (Statistics Canada, 2018). However, labour productivity has been growing more slowly in Canada than in most OECD countries over the past two decades. The OECD points to productivity-enhancing reforms to sustain the current expansion and to foster inclusive growth, including, for example, enhancing education and skills, boosting competition, and investing in digital infrastructure (OECD, 2018). Private consumption was the major driver of economic growth in 2017, accounting for 1.9 percentage points of the 3.0% growth in total real GDP (OECD, 2018 and Bank of Canada, 2018). Looking ahead, consumer spending is projected to grow moderately during 2020-21, as households are expected to be cautious about their spending decisions in the face of elevated debt levels. The outlook for consumption and residential investment, which is expected to post modest growth following two years of decline, will be supported by strong employment and sustained wage gains (Bank of Canada, July 2019). Following the global economic downturn and financial crisis of 2008, Canada was the first economy among the G-7 to recover to its pre-recession level of real GDP, aided by prudent financial sector regulation and timely fiscal stimulus. Canada's manufacturing sector was hit particularly hard, as its share of the economy contracted by two percentage points between 2007 and 2009. In fact, the manufacturing sector as a whole has yet to recover to its pre-recession level of real GDP, driven by lagging growth in significant industries like motor vehicles and parts, aerospace, petroleum and coal products, paper, primary metals, fabricated metal products, and furniture. Meanwhile, the goods-producing and primary sectors surpassed their pre-recession levels within a couple of years of the downturn, while the services sector briefly stalled in 2009 before returning to healthy growth. The most recent edition of the Organisation for Economic Co-operation and Development (OECD) Economic Survey of Canada explains that Canada's economy has recovered from the recent period of weakness attributed to the 2014 energy price slump. In particular, the completion of adjustments has helped commodity-producing industries rebound and begin contributing to economic growth in mid-2016. This transition was aided by sound policies, with monetary policy being eased while fiscal policy provided more stimulus (OECD, 2018). Recent estimates by the Bank of Canada is for real GDP growth to fall from the 1.9% estimated for 2018 to 1.3% this year. The slowdown in 2019 is largely a reflection of a weak start to the year, reflecting contractions in goods-producing industries, notably oil and gas construction, as well as a decline in residential investment. Growth is expected to average close to potential over the remainder of 2019. Looking further ahead, the Canadian economy is projected to expand at around 2.0% during 2020-21, slightly above potential, as consumption advances moderately, housing recovers, and the combined contribution of exports and business investment improves. (Bank of Canada July 2019). Canada posted solid economic growth in 2017, when real GDP expanded by 3.0%, better than expected and roughly twice the pace of the previous year. Since the end of 2015, economic growth has averaged almost 2.5%, placing Canada among the leaders for the strongest pace of growth in the G7 (2018 Fall Economic Statement ). Global economic growth is expected to slow from the 3.7% registered in 2018 to 3.0% in 2020 before picking up slightly to 3.2% the following year. This broad-based slowdown in economic activity, in addition to a moderation in both trade and business investment, was largely a reflection of escalating trade conflicts, geopolitical tensions, and related uncertainty (Bank of Canada, July 2019). Recently, there is also growing concern that a global recession could emerge in the near-term, as trade headwinds are aggravating economic slowdowns in some countries, while bond markets are reeling globally (Morgan Stanley, CNBC). Section 2: moving the mandate Building a nation of innovators: present and future Overview ISED is working toward building a nation of innovators and has made great strides on the ambitious Innovation and Skills Plan, which focuses on: People and Skills; Building Ecosystems – Science, Technology, and Superclusters; Investment, Scale-up, and Growing Companies; and, Program Simplification and Reorganization Background Through the Innovation and Skills Plan, the Government has taken significant action to position Canada as a world-leader in a changing innovation-driven economy. This partnership approach has put the country on track to become one of the world's most innovative and competitive economies. Over the Government's mandate, the plan has received strong support and is beginning to demonstrate meaningful results. However, innovation is an ongoing journey, and to achieve enduring success, we will need to continue to build on these accomplishments and improve our global competitiveness. This Plan recognizes that innovation and skills as the core drivers of economic growth and rising standards of living for all. Announced in Budget 2017, the Plan represents the most significant redesign of federal programs to support business throughout the innovation ecosystem. This ecosystem approach emphasizes greater collaboration and strong partnerships between firms, academics and other partners to create a culture of innovation. Collectively, we are bridging the gap from idea, to commercialization, to investment and scale-up. Key developments Since 2016, ISED directed the development of an integrated, whole-of-government plan for Canada. Previously, the traditional course had been to ensure a strong macro- economic framework to promote innovation whereas the redesign is a balance of indirect and direct supports. The Plan focuses on ecosystems and the benefits that they create, targeting and tailoring our programming to specific sectors in high-growth areas and aiding firms at different stages of growth and needs. Through investments such as the Strategic Innovation Fund, the Industrial Research Assistance Program, and Regional Development Agencies, the Plan takes a client-centric approach to working with firms at every stage of growth to help start-ups and SMEs grow into global leaders. Innovation Canada's digital platform furthers this approach by offering a timely, 'one-stop shop' to match businesses with our programs and services. The Superclusters are accelerating the development of large-scale business-led innovation. The initiative encourages industry-driven R&D activities, pools access to leading research, and links larger firms with innovative companies to help them scale-up, attract investment, and create globally competitive hubs. Drawing from the recommendations from the Economic Strategy Tables, an industry-led forum to drive Canadian innovation and competitiveness. The recent budget contained significant announcements related to the Tables' reports including a Regulatory Competitiveness Council, an accelerated investment incentive, and high-speed internet access for all. Ensuring that businesses have the right pipeline of talent to succeed starts with equipping Canadians with the right tools, skills and experience, and through the establishment of reliable access to global talent. The Plan greatly increased the number of work-integrated learning placements for young Canadians and launched (and then made permanent) the Global Talent Stream to help innovative companies grow, flourish, and create more jobs for Canadians. Looking ahead A focus on a data-driven, digital economy will be important to continue to push the boundaries of innovation and spur Canada's economic growth. We heard clearly during the National Digital and Data Consultations last year on how together we can drive innovation, prepare Canadians for the future of work, and ensure they have trust and confidence in how their data is used. Launched in May of this year, the Digital Charter is to guide our whole-of-government approach to building an innovative, people-centred, and inclusive digital economy. Finally, space exploration represents the very essence of innovation. It inspires all of us to push the limits of what is possible and makes Canadians proud of what we can achieve. The National Space Strategy was launched in March 2019, and together with an investment of $2.05B, we will support future generations of innovators and explorers, and ensure that Canadians are well-positioned to lead in the jobs and industries of tomorrow. Growing Canadian competitiveness: suite of innovation programming Canada is competing in a global innovation race Other countries are focusing on innovation The Innovation and Skills Plan Innovation Canada: Comprehensive support for innovation Innovation Canada overview: Created in June 2017 to re-align federal innovation supports and streamline the innovation programming available to Canadian entrepreneurs Established as a major redesign of Canada's federal innovation policy and program landscape, representing a significant shift in the delivery of innovation funds Client-centred single-window service allowing businesses to easily access federal support Acts as the catalyst for building dynamic private-public R&D partnerships Innovation Canada includes the following programs and initiatives: Innovation Superclusters Initiative (ISI) Strategic Innovation Fund (SIF) Innovative Solutions Canada (ISC) Accelerated Growth Service (AGS) Innovation Advisors Innovation Canada Portal (innovation.canada.ca) BizPaL Clean Growth Hub (CGH) The Innovation Canada continuum Innovation Canada is made up of programs and services that cover a range of innovation activities Innovation Canada connects partners from across the federal innovation ecosystem to align policy development, program implementation and performance measurement Innovation Canada & OGDS Innovation Superclusters Initiative (ISI) ISI aims to accelerate the growth and development of large-scale business-led innovation superclusters, building upon Canadian strength, leading to new opportunities for growth A $950 million investment in 5 business-led superclusters aimed at creating jobs, advancing research, and building Canada's innovation economy through collaboration of large anchor firms, start-ups, SMEs, post-secondary institutions, and research & government partners: Digital Technology Supercluster Protein Industries Supercluster Advanced Manufacturing Supercluster AI-Powered Supply Chains Supercluster – SCALE.AI Ocean Supercluster $50B and 50,000 jobs to be added to Canada's economy over 10 years 13 projects announced to date: Digital Technology: 7 Protein Industries: 1 SCALE.AI: 4 Ocean: 1 These projects leverage $63M in ISI and industry investments, and engage: As of July 18, 2019: 32 SMEs 19 large firms 10 post-secondary institutions \"We are already seeing companies coming together to work on truly transformative technology projects and develop new programs for digital skills in manufacturing — initiatives that have taken off just by introducing businesses to one another. The power of connecting entrepreneurs across industries and technologies is truly remarkable.\" Jayson Myers, CEO, Next Generation Manufacturing Canada Canada's Five Superclusters Digital Technology British Columbia (500+ participants) $153M Virtual, mixed and augmented reality, data collection and analytics, quantum computing, and genomics and precision health. Impact: $5B GDP over 10 years 13,500 jobs AI-Powered Supply Chains (SCALE.AI) Quebec (110+ participants) $230M Artificial intelligence and supply chain technology. Impact $16.5B GDP over 10 years 16,000 jobs Protein Industries Prairie provinces (100+ participants) $153M Agri-food enabling technologies, including genomics, processing, and IT. Impact $4.5B GDP over 10 years 4,500 jobs Ocean Atlantic Canada (110+ participants) $153M Digital sensors and monitoring, autonomous marine vehicles, energy generation, automation, marine biotechnology and engineering tech. Impact $14B GDP over 10 years 3,000 jobs Advanced Manufacturing Ontario (130+ participants) $230M Internet of Things, machine learning, cybersecurity, additive manufacturing (3D printing). Impact $13.5B GDP over10 years 13,500 jobs Outcomes Expected to add 50,000+ jobs and $50B to Canada's economy over next 10 years Up to $950M over five years for selected industry-led innovation superclusters Industry partners match program contributions dollar for dollar Building innovation ecosystems Creating new pools of talent Attracting anchor firms and international investment Conducting multidisciplinary research Connecting SMEs to larger firms, integrating value chains Strategic Innovation Fund (SIF) Supports innovation projects across all industrial and technology sectors with the aim of establishing Canada as a top destination for businesses to invest, grow and create jobs and prosperity for Canadians As of July 17, 2019: 54 projects worth $1.7B, representing a total investment of $42B 60,000+ jobs created or maintained $7.5B in secured R&D commitments 45% of SIF projects are direct investments in SMEs 9.2k committed co-op opportunities (June 19, 2019) 5 different program streams: Support R&D. Accelerates commercialization of new products processes and services. Facilitate scale up. Anchors and aids in expanding innovative firms in Canada. Investment attraction. Attracts and retains large scale investments into Canada. Tackle grand innovation challenges. Competitive calls for collaborative industrial R&D and tech demo projects. Support to national ecosystems. Invest in strategic, high impact collaborations in areas of Canadian advantage. SIF success story: Ranovus Inc., Ottawa High-growth SME developing cutting-edge energy & connectivity solutions for data centres, that will double data processing capacity while significantly reducing its environmental impact. $20M SIF contribution towards a $50M project. Ranovus will grow from 34 employees to approximately 600. Innovative Solutions Canada Innovative Solutions Canada (ISC) is an R&D program that leverages procurement to support the growth and scale-up of Canadian companies, and positions the Government of Canada as a first customer Challenge Stream: Facilitates development of early stage R&D with the potential to address specific challenges identified by federal departments\/agencies, as well as marketplace gaps associated with government priorities ($113M annual budget) 45 challenges released since program launch 40 proof of concept contracts awarded ($150k each) 1 proto-type contract awarded ($1M) $57.6M in committed challenge funding Testing Stream: Facilitates testing of a wide range of late stage R&D associated with government priorities and specific operational requirements ($40M annual budget) 409 contracts awarded $176M total value of contracts 80% commercialization rate for firms 36 testing departments Calls for proposals issued under both streams of the program will be accessible through a digital single window Challenge Stream success story: CEM Works Inc., Winnipeg Developing new technology to make connected vehicles safer in a 5G environment Received a $150K grant to develop a proof of concept of its solution First company under ISC to receive $1M grant to develop a working proto-type Testing Stream success story: Sensequake, Montréal Development of the 3D-SAM™ seismic sensing system with Natural Resources Canada, Transport Canada and Public Services and Procurement Canada Received a $645K ISC contract for testing at 6 laboratory and research buildings in Ontario and British Columbia Program participation led to $1.1M in follow-on commercial sales and the creation of 10 STEM jobs Accelerated Growth Service (AGS) Provides high-growth firms with single-window access to government programs and services, and assistance from a dedicated team built based on their needs Led by ISED and jointly-delivered with BDC, EDC, Trade Commissioner Service, NRC-IRAP, regional development agencies and other partners AGS's clients access a dedicated advisor and a customized plan of programs\/ services to address their needs, such as financing, exporting, innovation, and business advice As of July 4, 2019: 547+ high-growth firms served $440M in funding unlocked 4,040+ services provided 40+ external partners 30+ Innovation Advisors expected by end of fiscal year Over 500 companies served are SMEs AGS targets Canadian firms with the following characteristics: annual revenues of $5 million or more a strong management team and a history of growth a unique value proposition with a focus on export markets and innovation AGS success story: LuminULtra, New-Brunswick Biotech SME that developed & commercialized a DNA-based water quality test. AGS helped bring the commercial solution to market here, and export it to other markets where access to safe water is most needed \"It's not just financial support, but also solid advice, internal expertise and tech savvy that really propelled us forward.\" Pat Whalen, President & CEO Innovation Advisor service Expert Innovation Advisors across Canada provide high-potential firms with the assistance needed to make the right connections to move their growth objectives forward Whether SMEs are creating a new innovative product, process or service, an Innovation Advisor can help them find funding, expertise, facilities and global opportunities The Service provides free, one-on-one assistance over the phone or in-person and leverages Advisors' industry experience, extensive networks and knowledge to advise clients and guide them to the right connections, programs and services As of March 30, 2019: Nearly 3800 innovative SMEs served across Canada Businesses receive a response within 2 business days 30+ Innovation Advisors expected by end of fiscal year Innovation Advisor success story: Hortau, Lévis QC Agriculture technology SME that developed & commercialized an irrigation control solution to maximize production of high-revenue, sensitive crops, like cranberries An Innovation Advisor assessed Hortau's needs, building on their success with NRC-IRAP to help them access $5.9 million from Sustainable Development Technology Canada to take their technology and their business to the next level Innovation.canada.ca The Innovation Canada portal provides users with a tailored list of business supports including grants, contributions, advisory services, loans & guarantees, and more in less than 2 minutes Canadian firms working on R&D projects can access a tailored list of government services and programs relevant to their enterprises and be provided with regional and sector specific guidance New feature allows for innovators to create a business account & receive service notifications Aimed at improving ease-of-access to business supports & freeing up time for firms to focus on growth and innovation As of July 4, 2019: 1M+ visits since launch (January 2018) 1,960 average daily users AI integrated to enhance program matching (June 2018) 1,300+ government programs & services filtered based on innovator needs 50.5% of total visits, associated with companies with less than 100 employees \"#InnovationCanada tool long-time @CdnChamberofCom ask. Big step forward for entrepreneurs seeking one-stop info re gov't support.\" Tweet from the Canadian Chamber of Commerce BizPaL A unique collaboration across all levels of government supporting entrepreneurs in finding the required permits and licenses to start and grow their businesses Collaborative decision-making taken by a steering committee formed of a representative from the federal government, all 13 provinces and territories, one municipality and one First Nation Includes 1,075 partners from the federal government, all provinces and territories, 1,057 municipalities, and 4 First Nations, including all affiliated departments and ministries 2019 improvements include enhanced search results and formatting for a quicker andmore refined user experience As of July 4, 2019: 497,945 unique visits (2018-2019) ≈150,000 permit and licence searches (2018-2019) $13M+ saved to businesses (2018-2019) 15,000+ permits & licences from all levels of government 80% of Canadian population served by BizPaL \"The BizPaL tool will make it easier for small businesses… to access the information they need from all levels of government. As a small business owner, I know how challenging it can be to navigate permit requirements and processes, and BizPaL walks you through it step by step. I'm really pleased that we're now able to offer this service to our community.\" Bob Wells, Mayor, City of Courtenay Clean Growth Hub (CGH) Whole-of-government focal point for clean technology focused on supporting companies and projects, coordinating programs and tracking results Jointly led by ISED and Natural Resources Canada, the Hub's team of experts from across government helps clean technology developers and adopters identify the federal programs and services most relevant to their needs Under the Clean Technology Data Strategy, the Hub works to enhance federal program coordination and strengthens federal capacity to track clean technology outcomes Enables systematic information sharing and intergovernmental collaboration with 2 MOUs with the Province of B.C. and Western Economic Diversification 1,150+ clients since program launch $133M incremental clean technology investments unlocked through project off-ramping 78% of businesses accessing services are SMEs 73% of surveyed clients followed up on Hub service advice 16 participating departments and agencies 60+ outreach events As of July 4, 2019 Success story: Siemens – NB & NS Power Smart Grid CGH initiated discussions with multiple federal partners to share information and understand strategic benefits of a complex project led by Siemens The $92.7M project received $35M from SIF and NRCan, supporting up to 241 highly skilled jobs Project will improve power delivery to communities, better integrate renewable energy into the power grid and reduce future electricity costs for consumers. ExploreIP: Canada's IP Marketplace ExploreIP is an online tool that provides access to listings of public sector-owned patents User-friendly interface makes it easier for businesses to discover and licence new technologies Provides public sector organizations with new opportunities for commercialization and collaboration Expected launch date: Summer 2019 Economic Strategy Tables set ambitious growth targets Advanced Manufacturing Chair: Charles Deguire President & CEO, Kinova Robotics Growth targets By 2030, increase manufacturing sales by 50% - to $1 trillion Increase manufacturing exports by 50% to $540 billion Agri-Food Chair: Murad Al-Katib President and CEO, AGT Food and Ingredients Growth targets By 2025, increase domestic sales by 27% to $140B and increase exports by 32% to $85B Clean Technologies Chair: Audrey Mascarenhas President and CEO, Questor Technology Inc Growth target By 2025, Clean technology is one of Canada's top 5 exporting industries, nearly tripling current value to $20B annually Digital Industries Chair: Tobias Lütke Founder & CEO, Shopify Growth target By 2025, double the number of Canadian digital firms with more than $1B in market capitalization to 26 Health and Biosciences Chair: Karimah Es Sabar CEO & Partner, Quark Venture Growth target By 2025, double exports to $26B double total firms to 1,800 double high-growth firms to 80 Resources of the Future Chair: Lorraine Mitchelmore Former President & Country Chair, Shell Growth target By 2025, grow annual resource exports by $100B to $350B Support for Economic Strategy Tables recommendations The Fall Economic Statements and Budget 2019 contained significant announcements related to the Tables' reports Addressed: Regulatory Competitiveness Council Centre for Regulatory Innovation Accelerated Investment Incentive Access to high-speed internet for all Canadians Expand the Strategic Innovation Fund Increase WIL opportunities across Canada Areas for consideration Skills and talent across sectors Technology adoption Support for high-growth firms Digitalizing access to government services Modernize privacy frameworks for a digital era Infrastructure Annex A: making progress on implementation Progress on Signature Initiatives Most talented & skilled workforce in the world People & skills: CanCode Reached 1M+ students & 53,000 teachers Work-integrated learning 84,000 placements a year by 2023\/24 Mitacs -10,000 placements a year by 2021-22 – 8,000 in 2017\/18, up 300% since 2014\/15 Global Skills Strategy REDACTED Connect to Innovate 192 projects selected covering 900+ communities Develop and adopt new technologies while promoting science excellence to address global challenges Fundamental research: New Vision for Science 25% increase in support for fundamental research, benefiting 21,000 additional researchers and students a year by 2021\/22 Research Infrastructure PSIF: 300 projects, $2B allocated, leveraging an additional $3B CFI: $1B+ allocated since 2015\/16, leveraging an additional $2.3B; providing research tools for 17,500 researchers and 27,000 students Applied R&D & partnerships: Innovation Superclusters Initiative Agreements with all 5 have been signed; 7 projects announced; all superclusters expected to announce projects by June 2019 Expected to add 50,000 jobs and $50B to Canada's economy over next 10 years Intellectual Property Strategy Implementing measures under Canada's first-ever IP strategy Stimulate new investments to grow world-class companies & create middle-class jobs Commercialization & start-up: Innovative Solutions Canada 42 challenges launched across 14 departments Women Entrepreneurship Strategy BDC $391M loans to 5,500+ clients and $19M in investments in 24 companies NRC-IRAP 11,700 projects started since 2015\/16 Total federal funding of $870M, leveraging an additional $1.4B Scale-up & going global: Strategic Innovation Fund 44 projects announced as of May 1 $1.2B allocated to date, leveraging an additional $15.3B Expected to create or maintain over 56,000 jobs RDAs $2.2B allocated since 2015-16 for 5000+ projects, leveraging an additional $6.2B VCCI ($450M) Investing in 5 Stream 1 VC funds-of-funds, 7 Stream 2 VC Funds and up to 3 Stream 3 cleantech VC funds Annex B: REDACTED Annex C: Making progress against ambitious targets People & skills Key initiatives: CanCode Mitacs Digital Skills for Youth Youth Employment Strategy Connect to Innovate Universal Broadband Fund Connecting Families Global Skills Strategy Skills Boost Ambitious targets: 40% of Canadians are in professional, science and tech-related occupations by 2025 Progress to date – 2011: 30; 2018: 34%; 2025: 40% (on track) Increase coding training availability for students across Canada by 2025, including to 500,000 students by 2019 Progress to date – Mar 2017: no data; Mar 2018: 265,000; Dec 2018: 1,000,000 (surpassed) 100% of Canadian households are on-line by 2025 Budget 2109 Target: All Canadians have access to 50\/10 Mbps by 2030 Progress to date – 2014: 85%; 2017: 89%; 2025: 100% (on track) Building ecosystems Key initiatives: Innovative Superclusters Initiative National Research Council Granting Agencies Post-Secondary Strategic Investment Fund Canadian Foundation for Innovation Digital Research Infrastructure Strategy Ambitious targets: Increase Canadian businesses expenditures in R&D to $30 billion (B) by 2025 Progress to date – 2006:$16.5B; 2015: no data; 2017: $18B; 2025: $30B (lagging) Double the % of companies collaborating with higher education institutes by 2025 Progress to date – 2017: 3.2%; 2025: 6% (lagging) Growing companies Key initiatives: Innovative Solutions Canada Women Entrepreneurship Strategy Venture Capital Catalyst Initiative Industrial Research Assistance Program Regional Development Agencies Strategic Innovation Fund Trade Commissioner Service Innovation Canada Accelerated Growth Service Business Development Bank of Canada Export Development Canada Ambitious targets: Double the number of high-growth firms in Canada by 2025 Progress to date – 2011: 11,500; 2013-2015: 14.300; 2025: 28,000 (lagging) Double the number of SMEs majority-owned by women to 340,000 by 2025 Progress to date – 2014: 168,000; 2017: 170,000; 2025: 340,000 (lagging) Grow Canadas exports by 30% by 2025 Fall Economic Statement 2018 Target: Increase Overseas Exports by 50% by 2025 Progress to date – 2014: $628B; 2018: $706B; 2025: $820B (on track) Double the value of Canada's exports of clean technologies by 2025 Progress to date – 2007: $5.4B; 2015: $7.6B; 2017: $9.0B; 2025$15B (on track) Note: Indicators generally lag 1-2 years due to data availability. Canada's digital transformation Overview As part of the next steps of the Innovation and Skills Plan, Canada is seeking to advance its leadership in the data-driven digital economy. In order for innovation to succeed, Canadians must be able to trust that their privacy is protected, that their data will not be misused, and that companies operating in this space communicate in a simple and straightforward manner with their users. To help build trust for Canadians, and promote innovation, ISED led in developing Canada's Digital Charter. The Charter sets out 10 principles to guide the federal government's work in the digital and data-driven economy. In addition, ISED is leveraging international fora and other programs under the Innovation and Skills Plan to support the digital economy – such as in the field of artificial intelligence. Background With the exponential growth of digital technologies and the increasing capability to compute and analyze data, we are seeing transformative effects on the economy. Digital technology is changing our economy and our society: the way we access information, work, and connect with each other. Data is now a resource that companies deploy to be more productive and to develop better products and services, unleashing a digital revolution around the world with implications for jobs, growth, and privacy. National Digital And Data Consultations What has become abundantly clear throughout the implementation of Innovation and Skills Plan is that digital and data-driven transformation will drive Canada's competitiveness. While Canada has notable strengths in our people, with world-leading talent in crucial platform technologies such as AI and robotics, we are facing increasing global competition for capital investment, top-tier talent, and cutting-edge regulatory advantages. ISED launched the cross-Canada National Digital and Data Consultations in summer 2018 to discuss these issues with Canadians. These consultations explored three important focal points: The future of work and how digital technologies will impact the labour market; Unleashing innovation and how to ensure Canadian firms are competitive, adaptable, and capable of adopting digital technologies to spur productivity; and, Trust and privacy, specifically how to structure frameworks to support innovation, protect privacy interests, and promote trust in the digital economy among Canadians. Digital Charter In response to the national consultations, ISED launched Canada's Digital Charter in May 2019. Recognizing the importance of the digital economy to our prosperity, this principles-based approach is flexible and adaptable to the rapidly evolving norms and pressures of digital transformation. This approach balances inspiring trust and confidence in the digital economy and ecosystems among Canadians while also allowing for flexible methods of achieving this goal and giving Canadian firms the space to innovate and compete. Staying firmly outcomes-focused and partnership-driven, this Charter will act as an evergreen reference point for an ongoing dialogue between stakeholders and Government. This will give Canadians a voice in shaping the digital and data norms that affect their lives and their industries, as well as provide a degree of certainty around how to operate within Canada's digital economy. The Digital Charter lays out the following ten principles: Universal Access: All Canadians will have equal opportunity to participate in the digital world and the necessary tools to do so, including access, connectivity, literacy and skills. Safety and Security: Canadians will be able to rely on the integrity, authenticity and security of the services they use and should feel safe online. Control and Consent: Canadians will have control over what data they are sharing, who is using their personal data and for what purposes, and know that their privacy is protected. Transparency, Portability and Interoperability: Canadians will have clear and manageable access to their personal data and should be free to share or transfer it without undue burden. Open and Modern Digital Government: Canadians will be able to access modern digital services from the Government of Canada, which are secure and simple to use. A Level Playing Field: The Government of Canada will ensure fair competition in the online marketplace to facilitate the growth of Canadian businesses and affirm Canada's leadership on digital and data innovation, while protecting Canadian consumers from market abuses. Data and Digital for Good: The Government of Canada will ensure the ethical use of data to create value, promote openness and improve the lives of people—at home and around the world. Strong Democracy: The Government of Canada will defend freedom of expression and protect against online threats and disinformation designed to undermine the integrity of elections and democratic institutions. Free from Hate and Violent Extremism: Canadians can expect that digital platforms will not foster or disseminate hate, violent extremism or criminal content. Strong Enforcement and Real Accountability: There will be clear, meaningful penalties for violations of the laws and regulations that support these principles. Overall, the goal of the Charter is to build a foundation of trust for Canadians in the digital sphere and provide the framework for continued Canadian leadership in the digital and data-driven economy. This will not only protect Canadians' privacy and personal data but also leverage Canada's unique talents and strengths in order to harness the power of digital transformation. PIPEDA reform As part of this work, ISED has launched a PIPEDAreform process via a white paper on key privacy concepts. The Government's proposals for PIPEDAreform reflect extensive consultations with Canadians and all stakeholders, as well as recommendations from Parliamentarians. Our discussion paper contains specific proposals to expand individuals' control over data and their trust in the digital economy, enable responsible innovation, and enhance enforcement and oversight powers of the Office of the Privacy Commissioner with regard to PIPEDA. These include concepts around modernized consent requirements, transparency in automated decision-making, and improved data mobility. At the same time, the proposals also seek to create more opportunities to responsibly use data to create new and innovative technologies and business models. For example, the paper explores concepts such as standard business practices, enabling codes, and providing greater flexibility for data use under certain conditions. Meaningful oversight is essential to enhancing trust and to balance opportunities for more flexible data use. That is why the paper considers options to expand the enforcement authorities of the Office of the Privacy Commissioner. Canadian Statistics Advisory Council Government must embrace digital and data-driven transformation too. We live in a world that is increasingly data-driven. Now more than ever, Government requires the high-quality, timely and relevant statistics produced by Statistics Canada to support evidence-based decision-making. In June 2019, ISED announced the creation of a new Canadian Statistics Advisory Council. This council will provide the Minister of ISED and the Chief Statistician of Canada with impartial and independent advice on matters concerning the overall quality of Canada's national statistical system, in line with the principles entrenched in Canada's Digital Charter. This will help ensure both that Statistics Canada remains one of the world's top statistical agencies and that the Government is able to draw on the power of big data sets to make evidence-based decisions. The council is chaired by Dr. Teresa Scassa, Canada Research Chair in Information Law and Policy at the University of Ottawa, and includes luminaries from academia, the private sector, and groups from across civil society. Members will use their expertise and broad perspectives to advise on a variety of matters, including to identify emerging areas of opportunity and to address issues and challenges. The council will produce an annual report on the state of the national statistical system. ISED going digitalservice transformation strategy Government must adapt to digital transformation. Six-in-ten Canadians agree that government policies are not keeping pace with the changes in technology and the digital economy, and business owners are asking for easier and faster interactions with government: in the 2016 report \"Taking Care of Business\" it was found that 77% of business clients wanted routine government services available online, especially on their smartphones. The 26th Annual Report to the Prime Minister on the Public Service of Canada, published May 2019, states that \"We have embraced the rise of the Internet and digital platforms… our public service must collaborate by default, adopt agile approaches to how we work, and draw in all kinds of voices to help shape our ideas, directions, and decisions.\" The Government now has Digital Standards which outline how Government will embrace the digital age. As part of this, the Government has outlined a Data Strategy Roadmap which sets the foundation for the public service to create greater public value from the data it creates, collects, and manages. Looking forward, the Government has outlined a Digital Policy that outlines an integrated, streamlined management of services, information, data, IT and cyber security to improve government operations and services. ISED Data Strategy In November 2018, a Data Strategy Roadmap for the Federal Public Service was released following a whole-of-Government collaboration led by PCO, TBS, and Statistics Canada. The Clerk of the Privy Council subsequently asked that all departments develop their own customized data strategies with defined roles and responsibilities for data functions. The ISED Integrated Data Strategy is designed to leverage the data generated from Innovation and Skills Plan investments to determine whether our policies are making a difference and to ensure that we deliver on our robust and horizontal agenda. The ISED Integrated Data Strategy is being developed following consultations across ISED's sectors and with an eye towards alignment with the Roadmap and will treat data as a strategic asset and ensure that ISED is a leader in leveraging data to continue to improve decision-making for the benefit of Canadians and Canadian businesses. Competition Bureau letter The Honourable Navdeep Bains, Minister of ISED, sent a welcome letter in May 2019 to the incoming Commissioner of Competition at the Competition Bureau, Matthew Boswell. In this letter, Minister Bains stressed that the Government is committed to making Canada a world- leading country for innovation. He noted that at a time when many Canadians are concerned about the rising costs of goods and services, the importance of strong competition policy is central to fueling innovative industries and growth. The Competition Bureau plays a critical role in this pursuit. Strong and well-enforced competition laws promote a marketplace where innovative new business models, spurred by disruptive ideas and technologies, flourish unimpeded by anti-competitive forces, and in so doing drive even further innovation. The Bureau also has a critical role to play in combatting deceptive marketing, which promotes trust in the digital marketplace, and in advocating for competition, ensuring that government policies and regulations support competition and nurture innovation as much as possible. The Minister highlighted the need to examine how Government can promote competition and create a healthy environment, especially for our small and medium-sized enterprises, to thrive and innovate. He further encouraged the incoming Commissioner to examine the potential for market distortions, and for unforeseen disruptions where abuses of market power can occur in the collection, processing, and use of data. The accumulation of data by a few centralized nodes and actors has raised a desire for heightened transparency and control for citizens in the use, processing, and portability of their information. The Competition Bureau has a role to play in fueling trust, innovation, and competitiveness by tackling these issues. The Minister concluded by asking the Competition Bureau to work with ISED policy leads to consider critical issues such as: The impact of digital transformation on competition; The emerging issues for competition in data accumulation, transparency, and control; The effectiveness of current competition policy tools and marketplace frameworks; and, The effectiveness of current investigative and judicial processes. Artificial intelligence (AI) The Government of Canada has undertaken a number of key initiatives to grow its domestic AI ecosystem and to maintain its role as a world leader in AI, including investments in innovation and research, strategies for skills development, stakeholder engagement, and programs supporting multisector collaboration in AI. Artificial intelligence (AI) is a machine-based system that can, for a given set of human-defined objectives, make predictions, recommendations, or decisions influencing real or virtual environments. The AI field encompasses the different applications of AI (e.g., image recognition, language processing, analytics, and robotics) and the algorithms and technologies that underpin these applications. AI is already commonplace and will play an increasingly important transformational role in economies and societies worldwide. According to McKinsey Global Institute, AI could contribute up to US$13 trillion per year to the global economy by 2030, promising to boost the economies of early adopters through higher business productivity and wealth creation. Governments are mobilizing increasing funds towards AI research to capture the nascent benefits of AI technologies. Many governments are also seized with the importance of national frameworks to guide human-centric development and use of AI. Due to successful past investments, Canada has a strong foundation in AI R&D, skills and talent, and clusters, as well as a thriving start-up ecosystem. Canada is home to more than 800 AI companies, with the majority concentrated in Ontario (435), British Columbia (147), and Quebec (140). The vast majority of AI firms are developing AI for specific business applications, particularly targeting data rich sectors such as healthcare and finance. Canada's AI ecosystem is young, but the sector is demonstrating significant momentum. According to PricewaterhouseCoopers, Canada's AI sector received US$266 million in private investment in 2017, with nearly two-thirds of deals made by Canadian investors. According to a MoneyTree Canada report, in 2018 Canadian AI companies raised nearly $550 million in venture capital, based on 43 deals; this VC amount represents a 51 percent increase from 2017, and the fifth consecutive year of deal increases. Canada is recognized for its leading AI research expertise in deep and reinforcement learning, two high interest approaches for practical applications. Canada is among the top five countries in terms of number of AI experts, with over 1,487 PhD-educated researchers, and is home to three of the \"godfathers\" of AI's modern development: Yoshua Bengio, Geoffrey Hinton and Richard Sutton. International leadership in AI In its 2018 G7 Presidency, Canada advanced a shared vision of AI, first among G7 Innovation Ministers in the form of a Statement on AI , and then among G7 Leaders' in the Charlevoix Common Vision for the Future of AI , culminating in a G7 Multistakeholder Conference on AI. The conference, which took place in December 2018 in Montreal, brought together over 200 AI leaders from across the G7 to discuss how to enable the responsible adoption of AI. In 2019, Canada participated in the development and adoption of the OECD Recommendation on AI, including the OECD Principles for Trustworthy AI, which serve as the basis for the G20 AI Principles introduced during Japan's 2019 Presidency and endorsed by Leaders. International Panel on AI: In June 2018, Canada and France announced their intention to create an International Panel on Artificial Intelligence (IPAI). Since then, they have announced its mandate, a preliminary governance structure and a Declaration of 10 shared values which future participants of IPAI will be required to endorse. The 2019 G7 Digital Ministers' Meeting (May 15 in Paris) resulted in expressions of interest in IPAI from Germany, Italy, Japan, the United Kingdom, New Zealand, India and the European Commission. Discussions on the establishment of IPAI will be continued in the G7 Sherpa track in the lead-up to the G7 Leaders' Summit in Biarritz. The mission of IPAI will be to support and guide the responsible adoption of AI that is human-centric and grounded in human rights, inclusion, diversity, innovation and economic growth. IPAI will be an expertise-based organization dedicated to AI that will bring together many of the greatest AI experts globally to foster international collaboration and coordination on AI policy development and to work over long-term identified topics so that it can become a global reference point on AI. Key developments Government of Canada Advisory Council on AI: The Advisory Council on Artificial Intelligence draws on Canada's multi-disciplinary strengths in AI to identify new opportunities in the AI sector, and to make recommendations to the government. The Advisory Council will be a central reference point to inform the government's development of domestic and international AI-related policy. Key issues to be explored include growing Canada's R&D advantage; commercialization and scale-up; skills development; and public awareness and education to build trust. Pan-Canadian Artificial Intelligence Strategy: The $125 million Pan-Canadian AI Strategy is Canada's flagship strategy to attract and retain AI talent and position Canada as a world-leading destination for companies seeking to innovate through AI technologies. Three Canadian AI institutes play lead roles in the Strategy, which is implemented by the Canadian Institute for Advanced Research (CIFAR): Vector Institute (Toronto), the Montreal Institute for Learning Algorithms – MILA (Montreal), and the Alberta Machine Intelligence Institute – AMII (Edmonton). Innovation Superclusters Initiative: The Innovation Superclusters Initiative is investing up to $950 million in five industry-led superclusters to accelerate the growth and development of large-scale business-led innovation and create AI-related hubs of global competitive advantage for advanced industries. Two of the five existing clusters in Canada have an AI focus: SCALE.AI, a Montreal-based AI supply chain supercluster focused on SMEs, has a projected 10-year impact of $16.5 billion in GDP and 16,000 jobs created. The Digital Technology Supercluster, a BC-based innovation hub with expected AI crossover impacts, has a projected 10-year impact of $15 billion in GDP and 16,000 jobs created. Strategic Innovation Fund: The $1.26 Strategic Innovation Fund (SIF) is spurring innovation through contributions to firms across Canada's industrial and technology sectors – many leveraging AI and advanced analytics – responding to the blurring of industry boundaries in today's digital economy. SIF's Stream 4 is focused on business-led consortia and networks that are working at the intersection of data and AI digital solutions in the health and biosciences sector. Innovative Solutions Canada: Dedicating over $100 million to support the scale up and growth of Canada's innovators and entrepreneurs by having the Government act as a first customer. This includes through public challenges issued by departments and agencies seeking AI solutions. The Digital Nations The Digital Nations (formerly called the Digital 9 (D9)) is a collaborative network of the world's leading digital governments with a common goal of harnessing digital technology to improve citizens' lives. Member countries share world-class digital practices, collaborate to solve common problems, identify improvements to digital services, and support and champion growing digital economies. The D9 Charter, signed in November 2018, outlines a mutual commitment to digital development and leadership through nine core principles: User needs – the design of public services for the citizen; Open standards – a commitment to credible royalty-free open standards to promote interoperability; Open source – future government systems, tradecraft, standards and manuals are created as open source and are shareable between members; Open markets – in government procurement, create true competition for companies regardless of size, encourage a start-up culture, and promote growth through open markets; Open government (transparency) – be a member of the Open Government Partnership and use open licenses to produce and consume open data; Connectivity – enable an online population through comprehensive and high-quality digital infrastructure; Teach children to code – commitment to offer children the opportunity to learn to code and build the next generation of skills; Assisted digital – a commitment to support all its citizens to access digital services; and, Commitment to share and learn – all members commit to work together to help solve each other's issues wherever they can The D9 will be adding a new member and changing their name to the Digital Nations later this year. Canada joined the network in February 2018 at the Ministerial Summit in Wellington, New Zealand, assuming the role of first Secretariat. Based in Ottawa, the Secretariat works on behalf of all members and Canada's engagement is coordinated by TBS. Canada participates in the networks thematic groups on artificial intelligence, digital identity, and data. In November 2019, Canada will take over as Chair for one year. As Chair, Canada will be responsible for steering the group and for hosting the 7th Ministerial Summit. The Digital Nations' members are also members of the Open Government Partnership, for which Canada was named co-chair in 2019. Broadband connectivity and next generation networks Competition and technological change is driving ongoing private sector investments in network infrastructure. These investments are focused in more urban areas. The government has legislative and regulatory frameworks to further enable competition and investment. In underserved rural and remote areas, funding programs are also critical to expand access where it is uneconomical for the private sector. This includes ISED's $500 million Connect to Innovate (CTI) program that launched in 2016. In January 2019, the Prime Minister appointed Canada's first Minister of Rural Economic Development, the Honourable Bernadette Jordan. Her mandate includes leading efforts to increase high-speed broadband in rural Canada. ISED officials are supporting her in this work. On June 27, 2019, Minister Jordan announced High Speed Access for All: Canada's Connectivity Strategy , which outlines Canada's plan to ensure universal access by 2030. This includes high-speed Internet to homes and businesses as well as mobile wireless (cellular) service. Central to the Strategy are Budget 2019 investments, which include $1.7 billion for a top-up for the Connect to Innovate program, a new Universal Broadband Fund, and support for low-Earth orbit (LEO) satellite capacity. Countries around the world are preparing for the 5th generation of wireless technology (5G). In addition to offering mobile speeds up to 10x faster than today, 5G is expected to improve access for support new wireless application in industries, improve access in rural areas, promote new business models and use cases, including autonomous vehicles, Internet of Things (IoT) devices, and smart cities. The massive amount of connected devices will require access to more spectrum (the airwaves critical for wireless services) and innovative ways of maximizing efficient use. Access to existing infrastructure like telephone poles and wireless towers is also important for building out these networks. These issues are among those being considered by regulatory review by the Canadian Radio-television and Telecommunications Commission (CRTC) and an ongoing review of the Telecommunications Act and Radiocommunication Act . Key developments Project announcements for the CTI top-up are continuing over the summer. Design and preparation of the Universal Broadband Fund is underway for launch in the next mandate. On July 24, 2019, the Government of Canada announced a Memorandum of Understanding with Telesat to work towards securing satellite capacity over Canada from its LEO satellite constellation. ISED collaborates with other departments such as Infrastructure Canada (INFC), the CRTC, and the Canada Infrastructure Bank, on rural access. A Deputy-level committee has been established to oversee this work. You will be assuming the role of Co-Chair. INFC's Deputy is the other co-chair. In 2018, ISED published a Spectrum Outlook which outlines ISED's plans to address issues related to access to spectrum. ISED will take into consideration technology and spectrum management developments when consulting on future spectrum releases. Timely access to mid-band (3500 mmWave and 3800) is key to the deployment of 5G and to improve services for rural and urban Canadians. Looking ahead REDACTED Canada's key economic sectors: setting the stage Overview Canadian and global industries are facing a moment of profound change, but also of tremendous opportunity. New technologies are emerging at an unprecedented rate, opening the door for the development of novel products, processes, and business models. The skills to grow competitive, globally oriented industries are changing, pointing to new opportunities to develop Canadian talent to help solve global challenges. Amidst this change, social and political shifts are playing out on the international stage, impacting the way Canadian industries do business with the world. Background ISED has undertaken a number of activities, in terms of outreach, collaboration and support to advance Canada's key industry sectors. This work includes, but is not limited to, the following: Six Economic Strategy Tables in the areas of advanced manufacturing, agri-food, health and biosciences, clean technology, digital industries, and natural resources; Investment programs such as the Strategic Innovation Fund (SIF) which are built on a strong foundation of sector expertise to support and inform decision-making; and, Continued development of in-depth knowledge related to key industry challenges and opportunities (e.g., regulations, technology development and adoption, trade, etc.) in order to drive sustainable growth that is based on a model of industry- government collaboration and mutual respect. Canada's key economic sectors Automotive Canada's automotive industry contributes $16.4 billion to Canada's GDP, representing 8% of manufacturing GDP and employs 137,000 workers. Automotive represents 14% of total merchandise exports. The sector is under pressure due to falling production, plant closures, and changing North American trade dynamics. The automotive industry is increasingly shaped by advanced vehicle technologies, including electrification, connectedness, and robotics. Canada is uniquely placed to design and build these advanced technology vehicles as one of the only jurisdictions with both a mature manufacturing footprint and a cluster of leading technology companies\/researchers. Key developments Through funding programs such as the SIF, Canada has invested over $450 million in recent years, contributing to industry investments that totaled over $6 billion. Budget 2019 included measures to support investments in advanced vehicle technologies as part of a broader Zero-Emission Vehicle strategy, including research, charging infrastructure and purchase incentives. Across government, departments including ISED (spectrum, data privacy), Transport (safety), Public Safety (cybersecurity), and Infrastructure (smart cities) are making investments to promote the adoption of connected and autonomous vehicle technologies. Aerospace Canada's aerospace sector contributes $13.1 billion to Canada's GDP and employed 89,500 workers through manufacturing and services (maintenance, repair and overhaul) activities. With an annual R&D investment of $1.4 billion, this industry has the highest R&D of the manufacturing sectors, and has an R&D intensity of over five times the manufacturing average. New partnership agreements and changing business models are transforming the civil aerospace market. Within the past year, consolidation has strengthened the control of the Boeing-Airbus duopoly, which dominates the global aerospace sector. Tier 1 suppliers gained scale through mergers and acquisitions and partnerships. Key developments Since October 2015, ISED has authorized over $750 million in funding assistance to support the aerospace and space industries, leveraging nearly $10 billion in private sector investments. ISED worked alongside Global Affairs Canada to defend Canada's aerospace industry during the trade case brought against Bombardier in the US. This work is continuing as a new trade dispute has been raised against Bombardier by Brazil to the World Trade Organization. Defence The Canadian defence sector contributes close to $3 billion in GDP and 27,000 jobs to the Canadian economy. The sector is innovative, and an important source of high-skilled employment. Key developments The Industrial and Technological Benefits (ITB) Policy uses government purchasing power in the context of defence and major Canadian Coast Guard procurement to encourage companies to establish and grow their presence in Canada. The policy is estimated to contribute more than $4.7 billion annually to GDP and close to 46,000 jobs. Between 2013 and 2017, 450 small- and medium- sized businesses benefitted from ITB investments. In 2018, ITBs generated $2.6 billion in new investments, and the portfolio grew by $894 million because of 10 new procurement contracts. In 2018, Canada introduced 16 Key Industrial Capabilities (KICs) to ensure investments to recapitalize Canada's military continued to support the development of a globally competitive defence and security sector. KICs represent aspects of Canada's defence industrial base that derive or have the potential to derive broader economic benefit from defence procurements. Supporting the growth of legitimate trade by providing market and commercial intelligence through the export permit process. Supporting the successful renewal and administration of the Munitions Supply Program, ensuring Canada maintains its industrial capacity to domestically procure and meet the munitions requirements of the Canadian Armed Forces (CAF). Digital technology Digital technology employs 651,400 Canadians, and is the country's largest R&D performer in the private sector, accounting for 35% of the total Business Expenditures on R&D (BERD) in Canada. It is one of Canada's fastest growing and most dynamic industrial sectors. Canada is underperforming in terms of digital innovation. In the OECD's Digital Economy Outlook Canada ranks 20th in the size of the digital technology sector as a share of GDP (2015) and 19th in terms of business research and development spending. Key developments SIF investments benefit the digital technology sector with half the projects going towards supporting businesses within the sector or to those that will have spillover effects to the sector. Other measures include the Digital Industries Economic Strategy Table as a key mechanism for engagement with business leaders as well as two Innovative Superclusters: Canada's Digital Technology Supercluster and Scale AI Supercluster to develop global and regional competitiveness. Food and beverage processing Food and beverage processing (FBP) contributes $35 billion to Canada's GDP, representing 17% of manufacturing GDP. The sector employs 278,000 workers or 16% of manufacturing employment. Despite this, FBP lags in R&D investment, representing only 2.9% of manufacturing BERD. Chinese bans on Canadian exports of canola and meat have resulted in uncertainty for food processors, in particular following a 22% increase in agri-food exports to China in 2018. Key developments Agri-Food Economic Strategy Table – planning next phase, with late August meeting anticipated. Strategic Innovation Fund (SIF) – supporting sector recipients to accelerate innovation and tech adoption in Canada's FBP sector. REDACTED Life sciences Life sciences contributes $7.8 billion to Canada's GDP, representing 4% of manufacturing GDP. The sector represents approximately 90,000 employees, $39 billion in revenues, more than $13 billion in exports, and about $2 billion in R&D spending. The sector is at the centre of a dynamic ecosystem composed of 40 world-class research hospitals, 27 life science related networks centres of excellence, and 35 major health research centres partnered with global pharmaceutical companies and Tri-Council Agencies. The ecosystem also includes a growing network of over 20 incubators and accelerators. Key developments SIF – contributions in the life sciences sector total $160 million, leveraging more than $340 million in private investments. REDACTED Shipbuilding and industrial marine The Canadian marine sector contributes close to $1.2 billion in GDP, approximately $3.5 billion in sales, and 12,800 direct, high skilled jobs. The National Shipbuilding Strategy (NSS), which is renewing the fleets of the Royal Canadian Navy and the Canadian Coast Guard, is creating new economic opportunities for the sector. Key developments Supporting Canadian economic development through the NSS Value Proposition (NSS VP). The NSS Value Proposition supports the marine industry by ensuring that selected large vessel shipyards invest 0.5% of resultant NSS contracts into three priority areas: HR development; industrial development; and technology investment. Protecting Canadian capability and capacity through the application of the Buy-in-Canada Policy, which mandates that the federal fleet be procured domestically. Space The Canadian space sector is highly innovative, directly employing approximately 10,000 Canadians. In 2017, the Canadian space sector generated $5.6B in revenues and contributed $2.3B to GDP. Canada's strengths reside in satellite communications and space systems manufacturing – including robotics, earth observation sensors and data systems. Key developments The Government of Canada released Exploration, Imagination, Innovation: A New Space Strategy for Canada in March 2019. The Strategy aims at leveraging Canadian strengths like robotics, while advancing science and innovation in areas such as Artificial Intelligence (AI) and biomedical technologies. Canada's commitment to participate in the Lunar Gateway forms the cornerstone of the strategy. The Lunar Gateway is a NASA-led lunar orbit spaceport for human and robotic exploration of the Moon planned for 2024. In February 2019, the Government announced an investment of $2.05 billion over 24 years for a next-generation space robotics system – Canadarm 3 – for the Gateway, in addition to a lunar technology development and demonstration program (LEAP). In keeping with the Minister's mandate to improve access to high-speed internet for Canadians in rural and remote areas, Budget 2018 provided $100M to support projects that relate to developing next generation LEO satellite broadband technologies. The Government concluded a contribution agreement with Telesat Canada providing an $85M non-repayable contribution from the Strategic Innovation Fund to support research and development toward its planned LEO satellite constellation, which has the potential to provide global broadband coverage. In Budget 2019, the Government of Canada announced a $1.7 billion commitment to the Universal Broadband fund, which includes securing LEO for rural and remote regions of Canada. As part of that commitment, Telesat Canada and the Government have signed a letter of intent and memorandum of understanding to guarantee Telesat Canada up to $1 billion in revenues to provide broadband Internet capacity over Canada from its planned LEO constellation. Steel and aluminum Canada's steel and aluminum industries contributed $8.9 billion to Canada's GDP (4.3% of manufacturing) and employed approximately 34,000 Canadians. The sectors provide inputs vital to manufacturing, energy and construction supply chains. In May, the U.S. agreed to remove S.232 tariffs on Canadian steel and aluminum imports, allowing Canadian producers duty free access to this important export market. Key developments The Department, Global Affairs Canada and Finance Canada are working with the steel industry to track steel and aluminum trade with the U.S. to protect continued duty-free access and monitor Canada's obligations through the May 2019 joint statement. As part of the government's commitment to support the sector, the Department is completing delivery of $250 million in support to primary producers through the SIF, while the RDAs are finalizing $100 million in non-repayable support to SME users of steel and aluminum. Tourism Tourism is an important sector of the Canadian economy and is recognized as a high growth, high potential sector. Tourism accounts for over 2% of Canada's GDP, supports1 in 10 jobs across the country, and generates over $100 billion in spending within the Canadian economy. In 2018, Canada welcomed a record high 21.1 million international tourists. Canada's largest source market is the US, with over 14.4 million tourist arrivals in 2018. Tourists from other source markets represent 32% of all international tourists to Canada. Among this group, visitors from China, France, Mexico and India set country-specific records in 2018. Key developments Creating Middle Class Jobs: A Federal Tourism Growth Strategy, launched in May 2019, is designed to address short-, medium-, and long-term challenges in the industry through three pillars: the Canadian Experiences Fund, the Economic Strategy Table for Tourism and the establishment of Tourism Investment Groups. The Strategy aims to unleash the potential of tourism to drive economic growth and job creation in all regions of the country. Founded on the recognition that every community across Canada has something to offer and can aspire to be a tourism destination in its own right. Canadian Experiences Fund (CEF) – Announced in Budget 2019, the Fund is a two-year $58.5 million investment to enhance the products and experiences that attract tourists. The Fund prioritizes five key product lines: winter and shoulder season tourism, rural and remote tourism, Indigenous tourism, LGBTQ2 tourism and farm-to-table tourism. The Fund is delivered by Regional Development Agencies, and is split between national projects ($11.4 million) and regional projects ($48.6 million). Economic Strategy Table (EST) for Tourism – Budget 2019 announced the EST for Tourism, which provides an opportunity for the Government of Canada to work collaboratively with the industry to ensure that tourism is on the front lines of economic policy-making, and that challenges are addressed and opportunities are seized to grow the visitor economy. Critical areas the Table could address include the high cost of travelling to and within Canada, labour shortages and the lack of investment. The composition of the EST for tourism will be announced as part of a broader announcement on the composition of all seven economic strategy tables. Tourism Investment Groups – This initiative will be co-led in each region by Destination Canada and the Regional Development Agencies. The objective is to better align investments in tourism across the federal departments, agencies, and jurisdictions, and to attract more private sector investment to the sector. Clean technology Since 2007, clean technology GDP growth tracked the rest of the economy — approximately 3% since 2007. Between 2016 and 2017, however, clean technology GDP growth was nearly double the economy average at 6.6%. Clean technology currently makes up approximately 1.4% of Canada's nominal GDP. Exports for 2017 totaled $9 billion, with the strongest increase of 11% between 2016 to 2017. The U.S. is the dominant destination for clean technology exports (74% of goods and 63% of services). Imports are also growing and reached $11 billion in 2017. Canada's clean technology companies have good, well-paying jobs: From 2007 to 2017, clean technology employment grew to reach 183,000 employees, with an average compensation of $82,000 (national average is $64,000). Clean technology labour productivity increased 35% (national industry average grew 10% over the same period). Given the small size of Canada's domestic market, strong export growth is crucial to growing competitive Canadian clean technology companies. ISED continues to undertake strategic international engagement with bilateral partners in support of greater commercialization opportunities for Canadian clean technology companies. This has included a number of scoping visits to China (as part of the inaugural Canada-China Innovation Dialogue); the United Kingdom (under the auspices of the Canada-UK MoU on Climate Change and Clean Growth; and India. Key developments REDACTED ECTPEA provides comprehensive measures of the supply and use of environmental and clean technology products in Canada's economy. The data will include macro-economic indicators such as GDP, income, employment, and trade both nationally and regionally from 2007-2018. Provincial governments are keen to learn more about clean technology production in their regions. Regional innovation and alignment across the ISED portfolio Overview Alignment of innovation priorities across the ISED portfolio Background In 2015, RDAs integrated into the ISED portfolio and adopted a common set of priorities, consistent with the Innovation and Skills Plan, while continuing to deliver services and programs tailored to the specific needs of communities in each region. Budget 2018 saw the \"re-imagining\" of the NRC at the centre of research excellence and collaboration, bringing together the best innovative minds to deliver breakthroughs and meet the needs of Canadian industry; deepen NRC research excellence; and enable high-potential SMEs to grow to scale and establish global brands. RDAs and the NRC play a crucial role in supporting innovation throughout Canada. Budget 2018 established RDAs and the NRC's Industrial Research Assistance Program (IRAP) as two of four flagship innovation platforms (along with the Strategic Innovation Fund and the Trade Commissioner Service). These platforms provide customized support that Canadian firms need to succeed and grow. The 6 RDAs, 14 NRC Research Centres, and 120 IRAP locations across the country deliver the Innovation and Skills Plan to the doorstep of Canadian researchers, businesses, and entrepreneurs to foster the ideal conditions for the development of strong, dynamic and inclusive regional economies. Along with a modernized Statistics Canada, a solid foundation is being built that will deepen our collaborative efforts to share best practices and expertise, build capacity, and generate new, innovative ideas. Key developments Since 2015, the RDAs have taken steps to ensure horizontal collaboration between the RDAs on mandate alignment and results and delivery frameworks, including through regular DM-level meetings and an ADM policy committee to better support portfolio coordination, planning and policy advice. In 2018, RDAs launched Regional Economic Growth through Innovation (REGI), a nationally consistent program focused on business productivity\/scale up and regional innovation ecosystems. Regional Growth Strategies reflect RDAs' unique regional circumstances and context while aligning with national priorities; they are intended as a \"whole-of-government' approach to achieve outcomes in priority areas; CanNor and FedDev's strategies remain to be announced. In 2016, the NRC began a multi-year renewal initiative with a far-reaching consultation process, the NRC Dialogue. The new course started in 2017 though a refreshed mission and the consolidation of the research programs from 37 to 26 focused programs. Budget 2018 stabilized and increased NRC annual funding allowing for better long-term research planning and delivery, and reinforced its role as a trusted collaboration partner of industry. Enhanced collaboration through improved access for SMEs and post-secondary institutions to NRC's specialized facilities and equipment, scientists and technical services, and support to NRC scientists to work with innovators and businesses on multi-party R&D programs. Support ISED programs such as the Innovation Superclusters, Innovative Solutions Canada, and the Strategic Innovation Fund with assessors, expanded IRAP funding, procurements, and facilities use. Looking ahead Implementation of new signature RDA-delivered programs: Regional Growth Strategies, Women Entrepreneurship Strategy, Canadian Experiences Fund, as well as increasing engagement with RDAs over the summer to discuss and frame advice on regional and rural economic development. The NRC continues its multi-year renewal to be scientifically excellent and business relevant by building new labs, ambitious hiring of high-calibre researchers, scaling up IRAP to support more clients and fund larger deals, and support digital innovation. Excellence in research and innovation will necessitate working collaboratively with companies of all sizes, universities and colleges, and provincial governments both here in Canada and abroad REDACTED Supporting Canada's small and medium enterprises Overview Small and medium-sized enterprises (SMEs) are a cornerstone of the economy from coast to coast to coast. SMEs are doing well with strong growth projections but still face unique challenges. The Government of Canada has been implementing a number of broad- based measures to support the overall SME ecosystem, while advancing a new micro-economic framework to support scaling-up. In addition, targeted programs have been developed to support inclusive and diverse entrepreneurs. Background Despite Canada's strong record in starting businesses, relatively few companies scale-up into globally competitive companies, exporting and operating at the cutting edge of innovation. The importance of such large firms is clear: they make large investments in R&D; they are more productive; they pay higher wages; they are more cyber secure; they have more diverse workforces; they export more; and they provide employees with greater job security and benefits. However, only 2 percent of mid-sized businesses in Canada actually succeed in growing into large businesses. Together, our investments under the Innovation and Skills Plan encourage the growth of Canadian businesses so they can integrate into value chains, export, and compete globally. Supporting innovators & entrepreneurs The Innovation and Skills Plan provides a suite of mutually reinforcing programs and initiatives designed to support Canadian businesses at all stages of growth. Through four flagship programs, the Plan offers support for firms of all sizes to grow and export to markets around the world. It has a focus on direct support, increasing access to late-stage capital for innovative firms in every sector. The Plan emphasizes clean growth by offering advisory support and funding for clean technology firms. It is also making Canada a leading destination for global companies by working to attract more foreign direct investment. Innovation Canada, a one-stop-shop, provides better support to Canada's innovators in finding the programs that best meet their needs. The four flagship programs – the Strategic Innovation Fund (SIF), the National Research Council- Industrial Research Assistance Program (NRC-IRAP), Regional Development Agencies (RDAs), and Business Development Bank of Canada (BDC), take a client- centric approach to working with firms at every stage of growth. Increasing the availability of capital for Canadian start-ups and SMEs helps them grow. The Venture Capital Catalyst Initiative (VCCI) is increasing the availability of late-stage financing for innovative Canadian firms, and strengthening the Canadian VC ecosystem over the long term. The Business Development Bank of Canada (BDC) is delivering VCCI funding of $450 million. With funds leveraged from the private sector, this investment is intended to inject up to $1.5 billion into Canada's risk capital market. The 2018 Fall Economic Statement announced an additional $50 million for VCCI to increase capital for Canada's clean technology firms. SMEs need to have the skills, tools and confidence to participate fully in our data-driven, digital economy. The Government is making progress on delivering digital and coding skills training, like CanCode, which has reached one million students, to ensure that we are developing a pipeline of talent for our future companies and inspiring a new generation of entrepreneurs. Budget 2019 made the successful Global Talent Stream pilot project a permanent program that provides access to highly skilled global talent to support skills and employment needs. It also supported the Business\/Higher Education Roundtable to help forge partnerships and create more work-integrated learning opportunities for young Canadians, setting a target of creating 84,000 new student work placements across Canada by 2023–24. The Student Work Placement Program will give students outside of STEM access to 20,000 new work-integrated learning opportunities for post-secondary students. The Women Entrepreneurship Strategy (WES) includes $2 billion for programs and initiatives delivered by a number of departments and agencies across the Government, focusing on four areas: helping women-led businesses grow, increasing access to capital, improving access to federal business innovation programming, and enhancing data and knowledge. The strategy includes a commitment of $105 million for nationally coordinated, regionally tailored investments to help women entrepreneurs and support regional innovation ecosystems — delivered by the RDAs. The funding is provided through (i) the WES Ecosystem Fund, an investment of up to $85 million over five years to strengthen capacity within the entrepreneurship ecosystem and close gaps in service for women entrepreneurs; and (ii) the Women Entrepreneurship Fund, a two-year, $20-million direct investment in women-led businesses to help them grow and reach new markets. In addition, the BDC has committed to a new lending target of $1.4 billion for women-owned businesses over three years and has increased the size of its Women in Technology Venture Fund to $200 million. The BDC's Indigenous Banking Unit provides financing and consulting services, including the Aboriginal Business Development Funds, in partnership with community organizations, to increase access to capital for Indigenous entrepreneurs who may not normally qualify for a loan; and Indigenous Entrepreneur Loans of up to $250,000 for both businesses and start-ups. Through Innovative Solutions Canada, a new procurement program, the Government is acting as a first customer for innovative SMEs by releasing grand challenges and inviting innovators to solve them. This approach supports the development of early-stage, pre-commercial innovations with great global commercialization potential. Innovative Solutions Canada also helps Canadian firms generate and leverage new IP. In addition, one of its objectives is to encourage procurement from companies led by underrepresented groups, such as women, Indigenous, youth, disabled individuals, LGBTQ+ and others. These efforts are complemented by recent tax measures to support Canadian businesses. Announced in 2017, the preferential rate for SMEs was further reduced from 10.5% to 10% as of January 1, 2018 and to 9%, effective January 1, 2019. In addition, the income threshold for SMEs to access the enhanced tax credit under the Scientific Research and Experimental Development (SR&ED) Tax Incentive Program was also eliminated to provide enhanced support for businesses that are rapidly growing or may have variable income from year to year. Announcements in Budget 2019 also sought to ensure that changes to the annual cap on employee stock option grants that may receive tax-preferred treatment for employees do not impact start-ups and rapidly growing Canadian businesses and made changes to the Accelerated Capital Cost Allowance to provide more incentives for the businesses to invest. Small and medium-sized enterprises in Canada Small and medium-sized enterprises (SMEs) are a cornerstone of the economy from coast to coast to coast 99.7% of all Canadian businesses 52.5% of total business sector GDP 1.4%Indigenous ownership 10,741,643 private sector employees 11.7% of businesses exporting goods or services 89.5% of total private sector employees 20.9% equal ownership between male and female 15.8% youth ownership (39 and younger) On the whole, SMEs are doing well with strong growth projections 75% SMEs expected to grow (between 2018 to 2020) Of the SMEs that export, there has been an increase of 68% in exports to two of more countries (2010-2018) 46% SMEs intend to expand into new domestic and international markets (between 2018 to 2020) The Government of Canada has been advancing a number of broad- based measures to support the overall SME ecosystem Tax & regulations Small business tax rate reduction 750,000 small businesses benefit from the preferential small business tax rate, realizing total projected federal tax savings of over $5.5B in 2019. Lowest rate in the G7: 4th lowest in OECD Reduced from 10.5% to 9% Up to $7,500 in federal tax savings each year Reducing red tape and administrative burden Cabinet Directive on Regulation: Small Business Lens that requires regulators to consider impacts on SMEs Targeted Regulatory Reviews, Regulatory Modernization Bill, and Regulatory Roadmaps implemented through Budget 2018-2019 and 2018 Fall Economic Statement Red Tape Reduction Act: New requirement for annual report for transparency and TBS Policy on Limiting Regulatory Burden on Business E-Regulation System; Budget 2018 proposed developing an e-regulation system, which will be an online reg., platform tool for SMEs People & skills Work integrated learning Budget 2019 announced $150M to create up to 20,000 work-integrated learning opportunities per year. Mitacs placements increased 300% since 2014\/15 to 8,000 in 2017\/18; will reach 10,000 a year by 2021-22 Canada Training Benefit More than $1.7B over five years and $586.5M per year ongoing (Budget 2019) Canada Job Grant 8254 SMEs supported per year and approximately 43,462 employees trained through job grant component of transfer agreements to P\/Ts Service to business Business number By April 2020, adopt the BN for all business-facing services, starting with priority services Canada Business App Beta release on May 31st. App will leverage the capabilities of mobile devices to create a simple navigation for small businesses to access government services and programs. Intellectual Property Strategy IP strategy includes a multidimensional approach to bolstering Canada's intellectual property, including the creation of searchable IP marketplace to enable businesses Liaison Office Service (CRA) Budget 2019 broadened the reach and scope of the Liaison Officer service to include incorporated small businesses, which is projected to help an additional 1,700 businesses per year. Liaison officers currently visit approximately 9,500 unincorporated small businesses each year. Connectivity Universal Broadband Fund $750M to ensure that 90% of homes and small businesses have access to broadband services by 2021 • Up to $1.7B to establish a new national high-speed internet program Connect to Innovate 174 projects announced covering 900+ communities Scale-up & financing Canada Small Business Financing Program Over the past 4 years, the CSBF Program has helped over 22,000 small businesses get access to almost $4.4B in financing. Business Development Bank of Canada Portfolio of $31 billion across its business lines serving more than 56,000 clients. Clients employ more than 900,000 Canadians and generate $251B in annual revenues Public Services and Procurement Canada – Office of Small and Medium Sized Enterprises Between 2015-16 and 2017-18, SMEs won $5.5B in contracts awarded by PSPC; this represents roughly 1 out of every 2 dollars awarded annually. E-Procurement: Budget 2018 proposed a new electronic procurement platform for SMEs Export Diversification Strategy Goal is to make Canada a more globally connected economy and increase Canada's overseas exports by 50% by 2025. Launch of the $10M Mobilizing SMEs for Exports initiative to help Canadian SMEs access new markets abroad and realize their export potential The Government of Canada has also been advancing a new micro-economic framework, targeting SME start-up and scale-up Tax Scientific Research & Experimental Development tax credit (SR&ED) Every year, 18,000 small and medium-sized businesses benefit from the enhanced SR&ED tax credits for total assistance of over $1.3B Following Budget 2019, eligible small businesses with taxable capital of up to $10M will benefit from unreduced access to the enhanced refundable SR&ED credit regardless of their taxable income Accelerated Capital Cost Allowance To accelerate Business investment, FES 2018 allowed for: Full expensing of clean energy equipment Full expensing for Manufacturing and Processing machinery and Equipment Introduction of Accelerated Investment Incentive People & skills CanCode Reached 1M+ students & 53,000 teachers Global Skills Strategy REDACTED R&D innovation Strategic Innovation Fund (SIF) SIF has directly invested in 24 SMEs, with total contributions over $251M, leveraging a total project investment of $946M 44% of SIF projects and 16% of total SIF contributions ($185M of $1.2B) are direct investments in Canadian-owned SMEs Innovation Superclusters Initiative 5 agreements signed; 7 projects announced; all superclusters expected to announce projects by June 2019 Collaboration of more than 450 businesses, including more than 300 SMEs, 60 post-secondary institutions and 180 other participants Commercialization & start-up Innovative Solutions Canada As of April 2019, ISC has had a total of 42 challenges Over 700 proposals submitted by innovators and 35 Proof of Concept grants and contracts (up to $150,000) awarded Build in Canada Innovation Program (BCIP) As of April 2019, BCIP has awarded 389 contracts to 340 Canadian innovators, totalling a value of $189M, with 97% of contracts being awarded to SMEs NRC-IRAP 11,700 projects started since 2015\/16 Total federal funding of $870M, leveraging an additional $1.4B 8,000 high-potential firms annually in bringing products\/services to global marketplace Financing Venture Capital Catalyst Initiative (VCCI) Announced 5 Stream 1 managers (for the funds-of-funds) and 7 Stream 2 managers, Stream 3 focus on clean tech sector will be announced in June 2019 VCCI will leverage private sector and other capital to inject a total of over $1.5 billion into the VC marketplace. Regional Development Agencies (RDAs) $2.2B allocated since 2015-16 for 5000+ projects, leveraging an additional $6.2B In 2018\/19, RDA's support total of 2,652 SME's (ACOA: 1231, CED: 1026, FedDev: 53,FedNor: 23, WD: 284,CanNor: 35) Ease of Doing Business Innovation Canada Launched its digital single window in January 2018 –over 900,000 visits, approximately 50% were from small business (less than 100 employees) Clean Growth Hub Launched in January 2018, it has served over 1,025 clients, of these clients, 63% are businesses with the remaining 37% being educational institutes, consortia, industry associations, non-profits, accelerators\/incubators, PTs, municipalities and indigenous organizations Of the businesses, 92% were SMEs based upon feedback entry from the clients Accelerated Growth Service 525 AGS firms served (as of April 23, 2019); 512 were SMEs. AGS delivered over $425M in funding\/financing, 4,470 services delivered, and 333 external referrals to SMEs between March 2016 and December 2019 Export Diversification Strategy Goal is to make Canada a more globally connected economy and increase Canada's overseas exports by 50% by 2025. Launch of the $10M Mobilizing SMEs for Exports initiative to help Canadian SMEs access new markets abroad and realize their export potential And providing support to encourage inclusive and diverse entrepreneurs Women Entrepreneurship Strategy WES Ecosystem Fund $85M over four years to build capacity Women Entrepreneurship Fund $20M over two years to help women grow their businesses Futurpreneur Canada $35M over five years to support 1,000 young entrepreneurs per year (Budget 2019) $3M over five years to create 175 Indigenous youth businesses (Futurpreneur, Budget 2019) BDC Indigenous Entrepreneur Loan $325M committed to over 633 Indigenous entrepreneurs (BDC, current commitments) $100M Indigenous Growth Fund to encourage investments in Indigenous-led businesses (Budget 2019) These investments focused on start-up and scale-up are already yielding results for businesses across Canada Futurpreneur Canada Supported more than 11,400 young business owners and helped launch more than 9,580 businesses across Canada, creating an estimated 37,500 jobs and $287 million in tax revenue (June 8, 2018). REDACTED Yet, key issues for SMEs still remain and could be amplified in the near future An aging population and technological change are transforming the Canadian business landscape: 39% of SMEs are struggling to find the people they need to grow growth of working age population will remain below 0.2% only 19% of SMEs are digitally advanced 29% of SMEs intend to sell, transfer or close in the next five years And future macro-economic trends are on the horizon: Scale-up Canada remains a nation of small firms and struggles to create high-growth and large anchor firms Large, innovation driven economy south of the border with strong pull Digital adoption SMEs lagging in uptake of digital technologies (89% Canadian SMEs not selling online) Underinvestment in productivity enhancing technologies SMEs not ready for fast-pace technology adoption challenges, with cybercrime estimated to cost $6T annually by 2021 Global value chains SMEs not maximizing export potential and face growth capital challenges to expand capacity Low global ranking in terms of Global Value Chain participation Skills & talent SMEs will need to adjust to and attract a highly skilled workforce in an environment of labour shortages Increasing labour demand in occupations which have not yet existed And small businesses, in particular, still face unique challenges Canadian Federation of Independent Business: Small businesses face unique challenges with red tape, taxation and labour \"There is a long way to go\" in terms of government serving the needs of small firms and not \"punishing them\" Canadian Chamber of Commerce: Canadian SMEs face unique challenges accessing foreign markets due to a lack of resources; The time and effort involved in identifying federal support programs is too long, causing SMEs to give up Regulations, processes and procedures often do not align with the realities of running a small business. Canadian SMEs' challenges vary by region: Rural SMEs are less likely to export, adopt new technologies, have websites, engage in innovation or hold intellectual property and identified the rising cost of inputs, government regulations and recruiting and retaining skilled employees as the main obstacles to growth in 2017 Scale-up study led by Special Advisor has identified need for: Strengthening REDACTED with focus on supports for SMEs that are scaling-up; Improving targeted supports REDACTED; Facilitating access for SMEs to export supports, government procurement opportunities, and REDACTED; and, Continuing an emphasis on reducing regulatory and trade barriers.","filter_flag":1}
{"title":"VIETNAM BUSINESS NEWS AUGUST 24\/2023 - VietNamNet","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtYXVndXN0LTI0LTIwMjMtMjE4MDg3Ny5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtYXVndXN0LTI0LTIwMjMtMjE4MDg3Ny5odG1s0gEA?oc=5","id":"CBMiSmh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtYXVndXN0LTI0LTIwMjMtMjE4MDg3Ny5odG1s0gEA","guidislink":false,"published":"Thu, 24 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=236, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtYXVndXN0LTI0LTIwMjMtMjE4MDg3Ny5odG1s0gEA?oc=5\" target=\"_blank\">VIETNAM BUSINESS NEWS AUGUST 24\/2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VietNamNet<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"VIETNAM BUSINESS NEWS AUGUST 24\/2023 - VietNamNet","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtYXVndXN0LTI0LTIwMjMtMjE4MDg3Ny5odG1s0gEA?oc=5\" target=\"_blank\">VIETNAM BUSINESS NEWS AUGUST 24\/2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VietNamNet<\/font>","source.href":"https:\/\/vietnamnet.vn","source.title":"VietNamNet","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Vietnam has still been one of the destinations drawing great interest from investors thanks to the positive recovery capacity and the flexibility of the country’s economy (Photo: VNA) Amid considerable changes in the global investment trend in many important real estate segments, Vietnam has still been one of the destinations drawing great interest from investors thanks to the positive recovery capacity and the flexibility of the country’s economy, according to a recent report from Savills Vietnam. Savills highlighted some large-scale merger and acquisition (M&A) deals in Vietnam in the second quarter of 2023, including Everland Opportunity IX’s purchasing of three hotels in Vietnam and Indonesia from Strategy Hospitality Holdings Ltd. with 106 million USD. Meanwhile, Keppel and Keppel Vietnam Fund acquired a 49% stake in two residential projects in Thu Duc city in Ho Chi Minh City with an area of 11.8 hectares from Khang Dien Group with 136 million USD. THT Development Co. Ltd. also transferred 1.13 hectares of land in Starlake City in Hanoi to CMC Technology Group to build an innovation centre with an investment of 76 million USD. Troy Griffiths, Deputy Managing Director of Savills Vietnam, said that despite short-term pressures on inflation as well as a decline in production and export, Vietnam's medium-term outlook remains positive. The reduction in interest rates prescribed by the State Bank of Vietnam (SBV) has stimulated economic growth by reducing the cost of capital for borrowers and credit institutions. FDI inflows into Vietnam are showing many promising opportunities. Although the total FDI decreased, newly registered projects and capital increased sharply, especially in the manufacturing sector. Improvements in infrastructure development, administrative reform and investment in innovation hubs in Vietnam are also contributing to making the market more attractive to international investors, said Griffiths. The SBV has lowered interest rates to support growth and FDI inflows remain sound. New regulations supporting debt restructuring will be positive for real estate and will boost transparency, which is positive for sustainable growth in the long term, he added. Thomas Rooney, Senior Manager of Industrial Services at Savills Hanoi, said that the Purchasing Managers' Index (PMI) and the Index of Industrial Production in Vietnam both had positive increases in the first months of 2023. The market continues to record large investment deals and business activities are bustling. However, the current global economic situation has led to a decline in aggregate demand. He held that the State needs to solve the problem in a timely manner and in combination with preventive measures to promote economic development. The official held that until the end of 2023, transactions will continue to take place and the supply still be abundant. As for the supply of ready-built factories, the attraction of localities such as Hai Phong will increase in the eyes of investors as well as tenants. In addition, Bac Ninh is also an ideal choice for domestic and foreign tenants as well as investors in developing ready-built warehouses, as the province has risen to the third place in terms FDI attraction, he noted. In general, the shift to the global supply chain has created many new opportunities and also brought certain challenges. Therefore, the Vietnamese market needs to grasp trends and access opportunities fully and quickly, so that it can make the best use of it and create a breakthrough, according to Savills. Vietfish 2023 gathers more than 420 booths run by businesses from 14 countries and territories. Several sideline activities will be held during the three-day event, including conferences and symposiums to help enterprises in the sector catch up with the latest trend and market information. After 24 editions, Vietfish has become a traditional event of the industry, gathering quintessence in the entire chain from feed, seed, farming, processing, export, and ancillary service units for the industry. Nguyen Thi Thu Sac, Chairwoman of the Vietnam Association of Seafood Exporters and Producers (VASEP), said under the theme of “Asia’s Home of Seafood”, the event, the biggest of its kind in Vietnam, is a venue for managers, retailers, suppliers, manufacturers, and exporters to meet, introduce new technology, and seek cooperation opportunities. A agreement to link tours has been inked by 11 provinces from the Mekong Delta region and the coastal central provinces of Thừa Thiên-Huế, Quảng Nam, Đà Nẵng, Quảng Ngãi and Bình Định to boost and exchange diversified tourism products and services in the two popular tourist regions. The deal will focus on introducing potential tourism options within 15 provinces in the Mekong Delta and central and Central Highlands region, offering domestic and international visitors at any tour-linked provinces promotion programmes and unique tourism products. Deputy Chairman of Trà Vinh Province People’s Committee Nguyễn Quỳnh Thiện said the Mekong region of 12 provinces hosted 37 million tourists with total revenue of VNĐ32 trillion (US$1.28 billion) in 2022. He said in the first six months of 2023, the region has welcomed 27 million visitors for revenue of VNĐ28 trillion (VNĐ1.12 billion), but tourism income has yet to reach its peak from before the COVID-19 pandemic. Thiện said Trà Vinh alone received 1.1 million tourists in the first half of 2023 to collect VNĐ950 billion ($38 million) in revenue. He said national flag carrier Vietnam Airlines and budget VietJetAir are operating daily flights connecting Đà Nẵng and Cần Thơ – a key centre in the Mekong region – creating more smooth traffic for the two regions to join hands in tourism growth. Newly appointed Deputy Chairman of Đà Nẵng City’s People’s Committee Trần Chí Cường said tourism connection is needed to create unique attractions and make different products and services. He said Đà Nẵng will offer the best conditions for travel agencies and businesses from the two regions to build links and co-operation in tourism and investment. Travel agencies and businesses from the two regions also signed deals on tourism exchange and sharing for the last half of the year and going forward. Earlier, three central localities – Thừa Thiên-Huế, Quảng Nam and Đà Nẵng – also agreed to develop a joint ‘green’ tourism link to boost unique tourism services and follow trends of sustainable and environmentally-friendly travel. Đà Nẵng has been building a favourable destination of MICE (Meeting, Incentives, Conference, and Exhibitions) and golf tours, while Quảng Nam is boosting its ‘green’ brand tourism. The central coastal region is a rendezvous of world heritage sites including Hội An ancient town, Mỹ Sơn Sanctuary, Huế Monuments complex, Phong Nha-Kẻ Bàng karst cave system as well as sea and island tour services in Quảng Nam, Quảng Ngãi and Bình Định. Central province calls for investment from the US The central province has called for investment and co-operation from US businesses in energy, oil refining and industrial environment treatment technology, and to join the second phase of the Dung Quất Refinery upgrading and expansion project. The co-operation and investment proposals were discussed at an investment promotion event by the central provincial working team in Houston, Texas last week with the participation of 32 businesses and groups including Baker Hughes, Energy Transfer, Energy Capital Việt Nam, ExxonMobil and Globalinx Group. Vice chairman of the provincial people’s committee Võ Phiên urged energy groups from the US to speed up investment and co-operation in the Dung Quất Economic Zone – which has been designed as a key ‘green’, ‘smart’ and sustainable industrial complex by 2045 – and Bình Sơn Oil Refinery plant (BSR). He also suggested support for industrial environment treatment technology at the Dung Quất EZ and other industrial parks to meet the standards of COP26 (the 26th UN Climate Change Conference of the Parties). Head of the Dung Quất EZ and Industrial Zones managing board Hà Hoàng Việt Phương said the province planned to develop the Dung Quất EZ as a multi-sector industry and sea-based economy centre on a total of 45,332ha. Phương stressed the zone would focus priorities in renewable energy and a circular economy with the focus on core industries of oil refining, steel, shipyards, sea ports and high-tech industries. He also introduced preferential policies for investment promotion and procedures for US businesses investing in the province. Investors would also enjoy a 10 per cent tax rate for 15 years, a four-year tax exemption and a 50 per cent cut in income tax for the following nine years, he said. He added that the tax exemption regulations would add a five-year free import tax on materials and semi-finished products for investors. Khương Lê Thành, a member of the Bình Sơn BSR Executive board, said the second phase of the Dung Quất refinery project would be built on 108.2ha with an investment of US$1.8 billion, and it will help increase capacity of the refinery plant from 6.5 million tonnes of crude oil to 8.5 million tonnes per year. Thành said BSR, which is now refining 85 per cent of domestic crude and 15 per cent of crude exports, could process crude oil and marine fuel oil (MFO) for export. According to a report from the Dung Quất EZ, 346 projects have been in effect with an investment of nearly US$18 billion, including 58 foreign direct investment (FDI) projects worth $1.84 billion. The Dung Quất EZ is an investment destination for the Việt Nam-Singapore Industrial Park (VSIP) and South Korea heavy industries Doosan Enerbility Việt Nam (Doosan Vina) with total investment of $739 million. The provincial delegation paid a working visit to the technology centre of Backer Hughes and the oil refinery and petrochemical centre of ExxonMobil. The province also invited the US groups and businesses to visit the Dung Quất EZ and industrial zones for further investment and co-operation in the coming time. Vietnamese, Canadian firms step up clean energy development partnership The Canada-Việt Nam Clean Energy Partnership forum took place in HCM City on Monday, aiming to connect the sides’ private sectors and, through such links, enable Canadian contributions to the Just Energy Transition Partnership (JETP), helping Việt Nam achieve its net-zero emissions goal by 2050. At the event, jointly held by the Canadian Consulate General in the southern economic hub and Canada-ASEAN Business Council (CABC), experts introduced numerous collaboration solutions. Ranjith Narayanasamy, President and CEO of the Petroleum Technology Research Centre (PTRC), stated that carbon capture, utilisation, and storage (CCUS) play a crucial role in reducing greenhouse gas emissions and developing clean energy. The PTRC has been involved in a research project sponsored by the Asian Development Bank (ADB) to test related technologies in Việt Nam. However, many participants, including representatives of domestic businesses, expressed concerns. They highlighted that the development and application of CCUS technologies in Việt Nam are facing numerous challenges, as they require large-scale testing and experimentation, and substantial investment. Michael Smart, Export Development Canada (EDC)’s business development lead for Asia and Indo-Pacific, stated that EDC has specific financial solutions for climate-related projects. Since 2012, the state-owned enterprise has provided over CAD35 billion for clean technology application projects. Boris Jacouty, Director of Business Development – Infrastructure at the Canadian Commercial Corporation (CCC), mentioned that CCC assists foreign partners in seeking opportunities for joint works with Canadian firms and in benefiting from the Canadian government's contract guarantee mechanism. In the 2021-2022 period, the value of contracts supported by CCC amounted to $6.5 billion. According to the Canadian Consulate General, as part of JETP, which Việt Nam signed with the G7 countries, Canada will mobilise US$15.5 billion from private sector and government sources in the next three to five years to aid Việt Nam's green transition process. KRX system expected to run at the end of 2023 All measures will be taken to put the KRX system into operation at the end of this year, said Nguyễn Thị Việt Hà, Acting Chairman of the Hồ Chí Minh Stock Exchange (HoSE). A meeting among members of the Vietnamese stock market was organised at the headquarters of HoSE on Monday to discuss the plan to implement the KRX information technology project. Speaking at the event, Hà said that the rate of testing the KRX system among members is still low, with just 25 out of 76 securities companies completing 100 per cent functional testing. A similar situation occurred at the Hà Nội Stock Exchange (HNX) and the Vietnam Securities Depository and Clearing Corporation (VSDC), raising concerns among testing bodies. According to Hà, the Vietnam Stock Exchange (VNX) is working with both HoSE and HNX to correct the legality, trying to match the legality with the time of implementing the new system. As planned, the KRX system will be officially launched in December this year. However, it is expected that new features will not be fully implemented immediately. The KRX system will operate with basic features, and new features will be deployed step by step according to the roadmap. \"The Ministry of Finance (MoF) has been directed to put the KRX system into operation by the end of this year. If market participants and securities companies are not prepared, organisers will have to take action and cannot wait for the securities firms. If the securities companies are not ready, the investor, HoSE, will still continue, and the securities companies will bear the losses,\" Hà said. Earlier this year, Nguyễn Đức Chi, Deputy Minister of MoF, said that HoSE needed to operate the KRX system according to the project's schedule, ensuring the smooth operation of the market continuously and effectively, while coordinating to implement the restructuring of the market, focusing on stabilising the market and strengthening supervision. The exchange also needs to ensure a safe and transparent market and actively cooperate with the VNX to complete the regulations and operating procedures, Chi added. The KRX system is an information technology system for managing and operating transactions on the Vietnamese stock market, signed by HoSE with the South Korea Stock Exchange (KRX) in 2012. The project aims to upgrade the technology system and infrastructure of the stock exchange in Việt Nam. Due to many reasons, such as the pandemic and the complex nature of the bidding package, the KRX system has not yet run as planned. The KRX system is expected to bring new products, trading, and payment solutions to the Vietnamese stock market, such as T+0 settlement, short selling, and option contracts. This will create a premise to solve the bottlenecks and move towards upgrading the market from frontier to emerging. SMCB gets green light to buy nearly 1.2 billion VPB shares The State Bank of Vietnam (SBV) has just allowed the Japanese multinational banking financial services institution, Sumitomo Mitsui Banking Corporation (SMCB), to buy newly issued shares of VPBank (VPB). The central bank requires SMBC to fulfil all obligations and responsibilities of foreign investors specified in the amended and supplemented Law on Credit Institutions 2010, as well as related circulars and decrees. To acquire 1.19 billion VPB shares, SMBC would pay more than VNĐ35.9 trillion (US$1.5 billion). SMBC's ownership ratio accounted for 15 per cent of VPBank's capital after purchasing 1.19 billion shares. For the next five years, the transfer of the number of shares bought by SMBC will be limited. After the deal, VPBank’s total equity will reach nearly VNĐ140 trillion. Previously, VPBank estimated the time to conduct a private placement for SMBC in the third and fourth quarters of 2023 after the SBV approves SMBC’s purchasing proposal, and the State Securities Commission (SSC) announces that it would receive all registration documents to sell private stocks. On the stock exchange, VPBank shares were traded at VNĐ20,600 a share. As a result, the selling price for SMBC is nearly 39 per cent higher than the current market price. At the end of March, VPBank held a signing ceremony for a private placement agreement of 15 per cent of charter capital for SMBC, officially making SMBC Group a strategic investor in the bank. This investment agreement is part of a capital increase plan that VPBank has implemented since 2022 to strengthen its long-term financial capacity and help the bank achieve its strategic growth target in the next five years. At the Annual General Meeting of Shareholders held in April, VPBank's management said that the bank would spend up to 30 per cent of its annual profit to pay dividends to shareholders in the next five years. VPBank sets a target of credit growth with a compound growth rate of 35 per cent in five years, continuing to maintain its position as a multi-purpose bank with the key segment being retail, of which the proportion of retail in the total credit portfolio is over 70 per cent. VPBank's Board of Directors recently approved increasing the maximum foreign ownership rate to 30 per cent of charter capital to ensure the implementation of the private placement plan. South Korean investors gain interest in VN stock market Capital from South Korea has recently been poured into the Vietnamese stock market, mainly thanks to a lower interest rate environment. Data from the South Korea Securities Depository (KSD) showed that in just 11 days in August, South Korean investors had net bought US$9.1 million of shares on the market, four times higher than the total net value bought in July, which was $2.12 million. From March through June, South Korean investors primarily net sold on the Vietnamese stock market, but they reversed the course and have become net buyers since July. The reversal was due to the cuts in interest rates by the Vietnamese Government that helped lift the stock market, especially in the real estate industry. It was also supported by the improvements in business results of large groups. Analysts expected that the country’s stock market would continue to tick up while reminding investors to be cautious about the market’s volatility. As the stock market has recently gained significantly compared to the beginning of the year, the upward momentum may be eased at the end of the year. The benchmark VN-Index had soared 19.1 per cent over the start of 2023. Việt Nam’s automobile sales grow slightly in July from previous month Members of the Việt Nam Automobile Manufacturers Association (VAMA) sold 24,687 vehicles in July, up 4 per cent month-on-month, VAMA reported on August 14. The June figure was 23,800, up 15 per cent from the previous month. Of the vehicles sold last month, there were 19,221 passenger cars, up 11 per cent; 5,318 commercial vehicles, down 16 per cent; and 148 special-use vehicles, up 21 per cent month-on-month. In terms of vehicle origin, the sales of domestically-assembled automobiles reached 13,575 units, down 12 per cent, while the number of imported completely built-up (CBU) vehicles was 11,112, up 34 per cent. In the first seven months of this year, VAMA members sold a total of 162,014 vehicles of all kinds, down 30 per cent year on year, with the sales of passenger cars, commercial and special-use vehicles dropping by 34 per cent, 13 per cent, and 63 per cent, respectively. According to experts, besides VAMA member units, the Vietnamese auto market also includes other automakers such as Audi, Jaguar Land Rover, Mercedes-Benz, Nissan, Subaru, Volkswagen, and Volvo, but they do not disclose business results. Meanwhile, Thành Công Group (TC Group) announced sales of 4,035 units in July, bringing its six-month sales to 14,680 units; the respective figures for VinFast were 3,042 and 14,680. VinFast’s electric vehicles, VFe34 and VF5 Plus, were the best-selling of the company with 2,181 units. Based on the sales reports from VAMA, TC Group and VinFast, Hyundai continued to lead the market in July with 4,035 vehicles, despite a month-on-month decrease of 21 per cent. It was followed by Toyota, KIA, Mitsubishi and Ford. Honda Vietnam reported an increase in motorcycle and automobile sales in July compared to the previous month. In July, it sold 152,764 motorcycles, up 14.2 per cent month on month, data showed. Meanwhile, 1,579 cars were delivered to customers, an increase of 12.5 per cent month-on-month. Among them, Honda CR-V and Honda City were the best-sellers at 454 and 467 units sold, respectively. The Vietnamese auto market is forecast to continue growing from August until the end of this year, thanks to a policy that reduces the registration fee by half. However, purchasing power might not experience the same rapid growth as last year due to the influence of the stock, real estate and consumer lending markets, which are yet to be as strong as they were last year. Nghi Son refinery to undergo first general maintenance The factory of the Nghi Son Refinery and Petrochemical LLC (NSRP), based in the central province of Thanh Hoa, will undergo the first general maintenance from August 25. NSRP General Director So Hasegawa said that during the 55-day period, the refinery will completely suspend all production activities. To minimise impacts of the suspension, the company has been proactively taking measures to reduce the maintenance duration but still ensure quality. It is also coordinating closely with relevant authorities to prevent the suspension’s impact on the domestic fuel market. The NSRP believes that after the maintenance, the refinery will boost production and guarantee the timely and stable supply of petrol and oil products for domestic enterprises and consumers for many years ahead, he noted. The executive went on to say that general maintenance is an important part of the firm’s safety commitment, enabling it to continue guaranteeing production safety, stable and long-term jobs for workers, and supply of high-quality fuel products for the domestic market even amid global economic headwinds. The NSRP hopes to contribute more to the national energy security and socio-economic development, Hasegawa added. During the maintenance period, the company will sustain community supporting activities, which is always one of its top priorities to fulfill its social responsibility, he continued, saying that it has implemented a number of programmes helping with job creation, business, agriculture, education, water supply, training, and community health care, especially for residents in nearby areas. The company has been making substantial contributions to the Vietnamese economy. During 2018 - 2021, it contributed over 3.3 billion USD to the economy and helped save more than 260 million USD thanks to the reduction of fuel imports. Hasegawa said stable energy supply is a stepping stone for Vietnam to consolidate its role as an important link in the global supply chain. With cutting-edge machinery and considerable contributions to national socio-economic development, the Nghi Son refinery is one of the key national oil and gas projects in the country. The firm is confident in the path ahead and pledges to assist the Vietnamese Government, enterprises, and people to develop on par with international markets, he remarked. Nghi Son is one of the refineries with the most modern, advanced, and sophiscated technologies in Asia. Its current processing capacity is up to 200,000 crude oil barrels per day, equivalent to 10 million tonnes per year. In particular, thanks to an optimised design with all the necessary petrochemical processing and production technologies, the factory is completely able to compete with others in the world. The NSRP is a joint venture established by four major investors, namely the Vietnam Oil and Gas Group (Petrovietnam), Kuwait Petroleum Europe of Kuwait, and Idemitsu Kosan and Mitsui Chemicals of Japan. Its factory is located in the Nghi Son Economic Zone in Thanh Hoa province. It is the main supplier of petrol and oil products for the Vietnamese market and also exports several petrochemical products to some regional countries. Its target is to help ensure the national energy security and make use of Vietnam’s strategic location in relation to major consumption centres in Asia to increase the export of important and profitable petrochemical products. Vietnamese businesses urged to achieve sustainable development goals Nature-related policies should be integrated into business strategies and plans, said Deputy Prime Minister Tran Hong Ha at the 10th Vietnam Corporate Sustainability Forum in Hanoi on August 23. To contribute to achieving sustainable development goals (SDGs) and fulfilling Vietnam’s relevant commitments, more investments should be made in nature-based solutions to enhance ecosystem services, reduce greenhouse gas emissions, increase resilience to climate change, and create new opportunities for innovation and growth, he said. Apart from big firms, small-and medium-sized enterprises, which are considered the backbone of the national economy, should play a role in sustainable development, the Deputy PM stressed. He suggested domestic enterprises study and put in place regulations and criteria for sustainable development, promote the environmental, social, and governance (ESG) practice in business administration, join environmental protection efforts, and optimise achievements of the Fourth Industrial Revolution and digital transformation to serve sustainable development. The Deputy PM also affirmed the Government’s strong commitment to building a favourable legal environment for businesses to complete the SDGs. With a strategic vision, the Party and the State have identified policies and roadmaps to perfect mechanisms, policies and laws on green economy, low-carbon economy and circular economy towards net zero emissions, he stressed. The Government always listens to opinions of the business community and focuses on policies and pilot models for the Just Energy Transition Partnership (JETP) in an effort to create an “ecosystem” of the renewable energy industry. The Government will issue more mechanisms and policies on enhancing green economy and circular economy, and supporting businesses in technology transformation and research and development centre building, while promoting personnel training with new mindset of taking people as the subject, centre, momentum and resources of development, he said. Vice Chairman of the Vietnam Chamber of Commerce and Industry (VCCI) and Chairman of the Vietnam Business Council for Sustainable Development (VBCSD) Nguyen Quang Vinh provided updates on global sustainable business trends. He stressed that the success of businesses should include their adaptation, resilience and recovery amid unprecedented challenges, as well as sustainable interests of the community, the society and the environment. Vinh also suggested businesses change value and supply chains towards sustainability. The forum, jointly held by the VCCI and VBCSD, brought together more than 300 delegates, who discussed such issues as the circular economy, low carbon emissions, green supply chain, biodiversity preservation, and sustainable energy transition, among others. Vietnam, US step up implementing deal on illegal logging, timber trade Vietnam and the US held a meeting of the Timber Working Group, set up to carry out the two Governments’ Agreement on Illegal Logging and Timber Trade, in Washington DC on August 22 - 23. The event was co-chaired by Vietnamese Deputy Minister of Agriculture and Rural Development Nguyen Quoc Tri and Assistant US Trade Representative for Environment and Natural Resources Kelly Milton. The Vietnamese delegation also included representatives of the Ministry of Agriculture and Rural Development, the Ministry of Industry and Trade, the Trade Office and the economic division of the Vietnamese Embassy in the US. At the meeting, the Vietnamese delegation updated the US side about the steps taken by Vietnam to implement the agreement, including reviewing and eliminating financial incentives for the timber processing sector, enhancing the customs control and examination of imported timber, boosting cooperation with material timber exporting countries to control origins, amend legal documents to revise the enterprise classification system, supplement criteria for specifying positive geographical areas exporting timber to Vietnam, and control the seized timber so that it doesn’t enter supply chains. The delegation emphasised that Vietnam has always made the strongest possible efforts to realise the agreement and pledges to develop a transparent, sustainable, and responsible forestry sector. During its reforms and integration into the global economy, Vietnam stays persistent in complying with the principle of sustainable development. It has made strong commitments and joined international efforts to protect the environment and the green planet. At the 26th United Nations Climate Change Conference (COP26), the Vietnamese Government committed to reducing methane emissions by 30% by 2030 compared to the level recorded in 2020 and working towards net zero emissions by 2050. The forestry sector has an important role to play in the realisation of these commitments, according to the delegation. The US side highly valued Vietnam’s serious implementation of the commitments in the agreement. It affirmed that technical assistance will continue to help Vietnam strengthen the capacity of competent agencies in order to protect forests, conserve biodiversity, and contain illegal logging and timber trade. ‘Big Four’ slash deposit interest rates to lowest in banking system The four biggest banks in Vietnam have strongly cut interest rates for many deposit terms to the lowest levels of the year. From August 23, the Joint Stock Commercial Bank for Foreign Trade of Vietnam (Vietcombank), the Vietnam Joint Stock Commercial Bank for Industry and Trade (VietinBank), and the Joint Stock Commercial Bank for Investment and Development of Vietnam (BIDV) reduced their highest deposit interest rates, applicable to deposit accounts of at least 12 months, to 5.8% per year from 6.3% per year. The rates for one- and three-month deposits were brought down by 0.3% per year to 3% and 3.8% per year, respectively, and that for six-month accounts to 4.7% per year. At the Vietnam Bank for Agriculture and Rural Development (Agribank), deposit interest rates for different terms decreased by 0.3 - 0.5% per year. The highest rate, 5.8% per year, is only for 12-month deposits. The rate for deposits of 13 months and over now stands at 5.5% per year. Meanwhile, the rates for one-, three-, and six-month savings accounts are similar to those of the three above-mentioned banks. Deposit interest rates at the “Big Four” are now the lowest in the banking system. Both deposit and lending interest rates have been reduced to aid economic recovery. (Photo: baodautu.vn) Some other banks such as Eximbank, VIB, MB and ACB have also strongly cut the rates. Compared to the peak of 9 - 10% per year at the start of 2023, deposit interest rates have fallen sharply after four regulatory interest rate adjustments by the State Bank of Vietnam (SBV). The SBV’s adjustments aim to create conditions for commercial banks to further slash lending interest rates to support the economy. Earlier, it had asked credit institutions and branches of foreign banks in Vietnam to continue reducing lending rates for existing and new loans, by at least 1.5 - 2% per year, as ordered by the Government and the Prime Minister to help enterprises and people recover and develop production and business activities. Interfoam Expo Vietnam 2023 opens in HCM City The Interfoam Expo Vietnam 2023, the first of its kind, opened in the southern economic hub of Ho Chi Minh City on August 23. The expo has been jointly organised by the Vietnam National Trade Fair and Advertising Company (Vinexad) under the Ministry of Industry and Trade, HJT Exhibition Company, Vietnam Packaging Association (VINPAS), Ho Chi Minh City Construction and Building Materials Association (SACA), and Vietnam Saigon Plastics Association (VSPA). The event gathered leading enterprises and experts in the development of foam materials and their application in the Southeast Asian market, displaying and introducing polymer foam products, foam metal, raw materials, foaming agents, foaming equipment, cutting equipment, and testing equipment. Besides, the expo also saw the participation of suppliers of recycling equipment and technology, environmental protection equipment, adhesives and sealants, shrink films and adhesive tapes. The third international foam and application forum on “Redefining foam” will also be held as part of the expo, focusing on topics such as sustainable development, technological innovation and application, and foam technology in various fields. The exhibition runs until August 25. Support Industry Fair kicks off in Hanoi The 2023 Hanoi Support Industry Fair officially opened at the National Architectural Planning & Construction Exhibition on August 23 in the capital. The three-day event features more than 250 pavilions by many domestic and foreign support industry firms such as Japan, China, Thailand, and Malaysia. The products displayed at the fair are of high-quality such as components and spare parts, as well as those serving high-tech industries. Upon addressing the opening ceremony, Nguyen Manh Quyen, vice chairman of the Hanoi People’s Committee, emphasized that it is a large-scale specialised fair on supporting industries that has been held annually since 2017. He therefore stressed that through the fair, businesses working in supporting industries will promote their capabilities and strengths, seek opportunities to popularize their products, hold trade and export promotion activities, as well as join the supply chain in the capital economic area. This is along with joining the global supply chain of multinational corporations. A number of seminars on promoting investment attraction in the fields of high technology, supporting industries, and building and developing supporting industrial cluster in the city will also be held during the course of the fair. Vietnam among top 11 exporting countries to Singapore Vietnam retained its position as Singapore's 11th largest trading partner during the seven-month period, with two-way trade turnover reaching roughly SGD16.8 billion, a fall of 9.41% on-year, according to the Vietnam Trade Office in Singapore. The country has mainly exported machinery, equipment, mobile phones, components and spare parts, along with glass and glass-based products to the city-island nation. Most notably, rice and cereals exports recorded a high growth rate compared to recent months. Meanwhile, exports of oil and gas, as well as petroleum products, optical machines, measuring instruments, and medical equipment, all endured a sharp decrease. Furthermore, 13 out of 21 import groups from Singapore to Vietnam enjoyed positive growth, including machinery, equipment, tools, spare parts, computers, plastic and plastic products, paper and paper products, tobacco and alternative tobacco products. Despite indicators of trade turnover between both nations remaining negative, there are positive signals regarding the turnover value of the following month compared to the previous month which has seen improvement in both exports and imports. Corporate Sustainability Forum helps shape prosperous future for firms The 10th Vietnam Corporate Sustainability Forum 2023 has offered a prime opportunity for businesses to come together and share and set out important initiatives aimed at shaping a bright and prosperous future ahead for them and the country as a whole, according to insiders. Co-hosted by the Vietnam Chamber of Commerce and Industry (VCCI) and the Vietnam Business Council for Sustainable Development (VBCSD) on August 23, the event featured the participation of more than 300 domestic and international delegates. \"We can create breakthrough solutions to promote sustainable development, and gradually bring Vietnamese businesses on the right track of development, said Cao Thi Ngoc Dung, vice chairwoman of the VBCSD and chairwoman of the Board of Directors of Phu Nhuan Jewelry Joint Stock Company (PNJ). During the special session held as part of the forum themed \"Promoting nature-based initiatives towards a low-carbon economy\", Dung underlined the need to innovate and grasp smart solutions aimed at using natural resources in an effective manner from the use of renewable energy to the management of natural resources. \"This not only helps to minimize negative impacts on the environment, but also helps businesses create a sustainable competitive advantage in the future,\" Dung noted. With regard to improving the overall competitiveness of enterprises through building a sustainable supply chain, she underlined the importance of building a sustainable supply chain, from ensuring the supply source to product quality, as well as complying with business ethics. “By creating a sustainable supply system, we can optimize our business, reduce risks while simultaneously contributing to maintaining the sustainability of the community and the environment,” she stated. The Vietnam Corporate Sustainability Forum was initiated just before the nation and 192 countries around the world committed to implementing the 2030 Agenda with 17 Sustainable Development Goals (SDGs) by the UN, as well as commitments to reduce climate change made at COP 21 held in 2015 in Paris, France. The move clearly demonstrates the VCCI’s creativity, pioneering, and commitments in general and the VBCSD in particular in their persistent journey which seeks to support the business community on the path of sustainable development. Growth rate of fruit and vegetable exports slows down After two consecutive months of sharp increase, fruit and vegetable export growth has slowed, with the export value reaching US$3.1 billion in the first seven months of the year, an increase of 60.5% over the same period from last year. The Import-Export Department under the Ministry of Industry and Trade cited statistics from the General Department of Customs as saying that Vietnamese fruit and vegetable exports in July reached US$404.5 million, a drop of 38.9% compared to June, but an increase of 63.6% compared to July, 2022. Fruit and vegetables exported to major markets throughout the reviewed period all grew well, except for the United States, Taiwanese, Thai, and Australian markets. The Chinese market took the top spot in export value with US$2 billion, up 128.5% over the same period from 2022. The high growth of fruit and vegetable exports to the Chinese market contributed to positive growth occurring in the fruit and vegetable industry this year as the export value to the highly lucrative market accounts for 64.7% of the nation’s total export value of this product. Import demand for fruit and vegetables in these markets remains large, although the country only exports a small part of the total demand, meaning there remains plenty of room for local businesses to exploit. Specifically, the import price from the nation only accounts for less than 0.6% of the total import value of fruit and vegetables of the US. Similarly, in the Korean market the average import demand for fruit and vegetables hit US$3.9 billion per year throughout the 2018 to 2022 period, but the value of imports from the Vietnamese market only accounted for 4.3% of the total import value. In the Japanese market, there remains an average import demand for fruit and vegetables at US$10 billion per year, although imports from Vietnam only made up for 0.6% of its total import value. Source: VNA\/SGT\/VNS\/VOV\/Dtinews\/SGGP\/VGP\/Hanoitimes","filter_flag":1}
