{"title":"Circular Design Helps Homeowners Waste Less, Preserve More - National Association of REALTORS®","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5hci5yZWFsdG9yL21hZ2F6aW5lL2NpcmN1bGFyLWRlc2lnbi1oZWxwcy1ob21lb3duZXJzLXdhc3RlLWxlc3MtcHJlc2VydmUtbW9yZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5hci5yZWFsdG9yL21hZ2F6aW5lL2NpcmN1bGFyLWRlc2lnbi1oZWxwcy1ob21lb3duZXJzLXdhc3RlLWxlc3MtcHJlc2VydmUtbW9yZdIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3Lm5hci5yZWFsdG9yL21hZ2F6aW5lL2NpcmN1bGFyLWRlc2lnbi1oZWxwcy1ob21lb3duZXJzLXdhc3RlLWxlc3MtcHJlc2VydmUtbW9yZdIBAA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5hci5yZWFsdG9yL21hZ2F6aW5lL2NpcmN1bGFyLWRlc2lnbi1oZWxwcy1ob21lb3duZXJzLXdhc3RlLWxlc3MtcHJlc2VydmUtbW9yZdIBAA?oc=5\" target=\"_blank\">Circular Design Helps Homeowners Waste Less, Preserve More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Association of REALTORS®<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular Design Helps Homeowners Waste Less, Preserve More - National Association of REALTORS®","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5hci5yZWFsdG9yL21hZ2F6aW5lL2NpcmN1bGFyLWRlc2lnbi1oZWxwcy1ob21lb3duZXJzLXdhc3RlLWxlc3MtcHJlc2VydmUtbW9yZdIBAA?oc=5\" target=\"_blank\">Circular Design Helps Homeowners Waste Less, Preserve More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Association of REALTORS®<\/font>","source.href":"https:\/\/www.nar.realtor","source.title":"National Association of REALTORS®","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Interior design experts unpack this future-minded design philosophy that centers on reducing waste. ©Scovad \/ Getty It's no secret that sustainability is trending, especially among young homeowners and buyers. Real estate professionals who understand sustainable design philosophies become trusted sources that their clients can rely on past the transaction. The word \"sustainable\" is an all-encompassing idea that breaks down into many parts. It could refer to anything from a product made with environmentally-friendly materials to a lifestyle that minimizes one’s carbon footprint. Within the overarching sustainability movement are specific philosophies that seek to solve the various issues facing the environment today. Circular design is one such specific philosophy that focuses on creating décor, fixtures and spaces with extended life cycles, thus reducing waste. \"In contrast to linear design, in which a material is designed, built, used, and discarded, circular design seeks to extend the lifetime of a material by ensuring multiple uses ...\" explains Mackenzie Collier, interior designer and founder of Mackenzie Collier Interiors in Phoenix, Ariz. \"In circular design,\" she adds, \"a product is designed to simplify future reuse or recycling.\" Circular Design 101 First things first: Circular design is not an aesthetic style. Unlike biophilic design or Art Deco, this refers to the philosophy and intention behind a product or space. \"In a circular model, materials and products enjoy endless, closed-loop lifecycles as they ... are reused, recycled, upcycled and transformed into new products and materials,\" says Laurence Carr, interior architect and designer, founder, and CEO of Laurence Carr, Inc. in New York, N.Y. In other words, waste is designed out of the equation. One example of circular design are bathroom tiles made from recycled materials, which are designed to be recycled again. The Difference Between Circular Design and Sustainable Design Circular design and sustainable design go hand in hand. Carr and Collier describe the first as a type or extension of the second. \"Sustainable design is mainly focused on reducing harm,\" explains Carr. \"Circular design is about reducing harm and reversing it to create a positive impact.\" Another way to think about it: Sustainable design minimizes the environmental impact of making a product in the first place. Circular design considers both the present and future sustainability of the materials. For Collier, incorporating circular design into the home is a natural part of a sustainable lifestyle. Homeowners who care about minimizing environmental impact will also feel drawn to circular design. How Homeowners Can Incorporate Circular Design Both design experts prefer not to call circular design a \"trend.\" Collier says it's just a good, environmentally aware practice — and it's not going away anytime soon. Depending on the client and project, circular design might look like a combination of several of the following: Going vintage. \"This way, our clients get something different than what everyone else is picking up at West Elm or Crate and Barrel this season,\" Collier says. \"It creates a gathered-over-time aesthetic, is often more cost-conscious, AND is the more environmentally sustainable choice.\" \"This way, our clients get something different than what everyone else is picking up at West Elm or Crate and Barrel this season,\" Collier says. \"It creates a gathered-over-time aesthetic, is often more cost-conscious, AND is the more environmentally sustainable choice.\" Prioritizing recycled and recyclable products. In circular design, it's essential to do everything possible to eliminate waste. One way to do that? Recycling. Collier suggests buying from companies with recycling programs (like FLOR recyclable carpet tiles) or products made from recycled materials. In circular design, it's essential to do everything possible to eliminate waste. One way to do that? Recycling. Collier suggests buying from companies with recycling programs (like FLOR recyclable carpet tiles) or products made from recycled materials. Getting pickier about building materials. For Carr, that means using certified and reclaimed woods for flooring. It also looks like using sustainable materials such as bamboo, cork or biomaterial derived from waste. For Carr, that means using certified and reclaimed woods for flooring. It also looks like using sustainable materials such as bamboo, cork or biomaterial derived from waste. Sourcing \"forever\" pieces. This could mean quality pieces from local artists or timeless furniture styles that are made to last. Today's circularity-minded clients are turning away from flashy trends and toward homes and products that are made to stand the test of time. This could mean quality pieces from local artists or timeless furniture styles that are made to last. Today's circularity-minded clients are turning away from flashy trends and toward homes and products that are made to stand the test of time. Reimagining the home structure itself. Homeowner clients will probably have an easier time using circular designs during room refreshes or renovations. But for those looking to build, Carr points to prefabricated homes. \"[They're] created with a focus on energy efficiency and durability, able to be disassembled and repurposed at the end of their useful life,\" she says. Circular Design Resources for Clients Infusing a house with circular design takes time. It happens product by product, room by room. So, where should you and your clients start? Third-party certifications, says Carr. That means looking for products and materials verified as sustainable or circular. Here are some of the third-party stamps of approval Carr looks for: \"The built environment generates nearly 50% of annual global CO2 emissions …,\" says Carr. \"Any small efforts we can each make in our own lives add up in a big way, so please do keep circularity at the top of mind whenever making decisions about your home and lifestyle!\"","filter_flag":1}
{"title":"Back to the future - accelerating the adoption of circularity - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2Jsb2dzL2lubm92YXRpb24tbWF0dGVycy8yMDIzLzIwMjMwNDA1LWJhY2stdG8tdGhlLWZ1dHVyZS1hY2NlbGVyYXRpbmctdGhlLWFkb3B0aW9uLW9mLWNpcmN1bGFyaXR5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2Jsb2dzL2lubm92YXRpb24tbWF0dGVycy8yMDIzLzIwMjMwNDA1LWJhY2stdG8tdGhlLWZ1dHVyZS1hY2NlbGVyYXRpbmctdGhlLWFkb3B0aW9uLW9mLWNpcmN1bGFyaXR5Lmh0bWzSAQA?oc=5","id":"CBMilgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2Jsb2dzL2lubm92YXRpb24tbWF0dGVycy8yMDIzLzIwMjMwNDA1LWJhY2stdG8tdGhlLWZ1dHVyZS1hY2NlbGVyYXRpbmctdGhlLWFkb3B0aW9uLW9mLWNpcmN1bGFyaXR5Lmh0bWzSAQA","guidislink":false,"published":"Wed, 05 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=95, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2Jsb2dzL2lubm92YXRpb24tbWF0dGVycy8yMDIzLzIwMjMwNDA1LWJhY2stdG8tdGhlLWZ1dHVyZS1hY2NlbGVyYXRpbmctdGhlLWFkb3B0aW9uLW9mLWNpcmN1bGFyaXR5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Back to the future - accelerating the adoption of circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Back to the future - accelerating the adoption of circularity - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2Jsb2dzL2lubm92YXRpb24tbWF0dGVycy8yMDIzLzIwMjMwNDA1LWJhY2stdG8tdGhlLWZ1dHVyZS1hY2NlbGVyYXRpbmctdGhlLWFkb3B0aW9uLW9mLWNpcmN1bGFyaXR5Lmh0bWzSAQA?oc=5\" target=\"_blank\">Back to the future - accelerating the adoption of circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Circularity is critical to addressing the challenges of climate change, resource scarcity, and biodiversity loss As a materials-intensive industry, healthcare has significant scope to reverse the dominant linear economic model Driving resource efficiency requires us to look beyond the design and production of hardware and take an integrated view of equipment, services and digital solutions Circularity is often presented as a fresh, new answer to humankind’s pressing environmental challenges. In actual fact, ‘circular’ is not new at all. Pre-industrialization, it was the dominant economic model. Nothing was lost or discarded, everything was re-used, repaired, repurposed or recycled. And so the wheel went round. The 19th century saw the rise of the linear economy, where raw materials are transformed into products that are used until they are discarded as waste. This ‘take-make-waste’ model was driven by, among other things, the industrial revolution and the availability of cheap energy thanks to coal and steam. It is a polluting model that drives global environmental challenges, including climate change and biodiversity loss. Linear became totally dominant with mass production and the rise of the consumer society after World War II. That same period also saw, in response, the reintroduction of circular thinking. Key milestones included Boulding’s influential 1966 essay The Economics of the Coming Spaceship Earth, the publication of Braungart and McDonough’s Cradle to Cradle, and the advent of think-tanks such as the Biomimicry Institute and Ellen MacArthur Foundation. So where do we stand today? To focus minds and drive progress, many ambitious climate and circular economy targets have been set. The European Union, for example, wants to achieve a circular economy by 2050 as a precursor to becoming net-zero and halting biodiversity loss. The Netherlands was the first country to set a 100% circularity target for 2050, with the ambition to halve primary resource use by 2030. And the United Kingdom has adopted an ambitious program to deliver a net-zero National Health Service by 2050. But, on the whole, as IPCC chair Hoesung Lee commented, “We are walking when we should be sprinting.\" [1] The harsh reality is that the global situation is getting worse year-on-year, driven by rising material extraction and use: from 9.1% of global production based on circular economy principles in 2018, to 8.6% 2020, and now 7.2% in 2023 [2]. Statistics like these underline the need to rapidly accelerate the adoption of circularity. And nowhere more so than in healthcare. ","filter_flag":1}
{"title":"Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5","id":"CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5\" target=\"_blank\">Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ludHJvZHVjaW5nLWNvYWNodG9waWEtYS1uZXctd29ybGQtb2YtY2lyY3VsYXItY3JhZnQtZnJvbS1jb2FjaC1wb3dlcmVkLWJ5LWNvbW11bml0eS1idWlsZGluZy10b3dhcmRzLWEtYmV0dGVyLWZ1dHVyZS1mb3Itb3VyLXBsYW5ldC0zMDE4MDI2NDEuaHRtbNIBAA?oc=5\" target=\"_blank\">Introducing Coachtopia: A new world of circular craft from Coach. Powered by community, building towards a better ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"\"Circularity is about reimagining not just the product lifecycle, but the relationship between brand, planet and consumer. That's why we've created Coachtopia as both a discovery lab to pioneer circularity in fashion and a collaborative platform for change,\" says Joon Silverstein, SVP, Global Marketing, Creative and Sustainability at Coach and Head of Coachtopia. \"We know that to transform our impacts, we need to fundamentally shift mindsets—from seeing opportunity in waste to designing backwards to taking a more open-source approach to creativity. We've built Coachtopia as an entirely new world within Coach—an agile start-up with a mission to reimagine the end-to-end system. We're building it not just for our consumers, but with them, inviting a growing community of hundreds of Gen Z individuals to join us on our Slack channel, collaborate with us on products, take center stage in our content and campaigns—and reimagine our future together.\" Designed for and with a new generation of consumers who are increasingly passionate about addressing the climate crisis and determined to drive change, Coachtopia is resetting the paradigm between brand and consumer, co-creating a new brand in collaboration with a growing community of Gen Z individuals—from climate activists, designers and upcyclers to journalists, film makers, entrepreneurs and fashion enthusiasts. The Coachtopian community has been actively involved in Coachtopia since its earliest founding days, with members continually sharing their perspectives on circular fashion, shaping concepts, and setting expectations of the change they want to see. As part of its mission, Coachtopia is investing in this next generation of talent through collaborative programs, harnessing and showcasing new talent to find solutions to the problems facing fashion. \"We were inspired by our shared desire to do better for the planet by inventing new circular ways of dreaming, designing and creating,\" said Coach Creative Director Stuart Vevers. \"It's a bigger, bolder step forward in realizing our vision for sustainability at Coach, where we prioritize experimenting and learning, and ethical design intentions over cookie cutter perfection. Coachtopia takes this to a new level by challenging us to 'design in reverse,' with the end goal of circularity top of mind, in collaboration with the next generation and their optimistic vision for tomorrow.\" Coachtopia is a world in progress—advancing iteratively towards a continually evolving vision of circularity. It builds upon the investments that Coach is making to improve the end-to-end sustainability of its business, as well as the learnings and capabilities developed through the brand's Coach (Re)Loved program. By giving a second life to more than 20,000 Coach products since its April 2021 launch, Coach (Re)Loved has provided critical insights into the aspects of traditional luxury craftsmanship that make circularity challenging, and thus the need to design for circularity from the start in order to achieve it at scale. Coachtopia takes up this challenge, innovating through rapid prototyping and forming a continuous feedback loop with Coach to drive mutual progress. Coachtopia launches today with an all-gender collection of bags, accessories, ready-to-wear and footwear made with recycled, repurposed and renewable materials and designed with our Made Circular™ principles in mind. As Coachtopia grows, it will continue to innovate through limited drops of experimental products that push circular craft ever further—with a commitment to take back every product at end-of-life for reuse, remaking or recycling. Each bag, wallet, footwear and ready- to-wear product also comes with a unique digital passport—accessed via an embedded NFC chip—that gives customers transparency into its materials, Made Circular™ design and impacts. This digital passport also provides the means to follow the product's journey as it is repaired, restored, reused and reimagined over multiple lives. Coachtopia is available today on Coach.com in the US, Canada and UK and in Selfridges, London. Coachtopia will then launch in Spitalfields, London on April 28; Coach stores across the US including Coach House Fifth Avenue, New York; N. Michigan Avenue, Chicago; The Grove, Los Angeles; and Dadeland, Miami; and additional Selfridges stores across the UK in May; Coach House Regent Street, London in early June; and Coach Soho, New York in July. Coachtopia will also expand to Asia later this year. That's just the short version. Take a full tour of Coachtopia, including details on its Made Circular™ principles, material innovations, strategic partnerships and launch campaign below. Learn more about Coachtopia at coachtopia.com. Connect on social @coachtopia. A world of circular craft In today's linear fashion system, over 85% of materials produced end up incinerated or as waste in landfill. Through its Made Circular™ principles, Coachtopia is working to design out waste and reduce the use of new materials—the creation of which accounts for 38%* of the fashion industry's greenhouse gas emissions—while helping to keep products out of landfill by designing them to be reused over many lives. Coachtopia's Made Circular™ principles are as follows: Craft with recycled, repurposed or renewable materials. Exploring new ways to craft from what already exists, with a mission to avoid the creation of new, virgin materials in making Coachtopia products. The leathers used in Coachtopia products are either ingeniously Upcrafted from Coach production waste or made with at least 50% recycled leather scraps from tanneries. Other materials used across the range include 95%+ recycled cotton for hoodies and T-shirts, a colorful 70%+ recycled resin for bag straps and hardware, 100% recycled polyester for canvas totes and webbing on footwear and a 40% bio-based renewable Sugarcane EVA for footwear soles. Exploring new ways to craft from what already exists, with a mission to avoid the creation of new, virgin materials in making Coachtopia products. The leathers used in Coachtopia products are either ingeniously Upcrafted from Coach production waste or made with at least 50% recycled leather scraps from tanneries. Other materials used across the range include 95%+ recycled cotton for hoodies and T-shirts, a colorful 70%+ recycled resin for bag straps and hardware, 100% recycled polyester for canvas totes and webbing on footwear and a 40% bio-based renewable Sugarcane EVA for footwear soles. Design for multiple lives. Crafting products to be more easily disassembled, repaired and reimagined for second and even third lives. Coachtopia is continually working to develop new, circular design details to help products to be more easily repaired, unmade and remade with less damage to their components and materials than in conventional luxury leather goods. From removable screw- back hardware, detachable handles and straps, binding or seam-out constructions and monomaterial designs, Coachtopia design innovations are aimed at keeping materials in use at their highest value—and out of landfill. Crafting products to be more easily disassembled, repaired and reimagined for second and even third lives. Coachtopia is continually working to develop new, circular design details to help products to be more easily repaired, unmade and remade with less damage to their components and materials than in conventional luxury leather goods. From removable screw- back hardware, detachable handles and straps, binding or seam-out constructions and monomaterial designs, Coachtopia design innovations are aimed at keeping materials in use at their highest value—and out of landfill. Create circular pathways. Committing to take back all Coachtopia products, regardless of age or condition, and finding ways to reuse them, with clear pathways defined for restoring, upcrafting, remaking and recycling. Each Coachtopia product can be traded in at a Coach Retail store in exchange for a credit—calculated according to the product's original price and current condition. Each one comes with a unique digital passport to track its journey across multiple lives. * Source: Fashion on Climate, McKinsey & Company, 2020 Material Innovations Designed in accordance with Coachtopia's Made Circular™ principles, the Coachtopia launch collection features a range of products ingeniously made with waste, including the Ergo and Wavy Dinky shoulder bags, a multi-functional 3-in-1 Crossbody Belt Bag and a selection of small leather goods, ready-to-wear, footwear and accessories crafted with recycled, repurposed and renewable materials. Key innovations include: Upcrafted leather Upcrafted leather is made from Coach production waste, specifically, the scraps of leather left over after Coach bag patterns are cut from leather hides, through processes that are only possible thanks to Coach's 80+ years of leather expertise. In the launch collection, the Ergo and Wavy Dinky bags have been reimagined using a range of different Upcrafted techniques, including patchwork, weaving, appliqué, sequins, pressed leathers and scrap binding, that transform Coach waste—from leather cutting room scraps to zipper ends— into unique artisanal styles. Key styles include the Ergo and Wavy Dinky in Checkerboard Upcrafted Leather. Coachtopia Leather Coachtopia leather is made with at least 50% recycled leather scraps from tanneries. Though it's made with waste, it sacrifices nothing in terms of style: Coachtopia has worked with its partners to ensure Coachtopia leather has the premium finish, grain and hand feel that you would expect from a Coach leather product. All bags and leather goods in the launch collection are available in Coachtopia leather variations, including styles that come with a unique Upcrafted binding made from Coach production leather scraps. 70% Recycled Resin As part of Coachtopia's mission to design for multiple lives, several styles in the launch collection come with easily detachable handles crafted in a colorful resin made from at least 70% recycled plastic waste, sorted by color and then extruded into new materials in one-of-a-kind patterns and colors. This recycled resin is also used across the collection for select hardware details and hangtags. A Shift Towards \"Nothing New\" Throughout the collection Coachtopia has examined every detail of its products with a view to replacing virgin materials with recycled, repurposed or renewable ones. The leather linings of Coachtopia bags are made with at least 50% recycled leather scraps. The thread used to stitch them is 100% recycled polyester. The plastic hardware in bags and small accessories is made from at least 70% recycled resin. Ready-to-wear is crafted in 95%+ recycled cotton or repurposed denim deadstock. Even the labels inside each product are 100% recycled polyester or nylon. Additionally, Coachtopia's at least 75% recycled packaging has been designed to be multi-functional to reduce material use and is printed with renewable Algae Ink.™ Powered by Community Coachtopia is being built as a community in which a new generation of fashion enthusiasts, creatives, entrepreneurs, activists and more are invited to participate through collaborative discussions, projects and opportunities. It's a platform for change in which emerging Gen Z voices help create the future they want to see. The Coachtopia Beta Community Coachtopia has been built on the passion of the Coachtopia Beta Community, a global and growing network of diverse and inspiring Gen Z individuals who are feeding their perspectives and ideas into Coachtopia products, messages and concepts as they are developed. They are united by a desire to drive positive change and help build a better future for fashion. \"We want to be part of the conversation because we see what the world will be like if we don't make change.\" Sophie Lowery, 20, film student and Coachtopia Beta Community founding member Collaborative drops Through limited-edition product collaborations, Coachtopia is inviting emerging talents to show- case their creativity and bring new and inspiring perspectives to bear on fashion's challenges. The brand's first collaboration is with graphic designer and illustrator Sabrina Lau, whose original art- work for Coachtopia's launch drop is inspired by her love of texture and surreal juxtaposition, as well as her encounters with nature throughout her home city of New York. \"Honestly, it was like a fever dream. It really did feel like a true collaboration—it was very open. And to be the first one to kick it off is truly an honor.\" Sabrina Lau, 25, collaborating graphic designer and Coachtopia Beta Community member Designing the future With the Coach Foundation, Coachtopia is sup- porting the passion and ingenuity of tomorrow's design talent. The CFDA x Coach Dream It Real Circular Design Scholarship has been awarded to 15 students passionate about making fashion more circular. Coachtopia has invited these scholars to participate in a \"Coachtopia Waste Contest\" in which, with mentorship from the Coachtopia team, they worked to develop new creative uses for Coach leather scraps. Select projects will be brought to market as limited edition drops. \"Going through the design and production process with the Coachtopia team pushed me to design with a new perspective. [The experience] has given me a lot more confidence in designing for circularity— and has inspired me to always leave a positive impact with the products I make.\" Vivian Luo, 21, fashion design student at The New School and Coachtopia Beta Community member. Community-driven storytelling As part of its collaborative ethos, Coachtopia is putting its community at the forefront of its campaigns and storytelling—engaging its broader audience in meaningful conversations around circular fashion through the voices of the inspiring and diverse group of individuals in the growing Coachtopian community. These community members are featured in the launch campaign, web content and a range of digital assets that take us behind-the-scenes in the making of Coachtopia, working both in front of and behind the camera. \"As a sustainability consultant and designer I've been bringing my voice and expertise to Coachtopia. They are collaborating with us, with the next generation of artists, activists and designers. Coachtopia has created a unique community of like-minded people in the sustainability and fashion spaces.\" Maya Penn, 23, climate activist, sustainable fashion designer and artist and Coachtopia Beta Community member. The Launch Campaign In its launch campaign, Coachtopia is paying tribute to its growing community, bringing together nine Gen Z talents, along with Coachtopia's designer and master craftsperson, who represent the breadth of voices feeding into the brand's products, messages and long-term vision: Lola Tung, actor Maya Penn, climate activist sustainable fashion designer and artist Caulin Donaldson (aka Trash Caulin), climate activist and creator Sabrina Lau, graphic designer Natalia Spotts, vintage and second-hand boutique owner Tyler McGillivary, fashion designer and upcycler Aditi Mayer, climate activist, photojournalist and speaker Sinn Chhin, makeup artist and designer Rahmir Meggett, fashion designer, entrepreneur and model Trey Denis, Coachtopia designer Mauricio Alvarado, Coachtopia master craftsperson The campaign film is directed by filmmaker Adrien Lagier, and the images were shot by photographer Remi Ferrante. Film & Photography Credits Production House: ADEUS Director: Adrien Lagier Editor: Roman Lagier Photographer: Remi Ferrante Set Designer: Till Duca Stylist: Max Ortega Creative Agency: Marcel Worldwide Building towards a better future In the knowledge that circularity is not an end point, but a journey, Coachtopia is working iteratively to improve its processes, prioritizing progress over perfection to find new ways of reimagining waste and reducing its carbon footprint. To drive that progress and measure its impacts, Coachtopia is collaborating with partners across the industry who share its mission for driving positive change through innovation. Key Partners The Ellen MacArthur Foundation The Ellen MacArthur Foundation is a non-profit committed to driving the global transition towards a circular economy and sharing learnings about its benefits for biodiversity, climate change and waste reduction. Coachtopia's Made Circular™ principles have been informed by The Ellen Mac- Arthur Foundation's vision of a circular economy for fashion where products are used more, made to be made again and made from safe and recycled or renewable inputs. Coachtopia's parent company, Tapestry, is a Network Partner of the Ellen MacArthur Foundation. ReCircled ReCircled is an innovative recycling and takeback company that helps keep pre-loved products and materials in circulation at their highest value, saving them from being sent to landfill. Coachtopia is working with ReCircled to help recycle otherwise unusable materials. For example, packaging waste and materials from unrepairable Coach products have been reimagined into new Coachtopia materials, such as the filling for the Coachtopia furniture ottomans in select stores. EON Coachtopia has partnered with EON, fashion's leading product cloud platform, to create a unique, cloud-based digital passport for each Coachtopia product, accessed via a scannable NFC chip or QR code embedded in the product. Through this partnership, Coachtopia is harnessing technological innovation to meet the need for data-driven circularity in an environment where clarity and transparency on the lifecycle of every product is increasingly vital. By connecting a product's digital passport to their account, Coachtopia customers can access a range of circular services that will help to prolong the lifespan of their product. Gen Phoenix Coachtopia has worked with Gen Phoenix, an innovative sustainable materials company, to develop a soft and durable uncoated leather lining, used in many Coachtopia products, made with at least 50% recycled leather scraps and 75% total recycled content. Gen Phoenix uses a patented hydroentanglement technology to create high quality materials from recycled leather waste, specifically offcuts from tanneries that might otherwise have been sent to landfill. Building on this Coachtopia partnership, Tapestry, the parent company of Coach, has invested in Gen Phoenix as part of the company's recent funding round. Everywhere Apparel We source the minimum 95% recycled cotton fabrics for Coachtopia T-shirts and hoodies through Everywhere Apparel, a company that collects, sorts and shreds pre- and post-consumer waste materials to create new yarns and fabrics. When a piece of Coachtopia clothing is no longer usable, we plan to work with Everywhere Apparel to mechanically recycle these materials into new textiles of the same value, with the goal of working towards a closed loop system where new products are made from old. WSP Coachtopia has partnered with WSP, one of the world's leading engineering, environment and professional services firms, to create an environ- mental impact calculation tool for Coachtopia. This cradle-to-grave tool calculates both the greenhouse gas emissions of our products and the total weight of waste diverted from landfill to create them. 1% for the planet Coachtopia* is a member of 1% for the Planet, a growing global community of businesses and individuals working together to help protect the earth. As a member, we've pledged to donate 1% of Coachtopia's annual sales to verified environmental non-profit organizations working to create positive change. *partnership with Tapestry, our parent company Good Shipping, 3 Degrees Coachtopia offsets the carbon emissions of its upstream and downstream shipping and freight, including eCommerce shipments to consumers, through two partnerships: Good Shipping, a company that substitutes fossil fuels in ocean freight with sustainable biofuels, a verified carbon neutral fuel option, and 3 Degrees, a company that works with brands to offset emissions through a portfolio of certified carbon emissions reductions projects. Our Impacts Coachtopia is assessing the impacts of its products through a carbon footprint and waste diversion measurement tool developed in partnership with WSP, one of the world's leading engineering, environment and professional services firms. To ensure these impacts are communicated with the utmost transparency, the brand is conducting a critical review of these metrics with three external lifecycle assessment experts—the results of which will be published in mid-2023. Coachtopia has also worked with testing and certification company SGS to conduct full lifecycle assessments of its key styles, the Ergo and the Wavy Dinky, to identify continued opportunities for reducing the impact of its products. Carbon Footprint Carbon Reduction Waste Diversion 10 kgs CO2e created. 71% carbon reduction. 398 gs waste diverted. Coachtopia has worked with WSP to calculate the carbon footprint of each one of its products, with the goal of reducing their overall emissions. By repurposing materials that already exist, this product helps to avoid the creation of new materials—which accounts for 38% of fashion's emissions. Coachtopia also works to reduce its emissions across its full value chain. By upcyling and recycling waste that might otherwise have been sent to landfill, this product helps Coachtopia to work towards a zero-waste future. The Reusable Store Each Coachtopia store environment reflects the brand's Made Circular™ principles, featuring fixtures made with Coach leather production waste, neon signs made from industry scraps and offcuts, hangers and trays made from recycled paper or textiles, seating made from excess materials and unrepairable Coach bags and a flexible modular design that facilitates reuse. Each store environment also reflects Coachtopia's collaborative ethos with bespoke furniture crafted by local artists using upcycled damaged Coach products, excess Coach materials and locally salvaged materials. To learn more about Coachtopia and its processes, visit Coachtopia.com. To learn more about Coach's sustainability commitments and progress, visit www.coach.com\/sustainability-crafted-to-last. To learn more about Tapestry's sustainability commitments and progress, visit www.tapestry.com\/responsibility\/our-planet. About Coach Coach is a global fashion house founded in New York in 1941. Inspired by the vision of Creative Director Stuart Vevers and the inclusive and courageous spirit of its hometown, the brand makes beautiful things, crafted to last—for you to be yourself in. Coach is a Tapestry, Inc. brand. Tapestry is publicly listed on the New York Stock Exchange under the ticker TPR. About Tapestry, Inc. Our global house of brands unites the magic of Coach, kate spade new york and Stuart Weitzman. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. We use our collective strengths to move our customers and empower our communities, to make the fashion industry more sustainable, and to build a company that's equitable, inclusive, and diverse. Individually, our brands are iconic. Together, we can stretch what's possible. To learn more about Tapestry, please visit www.tapestry.com. The Company's common stock is traded on the New York Stock Exchange under the symbol TPR. Follow and connect with Tapestry on LinkedIn and Instagram or visit our newsroom. To build your future at Tapestry, find our latest job opportunities on our careers page. Press Inquiries Amanda Garcia Santana, Global Head of PR & Celebrity Relations [email protected] Brooke Hudson, Director, Global Brand Communications [email protected] SOURCE Coach, Inc.","filter_flag":1}
{"title":"Taking used electronics out of the landfills and back into business - Cisco Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL25ld3Nyb29tLmNpc2NvLmNvbS9jL3IvbmV3c3Jvb20vZW4vdXMvYS95MjAyMy9tMDQvdGFraW5nLXVzZWQtZWxlY3Ryb25pY3Mtb3V0LW9mLXRoZS1sYW5kZmlsbHMtYW5kLWJhY2staW50by1idXNpbmVzcy5odG1sP3NvdXJjZT1yc3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL25ld3Nyb29tLmNpc2NvLmNvbS9jL3IvbmV3c3Jvb20vZW4vdXMvYS95MjAyMy9tMDQvdGFraW5nLXVzZWQtZWxlY3Ryb25pY3Mtb3V0LW9mLXRoZS1sYW5kZmlsbHMtYW5kLWJhY2staW50by1idXNpbmVzcy5odG1sP3NvdXJjZT1yc3PSAQA?oc=5","id":"CBMijQFodHRwczovL25ld3Nyb29tLmNpc2NvLmNvbS9jL3IvbmV3c3Jvb20vZW4vdXMvYS95MjAyMy9tMDQvdGFraW5nLXVzZWQtZWxlY3Ryb25pY3Mtb3V0LW9mLXRoZS1sYW5kZmlsbHMtYW5kLWJhY2staW50by1idXNpbmVzcy5odG1sP3NvdXJjZT1yc3PSAQA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL25ld3Nyb29tLmNpc2NvLmNvbS9jL3IvbmV3c3Jvb20vZW4vdXMvYS95MjAyMy9tMDQvdGFraW5nLXVzZWQtZWxlY3Ryb25pY3Mtb3V0LW9mLXRoZS1sYW5kZmlsbHMtYW5kLWJhY2staW50by1idXNpbmVzcy5odG1sP3NvdXJjZT1yc3PSAQA?oc=5\" target=\"_blank\">Taking used electronics out of the landfills and back into business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cisco Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Taking used electronics out of the landfills and back into business - Cisco Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL25ld3Nyb29tLmNpc2NvLmNvbS9jL3IvbmV3c3Jvb20vZW4vdXMvYS95MjAyMy9tMDQvdGFraW5nLXVzZWQtZWxlY3Ryb25pY3Mtb3V0LW9mLXRoZS1sYW5kZmlsbHMtYW5kLWJhY2staW50by1idXNpbmVzcy5odG1sP3NvdXJjZT1yc3PSAQA?oc=5\" target=\"_blank\">Taking used electronics out of the landfills and back into business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cisco Newsroom<\/font>","source.href":"https:\/\/newsroom.cisco.com","source.title":"Cisco Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Every year, millions of tons of phones, computers, routers, switches, games, and more are discarded — with much of it left to decay slowly in landfills around the world. Cisco has had programs in place for more than two decades to facilitate product returns for reuse and recycling. These programs support progress toward Cisco’s 100 percent product return-upon-request pledge. Used products contain valuable raw materials and\/or can be refurbished, create new sales opportunities, and protect the environment. In honor of Recycle IT Day, we spoke with Andrew Sage, Cisco global partner and routes to sales (GPRS) executive sponsor for sustainability, and Katherine Hannah, Cisco GPRS sustainability lead, about Cisco’s innovations in circular design, recycling, and driving new business with used equipment. Thank you, Andrew, and Katherine! What is the overall picture today for e-waste in the world? AS: Thank you, Kevin. E-waste has long been a problem in the technology industry and beyond, especially with the explosion in digital tech over the past few decades. Electronic products and equipment can contain potentially harmful chemicals and materials. KH: At the same time, they also contain valuable raw materials. Global e-waste is thought to hold roughly $60 billion worth of raw materials each year. What inspired Recycle IT Day, and how long has it been in practice? AS: Recycle IT Day began back in 2002, as an opportunity to raise awareness and support practical solutions to the e-waste problem. Many Cisco offices and data centers had lots of used switches, routers, and other gear sitting in closets and storage lockers. And Cisco employees — like about everyone, everywhere — had plenty of old phones, computers and other devices lying around. So, it was a chance for everyone to do the right thing and bring all their old stuff to the office to be recycled or sent to its next use. What has been the impact since 2002? KH: From 2002 to 2022, we estimate Cisco employees have contributed to recycling 3,100 metric tons of used equipment during Cisco Recycle Day events. Much of that stopped during the pandemic months, but we have picked up in a big way ever since. It also served to raise awareness. Given the opportunity, and if it is more convenient, people will try to get products recycled the right way. This year, 116 Cisco offices will participate. In 2021, Cisco declared its overarching purpose was to power an inclusive future for all. How does that align with recycling e-waste? KH: Cisco’s purpose has driven us to do better. It encompasses so much — from social justice and opportunity around the world to supporting education and sustainability — to name just a few focus areas. That same year, we set a goal to reach net zero greenhouse gas (GHG) emissions across our value chain (Scopes 1, 2 and 3) by 2040. Recycling, refurbishing, and reusing are important elements to in helping support a liveable planet, for us — and for our children. Our purpose continues to drive our evolution to a regenerative, circular model in which we reduce the resources we consume and the waste we generate. As a society, we simply cannot continue to expand potentially toxic landfills or dump plastic in the oceans. What are some ways in which Cisco is a leader in the recycling, refurbishing, and reusing space? AS: As mentioned before, at Cisco, we are evolving into a regenerative, circular model in which we reduce the resources we consume and the waste we generate. With this approach, we prioritize materials with recycled content; design products for resource efficiency; and facilitate repair, remanufacturing, and recycling to extend product life. We have set a goal for 100 percent of new Cisco products and packaging to incorporate circular design principles by our fiscal year 2025. Cisco’s circular design focus areas include design for disassembly, repair, and reuse — designing products with easily separable components that use similar materials to facilitate reuse, repair, remanufacturing, and recycling. In addition, in 2018, Chuck Robbins, our CEO, pledged to support 100 percent of product returns globally upon request at no cost to our customers, as part of the Platform for Accelerating the Circular Economy (PACE). Cisco programs like Refresh, Green Pay, and Takeback and Reuse can help reduce environmental impacts from technology installation to end of life. What happens to products returned to Cisco? KH: Cisco reuses and recycles nearly 100 percent of the equipment that is returned to us. This is something some customers may still not be aware of, and we continue focusing on raising awareness about this and making product returns as easy as possible. Cisco has a vast, global ecosystem of partners. How do they helpincrease the impact of the company’s sustainability goals? KH: The impact of partners is huge and growing. A year ago, we launched something called the Environmental Sustainability Specialization, which is a new business specialization available to all Cisco partners. The specialization recognizes partners for supporting Cisco’s sustainability initiatives and equips them to educate customers, promote product takeback, assist in customers’ move to circular business models, and further their own sustainability practices. It expands on Chuck Robbins’ commitment towards 100 percent repurpose or recycling of products by rewarding partners who meet recycling goals. And the interest in this has been amazing. So far, 476 partners have taken the Cisco Environmental Sustainability Specialization pledge. That is one of the fastest ramp-ups of its kind that we have seen. AS: And here’s more good news: Once accredited with the Environmental Sustainability Specialization, Cisco partners in participating countries are eligible to participate in Cisco’s Takeback Incentive. Sounds intriguing. What is it? KH: The TakeBack Incentive offers discounts of up to seven percent on new products registered in the program, with a commitment to return the used hardware back to Cisco. By replacing their used hardware, customers can reduce their carbon footprint, while gaining greater speed, bandwidth, security, low latency, and other capabilities. Cisco will also pick up and remove the used hardware for free, so it can be responsibly recycled or repurposed. So, it can be a win-win for everyone: partners, customers, and the planet. The returned equipment can then wind up in Cisco Refresh, an initiative started in 2001. This offers partners and customers certified Cisco remanufactured equipment with the same warranty and support options as new Cisco products, but at discounted prices. So, we’re extending the useful life of Cisco products, and sharing cost-effective equipment that uses less energy than manufacturing a new product instead. So, we’ve clearly come a long way. On Recycle IT Day, what do you see for the future? AS: Well, I’m excited to see our communities recognize the critical importance of protecting the environment. More and more business leaders, customers, and politicians are waking up to the critical importance of protecting our planet and our future. And there is so much more we can do, with innovation and collective action. KH: Yes, I see Cisco continuing to be a leader in this space. And we welcome everyone on this journey. We can help change the world with sustainability and circular-economy principles. But only if we work together.","filter_flag":1}
{"title":"Starting with the end in mind: Primark launches its first circular product collection - Primark","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2NvcnBvcmF0ZS5wcmltYXJrLmNvbS9lbi1nYi9hL25ld3MvcHJpbWFyay1jYXJlcy9zdGFydGluZy13aXRoLXRoZS1lbmQtaW4tbWluZC1wcmltYXJrLWxhdW5jaGVzLWl0cy1maXJzdC1jaXJjdWxhci1wcm9kdWN0LWNvbGxlY3Rpb27SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2NvcnBvcmF0ZS5wcmltYXJrLmNvbS9lbi1nYi9hL25ld3MvcHJpbWFyay1jYXJlcy9zdGFydGluZy13aXRoLXRoZS1lbmQtaW4tbWluZC1wcmltYXJrLWxhdW5jaGVzLWl0cy1maXJzdC1jaXJjdWxhci1wcm9kdWN0LWNvbGxlY3Rpb27SAQA?oc=5","id":"CBMijQFodHRwczovL2NvcnBvcmF0ZS5wcmltYXJrLmNvbS9lbi1nYi9hL25ld3MvcHJpbWFyay1jYXJlcy9zdGFydGluZy13aXRoLXRoZS1lbmQtaW4tbWluZC1wcmltYXJrLWxhdW5jaGVzLWl0cy1maXJzdC1jaXJjdWxhci1wcm9kdWN0LWNvbGxlY3Rpb27SAQA","guidislink":false,"published":"Wed, 12 Apr 2023 21:06:40 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=12, tm_hour=21, tm_min=6, tm_sec=40, tm_wday=2, tm_yday=102, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2NvcnBvcmF0ZS5wcmltYXJrLmNvbS9lbi1nYi9hL25ld3MvcHJpbWFyay1jYXJlcy9zdGFydGluZy13aXRoLXRoZS1lbmQtaW4tbWluZC1wcmltYXJrLWxhdW5jaGVzLWl0cy1maXJzdC1jaXJjdWxhci1wcm9kdWN0LWNvbGxlY3Rpb27SAQA?oc=5\" target=\"_blank\">Starting with the end in mind: Primark launches its first circular product collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Primark<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Starting with the end in mind: Primark launches its first circular product collection - Primark","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL2NvcnBvcmF0ZS5wcmltYXJrLmNvbS9lbi1nYi9hL25ld3MvcHJpbWFyay1jYXJlcy9zdGFydGluZy13aXRoLXRoZS1lbmQtaW4tbWluZC1wcmltYXJrLWxhdW5jaGVzLWl0cy1maXJzdC1jaXJjdWxhci1wcm9kdWN0LWNvbGxlY3Rpb27SAQA?oc=5\" target=\"_blank\">Starting with the end in mind: Primark launches its first circular product collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Primark<\/font>","source.href":"https:\/\/corporate.primark.com","source.title":"Primark","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"New 35-piece collection is designed and made to be worn for longer, with the aim of helping to reduce fashion waste, and is part of Primark’s commitment to give clothes a longer life The collection is the first of its kind based on Primark’s new Circular Product Standard, a framework for how it intends to design products now and in the future. Primark is launching its first product range designed and made to be reloved or recycled. From mid-April, customers can shop the new circular product collection, designed using Primark’s new Circular Product Standard, which is based on principles established by the Ellen MacArthur Foundation. This 35-piece collection, which includes menswear, womenswear and kidswear, is made up of universally loved shapes, designs and colours that you can mix and match with your wardrobe staples. From fibre composition to enhanced durability and recyclability, each piece has been carefully designed to support Primark’s ambition to move towards a more circular future. This collection is the first for Primark, with more planned for later in the year. From stylish wide leg denim and relaxed fit jeans to transitional denim overshirts and relaxed-fit t-shirts, this is a collection of spring\/summer wardrobe heroes to mix and match, knowing that they can be recycled into new clothes and materials when they reach the end of their life. The collection is priced at Primark’s typical great value, with prices ranging from £4 to £20, all part of Primark’s commitment to make more sustainable fashion affordable for customers. Every piece in the collection has been designed and made to be reloved or recycled with a focus on three key parts: More sustainably sourced materials[1]: the clothes in the collection are made from at least 95% cotton from the Primark Sustainable Cotton Programme, which trains cotton farmers to use less water, chemical fertilisers and pesticides, earning an increased profit as a result. The other 5% is made up of trims, embellishments or buttons, which, where possible, have been designed to be removable or recyclable. Durability: everything has a life cycle, even clothes. But how long an item should last and what Primark, and customers, can do to extend its life is something Primark is challenging itself to address. This new collection has been tested for increased durability in line with Primark’s new enhanced durability wash standard[2]. Recyclability: every piece is designed to be recycled at the end of its life. This means, where possible, trims and buttons can be removed so the items can be more easily reused or recycled either into new fibres or new products. Customers can drop their pre-loved clothing off at their local textile donation point, which are currently available in Primark stores in selected markets. Speaking about the new collection, Nicholas Lambert, Circular Product Lead at Primark commented: “This collection brings together years of work to create a new framework, with the ambition of enabling our product teams and suppliers to create more circular products that are designed with the end in mind. This has led to the creation of our first circular collection of affordable wardrobe staples that customers can rewear, repair and ultimately recycle. While we hope our customers enjoy wearing every piece in the collection, we also want to bring them on this journey with us as we look to change mindsets about what an affordable, circular product looks like. This collection was created by a small group of our designers, buyers and suppliers piloting our new Circular Product Standard and, while we know this is just one small step in our commitment to become a more circular business, we’re excited to now roll these new design principles out across our business and with more suppliers, allowing us to scale it up.” Laura Leahy, Assistant Buyer for Womenswear said: “Learning to design with a truly circular vision has been eye-opening. I was involved in the design pilot last year and I am so excited to finally see the product land in store and our customers enjoying it. What’s great about this range is that is it’s all about essentials that can be paired up with wardrobe staples time and time again. I am already looking forward to the next collection we put together.” Jules Lennon, Fashion Lead, Ellen MacArthur Foundation said: “To address our current take, make, waste, linear fashion industry, we must transition to a circular economy for fashion, where clothes are used more, made to be made again, and made from safe and recycled or renewable inputs. Through their participation in The Jeans Redesign, and development of their Circular Product Standard, Primark is taking a step forwards in its long-term circular economy journey. Now there is a clear pathway and a need to continue driving action, at pace and scale.” Alongside the range, Primark has published its new Circular Product Standard, a framework for how it intends to design products now and in the future. It will be used by Primark’s Product Teams and its suppliers to support Primark’s ambition that its clothes to be worn for as long as possible and then recycled at the end of their life. It will be updated annually to reflect Primark’s progress in this space. Developed in consultation with circularity think tank Circle Economy and the non-profit sustainability educator Sustainable Fashion Academy, the new framework is built on the vision for a circular economy for fashion by the Ellen MacArthur Foundation, a global thought leader on the circular economy, and in consultation by climate action NGO, WRAP. Both Circle Economy and Sustainable Fashion Academy partnered with Primark to develop a bespoke Circular by Design training programme which aims to educate Primark’s Product Teams and key suppliers in the theory and practice of a circular economy and its application in their day-to-day work. The launch of the collection follows a pilot of the Circular Product Standard framework last year where Primark trained an initial group of designers, buyers and suppliers in circular design. This training will now be rolled out to over 500 members of Primark’s product teams this year, along with additional selected suppliers. [1] More sustainably sourced materials are materials which have a lower environmental impact when compared with conventional materials. Read more about our Primark Cares fibres here. [2] All denim in the collection has been tested to our enhanced durability wash standard of 30 washes, jersey to 56 washes.","filter_flag":1}
{"title":"Primark launches its first circular clothing range - News - The Chemical Engineer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNoZW1pY2FsZW5naW5lZXIuY29tL25ld3MvcHJpbWFyay1sYXVuY2hlcy1pdHMtZmlyc3QtY2lyY3VsYXItY2xvdGhpbmctcmFuZ2Uv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNoZW1pY2FsZW5naW5lZXIuY29tL25ld3MvcHJpbWFyay1sYXVuY2hlcy1pdHMtZmlyc3QtY2lyY3VsYXItY2xvdGhpbmctcmFuZ2Uv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3LnRoZWNoZW1pY2FsZW5naW5lZXIuY29tL25ld3MvcHJpbWFyay1sYXVuY2hlcy1pdHMtZmlyc3QtY2lyY3VsYXItY2xvdGhpbmctcmFuZ2Uv0gEA","guidislink":false,"published":"Tue, 18 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=108, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNoZW1pY2FsZW5naW5lZXIuY29tL25ld3MvcHJpbWFyay1sYXVuY2hlcy1pdHMtZmlyc3QtY2lyY3VsYXItY2xvdGhpbmctcmFuZ2Uv0gEA?oc=5\" target=\"_blank\">Primark launches its first circular clothing range - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Chemical Engineer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Primark launches its first circular clothing range - News - The Chemical Engineer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnRoZWNoZW1pY2FsZW5naW5lZXIuY29tL25ld3MvcHJpbWFyay1sYXVuY2hlcy1pdHMtZmlyc3QtY2lyY3VsYXItY2xvdGhpbmctcmFuZ2Uv0gEA?oc=5\" target=\"_blank\">Primark launches its first circular clothing range - News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Chemical Engineer<\/font>","source.href":"https:\/\/www.thechemicalengineer.com","source.title":"The Chemical Engineer","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"JuliusKielaitis\/Shutterstock.com CLOTHING retailer Primark has launched its first product range designed to be reused or recycled, as the company moves towards a more circular future. It was designed using the company’s new circular product standard (CPS), which was published alongside the product launch. The standard is based on principles established by the Ellen MacArthur Foundation (EMF) and outlines what constitutes a circular fashion product. It will be updated annually to reflect Primark’s progress in this area. EMF is a charity committed to creating a circular economy. It has warned that textile production emits more greenhouse gases than international flights and maritime shipping combined, with less than 1% of the material used to produce clothing being recycled. The newly launched clothing collection comprises 35 pieces across kids wear, menswear, and womenswear. They were designed with focus on three areas including recyclability. At the end of a products life, where possible, trims and buttons can be removed so items can be more easily reused or recycled, either into new fibres or new products. Customers will be able to drop off clothes at a local textile donation point, currently available at Primark stores in select markets. Primark has also focussed on ensuring materials are sustainability sourced. Clothes in the collection are made from at least 95% cotton from Primark’s sustainable cotton programme, which trains farmers to use sustainable practices. The remaining 5% is made of trims, embellishments, or buttons that can be removed or recycled. The clothing was also made to have enhanced durability, with denim tested to a wash standard of 30 washes, and jerseys to 56 washes. Primark says clothes in the collection are affordably priced, with pieces ranging from £4–20, and will be available from this month. The company plans to release further circular clothing later this year. Jules Lennon, fashion lead at the Ellen MacArthur Foundation, said: “To address our current take, make, waste, linear fashion industry, we must transition to a circular economy for fashion, where clothes are used more, made to be made again, and made from safe and recycled or renewable inputs. Through their participation in The Jeans Redesign, and development of their circular product standard, Primark is taking a step forwards in its long-term circular economy journey. Now there is a clear pathway and a need to continue driving action, at pace and scale.” Later this year, Primark also plans to launch a bespoke circular design training programme to educate its product teams and key suppliers on the theory and practice of circular economy. This follows a pilot training with its CPS to some product teams and key suppliers, that gained feedback which facilitated the recent publication.","filter_flag":1}
{"title":"Coach embraces Gen Z and circularity with Coachtopia launch - Fashion Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3cuZmFzaGlvbm5ldHdvcmsuY29tL25ld3MvQ29hY2gtZW1icmFjZXMtZ2VuLXotYW5kLWNpcmN1bGFyaXR5LXdpdGgtY29hY2h0b3BpYS1sYXVuY2gsMTUwNzk3OS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3cuZmFzaGlvbm5ldHdvcmsuY29tL25ld3MvQ29hY2gtZW1icmFjZXMtZ2VuLXotYW5kLWNpcmN1bGFyaXR5LXdpdGgtY29hY2h0b3BpYS1sYXVuY2gsMTUwNzk3OS5odG1s0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3cuZmFzaGlvbm5ldHdvcmsuY29tL25ld3MvQ29hY2gtZW1icmFjZXMtZ2VuLXotYW5kLWNpcmN1bGFyaXR5LXdpdGgtY29hY2h0b3BpYS1sYXVuY2gsMTUwNzk3OS5odG1s0gEA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3cuZmFzaGlvbm5ldHdvcmsuY29tL25ld3MvQ29hY2gtZW1icmFjZXMtZ2VuLXotYW5kLWNpcmN1bGFyaXR5LXdpdGgtY29hY2h0b3BpYS1sYXVuY2gsMTUwNzk3OS5odG1s0gEA?oc=5\" target=\"_blank\">Coach embraces Gen Z and circularity with Coachtopia launch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fashion Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Coach embraces Gen Z and circularity with Coachtopia launch - Fashion Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3cuZmFzaGlvbm5ldHdvcmsuY29tL25ld3MvQ29hY2gtZW1icmFjZXMtZ2VuLXotYW5kLWNpcmN1bGFyaXR5LXdpdGgtY29hY2h0b3BpYS1sYXVuY2gsMTUwNzk3OS5odG1s0gEA?oc=5\" target=\"_blank\">Coach embraces Gen Z and circularity with Coachtopia launch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fashion Network<\/font>","source.href":"https:\/\/ww.fashionnetwork.com","source.title":"Fashion Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Coach embraces Gen Z and circularity with Coachtopia launch By Sandra Halliday Published Apr 20, 2023 has unveiled a major sustainability initiative with the launch of Coachtopia, a new Gen Z-focused product strand debuting Thursday in North America and the UK, and arriving in Asia later this year. Coachtopia So what is Coachtopia? At its most basic level, it’s a youth-focused bags line priced a little below the regular Coach offer that makes the most of waste materials… luxury from scraps! On a more complicated level, it means the -owned brand has completely re-thought the product process. Covetable new bags (and other items) are made from the leftover materials that usually go straight to landfill, those offcuts, zipper ends and the like that were previously seen as unusable. And it’s been making sure that representatives of the ultimate end customer have been heavily involved at all stages. The company sums this up saying it’s a “new world of circular craft. Powered by community, building towards a better future for our planet”. Essentially, Coachtopia “reimagines the product lifecycle from end to beginning — reducing the creation of new materials by crafting with waste and designing products that can be reimagined, remade and recycled to live multiple lives. In so doing, it is working to create beautiful things that have a significantly reduced impact on the planet compared to conventional luxury products”. It really does represent a whole new way of thinking for Coach from design to production and even pricing. But it’s just a beginning. Joon Silverstein, the company’s SVP of Global Marketing and Sustainability, and Head of Coachtopia, talked Fashionnetwork.com through the launch at the label’s , London flagship. DISCOVERY LAB She said it’s been “created as a discovery lab to accelerate our transition to a circular economy. We're really rethinking the product life cycle from end to end. Creating beautiful new things from waste, designing to re-make at scale and ultimately working towards a closed loop system. “We know we can't create our circular future alone. So we’re building Coachtopia as an inclusive community of designers, thinkers, makers, and consumers. We’ve had a Gen Z community working with us that’s now 120-strong.” Coachtopia It’s been a 20-month project so far that has seen the company revising its thinking along the way as it has come up against stumbling blocks and discovered new possibilities. And the fundamental point about it is the very different approach it has required. For instance, Silverstein said: “We're designing for multiple lives. Typical luxury craftsmanship makes circularity very hard. An example is that in traditional luxury leathergoods, the back of the hardware is always invisible. It’s generally sandwiched between the shell and the lining because that’s what looks ‘refined’. But when that hardware or the handle needs to be replaced or repaired, we have to take apart the entire bag. And so in Coachtopia, all of our hardware screws back and the backs are exposed. So it’s more easy disassembled and remade.” But will this go down well with luxury shoppers? Silverstein thinks it will: “We’ve found that Gen Z have a very different mindset, older generations, typically, would tell us that ‘we're okay if you make it sustainable as long as we can't see the difference. Make it invisible’. Gen Z tell us ‘we want to see the difference’. “So all of the construction, including our binding, allows things to be taken apart more easily without damage. We’re really thinking about not just how a product will be used in a single life, but about when a product comes back to us. Products need to be more easily disassembled to create circular pathways, and to ultimately create a pathway back into new products.” Coachtopia Another point of difference is pricing. We’ve all become used to the ‘sustainability price premium’ as creating products sustainably can drive costs skywards. Silverstein said that Coachtopia prices are pitched below those of regular Coach products and the company is “really focused on breaking the trade-off that Gen Z consumers have today” between what they want to buy and what’s affordable. “We don't want products to be more expensive because they're sustainable,” she insisted. And of course, a big change comes in the way the company thinks about the design process. Essentially, designing products using scraps can’t be approached in the regular way. “We have to design backwards,” she said. “In the traditional world we design forward, we envision the perfect products, we go out and make those products. Today, we can’t do that. We start from the problem we're trying to solve, which in this case is cutting room floor scraps. And we use creativity to transform what already exists. We tried to apply existing modes of working on the scraps, which didn’t work.” She explained that we now “experiment and prototype. One example is this bag with zippers, if you think about when you purchase zippers they come on a huge role and then at the end there's always a tiny piece that's not big enough. We’re taking the scraps and turning them into bags”. The result is bags in chequerboard patterns, with contrast colour fringing, with Coach’s signature flower appliqués, and yes, with decorative zipper trims. There’s even a bag that uses the tiniest scraps from scraps. “This unique pressed leather is made from scraps that are too small to use elsewhere,” Silverstein explained. “We’ve innovated a way to press them into a really unique material”. BETTER SYSTEM At its core, it’s all about “pioneering a better fashion system, tackling the fundamental problem of fashion that's built as a linear system where we extract natural resources from the earth, use energy, water and chemicals, and the majority ends up in landfill”. Coachtopia Silverstein quoted figures that say almost 40% of fashion’s impact is from the creation of new virgin materials and that this is “a big priority for us to tackle”. She added: “We’re already reaching the limits of this system. The Global Footprint Network estimates that if we maintain our current rate of resource extraction and waste generation we would need 1.8 planet earths.” She had a host of other disturbing figures about humans’ impact on the planet relating to the products we make, consume and discard. So it’s no surprise that the target consumer for Coachtopia is also a scared consumer. Silverstein said that Gen Z are “anxious about the future…. 50% say humanity is doomed. They feel a lot of anxiety. Part of our vision in creating Coachtopia is that it’s a heavy subject but we want to approach it with a more hopeful vision of the future, hence the name.” Of course, targeting a consumer group that’s more sustainably minded than any other and that will represent 40% of the luxury market by 2035, makes good commercial sense, as well as being planet-friendly. And with the future customer in mind, as mentioned, the company has worked very closely with a Gen Z community. It comprises 120 people that have helped it come up with every aspect of Coachtopia. “We believe very strongly that it’s important to create it not for these consumers but with them,” Silverstein stressed. “They see sustainability as a moral choice, but they also value uniqueness and self-expression. “They’re also consuming fast fashion. For us, that's not evidence that they’re not doing what they believe in, but rather that they’re making trade-offs. And we see that they express their increasing discomfort with the trade-offs that they’re making.” She said that these individuals “see themselves as participants, not just consumers. They share this with us over and over again that they want to be at the table, they want to be part of driving the change, to help shape a different future. One of our beta community members said ‘we want to know what's going on beneath the surface, we want to be invited to talk about these things to make sure we’re being heard’.” The heavy involvement of the young people in the development of Coachtopia has seen the community of “designers, makers, up-cyclers, journalists, activists, creatives, filmmakers, thinkers, and consumers feeding their perspective into Coachtopia from the early days,\" she said. “They’re also collaborating with us on products, graphics, and content messaging. We engage with them daily on Slack channels. “Coachtopians are at the centre of all of our content messaging and campaigns, they’re the models, they’re on our e-com site, in our launch campaigns.” They’ve designed graphics too. For instance, regarding shoes, the company has replaced the trio of supplier box, customer-facing box, and shopper bag with one footwear box adorned with community-created motifs. And it’s supporting the target group further with circular design scholarships and a craftsperson apprenticeship programme. In fact, two of the scholarship recipients designed collections “that we’ll be bringing to market as limited-edition drops.” CIRCULARITY RULES! The approach to Coachtopia that the company has taken has been undeniably deep with a whole host of other features such as developing a unique environmental impact calculator, which allows it to calculate the carbon footprint of every product and share that information with customers. Silverstein said she knows that “circularity isn't an endpoint, it’s a journey, and we’re prioritising progress and experimentation over perfection, really looking end to end across the whole value chain. We’re looking at how we reduce and eliminate packaging, thinking about end-of-life. “The notion of circularity isn't really well understood. It’s become a buzz word. But we want to be part of an emerging group of brands, non-profits, and other organisations helping to define emerging standards for circularity.” It’s an ambition that grew out of the Coach (Re)Loved programme that to date has processed more than 20,000 products across the US, Canada, UK, Japan and China. Coachtopia But it’s also an ambition that made the company realise that achieving “circularity at scale is very challenging. In order to truly scale for circularity, we have to truly design for it from the very beginning. Coachtopia says ‘how do we go back to the very beginning?’ We've committed to take back every Coachtopia product, regardless of age or condition. Add to find clear pathways for keeping them in use at their highest value.” And while it’s inevitably going to be a small part of the firm at launch, the plan is that it will grow. Silverstein concluded: “We’re starting quite small because we want to get it right. It will launch in a small way but we really do want to do this at scale. We have bold ambitions!”","filter_flag":1}
{"title":"Solgaard Launches Mono-Material, Fully Circular Backpack; A Red Dot 2023 Product Design Award Winner - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NvbGdhYXJkLWxhdW5jaGVzLW1vbm8tbWF0ZXJpYWwtZnVsbHktY2lyY3VsYXItYmFja3BhY2stYS1yZWQtZG90LTIwMjMtcHJvZHVjdC1kZXNpZ24tYXdhcmQtd2lubmVyLTMwMTgwOTI1OC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NvbGdhYXJkLWxhdW5jaGVzLW1vbm8tbWF0ZXJpYWwtZnVsbHktY2lyY3VsYXItYmFja3BhY2stYS1yZWQtZG90LTIwMjMtcHJvZHVjdC1kZXNpZ24tYXdhcmQtd2lubmVyLTMwMTgwOTI1OC5odG1s0gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NvbGdhYXJkLWxhdW5jaGVzLW1vbm8tbWF0ZXJpYWwtZnVsbHktY2lyY3VsYXItYmFja3BhY2stYS1yZWQtZG90LTIwMjMtcHJvZHVjdC1kZXNpZ24tYXdhcmQtd2lubmVyLTMwMTgwOTI1OC5odG1s0gEA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NvbGdhYXJkLWxhdW5jaGVzLW1vbm8tbWF0ZXJpYWwtZnVsbHktY2lyY3VsYXItYmFja3BhY2stYS1yZWQtZG90LTIwMjMtcHJvZHVjdC1kZXNpZ24tYXdhcmQtd2lubmVyLTMwMTgwOTI1OC5odG1s0gEA?oc=5\" target=\"_blank\">Solgaard Launches Mono-Material, Fully Circular Backpack; A Red Dot 2023 Product Design Award Winner<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Solgaard Launches Mono-Material, Fully Circular Backpack; A Red Dot 2023 Product Design Award Winner - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NvbGdhYXJkLWxhdW5jaGVzLW1vbm8tbWF0ZXJpYWwtZnVsbHktY2lyY3VsYXItYmFja3BhY2stYS1yZWQtZG90LTIwMjMtcHJvZHVjdC1kZXNpZ24tYXdhcmQtd2lubmVyLTMwMTgwOTI1OC5odG1s0gEA?oc=5\" target=\"_blank\">Solgaard Launches Mono-Material, Fully Circular Backpack; A Red Dot 2023 Product Design Award Winner<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"NEW YORK, April 27, 2023 \/PRNewswire\/ -- Sustainable travel and lifestyle brand, Solgaard announces the launch of its first mono-material, fully circular backpack. Named a 2023 Red Dot: Product Design Award Winner, the Solgaard Circular Backpack is made from recycled and recyclable materials, exemplifying innovative and achievable circularity in product design. The Solgaard Circular Backpack Named 2023 Red Dot: Product Design Award Winner. (Photo: Solgaard) Adrian Solgaard and attendees speak during Town Hall at SESSION 12 at TED2023: Possibility. April 17-21, 2023, Vancouver, BC, Canada. (Photo: Gilberto Tadday \/ TED) Featuring a mono-material design crafted from a single polymer: PET, the material most commonly associated with single-use water bottles, the innovative engineering of the latest Solgaard backpack presents a circular design solution for technical soft goods. Typically, these products are made with various mixed materials which cannot be recycled together, resulting in a challenging disassembly process that can prove more costly than the product's recyclable value. All materials in the Solgaard Circular Backpack, including fabric, trims, labels, and internal cushioning, have been re-engineered using exclusively PET material, which allows for simple and cost-effective mechanical recycling. Featured throughout the exterior and interior of the Circular Backpack, the durable ballistic Solgaard proprietary Shore-Tex® material made from ocean-bound plastic can be easily recycled alongside plastic bottles. Engineered to optimize daily work, life, and travel; the feature-rich backpack interior includes protected 16\" laptop storage, tablet sleeve, dual carrying methods, tracking device pocket, and customized organization pockets for eyeglasses, cables, and stationery. Adventure-ready, the exterior design features a water-resistant exterior, built-in luggage strap, lumbar-positioned secret passport pocket, and power bank cord pass-through. The Red Dot Design Award is one of the biggest international design competitions. With around 20,000 entries annually from 60 countries, the best products of every year are honored with the coveted Red Dot: Product Design Award, a highly regarded seal of outstanding design quality recognized worldwide. Debuted at TED2023 in Vancouver on April 17-21, 2023, conference attendees and speakers received special TED-branded editions of the new Solgaard Circular Backpack, as part of the sustainable brand's in-kind partnership with TED. Speaking during a town hall at TED2023: Possibility, on April 21, 2023, in Vancouver, Solgaard Founder and CEO, Adrian Solgaard, said: \"This year is all about possibility, and circularity is being discussed as far off in the future. But the solution is in your hands today. Typically, a backpack is made from dozens of materials…the TED2023 [Circular Backpack] is 100% mono-material exclusively made from PET, which means that at the end of its useful life, it can be recycled as easily as a plastic bottle. This is something we need to be demanding from our preferred consumer brands…designing for use and end of life is possible today.\" The Solgaard Circular Backpack ($165.00 USD) is available exclusively at www.solgaard.co . About Solgaard: A design driven brand using business as a force for good, Solgaard's premium travel and lifestyle goods are crafted through sustainable innovation. Pioneers in using ocean-bound plastic in its fabrics (Shore-Tex®) and travel gear (including The Carry-On Closet®), Solgaard cleans up 6lbs of plastic from coastal communities with every purchase. Relentless in his pursuit to create an economic engine for good, Norwegian-Canadian entrepreneur, Adrian Solgaard, founded the brand in 2016 to optimize life on the go for global citizens. With over 1.4 million pounds of coastal plastic collection underway as of April 2023, Solgaard is working to collect an additional 10 million pounds of plastic via its current project pipeline. Solgaard is a certified B Corporation. Learn more at www.solgaard.co and www.solgaard.co\/impact. Media Contact: SOLGAARD \/ Emma Garner, Head of Public Relations: ( [email protected]) SOURCE Solgaard","filter_flag":1}
