{"title":"Keynote: Futnani on engaging superpowers in MENA and beyond - TXF","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnR4Zm5ld3MuY29tL2FydGljbGVzLzc1MTkva2V5bm90ZS1mdXRuYW5pLW9uLWVuZ2FnaW5nLXN1cGVycG93ZXJzLWluLW1lbmEtYW5kLWJleW9uZNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnR4Zm5ld3MuY29tL2FydGljbGVzLzc1MTkva2V5bm90ZS1mdXRuYW5pLW9uLWVuZ2FnaW5nLXN1cGVycG93ZXJzLWluLW1lbmEtYW5kLWJleW9uZNIBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LnR4Zm5ld3MuY29tL2FydGljbGVzLzc1MTkva2V5bm90ZS1mdXRuYW5pLW9uLWVuZ2FnaW5nLXN1cGVycG93ZXJzLWluLW1lbmEtYW5kLWJleW9uZNIBAA","guidislink":false,"published":"Wed, 08 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=67, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnR4Zm5ld3MuY29tL2FydGljbGVzLzc1MTkva2V5bm90ZS1mdXRuYW5pLW9uLWVuZ2FnaW5nLXN1cGVycG93ZXJzLWluLW1lbmEtYW5kLWJleW9uZNIBAA?oc=5\" target=\"_blank\">Keynote: Futnani on engaging superpowers in MENA and beyond<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TXF<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Keynote: Futnani on engaging superpowers in MENA and beyond - TXF","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LnR4Zm5ld3MuY29tL2FydGljbGVzLzc1MTkva2V5bm90ZS1mdXRuYW5pLW9uLWVuZ2FnaW5nLXN1cGVycG93ZXJzLWluLW1lbmEtYW5kLWJleW9uZNIBAA?oc=5\" target=\"_blank\">Keynote: Futnani on engaging superpowers in MENA and beyond<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TXF<\/font>","source.href":"https:\/\/www.txfnews.com","source.title":"TXF","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Transition\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"You’re going to be headlining a panel about the role of MENA ECAs in project and development finance at the MENA 2023: Export, Project & Development Finance event for TXF, Proximo and Uxolo in Dubai on March 14-15. How will local ECAs help support the energy transition? Manav Futnani (MF): The Middle East region and the GCC in general has ambitious targets for growing their non-oil economy. Other advanced economies around the world, Western Europe, North Asia, the Americas have ECAs to support that ambition. The Middle East absolutely must have its own version that supports its non-oil exports. The establishment of these agencies has very much been the right move. I hope the governments in the region will continue to give them resources so that they can grow their offering and support exporters from this region. We talk to them regularly and I'll be talking to their leaders at the at the conference. I'm excited to hear from them in terms of what progress they've made in recent months. I moderated this very panel last year and it was standing room only. I am expecting the same this year! The entire community is extremely excited about the development of these agencies. They are not OECD Consensus signatories and they have an enormous amount of flexibility in terms of what they do. We’re very keen to see how they bring that energy and enthusiasm and flexibility to help their exporters. How are you enjoying your new role as HSBC’s global co-head of export finance and head of Middle East, North Africa and Turkey infrastructure and asset finance. It sounds like a broad remit. What has been your journey to the role and what is it you’re working on? Manav Futnani (MF): I decided very early in my career that I wanted to focus on the broad theme of infrastructure finance and have worked across our ECA finance, infrastructure finance, and asset finance businesses. I joined HSBC straight out of graduate school in 2003, spent the first six and a half years in London, then in India for three years, then Hong Kong and now Dubai. I’ve been working on ECA financing throughout my career and have really seen the product evolve – it’s a real honour for me to be co-heading this business globally. How does HSBC structure its actual project finance and export credit functions and how you divide it up between your co-head of export finance? MF: I run the ‘Real Assets Finance’ platform for the Middle East, North Africa and Turkey. This platform includes the following businesses: export finance, infrastructure finance, asset finance\/aviation, and then real estate finance. I co-head export finance globally with Philip Lewis. He was my first boss when I joined HSBC, we've known each other for 20 years and work very closely together. For a business like export finance, global integration is critical, so we don’t divide the business geographically. It’s an interesting structure, housing export finance and infrastructure finance within the same business line. How is that a superpower? MF: A lot of banks will put project finance in a sector team and export finance, for example, in trade, so they are in completely different places. Every once in a while they do talk and work together, but it's a very different relationship from the way project and export finance expertise is brought together at HSBC. If I reflect on how we've structured this business, differently perhaps from much of the competition, I would characterise it as our ‘superpower’. We’re able to move resources around and cross pollinate the skills and understanding. Particularly with large, complex multijurisdictional transactions, the tough ones, we have a competitive advantage because our bankers speak project finance and our project finance bankers are a part of the deal team. We also have exceptional geographic reach, which allows us to bring together in-depth understanding of the relevant ECAs and suppliers, but also of our borrowers in their home jurisdictions. How important are energy transition deals in your in your portfolio now? MF: Vitally important. We have set ourselves a really ambitious target of deploying $750 billion to $1 trillion towards sustainability by 2030. Making sure that we are going down that path by supporting the transition is vital. When I look at my pipeline going forward, roughly half the deal volume is either green or sustainable in some shape or form. It's not only about doing the right thing, it's also really good business because that's where the investment dollars are going. The Middle East is well known as being a provider of energy. That energy is in the form of hydrocarbons at the moment, but when you think of the world decarbonising, that should not mean that the Middle East loses its place as the energy supplier to the world. For instance, the first large green hydrogen project was signed on 1 March [ACWA Power signed financing agreements for a total investment of $8.5 billion for NEOM Green Hydrogen Project (NGHP)], and HSBC is a part of that transaction. I see the Middle East leading the globe on some of these new, clean and green, sustainable sources of energy. For example, our clients globally are certainly talking about hydrogen, but most of them are still just exploring the idea or building pilot projects. In the Middle East we're already building green hydrogen at scale, spending billions of dollars. So, yes, it’s vitally important to what we’re doing at HSBC, and is a big part of the spend here in the Middle East and globally. The energy transition is going to require a lot of investment financing, and that’s what we’re here to do. HSBC has been acting as ‘green finance coordinator’, lender and agent with Euler Hermes on a couple of wind farm and solar deals they are covering in Turkey (Enerjisa Üretim) – can you elaborate a bit on that role? MF: There are deals that are compliant with green loan principles or with sustainable loan characteristics built into them. Our clients need experts to help them with structuring the loan in compliance with green loan principles and\/or structuring as a sustainability linked loan. It’s a relatively new title in the ECA business, but it is one that accurately describes our role on many transactions. You have worked with multiple ECAs in the MENA region, what more can ECAs and banks do to help facilitate the bankability of deals, particularly in the transition? MF: In the last couple of years the development of new products and the pace of change for ECAs has been the fastest I’ve seen in two decades. There are a couple of reasons. First, we saw ECAs really rising to the challenge of the pandemic with the emergence of domestic programmes. ECAs stepped up to support key exporters in their home markets to ensure they would get through that challenging period. One of the most interesting of those programmes was the UK Export Finance Export Development Guarantee (EDG) scheme. Second, we’ve also seen the growth of untied programmes such as the SACE Push programme where SACE is trying to promote future exports by building financing relationships with the borrowers they see as being high potential importers from Italy. The Japanese and Korean ECAs have had untied programmes for a long time, Bpifrance have announced a programme as well. We recently worked with CESCE in Spain on the largest wind farm in Australia [MacIntyre wind farm]. I understand that there is a push from ECAs to modernise the OECD Consensus. That would be wonderful. The world is changing and the OECD Consensus must change with that. The broader message for many ECAs at the moment is that they want to find new ways to support the energy transition. If updating the Consensus would mean they could do longer tenors, or that the repayment profiles of those loans could be tailored better to the cash flows, that would be really welcome and would mean ECAs can really step up to playing their role in the transition. What about for the bankability of deals for SMEs? MF: The community has been talking about this issue for a very long time. There has been some progress here where certain ECAs have got programmes to support SMEs where they work with them directly. For instance, using a template loan document and simplified application processes. We have done several deals where there are large numbers of smaller suppliers, but typical buyer credit loans still tend to have a minimum size to justify the transaction costs. My sense is that ECAs are aware of this challenge and are trying to address that through more standardised products. Green Sukuk hasn’t been thriving to the extent the market expected a couple of years ago. HSBC has been active in the (wholesale) market but is there more that can be done, particularly in the export finance arena? MF: I think it’s worth asking what is the problem capital markets based ECA financing would solve? From the way I see pricing dynamics at the moment, banks continue to fund ECA loans very competitively, which is why financing is either mainly done with bank liquidity, and some direct lending from ECAs themselves.There are deals that struggle to find bank interest but these tend to be very small or they are transactions in challenging jurisdictions. I'm not sure the capital markets would be relevant in either of these situations. What deals are you most excited about and what your portfolio is going to look like in five years’ time? Do you think new transition technology deals are going to materialise? MF: I'm very excited by new technologies, by the energy transition and the opportunity that that brings. ECAs understanding hydrogen, gigafactories, carbon capture and being able to take those risks is critical. We’ve built up an expertise within HSBC in the key transition sectors and we are sharing our expertise with ECAs and other key stakeholders. In industries like green hydrogen, there is very limited precedent to turn towards for guidance – we have to go back to first principles of how you make a deal bankable and apply these principles to the specific risks in these new sectors. The scope for innovation and creativity makes it particularly interesting. And in terms of geographies? MF: I'm massively excited by the opportunity in Saudi Arabia. The developments there are unprecedented in scale and in world class ambition. Most of the headlines will gravitate towards NEOM, which is an amazing project, but one should not overlook the much broader transformation taking place in Saudi. They are building new entertainment districts, creating multiple new tourist destinations, a new international airline, and so much more. Become a subscriber today for unrestricted access to the best export, trade and commodity finance analysis available. Click here for information on the different packages available for you and your team Exclusive subscriber-only content published last week: Corporate Perspective: thyssenkrupp Uhde’s Bembennek calls ECAs to action on clean energy TXF spoke with Daniel Bembennek, head of finance for thyssenkrupp Uhde, about the challenges of financing clean ammonia and ‘blue’ hydrogen. Exporters are still missing a strong commitment from ECAs on all relevant clean energy projects, especially ‘blue’ projects, he says....Read on here Trafigura and the case of the missing nickel Laurel and Hardy, Abbot and Costello, Cheech and Chong – all iconic comedy duos. Having booked a $577 million charge for the first half of 2023 against what it claims is a nickel fraud – Trafigura and Dopey looks set to be added to the list....Read on here Commodity finance 2022: Consolidation and diversification in the spotlight 2022 was almost instantly off to a detrimentally Sullivan partner Geoff Wynne looks at various issues in connection with purchasing or taking security over receivables where they are evidenced or replaced by an IPU (Irrevocable\/Independent Payment Undertaking), both for the purchaser and the provider of the IPU....Read on here Hirachand heads up SocGen India Katan Hirachand has been made chief executive and chief country officer at Societe Generale India. Hirachand was previously co-head of advisory and...Read on here Pak Lay hydro seeking lenders Gulf Energy Development (GED) and SinoHydro – partners in the 770MW Pak Lay run-of-the-river hydro project in Laos – have issued an...Read on here HSBC appoints Sanjay Tandon as global head of commodities HSBC has announced that Sanjay Tandon will take on the role of global head of commodities, global trade and receivables finance (GTRF). He moves from...Read on here Swiss Re has re-jigged its global trade finance team Swiss Re Corporate Solutions has reorganised and simplified its global trade finance team structure which it says will make it more agile now that it...Read on here","filter_flag":1}
