{"title":"Carbon market gives clearer rules on offsetting - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wOC8xMS9DYXJib24tbWFya2V0LWdpdmVzLWNsZWFyZXItcnVsZXMtb24tb2Zmc2V0dGluZ9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wOC8xMS9DYXJib24tbWFya2V0LWdpdmVzLWNsZWFyZXItcnVsZXMtb24tb2Zmc2V0dGluZ9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wOC8xMS9DYXJib24tbWFya2V0LWdpdmVzLWNsZWFyZXItcnVsZXMtb24tb2Zmc2V0dGluZ9IBAA","guidislink":false,"published":"Mon, 14 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=226, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wOC8xMS9DYXJib24tbWFya2V0LWdpdmVzLWNsZWFyZXItcnVsZXMtb24tb2Zmc2V0dGluZ9IBAA?oc=5\" target=\"_blank\">Carbon market gives clearer rules on offsetting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Carbon market gives clearer rules on offsetting - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wOC8xMS9DYXJib24tbWFya2V0LWdpdmVzLWNsZWFyZXItcnVsZXMtb24tb2Zmc2V0dGluZ9IBAA?oc=5\" target=\"_blank\">Carbon market gives clearer rules on offsetting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Net zero or carbon neutral? It’s confusing. But both require companies, although by different extents, to use carbon offsetting to compensate for emissions they cannot remove within their own operations. Carbon markets, however, have often faced criticism for their lack of transparency, accessibility and quality. That’s lead to a backlash of sorts from big names in the food industry. “We are moving away from investing in carbon offsets for our brands to invest in programmes and practices that help reduce GHG emissions in our own supply-chain and operations, where it makes the most difference to reach our net zero ambition,”​ Nestlé told FoodNavigator. The FMCG giant plans to halve its greenhouse gas (GHG) emissions by 2030 and to achieve net zero by 2050. “Our net zero roadmap does not rely on offsets,” ​it continued. “We focus on GHG emissions reductions and removals within our value chain to reach our net zero ambition.”​ Fast food chain Leon – whose co-founder is on a mission to lead the ‘broken’ food system​ into the hinterlands of environmental sustainability – will also phase out marketing claims for its ‘carbon neutral burgers’. Regulators in the UK and EU too have recently announced plans to scrutinise and police​ such claims more closely. The voluntary carbon market, therefore, wants to spread the message that carbon offsets remain a key part of the race to zero. The Integrity Council for the Voluntary Carbon Market (ICVCM), an independent governance body for the voluntary carbon market, recently released its full global benchmark for carbon offset projects. Essentially this is a list of quality standards to help suppliers choose ‘good’ carbon credits. The standards were drawn up after a 60-day consultation period with hundreds of organizations throughout the voluntary carbon market and advice from scientific and carbon-crediting experts – all in the hope of driving up standards amid intense scrutiny of the industry. “The past year has seen a number of companies withdraw from earlier commitments to purchase carbon credits as concerns mounted over the quality of credits on the market,”​ an ICVCM spokesperson told FoodNavigator. The problem is not so much that there are no good credits out there, but rather that it is very hard for buyers to distinguish the good from the bad, the ICVCM explained. The market is made up of bilateral transactions, with little standardisation and no central exchange. This means that buyers must carry out extensive due diligence in-house and some have found that, even with their best efforts, the credits they purchased later turned out to be of lower quality than they thought. “This has reduced confidence and purchases, which ultimately means less finance for projects to reduce and remove carbon emissions,” ​the spokesperson told us. The ICVCM hopes to address this problem by assessing carbon credit projects and categories of carbon credits against a range of important criteria, from emissions impact to programme governance and sustainable development impacts. This will allow credits which pass ICVCM’s assessment to use the Core Carbon Principles (CCP) label. This certification aims to provide an independent mark of quality assurance, allowing buyers to easily identify high quality credits, no matter which sector, country or programme issued them. “It is expected that this will give buyers greater confidence and drive up both purchases and prices for high quality credits, increasing finance for impactful projects and providing incentives for developers to improve standards,” ​the spokesperson added. Clearer rules of the road​ ICVCM’s label has the support of other players in the voluntary carbon market as the industry ramps up its collaboration efforts in an attempt to help deliver a more standardised voluntary carbon market. The Voluntary Carbon Markets Integrity Initiative (VCMI), for example, also recently unveiled a code of practice after a year-long consultation with multiple stakeholders. While the ICVCM helps suppliers release ‘good’ carbon credits, the VCMI helps companies make credible environmental claims based on their use of carbon credits. The VCMI recommends that businesses purchase high-quality credits from the ICVCM. The VCMI’s Claims Code, meanwhile, is supported by a host of groups including the ICVMC, the Greenhouse Gas Protocol; the Carbon Disclosure Project; the International Emissions Trading Association (EITA); and the Science Based Targets Initiative (SBTi), which helps businesses reduce emissions in line with the Paris Agreement goals. Companies are shying away from carbon credits because of fears of greenwashing, it has been warned. Image: Getty\/suedhang Annette Nazareth, Chair of the ICVCM, explained what the collaboration between the groups hopes to achieve. “VCMI’s guidance on credible claims complements the Integrity Council’s work to establish a global benchmark for high-integrity carbon credits that will give buyers confidence they are funding projects making a genuine impact on emissions,” ​she said. “By creating end-to-end high integrity throughout the voluntary carbon market, from the supply of credits, to the markets they trade in, and ultimately how they are used, we can unlock investment at speed and scale for climate solutions that would not otherwise be viable.”​ The VCMI’s Claims Code hopes to give companies a rulebook to follow for making credible climate claims, helping to build market confidence in how they engage with voluntary carbon markets. “Without clear high integrity rules for both aspects, voluntary carbon markets will rightly continue to be viewed with suspicion, companies will be afraid to invest, and their potential will be lost,”​ it states. Rachel Kyte, Co-Chair of VCMI’s Steering Committee, added: “Voluntary carbon markets bring considerable benefits as part of companies’ net-zero transition and as a means of financing climate transition worldwide. Against a backdrop of recent criticism, we are now at a juncture where only consistent, well-considered global guidance can underpin a high-quality market and stimulate the rapid scaling of corporate use we need. The Claims Code will give greater confidence and develop trust in those who use it. If you build integrity, trust will follow, and trust is the foundation of a high value, high impact market.”​ Use carbon credits as ‘a contribution to global climate change mitigation efforts’​ The crux of the advice is that businesses should follow a ‘climate contribution’ approach, where “carbon credits are not counted towards, nor represent compensation for, a company’s remaining value chain emissions”.​ In other words, use them to contribute to climate mitigation not to make claims you have cancelled, counterbalanced or netted out emissions. This means we can expect to see more pushback against the ‘carbon neutral’ claim, a spokesperson from the SBTi told FoodNavigator. Historically, this has been the most widely used ‘achievement’ claim among businesses relating to their BVCM or ‘Beyond value chain mitigation’​ efforts, where companies would typically purchase a volume of carbon credits equivalent to their unabated scope 1–3 emissions. But there are several perspectives on when or if the term ‘carbon neutral’ can be used credibly, the spokesperson explained. One view is that when companies purchase carbon credits in an amount equal to their remaining emissions, the ‘carbon neutral’ claim can facilitate increased BVCM. Another view is that it conceals or downplays the remaining climate impact of businesses that have not fully decarbonized, and hence should not be used at all. Because there are different meanings that can be attributed to the term, ‘carbon neutral’ therefore “may not be the most effective claim for leading companies to make to differentiate their climate mitigation actions from companies that are not decarbonizing in line with science.”​ Firms ‘scared to be seen greenwashing’ ​ Thanks to this kind of confusion “we are seeing that companies aren’t investing [in carbon credits] because of fears of greenwashing accusations​,” added Scarlett Benson, Beyond Value Chain Mitigation Lead at the SBTi. Speaking during a recent roundtable webinar event, where representatives from different voluntary carbon groups discussed the current perceptions of carbon credits, she added that the new industry frameworks will remove big barriers for companies and ultimately allow the idea of reducing the intensity of emissions to take a greater hold. “We are still pretty early on in the journey of taking on responsibility for unabated emissions as being the new bar for climate leadership,”​ she said. “I think we will see this market growing significantly in coming years.”​ Lydia Sheldrake, Director of Policy and Partnerships at the VCMI, added: “Transparency is central… we have a scenario of companies greenhushing for fear of being accused of greenwash.”​ Greenhushing – where companies believe it is safer to simply not disclose details of the climate target – is “absolutely not”​ where we need to be, she stressed. “We need urgent action now. Clear frameworks which show what legitimate action looks like are important incentives.”​ Teresa Hartman, director of the Voluntary Carbon Market Foundation IETA, agreed. “The big barrier to action right now is that it’s so controversial to use a credit. What we are trying to say is that carbon markets are a really important piece of the puzzle to get to 1.5 degrees.”​","filter_flag":1}
{"title":"Two Direct-Air Carbon Removal Projects Set for $1.1B DOE Push - Engineering News-Record","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTY5MzktdHdvLWRpcmVjdC1haXItY2FyYm9uLXJlbW92YWwtcHJvamVjdHMtc2V0LWZvci0xMWItZG9lLXB1c2jSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTY5MzktdHdvLWRpcmVjdC1haXItY2FyYm9uLXJlbW92YWwtcHJvamVjdHMtc2V0LWZvci0xMWItZG9lLXB1c2jSAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTY5MzktdHdvLWRpcmVjdC1haXItY2FyYm9uLXJlbW92YWwtcHJvamVjdHMtc2V0LWZvci0xMWItZG9lLXB1c2jSAQA","guidislink":false,"published":"Sun, 13 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=225, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTY5MzktdHdvLWRpcmVjdC1haXItY2FyYm9uLXJlbW92YWwtcHJvamVjdHMtc2V0LWZvci0xMWItZG9lLXB1c2jSAQA?oc=5\" target=\"_blank\">Two Direct-Air Carbon Removal Projects Set for $1.1B DOE Push<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Engineering News-Record<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Two Direct-Air Carbon Removal Projects Set for $1.1B DOE Push - Engineering News-Record","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTY5MzktdHdvLWRpcmVjdC1haXItY2FyYm9uLXJlbW92YWwtcHJvamVjdHMtc2V0LWZvci0xMWItZG9lLXB1c2jSAQA?oc=5\" target=\"_blank\">Two Direct-Air Carbon Removal Projects Set for $1.1B DOE Push<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Engineering News-Record<\/font>","source.href":"https:\/\/www.enr.com","source.title":"Engineering News-Record","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Two commercial-scale direct-air carbon removal demonstration hubs on the Gulf Coast—set to be the largest in the world—could split about $1.1 billion in federal funding for development, the U.S. Energy Dept. said as it seeks to scale up a new domestic industry to scour carbon emissions from the atmosphere. Set to negotiate DOE funding awards are Occidental Petroleum Corp., which is set to build the planned South Texas DAC project near Corpus Christi, Texas, using a technology to intake carbon dioxide and chemically treat it for geologic site storage or for reuse into other products; and non-profit R&D firm Battelle, which would develop Project Cypress in Calcasieu Parish, La., to rely on Gulf Coast sequestration for offtake and permanent CO2 storage in a deep saline aquifer. It was not clear from the agency's Aug. 11 briefing where the projects are in obtaining permits from the US Environmental Protection Agency and other agencies for the plants and underground storage facilities. The DAC process is different from carbon-capture technology. which prevents emissions from a power plant or factory from entering the atmosphere. Occidental and Batelle claim their facilities would be the world’s first designed to remove up to 1 million metric tons of CO2 per year—which DOE said is more than 250 times the capacity of the largest operating DAC facility. It added that reaching a net-zero emissions economy will require annual removals by 2050 of 400 million to 1.8 billion metric tons of CO2 from the atmosphere and from emissions sources. The projects set for investment are among 11 proposals submitted to DOE to obtain DAC funding from $3.5 billion earmarked in the 2021 Infrastructure Investment and Jobs Act to support construction of four U.S. hubs to develop the technology. Two must be in economically distressed communities in fossil fuel producing regions—as the first selected projects are, both located in industrial areas of Louisiana and Texas that are gaining liquefied natural gas export-related development. The projects, estimating combined employment of about 5,000, seek to hire displaced fossil fuel sector workers. DOE and project team executives will hold in-person community briefings in the plant areas next month. Both projects would be powered by clean energy sources, DOE and company officials said, with the Occidental plant using solar power from an undisclosed source and Battelle buying clean power from a local utility, and eventually building its own source. The latter did not specify the type of clean power it will use. 'Serious Headway' \"If we deploy this at scale, this technology can help us make serious headway toward our net zero emissions goals,\" while government funding is still focused on more clean energy deployment, Energy Secretary Jennifer Granholm told the briefing. The federal funding for each project, matched by the private partner, will support concept, design, construction and operation. Funding for the other two projects will be made next year or soon after, Kelly Cummins, deputy director of DOE’s Office of Clean Energy Demonstrations, said at the briefing. The projects seek to “capture all the lessons learned from demonstration projects in the past, and incorporate them into oversight of this project,” she told the New York Times. “We’re only approving one phase at a time, with a rigorous ‘go, no-go’ procedure. If any phase doesn’t work, it will be ‘no-go.’” Cummins and company executives said the DOE-funded projects will not use captured CO2 for enhanced fossil fuel recovery, but agency officials have said previously that they are \"encouraging projects to have revenue streams that will help support the takeoff of this commercial technology.\" Occidental has said it could fund its planned overall DAC program with revenue from new products such as cleaner aviation fuel or \"net-zero oil\" developed through its treatment process, or from removal credits for carbon stored underground that are sold to other generators. The Inflation Reduction Act enables companies that capture and permanently contain atmospheric CO2 to seek a $180 tax credit per metric ton. Credits, available when plant operation starts, can be obtained for a 12-year period under the law. It also offers incentives to companies that capture and sequester CO2 at industrial plants. The production cost now is about $500 per ton or more, companies say. Occidental Aims to 'Advance Commercialization' Occidental CEO Vicki Hollub said the South Texas DAC Hub “will advance commercialization of direct air capture and storage … that verifiably removes carbon dioxide from the earth’s atmosphere.” Company subsidiary 1PointFive will work to commercialize technology of team member Carbon Engineering Inc. The energy giant said Aug. 15 it agreed to pay $1.1 billion to acquire Squamish, B.C.-based Carbon Engineering, which has worked with the 1PointFive unit since 2019, to deploy the DAC technology \"in the most capital efficient and valuable way,\" said Hollub. Australia-based Worley is providing engineering, procurement, and construction services. Detailed engineering and early site construction began last year, with completion set for 2024. Hollub said the firm and Carbon Engineering \"share our vision in creating a carbon removal industry that can accelerate the path to net zero.” The plant is set to initially capture up to 500,000 metric tons of CO2 per year and scale up to 1 million metric tons. Occidental has leased 106,000 acres in Kleberg County to support up to 30 DAC and sequestration plants, each also 1-million tpy, said Hollub. 1PointFive has said it seeks to deploy 70 DAC facilities globally by 2035, assuming current market conditions. Occidental previously said it began construction last year on its first DAC facility in Ector County, Texas, with a 500,000-tpy capacity, which will be used for enhanced oil recovery. The energy giant also announced earlier this month an agreement with Abu Dhabi National Oil Co. to develop one or more 1-million-tpy DAC plants in the UAE, which would be first of that size outside the U.S. The country said last month if would accelerate by five years to 2045 a net-zero carbon emissions goal and targets 2030 to be net-zero in methane emissions. The state-owned oil company also finished drilling last month a CO2 injection well it claims is the world’s first to be fully sequestered, also announcing what it says is a $15-billion company decarbonization plan. The well will store CO2 captured from ammonia producer Fertiglobe’s UAE operations “safely and permanently underground,” the oil firm said, aiming to eventually capture 5 million tpy by 2030 even as it expands fossil-fuel energy production. The efforts come as Dubai is set to host the two-week COP28 global climate change conference starting Nov. 30, with oil company CEO Sultan Ahmed Al Jaber named president-designate of the event. Battelle Team Has DAC History Battelle's Project Cypress will store captured CO2 at geologic storage areas owned by Gulf Coast Sequestration, CEO Lou Von Thaer said at the DOE briefing. Project partner Climeworks now operates the world's current largest operating DAC plant and storage site, an Iceland facility that now captures 4,000 tons of CO2 per year. Climeworks also is involved with two U.S. regional DAC hub proposals. Another project partner, Heirloom, which said it builds low-cost DAC technology that removes CO2 at a large scale by rapidly accelerating the ability of minerals to absorb it from the air, runs North America’s only operating removal facility, located in Brisbane, Calif., which was the first to embed CO2 permanently in concrete earlier this year. “This is an important step ... and shows the promise of DAC technologies combined with smart, permanent methods of sequestration,” said Heirloom CEO Shashank Samala.. According to Battelle, the new project is set to reach the 1-million-tpy removal target by 2029, depending on permits received and \"long lead-time item schedules.\" DOE Regional Hub Funding Shared DOE also said Aug. 11 that it chose 19 projects to negotiate award of funds totaling up to $100 million to support feasibility studies and design for regional DAC hubs, with sector firms Chevron New Energies, GE Research and Siemens Energy Inc., and academic institutions such as Northwestern University, Arizona State University and the University of Kentucky among recipients. Black & Veatch is a partner in the Arizona State project, which seeks $11.6 million, while Fluor Corp. and INTERA are supporting one in Wyoming that could win a $12.5-million award, and AECOM is aligned with a 40-member group based in California. DOE also said Aug. 10 it seeks bids for a $60-million award for smaller DAC facilities that can remove between 1,000 and 5,000 tons of carbon per year—with the agency also announcing a planned $35-million carbon purchasing program—the world's first such initiative that is government led. But some market observers are skeptical of what the big federal push will achieve. “Direct air capture is no miracle cure. It requires large amounts of energy, spurring more demand for the same fossil fuels that caused the climate crisis,\" said John Fleming, senior scientist at the Center for Biological Diversity’s Climate Law Institute, in a statement. \"Even if those problems can be solved, it’s years away from being deployed at scale.” Noting the two DAC projects set to win the largest DOE investment as \"trailblazers,\" Mitch Landrieu, a former New Orleans mayor who now is a White House senior advisor and its infrastructure law coordinator, said the U.S. is positioning itself as a leader in this technology. \"This is the first major federal investment from any country on carbon removal at this level,\" Erin Burns, director of carbon removal for non-profit advocate Carbon180, told Reuters, \"The U.S. is making a very large bet on this technology.\"","filter_flag":1}
{"title":"Paving An Intentional Road To A Sustainable IT Future - The Next Platform","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lm5leHRwbGF0Zm9ybS5jb20vMjAyMy8wOC8wNy9wYXZpbmctYW4taW50ZW50aW9uYWwtcm9hZC10by1hLXN1c3RhaW5hYmxlLWl0LWZ1dHVyZS_SAWJodHRwczovL3d3dy5uZXh0cGxhdGZvcm0uY29tLzIwMjMvMDgvMDcvcGF2aW5nLWFuLWludGVudGlvbmFsLXJvYWQtdG8tYS1zdXN0YWluYWJsZS1pdC1mdXR1cmUvYW1wLw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lm5leHRwbGF0Zm9ybS5jb20vMjAyMy8wOC8wNy9wYXZpbmctYW4taW50ZW50aW9uYWwtcm9hZC10by1hLXN1c3RhaW5hYmxlLWl0LWZ1dHVyZS_SAWJodHRwczovL3d3dy5uZXh0cGxhdGZvcm0uY29tLzIwMjMvMDgvMDcvcGF2aW5nLWFuLWludGVudGlvbmFsLXJvYWQtdG8tYS1zdXN0YWluYWJsZS1pdC1mdXR1cmUvYW1wLw?oc=5","id":"CBMiXmh0dHBzOi8vd3d3Lm5leHRwbGF0Zm9ybS5jb20vMjAyMy8wOC8wNy9wYXZpbmctYW4taW50ZW50aW9uYWwtcm9hZC10by1hLXN1c3RhaW5hYmxlLWl0LWZ1dHVyZS_SAWJodHRwczovL3d3dy5uZXh0cGxhdGZvcm0uY29tLzIwMjMvMDgvMDcvcGF2aW5nLWFuLWludGVudGlvbmFsLXJvYWQtdG8tYS1zdXN0YWluYWJsZS1pdC1mdXR1cmUvYW1wLw","guidislink":false,"published":"Mon, 07 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=219, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lm5leHRwbGF0Zm9ybS5jb20vMjAyMy8wOC8wNy9wYXZpbmctYW4taW50ZW50aW9uYWwtcm9hZC10by1hLXN1c3RhaW5hYmxlLWl0LWZ1dHVyZS_SAWJodHRwczovL3d3dy5uZXh0cGxhdGZvcm0uY29tLzIwMjMvMDgvMDcvcGF2aW5nLWFuLWludGVudGlvbmFsLXJvYWQtdG8tYS1zdXN0YWluYWJsZS1pdC1mdXR1cmUvYW1wLw?oc=5\" target=\"_blank\">Paving An Intentional Road To A Sustainable IT Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Next Platform<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Paving An Intentional Road To A Sustainable IT Future - The Next Platform","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3Lm5leHRwbGF0Zm9ybS5jb20vMjAyMy8wOC8wNy9wYXZpbmctYW4taW50ZW50aW9uYWwtcm9hZC10by1hLXN1c3RhaW5hYmxlLWl0LWZ1dHVyZS_SAWJodHRwczovL3d3dy5uZXh0cGxhdGZvcm0uY29tLzIwMjMvMDgvMDcvcGF2aW5nLWFuLWludGVudGlvbmFsLXJvYWQtdG8tYS1zdXN0YWluYWJsZS1pdC1mdXR1cmUvYW1wLw?oc=5\" target=\"_blank\">Paving An Intentional Road To A Sustainable IT Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Next Platform<\/font>","source.href":"https:\/\/www.nextplatform.com","source.title":"The Next Platform","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Sponsored Feature: Meeting organizational sustainability requirements depends on so much more than optimizing electricity consumption and reducing an enterprise’s carbon footprint. It involves taking a long hard look at the way that operations impact not just the environment, but also the economy and even society itself. From an IT perspective, that makes it essential to be sure that old systems and components are either recycled, refurbished or disposed of in an environmentally friendly manner. But that’s an end-to-end process that can be long, complex and difficult to manage. Each year a total of 53.6 million metric tons of metal in e-waste is discarded across the globe, according to the Global E-waste Monitor report. That’s a staggering number to grasp, roughly equivalent to forty-five hundred Eiffel Towers. Yes, the 984 foot high, 7,300 ton landmark in the middle of Paris. Imagine 4,500 of them, every 12 months. Help On Disposal Is At Hand That’s a considerable mass of metal, plastic and other material that cannot be easily dissolved and has to exist elsewhere after its business use ends. This colossal amount of e-waste grows larger every year by 5 to 8 percent, and it joins a myriad of other global recycling problems as the world’s population scrambles to clean up the mess it has made for itself over generations. Enterprises can obtain plenty of help and guidance from organizations such as The Recycling Partnership, Global Recycling Network, Clean Production Action and Zero Waste International Alliance, which have urged companies to establish their own personal recycling strategies with rules set by top management. Every use case is different; the importance of this, scaled worldwide, cannot be minimized. What would happen if we could give e-waste a second life, instead of dumping it into landfills or allowing it to take up valuable space in storage units? The answer: Only good things. Recycling or refurbishing older IT hardware so it continues to do the job is a good PR look for a company. In its 2021 ESG Consumer Intelligence Series report, PwC estimated that 83 percent of consumers think businesses should actively follow federal environmental, social and governance (ESG) investment best practices. CFOs know that investments in reconstituting legacy equipment and\/or purchasing rebuilt items can save companies a substantial amount of money over time. Ideally, this circular economy leverages existing resources and puts them back into the supply chain instead of using them once (or for a short time) and discarding them. Supporting an intentional reuse blueprint like this can help enterprises make a significantly positive impact on the environment, not to mention on customers and corporate partners. On the public safety side, various government regulators – armed with increasingly stringent regulations – stand ready to penalize those who choose to shrug off these national and regional laws. Institute Sustainable Business Strategies Companies should start by instituting high-level strategies for creating sustainable business models that result in hardware reuse and\/or recycling, believes Lenovo. These could include: Start with your values. What is important to you and your company? What do you want to achieve? Once you have a clear understanding of your values, you can start to develop a business model that aligns with them. Be customer-centric. Sustainable business models are often built around the needs of the customer. By understanding what your customers want and need, you can create a business model that is both sustainable and profitable. Be innovative. There are many new and innovative ways to create sustainable business models. Don’t be afraid to think outside the box and come up with new ideas. Be collaborative. Building a sustainable business is not something that can be done alone. You need to collaborate with your employees, suppliers, customers, and other stakeholders. By working together, you can create a more sustainable future for your business and the world. Be environmentally aware. Each company must examine itself closely and go deep into sustainability detail. For example, the list should include the recycling of all materials used in the day-to-day operation of the business. This includes everything from paper goods to cleaning solutions to electronic equipment. This is where e-waste becomes a key factor in a company’s sustainability planning. IT Hardware Life Cycles Are Getting Shorter For businesses that want to stay competitive, e-waste is an unfortunate fact of life when adopting the latest technology to keep up with the world’s fast-changing markets. IT hardware cycles are getting shorter (cell phones last an average of 2.58 years, a server about three to five years), and as the technology becomes faster and more capable of handling larger data loads, enterprises upgrade and\/or replace older hardware more frequently in order to keep up with competitors. The result: a continuous stream of e-waste, for which many organizations need outside help. Lenovo has been a leader in recycling IT hardware. Since 2005, the company has processed about 324,811 metric tons of computer equipment. In 2021, Lenovo managed the processing of 34,163 metric tons of company-owned and customer-returned computer equipment. Of this total, 5.5 percent was reused as products or parts and 88.2 percent recycled as materials. “The conversation about sustainability begins in the sales cycle. As we’re having conversations about new hardware sales, we are not only discussing carbon offset credits that Lenovo can offer, but we are also talking to customers about what they will do with their old hardware, when their new hardware arrives”, says Ann Amini, Lenovo’s executive director for Asset Recovery Services. “Through our ARS offering we can help customers sustainably and securely disposition their old, decommissioned hardware.” IT decision makers are also increasingly concerned about the energy usage of older, less efficient data center hardware. Lenovo can help with the transition to newer, more efficient hardware platforms, such as Lenovo “Neptune” liquid cooling technology. This upgrade can be the catalyst to returning any potential value from the old hardware to the customer via Asset Recovery Service, resulting in saving money on both the new hardware purchase and the reduced energy cost and carbon emissions, says the company. For IT equipment that cannot be repaired and resold in secondary markets, Lenovo ARS facilitates the evaluation of parts and components for potential recycling. Any components that can be recycled go back into circulation to be used in the manufacture of new products for a more sustainable industry, Amini says. The team specializes in offering customers choices, such as determining a strategy for re-use and recycling, selecting partners with whom to collaborate, and choosing how to undertake environmental or data security risks. “From a Lenovo ARS perspective, we are vendor agnostic. Our intent is to simplify the complex process of dispositioning obsolete hardware. We do this by providing customers with a Lenovo focal point to help them manage the entire ARS process from end to end, and this is included in the base ARS offering” Amini says. “We form partnerships with our customers and want to instill a sense of ‘peace of mind’. When working with Lenovo as an ARS provider, customers can be assured, that not only will their hardware be sustainability dispositioned, but we will also ensure that data baring devices are handled appropriately either through data sanitization or drive destruction processes. In either scenario, proof of data sanitization or destructions are always provided.” Customization Options Not On The Menu Lenovo ARS provides other customization options in its tailor-made service packages, depending upon the specific requirements of the customer. “We’ve had customers who want to upgrade a server but aren’t ready to dispose of their old hardware,” adds Amini. “Instead they may want some help to refurbish and redeploy the hardware to other areas of their organization, or may want some help refurbishing and donating the hardware to their favorite charitable organization. Either way, these are customization options that we can size for our customers, if they have requirements beyond the base ARS offering.” It’s all dependent on what the customer is looking for: “They will come to us, they’ll tell us what they need, and we’ll size it for them. And then we’ll see if we can help them out with whatever challenges they have as it relates to recovery services.” Lenovo ARS also monitors updates in local, national and international rules and regulations regarding disposal of legacy IT hardware so its customers don’t have to do it. For enterprises that want to “set it and forget it” when it comes to sustainability via recycling and refurbishing legacy IT equipment, engaging a partner such as Lenovo ARS can be a sustainable solution for taking a huge load off an IT exec’s mind. Sponsored by Lenovo.","filter_flag":1}
