{"title":"The Best Rain Barrels of 2024","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.popularmechanics.com%2fscience%2fenvironment%2fg60981003%2fbest-rain-barrels%2f&c=14017911254908642421&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.popularmechanics.com%2fscience%2fenvironment%2fg60981003%2fbest-rain-barrels%2f&c=14017911254908642421&mkt=en-us","summary":"Collecting rainwater is legal and even encouraged in many places as a sustainable water conservation method. However, some regions have regulations governing rainwater collection due to concerns about ...","published":"Tue, 11 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=11, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=163, tm_isdst=0)","news_source":"Popular Mechanics","news_image":"http:\/\/www.bing.com\/th?id=OVFT.Qm4s1PGNJclwdCtbAO5R6S&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":350.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Best Rain Barrels of 2024","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Collecting rainwater is legal and even encouraged in many places as a sustainable water conservation method. However, some regions have regulations governing rainwater collection due to concerns about ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Water Conservation\" \"new products\"&format=rss","text":"Gear-obsessed editors choose every product we review. We may earn commission if you buy from a link. Why Trust Us? You can’t always count on Mother Nature to fix your dry, patchy lawn or wilted garden. Perhaps the easiest way to conserve and store water for a non-rainy day is with a rain barrel specifically designed for that very purpose. These reservoirs are placed underneath your gutter’s downspout to collect runoff from your roof to use for irrigation and outdoor cleaning tasks, like washing down patio furniture or rinsing tools. Most rain barrels are made of all-weather plastic and have a spigot or a water hose connection, along with a screen at the collection point to prevent leaves and other debris from falling inside. They also come in multiple sizes, with 40 or 50 gallons offering plenty of capacity for the average homeowner. In terms of price, you can expect to pay $200 or less for a 50-gallon model. This buying guide covers expert tips to consider before purchasing a rain barrel, along with reviews of the best rain barrels we recommend. Following our reviews, we’ve also included rain barrel FAQs and tips to help you maintain your rain barrel year-round. The Best Rain Barrels Best Overall: Best Value: Best for Gardens: What to Consider Capacity When selecting a rainwater collection barrel, assess your water needs and usage patterns. Consider the size of your garden, frequency of watering, and any other purposes for which you intend to use collected rainwater, such as cleaning or irrigation. This helps determine the appropriate barrel capacity to meet your requirements without overflow or frequent refilling. Also take into account the average rainfall in your area. A larger capacity barrel is advisable for regions with higher rainfall or prolonged dry spells between rain events, ensuring a sufficient supply during periods of scarcity. The size of your roof is another thing to factor in, particularly if you live in a wet climate. Larger capacity barrels may be heavier and more challenging to maneuver, requiring additional support structures and careful placement. Penny Crispin from the Snohomish Conservation District says sizes can vary drastically to fit individual needs. “Some barrels are as small as 25 gallons, and others can hold over 100 gallons.” On average, most people will do fine with 40 or 50 gallons of capacity. Materials Most rain barrels, including PVC, polyethylene, and polyethylene resin varieties, are crafted from high-density plastic. This material is favored for its resistance to rot and rust, lightweight nature, and affordability, making it the most popular choice for its ease of cleaning and transportation. However, remember that plastic may degrade when exposed to sunlight, potentially affecting longevity. Stone and clay rain barrels offer more than just aesthetic appeal; their natural properties make them ideal for rainwater collection. While they may capture smaller amounts of rainwater than other materials, their durability and insulation qualities ensure water stays cool and protected from sunlight, preventing algae growth. Their porous nature allows gradual water percolation into the soil, promoting better hydration for plants. Wooden barrels offer a rustic look and blend well with garden surroundings. However, wood requires regular maintenance to prevent rot and decay, making it less practical for long-term use without proper care. Features Depending on the intended use of the rain barrel, there may be features to look out for while shopping. Standard features for rain barrels include spigots or taps for easy access to water, overflow spouts, and screen filters that are placed over intake openings to precent debris, leaves, and insects from entering the barrel. Most rain barrels also have child safety locks and some offer linking systems to connect multiple barrels for more capacity. State and Local Restrictions Lastly, consider regulatory restrictions or incentives related to rainwater harvesting in your area. According to Crispin, rainwater collection is regulated in some states due to issues such as water rights, the reduction of downstream water, and natural infiltration when rainwater is harvested. On the other hand, some states encourage and even provide incentives for installing rain collection systems. Check with your state regulations and programs before you install rainwater collection. How We Selected In selecting the best rain barrels, we focused on key criteria to ensure functionality, sustainability, and practicality. We prioritized rain barrels made from high-quality, UV-resistant materials capable of withstanding various weather conditions and models with ample capacity and efficient water distribution features, such as integrated spigots and overflow outlets. We also considered budget, aesthetic preferences, and ease of maintenance. To substantiate our recommendations, we consulted with an expert in rainwater collection and conservation, Penny Crispin, the Community Conservation Department Manager for the Snohomish Conservation District in Snohomish County, Washington State.","filter_flag":1}
{"title":"Veolia Water Technologies to expand in Wuxi, China with new intelligent factory","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.filtsep.com%2fcontent%2fnews%2fveolia-water-technologies-to-expand-in-wuxi-china-with-new-intelligent-factory&c=8471165430115910340&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.filtsep.com%2fcontent%2fnews%2fveolia-water-technologies-to-expand-in-wuxi-china-with-new-intelligent-factory&c=8471165430115910340&mkt=en-us","summary":"Veolia Water Technologies & Solutions has signed an agreement to significantly expand its operations in Wuxi, China and partner with the Administrative Committee of Wuxi National High-Tech Industrial ...","published":"Wed, 12 Jun 2024 06:49:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=12, tm_hour=6, tm_min=49, tm_sec=0, tm_wday=2, tm_yday=164, tm_isdst=0)","news_source":"Filtration + Separation","news_image":"http:\/\/www.bing.com\/th?id=OVFT.TAH7NIK2ARkxHyWbxtDisy&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":441.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Veolia Water Technologies to expand in Wuxi, China with new intelligent factory","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Veolia Water Technologies & Solutions has signed an agreement to significantly expand its operations in Wuxi, China and partner with the Administrative Committee of Wuxi National High-Tech Industrial ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Water Conservation\" \"new products\"&format=rss","text":"Veolia Water Technologies & Solutions has signed an agreement to significantly expand its operations in Wuxi, China and partner with the Administrative Committee of Wuxi National High-Tech Industrial Development Zone (WND). Under the agreement, Veolia plans to expand its current production capacity in Wuxi and introduce new products to build energy-saving and environmentally friendly clean production lines. The company will transform its Wuxi site into a base of R&D and product assembly in China. The expansion is part of Veolia’s newly launched GreenUp program aimed at accelerating the deployment of solutions that decarbonize, depollute, and regenerate resources. To achieve this new strategy program, Veolia is relying on a combination of its core businesses with growth boosters such as Water Technologies and new solutions to preserve water resources and treat new pollutants. “China represents an important market for Veolia as we execute our GreenUp program to drive ecological transformation for partners and customers around the globe,” said Anne Le Guennec, senior executive VP, Veolia Water Technologies. “Our enhanced presence will allow us to be the catalyst for emissions reductions, water conservation, and pollution prevention in the region. Through this extended partnership and new innovation, our Wuxi expansion exemplifies our commitment to greening up and creating a more sustainable future.” Veolia’s Wuxi facility is the largest production base of Veolia Group in Asia Pacific region, as well as the only site with a complete water treatment product production line, from chemical reagents to equipment.","filter_flag":1}
{"title":"Vallarta Supermarkets Debuts New HQ","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fprogressivegrocer.com%2fvallarta-supermarkets-debuts-new-hq&c=6152021121390643583&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fprogressivegrocer.com%2fvallarta-supermarkets-debuts-new-hq&c=6152021121390643583&mkt=en-us","summary":"Vallarta Supermarkets' new facility, in Santa Clarita, Calif., was designed to support the Hispanic grocer’s commitment to innovation, collaboration and community engagement.","published":"Tue, 18 Jun 2024 05:27:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=18, tm_hour=5, tm_min=27, tm_sec=0, tm_wday=1, tm_yday=170, tm_isdst=0)","news_source":"ProgressiveGrocer","news_image":"http:\/\/www.bing.com\/th?id=OVFT.ck1lHNGDIJBws_kwLDk8li&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":655.0,"news_imagemaxheight":368.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vallarta Supermarkets Debuts New HQ","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Vallarta Supermarkets' new facility, in Santa Clarita, Calif., was designed to support the Hispanic grocer’s commitment to innovation, collaboration and community engagement.","query":"https:\/\/www.bing.com\/news\/search?q=\"Water Conservation\" \"new products\"&format=rss","text":"Vallarta Supermarkets' new facility, in Santa Clarita, Calif., was designed to support the Hispanic grocer’s commitment to innovation, collaboration and community engagement. Hispanic grocery retailer Vallarta Supermarkets recently held a grand-opening event for its new office headquarters in Santa Clarita, Calif. The new facility was designed to support Vallarta’s commitment to innovation, collaboration and community engagement. At the June 17 grand-opening celebration, the company gave donation checks to Santa Clarita Food Pantry and Santa Clarita Grocery. The 51,350-square-foot facility includes a double-height lobby reception space and three floors of office space with 78 offices, 166 workstations, collaboration and focus spaces, eight conference rooms, six focus booths, open lounge spaces, and communal gathering tables throughout the space. [RELATED: Giant Eagle Unveils New Headquarters in Pennsylvania] Among the site’s features and amenities are:","filter_flag":1}
{"title":"How Google is supporting the circular economy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.nature.com%2farticles%2fd42473-022-00399-1&c=1934620950812163367&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.nature.com%2farticles%2fd42473-022-00399-1&c=1934620950812163367&mkt=en-us","summary":"It also includes tips around water conservation, energy savings and ... Reduce the need for new products and materials by supporting longer product lifecycles, reuse programmes and recycling.","published":"Wed, 16 Nov 2022 06:13:00 GMT","published_parsed":"time.struct_time(tm_year=2022, tm_mon=11, tm_mday=16, tm_hour=6, tm_min=13, tm_sec=0, tm_wday=2, tm_yday=320, tm_isdst=0)","news_source":"Nature","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Google is supporting the circular economy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"It also includes tips around water conservation, energy savings and ... Reduce the need for new products and materials by supporting longer product lifecycles, reuse programmes and recycling.","query":"https:\/\/www.bing.com\/news\/search?q=\"Water Conservation\" \"new products\"&format=rss","text":"Figure 1. Zero-waste data centres. Google uses several circularity strategies at its globally owned and operated data centres, such as repairing components whenever possible to extend the life of servers. For the vast majority of Earth’s existence, our planet functioned as the quintessential circular system. The Sun’s energy nourished trees into life, and once they fell, microorganisms broke them down into soil and nutrients, fuelling the next generation of growth. The notion of ‘waste’ did not exist — everything had a use. It is only in the past few hundred years that humans have interrupted this cycle. With the rise of the Industrial Age came a linear economy built around the consumption of natural resources. Energy was turned into goods and products that we used — and then threw away. This sliver of Earth’s history improved the lives of billions of people, but it came at a tremendous cost to the planet’s future. At our current pace, humanity needs 1.75 Earths to sustain our consumption of natural resources. We have been running a resource deficit since the 1970s that accelerates every year according to the Global Footprint Network, and by 2050, humanity will generate 3.5 Gt of solid waste annually1. To protect our planet while continuing to improve lives, we need to decouple economic growth from the consumption and disposal of finite resources. That is the core premise of the circular economy, which aims to minimize waste and maximize reuse of existing materials. The circular economy also offers a critical pathway to mitigate climate change, because recycled and reused resources have lower carbon footprints. For example, improving the circulation and reuse of uncontaminated steel would avoid 500 Mt of new steel production by 2050, saving more than 1 billion tonnes of carbon emissions per year2. Fortunately, the opportunity is as vast as the need. By making the most of our finite resources, we can not only thrive within planetary boundaries, but we can also generate an estimated US$4.5 trillion3 in new economic output by 2030 and support efforts to achieve net-zero carbon emissions across the economy. Google is committed to accelerating the transition to a circular economy in which business creates environmental, economic and community value through the maximum reuse of finite resources. To help inspire others toward a similar goal, we are sharing some of the lessons we have learned from our circularity programme — and the challenges that remain. Our three circularity principles Since our founding, Google has made it a core value to operate our business in an environmentally sustainable way. In 2007, we became the first major company to be carbon neutral for our operations. As of 2022, our sustainability programme takes a comprehensive view across carbon, water, ecology and circularity. We aim to achieve net-zero emissions across all of our operations and value chain — including our consumer hardware products — by 2030, to replenish 120% of the water we consume by the same year, and to become a circular Google within this more sustainable world. Our approach to circularity is anchored around three core principles: 1. Design-out waste and pollution. This means designing for circularity from the start, enabling existing products to become future resources. 2. Keep products and materials in use. This means extending the effective life of products or materials as long as is safely possible, to make the most of all the resources that went into their creation. 3. Promote safe and healthy materials. This means designing products with materials that are safe for both people and the planet, recognizing that these materials will be used and reused long into the future. These foundations are embedded into all aspects of our business operations, from the data centres we operate to the campuses we build, the products we create, the suppliers we work with, and the culture we encourage. The following section describes some of the progress we have made in each of these areas. Figure 2. Circularity at Bay View and Charleston East. These new Google campuses feature many circularity strategies, such as incorporating salvaged materials to promote reuse and designing flexible spaces to reduce renovation waste. Zero-waste data centres Google owns and operates 23 global data centres filled with servers and other equipment that provide reliable service to the billions of people who use our products every day. Our circularity goal for these centres is to achieve ‘zero waste’, defined as minimizing waste generation and maximizing the reuse of products and materials as much as possible while diverting 90% or more of solid waste from landfills. As of 2022, seven of our 23 data centres have met this zero waste to landfill target and we are continuously making investments to advance waste diversion and recycling across our operations (Fig. 1). Additionally, since 2015, 32.6 million hardware components have been resold into the secondary market, and in 2021, 27% of upgrade components were from refurbished inventory4,5. Our approach to data-centre circularity starts with identifying the life-cycle stage of data-centre components. From there we apply several circularity strategies: • Maintain. Whenever possible, we repair components to extend the life of servers. • Refurbish. When a server or equipment is decommissioned, we create an inventory of usable, refurbished components that are stored for future reuse. • Reuse. Any excess components are resold on the secondary market, following a rigorous security process. • Recycle. Components that cannot be reused or resold are sent to an electronics waste-recycling partner. Proof point: European data centre in Denmark. One of our newest European data centres, located in the Danish town of Fredericia, achieved zero-waste to landfill from day one — and continues to make important progress. Site management is working with a waste partner to recycle additional material that is otherwise sent to waste-to-energy recovery. This has required close partnership with staff and our vendors to find innovative solutions for waste collection and separation. Circular campuses Google has offices in over 180 cities spanning nearly 60 countries. We take a holistic approach to circularity in our offices and campuses, which starts by designing buildings with healthy materials and continues with reducing food and plastic waste in our workspaces. Our three key areas of office circularity are: • Food waste. Our food programme aims to reduce waste through composting, donation and tracking use to right-size orders. We recently announced a goal of sending zero food waste to landfills — and cutting food waste in half for each Google employee — by 2025. We also use behavioural nudges that encourage Googlers to take only the food they will eat. For example, by reducing the depth of our cafeteria bowls by an inch, we found that Googlers took smaller portion sizes, which reduced leftover plate waste by 30–50% (ref. 6). • Plastics waste. We work to reduce single-use plastics and other plastic waste through a series of interventions, including procurement, operational changes and workspace design. These efforts include eliminating the purchase of single-use plastics wherever possible and making reusable drinking options (like our sustainable hydration stations) easy to use in our micro-kitchens. • Building and construction materials. In developing our office spaces, we promote circularity through a number of practices, including procuring salvaged and reused materials in construction projects, designing our facilities to enable zero-waste operations, and setting ambitious waste- diversion targets to keep material out of landfills. For example, since 2012, we have had a robust salvage programme, working with non-profits to find new homes for usable building components such as doors, plumbing fixtures and tiles. Proof point: Bay View and Charleston East campuses. Our new Bay View and Charleston East campuses mark significant steps forward for our circularity programme (Fig. 2). At both locations, we vetted thousands of building materials against the Living Building Challenge (LBC) Red List to eliminate ‘worst in class’ materials and chemicals with the goal of creating a safer, more circular environment. Both campuses incorporated salvaged materials into the building design, and both aim to reduce future renovation waste through highly flexible and reconfigurable work areas. At Charleston East, in particular, more than 22,000 imperial tons of construction waste had been diverted as of October 2021, and 530,000 pounds of drywall waste was recycled as part of a closed-loop wallboard initiative. With these efforts, Charleston East is set to be one of the largest projects ever to attain an LBC Materials Petal certification for healthy building materials. Product and hardware design Millions of people use Google products like Pixel, Nest, Home and Fitbit every day, making these products a circularity priority area. Our product circularity approach involves several strategies: • Using recycled materials. We are committed to using recycled or renewable content in at least 50% of plastic across the product portfolio by 2025, prioritizing recycled plastic wherever possible. For example, the Nest Audio enclosure — which is composed of fabric, housing, a foot and a few smaller parts — is made from 70% post-consumer recycled (PCR) plastic. Our materials scientists and design engineers developed a custom PCR plastic in partnership with our suppliers, and we work closely with them to expand the market for recycled materials, including those we develop specifically for our products. • Practicing circular design. We focus on material reuse and extending the useful life of our products as part of the fundamental design process. For example, we have a goal of making all packaging plastic- free and 100% recyclable by 2025. We also provide a number of repair options, such as making a full range of spare parts for Pixel 2 through Pixel 6 Pro products, including batteries, replacement displays and cameras, and we will provide at least five years of security updates for the Pixel 6 and Pixel 6 Pro, as well as future Pixel phones, from the date we start selling them on the US Google Store. Additionally, for Google Nest, we issue critical bug fixes and patches for at least five years after launch. • Eliminating waste. We are committed to achieving Underwriters Laboratory (UL) 2799 Zero Waste to Landfill certification at all final assembly manufacturing sites by 2022. We are also reducing packaging waste from our suppliers when they ship parts to our manufacturing sites. Additionally, for consumers, we are developing tools and programmes to help people properly recycle electronic goods. For example, we recently made it easier for people to find out where they can recycle or dispose of electronic goods using Google Maps and Search. And we continue to research and pilot new ways for customers to recycle e-waste, including through a doorstep- recycling pilot programme in Denver, Colorado. • Promoting safer chemistry. We strive to select materials to use in our products that have a chemical composition that is safe for both people and the planet — both now and far into the future. For example, we make our restricted substances specification publicly available while also aiming to use safer flame retardants and eliminate antimicrobials across all of our products by 2023. Figure 3. Recycled aluminium in hardware. Google developed a 100% recycled aluminium alloy, validated by a third-party certifier, to improve circularity in the Pixel phone. Proof point: recycled aluminium. As part of our work toward a more circular Google, we developed a 100% recycled aluminium alloy to meet our Google Pixel performance standards, validated by a third-party certifier (Fig. 3). The Pixel 5 was our first phone to incorporate this recycled aluminium, which not only eliminates the use of mined aluminium in the enclosure and reduces waste but also lowers the carbon footprint of manufacturing the enclosure by 35% (based on a third-party- verified life-cycle assessment) compared to using virgin aluminium. At the time of writing, the aluminium inside the back housing of the Pixel 5, 6 and 6 Pro is made with 100% recycled content. We also want other companies to benefit from our work and for other manufacturers to use this alloy in their products. That is why we require our suppliers to make this alloy available to manufacturers across the electronics industry. For more information about our sustainability claims, please visit https:\/\/store.google.com\/magazine\/sustainability. Enabling everyone Even as we work to build a more circular Google, we recognize that realizing a circular economy will take everyone’s participation. To support broader adoption of core circularity practices, we are building tools and partnerships that enable and empower others to reduce waste and reuse materials. A few notable efforts are as follows: • Enabling better recycling. We have now made it easier for people to find out where they can recycle electronics, batteries, glass bottles, clothing and other goods using Google Maps and Search. Local merchants and shops can show the recycling services they offer, and more people can find these options just by searching something like “battery recycling near me” (Fig. 4). People can also suggest edits to the available recycling options at a location, helping others in their community find the right place for them. • Helping officials cut plastic pollution. Every year, rivers carry millions of tonnes of plastic into oceans. We partnered with the United Nations Environment Programme (UNEP) to develop a new machine-learning model that shows a highly accurate view of plastic pollution, with a launch demo focused on the Mekong River in Thailand. This open-source model empowers local government to take action and scale new solutions. • Facilitating household circularity. We have empowered people to take action on circularity in their everyday lives with our interactive tool, Your Plan, Your Planet. The tool features lessons on extending the life of household goods, along with a teachers’ companion guide for schools. It also includes tips around water conservation, energy savings and more. Circularity’s role in climate change While the circular economy is critical from a global resource perspective, it is also essential to addressing climate change. Simply put, the world cannot achieve a net-zero carbon-emissions target without the circular economy. Global greenhouse gas emissions are expected to reach 51 Gt by 2050 (ref. 7). About 45% of that comes from ‘embodied’ emissions, or carbon generated from the production of new buildings, cars, clothing, food and other common goods or products. The circular economy has a key role in stopping the disposal of embodied carbon en route to a net-zero world. Every piece of waste represents a new product that will be created from scratch — and thus a missed opportunity to cut embodied emissions. We can seize that opportunity and cut up to 10 Gt of carbon by 2050 (ref. 7) through several circular strategies described in greater detail elsewhere in this article, including: • Deconstruction. Make better use of buildings through practices like deconstruction and reuse, low-carbon construction materials such as mass timber, and retrofitting or repurposing existing spaces. • Circular design. Reduce the need for new products and materials by supporting longer product lifecycles, reuse programmes and recycling. • Recycled materials. Use recycled materials to create new goods and products, as recycled resources generate significantly lower greenhouse-gas emissions than virgin resources during production. Emerging opportunities As we build on our progress in the years to come, we see a number of exciting areas with the potential to further accelerate the transition to a circular economy. Artifical intelligence Artificial intelligence (AI) is becoming a tool to help address challenges facing many industries, and waste is no exception. Recent estimates suggest that AI’s ability to design-out food waste can create US$127 billion in annual value by 2030, and its ability to improve consumer electronics is valued at US$90 billion a year8. Our 2019 white paper identified three primary ways that AI can support circularity: • Design circular products, components and materials. For example, AI can generate insights that help significantly shorten the design timeline of microchips, which reduces the total amount of materials needed for research and development. • Operate circular business models. For example, our food team, in collaboration with X, Alphabet’s moonshot factory, is using AI to speed up the food-inspection process, strengthening the supply chain and reducing waste. • Optimize circular infrastructure. For example, AI-powered computer vision can help industrial robots classify waste on assembly lines with very high accuracy, leading to better sorting at recycling facilities. Deconstruction and reuse Roughly 11% (ref. 9) of global emissions come from construction and the creation of new building materials — an impact that is locked-in forever and cannot be reduced through technological improvements. Commercial deconstruction and reuse practices can help address this impact by promoting the use of low-carbon materials and encouraging adaptation of commercial buildings. Our 2019 white paper identified the following areas of opportunity for deconstruction and reuse in office development: • Design and build for circularity. Development projects can prioritize healthy materials (including mass timber where feasible), design adaptable spaces that can change without needing extensive renovations, design for disassembly to avoid demolition waste, and create a deconstruction plan from the start. Regulation has an important role to play in supporting these practices. • Set-up salvage for success. Cities can support salvage practices by requiring salvage plans during the building permitting phase and otherwise incentivizing the practice. Buildings can develop salvage inventories from the start that can make it easier to reuse or save equipment and materials throughout the life of the space. • Scale and diversify the deconstruction workforce. Local jurisdictions can require ‘salvage-ready’ contractors for commercial projects and should support workforce training in deconstruction as a specific growth skill. • Strengthen the regional reuse marketplace. There are a number of ways to strengthen the reuse market and support the circular economy of commercial buildings, including setting salvage targets, embracing virtual salvage marketplaces, and requiring salvage during public project procurement. Electronic waste Electronic waste (e-waste) is one of the world’s fastest growing waste streams. In 2019, only 17% of e-waste was recycled globally, according to Statistica. The rest often ends up in landfills, is improperly disposed of in the environment, or ‘hibernates’ — the practice of keeping a product that is no longer in active or regular use — in our homes. This practice limits the ability to recycle usable materials and e-waste, meaning that more new resources must be consumed to create new products. In 2021, we conducted an assessment of why consumers engage in product hibernation instead of recycling and identified the following areas of opportunity10 (it should be noted that there are usually multiple factors in a decision to hibernate a product, and that the key factors differ by product, so pursuing all of these areas is critical to maximize electronic recycling): • Low handoff-option awareness or convenience. Consumers may lack information about proper recycling methods or facilities or find that option inconvenient. Google is working to address this problem through Maps and Search programmes (described earlier) that help identify and access local e-waste recycling options. • Compensation expectations (financial or social). Consumers often expect compensation for their e-waste, although this exchange can be social in nature, taking the form of product donations. • Keeping spare products. Consumers often keep old products in case they need to replace a broken one. Stronger repair programmes can help, such as our programme for the Google Pixel described earlier. • Data retrieval and removal. Consumers often hold on to products because they lack easy or reliable ways to transfer or erase data from the devices. • Device nostalgia. Consumers often feel an emotional attachment to their devices, which causes reluctance to part with them. Figure 4. Search ‘battery recycling near me’. Google Maps and Search now make it easier for people to find places near them that recycle a variety of goods, such as batteries, eletronics and glass Challenges ahead We are excited by the progress made by Google’s circularity programme to date, as well as by the opportunities on the horizon. We also recognize the many systemic challenges hindering even greater progress — some of which we identify below. Overcoming these and other barriers will be critical to realizing the circular economy as soon as possible. Improving data availability The circular economy aims to make the most of every resource we use. To do that requires high-quality, standardized data enabling the market to identify, manage and value all the resources available at any given time. For example, rather than seeing a piece of plastic as an item to use and discard, we should see it as bits of information that tell us how it can be reused, what it is worth in terms of recycling, and where it is needed. Such data should inform capital investments, infrastructure priorities, business plans, policy interventions and more — as such, we view data availability as a key to accelerating the transition toward the circular economy. This challenge is one we feel particularly inspired to help solve as a data company, working alongside others. Scaling innovation The circular economy is in a similar place to where renewable energy was a few decades ago: we knew where we needed to go but often lacked the right technologies to help companies, governments and households get there in a cost- competitive way. Innovation helped bridge that gap, with the rise of advances such as new silicon systems to capture sunlight, larger wind turbines to capture energy and longer- lasting batteries to power electric vehicles. We need similar innovation around the way products and materials are designed, manufactured, used, reused, or recycled back into the economy. We need accelerators, venture funding and other forms of support focused on turning great circularity ideas into leading technologies. We plan to leverage Google’s ingenuity, technical leadership, cultural influence and talented people to help do just that. Embracing the future Meeting this moment demands a spirit of exploration and discovery. In nature’s circular system, it is the novel adaptations that pave a new path. Similarly, we need innovative thinkers to inspire a shared sense of purpose around this new direction and rally collective action. For our part, we can help by connecting billions of people every day and sharing our own lessons and experiences. Moving forward together The circular economy, by definition, connects everyone. It is in that spirit of cooperation that we describe the approach Google is currently taking, recognizing that we do not have all the solutions and that true progress will span the global economy. We need business leaders to partner across industries and reduce costs, governments to incentivize action and protect the public good, innovators to keep looking ahead and thinking big, and people everywhere to know that no action is too small.","filter_flag":1}
{"title":"Wonder Juice™ Recognized With “Juice Product of the Year” In 2024 Mindful Awards Program","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fwonder-juice-recognized-with-juice-product-of-the-year-in-2024-mindful-awards-program-1033468566&c=14549871218580052955&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fwonder-juice-recognized-with-juice-product-of-the-year-in-2024-mindful-awards-program-1033468566&c=14549871218580052955&mkt=en-us","summary":"The entire Wonder Juice line is 100 percent organic, ensuring each ingredient is grown without synthetic fertilizers, pesticides, or GMOs while promoting resource recycling, soil and water ...","published":"Tue, 11 Jun 2024 01:03:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=11, tm_hour=1, tm_min=3, tm_sec=0, tm_wday=1, tm_yday=163, tm_isdst=0)","news_source":"Business Insider","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Wonder Juice™ Recognized With “Juice Product of the Year” In 2024 Mindful Awards Program","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The entire Wonder Juice line is 100 percent organic, ensuring each ingredient is grown without synthetic fertilizers, pesticides, or GMOs while promoting resource recycling, soil and water ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Water Conservation\" \"new products\"&format=rss","text":"LOS ANGELES, June 11, 2024 (GLOBE NEWSWIRE) -- The 2024 Mindful Awards Program, an independent recognition platform highlighting conscious companies and products that mindfully make waves in the ever-expanding world of consumer-packaged goods, today announced that Wonder Juice , encompassing the healthful and delicious, 100% cold-pressed juice brands Wonder Melon, Wonder Lemon, and Wonder Beet, has been selected as “Juice Product of the Year.” Wonder Juice™ is organic, promoting a healthier planet, and is Fair Trade certified, ensuring equitable treatment of farmers and workers. Packaged in eco-friendly, recyclable glass bottles, each juice blend offers a fusion of wellness and flavor. The introduction of Wonder Beet™, formerly known as Beetology™, alongside Wonder Melon™ and Wonder Lemon™, combines 100% natural ingredients with the quality of cold-pressed juices. Cold pressing utilizes hydraulic pressure to extract juice which ensures minimal oxidation and heat so that vital enzymes and nutrients are not destroyed. Wonder Juices are blended with cucumbers, cherries, berries, apple juice, and natural veggies, with no added sugars and 110 calories or less per bottle. They are also non-GMO certified. The new Wonder Beet™ line comes in the following flavors: Beet with lemon and ginger, Beet and Veggies, Beet and Berry, and Beet and Cherry - all offering a natural energy boost. Meanwhile, Wonder Melon™ includes Watermelon Cucumber Basil, Watermelon Lemon Cayenne, and classic Watermelon, which are hydrating and rich in antioxidants to promote cardiovascular and digestive wellness. Wonder Lemon™ includes Lemon Basil Jalapeño, Lemon Ginger, and Lemon Mint, providing vitamin C and antioxidants for vitality and immune support. Wonder Juice is committed to ethical and sustainable practices. The entire Wonder Juice line is 100 percent organic, ensuring each ingredient is grown without synthetic fertilizers, pesticides, or GMOs while promoting resource recycling, soil and water conservation, and biodiversity. The product is packaged in a glass bottle that can be repurposed or recycled. Glass is more sustainable to create and recycle than other packaging options. “Wonder Juice is not merely a product but a testament to mindful innovation and unwavering commitment to ethical, sustainable practices. Consumer expectations of food and drink have evolved; The future of the beverage industry, with its deep-rooted commitment to health, is not just about flavor but nourishing the body and soul,” said Travis Grant, Managing Director, Mindful Awards. “Cold-pressed juices are nutritionally superior. Wonder Juice offers authentic, nutrient-rich beverages that don’t just claim to be ‘natural’ but truly epitomize the term. We’re thrilled to award them ‘Juice Product of the Year!’” Using the cold-pressed method, Wonder Juice ensures maximum nutrient retention and a fuller, more vibrant flavor profile compared to traditionally extracted juices. Cold-pressed juices are healthier and taste better, too! Each blend is carefully crafted with the most nutritious ingredients to ensure every sip of Wonder Juice is delicious, satisfying, and ‘Curiously Good.’ explains Laura Morris, Marketing Director of Kayco Beyond Division. \"The Wonder Juice line not only meets that need, but they are more accessible and cost-effective than pressing juice at home or purchasing at a juice bar at a health food store,\" adds Morris. The mission of the Mindful Awards program is to honor conscious CPG companies and products that offer transparency to consumers, pay workers fair wages, ensure sustainable business practices, use recycled or recyclable materials, and create healthier products using natural or organic ingredients. This year’s program attracted thousands of nominations from companies all over the world. All nominations are evaluated by an independent panel of experts within the consumer-packaged goods industry. “Our usage of eco-friendly, recyclable glass bottles underscores our dedication to sustainability, while our process of taking fresh fruits and vegetables grown on organic farms, and cold-pressing them the correct way delivers a delightful, healthful journey, one sip at a time,” said Laura Morris. “We’re so pleased to receive this Mindful Award and we’ll keep making waves in the industry with a commitment that extends beyond taste to ethical and sustainable production, remaining steadfast in our mission to promote wellness, flavor, and environmental stewardship.” About Mindful Awards The Mindful Awards organization is devoted to honoring mindful companies in the consumer-packaged goods industry that are setting the foundation for our future. Mindful Awards are devoted to providing a forum for public recognition around the achievements in categories Food, Beverage, Snacks, Supplements, Home, and Personal Care. Our mission is to bring awareness to the benefits of mindfulness and its impact on society as a whole. We believe that through mindfulness, we can create a more compassionate and sustainable world. For more information visit MindfulAwards.com. About Wonder Juice All Wonder Juice is 100% organic. We use ingredients that are free of synthetic fertilizers, pesticides or GMOs. We source from farms that recycle, maintain healthy soil and water quality and work to conserve biodiversity. All fruits, vegetables and spices used in every Wonder Juice are grown this way, and have been certified to meet the standards set forth by the USDA to be labeled 100% organic. We cold-press all Wonder Juices, which creates no excess heat or air. It also delivers the most enzyme-rich fruit and vegetable juice you can possibly yield. Cold-pressing leads to a fuller flavor and retains the fruit’s natural color. When it’s better for your health AND tastes better too, we’re all for it! Fair trade is about guaranteeing equitable standards for the farmers and food workers who produce much of the world’s food. When you buy Fair Trade products, you’re assured that those who helped create the food had their rights protected, earned competitive wages, and were treated equally and fairly in the process. You’re also assured of additional oversight in safety and health measures. Wonder Juice is certified Fair Trade by FairTSA. And certified Kosher. According to the standards set forth in Jewish law, all fruits and vegetables are generally considered kosher, and can be consumed freely with other foods (including milk or meat.) All the varieties of Wonder Juice have been produced under the supervision of a qualified Rabbinic organization. They have certified that both the ingredients and the equipment used to prepare the juices are properly vetted and monitored to maintain this important distinction. Wonder Juice is certified Kosher by OU (Orthodox Union.) About Kayco Beyond Kayco is one of the largest manufacturers and suppliers of kosher foods. It has expanded Kayco Beyond Division sources and distributes new products to the general market beyond kosher to meet the demands of consumers looking for optional products that are healthful, convenient and\/or for restricted diets and lifestyles. These brands include Absolutely! Gluten Free, Beetology, Mighty Sesame Co., Wonder Melon, Wonder Lemon, and Dorot Gardens, among others. They are headquartered in Bayonne, NJ. Media Contacts: Travis Grant Mindful Awards Travis@mindfulawards.com 949.667.4475","filter_flag":1}
{"title":"Best Showerhead for 2024","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.cnet.com%2fhome%2fkitchen-and-household%2fbest-showerhead%2f&c=4182536862750564356&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.cnet.com%2fhome%2fkitchen-and-household%2fbest-showerhead%2f&c=4182536862750564356&mkt=en-us","summary":"CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise.","published":"Tue, 04 Jun 2024 02:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=4, tm_hour=2, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=156, tm_isdst=0)","news_source":"CNET","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best Showerhead for 2024","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise.","query":"https:\/\/www.bing.com\/news\/search?q=\"Water Conservation\" \"new products\"&format=rss","text":"CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise. What's the best showerhead overall? Whether you start or end your day with a shower, having hot, high-pressure water can make all the difference. If you want to upgrade your shower without an expensive renovation, buying a quality showerhead is the next best thing. From multiple spray patterns to rain shower heads, we found the best showerhead to elevate your bathroom: the High Sierra Classic Plus. When it comes to choosing the best showerhead, there are a few factors you'll need to consider. Countless options are available at your local hardware stores and online, so what should you be looking for? It depends on your needs and your budget. While most showerheads may look similar and offer a lot of the same features, you'll want to pay attention to the details. Delta's clever showerhead tucks a handheld into the main body. Andrew Gebhart\/CNET During testing, the following showerheads rose to the top as the best. Each one features an easy and noninvasive install, especially important if you're in a rented apartment. All are reasonably priced between $50 and $200. All are relatively efficient with water, with ratings between 1.5 and 2.5 gallons per minute. The tested showerheads are also highly regarded in terms of both customer and industry reviews. If you're looking for an affordable showerhead you can install yourself, check out these picks. This list gets updated periodically, with Kohler's unique Moxie Showerhead being the most recent addition. Best showerheads for 2024 Hide our expert take $40 at Amazon Pros Powerful, even with low water pressure or hard water Simple and elegant design Affordable Cons Doesn't offer alternate spray patterns Finishes Chrome, matte black, nickel, oil-rubbed bronze, brass Special features None Pressure (gpm) Available in 1.25, 1.5, 1.8 and 2 Price $30 $40 at Amazon Best showerhead overall High Sierra Classic Plus $40 at Amazon The affordable High Sierra Classic Plus showerhead gets all of the basics right. It sprays in a wide pattern with great coverage and plenty of firmness. I tend to like a relaxing stream on my body and a firm spray on my face and hair. The Classic Plus doesn't offer any alternate spray pattern settings, but the main one balances both of those needs well. If you tend to find a good default and stick with it, look no further. The Classic Plus has a simple and elegant design. It's one of the most affordable showerheads on this list and conserves water as well with a 1.5 gpm rating. If you're looking for something fancy with a wide variety of settings, I have plenty of alternate options below, but this is the Amazon Echo Dot of showerheads. It's simple, affordable and elegant. It's also powerful, even with low water pressure or hard water. If you don't care about extras and just want something to get the job done well, go with the water-saving High Sierra Classic Plus. Available in brushed nickel, bronze, polished brass, matte black or a chrome finish. Photo Gallery 1\/1 Hide our expert take Show our expert take $21 at Amazon Pros Dual heads allow for multiple spray types Loved the massage setting Useful features include the ability to pause either stream Cons Using both showerheads results in lower pressure Thinner stream than some models on our list Finishes Chrome Special features Hand shower, multiple spray types Pressure (gpm) Available in 1.8 and 2.5 Price $35 $21 at Amazon Best showerhead features AquaDance 7-inch Premium Rainfall Combo $21 at Amazon The AquaDance 7-inch Premium showerhead is a great choice if you're looking for a dual showerhead with a lot of features. It includes a handheld showerhead with a stainless steel shower hose and spray head that sit in place behind the main showerhead. Both offer a full-coverage spray setting, an intense massage setting, one that mixes those two, and a mist. The full coverage setting on both the main shower and the handheld showerhead feels great. It balances firmness with wide coverage and still feels relaxing. The intense massage provided a great way to mix it up when I wanted to really feel the pressure and water flow. I ended up leaving the main rain setting on full coverage and kept the hand shower on the massage setting if I wanted that extra intensity. You can pause the stream of either if you want to save water while you suds up. You can run both showerheads simultaneously on the same or different settings. You'll lose some water pressure with the dual shower setting, so you could just as easily switch back and forth from the main showerhead to the handheld shower. You can switch settings by turning a dial, or you can use the splitter to easily swap between the main showerhead and the handheld showerhead. Whatever you want your shower to feel like -- regular showerhead, handheld shower or dual shower -- this AquaDance has an option for you. If you're the type that likes options and likes to change settings based on your mood, this is the best showerhead for you. Photo Gallery 1\/1 Show our expert take Show our expert take $176 at Amazon Pros Excellent balance of coverage and pressure Smart and useful settings, including a wide-spray massage Beautiful design Cons Expensive Not ideal for those who desire a high-pressure spray Finishes Chrome, matte black, brushed nickel, brushed gold, oil-rubbed bronze Special features Rain shower, adjustable water flow Pressure (gpm) 2.5 Price $283 $176 at Amazon Best premium-model showerhead Moen S6320 $176 at Amazon The Moen S6320 looks like a high-end shower with its 8-inch diameter and polished chrome finish. The main full-coverage setting again strikes the right balance between relaxing coverage and firmness. Plus, the S6320 switches to an intense massage setting that also feels great. Lots of the massage settings that I tested were too narrow to be useful outside of spot-cleaning. Moen's is still wide enough to provide actual coverage while still providing a nice boost of intensity. You can also switch back and forth easily with a handle on the side of the showerhead. It's simple enough to control that I was able to find it and switch the setting while my eyes were closed after suds-ing my face. If you want a showerhead that looks higher-end while still maintaining a simple elegance, the Moen S6320 fits the bill. It doesn't have a lot of features, but the two settings are both awesome and switching between them is so easy that you can do it with your eyes closed -- literally. Photo Gallery 1\/1 Show our expert take Show our expert take $121 at Amazon Pros Economical with water Includes remote control Cons Mist and massage sprays are narrow Rainfall setting on the gentle side Expensive Finishes Chrome, bronze, nickel, polished nickel Special features Rain shower, touch control, adjustable water flow Pressure (gpm) 1.8 Price $136 - $193 $121 at Amazon Best rain showerhead American Standard Spectra eTouch $121 at Amazon Showering with the American Standard Spectra eTouch rain showerhead genuinely feels like standing under a gentle stream or being outside during a warm summer rain. This bathroom accessory is super relaxing. The Spectra eTouch is pretty expensive for the brushed nickel or chrome finish, but it's economical with water at a 1.8 gpm rating. The Spectra includes a remote you can attach to your shower wall to switch between multiple spray settings or you can simply touch the rim of the showerhead to do the same. It feels high-tech without adding any complexity. The different settings include a fine mist and two varieties of an intense massage spray, although I found both to be too narrow to provide any coverage. The rainfall shower setting was also a little too gentle on my face, so the Spectra doesn't have a single setting that hits the perfect balance between a firm feel and full coverage. Photo Gallery 1\/1 Show our expert take Show our expert take $97 at Amazon Pros Showerhead that doubles as a Bluetooth speaker Waterproof speaker can be pulled free from the showerhead and used in other spaces Cons Actual showerhead is just OK No alternate spray modes No voice control for temperature or pressure Finishes Black, chrome, brushed nickel Special features Detachable Bluetooth speaker Pressure (gpm) Available in 1.75 and 2.5 Price $83 - $100 $97 at Amazon Best showerhead for your smart home Kohler Moxie Showerhead $97 at Amazon The Kohler Moxie combines a Bluetooth speaker with Amazon's assistant Alexa built-in and an otherwise ordinary showerhead. You can't control the water or temperature with your voice or an app, so I hesitate to call it a smart shower, but it's the closest to one on this list and much more attainable than the fully smart Moen shower, which requires a plumbing overhaul to install. The battery-powered speaker nests in the center of the showerhead with magnets, so you can easily pull it free and use it as a smart speaker in other rooms of your house. Thanks to Alexa, you can listen to music or issue a wide variety of voice commands. The speaker itself surprised me with its sound quality and it genuinely made my morning routines more fun. The showerhead itself is less impressive. The stream was intense but a little narrow, and it didn't have any alternate spray modes. It comes in a variety of finishes, at either 2.5 or 1.75 gpm. Photo Gallery 1\/1 Show our expert take Other showerheads we tested Honorable mentions Kohler Forte 22169: Kohler's showerhead provides nice coverage. The main setting strikes the necessary balance between feeling firm and still relaxing. You can easily switch to a concentrated massage mode or a fine mist. Overall, it's a solid, well-balanced fixed showerhead option that you should consider if you like the look or the brand. It even saves water with a 1.75 gpm rating. It simply didn't stand out as much as the ones above and the concentrated massage stream is too narrow to be useful. Delta In2ition Two-in-One: This Delta showerhead features a clever adjustable showerhead design in which a handheld shower is nested within the main showerhead. The main shower provides the full coverage option, and the handheld shower offers a more intense stream. You can also run both the main and handheld shower at once, though the water pressure expectedly dips a bit, and I'm not a fan of low water pressure. The handheld showerhead easily pulls free, or you can leave the shower arm in place for a stationary massage stream. All of the settings are functional but the main coverage option is a little too weak for my tastes. The main showerhead is also a little hard to pivot, but that's a minor nitpick. This is a competent shower that's worth your consideration, but the little drawbacks took away just enough to prevent it from ranking higher for me. Not recommended Speakman S-2252-E175: None of the showers I tested were outright bad, but this model from Speakman doesn't have a strong enough stream for my tastes. The main mode is fine if underwhelming. The alternate nozzle setting effectively just lets the water pour straight out without any added water pressure or water flow at all. Overall, it was a low-water-pressure shower experience. Culligan WSH-C125: This affordable model from Culligan includes a shower filter and has a bunch of different settings. Changing between the nozzle settings is a pain. The main shower works well enough, but none of the alternate modes are inspiring. Again, this is a competent bathroom shower, but you have plenty of better options. Show more Factors to consider when buying a showerhead The price, finish and materials can vary wildly, and you can also look for the best showerheads with a lower gallons-per-minute rating if water conservation is a concern. You can get a fixed showerhead, which is attached to the wall, or one that includes a handheld sprayer. Some showerheads offer a wide variety of spray patterns (you don't have to be limited to rainfall if you want to switch your spray setting). Whether it's a handheld, dual, fixed, low-flow, high-pressure, combination or rainfall, your showerhead must have the essentials for hassle-free bathing: faucet, flow restrictor, filter, flexible hose and swivel ball. Mount type: Depending on your shower setup, you'll want to choose either a wall or ceiling-mounted showerhead Settings and features: Some showerheads offer multiple stream types and pressure levels including pulsing massage, rainfall and wide-spray. You can even score a showerhead with a built-in speaker for listening to music and podcasts while you wash up. Feature-heavy showerheads typically cost more so consider what your needs are beforehand. Finish: You'll likely want your showerhead to match or at least complement the other metal accents in your shower. Showerheads are available in loads of styles and finishes, including chrome, nickel, copper, bronze and black. Cost: Showerheads start at about $25 and go well into the hundreds of dollars. Settle on a price range before you start narrowing your search. Show more How we test showerheads I've taken a lot of showers over the past couple of weeks. When testing a showerhead system, I look at a lot of factors: The diameter of the face, the gallons-per-minute output, the number of settings, the materials, the design and more. We also run an anecdotal test on the water flow, water pressure and power of the spray pattern with dried egg yolk. More than anything, I showered and noted how each shower experience felt. Some settings did a better job of removing eggs than others. Andrew Gebhart I leave each model installed for a couple of days so I can take a variety of showers. During the first shower with a new shower system, I'm paying close attention to each spray pattern and how they feel, but I also want to shower when I'm not thinking about it as much. With each model, I shower when I'm groggy in the morning and do a post-workout shower to cool down. After every shower, I take notes on the shower experience. Was it firm, relaxing or both? Was the showering experience intense enough to get the soap and shampoo off quickly or did I have to change settings? Is it easy to change settings? For the egg test, I brushed egg yolk onto a cutting board and let it dry for 24 hours. Then I held the board 20 inches from the showerhead while it ran for 10 seconds and noted how much yolk was removed. I ran this test for each setting on each showerhead. Most only removed a little yolk if any, but a few settings proved weaker or stronger relative to the rest. Different showers check different boxes, but at the end of the day, what mattered most to me was the actual showering experience. None of the models I tested were terrible, but a few rose above the rest and cleaned up the competition. Show more","filter_flag":1}
{"title":"Waste Reduction","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.sfu.ca%2ffs%2fprojects-initiatives%2fsustainable-initiatives%2fwaste-reduction.html&c=1517200599746314714&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cf43cdb49bab4c1e14102430390&url=https%3a%2f%2fwww.sfu.ca%2ffs%2fprojects-initiatives%2fsustainable-initiatives%2fwaste-reduction.html&c=1517200599746314714&mkt=en-us","summary":"These items are sent to Urban Impact’s Materials Recovery Facility (MRF) in New Westminster where they are sorted into different types and qualities of paper, baled and sent to recycling facilities, ...","published":"Fri, 12 Oct 2018 07:32:00 GMT","published_parsed":"time.struct_time(tm_year=2018, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=32, tm_sec=0, tm_wday=4, tm_yday=285, tm_isdst=0)","news_source":"Simon Fraser University","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Waste Reduction","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"These items are sent to Urban Impact’s Materials Recovery Facility (MRF) in New Westminster where they are sorted into different types and qualities of paper, baled and sent to recycling facilities, ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Water Conservation\" \"new products\"&format=rss","text":"Any materials that cannot go into the other 3 bins should be put in the grey landfill bin, including the following materials Yes please Styrofoam e.g. containers and cups Soft plastics e.g. plastic wrap, film and grocery bags Plastic cutlery Chip, cookie and candy bags and wrappers No thanks Landfill is the last option for waste. Please ensure that materials you put in this bin cannot be recycled elsewhere. These items are sent to Wastetech’s Waste Transfer Station in Coquitlam, then on to Metro Vancouver’s waste-to-energy facility in Burnaby. Some items, such as glass and metal, never fully break down in a landfill.","filter_flag":1}
