{"title":"René Bethmann | Senior Innovation Manager | VAUDE - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmF1ZGUvcmVuJUMzJUE5LWJldGhtYW5uLzEzNjcxLTHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmF1ZGUvcmVuJUMzJUE5LWJldGhtYW5uLzEzNjcxLTHSAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmF1ZGUvcmVuJUMzJUE5LWJldGhtYW5uLzEzNjcxLTHSAQA","guidislink":false,"published":"Wed, 12 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=193, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmF1ZGUvcmVuJUMzJUE5LWJldGhtYW5uLzEzNjcxLTHSAQA?oc=5\" target=\"_blank\">René Bethmann | Senior Innovation Manager | VAUDE<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"René Bethmann | Senior Innovation Manager | VAUDE - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvdmF1ZGUvcmVuJUMzJUE5LWJldGhtYW5uLzEzNjcxLTHSAQA?oc=5\" target=\"_blank\">René Bethmann | Senior Innovation Manager | VAUDE<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"We have established a reputation as sustainability pioneers VAUDE is a family-run, European outdoor equipment supplier renowned for its commitment to environmental sustainability and social responsibility across its three business segments: Mountain Sports, Bike Sports, and Packs 'n Bags. Since 2001, VAUDE has adhered to the stringent environmental bluesign standard and was the first outdoor company to earn EMAS certification. Speaking to Fibre2Fashion, Senior Innovation Manager René Bethmann discusses the importance of sustainability and comfort in outdoor industry. How is the outdoor gear and apparel industry adapting to the growing demand for sustainable and environmentally friendly products? What are some notable innovations or practices in this area? The guiding principle is to move away from fossil fuel-based materials. Considering the planetary boundaries, it is essential to carefully evaluate alternative options in the realm of renewable carbon, focusing on the three pillar feedstock inputs: CCU (Carbon Capture and Utilisation), Biomass, and Recycling. Significant innovations are taking place, and the adoption of Mass Balance Allocation systems is instrumental in facilitating a rapid transition to renewable carbon solutions, thereby defossillising the industry. These systems allow for the recycling of materials that were previously challenging to recycle, such as waste tyres, complex and contaminated plastics, among others. Progress is being made in utilising biomass feedstock through biochemical processes. While textile-to-textile recycling technologies are emerging, they face challenges due to inadequate infrastructure, especially within Europe for synthetics and the need for substantial financial investments. In addition to innovations on the material level, there are also many innovations on the textile machinery side, as witnessed at this year’s ITMA. The demand has arrived, and the industry is acting. Especially in the field of textile finishing, a lot is happening to save energy, water, and chemicals. Verified product passports, which indicate the emission values per processed material, will help us to better communicate and improve our ecological footprint in the future. With advancements in materials science and technology, what are some recent breakthroughs or developments that have significantly improved the performance and durability of outdoor gear and apparel? Unfortunately, most companies have not yet prioritised durability and longevity with specific goals and measures in their agendas. While some regenerative technologies show promise initially, there is a risk of producing less-durable products. In today’s market, performance alone is no longer sufficient; sustainability is a crucial attribute that must accompany it. The development of drop-in solutions offers a way to shift towards renewable carbon input streams while maintaining the performance characteristics of existing dominant materials. This ensures that the quality remains comparable to fossil-based counterparts. Additionally, these solutions simplify the end-of-life process by allowing us to focus on our existing used material types. Given the existing challenges in implementing commercially viable recycling options for these materials, there is no immediate need for new material types in the short- to mid-term perspective. In an increasingly competitive market, how are companies in the outdoor gear and apparel industry differentiating themselves through innovation? Can you provide examples of successful strategies or unique product offerings? Transparency is a key factor in building trust, and trust, in turn, adds value. This holds true in various industries, including the outdoor gear and apparel industry. Market players in this industry can set themselves apart by embracing transparency and using it as a competitive advantage. Even as smaller player, we have the opportunity to play a pioneering role in this industry. However, it is important to note that the success of material innovations depends on the collective efforts of all competitors. Collaboration and recognition of the value of these innovations are crucial for progress. We need scalability of sustainable technologies, otherwise we will not achieve holistic change. In today’s business landscape, selling a physical product alone is no longer enough. To thrive and stay ahead, companies need to offer additional services beyond the product itself. Rental services, repair services, and educational services are some examples of the value-added services that can make a significant impact on the overall business. Thus, by focusing on transparency, embracing material innovations, and expanding beyond traditional product offerings, companies in the outdoor gear and apparel industry can position themselves for success in a rapidly evolving market. How has consumer behaviour and preferences evolved in the outdoor industry, and how are companies adapting their innovation efforts to meet these changing demands? Customers in the outdoor industry demonstrate a heightened inclination to select sustainable products, driven by a stronger desire to make responsible choices. They seek to utilise products that align with their values and allow them to use them with a clear conscience. Naturally, the product must meet the desired performance requirements while catering to the customer’s intended use. Therefore, it is imperative for new products to consistently provide an ecological advantage in addition to meeting customer needs. Can you provide an overview of VAUDE’s approach to innovation and how it aligns with the company’s overall mission and values? All our innovations are centred around sustainability and\/or comfort, ensuring that our products address both these key aspects. Our brand caters to individuals who appreciate immersing themselves in nature and cherishing friendship in outdoor settings, rather than exclusively targeting high mountaineers. Hence, these two themes perfectly align with our brand values and resonate with our customer base. At VAUDE, forward thinking and openness to new ideas have always been deeply ingrained in our company DNA. As pioneers in the outdoor industry, VAUDE has gained recognition for numerous product innovations. Moreover, we have also established a reputation as sustainability pioneers, consistently venturing beyond conventional approaches. Our success stems not only from motivated employees who recognise challenges and proactively seek solutions but also from our managers and leadership, who embrace these initiatives and integrate them into our framework. Ultimately, our aim is to utilise the resources and possibilities available to us to make this world a better place once again. What are some recent innovative products or solutions that VAUDE has developed, and how have they contributed to sustainability and environmental protection? Recent developments have witnessed the successful commercialisation of the first textile products utilising BASF’s Ccycled compound. The feedstock for these products is sourced from waste tyres through the innovative process developed and executed by Pyrum in Germany. In addition, we have recently unveiled our new ReCircle Collection during trade shows for the upcoming SS24 season. In this collection, our aim was to maximise the material content of PET. As a result, the resulting products can theoretically undergo chemical recycling, thereby achieving the same level of material quality such as from virgin sources. However, it is important to note that the reverse logistics infrastructure for this process is not yet in place on our side. One noteworthy achievement in this collection is our introduction of the world’s first waterproof PET coating for backpack fabrics. This breakthrough allows us to utilise the same material for both the textile and coating, leading to improved recyclability and sustainability in our products. How does VAUDE foster a culture of innovation within the company? Are there any specific processes or initiatives in place to encourage and support creative thinking among employees? Our STEPS programme empowers all employees to contribute their ideas and offers incentives for their valuable input. By creating an environment that values open communication and embraces diverse perspectives, we cultivate an atmosphere where creativity can thrive, and initial concepts can be transformed into impactful solutions. In what ways does VAUDE collaborate with external partners or stakeholders to drive innovation? Can you share any examples of successful partnerships that have led to meaningful advancements? As part of our approach, we have expanded our engagement upstream in the value chain. This means that we are not only in communication with our garment manufacturers and fabric suppliers, but also actively engage with spinning mills, chemical companies, and providers of raw feedstock. In addition to collaborating on numerous funded research projects with academia and industry, we have established close partnerships with large chemical companies. These collaborations allow us to leverage their expertise and resources to drive innovation and sustainable practices forward. As a medium-sized, family-owned enterprise, we acknowledge that we do not possess the financial resources to invest millions of dollars in potential progressive start-ups, although it would be desirable to do so. However, we are fortunate to receive support from large chemical companies who offer a helping hand in advancing our sustainability goals and initiatives. How do you gather insights and feedback from customers to inform the innovation process? Are there any specific channels or methods employed to ensure customer input is valued and incorporated into product development? We use a dedicated end customer feedback portal, the VAUDE support centre, along with AI-supported evaluation of customer reviews and, to some extent, sales feedback. This comprehensive approach forms the foundation for our product development process. However, this is just one facet of our research. The majority of our insights stem from our extensive network, which encompasses both physical and digital connections. Many valuable and innovative ideas emerge through personal exchanges with experts and professionals from diverse fields outside our own. Part of my daily responsibilities includes diligently examining scientific reports and reading specialised media to stay informed and up-to-date. Often, this process confirms whether my ideas are right or wrong. Ultimately, our primary goal is to exceed customer expectations by staying ahead of their needs and desires. Sustainability is a core value for VAUDE. How does the company integrate sustainability considerations into the innovation process? Are there any specific criteria or guidelines that innovations must meet to ensure their environmental and social impact is positive? At the core of our approach lies the Green Shape System, which serves as both an eco-design tool and a seal of approval. This comprehensive system oversees the entire product value chain, from creation to end-of-life like no other existing single certification can offer. In order to meet the stringent standards set by the Green Shape System, our innovations and products must adhere to some of the strictest requirements in the industry. Further, to ensure ongoing improvement and relevance, we continuously review and revise our Green Shape System together with an external board of advisory. This commitment allows us to stay at the forefront of sustainability and maintain our position as a leader in the industry. Looking ahead, what are the company’s long-term goals and aspirations when it comes to innovation? Are there any specific areas or industries that you are particularly interested in exploring or disrupting?","filter_flag":1}
{"title":"Metaverse Marketing: How Brands Can Build Stronger Connections in Virtual Worlds - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9tZXRhdmVyc2UtbWFya2V0aW5nLWhvdy1icmFuZHMtY2FuLWJ1aWxkLXN0cm9uZ2Vy0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9tZXRhdmVyc2UtbWFya2V0aW5nLWhvdy1icmFuZHMtY2FuLWJ1aWxkLXN0cm9uZ2Vy0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9tZXRhdmVyc2UtbWFya2V0aW5nLWhvdy1icmFuZHMtY2FuLWJ1aWxkLXN0cm9uZ2Vy0gEA","guidislink":false,"published":"Fri, 07 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=188, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9tZXRhdmVyc2UtbWFya2V0aW5nLWhvdy1icmFuZHMtY2FuLWJ1aWxkLXN0cm9uZ2Vy0gEA?oc=5\" target=\"_blank\">Metaverse Marketing: How Brands Can Build Stronger Connections in Virtual Worlds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Metaverse Marketing: How Brands Can Build Stronger Connections in Virtual Worlds - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9tZXRhdmVyc2UtbWFya2V0aW5nLWhvdy1icmFuZHMtY2FuLWJ1aWxkLXN0cm9uZ2Vy0gEA?oc=5\" target=\"_blank\">Metaverse Marketing: How Brands Can Build Stronger Connections in Virtual Worlds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Is the Metaverse here to stay or is it just a fancy fad? If you are a marketer or a brand custodian, you have probably thought about it. The answer that makes sense is that the Metaverse, while still taking shape, is here to stay. It is evolving and has its ups and downs, just like the Internet in its infancy. But things are changing fast. Investments into the Metaverse crossed $120 million in 2022 and it is expected to generate $5 trillion by 2030 for both consumer and industrial enterprises, according to McKinsey. That is serious business and one that companies are betting big on. But the true test lies in the adoption by the end-users. Reports suggest that consumers have given the Metaverse a thumbs-up. Even if this popularity is credited to initial euphoria for new technology, consumers are already looking for non-entertainment uses. Over the next two to five years, 70 percent of consumers intend to use the Metaverse in non-gaming contexts. What this hints at is mass adoption in the near future. For marketers and brands, the potential of the Metaverse cannot be understated or ignored. These facts underscore the growing significance of the Metaverse as a crucial channel for brand engagement. But we need to remember that the success of a new technology lies in keeping the consumer at the center of everything. Because it is the consumers who will grow the Metaverse. Start with the Why Before embarking on the Metaverse journey, brands need to carefully assess their motivations and how they want to engage with consumers. Being present in the Metaverse without a clear purpose is an inadequate starting point. It is important to establish specific objectives. For instance, is the goal to augment awareness among untapped audiences or expand the brand's reach and visibility among the target audience? Alternatively, could the aim be to nurture positive sentiment and foster brand loyalty? By identifying and articulating these objectives, brands can align their Metaverse strategy with their broader marketing goals. Next, Where Once brands have evaluated the reasons for their Metaverse presence, it becomes crucial to assess and select the most suitable Metaverse platforms. Each brand possesses a distinct personality, and the context in which it is perceived holds significant importance. Hence, careful analysis is necessary to identify the platforms that not only provide the greatest potential but also align well with the brand's identity and values. It is important to consider the unique strengths and weaknesses of each platform in relation to the brand's objectives. This helps make informed decisions and maximize their impact within the Metaverse. Moreover, embracing the opportunity to experiment with multiple platforms allows brands to explore and determine which platforms resonate best with their target audience. By leveraging this flexibility, brands can fine-tune their Metaverse strategy and establish a strong presence that truly connects with their intended audience. Experiences Matter After the appropriate Metaverse platform, or platforms, are selected, it is essential to shift the focus towards creating compelling experiences. Within the Metaverse, people are drawn in by the overall ambience, but it is the experience itself that keeps them engaged. Brands need to invest in experiences that captivate their specific target audience. In this virtual world, where innovation is paramount, the expectation for delivering exceptional and immersive experiences is notably high. Brands will need to strike a balance between merely advertising their offerings and providing truly immersive experiences that seamlessly integrate with the Metaverse while also complementing real-world activations. This delicate balance ensures that brands meet the elevated expectations of consumers within the Metaverse. Furthermore, brands possess the autonomy to choose their desired virtual locations, allowing them to dynamically exist within various virtual landscapes. This versatility empowers brands to adopt different styles and forms to effectively engage specific audiences. By employing customized strategies and showcasing their unique products, brands can effectively establish a distinct presence that resonates with their target audience within the Metaverse. Make Connections When establishing a presence in the Metaverse for marketing purposes, it is crucial to prioritize making meaningful connections with the audience over focusing solely on direct sales. Forward-thinking brands recognize the importance of proactively strategizing to capture the long-term potential of the Metaverse. Once connections with the target audience have been established, there are various avenues to further enhance brand engagement. For instance, for fashion brands, virtual showrooms, and dressing rooms present significant opportunities to transition from experimental endeavors to widespread adoption. Through virtual showrooms, consumers can explore and interact with products, enabling them to visualize and experience them in a more engaging and interactive manner. Additionally, virtual dressing rooms offer the opportunity for users to try on virtual outfits and experiment with different styles, empowering them to make confident fashion choices. Prepare for Almost Everything In order to thrive in the Metaverse, brands must proactively anticipate and mitigate potential risks to reputation. Cautionary examples exist where brands engaged with consumers online without adequately preparing for the rapid feedback loops of the Internet or the viral nature of social media. However, in the Metaverse, the stakes can be even higher due to the real-time and immersive nature of events. Therefore, it is prudent to establish clear rules of engagement that encompass detailed policies and robust enforcement practices. These guidelines should cover various aspects such as customer experience, intellectual property management, user safety, data privacy, and misinformation. Instances have already arisen where events in the Metaverse did not unfold as intended. Measuring Success Brands need to reimagine how they evaluate marketing success within the Metaverse. While measuring returns on investments remains crucial, the metrics may differ from traditional expectations. In traditional digital marketing, website visitors, conversions, ‘likes,’ shares and customer acquisition costs take center stage. However, in the Metaverse, marketers may need to redefine their metrics to capture the unique dynamics of user engagement. Factors such as analyzing engagement data, consumer preferences, engagement time, etc. become significant considerations. By adopting such measurement approaches, marketers can gain insights into the effectiveness of their Metaverse strategies and optimize their campaigns accordingly. Prepare to Seize the Day Regardless of the specific direction the Metaverse takes, it is highly likely that innovation and consumer adoption will continue to accelerate at a rapid pace. As platforms evolve and new use cases emerge, brands will need to continuously test, learn, and adapt. In this dynamic landscape, it becomes crucial for marketers to have access to the necessary talent capable of keeping up with the swift advancements in augmented and virtual reality, consumer journey analytics, and social commerce. By staying attuned to these developments and securing the right expertise, marketers can effectively navigate the evolving Metaverse and capitalize on the opportunities it presents. Undoubtedly, the Metaverse presents abundant opportunities. While certain technological limitations and the current level of mainstream adoption may initially seem like potential hurdles, they should not deter companies from exploring, experimenting, and ultimately achieving success within the Metaverse. By embracing an open mindset, brands can seize the chance to innovate, learn, and make significant strides in their marketing initiatives.","filter_flag":1}
