{"title":"iOS update adds to carbon emissions forecasting trend - TechHQ","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vdGVjaGhxLmNvbS8yMDIzLzA0L2lvcy11cGRhdGUtYWRkcy10by1jYXJib24tZW1pc3Npb25zLWZvcmVjYXN0aW5nLXRyZW5kL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vdGVjaGhxLmNvbS8yMDIzLzA0L2lvcy11cGRhdGUtYWRkcy10by1jYXJib24tZW1pc3Npb25zLWZvcmVjYXN0aW5nLXRyZW5kL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vdGVjaGhxLmNvbS8yMDIzLzA0L2lvcy11cGRhdGUtYWRkcy10by1jYXJib24tZW1pc3Npb25zLWZvcmVjYXN0aW5nLXRyZW5kL9IBAA","guidislink":false,"published":"Mon, 03 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=93, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vdGVjaGhxLmNvbS8yMDIzLzA0L2lvcy11cGRhdGUtYWRkcy10by1jYXJib24tZW1pc3Npb25zLWZvcmVjYXN0aW5nLXRyZW5kL9IBAA?oc=5\" target=\"_blank\">iOS update adds to carbon emissions forecasting trend<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TechHQ<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"iOS update adds to carbon emissions forecasting trend - TechHQ","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vdGVjaGhxLmNvbS8yMDIzLzA0L2lvcy11cGRhdGUtYWRkcy10by1jYXJib24tZW1pc3Npb25zLWZvcmVjYXN0aW5nLXRyZW5kL9IBAA?oc=5\" target=\"_blank\">iOS update adds to carbon emissions forecasting trend<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TechHQ<\/font>","source.href":"https:\/\/techhq.com","source.title":"TechHQ","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Getting your Trinity Audio player ready... iPhone maker Apple signaled its intention to give iOS users a clean energy charging option when the Cupertino headquartered tech giant previewed the features of iOS16.1 towards the back end of 2022. Apple’s support pages describe ‘clean energy charging’ as a ‘new setting that can try to reduce your carbon footprint by selectively charging when lower carbon emission electricity is available’. And the iPhone feature is part of a bigger trend in the technology sector, which leverages carbon emissions forecasting to lessen the environmental impact of digital devices and information services. READ NEXT Could prime numbers improve Apple Watch battery life? Apple’s product environmental reports show that device use accounts for 17% of the lifecycle carbon emissions associated with its flagship iPhone 14 Pro. Interestingly, this figure jumps to 49% if we rewind the clock to 2009 and consider the iPhone 3G – Apple’s breakthrough device that gave rise to the app store and put the ‘smart’ in smartphone. Improvements over the years in charging efficiency and battery technology, as well as modern devices having components that are more complex and demanding to produce compared with predecessors, could be contributing factors. But that’s a story for another day. The take-home message from Apple’s lifecycle analysis is that while the best thing smartphone users can do for the planet is to trade in and reuse mobile devices – rather than buying new products – there are still environmental savings to be made elsewhere. Next on the list after the impact of production is device use, which is where carbon emissions forecasting fits in. When activated by the user, Apple’s clean energy charging iOS setting will attempt to initiate charging during periods when wind, solar, hydroelectric, and other renewable energy sources are most active. Electricity maps In its clean energy charging support notes, Apple doesn’t name the data source that’s being used for carbon emissions forecasting. But the iPhone maker has a number of choices thanks to the growth in environmental monitoring together with the emergence of online visualization tools. And Apple is by no means the only tech company that is exploring how energy grid reporting tools can boost environmental performance. For example, Google has long used Electricity Maps to calculate the carbon intensity of the electricity powering its data centers. The search giant then attempts to align its compute load with low-carbon energy by shifting tasks with no time constraint to periods of the day when renewable energy is most abundant. Cloud platform-as-a-service (PaaS) providers such as Platform.sh use similar data to make it easy for customers to choose data center locations based on carbon density. “By changing the location for deployment from a high-carbon grid to a low-carbon grid, our clients can reduce their CO2 emission by up to 15x,” writes Platform.sh on its green-hosting page. And, continuing this theme, The Green Web Foundation provides an online tool that answers the question, is your website hosted green? READ NEXT Digital twin of the earth helps firms assess climate risk There’s much to celebrate when it comes to carbon emissions forecasting, and this includes work by National Grid – the electricity system operator for Great Britain. In 2020, the National Grid teamed up with the WWF, Environmental Defense Fund Europe, and the University of Oxford department of Computer Science to forecast the carbon intensity and generation mix 96+ hours ahead region-by-region in the UK. Available as an OpenAPI for developers to integrate into smart products and services, the machine learning output enables electricity consumers to schedule power usage when carbon intensity is predicted to be low. The National Grid data is also available as an app that’s free to download from Apple’s App Store or via Google Play for Android users. And, in many ways, this simple-to-use electricity scheduling guide makes Apple’s clean energy charging setting redundant, at least for users in the UK. Other options for device users wanting to shift electricity use to cleaner times include WattTime, which provides automated emissions reduction data as a paid-for service. There are other approaches to consider too. AI in the sky Climate TRACE makes information available on the status of around 18,000 fossil-fuel power plants globally, which are estimated to be responsible for more than 30% of global greenhouse gas emissions, according to World Resources Institute analysis. What’s more, the Climate TRACE initiative has expanded its carbon emissions forecasting capabilities and now captures data on 80,188 physical assets worldwide, including oil and gas fields, transportation systems such as the Los Angeles road network, airports, and more. The Climate TRACE project highlights the power and versality of satellite imaging. To gather dynamic fossil-fuel power plant data, the system feeds satellite images that show chimney stack smoke and water vapor plumes, indicative of when a power plant is operating, into its model. And, because the deep-learning algorithm has been calibrated with plant-reported power generation data matched to historical images, the trained AI model can infer emissions details from patterns that it sees in over 5000 non-cloudy pictures received daily. Thanks to the work of environmental analysts and power providers, checking carbon emissions forecasting data has become almost as straightforward as looking up weather details today. And, making this information readily available to device makers through APIs plays into other environmental trends, such as the adoption of electric vehicles (EVs). For example, researchers in the US have highlighted that EV emissions can differ by as much as 40% depending on when car owners chose to charge their vehicles.","filter_flag":1}
{"title":"Can you future-proof a refinery against climate change concerns? Shell thinks so - CBC.ca","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5\" target=\"_blank\">Can you future-proof a refinery against climate change concerns? Shell thinks so<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBC.ca<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Can you future-proof a refinery against climate change concerns? Shell thinks so - CBC.ca","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9jYWxnYXJ5L2Jha3gtc2hlbGwtc2NvdGZvcmQtY2xpbWF0ZS0xLjY4MTQwNTjSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjgxNDA1OA?oc=5\" target=\"_blank\">Can you future-proof a refinery against climate change concerns? Shell thinks so<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBC.ca<\/font>","source.href":"https:\/\/www.cbc.ca","source.title":"CBC.ca","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"On a sunny spring afternoon, Shell's massive Scotford industrial complex northeast of Edmonton heaves with activity. There are dozens of smokestacks in every direction of the plant, which churns out not only gasoline and jet fuel, but propane and other materials, on a site that's larger than downtown Edmonton. Grey and brown steel pipes snake from one building to another and back again, like a spaghetti buffet. About 50 different tanks hold a variety of oils, fuels and gases. At a glance, it's not the kind of facility people might imagine as part of the company's efforts to reduce its carbon emissions. But it is. The refinery is one of five in the world that Shell has selected globally to transform into a low-carbon energy production facility, which the company says it intends to keep operating for decades to come, even as it aims to reach a 2050 goal of net-zero emissions. \"It's the ambition to be here for many decades to come,\" said Mark Pattenden, a senior vice-president with Shell Canada, during an interview at the Scotford facility. The Scotford facility employs 1,500 workers, 500 long-term contractors, and thousands of short-term contractors. (Kyle Bakx\/CBC) 'Top of the policy agenda' Achieving those climate targets — now less than three decades away — while operating such a massive refining operation may seem far-fetched, but the company has begun to take steps toward transforming the facility. It's a common dilemma facing many companies throughout Canada's industrial sector: finding ways to future-proof their business amid increasing concerns about the environment and the harmful effects of climate change around the globe. \"As the pandemic recedes, climate change and the transition to a low-carbon economy will move to the top of the policy agenda,\" said the Canadian Manufacturers and Exporters in a report , noting the transition will be difficult, but has the potential to be rewarding as \"global demand for clean technology is increasing at an explosive rate.\" WATCH | Coast-to-coast clean energy in the federal budget: Federal budget includes plan for clean energy grid Duration 1:43 This week’s federal budget revealed the Liberal Party's plans to provide clean energy from coast to coast. But making that a reality will be a massive undertaking, logistically and politically. Canadian companies are taking different approaches in the face of environmental pressure. Oilsands companies in Alberta are proposing to reach net-zero emissions by 2050 largely through using carbon capture and storage facilities. Last year, Suncor Energy sold its wind and solar business, but wants to expand its biofuel and hydrogen production. Meanwhile, pipeline firm Enbridge is expanding the number of its renewable energy projects including offshore wind, while TC Energy is developing projects like pumped-hydro electricity storage A hydrogen production facility is shown at Shell's Scotford complex. This plant uses water and natural gas to produce hydrogen that is used at the nearby oil refinery. Shell's proposed Polaris project would capture the majority of the carbon dioxide emissions from this hydrogen facility and store the gases in an underground reservoir. (Kyle Bakx\/CBC) Shell's Scotford facility was first built in 1984 as a refinery, and later expanded to add an upgrader to process oilsands bitumen into different types of crude oil. The two plants work together to produce gasoline, diesel and jet fuel, in addition to some gasses such as propane and butane. A petrochemical plant on the site pumps out styrene monomer and ethylene glycol, used in products like food containers, home insulation and antifreeze. The refinery, upgrader and petrochemical plants are all connected, and that level of integration is part of the reason why Scotford was one of the handful of refineries around the world that Shell wants to keep, the company told CBC News. It's also one of its most profitable, they added. Changes underway There is a general plan for Scotford to be re-invented by cutting down on pollution and by producing new types of low-carbon products. There is a specific roadmap to reduce emissions, although company officials are more vague about diversifying its product mix. The first step in cutting emissions came in 2015, when the Quest carbon capture and storage began operating. Annually, it collects about one million tonnes of emissions and pumps the gases into a reservoir several kilometres underground. Recently, a five megawatt solar field was built on site, and Shell has signed a long-term deal to purchase 50 megawatts of electricity from a newly-built nearby wind farm. Construction of a second solar field is underway, officials say, which will produce about 58 megawatts of electricity. Combined, executives say the three projects are expected to cut the amount of pollution produced to power the entire Scotford facility in half. A five megawatt solar field is located near Shell's petrochemical plant. (Kyle Bakx\/CBC) Within the next year, officials say the company will make a final decision on whether to proceed with the Polaris carbon capture and storage project, which would be much larger than the existing Quest facility. For now, the company continues developing the project, such as the detailed designs. The carbon capture projects help cut down on pollution, but considering the size of the facility, they will only put a dent into overall emissions. For now, the Scotford facility will continue to focus on producing oil, fuels and chemicals as there are no specific plans to change the formula. However, Pattenden said the company is exploring whether to branch out into producing other types of low-carbon energy like biofuels, hydrogen, and sustainable aviation fuel. \"They're all in play and they're all things that we're going to be considering,\" said Pattenden. \"There's going to be other opportunities we're going to develop.\" Climate concerns Last month, scientists delivered a \"final warning\" on the climate crisis, calling for immediate action as rising greenhouse gas emissions push the world to the brink of irrevocable damage. At the same time, consumption of oil and gas continues to rise around the globe every year. Since Russia's invasion of Ukraine, there has been an increased focus on energy security and affordability. Previously, Shell has sold refineries in different parts of the world and much of its Alberta oilsands operations, in part, to reduce its emissions. While Shell's divestments help the company reach its climate goals, the facilities are still in operation, just under a different ownership. While some environmental groups want the oilpatch to stop fossil fuel development altogether, others are a bit more nuanced. The world is beginning to move through an energy transition, experts say, as there is a shift from fossil fuels to cleaner sources of fuel and power. For a company to achieve a net-zero emission target, there is no specific game plan to follow as it can be a complex goal to achieve, said Jan Gorski with the Pembina Institute, a clean energy think-tank. Generally, oilpatch producers should invest money toward reducing emissions from existing operations while also diversifying their business — such as expanding into renewable energy and hydrogen production, he said. To determine whether companies could be greenwashing or are earnest in their efforts, Gorski said, he looks at the size of a company's investments. Crude oil is refined into gasoline, diesel, jet fuel, propane and butane at the Scotford complex. (Kyle Bakx\/CBC) \"The key thing to look at is how are they using their money? How are they investing their capital? What percentage of their capital is going toward reducing emissions? What per cent is going toward diversification?\" said Gorski. \"I don't have any hard and fast rules for what's good and what a company should be striving for, but those are the kind of metrics to look at.\" Despite the industry's record profits last year, only about five per cent of worldwide investment by the oilpatch went to wind, solar and other renewable energies in 2022, according to the International Energy Agency , up from one per cent in 2019. Last year, Shell invested about $3.5 billion globally on its renewables and energy-solutions business, which includes a variety of technologies from wind and solar farms, to carbon offsets, carbon capture and biofuels. The level of spending made up about 14 per cent of total capital expenditures last year and executives have said that level of spending will remain steady in 2023. At Scotford, the refinery, upgrader and petrochemicals plant will remain the centrepieces of the facility, even as renewable energy and other additions are made. How quickly Shell offers new products at the site, like biofuels, will depend on demand from their customers, executives say. \"This is how we will move through the energy transition,\" said Pattenden. \"Affordable energy, available energy, but also a decarbonised energy are all going to be really important aspects.\"","filter_flag":1}
{"title":"Custodians of carbon: creating a circular carbon economy - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnJnLjIwMjMuMTEyNDA3MtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnJnLjIwMjMuMTEyNDA3MtIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnJnLjIwMjMuMTEyNDA3MtIBAA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnJnLjIwMjMuMTEyNDA3MtIBAA?oc=5\" target=\"_blank\">Custodians of carbon: creating a circular carbon economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Custodians of carbon: creating a circular carbon economy - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnJnLjIwMjMuMTEyNDA3MtIBAA?oc=5\" target=\"_blank\">Custodians of carbon: creating a circular carbon economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"To stand a chance of achieving net zero greenhouse gas emissions and in the implementation of UN Sustainable Development Goals society must move away from being consumers of carbon to being custodians. While SDG 7 focuses on clean energy, chemicals and materials are themselves energy, energy stored in chemical bonds. Behavioural change is needed to appreciate the societal value of carbon and to recycle carbon already present in the environment, so extracting more fossil carbon from the Earth is avoided. Society needs to develop new technologies such as carbon capture and utilisation to create value-added products from what is otherwise waste. To do this effectively, the social impact of change must be considered, its effect on the environment, and whether this transition makes economic sense. If there is social injustice, then new approaches are needed. If there is no environmental benefit, then interventions must be reconsidered. This becomes an iterative process seeking to achieve the best-balanced scenarios. As new technologies develop, interventions by governments providing aid to subsidise and accelerate new technologies will be needed. Care must be taken to ensure fiduciary duty is applied so the best possible use of public money is delivered. In this paper a systems approach is taken in developing a new circular carbon economy, where models are developed to include lifecycle, techno-economic, and social impact assessment studies into any policy development and commercialisation plans. It is vitally important to develop this methodological thinking early in that planning phase to avoid serious errors that could be costly financially, socially and environmentally. In early stages of development, a coarse-grained approach is required focusing on hotspot analysis. Once hotspots have been identified, finer grained analysis can be undertaken to develop rational approaches to process and policy development. It is vitally important that all disciplines are included within the development of such models, relying not only on engineers and scientists, but also social scientists, psychologists and financial experts. If such an approach is developed now, there is a good chance of identifying acceptable pathways to achieving sustainable development goals. This paper addresses gaps in the CO 2 utilisation where social and fiscal issues are often overlooked. Introduction The planet is suffering environmentally and financially for many reasons. These include the Climate Emergency, as a consequence of increasing global greenhouse gas emissions (NOAA Global Monitoring Laboratory, 2021); financially due to worldwide recession; increasing socio-political instabilities and crises. As these issues evolve, there is a growing concern this will have significant social impacts, including health, food and energy poverty, transport inequalities and an ever-widening gap between high and low socio-economic groups. Policy for carbon capture, utilisation and storage (CCUS) was developed within the Mission Innovation recommendations (Mission Innovation, 2018) which explicitly included carbon dioxide utilisation, or conversion, as a key feature of climate change mitigation strategy (IPCC, 2021). This Hypothesis and Theory paper considers interventions and change needed to embed circular methodologies within an extended carbon supply chain. While technological development is needed to create a vehicle for change, we will look at factors including the sustainability of carbon without using fossil reserves, security of supply and the balance between the environment, the economy and society. It is recognised that the cost of recycled carbon chemicals will be greater than current fossil derivatives and so will need subsidies to levelise the costs to the end user. This is likely to initially come from fiscal interventions by governments and so their fiduciary duty is discussed. Furthermore, a degree of behavioural change is required to adopt circularity, so this is also considered in the full system. Each is discussed in separate sections to build possible future scenarios. Sustainable carbon within a new carbon cycle There has been considerable debate regarding the characterisation of carbon in a sustainable environment. Issues have been blurred with the drive towards biomass as a sustainable fossil alternative. It is worth remembering that policies look at carbon cycles. Fossil carbon is derived from biomass, formed over millions of years. Likewise, biomass can be formed from fossil carbon, through burning of fossil fuels then photosynthetic conversion of the CO 2 produced together with a source of hydrogen, in this case protons from water splitting using solar energy. Likewise, synthetic fuels can be produced from captured CO 2 and water in Power to X (PtoX) technologies, where the conversion energy comes from sustainable low carbon sources such as wind or solar, and in this case molecular hydrogen as the CO 2 reductant over a catalyst. Where is the distinction made between biomass carbon and fossil carbon? Distinction cannot be made as we are looking at carbon, albeit in different regions of multiple related cycles. For sustainable fuels, the main concern is the cycle size: the time to complete one cycle. The formation of fossil carbon from biomass has taken millions of years. However, it only takes minutes to take it back to CO 2 through combustion. Similarly, crop-based biomass will take several months to grow, and in the case of trees typically 50–100 years. PtoX fuels on the other hand can be produced in hours. If CO 2 is captured and reduced catalytically back to PtoX-fuel the cycle is shortened and can make a bigger impact on mitigating against CO 2 emissions. This will require energy and so will add process costs. These costs can be reduced by creating excess low-carbon energy and using this surplus to produce e-fuels, which are much easier to store long-term than electricity. In Figure 1, there is no chemical distinction between fossil carbon and biomass carbon after combustion. Carbon, in the form of CO 2 is emitted to the atmosphere, delivering the same global warming potential (GWP) independent of the combustion source. Where the distinction is made is that nth-generation carbon can be reused in a new carbon cycle and so can be distinguished as renewable carbon (r-C). If r-C is used to produce new carbon-based fuels, materials or biomass the carbon becomes part of the cycle and so no new fossil carbon needs to be extracted. New fossil carbon is avoided, so does not enter the already carbon-saturated supply chain. While energy is needed to create these new products, the carbon intensity is reduced on the second and subsequent uses and significantly decreases the more times the cycle is completed. It is important to understand that in terms of net zero it is not necessary for the same carbon atom to be incorporated into the cycle, as for carbon accounting it can be another equivalent of carbon emitted through other means (CO 2 eq rather than CO 2 ). FIGURE 1 FIGURE 1. A new carbon cycle. Once nth-generation carbon is achieved there is no distinction between fossil carbon and biomass carbon: it is simply recycled carbon (r-C). PtoX-fuels will allow us to make a transition towards Net Zero significantly faster than relying on process electrification or by storing emitted and captured carbon. This approach produces value-added carbon and new beneficial fuel types. Direct air capture (DAC) can be achieved but the expense will be such that it will likely make storage and even utilisation prohibitively expensive. It is now becoming well-recognised that the cost of e-fuel will increase relative to the counterfactual fossil fuels. However, PtoX-fuels can contribute to creating an energy economy. We will need to reduce our reliance on energy and this can only be achieved through behavioural change, discussed later. Moving to a circular carbon economy Sustainability and the transition to net zero will fundamentally require that existing linear economies (resources being consumed and eventually discarded along with their by-products) are redeveloped and redesigned towards circularity. Within a new increasingly circular economy, recycling and reusing of all the resources found within all products, and their by-products, must dominate the overall supply chain. Society needs to transition from recycling a fraction of total waste to recycling nearly all of it. While reuse and recycling of precious and commodity metals, glass and some plastics are mature processes, carbon dioxide is invariably considered as a waste, if considered at all. It can be considered that practically all manufactured goods, save those made of wood or paper, have a carbon footprint with a kgCO 2 eq emission that will outweigh the product itself, often by a factor of 5 or more (Meinrenken et al., 2020). Given that common fundamental base materials like steel and hard plastics have embodied kgCO 2 eq\/kg product factors commonly reported between 1.4 and 1.9 and 1.9–3.8 respectively perhaps this is unsurprising (Biron, 2020; World Meteorological Organisation, 2010). Some high intensity products like laptop computers are outweighed by a CO 2 footprint 100–200-fold, depending on make and model (Circular Computing, 2021). While these CO 2 eq figures naturally include other gases such as methane and nitrogen oxides, most of the footprint is CO 2 itself, so achieving sustainability and circularisation of major economies in a new sustainable carbon cycle must involve using this CO 2 wherever it is released. CO 2 must be recognised as a resource rather than a waste, with its use prioritised over the consumption and exploitation of new fossil carbon. If CO 2 is used as a resource to contribute to circularising future economies, three conditions need to be met. The CO 2 must be made available, be used or otherwise recycled, and must be accounted for with full and sensible tracking of wider social, economic and climate impacts. For the first part, CO 2 must be collected or otherwise processed into a form which is usable and valuable. This will involve carbon capture where carbon dioxide is separated from a mixed gas stream that would otherwise be considered waste (flue gas). For utilisation, the focus should be on parts of the future economy that cannot be easily decarbonised, and that could use a significant proportion of net CO 2 emissions. Care must be taken when considering also what energy inputs may be required for the utilisation, including hydrogen, and the associated knock-on effects including both emissions associated with those resources and changes to the complete supply chain as linear resource use is reduced (von der Assen et al., 2015). Finally, to properly account for the CO 2 and sustainability of any approach involves looking at the entire impact pathway that the carbon has. Full, transparent Life Cycle Assessment (LCA) must be integrated with Techno-economics and Sustainability Analysis. In addition, cost, responsibility, fiduciary duty and supply chain considerations must be made with appropriate systemic thinking, and a clear choice of realistic boundary conditions. Only with such considered approaches can the existing linear economies be flexed and finally remade as circular. Energetics and practicalities of CO 2 capture Direct air capture (DAC) Full circularisation is impossible without the capture of CO 2 , particularly that which must be accounted as resulting from industries and processes that cannot be fully decarbonised within climate-relevant timescales (Rissman et al., 2020). Carbon capture, in all its forms, is also constrained by both theoretical and practical limitations. Separating any mixture of compounds requires the consumption of energy to counteract the reduction in entropy resulting from the separation. In the context of carbon dioxide, this energy will be further dependent on the concentration of the carbon dioxide in the gas stream. The lower the concentration of CO 2 , the higher the overall energy cost and the larger the volume of air required to be treated. This makes the capture of carbon dioxide directly from air (DAC) the most fundamentally energy-intensive method of carbon capture despite being the simplest way to directly offset emissions and the only way to capture emissions without proximity to, and direct interaction with, an emitter. One way this can be shown is by comparing the energy generated by the formation of one tonne of CO 2 from carbon against the minimum and expected energy costs of DAC, which must be sourced from low carbon energy. In effect, this calculates the net energy released or used in combustion, and capture of the CO 2 before even considering how the CO 2 could be reused, recycled or disposed. This method calculates at what point more energy is spent cleaning up the carbon dioxide than the production of the carbon dioxide through combustion. The full free energy of formation of CO 2 under ambient conditions is 8.96 GJ\/tCO 2 , reducing to 2.96–4.48 GJ\/tCO 2 when the thermal efficiency of typical power generation, as the most common form of emission, is considered (33%–50%) (Nakagaki, 2021). While the theoretical minimum energy cost to separate CO 2 from air is even lower than these figures, just 0.47 GJ\/tCO 2 , even the best-performing laboratory-scale air capture processes operate with several times that energy cost at 1.5–2.1 GJ\/tCO 2 often measuring only the simple sorption\/desorption energy and not including any other process cost or process inefficiency (Nagasawa et al., 2009; Lackner, 2013; Sanz-Pérez et al., 2016; Meng et al., 2021). This then leaves little overall energy budget once the additional costs associated with handling huge quantities of air to yield even relatively small quantities of CO 2 (a minimum of 1.3 million cubic metres of air per tonne of CO 2 ) and the residual carbon emissions associated even with the low carbon energy that may be used are included. This typically raises the capture energy requirements above 5 GJ\/tCO 2 meaning a net energy loss is made on each tonne of carbon captured (McQueen et al., 2021; NREL, 2021). The practical result is the energy needed to achieve DAC would frequently be better used to supplant existing fossil fuel-based energy generation, avoiding emission in the first place, apart from in situations where the energy cannot otherwise be used due to practical limitations, or the hypothetical future scenario where fossil fuel combustion has completely ended. One example of waste energy utilisation would be through regenerative braking systems on North American transcontinental rail car systems as reported by Bachman, et al. (2022), where this otherwise-unrecoverable energy is used by a compact air capture process mounted on an additional car as detailed further in the extensive Supplementary Material. The limitation of this approach, and others involving such marginal energy sources, such as curtailed or isolated renewable generation, is that these energy sources are inherently niche both in location and quantity, and also are often intermittent, which significantly impacts the potential viability. Point source capture (PSC) Capturing carbon dioxide from a point source emitter with CO 2 concentrations of 5%–40% significantly reduces both the thermodynamic minimum separation energy cost and the practical energy costs by reducing the volume of gas needed to be treated. At 40% CO 2 concentration, a minimum of just 1,400 cubic metres must be processed per tonne of CO 2 . For flue gas emissions at 12% CO 2 the thermodynamic minimum energy cost falls to just 0.12 GJ\/tCO 2 , although as with the air capture scenarios above, real capture processes typically require significantly more energy than this minimum. While traditional liquid amine capture processes require energy consumptions of 3.1–5.4 GJ\/tCO 2 , more recent solid-sorbent processes of various types are approaching an energy cost of around or even below 1 GJ\/tCO 2 (Dowson et al., 2016) with far lower additional process costs, due to the smaller gas volumes than associated with DAC (Romeo et al., 2020; Sadiq et al., 2020; Styring et al., 2021). The specific capture processes that are envisioned for these plants will vary across different sectors depending on available services, such as heat, power and water, footprint space and downstream CO 2 logistics, which need to be rapidly developed to allow carbon capture to have an impact on emissions. For any near-future timescales, relevant to efforts to limit climate change, there will remain an abundance of these point sources, both in terms of absolute CO 2 emissions and high CO 2 concentrations, even as renewable and low carbon energy capacity is expanded. This is especially important in hard-to-decarbonise sectors such as steel and cement manufacturing (Rissman et al., 2020). Point sources will therefore likely require carbon capture to fundamentally operate in a future “net zero” environment, which reduces the importance of the energetics considerations as emissions may be seen as otherwise unavoidable and should therefore be captured wherever the costs are lowest, both in terms of energy and process. As an additional consideration relevant to the future supply chain, many of these of industries are crucial for downstream construction to allow the future energy transition in other sectors, providing the basis for new housing stock, new energy generation facilities and transport infrastructure. With point source capture, the captured CO 2 may retain some or all of the original carbon footprint, depending on the accounting practice used. For example, if the carbon was captured from a steel production site the carbon accounting can either declare the manufactured steel from that part of the process to be carbon neutral, or the captured carbon dioxide itself as a feedstock (which may go on to be utilised as a product) is carbon neutral, but not both simultaneously. This is especially important in the context of synthetic carbon transport fuels, where captured CO 2 will be released to the atmosphere after combustion. While this complicates the tracking and accounting of net emissions, there still is a net carbon benefit to allowing even new fossil carbon to be used twice before it is released to the atmosphere in these necessary processes, effectively halving the total combined footprint of the steel and the fuel individually. In the case of iron\/steel manufacturing, as traditional blast furnaces turn to using carbon neutral biochar for their iron smelting, the 50% initial footprint reduction by carbon capture and recycling could be applied on top of the 18%–40% reduction through biochar usage and a new industrial symbiosis could be developed that allows for net zero to be approached (Feliciano-Bruzual, 2014). Utilisation\/carbon recycling The second of the three conditions for circularisation is use or recycling of the captured carbon dioxide as a priority above storage and direct sequestration. This mirrors the classical simple Lansink waste hierarchy (Lansink, 2018) which must now be applied to carbon as well as other reclaimable wastes: Avoid > Reduce > Reuse > Recycle > Dispose. This approach will be returned to in a later section, considering a modern-day approach. For carbon dioxide, this hierarchy can be seen as applying to reduction in use of fossil-powered energy in the wider economy. Re-use of CO 2 would include incorporation of the carbon into long-life, value-added products such as accelerated mineralisation to carbonate construction materials, certain polymers and fine chemicals that do not involve the incorporated carbon returning to the atmosphere within a short timeframe, and do not require added energy (exothermic processes). Recycling would include the generation of synthetic fuels and other valuable polymers and fine chemicals, where the carbon utilisation requires significant energy input, often in the form of sustainably sourced hydrogen. Finally, disposal represents long-term sequestration and storage of the CO 2 (CCS) (Choptiany, et al., 2014), where no further value is extracted from the carbon dioxide except direct emissions mitigation (Roh, et al., 2016). While the “reuse” of carbon dioxide in building aggregates, fine chemicals and polymers such as polyurethane and polycarbonates represents the best mitigation strategy that can be applied to captured CO 2 from industries and sectors that cannot be reasonably decarbonised within the climate-relevant timeframe, the total capacity of these products is relatively low and even in idealised scenarios will not make a large impact on total carbon emissions (Dowson and Strying, 2017). Furthermore, these approaches do not help to address the continuing need for hydrocarbon transport fuels for heavy vehicles, including haulage, maritime and aviation sectors. Synthetic carbon fuels within this “recycle” branch should therefore also be considered. This is despite such fuels being less ideal, from a net-emissions perspective, than either “reuse” or “disposal”, since they have a greater role in ensuring the financing and supply security of a “just transition” (Newell and Mulvaney, 2013). Synthetic carbon fuels Since the total scale of emissions that can be captured by the production of fine and commodity chemicals are limited to approximately 300 Mt\/y CO 2 , by comparison transport fuels could potentially absorb billions of tonnes of total CO 2 emissions, making realistic inroads towards decarbonisation of that otherwise challenging sector (Aresta et al., 2013). New synthetic fuels will offer both challenges in their compatibility with the existing supply chain infrastructure, but also opportunities to narrow and refine fuel performance characteristics. Synthetic fuels do not need to be poorly defined mixtures of thousands of different compounds, but instead can be created from a small number of tightly-controlled compounds, allowing completely reliable combustion performance. In the extreme case, synthetic fuel could be a single-component fuel, where every molecule will combust in a completely predictable fashion. New fuels like dimethyl ether (DME) can be used in converted diesel engines, where they can reduce harmful nitrogen oxide emissions, and practically eliminates particulate emissions (Styring, et al., 2021). Similarly, fuels like butanol in petrol engines can achieve higher fuel mileages than the standard fuels, despite having lower energy density, due to coincidentally high combustion efficiency (Ramey and Ramey, 2005; Han et al., 2017; Putrasri and Lim, 2022). This allows new fuels to not only be less carbon-intensive but also better-performing than existing fuels, meaning quality and performance does not need to be sacrificed for sustainability. It is recognised that in terms of emissions, internal combustion engines are not the problem as their efficiency has been optimised over many decades. Rather the problem is the fossil-based fuels. In this way, synthetic fuels offer the benefit of emissions reduction in use while, if manufactured with the existing supply infrastructure in mind, requiring no or only modest modification to the engines. This means that long-life vehicles such as those found in aviation and maritime industries can be used without the need to decommission serviceable equipment as low emissions zones are established. Significant challenges remain. Fuel production from CO 2 , while allowing low carbon electrification-by-proxy of otherwise unavoidable emissions, requires enormous amounts of low carbon energy to produce useful quantities of fuel. In addition to this, the use of these fuels and their associated carbon footprints within the whole lifecycle and their place inside future supply chains needs to be clearly calculated and defined. Security of supply and supply chain The discussion of decarbonised or circular supply chains is one that runs deeply through the production of nearly all products, services, and industries, independent of the form in which the product is found. The scope, definition, and security of these new decarbonised supply chains must all be considered thoroughly before implementing industrial change. Once a product’s supply chain is defined, decarbonised alternatives of both energy and mass balances can be considered. Quantifying how these changes will impact the waste and emission profiles of each supply chain constituent. This also allows for the granular assessment of supply chain security, both in the proposed and benchmark scenarios; ultimately facilitating deeper understanding around the viability of decarbonised supply chains in the context of extended time periods. Supply chain clarification - Scope When considering the security of a decarbonised, circular carbon supply chain, many characteristic challenges arise. A significant number of these are inconsequential within linear alternatives. These can vary based on the scope of assessment in question. The GHG protocol defines three emission scopes, each building upon the prior with respect to the breadth of the supply chain’s system boundaries. These are summarised in Table 1. TABLE 1 TABLE 1. Definitions of the three emission scopes outlined by the GHG protocol (Barrow et al., 2013). Inventory breakdown In order to identify carbon hotspots, whether considering scope 1, 2 or 3 emissions, the theory of supply chain breakdown remains consistent with the breadth of system boundaries being the only key variable. As a means of illustration, an inventory analysis of an example product is outlined in Figure 2, with the aim of understanding which section(s) of the supply chain hold the greatest barriers with respect to production circularity. By taking a subject product which is to be assessed, a practitioner can work backwards from the product to form a “tree diagram”, displaying the overall supply chain and its constituent material and energy flows. This method is outlined in greater detail by Platt and Styring (2022) with a focus on feedstock defossilisation. FIGURE 2 FIGURE 2. A sample supply chain tree diagram for an undefined product, with simplified material and energy flows (reproduced with permission from Platt and Styring, (2022)). The layout of material and energy flows (Figure 2) allows each individual process to be treated as a “black box”, meaning each process can be considered independently in order to find any carbon hotspots, whether in the form of carbon-containing feedstocks or energy sources. Within a real-world scenario, the inventory for each material and energy flow will be broken down into individual components, providing an overall inventory for the subject product. With a supply chain tree diagram and accompanying inventory data, the detection of carbon hotspots should be viable based on process data scaled to a defined functional unit. Once hotspots have been sourced, the substitution of carbon intense processes or flows can be approached, implementing circular or decarbonised alternatives, easing the overall supply chain towards a fully decarbonised state. The resulting supply chain can then be assessed against the original, either through life cycle assessment or counterfactual screening methods. Supply chain security With any scenario, the understanding and assessment of security is vital for the implementation of circular supply chains. When assessing security, the timeframe in which materials technologies are available is one of the most important factors. An example within a linear, present-day setting could be the sourcing of hydrogen through steam methane reforming, exhibiting a strong reliance on fossil-derived natural gas. Through a variety of factors, whether geopolitical, economic, or simply resource depletion, the security of supply is almost always under some form of threat. As supply chains progress towards circularity, security will inevitably increase; a consequence of adopting greater internal recycle and re-use rates and moving away from materials with detrimental, “outside” influences. Circular supply chains also harness the benefits of a shorter chain than the linear alternatives, with spent material repurposing usually requiring far fewer raw materials, offshore manufacture, and subsequent distribution. This in turn reduces the overall threats on the supply chain, with a shorter supply chain acting as a smaller target for compromise. As circular routes to platform chemicals are becoming ever apparent, the understanding that threats to supply chain security based on location is also a key consideration. It should therefore be noted that a shift towards distribution-based supply will likely be required for global chemical demands to be met. This will allow for the variability of feedstocks for platform chemicals, based on the most locally ubiquitous, non-fossil materials. Whilst these changes propose an attractive future, where the production and consumption of products can be innately intertwined and constructively reliant on one another, there are inevitable trade-offs and roadblocks to address. Regarding material quality, the well-documented issue of downcycling must be addressed if circular supply chains are to remain in perpetuum (Gallego-Schmid et al., 2020). This will likely come in the form of a complete redesign of sections or entire supply chains in order to stop the decline of product quality as cycles continue. For energy, the transition to a circular economy can in turn benefit supply chain security, though the demand for energy is still present within circular alternatives. Fortunately, the decarbonisation of energy sources has been shown to increase energy platform resilience, with a renewable energy portfolio providing a “silver buckshot” scenario. With a renewable energy supply comes a supply which is sourced through a variety of methods, a reliable energy supply can be provided as different technologies can take the slack if required. This was described by the National Renewable Energy Laboratory as providing a “smoothing effect” that “decreases vulnerability to disasters” (Cox et al., 2016). To best reap the benefits of these energy supplies however, issues of energy storage must also be addressed. Whilst multi-source grid mixes go a considerable way in addressing the “smoothing effect” of intermittency, it cannot necessarily guarantee a sustainable, consistent energy supply. Energy storage looks to address this issue by storing excess energy at times of relatively low demand, for later use at times of higher demand (or lower supply). Whilst research efforts into energy storage are substantial, a lack of commercial viability is currently inhibiting it from full deployment (Koohi-Fayegh and Rosen, 2020). A triple helix approach: environment, economics, and society Increasing public demands have led to investment and shifts towards the responsible sourcing of goods, services, and by extension, chemicals feedstocks within supply chains. As previously mentioned, sustainability goes beyond purely environmental assessment; rather, it can be viewed as a multi-faceted problem. Three distinct, yet interconnected aspects are present. Consequently, this necessitates a holistic approach to process design and selection, considering the environment, economics, and society. In order for the chemical industry, to establish a truly sustainable status quo, none of these can be neglected. While recognition of such an approach is not novel, being suggested from 2007 onwards (Remmen et al., 2007; Kloepffer, 2008), the field has largely stagnated in its infancy. Improved practicality and harmonisation of methodologies offers a powerful tool in the transition towards sustainable societies and widespread utilisation of carbon dioxide. Numerous methodologies have been presented for individual ‘strands’. However, many diverging schools of thought are present, resulting in a deep lack of consensus around methodological approach (Remmen et al., 2007; Kloepffer, 2008). Carbon dioxide utilisation (CDU) technologies require holistic assessment in order to manage and quantify burden shifts; occurring when improvements in one strand of sustainability catalyse detrimental effects in another. A pertinent example from another field being the transition to EVs for personal transport. While benefits can be seen through environmental metrics (European Environment Agency, 2008; Ricardo Inc., 2022), there is risk of producing a ‘mobility underclass’ through high prices and access to private off-street charging facilities. Lower income households, usually commanding no off-street parking, could expect to pay £20 per charge or ‘tank’ via commercial charging points; almost a threefold increase on the £7 realised by private charging (Witchalls, 2018). In this example, holistic consideration of road transport’s sustainability profile may provide compelling arguments for transition towards CO 2 derived synthetic fuels (Newman and Styring, 2022). Beyond burden shifts, holistic assessment delivers broader insights into the impacts of processes or value chains, highlighting otherwise overlooked issues. McCord et al. (2021) identify an example of this in gold value chains. Certifiably ‘sustainable’ gold from the Peruvian Highlands was subsequently assessed holistically, revealing large social issues such as organized crime, human trafficking, and underage sex work. Robust sustainability assessment of CDU technologies is a requirement if CO 2 is to realise its potential as a key commodity within circular economies. Favourable economics of capture and utilisation must be verified, while simultaneously ensuring associated environmental impacts are less severe than those of relevant benchmarks, and in a manner that does not jeopardise a socially ‘just-transition’. Independent assessments The publication rate within independent assessment strands gives useful insights to methodology maturity and perceived utility. Web of Science is used to quantify these rates by year between 2000–2021. Review papers are not removed owing to the quantity of publications returned. Searches required either the full assessment name or abbreviation listed as a keyword (e.g., Lifecycle Assessment or LCA). Large bodies of work are seen around each aspect of the triple helix in abstraction. Life Cycle Assessment (LCA), the oldest of the three strands, emerged in the 1960s (Guinée, 2012), generating what would nowadays be considered partial LCAs; following comparative approaches with no broadly accepted methodology (Newman & Styring, 2022). In 2006, ISO released the 14 K series of standards (ISO Technical Committee 207, 2006), introducing a rigorous approach to assessments. Despite further development upon ISO 14 K (European Commission Joint Research Centre Institute for Environment and Sustainability, 2010), CDU specific iterations proved elusive until the Global CO 2 Initiative (GCI) published guidelines specific to the sector in 2018 (Zimmermann, et al., 2018), succeeded by a second iteration in 2022 (Müller, et al., 2022). LCA publications grew from 11% of sustainability assessment publications to 28% between 2000 and 2021 based on the data collected for Figure 3. This is likely explained by growing emphasis on environmental protection seen in the period, owing partially to reports from bodies such as IPCC and the World Meteorological Organisation revealing record high annual and decadal temperatures (World Meteorological Organisation, 2010; IPCC, 2021). International treaties such as the Paris Agreement added additional legislative pressure internationally (United Nations\/Framework Convention on Climate Change, 2015), pushing industry to quantify and reduce their impacts through LCA. FIGURE 3 FIGURE 3. Number of publications listing each independent assessment type or its abbreviation as a keyword, collated by year. Data collected using Web of Science. Techno-economic assessment (TEA) is historically less standardised than LCA, lacking broad consensus on best practice (Zimmermann, et al., 2020; Roh, et al., 2016). This variation in approach delivered assessments based on diverse, and sometimes erroneous, methods and assumptions. However, this did not prevent the publication of large numbers of studies, as shown in Figure 3; likely a consequence of the importance of results within industrial decision making. GCI approached the TEA standardisation problem through the adoption of a now mainstream four phase assessment structure, originally proposed within ISO 14040 (ISO Technical Committee 207, 2006); forming CDU oriented guidelines aligned with those for LCA (Zimmermann, et al., 2018). Within Figure 3, TEA sees a drop in share of sustainability assessment publications, falling from 79% in 2000 to 63% in 2021. The third societal strand, SIA or social-LCA (S-LCA), maintains a 10% share of sustainability assessment publications between 2000–2021; remaining in its infancy when compared to both LCA and TEA (Klöpffer, 2003; Jørgensen, et al., 2007; Traverso, 2018; Huarachi, et al., 2020; Pollok, et al., 2021). This could be attributed to its relatively recent first literature appearance in 1996 (O'Brien, et al., 1996), making it LCA’s junior by approximately 3 decades. Many organisations evaluate and report social impacts using the Global Reporting Initiative (GRI) standards (Stiching Global Reporting Initiative, 2021) or UN Sustainable Development Goals (SDGs) (United Nations, 2015). However, this is typically limited to the assessment of deployed activities, restricting its use around low the TRL processes seen in CDU. The United Nations Environment Programme (UNEP) and the Society of Environmental Toxicology and Chemistry (SETAC) jointly developed general guidelines for SIA. While adopting an ISO derived structure, many discrepancies persisted around more granular procedures, most notably impact characterisation (Newman & Styring, 2022). No standards are present for CDU specific application, leaving a single framework, intended for implementation alongside the GCI’s LCA and TEA guidelines (McCord, et al., 2021). A similar but smaller increase in publication rate can be seen for SIAs from 2012 onwards (Figure 3), reaching one thousand publications in 2021. The pursuit of harmonisation Harmonisation of assessment strands primarily targets the homologation of methodological structure and procedure, resulting in more comparable and reproducible assessments. Such an approach within the field has been called for in numerous papers (Zimmermann & Schomäcker, 2017; McCord, et al., 2021; Wunderlich, et al., 2021), driving increased efforts in the latter half of the 2010s. There has been debate of the relative importance of social, environmental, and economic aspects of decision making in assessing low carbon technologies. While the process should be economically viable (although not necessarily cheaper than the counterfactual petrochemical process), it must be environmentally advantageous, otherwise change becomes unnecessary. If the new process results in detriment to social structure, then it cannot be accepted. The transition to electric vehicles (EVs) is an example. While the move to EVs may seem beneficial at face value, as discussed earlier, there is a fear that the transition will be beyond the reach of low-income groups and so a new social underclass may arise where travel becomes the beyond their means. It is proposed that the order of assessment should be in the sequence of SIA → LCA → TEA with iterative decision making at each stage, arriving at the best outcome. Figure 4 shows the rational decision process that should be employed. FIGURE 4 FIGURE 4. The proposed decision-making process in a triple-helix approach to process development in a circular carbon economy. The most significant step towards harmonisation is the inter-strand adoption of the ISO four phase structure. GCI deliver this for CDU applications through both their LCA and TEA guidelines (Zimmermann, et al., 2018) (Müller, et al., 2022). The GCI TEA guidelines extend to the provision of various characterisation methods for indicators, a first attempt within the strand. SIA, being the least mature of the methodologies, presents numerous barriers to alignment, persisting into UNEP and SETAC’s offering (UNEP, 2020). Where LCA and TEA impact indicators are quantified though the use of characterisation models, these are not yet developed for SIA. Furthermore, the presence of mixed data types is a significant challenge when targeting an objective numerical result. McCord et al. (2021) approached the issue of data handling within the triple helix framework. A method was proposed of quantifying indicators against a practitioner derived scoring scale. While failing to allow for comparisons between assessments owing to differentiated scales, it does enable comparative evaluation within a given study. This facilitates adoption of the ISO pioneered four-phase methodology. When considering the GCI guidelines and triple helix framework, the assessment strands can be considered harmonised in terms of structure and procedure. Additionally, practitioner guidance around setting of system boundaries and application of assumptions has further harmonised assessments within the CDU space. Key pitfalls seen in literature, such as the misconceptions of zero cost hydrogen and surplus green electricity, are also recognised and tackled by GCI. Integrating strands The assessment strands have historically been evaluated in isolation. However, more recently value has been recognised in the development of integrated methodologies, allowing for the parallel evaluation of the strands under a single assessment format. Meaningful integration relies heavily upon the success of precursing harmonisation efforts. If the methodological phases and approaches exhibit large variation, cross-linkages are difficult to establish. Common data inventories should be targeted within integrated frameworks, improving both results quality and required workload. GCI promote the integration of their independent assessment, offering detailed practitioner guidance (McCord, et al., 2018). Methodological decisions are supported, such as the setting of a combined goal and scope, aggregating the components present in the independent strands. Several options for deeper integration are examined, notably through ‘eco-enviro’ indicators. These allow for examination of trade-offs between strands, e.g., cost of CO 2 avoided. With the triple helix largely harmonising SIA to the GCI guidelines, integration can be approached. Common LCA and TEA data inventories can be augmented to include data-points required for social indicators. Deployment of scoring scales as ‘pseudo-characterisation models’ delivers quantitative social impact results, allowing comparison and analysis alongside the LCA and TEA strands. The integrated results handling enables use of both aggregation and MCDA techniques, valuable tools in terms of both decision-making support and communicability. While the foundations for integration are present, several details continue to divide opinion. For example, assessment of competing indicators adds subjectivity to the results. At what point are improved environmental impacts negated by increased OpEx or CapEx? Or balancing high working wages with OpEx? Integration generates multivariate problem spaces that are complex to optimise. While this unavoidably adds subjectivity to the field, it is reflective of the reality of the transition to a sustainable society and industrial ecosystem. State of the art For holistic approaches to sustainability assessment of CDU projects, the triple helix framework is the currently the only CDU focussed holistic sustainability assessment methodology. Its development can be traced back to the ISO standards around which strands are harmonised (Figure 5). Building upon the already tested GCI LCA and TEA guidelines for CDU, a robust methodological core is delivered. Practitioners are supported through decisions that are highly sensitive in CDU applications; examples including functional unit selection, feedstock pricing and CCU system boundaries. Enough flexibility is left to ensure the frameworks applicability to a vast range of CDU projects and scopes, spanning low to high TRLs. FIGURE 5 FIGURE 5. Taxonomy of standards, guidelines, and frameworks leading to a holistic sustainability assessment for CDU applications (Newman & Styring, 2022). McCord et al. (2021) modify the indicators selected by UNEP and SETAC to generate a more CDU specific approach. Several stakeholder groups are dismissed due to irrelevance to CDU technologies. As a result, a more streamlined and practical assessment strand is delivered. Despite this, the practitioner led approach to SIA impact characterisation leads to less robust and reproducible results. As a result, the SIA outlined in the triple helix framework generates a ‘hot spot’ analysis rather than a full assessment. Due to the inherent uncertainties around social impact pathways, it is unlikely a directly comparable approach will be found to the characterisation methods seen in LCA and TEA; therefore, should act as part of a ‘go-no-go’ call for a technology. A primary strength of the approach is its ability to identify burden shifts in three dimensions. When used to inform investment or development effort, it is important that negative impacts are not just optimised to a minimum in a single area; often sustainability requires trade-offs and compromise. With qualitative results present for indicators across all strands, the triple helix is an ideal application for multi-criteria decision analysis (MCDA) which is discussed later. The triple helix framework offers a well harmonised and integrated approach to the holistic sustainability assessment of CDU projects. These key differentiators from alternative methodologies contribute to safeguarding the idea of a ‘just transition’, ensuring progression around sustainability is available to all. Inclusion of the social pillar is key in preventing negative side-effects of environmental sustainability. Application Triple helix-based assessments have many applications within CDU. Validation of proposed circular economies is a significant potential use. Moving industry away from traditional linear economies will require verification that environmental impacts are actually reduced, rather than transposed to another strand. Secondly, novel supply chains must be assessed for economic viability before gaining acceptance by organisations. Green energy use is likely to be a key factor in the adoption of CDU technology. Its strategic utilisation will be necessary as many direct or secondary processes, such as electrolytic H 2 production, require large quantities of energy. Consideration of green energy allocation via a triple helix approach would support its effective use within industrial ecosystems. Suitable application would be characterised by large GHG emission savings relative to benchmarks, low impact to local communities through factors such as access to energy or materials, and sustainable prices per functional unit. Multi criteria analysis making within CDU Multi Criteria Decision Making (MCDM) is a historically rich field, with the first recorded example dating to circa 1,011–931 BC and the biblical story of the ‘Judgement of Solomon’ (Köksalan, et al., 2013). In its more modern analytical sense, MCDM is employed to aid stakeholders in structuring decision making problems, identifying their preferences, and formulating aligned recommendations (Cinelli, et al., 2020). Prior to the rapid methodological developments of the 1960s, industry had used simple additive methods for the evaluation of competing ‘alternatives’, the theory of which was not greatly understood (Fishburn & Lavalle, 1999). CDU as a field is, by definition, attempting to utilise carbon dioxide, combatting the still growing atmospheric concentrations which reached 414.35 ppm in August 2022 (UNEP, 2020), while generating useful commodities. Ambitious climate targets such as the Paris Agreement (United Nations\/Framework Convention on Climate Change, 2015) require that the allocation of capital and R&D efforts be effective. Such complex problems necessitate the careful handling of trade-offs and non-uniform performance metric weightings. With finite capital and time available in the pursuit of climate targets such as the Paris Agreement, technologies must be vetted and their viability confirmed. This CDU oriented application effectively utilises the strengths of MCDM, handling complex trade-offs and multiple stakeholders (Cegan, et al., 2017; Gibari, et al., 2018; Katsikopoulos, et al., 2018; Greco, et al., 2019). Without analytical approaches, decision makers would primarily rely on ‘gut feel’ or similarly unsophisticated methods. Despite introducing subjective value choices, the mathematical nature of MCDM provides a repeatable and justifiable decision-making process; ‘quietening the noise’ generated by criteria that are either unimportant or potentially rectifiable at a later stage. Previous literature reviews have highlighted the significant use of MCDM within environmental subject areas, growing four-fold from ca. 0.2% to ca. 0.8% of the field’s publications between 2000 and 2015 alone (Cegan, et al., 2017). MCDM can greatly enhance the communicability of sustainability assessment results to non-practitioners. Results are often complex to interpret, delivering many indicator scores with incongruent units. While this granularity and specificity is invaluable to environmental scientists, how can they be effectively presented to the public or policymakers? A stakeholder with no LCA or sustainability assessment expertise can more meaningfully interpret results when presented through MCDM, often allowing for the comparison of alternatives in terms of a single score, incorporating all assessed criteria. With policymakers wielding significant influence over the pace at which climate mitigation proceeds, such a communication tool should not be undervalued. Two fundamentally different approaches to MCDM have been precipitated; Multi Objective Decision Making (MODM) and Multi Attribute Decision Making (MADM) (Chen & Hwang, 1992; Zimmermann, 2001; Zavadskas, et al., 2019). MADM methods incorporate four main components: alternatives, criteria, the relative importance of each criterion, and measure of performance of an alternative relative to a particular criterion (Pohekar & Ramachandran, 2004). These approaches target problems that contain a finite set of possible alternatives. Conversely, MODM approaches are suitable when evaluating undefined, or continuous, alternatives; it requires users to characterise constraints in the form of vectors reflecting decision variables (Ribeiro, 1996). Within CCU applications, alternatives represent processes or supply chain structures; consequently, they are finite in number and objectively defined, necessitating the use of MADM approaches. Due to its general inapplicability to the CCU field, MODM will not be considered further within this work. While many MADM methodologies use complex mathematical principles, the overall process can be summarised in Figure 6. FIGURE 6 FIGURE 6. Flow diagram of a typical MCDA application (adapted from (Volkart, et al., 2016)). CDU relevant MADM approaches A literature review of MADM within sustainability assessments focusing on CO 2 and CDU was conducted, aiming to examine current practices and methodological preferences. Web of Science was selected as the bibliographical database. Searches filtered for publication dates between 2015 and 2022, as well as identified keywords. Figure 7 shows the keywords used for each of the four rounds of searching, and the classification of each identified publication. A total of 72 publications were obtained, of which 44 are excluded. The following analysis focusses on the approaches most frequently utilised; for this reason, review papers and novel methodological proposals are excluded. Duplicates and papers with no named methodology are also removed from the process. Finally, relevance of scope is used to exclude those that do not focus on carbon management, CDU, or sustainability assessment. This reveals 28 publications for examination (a table of the literature search results can be found in the Supplementary Material). FIGURE 7 FIGURE 7. Sankey diagram showing the quantity and usage of publications returned by the systematic literature search. Methodologies employed by the included papers were then analysed, tabulating the frequency of use. A small number of papers used hybridised approaches, using part but not all of two or more methods without further modification. In these cases, each of the incorporated methodologies are given credit for usage. The results are shown by Figure 8, with methodologies including; data envelope analysis (DEA) (Charnes, et al., 1978), quality function deployment (QFD) (Akao, 2004), weighted sum model (WSM) (introduced by Fishburn and Lavalle, (1999) and MacCrimmon (1968)), evaluation based on distance from average Solution (EDAS) (Ghorabaee, et al., 2016), stepwise weight assessment ratio analysis (SWARA) (Keršuliene, et al., 2010), complex proportional assessment (COPRAS) (Zavadskas, et al., 1994), decision making trial and evaluation laboratory (DEMATEL) (Fontela & Gabus, 1972), analytic network process (ANP) (Saaty & Vargas, 2013), élimination et choix traduisant la realité (ELECTRE) (Roy, 1968), preference ranking organization method for enrichment of evaluations (PROMETHEE) (Brans & Mareschal, 2005), viekriterijumsko kompromisno rangiranje (VIKOR) (Opricovic & Tzeng, 2004), analytic hierarchy process (AHP) (Saaty, 1980), and technique for order of preference by similarity to ideal solution (TOPSIS) (Hwang & Yoon, 1981). To allow for meaningful analysis and comparisons of methodologies, only those with more than one application case will be examined further; representing 83% of included publications. FIGURE 8 FIGURE 8. Graph to show the frequency in which MCDM methodologies were observed through literature search. AHP and TOPSIS are the clear workhorses of CDU related MADM applications, appearing in 55.8% of publications and approximately three times more frequently than the third most common method. When the distribution in Figure 8 is compared to that in Figure 9, given by Sabaei, et al., 2015, differences are observed. It is noted that Sabaei examined MADM more broadly, choosing not to focus on applications within a specific field. However, this allows for comparison between general and CDU related applications. AHP is a frequent choice in both cases, whereas TOPSIS descends from most common in CDU related work to the least common generally, suggesting possession of characteristics advantageous within this field. Each examined method presents characteristic advantages and disadvantages, supporting rejection of a ‘one size fits all’ MADM approach. General principles, advantages, and disadvantages of each are discussed briefly before comparisons are drawn. FIGURE 9 FIGURE 9. Number of publications for various MADM techniques (Sabaei, et al., 2015). TOPSIS finds ideal solutions based on the closest distance to the positive ideal and farthest distance from the negative ideal. However, the relative importance of these distances is not considered through weighting (Opricovic & Tzeng, 2004; Kuo, 2017). It is capable of handling very large numbers of alternatives with high computational efficiency while possessing a clear and intuitive logic (Roszkowska, 2011). However, the issue of rank reversal is present (Çelikbilek and Tüysüz, 2020); occurring not only when duplicating an alternative, but also when a new alternative is added or an existing alternative is removed (Wang & Luo, 2009). AHP focusses primarily on hierarchical decision problems (Sabaei, et al., 2015), using decision maker value choices to mathematically determine criteria weights through matrices. Through this it allows for finer control and monitoring of decision-making consistency (Saaty, 1986; Saaty, 1994), while facilitating group decision making (Lee, et al., 2013; Tsai, et al., 2013). Due partially to this capability, it is suited to the allocation of resources and business effort (Mu, 2006), problems in which many stakeholders are usually present. Furthermore, it is appropriate for the integration of qualitative data (Saaty, 1977; Sabaei, et al., 2015) using practitioner derived scoring scales. While weighting derivation is a characteristic strength of AHP, it can have significant influence on final scores or recommendations (Baker, et al., 2001), potential mitigation strategies are explored in literature (de Jong, 1984; Marcus & Minc, 1988). Large criteria counts can also cause issues within AHP, effecting both workloads and consistency. AHP includes the calculation of a consistency ratio, quantifying how aligned successive practitioner inputs are; as the number of criteria, and therefore pairwise comparisons increase, it is harder to keep the consistency ratio within the acceptable range (C.R. < 0.1 as prescribed by Saaty, (1987)). The fastest of the MADM approaches, WSM, takes a highly transparent approach to score calculation; simply summing the product of criteria values and weights for each alternative. However, this simplicity results in several limitations. One of the most impactful is a failure to define interrelations between criteria (Franek & Kashi, 2014); reducing the techniques efficacy in complex decision-making contexts in which the balancing of conflicts is often necessary. Such straightforward aggregation can lead to identical objective vectors for significantly different criteria weightings (Khan & Rehman, 2013), limiting the granularity of possible insights. Additionally, small variations in weightings often cause a change in the recommended alternative, usually requiring a compensatory sensitivity analysis. VIKOR handles large numbers of alternatives, a desirable quality in many applications. The methodology is conceptually intuitive (Siregar, et al., 2017), however, the procedure often results in erroneous alternative rankings due to flawed calculation methods for the maximum group utility and the minimum individual regret of the opponent (Tzeng & Liu, 2009). Another shortcoming is revealed in criteria weighting determination, requiring hybridisation with other techniques for accurate and stable results (Wibawa, et al., 2019). PROMETHEE is characterised by the expression of user preference functions, used to generate a partial (PROMETHEE I) or full ranking (PROMETHEE II) of alternatives (Abdullah, et al., 2019). Requiring few user inputs compared to other prominent methodologies (Macharis, et al., 2004), PROMETHEE reduces workloads and potential for bias. There is also no requirement for normalisation of alternatives’ criteria scores (Sabaei, et al., 2015), this step being included within the base methodology. Despite these advantages, the approach often exhibits loss of data or resolution if used to generate complete rankings (Macharis, et al., 2004), reducing the utility of any outputs. PROMETHEE also suffers from rank reversal phenomena (De Keyser & Peeters, 1996), a trait shared with TOPSIS. Finally, the ELECTRE family comprises of seven sub-methodologies are present (ELECTRE I, ELECTRE Iv, ELECTRE IS, ELECTRE II, ELECTRE III, ELECTRE IV, ELECTRE TRI) (Roy, 1991; Yu, et al., 2018), tailoring the approach to different problem types. ELECTRE I and ELECTRE III are the most applicable around CDU and sustainability assessment, tacking selection and ranking problems respectively. The methods allow for the prescription of ‘veto’ criteria, serving to remove undesirable alternatives (Sahaaya Arul Mary & Suganya, 2016). However, resulting rankings depend on the size of this threshold, for which there exists no ‘correct’ value (Sabaei, et al., 2015). Literature also reports significant workload requirements (Akmaludin, et al., 2020), explaining the limited use (Figure 8). Key attributes associated with MADM selection have been identified. Table 2 compares the performance of examined methodologies against these attributes. Both references and further methodological advantages and disadvantages can be found in the Supplementary Material. All methodologies are seen to cater to a broad variety of scopes, while remaining applicable to cases containing large numbers of alternatives. Beyond this, the methodologies exhibit often significant divergences. As stated by others, there is no perfect MADM methodology, with selection requires on a case-by-case basis (Guarini, et al., 2018); the approach chosen can influence study outputs an introduce bias. Additionally, data availability influences the selection of methodology as explored by Sabaei, et al. (2015). TABLE 2 TABLE 2. MADM methodologies and associated attributes. Of the methodologies seen frequently in the literature search, only AHP includes a robust approach to weighting derivation. This represents a significant flaw in other methods as human perception and logic of prioritisation is prone to errors when more than four criteria are present (Saaty, 1994). Consequently, additional work is required to determine meaningful weightings, often involving hybridisation. Through this integrated weighting procedure, AHP is the only method to track the consistency of user value-choices, safeguarding against conflicting inputs. While AHP mathematically determines weightings, it is not suited to problems with large numbers of criteria; a consequence of its pair-wise comparison approach. In a comparison matrix with n criteria present, n 2 − n 2 independent pairwise comparisons are required. This sizable workload requires either a limited criteria count or more complex hierarchical structure, both effectively lowering the number of comparisons. Utilisation of the hierarchical approach also offers significant support in structuring complex problems. This includes those seen in CDU sustainability assessment application, a potential explanation for its widespread adoption. Both AHP and WSM also fail to handle problems with different criteria scoring directionality. This is facilitated in the other methodologies through matrix normalisation steps that account for either beneficial or non-beneficial criteria. While this is inconvenient in many contexts, the issue can be overcome through the addition of a normalisation step using either utility curves or linear scaling. Implementation within CDU problems Each MADM approach has specific advantages and disadvantages. When seeking the best method for a given field or problem type, these must be considered both in isolation and in hybridised forms. Hybridisation likely offers the best approach, retaining strengths while resolving weaknesses. Such approaches can be seen throughout literature with many different technique combinations (Zavadskas, et al., 2016). The first appeared in 1999 (Mesghouni, et al., 1999), with the term Hybrid Multi Criteria Decision Making being coined by Shyur & Shih, (2006). To identify suitable methodologies, the requirements of the application must be defined. For use in CDU oriented sustainability assessment, the following factors are determined as important: • Systematic and repeatable criteria weighting procedure • User value choice consistency checking to prevent conflicting preference prescription • Transparency of calculations • Applicability to problems with many criteria • Satisfactory computational and workload efficiency After identifying these requirements, the assessed methods can be examined for suitability. AHP and TOPSIS appear ideal for hybrid application; perhaps unsurprisingly given their combined 55.8% prevalence in the earlier systematic literature search. Arslan, et al. previously reviewed the hybridization of these two methodologies, determining that their integration produces a more powerful and effective decision-making tool (Arslan, et al., 2021). This approach will now be examined further in the context of CDU applications. As noted by Chauvy, et al. (2020) AHP, developed by Saaty, (1980), already appears within environmental decision making, consistently being noted as a common technique in the area (Baumann, et al., 2019; Martins, et al., 2020). Additionally, it is the only methodology that can fulfil the first two requirements laid out for this application: systematic and repeatable criteria weighting, and user value choice consistency checking. Furthermore, the approach’s tiered hierarchical structure aligns well with the needs of McCord, et al.‘s Triple helix framework (McCord, et al., 2021); alleviating the pairwise comparison workloads associated with high criteria counts. In addition, this approach would allow for application of a zero weighting to one or two entire strands; instead delivering a double or single stranded assessment. This is represented in a three-tier configuration by Figure 10 (analogous to the approach taken by Chauvy, et al. (2020). FIGURE 10 FIGURE 10. Tiered AHP structure (based on that described by Chauvy, et al. (2020)). S i represent assessment strands. The number of pairwise comparisons required for both global and tiered AHP approaches can be derived Equations (1) and (2) respectively. Eq. 1 - Calculation for the number of pairwise comparisons required for a global AHP approach. Where C is the number of criteria assessed. C 2 − C 2 = p a i r w i s e c o m p a r i o n s g l o b a l ( 1 ) Eq. 2 - Calculation for the number of pairwise comparisons required for a tiered AHP approach. Where S is the number of strands employed, and C is the number of criteria assessed. (Assuming criteria are distributed evenly between strands). S C S 2 − C S 2 + S 2 − S 2 = p a i r w i s e c o m p a r i s o n s t i e r e d ( 2 ) If calculated across varying total criteria counts, the difference in pairwise comparisons and workload can be seen visually (Figure 11). As the number of criteria assessed increases, the required pairwise comparisons diverge; consequently, efficiency increases with assessment granularity. For example, studies evaluating 18 criteria experience a 68.63% reduction in practitioner workload when using a tiered approach. With many assessments needed to evaluate growing numbers of emerging CDU technologies, an efficient methodology will prove invaluable. FIGURE 11 FIGURE 11. Evaluation of pairwise comparisons required for the implementation of AHP in tiered and global structures and criteria count increases (based on application to the triple helix framework (McCord, et al., 2021) with three AHP sub-tiers and an even indicator distribution). Percentage workload is overlaid using a secondary axis. Once criteria weights have been determined using AHP, the outputs can be fed directly into TOPSIS in order to generate a ranking order of the available alternatives. This hybridisation strategy eliminates the weaknesses of both methodologies; the aggregation, scoring scale directionality, and ranking within AHP, and the weighting derivation within TOPSIS. Furthermore, TOPSIS is capable of handling very large numbers of alternatives with high computational efficiency while possessing a clear and intuitive logic (Roszkowska, 2011), facilitating more detailed assessments. This delivers a strong foundation for applications such as technology or supply chain selection, in which many structural permutations are present. However, the issue of rank reversal persists (Çelikbilek and Tüysüz, 2020). To combat this, sensitivity analysis is recommended to verify the stability of generated results. When qualitative data is presented, such as that seen in most social impact assessments, a five or nine-point scale should be used for the assignment of quantitative values within the TOPSIS decision matrix. This is prescribed to achieve better differentiation between alternatives, as suggested by McCord et al. (2021) within the triple helix framework. Once the decision matrix is created, vector normalisation is carried out by criterion using Eq. (3). Eq. 3 - Vector normalisation procedure for alternative criteria scores. Where n is the number of alternatives examined. X ¯ = X i j ∑ J = 1 n X i j 2 2 ( 3 ) The standard TOPSIS methodology can then be applied as developed by Hwang & Yoon, (1981). For each criterion the best and worst scores are identified, V j + and V j − respectively. Using these the Euclidian distance from best (S i +) and worst (S i −) performance values can be calculated for each alternative. Eq. 4 - Calculation of the Euclidean distance from the ideal best performance S i + = ∑ j = 1 m V i j − V j + 2 0.5 ( 4 ) Eq. 5 - Calculation of the Euclidean distance from the ideal worst performance S i − = ∑ j = 1 m V i j − V j − 2 0.5 ( 5 ) The performance score for each alternative, accounting for all criteria, can then be evaluated. This provides the basis on which the alternatives are ranked. Opricovic (developer of VIKOR) and Teng suggest that the efficacy of TOPSIS may be improved by allowing the user to weight the importance of the Euclidean distance from the deal best and worst scenarios (Opricovic & Tzeng, 2004). This would allow for more problem specific application of both independent and hybridised TOPSIS. However, for a majority of problems and observed uses, including those with CDU focusses, the standard equal weighting approach is deemed satisfactory. Eq. 6 - Calculation of the alternatives’ performance score P i = S i − S i + + S i − ( 6 ) Fiduciary duty in the carbon economy The transition from a linear to circular economy will not be without problems. The need to defossilise power and industry has been addressed in different policies over a number of decades. Carbon capture and storage, or in reality landfill, has been considered to be the best way to mitigate against CO 2 emissions, however it has made little progress. Initial development will need incentivisation or subsidies, most likely from governments, so due diligence must be exercised to ensure correct decisions are being made. There is a fiduciary duty that is incumbent on any individual or organisation to ensure investments are used wisely. Fiduciary duties are owed when someone “has undertaken to act for or on behalf of another in a particular matter in circumstances which give rise to a relationship of trust and confidence”. This highlights an interesting feature of due diligence in respect of government funding to environmental projects. A government acts on behalf of the people, the electorate, to ensure public funds are used wisely and that they are trusted to do so in a financially, and especially fiscally sound manner. As an example the case for carbon capture and storage in the UK is considered. In recent years there have been a number of competitions where projects competed for money to finance CCS projects. This was originally mooted by the Labour Government headed by Prime Minister Blair. However, despite the first project in Peterhead, Scotland being announced in 2007 it was subsequently cancelled in 2011. A second project was announced in 2012 and then cancelled in 2016 (BEIS, 2017) after a statement to the London Stock Exchange by Chancellor Osborn in 2015. The fiduciary duty of the government was then declared by Prime Minister Cameron in the House of Commons in a reply to a Parliamentary question asking why the latter project had been cancelled. Cameron (2016) said: “You have to make decisions about technology that works and technology that is not working. We are spending the money on innovation, on energy storage, on small nuclear reactors, and on other things such as energy heat systems for local communities that will make a difference. To govern is to choose, and we made the right choice”. This clearly articulates that the government did not have confidence in the technology to be used and that in light of this it would not be responsible to continue to fund the project from the public purse. The government was clearly exercising its fiduciary duty. However, in 2021 the government of then Prime Minister Johnson announced a new competition to do CCUS in 20 projects at existing clusters. These were typically using existing amine technology. So, what had changed in the intervening period? Alarmingly very little. The projects are still reliant on amine capture and storage via pipeline to the North Sea. Despite the call looking at CCUS (Mission Innovation, 2018), the U or utilisation part is largely absent. Behavioural change as a driver towards a circular economy Similarities between resource security, energy security and food security demonstrate the need for a whole systems approach as there are considerable inter-dependencies. Typically, government industrial resource strategies across the world look at cost and GHG mitigation as primary drivers to enable supply chain stability and maintain an acceptable standard of living. However, in the case of the United Kingdom, the BEIS Areas of Research Interest do not identify the chemicals industries as a priority (BEIS, 2020). These concentrate on the economy, climate change and decarbonisation of energy systems particularly but fail to tackle the ever-increasing demand on materials. The result is that a linear supply chain and economy are perpetuated, meaning more fossil carbon is needed to supply demand. This is driven by growing consumerism and a dependency on carbon in a disposable asset society. To reduce fossil dependence, several approaches to this problem should be addressed. Switching to renewable carbon assets is a primary driver but behavioural change should be developed and embedded in society. Energy is the crux of the problem: as well as heat and power being energy, so are materials and chemicals, and so is food. As way of an analogy, during World War Two, allotments were of upmost importance during a period of rationing which was in place for over a decade. “Dig for victory” propaganda is strikingly appropriate today, for tackling carbon security. The strategy encouraged citizens to “dig in”, to use resources sparingly and where possible create their own. In the case of current energy issues, UK government broadcasts encouraged people to reduce the thermostat temperature, to use heating sparingly, and while not necessarily producing their own energy, encouraging them to insulate their homes to preserve energy. However, there has been little effort to promote materials security as these concepts are largely decoupled from energy considerations. Populations of many countries have become increasingly aware of the challenges of energy at affordable costs and recent global events have added to this, leading to the fear of blackout and food shortages in the United Kingdom. This can be attributed to multiple variables, including the need to limit global temperatures to 1.5°C, increasing industrial action, growing civil unrest, and the war in Ukraine. Whilst not in a World War, it could be said that society is at war with the world and that a multi-levelled, multi-disciplined approach to creating a sustainable energy is required, and consequently sustainable chemicals, that do not negatively impact those already suffering from energy insecurity. The idea of energy rationing as a driver for a more sustainable society has been proposed. While the French government is reluctant to commit to energy rationing in the near future, Germany has suggested that energy rationing may be needed over the coming winters. Households and other protected communities (care and health) would be exempted under German law but there would be serious implications for industry and in particular the chemicals supply chain (Guardian, 2022). The German energy regulator (BNA) have suggested that natural gas use may need to be reduced by 20% in 2022 to avoid rationing over the winter of 2022–3 (Financial Times, 2022) and measures are being put in place to prepare for emergency gas rationing (Bloomberg, 2022). In the UK, Climate Minister Graham Start indicated that blackouts could be possible over winter over peak periods which will affect industrial and domestic users (Sky News, 2022). Such measures may encourage a better long-term use of energy across the chemicals sector, by improving process design and intensification. However, care must be taken to ensure that a drift back to less sustainable operation does not occur. Consumers need to be redefined as Custodians to achieve carbon circularity. As such they would then hold more power, and if they choose, could change how they approach energy and chemicals supply systems. Social behavioural change is difficult to enact as individual actors in civil society have their own autonomy and priorities, so governance is needed that is effective, efficient, and equitable. Current policies are not. Most energy policies still promote a linear approach to energy and therefore materials use. Policies need to be developed and enacted that promote the reuse of carbon in sustainable systems. These ambitions cannot be achieved without considering external factors that can impact specific areas. Chemicals production policy has been idealised and politicised to the extent it is difficult to reach the standards needed for a sustainable system, such as those defined within the Science Based Targets Initiative. An energy-rationed economy would lead subsequently to a materials-rationed economy. This may be seen by many as a retrograde step but may equally be perceived as a behavioural re-set. When rationing is effective, essentials are not forsaken, rather consumerism is scaled back. As such our expectations will become reduced society will adapt to a moderated and more circular approach to life. After the Second World War there was an attitude of ‘mend and make do’. This is one of the tenets of a circular economy as shown in Figure 12 which gives a proposed hierarchal approach to chemical circularity from a supply chain perspective. Dig for Victory could equally be described as ‘recycle for victory’. FIGURE 12 FIGURE 12. A circular approach to chemicals manufacture using CCU as a carbon vector. In this representation fossil carbon has been avoided and is so eliminated. In Figure 12, the thick black arrows represent a linear economic approach where carbon enters the supply chain, is consumed and is then either emitted or sent for storage (CCS) where this is available. To embrace a circular approach that carbon must stay within the supply chain so that no new fossil carbon enters in an ideal situation, using CCU (thick green arrow). It may be that using the traditional linear process chemistry approaches is not possible in a circular economy. Therefore, new chemical transformations and processes may be needed through Re-design to achieve the objectives. While rationing may give a short-term mitigation potential in the climate change emergency it is always possible that once the energy crisis is resolved there will be a bounce back once there is respite. A similar response in GHG emissions was observed post-covid lockdowns when emissions reductions observed during the pandemic quickly reversed once ‘normality’ was restored. The difference with a transition to a circular chemical economy needs to be considered in the short-medium and long-term. Benefits of a circular economy using CO 2 need to be evidenced using a multi-faceted approach, especially if industry is to invest in the capital infrastructure to facilitate it. When looking at the problem from a triple helix perspective (McCord et al., 2021), a methodology needs to be embedded in product development in which data are collected at each stage of the decision-making process and that there is iterative feedback to ensure the best outcome scenarios. The United Nations (2019), cited in Dobson et al. (2020) has predicted that, by 2050, 90% of the UK population will live in urban areas, so it is important to consider the supply chain implications when manufacturing is de-urbanised, but the workforce is not. Serious consideration is therefore needed in designing systems within potential national chemicals production policies. Distributed energy and chemicals production specifically around urban populated areas, would be beneficial for, not only the environment but also for greater commodities provisions. Conclusion This Perspectives Paper discusses areas of carbon dioxide utilisation that are often considered in isolation rather than within a whole system. While TEA is often reoorted in terms of the CCU process it is rarely considered over the whole system and concentrates primarily on financial rather than fiscal aspects and does not consider the role of fiduciary duty within a policy framework. Likewise, social impact is often an afterthought, whereas here it is considered within an iterative decision-making process. The aim of this article is to encourage practitioners of CCU to think of all consequences during the analysis of CCU Technology development. There is an urgency to address the climate emergency in terms of not only energy but also materials and chemicals production and use. There is a need to move from a linear to a circular carbon economy, using nth-generation recycled carbon in the production of value-added materials. This needs to be achieved within the acceptable bounds of social, environmental and economic responsibility that does not create social underclasses (Styring et al., 2021) or energy and material poverty. Governments need to apply the principles of fiduciary duty to ensure that public money is invested wisely in technology development and implementation. In all aspects of future living, a new sense of responsibility of individuals and groups is required to ensure equity in society. We need to move away from considering ourselves as consumers of carbon (as well as other chemicals) to becoming custodians of carbon: protecting it as a resource for future generations as well as also protecting the environment and quality of life. Data availability statement The original contributions presented in the study are included in the article\/Supplementary Material, further inquiries can be directed to the corresponding author. Author contributions Each author contributed original content to the paper, including original ideas and manuscript preparation. Each was involved in the review of the final document. PS was additionally research supervisor and Principal Investigator on the research projects. Funding We are grateful the UKRI Engineering and Physical Sciences Research Council (EPSRC) for funding to PS under the UKRI Interdisciplinary Centre for Circular Chemical Economy award (EP\/V011863\/1) and to PS and GD under the SUSTAIN Manufacturing Hub award (EP\/S018107\/1). AN and EP are funded under PhD Scholarships from a Strategic Partnership with Unilever. HH-S was an undergraduate student at the University of Sheffield and was unfunded. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https:\/\/www.frontiersin.org\/articles\/10.3389\/fenrg.2023.1124072\/full#supplementary-material References Abdullah, L., Chan, W., and Afshari, A. (2019). Application of PROMETHEE method for green supplier selection: A comparative result based on preference functions. J. Industrial Eng. Int. 15, 271–285. doi:10.1007\/s40092-018-0289-z CrossRef Full Text | Google Scholar Akao, Y. (2004). Quality function deployment (QFD): Integrating customer requirements into product design. 1st ed. New York, NY: Productivity Press. Google Scholar Akmaludin, A., Hartati, T., Purwanto, H., Sukendar, T., Latifah, F., and Septiana, L. (2020). The best selection of programmers in generation 4.0 using AHP and ELECTRE elimination methods. J. Phys. Conf. Ser. 1477, 032001. doi:10.1088\/1742-6596\/1477\/3\/032001 CrossRef Full Text | Google Scholar Aresta, M., Dibenedetto, A., and Angelini, A. (2013). The changing paradigm in CO 2 utilization. J. CO 2 Util. 3, 65–73. doi:10.1016\/j.jcou.2013.08.001 CrossRef Full Text | Google Scholar Baker, D., Bridges, D., Hunter, R., Johnson, G., Krupa, J., Murphy, J., et al. (2001). Guidebook to decision-making methods. Washington, D.C: U.S. Department of Energy. Google Scholar Barrow, M., Buckley, B., Caldicott, T., Cumberlege, T., Hsu, J., Kaufmann, S., et al. (2013). Technical Guidance for scope 3 emissions (version 1.0) greenhouse gas protocol. Washington D.C., USA: World Resources Institute. Google Scholar Baumann, M., Weil, M., Peters, J. F., Chibeles-Martins, N., and Moniz, A. B. (2019). A review of multi-criteria decision-making approaches for evaluating energy storage systems for grid applications. Renew. Sustain. Energy Rev. 107, 516–534. doi:10.1016\/j.rser.2019.02.016 CrossRef Full Text | Google Scholar BEIS (2020). BEIS areas of research interest: Interim update 2020. Available at: https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/862777\/beis-areas-research-interest-interim-update-2020.pdf (Accessed December 07, 2022). Google Scholar BEIS (2017). Carbon capture usage and storage: Third time lucky? Available at: https:\/\/publications.parliament.uk\/pa\/cm201719\/cmselect\/cmbeis\/1094\/1094.pdf. Google Scholar Biron, M. (2020). A practical guide to plastics sustainability. Amsterdam, Netherlands: Elsevier. Google Scholar Brans, J.-P., and Mareschal, B. (2005). “Promethee methods,” in Multiple criteria decision analysis: State of the art surveys. Editors J. R. Figueira, S. Greco, and M. Ehrogott (New York, NY: Springer), 163–168. Google Scholar Cameron, D. (2016). Hansard UK parliament, transcript on the debate surrounding the Paris climate conference, volume 604. Debated on Thursday 7 January 2016. Available at: https:\/\/hansard.parliament.uk\/Commons\/2016-01-07\/debates\/16010722000015\/ParisClimateConference?highlight=carbon%20capture%20storage#contribution- 16010722000056 (Accessed November 22, 2022). Google Scholar Cegan, J. C., Filion, A. M., Keisler, J. M., and Linkov, I. (2017). Trends and applications of multi-criteria decision analysis in environmental sciences: Literature review. Environ. Syst. Decis. 37, 123–133. doi:10.1007\/s10669-017-9642-9 CrossRef Full Text | Google Scholar Çelikbilek, Y., and Tüysüz, F. (2020). An in-depth review of theory of the TOPSIS method: An experimental analysis. J. Manag. Anal. 7 (2), 281–300. doi:10.1080\/23270012.2020.1748528 CrossRef Full Text | Google Scholar Charnes, A., Cooper, W. W., and Rhodes, E. (1978). Measuring the efficiency of decision making units. Eur. J. Operational Res. 2 (16), 429–444. doi:10.1016\/0377-2217(78)90138-8 CrossRef Full Text | Google Scholar Chauvy, R., Lepore, R., Fortemps, P., and De Weireld, G. (2020). Comparison of multi-criteria decision-analysis methods for selecting carbon dioxide utilization products. Sustain. Prod. Consum. 24, 194–210. doi:10.1016\/j.spc.2020.07.002 CrossRef Full Text | Google Scholar Chen, S.-J., and Hwang, C.-L. (1992). Fuzzy multiple attribute decision making. Heidelberg: Springer. Google Scholar Choptiany, J. M. H., Pelot, R., and Sherren, K. (2014). An interdisciplinary perspective on carbon capture and storage assessment methods. J. Industrial Ecol. 18 (3), 445–458. doi:10.1111\/jiec.12121 CrossRef Full Text | Google Scholar Cinelli, M., Kadziński, M., Gonzales, M., and Słowiński, R. (2020). How to support the application of multiple criteria decision analysis? Let us start with a comprehensive taxonomy. Omega 96, 102261. doi:10.1016\/j.omega.2020.102261 CrossRef Full Text | Google Scholar Circular Computing (2021). What is the carbon footprint of a laptop? Available at: https:\/\/circularcomputing.com\/news\/carbon-footprint-laptop\/(Accessed 11 24, 2022). Google Scholar Cox, S., Gagnon, P., Stout, S., Zinaman, O., Watson, A., and Hotchkiss, E. (2016). Distributed Generation to support development-focused climate action. Golden, United States: National Renewable Energy Lab. (NREL\/TP-6A20-66597): 30. Google Scholar de Jong, P. (1984). A statistical approach to Saaty’s scaling method for priorities. J. Math. Psychol. 28 (4), 467–478. doi:10.1016\/0022-2496(84)90013-0 CrossRef Full Text | Google Scholar De Keyser, W., and Peeters, P. (1996). A note on the use of PROMETHEE multicriteria methods. Eur. J. Operational Res. 89 (3), 457–461. doi:10.1016\/0377-2217(94)00307-6 CrossRef Full Text | Google Scholar Dobson, M. C., Edmondson, J. L., and Warren, P. H. (2020). Urban food cultivation in the United Kingdom: Quantifying loss of allotment land and identifying potential for restoration. Landsc. Urban Plan. 199, 103803. doi:10.1016\/j.landurbplan.2020.103803 CrossRef Full Text | Google Scholar Dowson, G. R. M., Reed, D. G., Bellas, J.-M., Charalambous, C., and Styring, P. (2016). Fast and selective separation of carbon dioxide from dilute streams by pressure swing adsorption using solid ionic liquids. Faraday Discuss. 192, 511–527. doi:10.1039\/C6FD00035E PubMed Abstract | CrossRef Full Text | Google Scholar Dowson, G. R. M., and Strying, P. (2017). Demonstration of CO 2 conversion to synthetic transport fuel at flue gas concentrations. Front. Energy Res. 5, 26. doi:10.3389\/fenrg.2017.00026 CrossRef Full Text | Google Scholar European Commission Joint Research Centre Institute for Environment and Sustainability (2010). International reference life cycle data system (ILCD) handbook - general guide for life cycle assessment - detailed guidance. Luxembourg: Publications Office of the European Union. Google Scholar European Environment Agency (2008). Electric vehicles from life cycle and circular economy perspectives TERM 2018: Transport and Environment Reporting Mechanism (TERM) report. Luxembourg: Publications Office of the European Union. Google Scholar Feliciano-Bruzual, C. (2014). Charcoal injection in blast furnaces (Bio-PCI): CO 2 reduction potential and economic prospects. J. Mat. Res. Technol. 3, 233–243. doi:10.1016\/j.jmrt.2014.06.001 CrossRef Full Text | Google Scholar Financial Times (2022). Financial times. Available at: www.ft.com\/content\/ca215782-a3ba-4a85-997d-197769275a50 (Accessed December 07, 2022). Google Scholar Fontela, E., and Gabus, A. (1972). World problems an invitation to further thought within the framework of DEMATEL. Geneva: Battelle Geneva Research Centre. Google Scholar Franek, J., and Kashi, K. (2014). A review and critique of MADM methods and applications in business and management. Int. J. Anal. Hierarchy Process 6. doi:10.13033\/ijahp.v6i2.254 CrossRef Full Text | Google Scholar Gallego-Schmid, A., Chen, H. M., Sharmina, M., and Mendoza, J. M. F. (2020). Links between circular economy and climate change mitigation in the built environment. J. Clean. Prod. 260, 121115. doi:10.1016\/j.jclepro.2020.121115 CrossRef Full Text | Google Scholar Ghorabaee, M. K., Zavadskas, E. K., Olfat, L., and Turskis, Z. (2016). Multi-criteria inventory classification using a new method of evaluation based on distance from average solution (EDAS). Informatica 26 (3), 435–451. Google Scholar Greco, S., Ishizaka, A., Tasiou, M., and Torrisi, G. (2019). On the methodological framework of composite indices: A review of the issues of weighting, aggregation, and robustness. Soc. Indic. Res. 141, 61–94. doi:10.1007\/s11205-017-1832-9 CrossRef Full Text | Google Scholar Guarini, M. R., Battisti, F., and Chiovitti, A. (2018). Public initiatives of settlement transformation: A theoretical-methodological approach to selecting tools of multi-criteria decision analysis. Buildings 8 (1), 1. doi:10.3390\/buildings8010001) CrossRef Full Text | Google Scholar Guinée, J. B. (2012). Lifecycle assessment: Past, present and future. Nantes, France: International Symposium on Lifecycle Assessment and Construction. Google Scholar Han, X., Yang, Z., Wang, M., Tjong, J., and Zheng, M. (2017). Clean combustion of n-butanol as a next generation biofuel for diesel engines. Appl. Energy 198, 347–359. doi:10.1016\/j.apenergy.2016.12.059 CrossRef Full Text | Google Scholar Huarachi, D. A. R., Piekarski, C. M., Puglieri, F. M., and de Francisco, A. C. (2020). Past and future of social life cycle assessment: Historical evolution and research trends. J. Clean. Prod. 264, 1–12. doi:10.1016\/j.jclepro.2020.121506 CrossRef Full Text | Google Scholar Hwang, C. L., and Yoon, K. (1981). Multiple attribute decision making: Methods and applications. New York, NY: Springer-Verlag. Google Scholar IPCC (2021). Climate change 2021: The physical science basis. Contribution of working group I to the sixth assessment report of the intergovernmental panel on climate change. Cambridge, United Kingdom and New York, NY, USA: Cambridge University Press. doi:10.1017\/9781009157896 CrossRef Full Text | Google Scholar ISO Technical Committee 207 (2006). ISO14040:2006 Environmental management - lifecycle assessment - principles and framework. Geneva, Switzerland: International Standards Organisation. Google Scholar Jørgensen, A., Le Bocq, A., Nazarkina, L., and Hauschild, M. Z. (2007). Methodologies for social life cycle assessment. Int. J. Life Cycle Assess. 13 (2), 96–103. doi:10.1065\/lca2007.11.367 CrossRef Full Text | Google Scholar Katsikopoulos, K. V., Durbach, I. N., and Stewart, J. T. (2018). When should we use simple decision models? A synthesis of various research strands. Omega 81, 17–25. doi:10.1016\/j.omega.2017.09.005 CrossRef Full Text | Google Scholar Keršuliene, V., Zavadskas, E. K., and Turskis, Z. (2010). Selection of rational dispute resolution method by applying new step-wise weight assessment ratio analysis (Swara). J. Bus. Econ. Manag. 11, 243–258. doi:10.3846\/jbem.2010.12 CrossRef Full Text | Google Scholar Khan, S. A., and Rehman, S. (2013). Iterative non-deterministic algorithms in on-shore wind farm design: A brief survey. Renew. Sustain. Energy Rev. 19, 370–384. doi:10.1016\/j.rser.2012.11.040 CrossRef Full Text | Google Scholar Kloepffer, W. (2008). Life cycle sustainability assessment of products. Int. J. Life Cycle Ass. 13 (2), 89–95. doi:10.1065\/lca2008.02.376 CrossRef Full Text | Google Scholar Köksalan, M., Wallenius, J., and Zionts, S. (2013). An early history of multiple criteria decision making. J. Multi Criteria Decis. Analysis 20, 87–94. doi:10.1002\/mcda.1481 CrossRef Full Text | Google Scholar Koohi-Fayegh, S., and Rosen, M. A. (2020). A review of energy storage types, applications and recent developments. J. Energy Storage 27, 101047. doi:10.1016\/j.est.2019.101047 CrossRef Full Text | Google Scholar Kuo, T. (2017). A modified TOPSIS with a different ranking index. Eur. J. Operational Res. 260, 152–160. doi:10.1016\/j.ejor.2016.11.052 CrossRef Full Text | Google Scholar Lackner, K. S. (2013). The thermodynamics of direct air capture of carbon dioxide. Energy 50, 38–46. doi:10.1016\/j.energy.2012.09.012 CrossRef Full Text | Google Scholar Lansink, A. (2018). Challenging changes–connecting waste hierarchy and circular economy. Waste Manag. Res, J. a Sustain. Circular Econ. 36, 872. doi:10.1177\/0734242x18795600 CrossRef Full Text | Google Scholar Macharis, C., Springael, J., De Brucker, K., and Verbeke, A. (2004). PROMETHEE and AHP: The design of operational synergies in multicriteria analysis. Eur. J. Operational Res. 153, 307–317. doi:10.1016\/s0377-2217(03)00153-x CrossRef Full Text | Google Scholar Marcus, M., and Minc, H. (1988). Introduction to linear algebra. New York, NY: Dover. Google Scholar Martins, I. D., Moreas, F. F., Távora, G., Soares, H. L. F., Infante, C. E., Arruda, E. F., et al. (2020). A review of the multicriteria decision analysis applied to oil and gas decommissioning problems. Ocean. Coast. Manag. 184, 1–20. doi:10.1016\/j.ocecoaman.2019.105000 PubMed Abstract | CrossRef Full Text | Google Scholar McCord, S., Zaragoza, A. V., Langhorst, T., Strunge, T., Cremonese, L., Schomäcker, R., et al. (2018). “Part E: Integrated TEA & LCA guidelines,” in Techno-economic assessment & life cycle assessment guidelines for CO 2 utilization (version 2) (Ann Arbor: Global C O 2 Initiative), 255–301. Google Scholar McQueen, N., Gomes, K. V., McCormick, C., Blumanthal, K., Pisciotta, M., and Wilcox, J. (2021). A review of direct air capture (DAC): Scaling up commercial technologies and innovating for the future. Prog. Energy 3, 032001. doi:10.1088\/2516-1083\/abf1ce CrossRef Full Text | Google Scholar Meinrenken, C. J., Chen, D., Esparza, R. A., Lyer, V., Paridis, S. P., Prasad, A., et al. (2020). Carbon emissions embodied in product value chains and the role of Life Cycle Assessment in curbing them. Nature 10, 6184. doi:10.1038\/s41598-020-62030-x PubMed Abstract | CrossRef Full Text | Google Scholar Meng, H., Mi, J., Guo, M., Wu, H., Lv, L., Yun, J., et al. (2021). A highly efficient and stable composite of polyacrylate and metal organic framework prepared by interface engineering for direct air capture. ACS Appl. Mat. Inter. 13, 21775–21785. doi:10.1021\/acsami.1c03661 CrossRef Full Text | Google Scholar Mission Innovation (2018). Accelerating breakthrough innovation in carbon capture, utilization, and storage. US Department of energy, Office of Fossil Energy and Carbon Management, Available at: www.energy.gov\/fecm\/downloads\/accelerating-breakthrough-innovation-carbon-capture-utilization-and-storage. Google Scholar Mu, E. (2006). A unified framework for site selection and business forecasting using ANP. J. Syst. Sci. Syst. Eng. 15, 178–188. doi:10.1007\/s11518-006-5006-6 CrossRef Full Text | Google Scholar Müller, L., Langhorst, T., Kätelhön, A., Bachmann, M., Sternberg, A., and Bardow, A. (2022). Part C: LCA guidelines, techno-economic assessment & life cycle assessment Guidelines for CO 2 utilization (version 2). Ann Arbor, Michigan: CO2Chem Media and Publishing Ltd, 133–188. Google Scholar Nagasawa, H., Yamasaki, A., Iizuka, A., Kumagai, K., and Yanagisawa, Y. (2009). A new recovery process of carbon dioxide from alkaline carbonate solution via electrodialysis. AIChE J. 55, 3286–3293. doi:10.1002\/aic.11907 CrossRef Full Text | Google Scholar Nakagaki, T. (2021). Fundamentals of thermal and nuclear power generation, 5- issues in power generation and future prospects. Tokyo, Japan: JSME, 275–288. CrossRef Full Text | Google Scholar Newman, A. J. K., and Styring, P. (2022). The pursuit of methodological harmonization within the holistic sustainability assessment of CCU projects: A history and critical review. Front. Sustain. 3. doi:10.3389\/frsus.2022.1057476 CrossRef Full Text | Google Scholar NOAA Global Monitoring Laboratory (2021). Trends in atmospheric carbon dioxide. Available at: https:\/\/gml.noaa.gov\/ccgg\/trends\/global.html (Accessed November 18, 2022). Google Scholar NREL (2021). Life cycle greenhouse gas emissions from electricity generation. Colorado, USA: Update¸ US Department of Energy. Google Scholar O'Brien, M., Doig, A., and Clift, R. (1996). Social and environmental life cycle assessment (SELCA). Int. J. Life Cycle Assess. 1, 231–237. doi:10.1007\/BF02978703 CrossRef Full Text | Google Scholar Opricovic, S., and Tzeng, G.-H. (2004). Compromise solution by MCDM methods: A comparative analysis of VIKOR and TOPSIS. Eur. J. Operational Res. 156, 445–455. doi:10.1016\/s0377-2217(03)00020-1 CrossRef Full Text | Google Scholar Platt, E. G., and Styring, P. (2022). New olefin production routes — a review of defossilised supply chain technologies with regards to surfactant production. Front. Sustain. 3, 1057491. doi:10.3389\/frsus.2022.1057491 CrossRef Full Text | Google Scholar Pohekar, S. D., and Ramachandran, M. (2004). Application of multi-criteria decision making to sustainable energy planning - a review. Renew. Sustain. Energy Rev. 8 (4), 365–381. doi:10.1016\/j.rser.2003.12.007 CrossRef Full Text | Google Scholar Pollok, L., Spierling, S., Endres, H-.J., and Grote, U. (2021). Social life cycle assessments: A review on past development, advances and methodological challenges. Sustainability 13 (18), 10286–10329. doi:10.3390\/su131810286 CrossRef Full Text | Google Scholar Putrasari, Y., and Lim, O. (2022). Dimethyl ether as the next generation fuel to control nitrogen oxides and particulate matter emissions from internal combustion engines: A review. ACS Omega 7 (1), 32–37. doi:10.1021\/acsomega.1c03885 PubMed Abstract | CrossRef Full Text | Google Scholar Ramey, S., and Ramey, D. (2005). Butanol biofuel 100% coast to coast 2005. Available at: https:\/\/www.butanol.com\/(Accessed 11 24, 2022). Google Scholar Remmen, A., Jensen, A. A., and Frydendal, J. (2007). Life cycle management A business guide to sustainability. New York, New York: United Nations Environment Programme. Google Scholar Ribeiro, R. A. (1996). Fuzzy multiple attribute decision making: A review and new preference elicitation techniques. Fuzzy Sets Syst. 78 (2), 155–181. doi:10.1016\/0165-0114(95)00166-2 CrossRef Full Text | Google Scholar Ricardo Inc (2022). Life cycle analysis comparison: Electric and internal combustion engine vehicles. Alexandria, VA, USA: The Fuels Initiative. Google Scholar Rissman, J., Bataille, C., Masanet, E., Aden, N., Morrow, W. R., Zhou, N., et al. (2020). Technologies and policies to decarbonize global industry: Review and assessment of mitigation drivers through 2070. Appl. Energy 266, 114848. doi:10.1016\/j.apenergy.2020.114848 CrossRef Full Text | Google Scholar Roh, K., Lee, J. H., and Gani, R. (2016). A methodological framework for the development of feasible CO 2 conversion processes. Int. J. Greenh. Gas. Con. 47, 250–265. doi:10.1016\/j.ijggc.2016.01.028 CrossRef Full Text | Google Scholar Romeo, L. M., Minguell, D., Shirmohammadi, R., and Andres, J. M. (2020). Comparative analysis of the efficiency penalty in power plants of different amine-based solvents for CO 2 capture. Ind. Eng. Chem. Res. 59, 10082–10092. doi:10.1021\/acs.iecr.0c01483 CrossRef Full Text | Google Scholar Roszkowska, E. (2011). “Multi-criteria decision making models by applying the TOPSIS method to crisp interval data,” in Multiple criteria decision making vol. 6. Editor T. Trzaskalik (Katowice: Publishing House of the University of Economics in Katowice), 200–230. Google Scholar Roy, B. (1968). Classement et choix en présence de points de vue multiples. Revue française d'automatique, d’informatique de recherche opérationnelle 8, 57–75. doi:10.1051\/ro\/196802v100571 CrossRef Full Text | Google Scholar Roy, B. (1991). The outranking approach and the founda-tions of ELECTRE methods. Theory Decis. 31, 49–73. doi:10.1007\/bf00134132 CrossRef Full Text | Google Scholar Saaty, R. W. (1980). The analytic hierarchy process. New York: McGraw-Hill. Google Scholar Saaty, R. W. (1987). The analytic hierarchy process—What it is and how it is used. Math. Model. 9, 161–176. doi:10.1016\/0270-0255(87)90473-8 CrossRef Full Text | Google Scholar Saaty, T. L. (1994). Highlights and critical points in the theory and application of the Analytic Hierarchy Process. European Journal of Operational Research 74, 426–447. CrossRef Full Text | Google Scholar Saaty, T. L., and Vargas, L. G. (2013). Decision making with the analytic network process. New York, NY: Springer. Google Scholar Sabaei, D., Erkoyuncu, J., and Roy, R. (2015). A review of multi-criteria decision making methods for enhanced maintenance delivery. Procedia CIRP 37, 30–35. doi:10.1016\/j.procir.2015.08.086 CrossRef Full Text | Google Scholar Sadiq, M. M., Konstas, K., Falcaro, P., Hill, A. J., Suzuki, K., and Hill, M. R. (2020). Engineered Porous nanocomposites that deliver remarkably low carbon capture energy costs. Cell Rep. Phys. Sci. 1, 100070. doi:10.1016\/j.xcrp.2020.100070 CrossRef Full Text | Google Scholar Shyur, H.-J., and Shih, H.-S. (2006). A hybrid MCDM model for strategic vendor selection. Math. Comput. Model. 44, 749–761. doi:10.1016\/j.mcm.2005.04.018 CrossRef Full Text | Google Scholar Siregar, D., Nurdiyanto, H., Sriadhi, S., Suita, D., Khair, U., Rahim, R., et al. (2017). Multi-Attribute decision making with VIKOR method for any purpose decision. J. Phys. Conf. Ser. 1019, 012034. doi:10.1088\/1742-6596\/1019\/1\/012034 CrossRef Full Text | Google Scholar Sky News (2022). Sky news. Available at: https:\/\/news.sky.com\/story\/we-plan-for-all-eventualities-minister-fails-to-rule-out-energy-rationing-this-winter-12714178 (Accessed December 07, 2022). Google Scholar Stiching Global Reporting Initiative (2021). Gri 1: Foundation 2021. Amsterdam, Netherlands: Global Sustainability Standards Board. Google Scholar Styring, P., Duckworth, E. L., and Platt, E. G. (2021). Synthetic fuels in a transport transition: Fuels to prevent a transport underclass. Front. Energy Res. 9, 707867. doi:10.3389\/fenrg.2021.707867 CrossRef Full Text | Google Scholar Traverso, M. (2018). Is social life cycle assessment really struggling in development or is it on a normal path towards harmonization\/standardization? Int. J. Life Cycle Assess. 23, 199–200. doi:10.1007\/s11367-017-1387-7 CrossRef Full Text | Google Scholar Tsai, W., Yang, C.-C., Leu, J.-D., Lee, Y.-F., and Yang, C. H. (2013). An integrated group decision making support model for corporate financing decisions. Group Decis. Negot. 22, 1103–1127. doi:10.1007\/s10726-012-9308-4 CrossRef Full Text | Google Scholar Tzeng, G.-H., and Liu, H.-H. (2009). “A revised VIKOR model for multiple criteria decision making - the perspective of regret theory,” in Communications in computer and information science (berlin: Springer-Verlag), 761–768. Google Scholar United Nations\/Framework Convention on Climate Change (2015). Adoption of the Paris agreement, 21st conference of the parties. Paris, France: United Nations\/Framework Convention on Climate Change. Google Scholar United Nations (2019). Department of economic and social affairs, population division. World urbanization prospects, the 2018 revision. New York, United States: United Nations. ST\/ESA\/SER.A\/420). Google Scholar United Nations (2015). Transforming our world: The 2030 agenda for sustainable development. New York, USA: United Nations General Assembly. Google Scholar UNEP (2020). Guidelines for Social Life Cycle Assessment of Products and Organizations 2020. Nairobi, Kenya: United Nations Environment Programme (UNEP). Volkart, K., Bauer, C., Burgherr, P., Hirschberg, S., Schenler, W., and Spada, M. (2016). Interdisciplinary assessment of renewable, nuclear and fossil power generation with and without carbon capture and storage in view of the new Swiss energy policy. Int. J. Greenh. Gas. Con. 54, 1–14. doi:10.1016\/j.ijggc.2016.08.023 CrossRef Full Text | Google Scholar von der Assen, N., V., Lafuente, A., Peters, M., and Bardow, A. (2015). “Environmental assessment of CO 2 capture and utilisation,” in Carbon dioxide utilisation: Closing the carbon cycle. Editors P. Styring, E., A. Quadrelli, and K. Armstrong (London: Elsevier), 45–55. CrossRef Full Text | Google Scholar Wibawa, A. P., Fauzi, I. S., Irsyada, R., Dhaniyar, D., and Hernandez, L. (2019). VIKOR multi-criteria decision making with AHP reliable weighting for article acceptance recommendation. Int. J. Adv. Intell. Inf. 5, 160–168. doi:10.26555\/ijain.v5i2.172 CrossRef Full Text | Google Scholar Witchalls, S. (2018). Power poverty: The new paradigm for social and economic inequality of electric vehicles. Available at: https:\/\/www.stantec.com\/en\/ideas\/power-poverty-the-new-paradigm-for-social-and-economic-inequality-of-electric-vehicles (Accessed October 24, 2022). Google Scholar World Meteorological Organisation (2010). WMO Statement on the Status of the Global Climate in 2009. Geneva, Switzerland: World Meteorological Organization (WMO). Google Scholar Wunderlich, J., Armstrong, K., Buchner, G. A., Styring, P., and Schomäcker, R. (2021). Integration of techno-economic and life cycle assessment: Defining and applying integration types for chemical technology development. J. Clean. Prod. 287, 125021–125114. doi:10.1016\/j.jclepro.2020.125021 CrossRef Full Text | Google Scholar Zavadskas, E. K., Antucheviciene, J., and Kar, S. (2019). Multi-objective and multi-attribute optimization for sustainable development decision aiding. Sustainability 11, 3069. doi:10.3390\/su11113069 CrossRef Full Text | Google Scholar Zavadskas, E. K., Govindan, K., Antucheviciene, J., and Turskis, Z. (2016). Hybrid multiple criteria decision-making methods: A review of applications for sustainability issues. Econ. Research-Ekonomska Istraživanja 29, 857–887. doi:10.1080\/1331677x.2016.1237302 CrossRef Full Text | Google Scholar Zavadskas, E. K., Kaklauskas, A., and Šarka, V. (1994). The new method of multicriteria complex proportional assessment of projects. Technol. Econ. Dev. Econ. 1, 131–139. Google Scholar Zimmermann, A. W., and Schomäcker, R. (2017). Assessing early-stage CO2 utilization technologies — comparing apples and oranges? Energy Technol. 5, 850–860. doi:10.1002\/ente.201600805 CrossRef Full Text | Google Scholar Zimmermann, A., Wunderlich, J., Buchner, G. A., Armstrong, K., Marxen, A., Michailos, S., et al. (2018). Part B: TEA guidelines, techno-economic assessment & life cycle assessment Guidelines for CO 2 utilization. Ann Arbor, Michigan: CO2Chem Media and Publishing, 25–97. Google Scholar Zimmermann, A. W., Wunderlich, J., Müller, L., Buchner, G. A., Marxen, A., Michailos, S., et al. (2020). Techno-economic assessment guidelines for CO 2 utilization. Front. Energy Res. 8 (5), 1–23. doi:10.3389\/fenrg.2020.00005 CrossRef Full Text | Google Scholar","filter_flag":1}
{"title":"The microbial food revolution - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNDY3LTAyMy0zNzg5MS0x0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNDY3LTAyMy0zNzg5MS0x0gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNDY3LTAyMy0zNzg5MS0x0gEA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNDY3LTAyMy0zNzg5MS0x0gEA?oc=5\" target=\"_blank\">The microbial food revolution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The microbial food revolution - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNDY3LTAyMy0zNzg5MS0x0gEA?oc=5\" target=\"_blank\">The microbial food revolution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Enhancing fermentation Fermentation can be optimised by specially selecting, breeding or engineering strains of microbes to enhance the appearance, taste or health profile of fermented foods18,62,63. Traditionally, breeding and selection techniques were used to select for favourable qualities even before the biology of microbes was discovered, leading to vastly different strains for specific uses30. Using genetic profiling techniques and -omics technology, we are now able to further identify strains with favourable properties14,15. Large-scale analysis has also enabled the identification of strains with desired aromas, which were further improved by hybridisation techniques16. More recently, fermentation has been enhanced by using genetic engineering, where strains used in traditional fermentation can be manipulated to produce additional beneficial products. Some examples of modifications include the enhanced production of B vitamins in Lactobacilli used in dairy products63,64 or the synthesis of aroma compounds in S. cerevisiae strains for novel and improved beer flavours65. Genetic engineering has also been used to improve the sustainability of the fermentative food processes, which can be achieved by expanding or improving substrate range and utilisation22,66,67 This furthers the potential to use waste feedstocks8,9 and move towards a fully circular economy. It is worth noting that many fermentation processes are carried out by microbial communities rather than single strains, which adds an additional layer of complexity to the understanding and limits our capacity to improve them. Advances in sequencing technologies and systems biology have allowed us to improve our knowledge of microbial consortia, including those found naturally in foods, as has been reviewed in previous works68,69. In addition, in the last years, synthetic biology tools specifically developed to engineer microbial communities have been created70, which have the potential to be used to improve food manufacturing. This includes spreading metabolic burden such as when two strategies to reduce browning in soy sauce production were engineered to act synergistically in two microbial species71, or enhancing natural coculture properties, such as increasing quorum sensing mechanisms which reduce food spoilage72. Use of microbes as a protein source in human food The use of microbes as a food ingredient is known as single-cell protein (SCP) and usually refers either to dried or processed microbe biomass or to the proteins extracted from it. It can be ingested either as a supplement, ingredient or as a main food source (see Fig. 1). Thanks to its potential for sustainable fermentation8,28 and its favourable nutritional profile11, it has the potential to become a large component of our diet. SCP has a long and varied history, beginning before the World Wars and continuing into the late and mid 20th century73,74. However, most projects were discontinued in the face of rising energy costs and the success of the green revolution, although some legacies remain75. One of the first of these is Marmite, established in 1902 as a by-product of the beer industry has even been consumed as an army ration as a source of B vitamins61. Since then, there has been development in other, more texturised SCPs—notably that of Quorn. Quorn, established in the 1980s, produces SCP from the filamentous fungi Fusarium venenatum and then treated to remove excess nucleic acid content and finally texturized to create meat replacements76. It is now a widely distributed product sold in 17 countries with a reported revenue of 236 million GBP in 2020. SCPs are also consumed as a health supplement, such as the microalgae Chlorella and Spirulina, which are rich sources of proteins as well as phytonutrients and vitamins77. Given the ecological and nutritional benefits of SCPs, there is a renewed demand which has resulted in research into new sources of SCPs as well as novel cultivation methods. There is a profusion of start-up companies trying to bring new SCP products to market with some examples listed in Table 1, with many start-ups focussing on meat alternatives. Table 1 Start-ups and companies developing microbial food either for humans or animal feed as well as individual components or flavourings used Full size table So far, most research has focused on wild-type (non-engineered) strains, which have been selected based on their protein content and whose production have been optimised manipulating growing conditions. Synthetic biology has the potential to engineer selected strains to further improve protein production, which can be achieved by (1) enhancing and expanding the capacity to efficiently use desirable feedstocks, (2) improving yields for biomass and protein production and (3) adding functionalities to the single-cell protein by the co-production of valuable compounds such as vitamins or antioxidants78. Improving growth and substrate use can greatly improve ecological and economical aspects, for example, by transforming waste into proteins79. Animal meat alternatives Microbes are a promising substitute for meat products. This is thanks to their matching protein and nutrient levels, as well as their potential to be modified and texturized to resemble meat. One of the most established companies is Quorn, which produces SCP derived from filamentous fungi. Quorn has products that resemble meat products from chicken nuggets to beef mince and has a large selection of different textures and forms it comes in refs. 80, 81. To achieve this, the long strands of hyphae are mixed with binding agents and then this fibre–gel complex is freeze texturised which allows for hyphal laminations that recreate the fibrous texture of meat80. Other start-ups including Meati Foods, Mycorena and Nature’s Fynd are also producing meat analogues from filamentous fungi. Besides mimicking the nutritional profile or protein content, meat flavourings can also be produced by microbes. These products can be extracted and purified, or the whole microbial biomass can be used. For example, in the Impossible burger, Pichia pastoris is engineered to produce soybean leghaemoglobin c226, which recreates part of the flavour profile of meat. The engineered microorganism is then incorporated with other ingredients including soy and potato proteins. Haemoglobin is also being produced as a stand-alone ingredient to add to plant-based meats, such as in the start-up Motif Foodworks. In academia, there is a concentrated effort to produce many variations of haemoglobin proteins which could account for future taste expansions82. Other individual components of meat can also be produced, such as the structural elements gelatine and collagen83,84. Finally, one main challenge of recreating meat is providing an adequate lipid composition and content. Most plant-based alternatives utilise plant oils, which have a strongly differing taste and mouthfeel. The endogenous contents of lipids in microbes also differ significantly from that of meat; however, there is vast academic research on producing dietary lipids in microbes. Oleaginous species have been found to be a suitable production platform for highly nutritious fatty acids, such as omega-3 fatty acids which are found abundantly in fish27. Furthermore, advancement in the production of microbial oils gives us the potential to not only tune lipid composition but to also modify fatty acids to become more suitable for animal replacement uses85. Little focus has been given to mimick animal fats in academic research, although start-ups such as Melt & Marble and Nourish Ingredients aim to make dietary fats for animal replacements through fermentation. Other animal product alternatives Engineering microbes also have the potential to recreate animal products such as dairy and eggs. This is done through precision fermentation, where the pathways of individual components have been engineered into microorganisms. Milk is composed of oligosaccharides, fats, sugars and proteins, primarily that of casein and whey4. These various components are being reproduced using synthetic biology in microorganisms4. The main milk proteins, namely casein proteins and whey proteins, have been successfully engineered into various organisms, including bacteria and yeasts4. These technologies are being employed by various start-ups developing animal-free milk, such as Perfect day, Better Dairy and Formo, which use purified milk proteins extracted from microbial cell factories and mixed with other fats and sugars. Human breast milk has also been researched as it is thought to have important effects on the development of the neonatal gut flora and immune system86. Components such as milk fats and milk oligosaccharides have been developed with precision fermentation for human breast milk, both in academia as well as in industry, such as by the SME Conagen. Human milk oligosaccharides (HMOs) have been produced in both S. cerevisiae and B. subtilis87 and human milk fats in the oleaginous yeast Y. lipolytica88. The probiotic effects can also be mimicked by recreating the microbiome of breast milk through the addition of microbial populations to formula89. The actual effects of these supplements would benefit from further studies in humans. Eggs have a larger and more complex group of proteins that are responsible for their unique texture and taste. However, there have been efforts to recombinantly express different proteins, initially for allergenicity and protein studies90,91, and more recently as food ingredients92,93. Furthermore, there have also commercial efforts to produce egg alternative products made up of multiple egg proteins. This includes the start-up EVERY, which launched an egg white product made from recombinantly produced proteins in 2021. One animal-based ingredient that has already been largely replaced by precision fermentation is rennet, an enzyme mixture containing chymosin found in the lining of the stomach of young ruminants. Commercial chymosin is now mostly produced in Aspergillus niger, which has allowed many kinds of cheese to become suitable for vegetarians as well as reducing the price, benefiting cheese makers94. Microorganisms in animal feed The use of microbes in animal feed first appeared over a century ago when brewery by-products were used to supplement feed by Max Delbruck. More recently, using microorganisms as a main or supplemental nutritional source has become established as an industry norm in both animal agriculture95 and aquaculture23. This is due to an increase in regulatory ease and technological capabilities as well as growing pressures for cost and ecological efficiency96. Many different microbial species have been investigated for the benefits in both animal health and production output23,24. Different microbial species each have their own limitations and advantages and thus need to be matched to desired functions and livestock23,24. Furthermore, there are different delivery options- including as a sole nutritional source23, as nutritional additive24 or can act as probiotics97,98. Live microbial supplements can act as probiotics and can either be species delivered to colonise the gut and integrate to improve the existing microflora, or to help balance the existing microbiota by modulating the pH, feed existing microorganisms and to defend against pathogenic species. Using probiotics in animal feed is becoming an industry norm as it has large therapeutic gains while reducing the need for drugs and antibiotics. In addition, the use of probiotics is shown to improve feed uptake, immune response and stress tolerance97,98,99. It has also been linked to increased growth, biomass and milk production97. The new generation of SCP-based animal feed uses engineered microorganisms nutritionally tailored to the target animal28,78,100. Moreover, it can be also employed as a nutraceutical and therapeutic platform such as in the previously commercial omega-3 enriched Yarrowia biomass employed in Verlasso® salmon101, and the efforts in the start-ups such as Cyanofeed (see Table 1). Vitamins, fatty acids and phytonutrients have been successfully delivered through feed28. Finally, engineering organisms to utilise waste substances as carbon sources can greatly lower the ecological footprint of highly polluting animal agriculture industries28,29.","filter_flag":1}
{"title":"The New Age of Tragedy - The New Statesman","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lm5ld3N0YXRlc21hbi5jb20vaWRlYXMvMjAyMy8wNC9uZXctYWdlLXRyYWdlZHktY2hpbmEtZm9vZC1ldXJvcGUtZW5lcmd5LXJvYmVydC1rYXBsYW4taGVsZW4tdGhvbXBzb24tam9obi1ncmF50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lm5ld3N0YXRlc21hbi5jb20vaWRlYXMvMjAyMy8wNC9uZXctYWdlLXRyYWdlZHktY2hpbmEtZm9vZC1ldXJvcGUtZW5lcmd5LXJvYmVydC1rYXBsYW4taGVsZW4tdGhvbXBzb24tam9obi1ncmF50gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3Lm5ld3N0YXRlc21hbi5jb20vaWRlYXMvMjAyMy8wNC9uZXctYWdlLXRyYWdlZHktY2hpbmEtZm9vZC1ldXJvcGUtZW5lcmd5LXJvYmVydC1rYXBsYW4taGVsZW4tdGhvbXBzb24tam9obi1ncmF50gEA","guidislink":false,"published":"Wed, 26 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=116, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lm5ld3N0YXRlc21hbi5jb20vaWRlYXMvMjAyMy8wNC9uZXctYWdlLXRyYWdlZHktY2hpbmEtZm9vZC1ldXJvcGUtZW5lcmd5LXJvYmVydC1rYXBsYW4taGVsZW4tdGhvbXBzb24tam9obi1ncmF50gEA?oc=5\" target=\"_blank\">The New Age of Tragedy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New Statesman<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The New Age of Tragedy - The New Statesman","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lm5ld3N0YXRlc21hbi5jb20vaWRlYXMvMjAyMy8wNC9uZXctYWdlLXRyYWdlZHktY2hpbmEtZm9vZC1ldXJvcGUtZW5lcmd5LXJvYmVydC1rYXBsYW4taGVsZW4tdGhvbXBzb24tam9obi1ncmF50gEA?oc=5\" target=\"_blank\">The New Age of Tragedy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New Statesman<\/font>","source.href":"https:\/\/www.newstatesman.com","source.title":"The New Statesman","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"The post-Cold War moment, a 30-year period when globalisation and free trade were orchestrated under the aegis of American supremacy, is ending. As the historian Anders Stephanson has written, “One could not deny that geopolitics reduced to a set of mopping-up operations was a historic achievement of US power.” Today, great-power rivalry, war and the competition for diminishing resources are old realities reborn, revenants of history that now define a present of increasing peril and uncertainty. In The Tragic Mind (2023), the American correspondent, author and foreign policy adviser Robert D Kaplan argues that we must learn to think tragically to avoid tragedy. We need what he calls anxious foresight. The wisest among us fear disorder and anarchy as much as tyranny. [See also: The 1990s promised a new era of peace, but it was an illusion from the start] But thinking tragically is not fatalism. It is understanding our limitations and acting with more effectiveness. For this wide-ranging exchange, we asked Kaplan, the Cambridge political economist Helen Thompson and the philosopher John Gray to explore what we are calling this new age of tragedy, and how societies might navigate and endure the gathering storms. Subscribe to the Saturday Read View all newsletters Your new guide to the best writing on ideas, politics, books and culture each weekend – from the New Statesman. Sign up here Select and enter your email address The Saturday Read Your weekly guide to the best writing on ideas, politics, books and culture every Saturday. The best way to sign up for The Saturday Read is via saturdayread.substack.com Morning Call The New Statesman's quick and essential guide to the news and politics of the day. The best way to sign up for Morning Call is via morningcall.substack.com Your email address Job title Job title Administration \/ Office Arts and Culture Board Member Business \/ Corporate Services Client \/ Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility \/ Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community \/ Social Services Job title Administration \/ Office Arts and Culture Board Member Business \/ Corporate Services Client \/ Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility \/ Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community \/ Social Services Sign up Visit our privacy Policy for more information about our services, how Progressive Media Investments may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close Robert D Kaplan Weimar Germany connotates the ultimate doom: a cradle of modernity that gave birth to fascism and totalitarianism. More specifically, Weimar was an unstable political system that existed between late 1918 and 1933, born in the ashes of the First World War and ending with the ascension to power of Adolf Hitler. Our world is unlikely to be headed for such moral darkness. Nevertheless, Weimar constitutes a model of sorts. It was a system composed of a parliamentary upper house, a lower house, small states, and two large ones – Prussia and Bavaria – that were to some extent laws unto themselves. Complex and prone to bickering, Weimar was a classically overloaded political regime that existed in a state of perma-crisis. Such is our world today. We do not have a world government; nor do we have any truly effective world governance. But owing to the shrinkage of geography caused by technology, there is an emerging world system, in which crises can migrate from one part of the Earth to another. Greater interconnections mean that any place or continent can be considered strategic and affect all the others. It is a global Weimar, where there is always a crisis. The 20th-century computer scientist and polymath John von Neumann once said that the finite size of the Earth would become a source of instability. As populations rise in absolute numbers, as more and more human beings live in complex urban settings, and both weaponry and communications – especially cyber – develop and become more sophisticated, the Earth will eventually become just too small for its volatile politics. That is why, like Weimar, our world today seems so anxious, claustrophobic and unstable. There is surely trouble ahead that will require anxious foresight and tragic thinking on our part. Tragic thinking encompasses many things, among them the realisation that fear is useful. We have to use fear without being immobilised by it. Above all, we must realise that given such a claustrophobic and overloaded world system, the assumption of linear progress is a dangerous notion to entertain. The idealists among us say that geography is not determinative, and that fate is ultimately in the hands of human agency. But human agency need not have positive outcomes. Individuals such as Vladimir Putin and Xi Jinping are human agents who have caused a vast and bloody war in Ukraine and are driving Asia toward a high-end military conflict over Taiwan. In fact, as world geography shrinks, the price for human error and human malevolence grows. The margin for error narrows, so thinking without illusions becomes necessary. In such a world, all political leaders must be realists, aiming for the lesser evil rather than for the ultimate good. And yet unbounded idealism mixed with hubris still threatens disaster. Suez, Vietnam, Afghanistan, Iraq, Libya and so on constitute a drum roll of avoidable disasters. And precisely because of the shrinkage of geopolitics produced by technology, there will be increasingly greater, even cataclysmic costs for such failures in the future. That is why in Ukraine and Taiwan we have to find a middle ground between acquiescence to authoritarian rule and inflexibly demanding perfect democratic outcomes. We have to get used to the prospect of many disappointments ahead. [See also: “Russia cannot afford to lose, so we need a kind of a victory”: Sergey Karaganov on what Putin wants] John Gray A global Weimar riven by new technologies and resource scarcity is our default condition. The task is not to shore up a semi-imaginary and defunct Western-led “rules-based order”, but to avoid catastrophic conflict in a post-hegemonic world. The US will remain a great power. Even so, American decline is a trajectory human agency cannot alter. The idea that a nation now so intractably divided could construct a new international order is far-fetched. Intensifying political polarisation poses a question about the capacity of American government to execute any long-term strategy. Even if it is defensible in legal terms, Trump’s indictment confirms that the justice system has become a weapon in partisan political warfare. As the next presidential election approaches in 2024, the US is entering a legitimation crisis. This implosion forms the background of an accelerating international retreat. Saudi Arabia’s joining the Shanghai Cooperation Organisation, the Chinese-brokered Saudi-Iranian rapprochement, Brazil, South Africa and Malaysia opting for closer ties with China, and India being increasingly non-aligned testify to America’s rapid descent. China’s proposals for peace in Ukraine may be vague and not altogether serious, but Russia cannot be restrained without Chinese intervention. A multipolar international system is already in operation. American strategists are fixated on a world that belongs in the past. China has major vulnerabilities, including an economy weakened by Xi’s ruinous Zero Covid policy and an army that has not had combat experience since the Sino-Vietnamese border war of 1979. The US, despite the drawdown of some of its armaments for use in Ukraine, retains formidable military capabilities battle-honed in decades of almost continuous foreign conflicts. Yet America is unprepared for the war so many in Washington think is coming. It has offshored much of its industrial base to China. It continues to be heavily reliant on China for medical supplies and on Taiwan for high-end computer chips. Even if a national industrial strategy of the kind Joe Biden has launched is consistently implemented, remedying this self-inflicted dependency will take many years. The world situation is similar to that in the run-up to 1914. New technologies have not overcome rivalry over scarce natural resources, only shifted its focus. A new version of the late-19th-century Great Game is being waged for strategic metals in Africa and the resources of Siberia and central Asia. Beginning as a response to russian aggression, the conflict in Ukraine has morphed into a proxy war between great powers in which resources are as important as ideology. The least illuminating way of understanding this conflict is a collision between democracy and autocracy. There will be democratic states and tyrannies, along with myriads of hybrid regimes, in any foreseeable future. The hubristic fantasy of a global liberal order must be replaced by realism, restraint and an unceasing struggle to stave off disaster. [See also: In its pursuit of Russian regime change, the West is doomed to repeat the errors of the Iraq War] Helen Thompson If we live on a finite Earth, we live in a geopolitical world in which the competition for resources creates winners and losers. The Weimar Republic began after Germany was defeated in the contest to control the energy source on which modernity would depend in the 20th century: oil. Victory in the Great Game in Eurasia between the late 19th century and the First World War went first to Britain and France in the Middle East and then to the Soviet Union when it reconquered the Baku oil fields in 1920. Weimar’s answer to Germany’s defeat was to apply technology to the energy resource that Germany did have in abundance: coal. The first synthetic oil produced at the Leuna plant during the Weimar years was a triumph of German science and engineering. But technological success could not save German democracy. The Weimar Republic still needed to import oil as well as other resources, and that required a world economy in which Germany could be a trading power. When the 1929 stock market crash saw American investors retreat and the start of the economic depression, the Nazis easily exploited Germany’s humiliations. Hitler then sent Germany down the path of total conquest to procure resources and agricultural land by annihilating the populations whose lives already depended on them. Today the Weimar problem is global because no state is protected from the hard world of resource competition that Hitler drove to such hideous finality. The shale oil and gas boom of the 2010s gave the US a respite from the foreign energy dependency that had trapped it in a succession of disasters in the Middle East. But the growth rate of shale output has slowed, leaving the Biden administration at the mercy of decisions made by the Saudi-Russian-led cartel Opec Plus. For the best part of two decades russia has been the world’s energy-exporting superpower. But the imposition of Western sanctions after the invasion of Ukraine has made it harder for russian companies to develop the Bazhenov shale basin in western Siberia, without which the russian oil industry will decline. Meanwhile, as governments across the world attempt to direct a low-carbon energy revolution, this competition for resources includes an ever growing list of raw materials. The idea of linear progress always hid the problem of resource depletion under an a priori assumption that technology would ride to the rescue. Our tragedy in the West is that, for all the catastrophes of the 20th century, we still carry this hubristic world-view, blinding us to the complexity of our collective human predicament on a finite Earth. [See also: The world according to Xi Jinping and Vladimir Putin] Robert D Kaplan Indeed, a finite Earth will feature a zero-sum contest for resources. Think of our present and future world as we do early modern Europe: competing states rammed up against each other, periodically at war, with little extra physical space to manoeuvre. The late military historian John Keegan explains that Britain and the US could champion freedom only because the seas protected them “from the landbound enemies of liberty”. But continental Europe through the middle of the 20th century had no such luxury (and only afterwards because of an American security umbrella). And now that technology has contracted distance, reducing the protective power of expansive waters, the world itself has rediscovered the fate of an earlier Europe, where realism and pragmatism reigned. The new Saudi-Russian Opec Plus is an example of this process, in which the contraction of distance has encouraged de facto alliances across yawning regions so that, with China moving closer to both russia and Saudi Arabia, a true Eurasian power system has come into being. It will be a claustrophobic world where technology won’t always be able to rescue us. That is why linear progress is a delusion – since even when technological fixes arrive to solve problems, they often arrive too late to prevent conflict and suffering. Unlike in the two world wars, America will no longer be able to act as an unencumbered policeman on the world stage. As it is today, the US was intractably divided in the 1930s, when racism, anti-Semitism and right-wing hatred of Franklin Delano Roosevelt were prevalent. But the Second World War, a total war involving mass conscription, gave the US dynamism and unity. When the war ended, the American economy dominated the world. That is no longer the case, particularly because China is a full-spectrum great power, with the world’s second-largest economy and a technological base that manufactures both high-end military and consumer products. Yet, China faces grave economic, social and political problems of its own. Indeed, since the Ukraine War has dramatically weakened russia as a great power, it may be that all three powers – the US, China and russia – are in decline, though in different ways and at different speeds. But decline is relative, so one or more of these powers may continue to maintain leverage over the others in the foreseeable future. The Royal Navy began its decline around the turn of the 20th century, yet Britain went on to help defeat Nazi Germany almost half a century later. That’s why decline itself may be overrated. Therefore, in this increasingly smaller and conflict-prone world, just as we should not become idealists ideologically demanding democratic systems everywhere, neither should we become fatalists, as there is much work to do. Illustration by Matthieu Bourel John Gray Twenty-first-century conflicts reflect two kinds of scarcity, both on a global scale. The first is a zero-sum contest for the material resources of a finite planet, the second a type of value scarcity in which all the available options involve loss. The combination makes geopolitics inescapably tragic. Tragedy is not imperfectability, nor is it the fact that progress is intermittent and reversible. Human beings confront tragedy when they know that whatever they do may not be enough to avert disaster. In such circumstances a measure of fatalism is reasonable, though it need not entail passivity. Scarcities in resources and options are tightly intertwined. Geologists estimate that, in order to achieve global Net Zero, there will have to be more mining in the next few decades than throughout history. Here humans are approaching the physical limits of growth. But scarce natural resources trigger rivalry among states, drawing them into wars, and here scarcity of options is at work. The two world wars were in part driven by a need for oil. New technologies can propel great powers towards disaster. High-end computer chips are needed to maintain the living standards to which billions of human have become accustomed. Over time technology spreads by diffusion, but whichever power controls these chips in the near future will have a major advantage. That is why, unless the West accedes to China’s absorption of Taiwan, which produces around two-thirds of the output, the island is fated to be the epicentre of a global conflict. Continuing the status quo is not an option. An intensifying resource scarcity undermines the stability of states. A low- or zero-growth economy is not, as environmentalists and their opponents both believe, a policy choice, but a sign that humankind is testing the limits of an overcrowded planet. In both developmental dictatorships and advanced industrial states, governments rely heavily on economic expansion for their authority. Lacking the legitimacy given them by rising living standards, they are more likely to turn to war. Scarcity of options is exacerbated by liberal ideology. Autocracies are proving less doctrinally rigid and more strategically flexible than democracies. As a matter of justice, the arrest warrant issued by the International Criminal Court against Putin for war crimes looks fully justified. But it also shows a reckless disregard for the consequences. Putin is not Slobodan Milošević, a petty tyrant, but the commander of the world’s largest nuclear arsenal. the West is implicitly staking the future on benign regime change in russia, a desperately dangerous gamble. Western societies are based on the belief that resources and options can always in principle be expanded by human agency. In reality both are inherently limited – by geography, history and ideological folly – and it is this that explains the recurrence of tragedy in geopolitics. The task, as ever, is to make the best of the situation. Helen Thompson Faith that creative human agency can triumph over nature’s limits has been a central feature of most modern political projects, not least liberalism. Missing the fact that technology cannot create energy, this conviction has long proved overly sanguine. Those who assume that the political world can be reconstructed by the efforts of human will have never before had to bet so much on technology over energy as the driver of our material advancement. We are now a long way removed from the revolutionary hopes of the 19th and 20th centuries that the transformation of collective life would mean the complete development of all natural resources and an end to scarcity. Even in China, Xi Jinping’s theoretical mission for the Chinese Communist Party to deliver “material abundance” as an aim of “scientific socialism” coexists with the dangers of “black swans” and “grey rhinos”, not least those that might arise from China’s foreign oil dependency – with all its implications for Beijing’s ability to fight a war for Taiwan. The technologies of low-carbon energy do have some capacity to ameliorate geopolitical competition around hydrocarbons. But low-carbon electricity and electrification still depend on extracting metals from under the Earth’s surface. As John notes, technological progress can also invite geopolitical disaster. It was the knowledge that oil-fuelled warships would be superior to existing coal-fuelled navies that drove a great deal of the geopolitical competition over oil prior to 1914. A century later, Xi’s “Made in China 2025” strategy – when in 2015 the Chinese leadership bet the country’s future on dominating high-tech manufacturing supply chains and electric-vehicle production – terrified the political class in Washington into its present tech war against the country. As climate change accelerates, the modernist faith in technology must do ever more work to keep at bay an underlying dread that fossil-fuel civilisation will prove no less tragic than all others in history. The assumption that modern human ingenuity is unique allows energy optimists to treat the technological successes in reducing the unit costs of low-carbon energy as the inevitable prelude to the next round of remedies required, starting with eliminating the present intermittency of solar- and wind-generated electricity. But a fear that a low-carbon modern civilisation is unrealisable also powers the recent techno-fantasies of one day transferring human life to Mars. Clear-eyed realism about the available options and their respective human costs is essential. Denial of our tragic age will only lead to more suffering. But we are far from being helpless sleepwalkers in our collective human plight. Resource-driven geopolitics is riven with inescapable dangers. But it will only be an apocalyptic struggle if governments make it so by refusing to recognise the restraint required by coexistence in the face of the limits nature imposes. [See also: The dangerous conceits of the green revolution] Robert D Kaplan The emphasis on scarcity and limits, particularly on resources, combined with the increasing connectedness of a Weimar world, has been an ongoing phenomenon for well over a century. Witness the two world wars. But attrition of the same can add up to big change. If there is one Enlightenment philosopher who intuitively grasped this, even if he made mistakes, it is Thomas Robert Malthus (1766-1834). Indeed, a Weimar world is a Malthusian world. Malthus continues to be ridiculed for claiming that while population increases geometrically, food supplies increase only arithmetically, so that humankind risks eventual shortages and starvation. In fact, during his lifetime, Malthus revised his theory numerous times while upholding the central thesis, that populations expand to the limits imposed by the means of subsistence. Perhaps more so than Adam Smith in The Wealth of Nations, Malthus introduced the whole subject of the physical and natural environment into contemporary political philosophy. Humankind might be nobler than the apes, but we are still biological. Therefore, our politics, Malthus suggested, are affected both by the natural conditions and by the densities in which we inhabit the Earth. To keep from destroying ourselves in this Malthusian world, we will have to husband fear without being immobilised by it. We cannot assume that technology will come to the rescue of every dilemma. The Ancient Greeks argued that no man is lucky until he is dead, since catastrophe can befall any of us at any moment. To carry that over into humanity at large, we should not assume that catastrophe cannot befall us at any moment or in any historical period. That is, we will need to think tragically in order to avoid tragedy. And precisely because our civilisation is rubbing up against limits of resources and space, such tragic thinking is more vital than ever before. Yet, it is less in evidence. Rishi Sunak and Keir Starmer in Britain are technocrats in spirit and background, and technocrats assume there is a solution to every problem, which leads to a certain arrogance. Meanwhile, the American political elite is more ideological than ever before, and this leads to another form of arrogance; the world’s problems will not go away if only all of humanity became democratic – as the American elite seems to believe. I fear that the elites in both Britain and the US will have to learn about tragedy the hard way, by actually living it, due to their failures in seeing it ahead of time. [See also: China’s wolf-warrior diplomacy is pushing it closer to Russia] In 1798 Thomas Malthus linked population growth and resource scarcity. Photo by SZ Photo \/ Blanc Kunstverlag \/ Bridgeman Images Helen Thompson Since Malthus wrote without understanding that he lived at the start of an energy revolution that would transform the cycles of land fertility, his medium-term prophecy was doomed. The likely long, drawn-out end of the energy world that began in the 18th century may well validate his pessimism. But the limits of our own knowledge today could also lead us to the sort of unnecessary millenarian conclusions that he drew. The stridency with which some think that energy abundance is a right of modernity flies in the face of a long history of reckoning with resource scarcity. In his 1865 book The Coal Question: An Inquiry Concerning the Progress of the Nation, and the Probable Exhaustion of Our Coal Mines, the English economist William Stanley Jevons explained how, by turning to a finite energy source, Britain had placed itself on an economic trajectory towards ever greater dangers from which it would not be able to escape. Since the US began to dominate the modern economic world on the back of oil, Americans have been through multiple cycles of exploration and depletion. Pithole in Pennsylvania, where the first commercial American oil well was drilled in 1865, was a ghost town by the 1880s. As the early-20th-century wildcatters who found huge quantities of oil in Texas understood, fossil-fuel industrial civilisation has always been a roller-coaster. Scientific invention and the viability of its commercial exploitation to surpass resource constraints are part of that roller-coaster. The energy historian and scientist Vaclav Smil estimates that perhaps half of us today would not be alive without synthetic ammonia. The scientific push for this innovation came from the fear in the early 20th century that the natural nitrates used as fertilisers were running short. The chemist Fritz Haber’s invention was mass-produced as a result of German desperation when, during the First World War, the Allies’ naval blockade cut off German trade with Chile, exporter of most of the world’s nitrate supply. Thomas Malthus has become relevant again because we are deliberately trying to undo the energy revolution he missed. We also know that technological advancement is a contingency, often around war, that cannot transcend the laws of thermodynamics. Any honest assessment of our likely future should recognise the enormity of trying to substitute electricity for fossil fuels in food production and distribution while already knowing the limits of technology to solve the problem. Our partial agency is why we must learn to live consciously with mind-boggling uncertainty. Searching for and extracting metals will be another high-risk voyage, pitting human creativity against the inexorable force of resource depletion that will play out regardless of temporary successes. If the energy predicament is singularly modern, the tragic mindset, shaped as it was by earlier civilisational experiences of limits, can still offer wisdom as we reckon with the Faustian odyssey that using fossil-fuel energy set in motion. [See also: US policymakers sound the alarm on possible Chinese invasion of Taiwan] John Gray Today, the great powers have some things in common with the characters in Jean-Paul Sartre’s play No Exit (1944). Three dead souls find themselves in a locked room, seemingly damned for their sins. One of them tries to escape, but when the door opens he cannot make himself go through it, and all three remain stuck in the room. In a celebrated line, the failed escapee concludes: “Hell is other people.” The great powers are trapped in a geopolitical version of Sartre’s room, a claustrophobic world from which there seems to be no exit. This is not the binary world of the Cold War. Three or more states – America, China, Russia and India – are contending for the shrinking resources of an overloaded planet. As Robert argues, the theorist who best explains this situation is Thomas Malthus. In 1798, when he first published his An Essay on the Principle of Population, there were about 800 million human beings. Now there are approaching eight billion. Not only have human numbers increased tenfold, but many people today enjoy living standards higher than most have done throughout history. In assuming food production could not be increased, Malthus was mistaken, but in a roundabout way he may yet be proved right. The spike in population and living standards was largely a by-product of hydrocarbons. It is true that birth rates are falling in many countries. But unless there is a large-scale die-off, global human numbers will still reach around 10 billion in this century, and feeding a population of that size will require enormous quantities of energy. Mechanised agriculture, fertilisers, insecticides, factory farms, refrigerators and transportation require giant inputs of fossil fuels. Intensive farming is the extraction of food from oil, part of the worldwide industrialisation that has ravaged wilderness, depleted the biosphere and destabilised the climate. The confluence of global warming, energy scarcity, pandemic and geopolitical warfare may signal the beginning of a brutal rebalancing of the kind Malthus described. As Helen says, there is an underlying mood of existential dread, a nagging suspicion that our civilisation may destroy itself as so many others have done in the past. With his fantasies of interplanetary migration, Elon Musk is an unwittingly tragic figure – as much an expression of a hidden despair as of the techno-optimism he loudly proclaims. The reality of a planet from which there is no exit is intensifying competition for control of its resources. Ukraine is not only the world’s breadbasket but a rich site of rare earths, while the russian-occupied territories of Donetsk and Luhansk contain substantial deposits of shale gas. Geology and geography shape our conflicts as profoundly as any clash between autocracy and democracy. If there is hope, it is in recognising this fact. Global disaster could still be averted by reality-based diplomacy. It will be unfortunate if, like Jean-Paul Sartre’s failed escapee, our leaders cannot bring themselves to go through the door. [See also: Rescuing conservatism] Related","filter_flag":1}
{"title":"Is the Diskless Architecture the Most Preferred for the Cloud and Internet Industries? - Huawei Enterprise","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL3N0b3JhZ2UvMjAyMy9kaXNrbGVzcy1hcmNoaXRlY3R1cmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL3N0b3JhZ2UvMjAyMy9kaXNrbGVzcy1hcmNoaXRlY3R1cmXSAQA?oc=5","id":"CBMiQGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL3N0b3JhZ2UvMjAyMy9kaXNrbGVzcy1hcmNoaXRlY3R1cmXSAQA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL3N0b3JhZ2UvMjAyMy9kaXNrbGVzcy1hcmNoaXRlY3R1cmXSAQA?oc=5\" target=\"_blank\">Is the Diskless Architecture the Most Preferred for the Cloud and Internet Industries?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huawei Enterprise<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Is the Diskless Architecture the Most Preferred for the Cloud and Internet Industries? - Huawei Enterprise","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vZS5odWF3ZWkuY29tL2VuL2Jsb2dzL3N0b3JhZ2UvMjAyMy9kaXNrbGVzcy1hcmNoaXRlY3R1cmXSAQA?oc=5\" target=\"_blank\">Is the Diskless Architecture the Most Preferred for the Cloud and Internet Industries?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huawei Enterprise<\/font>","source.href":"https:\/\/e.huawei.com","source.title":"Huawei Enterprise","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Is the Diskless Architecture the Most Preferred for the Cloud and Internet Industries? 2023-04-20 3137 1 The explosive growth of mass data poses challenges to cloud and Internet data centers. However, the rapidly emerging diskless architecture helps data centers achieve energy saving, high performance, and high reliability in the multi-cloud era. Challenges for Traditional Cloud and Internet IT Architectures In China, the cloud and Internet industries have created the largest IT infrastructure platform, which stores and processes a greater amount of data than any other industry. As the scale of data center construction expands, it becomes crucial to develop efficient approaches to handle the surge in construction demands, adhere to green and energy-efficient requirements, and ensure the high-quality evolution of data centers. The traditional data center typically adopts a multi-level hierarchical architecture. Each layer from the server, network, to the storage layers is a complete computer system that consists of components such as CPU, memory, bus, and hard disks. In response to new data applications, organizations often adopt an integrated server architecture that couples applications with local disks to enable the rapid deployment and testing of new services. However, this conventional server (local disk) architecture can result in an imbalanced allocation of hardware resources, with computing and storage resources developing at different rates. The computing power life cycle and data life cycle are increasingly different. This mismatch can lead to issues such as rigid expansion, idle resources, and low utilization, which hinder service data sharing and access requirements. Rapid Emergence of the Diskless Architecture The data center industry is facing obstacles in optimizing capacity utilization and storage efficiency. However, the development of new hardware technologies, such as high-performance disk enclosures, dedicated data processors (such as DPU), remote direct memory access (RDMA), and CXL protocols, provides a technical basis for reconstructing data center infrastructure. By adopting these innovations, new data centers can fulfill the demands for resource utilization, reliability, performance, and efficiency. The diskless architecture is quickly gaining popularity due to the emergence of new service challenges and the rapid advancements in hardware technology. This architecture involves deploying local disks of servers separately to allow the decoupling and reorganization of multi-level hierarchical resources, enabling independent expansion and flexible sharing of different types of hardware. Moreover, it offloads tasks that general-purpose CPUs cannot perform to dedicated data processors, thereby breaking away from the conventional CPU-centric processing logic. Therefore, enterprises can optimize the usage of hardware resources on a global level and achieve optimal energy efficiency ratios in their hardware combinations. OceanDisk Smart Disk Enclosure Building a Storage Base for Data Centers in the Multi-Cloud Era In response to the growing popularity of diskless server architecture, Huawei has launched the OceanDisk Smart Disk Enclosure. The product helps cloud and Internet data centers achieve green and energy-efficient management, high performance, and high reliability in the following ways: • OceanDisk connects to servers through NoF high-speed Ethernet networks and offloads complex data storage capabilities to smart disk enclosures. This approach enables OceanDisk to deliver performance levels comparable to that of local disks. • The diskless server architecture fully utilizes the advantages of decoupled storage and compute. It implements independent storage and compute elasticity, and does not require data migration during CPU computing power upgrade. • The large-ratio erasure code (EC) and deduplication and compression capabilities reduce cabinet space and power consumption each by 40%. • Multiple reliability technologies, such as disk sub-health management and intelligent slow disk optimization, are used to achieve system-level reliability. Data disk faults can be predicted, visualized, and managed, greatly simplifying O&M. The challenges of rapid data growth and the need to reduce costs and improve efficiency will persist alongside new services like cloud and internet. The unstoppable trend towards an efficient, intensive, and decoupling diskless architecture for data centers presents new opportunities for industry transformation. This diskless architecture is flexible and allows for refined resource utilization, as well as green and low-carbon energy consumption. This will help data centers reduce computing power waste and achieve green, intensive development, opening up new possibilities for industry transformation. Disclaimer: The views and opinions expressed in this article are those of the author and do not necessarily reflect the official policy, position, products, and technologies of Huawei Technologies Co., Ltd. If you need to learn more about the products and technologies of Huawei Technologies Co., Ltd., please visit our website at e.huawei.com or contact us.","filter_flag":1}
{"title":"BYD and Alexander Dennis partner on Scottish buses - transportandenergy - Transport + Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA0LzE4L2FsZXhhbmRlci1kZW5uaXMtc3RhZ2Vjb2FjaC1ieWQtc2NvbGFuZC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA0LzE4L2FsZXhhbmRlci1kZW5uaXMtc3RhZ2Vjb2FjaC1ieWQtc2NvbGFuZC_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA0LzE4L2FsZXhhbmRlci1kZW5uaXMtc3RhZ2Vjb2FjaC1ieWQtc2NvbGFuZC_SAQA","guidislink":false,"published":"Tue, 18 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=108, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA0LzE4L2FsZXhhbmRlci1kZW5uaXMtc3RhZ2Vjb2FjaC1ieWQtc2NvbGFuZC_SAQA?oc=5\" target=\"_blank\">BYD and Alexander Dennis partner on Scottish buses - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BYD and Alexander Dennis partner on Scottish buses - transportandenergy - Transport + Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vdHJhbnNwb3J0YW5kZW5lcmd5LmNvbS8yMDIzLzA0LzE4L2FsZXhhbmRlci1kZW5uaXMtc3RhZ2Vjb2FjaC1ieWQtc2NvbGFuZC_SAQA?oc=5\" target=\"_blank\">BYD and Alexander Dennis partner on Scottish buses - transportandenergy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Transport + Energy<\/font>","source.href":"https:\/\/transportandenergy.com","source.title":"Transport + Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Low-Carbon Energy\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Vehicle manufacturer Alexander Dennis and battery firm BYD UK have announced the delivery of 39 zero-emission buses to Stagecoach in Scotland as part of a partnership of the firms. The 24 BYD AD Enviro200EV single deckers and 15 BYD AD Enviro400EV double deckers have been allocated to Stagecoach’s operations across Scotland. Some 13 buses for Perth joined nine earlier vehicles to convert all local services in the city to electric. Another 11 buses have also made the city network of Dunfermline into zero emissions. A further 15 vehicles joined existing BYD–Alexander Dennis electric buses in Aberdeen and Ayrshire as well. Together with deliveries from earlier orders, Stagecoach now operates 85 BYD–Alexander Dennis electric buses in Scotland. The new buses were part-funded by the Scottish Government through Phase 1 of the Scottish Zero Emission Bus Challenge Fund (ScotZEB), which aims to help achieve targets to reduce greenhouse gas emissions, contribute to the delivery of Low Emission Zones, and encourage inward investment and growth in the supply chain of zero carbon vehicle and energy solutions. State-of-the-art Sam Greer, Stagecoach Regional Director for Scotland, said: “As part of our drive to target a net zero UK bus fleet by 2035, we are delighted to deliver the UK’s first all-electric city bus networks, building further on the investment made in new zero emission buses in a number of places in the UK. These new state-of-the-art electric buses introduced across Dunfermline, Inverness and Perth will help deliver significantly reduced emissions in these cities. “One of the quickest ways local people can help deliver net zero is by switching from cars to buses, as well as walking and cycling more. We look forward to continuing to work in partnership with the Scottish Government and local transport authorities on measures to deliver more priority for bus passengers, more reliable services, simpler ticketing and the best value fares.” Great fit Alexander Dennis National Account Manager, Marie Connell, said: “We are delighted to continue to support Stagecoach as it transitions to a zero-emission bus fleet across Scotland. Our single deck and double deck electric buses are a great fit for services in Ayrshire, Dunfermline, Perth and Aberdeen, often joining earlier examples of the same type. “Customers will love the smooth acceleration, air conditioning and comfortable Alexander Dennis SmartSeats, while drivers will benefit from a familiar vehicle. Thanks to the Scottish Government’s support through ScotZEB, these buses have helped to underpin skilled jobs and apprenticeships in the UK bus manufacturing industry.” Frank Thorpe, Managing Director, BYD UK, said: “This latest delivery illustrates the excellent progress Stagecoach is making in implementing zero-emission electric bus fleets in key towns and cities in Scotland, with the support of ScotZEB. Through pioneering battery technology and innovation in new energy products, BYD in partnership with Alexander Dennis, is proud to be involved in helping Stagecoach transition its bus fleets to clean eMobility solutions, that are kinder to the environment, providing even more passengers in Scotland with accessible eco-friendly bus transportation.” Image courtesy of Alexander Dennis Share this: LinkedIn Twitter Facebook Email ","filter_flag":1}
