{"title":"Welcoming Caroline: Veolia Deploys Electric Telehandler at Integrated Waste Management Facility – FM Industry - FM Industry","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2ZtaW5kdXN0cnkuY29tLzIwMjMvMDcvMTEvd2VsY29taW5nLWNhcm9saW5lLXZlb2xpYS1kZXBsb3lzLWVsZWN0cmljLXRlbGVoYW5kbGVyLWF0LXNvdXRod2Fyay1pbnRlZ3JhdGVkLXdhc3RlLW1hbmFnZW1lbnQtZmFjaWxpdHkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2ZtaW5kdXN0cnkuY29tLzIwMjMvMDcvMTEvd2VsY29taW5nLWNhcm9saW5lLXZlb2xpYS1kZXBsb3lzLWVsZWN0cmljLXRlbGVoYW5kbGVyLWF0LXNvdXRod2Fyay1pbnRlZ3JhdGVkLXdhc3RlLW1hbmFnZW1lbnQtZmFjaWxpdHkv0gEA?oc=5","id":"CBMiiwFodHRwczovL2ZtaW5kdXN0cnkuY29tLzIwMjMvMDcvMTEvd2VsY29taW5nLWNhcm9saW5lLXZlb2xpYS1kZXBsb3lzLWVsZWN0cmljLXRlbGVoYW5kbGVyLWF0LXNvdXRod2Fyay1pbnRlZ3JhdGVkLXdhc3RlLW1hbmFnZW1lbnQtZmFjaWxpdHkv0gEA","guidislink":false,"published":"Tue, 11 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=192, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2ZtaW5kdXN0cnkuY29tLzIwMjMvMDcvMTEvd2VsY29taW5nLWNhcm9saW5lLXZlb2xpYS1kZXBsb3lzLWVsZWN0cmljLXRlbGVoYW5kbGVyLWF0LXNvdXRod2Fyay1pbnRlZ3JhdGVkLXdhc3RlLW1hbmFnZW1lbnQtZmFjaWxpdHkv0gEA?oc=5\" target=\"_blank\">Welcoming Caroline: Veolia Deploys Electric Telehandler at Integrated Waste Management Facility – FM Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FM Industry<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Welcoming Caroline: Veolia Deploys Electric Telehandler at Integrated Waste Management Facility – FM Industry - FM Industry","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL2ZtaW5kdXN0cnkuY29tLzIwMjMvMDcvMTEvd2VsY29taW5nLWNhcm9saW5lLXZlb2xpYS1kZXBsb3lzLWVsZWN0cmljLXRlbGVoYW5kbGVyLWF0LXNvdXRod2Fyay1pbnRlZ3JhdGVkLXdhc3RlLW1hbmFnZW1lbnQtZmFjaWxpdHkv0gEA?oc=5\" target=\"_blank\">Welcoming Caroline: Veolia Deploys Electric Telehandler at Integrated Waste Management Facility – FM Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FM Industry<\/font>","source.href":"https:\/\/fmindustry.com","source.title":"FM Industry","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Listen to this article Veolia has introduced an electric MRF 360 telehandler at its Integrated Waste Management Facility (IWMF) in Southwark as part of a switch from electric to diesel in the UK. The telehandler will be used to load incoming recyclable waste into the bag splitters of the Material Recovery Facility (MRF), which separates the different recyclable materials so they can be sent for reprocessing into new products. Adopting electric mobile plant vehicles supports Southwark Council’s Climate Action Plan and ambitions to reduce carbon emissions from the waste management fleet. Veolia calculates the new telehandler will reduce CO2 emissions by 65 per cent annually (or the equivalent of taking 39 cars off London’s roads) when compared to diesel-powered models. Reduced wear and tear, and lower maintenance requirements for electric machines, mean the equipment is also expected to have a longer lifespan, going beyond 20,000 hours of run time – or five years. The vehicle has been fondly named ‘Caroline’ after the manager who undertook the procurement exercise for this equipment. This is a company first that will reduce our carbon emissions and improve sustainability Advertisement Matthew Crane, Veolia Southwark Regional Manager, says: “We are very proud to welcome this new electric 360 telehandler to our site. This is a company first that will reduce our carbon emissions and improve sustainability as well as helping us on our journey to ecological transformation.” Staff Reporter FMIndustry.com covers the latest news, trends and opinion from the facilities management (FM) and corporate real estate (CRE) sectors. The FM market is currently estimated to be worth USD 1 trillion annually and is projected to grow at a compounded annualised rate of approximately 5% between now and 2026. Author Staff Reporter FMIndustry.com covers the latest news, trends and opinion from the facilities management (FM) and corporate real estate (CRE) sectors. The FM market is currently estimated to be worth USD 1 trillion annually and is projected to grow at a compounded annualised rate of approximately 5% between now and 2026.","filter_flag":1}
{"title":"Explore the 10 Leading Circular Economy Examples in 2024 - StartUs Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvY2lyY3VsYXItZWNvbm9teS1leGFtcGxlcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvY2lyY3VsYXItZWNvbm9teS1leGFtcGxlcy_SAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvY2lyY3VsYXItZWNvbm9teS1leGFtcGxlcy_SAQA","guidislink":false,"published":"Sun, 23 Jul 2023 10:01:08 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=23, tm_hour=10, tm_min=1, tm_sec=8, tm_wday=6, tm_yday=204, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvY2lyY3VsYXItZWNvbm9teS1leGFtcGxlcy_SAQA?oc=5\" target=\"_blank\">Explore the 10 Leading Circular Economy Examples in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Explore the 10 Leading Circular Economy Examples in 2024 - StartUs Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvY2lyY3VsYXItZWNvbm9teS1leGFtcGxlcy_SAQA?oc=5\" target=\"_blank\">Explore the 10 Leading Circular Economy Examples in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","source.href":"https:\/\/www.startus-insights.com","source.title":"StartUs Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The circular economy presents a sustainable alternative to the traditional linear economy — based on the ‘take, make, and dispose’ model — by designing waste out of the system. This innovative approach encompasses a broad spectrum of practices to extend product life cycles, maximize resource efficiency, and promote reuse, repair, and recycling. In the following sections, you will explore various real-world examples of the circular economy, demonstrating its implementation across different industries and sectors. These applications of circular practices span compostable materials, sustainable packages, zero-carbon food waste management, and more. Tree Map reveals the Impact Circular Economy Practices on 10 Industries Based on the Innovation Map, the Tree Map below illustrates the applications of the circular economy across 10 industries in 2024. The circular economy is driving a profound transformation across multiple industries. In the chemicals and materials sector, it encourages the shift towards bio-based, recyclable, and non-toxic materials. The food and beverage industry promotes sustainable farming, reduces food waste, and encourages packaging innovation. In manufacturing, fashion, and textiles, circular economy inspires design for longevity, repairability, and recyclability. This fosters a move away from the traditional ‘take-make-waste’ model. Automotive and transportation are also evolving through shared mobility, electrification, and extended product life cycles. The renewable energy sector benefits from improved battery lifecycles and efficient resource use with circular economy solutions. Regenerative farming practices and waste-to-resource approaches are gaining ground in agriculture. The construction sector focuses on sustainable materials, energy-efficient designs, and buildings that are repurposed or disassembled. Finally, the circular economy drives the adoption of product-as-a-service models, design for repair, and comprehensive e-waste recycling in electronics. Interested to explore all 3700+ circular economy startups & scaleups? Book Demo Global Startup Heat Map covers 3753 Circular Economy Startups & Scaleups The Global Startup Heat Map below highlights the global distribution of the 3753 exemplary startups & scaleups that we analyzed for this research. Created through the StartUs Insights Discovery Platform that covers 3 790 000+ startups & scaleups globally, the Heat Map reveals that Western Europe has a high concentration of circular economy companies, followed by the US. Below, you get to meet 10 out of these 3753 promising startups & scaleups as well as the solutions they develop. These emerging circular economy companies are hand-picked based on criteria such as founding year, location, funding raised, & more. Depending on your specific needs, your top picks might look entirely different. Circular Economy Applications across 10 Industries 1. Chemicals & Materials Green chemistry keeps the circular economy approach central to chemicals and materials production, reducing their carbon footprint. This also leads to more recyclable and reusable raw materials for manufacturing. Further, chemical and material manufacturers are leveraging bio-based raw materials to replace fossil-based materials. Such materials, like bioplastics, are easily recycled or composted. Industrial symbiosis is another example of circular economy in the chemicals industry where one waste stream becomes the input for another industry or process, generating value. For example, waste heat from chemical processes runs power generation systems to produce electricity. Lastly, chemical leasing allows manufacturers to retain ownership of their products and generate revenue for the performance of chemicals, optimizing consumption. ReSolved Technologies advances Closed-Loop Plastic Recycling ReSolved Technologies is a Dutch startup that offers a closed-loop plastic recycling solution. The startup’s solvent-based recycling technology upcycled engineering plastics from complex waste streams. Engineering plastics are difficult to recycle due to their complex compositions and the presence of legacy additives. Resolved Technologies’ solution offers a way to separate different types of plastics and remove a broad range of additives, including colorants and legacy additives. The company’s technology is particularly relevant for the circular economy as the material of an end-of-life product is recycled and used to produce the same type of product. This reduces waste and also decreases the demand for virgin materials, promoting sustainability. Moreover, the startup’s solvent-based recycling technology complements existing mechanical recycling infrastructure, offering additional opportunities to treat complex waste streams. 2. Food & Beverage The food and beverage industry leverages circular economy solutions to reduce food waste, mitigate package waste, and generate energy. For instance, some food businesses use end-of-life and surplus products as ingredients for other food products, like beer. This food waste also finds use in generating bioenergy through anaerobic digestion, providing a renewable energy source. Matching supply and demand by using technologies like predictive inventory planning also plays a crucial role in reducing food waste. Alongside other initiatives, food and beverage chains, including restaurants, are significantly integrating plant-based products to replace traditional animal-based foods. This shift, driven by the growing understanding of animal agriculture’s environmental impact and health-conscious alternatives, reduces water and land usage. Simultaneously, the industry is adopting plant-sourced materials to replace plastic packaging. This decreases the industry’s carbon footprint, enhancing environmental sustainability in production and last-mile deliveries. CIRCULAR FOOD makes Upcycled Flour CIRCULAR FOOD is an Italian startup that manufactures upcycled flour. The startup’s patented technology converts by-products of distillation and fermentation processes into flours. It reduces waste and also finds use as an ingredient in a variety of food items. Circular Food’s approach promotes the principle of “waste as a resource”. By finding a use for materials that would otherwise be discarded, the startup is reducing waste, promoting sustainability, and creating value. 3. Packaging As global governments enforce bans on single-use plastic, the packaging industry is turning towards plant-sourced raw materials to create sustainable packaging solutions. This leads to the rise of bio-based materials an alternative to traditional plastics. They have beneficial properties of traditional plastics, such as durability and flexibility, while offering significant environmental benefits, including reusability and biodegradability. Apart from biodegradable packaging, eco-design and recyclable packages are prime examples of circular economy approaches in the packaging sector. They improve material recovery at the end of the life of products and eliminate packages reaching landfills and oceans. Thus, integrating the circular economy in packaging reduces carbon footprint across industries. Treetop Biopak manufactures Compostable Packages Treetop Biopak is a UK-based company that makes compostable packages. It utilizes renewable resources, such as corn starch, to produce biopolymers that are compostable and replace fossil-based plastics. The company offers compostable bags, stretch film, tubular net, shrink film, and adhesive tape. These products are suitable for applications from fresh produce and bakery products to garments, electronics, and more. The packaging solutions are durable, puncture-resistant, water-resistant, and printable, making them a viable alternative to conventional plastic packaging. 4. Manufacturing Product-as-a-service business model allows manufacturers to retain product ownership and customers pay for usage rather than outright ownership. This encourages durability and maintenance, extending the product life cycle. Another application of the circular economy is remanufacturing. This way, used products are disassembled and their components are recycled into new products, reducing waste and demand for virgin resources. 3D printing enables on-demand production, reduces overproduction, lowers waste, and permits efficient and easily customizable designs. Additionally, prioritizing energy efficiency and utilizing renewable energy sources in operations are pivotal in reducing the environmental impact of manufacturing operations. Material selection with a preference for easily recyclable materials for product development and designs that allow for easy disassembly further enhances product recyclability. Batch.Works leverages Smart & Circular Manufacturing Batch.Works is a Dutch startup that advances smart and circular manufacturing. The startup leverages circular materials, on-demand production, re-manufacturing, short supply chains, digital warehousing, and digital manufacturing. It uses recycled materials from traceable sources and on-demand digital production ensures just-in-time (JIT) manufacturing, reducing waste and overproduction. The startup also offers a service to take back and find new uses for their products, promoting a circular lifecycle. Its local production model creates short supply chains, reducing transportation costs and increasing transparency and agility. Digital warehousing also eliminates storage fees and emissions from shipping stock. These technologies reduce waste and improve supply chain efficiency while maintaining cost-effectiveness. 5. Fashion & Textiles The utilization of recycled or renewable materials, including organic fibers and synthetic materials reclaimed from waste, reduces the need for virgin materials. Design for longevity ensures products can be worn for longer periods of time, thereby reducing the frequency of new purchases and extending the life of garments. Similarly, repair and maintenance services as well as resale and rental platforms keep clothes in use for longer, reducing production demand. Innovations in technology are enabling the recycling of textiles into new garments, an approach known as “closed-loop” recycling. This goes beyond traditional recycling and seeks to retain the full value of the original material through chemical recycling. Brands are also exploring innovative business models like take-back programs to promote reuse and recycling while fostering customer loyalty. Circular Fashion LA enables Zero-Waste Fashion Circular Fashion LA is a US-based direct-to-consumer (DTC) company that implements zero-waste fashion. The startup’s subscription services allow customers to repair, refit, redye, and redesign their clothes. This offers clothes a new lease of life and also reduces the need for new clothes, making their wardrobe more unique and healthier for the planet. In addition, the company offers a recycling service, where customers send in clean clothing and home textiles they no longer want. This reduces the amount of textile waste that ends up in landfill. Circular Fashion LA further leverages zero-waste packaging and natural dyes to improve sustainability. 6. Automotive & Transportation Consumers are giving away ownership of vehicles and relying on on-demand mobility to reduce their carbon footprint. This shift reduces the overall number of vehicles needed, leading to fewer resources consumed in manufacturing and lower volumes of end-of-life waste. Electric vehicles (EVs) represent another critical component in reducing emissions and with potential for battery reuse and recycling. Digital platforms and technologies optimize logistics and transport operations to avoid unnecessary trips and reduce fuel consumption. Automakers are increasingly integrating recycled materials into new vehicles and developing recyclable components to minimize waste at the end of a vehicle’s life. Remanufacturing is also gaining traction in the industry, where parts from end-of-life vehicles are restored or refurbished for use in new vehicles. This approach reduces waste and also saves energy and resources compared to manufacturing new parts. Circunomics develops a Circular Battery Platform Circunomics is a German startup that provides a circular battery platform. It allows automotive original equipment manufacturers (OEMs) to integrate used batteries in new vehicles, delivering significant cost savings. The startup’s solution also features battery lifecycle management, first-life analytics, and second-life simulations. This, in turn, facilitates the transfer of used batteries into second life and recycling at scale. 7. Renewable Energy The renewable energy industry is advancing and leveraging the circular economy. For example, renewable energy systems like solar panels and wind turbines power clean operations across industries while these systems use material innovations to reduce carbon footprint. Manufacturers increase the life cycle of batteries, particularly in energy storage and EVs, by refurbishing used batteries or repurposing them for less demanding applications. This extends battery life and reduces the need for new materials. Moreover, the renewable energy industry is embracing service-based business models to invest in durable, efficient technology and take responsibility for end-of-life management. At the system level, this enhances grid flexibility and energy efficiency, reducing waste in energy distribution. The deployment of smart grids, for instance, allows for better matching of energy supply and demand to reduce energy loss. All these applications showcase the renewable energy industry’s commitment to a more sustainable and circular future. Varme Energy advances Waste-to-Energy (WTE) Varme Energy is a Canadian startup that makes waste-to-energy plants. The startup builds a portfolio of WTE facilities with integrated carbon capture and storage (CCS). A lot of waste heat is simply released into the environment, which contributes to climate change. Varme Energy’s technology allows industries to use this waste heat and generate electricity, which displaces fossil fuels and reduces emissions. This eliminates waste from reaching landfills and enables a sustainable solution for non-recyclable waste. 8. Agriculture Regenerative farming techniques improve soil health, enhance biodiversity, and sequester carbon. This improves the productivity and resilience of the land over time. Crop rotation and cover crops maintain soil health and manage pests naturally. This approach decreases reliance on external inputs and increases farm productivity and sustainability. In livestock farming, there is an increasing movement towards integrating animals into cropping systems to form mixed farming systems. Businesses are upcycling agricultural side streams into animal feeds, thereby reducing cultivation for feed. The concept of “closing the loop” is also applied to waste management in agriculture. Rather than being discarded, organic waste, such as manure and crop residues, is composted and returned to the soil as a nutrient-rich amendment. Further, precision irrigation and rainwater harvesting prioritize water efficiency. New business models also directly connect farmers with consumers, reducing food waste in the supply chain and bringing consumers closer to the source of food. SWING Biomethane produces Biomethane SWING Biomethane is a French startup that generates biomethane. The startup collects organic residues and agricultural waste from local farmers and converts it into biogas. It then purifies and upgrades into biomethane – equivalent to the natural gas used daily by households or industries. The biomethane is either injected into the gas grid or liquefied into bio-LNG for the transportation sector. In addition to energy production, SWING Biomethane provides farmers with a sustainable fertilizer derived from the production of biomethane, known as digestate. It reduces their dependence on fossil fertilizers and greenhouse gas emissions. Swing Biomethane’s approach lowers waste and creates local jobs, supports local farmers, and contributes to the decarbonization of the gas sector. 9. Construction Construction companies are integrating design for disassembly approach. This anticipates a building’s end-of-life from the design stage, ensuring component reuse when the building is no longer needed. The use of reclaimed materials, like concrete and bricks, in new constructions reduces the demand for new materials and construction waste. Prefabrication and modular construction methods, powered by 3D printing, are also gaining popularity. It reduces waste and makes it easier to reuse and recycle materials. Further, the construction industry is adopting renewable energy and energy-efficient integrations to decrease energy consumption. Buildings-as-a-service shifts the focus from selling a product to selling a service, encouraging constructors to build for longevity. revitalyze.io facilitates Building Component Reuse French startup revitalyze.io promotes building component reuse. The startup’s platform features digital inventory analysis of buildings to classify components according to condition, de-constructability, dimensions, and position. This allows material users like architectural offices, designers, and traders to source components below market price. The platform also supports automated matching and provides alerts about nearby materials, as well as connects businesses directly with suppliers. For project developers, municipalities, and building owners, the platform simplifies inventory analysis and increases sales. This approach reduces disposal costs, generates additional revenue, and actively contributes to a more circular economy. 10. Electronics Modular and repair-friendly architecture is gaining popularity in the consumer electronics market, reducing the need for new products. In parallel, the electronics industry is emphasizing the use of recycled or recyclable materials in product manufacturing. Companies are using reclaimed metals and other materials from end-of-life electronics in new devices, decreasing the need for virgin materials. In addition, the industry is focusing on comprehensive e-waste management strategies. With recycling programs, take-back schemes, and partnerships with recycling companies, manufacturers are recovering and reusing valuable materials from old electronics. There is also an increased focus on energy efficiency in electronic products to reduce power consumption. Circular Technologies simplifies IT Device Management Circular Technologies is an Italian startup that develops an IT device management solution. The startup’s solutions are reSource for circular IT procurement, reCover for circular IT asset disposition, and reCert for circular certification. reSource enables businesses to renew their IT infrastructure with certified refurbished products. This allows businesses to maximize their IT investments and achieve carbon neutrality. On the other hand, reCover allows businesses to cash out on their used devices. It helps businesses develop a tailored IT asset disposition (ITAD) program and maximize the value of used assets. reCert further allows businesses to calculate the economic and environmental impact of their transactions and certify them for sustainability reporting. This helps businesses demonstrate their commitment to sustainability and the circular economy. Discover All Circular Economy Companies Future innovations in the circular economy will revolve around enhancing product life cycles, leveraging technology, and promoting systemic shifts. Advances in material science extend product lifespans and improve recyclability, while digital technologies like AI and blockchain will enable precise resource tracking and optimization. Additionally, biofabrication and synthetic biology offer new ways to create products without resource extraction. Together, these innovations have the potential to redefine resource consumption and waste generation. Get in touch to identify specific circular economy companies & solutions that advance your business!","filter_flag":1}
{"title":"Towards a Circular Plastics Economy: India's Actions to #BeatPlasticPollution - TERI","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRlcmlpbi5vcmcvYXJ0aWNsZS90b3dhcmRzLWNpcmN1bGFyLXBsYXN0aWNzLWVjb25vbXktaW5kaWFzLWFjdGlvbnMtYmVhdHBsYXN0aWNwb2xsdXRpb27SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRlcmlpbi5vcmcvYXJ0aWNsZS90b3dhcmRzLWNpcmN1bGFyLXBsYXN0aWNzLWVjb25vbXktaW5kaWFzLWFjdGlvbnMtYmVhdHBsYXN0aWNwb2xsdXRpb27SAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnRlcmlpbi5vcmcvYXJ0aWNsZS90b3dhcmRzLWNpcmN1bGFyLXBsYXN0aWNzLWVjb25vbXktaW5kaWFzLWFjdGlvbnMtYmVhdHBsYXN0aWNwb2xsdXRpb27SAQA","guidislink":false,"published":"Wed, 12 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=193, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRlcmlpbi5vcmcvYXJ0aWNsZS90b3dhcmRzLWNpcmN1bGFyLXBsYXN0aWNzLWVjb25vbXktaW5kaWFzLWFjdGlvbnMtYmVhdHBsYXN0aWNwb2xsdXRpb27SAQA?oc=5\" target=\"_blank\">Towards a Circular Plastics Economy: India's Actions to #BeatPlasticPollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TERI<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Towards a Circular Plastics Economy: India's Actions to #BeatPlasticPollution - TERI","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRlcmlpbi5vcmcvYXJ0aWNsZS90b3dhcmRzLWNpcmN1bGFyLXBsYXN0aWNzLWVjb25vbXktaW5kaWFzLWFjdGlvbnMtYmVhdHBsYXN0aWNwb2xsdXRpb27SAQA?oc=5\" target=\"_blank\">Towards a Circular Plastics Economy: India's Actions to #BeatPlasticPollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TERI<\/font>","source.href":"https:\/\/www.teriin.org","source.title":"TERI","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"12 Jul 2023 World Environment Day 2023 serves as an important reminder that the actions we take to mitigate plastic pollution have a significant impact. Now, more than ever, we must intensify these efforts and swiftly transition to a circular economy. Avanti Roy-Basu and Girija K Bharat say that as the world celebrates World Environment Day in 2023, focusing on “solutions to plastic pollution under the campaign #BeatPlasticPollution”, it is crucial to understand that each one of us has multiple roles to play in addressing this global crisis. Plastics are ubiquitous in our natural environment. They leave a substantial carbon footprint throughout their life cycle, accounting for 3.4 per cent of global greenhouse gas emissions. Plastic waste is not just a solid waste management issue, but a chemical waste issue as well. Throughout the life cycle of plastics, especially when plastic waste is not scientifically managed, harmful chemicals are released into the air, water, and soil, posing severe risks related to the environment and human health. Plastics, especially single-use plastic (SUP) products are ubiquitous and therefore have severe environmental, social, economic, and health consequences. As the world celebrates World Environment Day in 2023, focusing on “solutions to plastic pollution under the campaign #BeatPlasticPollution”, it is crucial to understand that each one of us has multiple roles to play to address this global crisis. The need of the hour is for governments, industries, packaged goods companies, waste management workers, consumers, innovators, and the public—across the plastic value chain—to work together to design and implement solutions. Current Scenario of Plastic Waste Management in India India is the fifth-highest generator of plastic waste in the world. In 2022, India banned single-use plastic items that have low utility but are often littered, harming land and marine ecosystems. In 2019–2020, India generated 34.7 lakh tonnes per annum (TPA) of plastic waste (approximately), with the highest generators being Maharashtra (13%), followed by Tamil Nadu and Gujarat (12% each). The plastic waste generation by Indian states and Union Territories (UTs) during 2019–2020 is given in Figure 1. Goa, Delhi and Kerala have the highest, whereas Nagaland, Sikkim and Tripura have the lowest per capita plastic waste generation in the country. Plastic waste generated in India is currently utilized for recycling, road construction, waste-to-energy plants, waste-to-oil plants, and in cement plants for co-processing. All the plastic manufacturing and recycling units are mandated to be registered with the concerned State Pollution Control Boards (SPCBs)\/Pollution Control Committees (PCCs). There are 4953 registered units in India. However, 823 unregistered plastic manufacturing units have been reported. Also, a system of marking or labelling on each plastic carry bag and multi-layered packaging is mandated in the country that has been complied with by 14 States\/UTs. In terms of non-compliance, 25 States\/UTs have reportedly imposed fines, issued notices, closure directions to the defaulters and seized banned plastic material. Plastic Waste Management Informal Sector: Enabling Transition to Formalization India faces a significant challenge in managing plastic waste due to its large population and growing economy. With 1.4 billion people, India produced an estimated 34.7 lakh TPA of plastic waste annually, of which 15.8 lakh TPA was recycled, and 1.67 lakh TPA of plastic waste was co-processed. Efforts to manage plastic waste have been implemented at the national, state, and local levels. In 2014, the Indian government launched the Swachh Bharat Abhiyaan (Clean India Mission) to make India cleaner and free from open defecation and litter. The mission includes provisions for plastic waste management, such as promoting waste segregation at the source and setting up plastic waste management systems. Several states have implemented their own regulations and initiatives for plastic waste management. Despite these efforts, plastic waste management in India remains a significant challenge due to a lack of infrastructure, low waste collection rates, inadequate funding, and lack of recognition to the informal recycling sector (IRS). The IRS significantly contributes to collect and recycle municipal waste across India. The IRS involves at least 15 million people globally, responsible for an estimated 58 per cent of the collected and recycled plastic waste. It is an important link in the plastics value chain, has great potential to improve end-of-life management, and contributes to the recovery of plastics in problematic municipal waste management systems. The IRS sector workers have key skills, hands-on knowledge, and extensive waste management networks, however, their significant role in mitigating plastic pollution often goes unnoticed and underappreciated. The IRS is a very important component of the global plastic waste management system; hence owing to their critical role, the informal sector management is being included in the plastic treaty. Policy Solutions to Address Plastic Pollution There are several global and national environmental governance initiatives that address and implement solutions for plastic waste management, especially on the issues of marine plastic litter and microplastics, and provide expert insight and guidance to countries. Some of the international and national initiatives are discussed in this section. International Governance Initiatives In May 2022, the fifth United Nations Environment Assembly (UNEA 5.2) adopted the decision to initiate negotiations for a new legally binding, global treaty to end plastic pollution. An Intergovernmental Negotiating Committee (INC) was set up for a new international legally binding treaty on plastic pollution by 2024. The fourth session of UNEA (UNEA-4) in March 2019 adjourned with 23 adopted resolutions, out of which Resolution 6 was on ‘Marine Plastic Litter and Microplastics’, and Resolution 9 on ‘Addressing Single-use Plastic Products Pollution’. India piloted an important resolution on SUP management that was adopted with consensus. In the third session (UNEA-3) in December 2017, a ‘Joint call for an international legally binding agreement on plastics and plastic pollution’ was presented. An Ad-Hoc Open-Ended Expert Group (AHOEEG) was created to present options to combat marine plastic litter and microplastics that later met thrice in May 2018, December 2018, and November 2019. By 2019, a total of 187 countries committed to solving the plastic waste crisis by adding plastic to the international treaty: ‘Basel Convention on the Control of Transboundary Movements of Hazardous Wastes and Their Disposal’. The ongoing research on plastic and its chemical additives also raises awareness about their relevance to the Stockholm Convention on persistent organic pollutants (POPs) and the Rotterdam Convention on hazardous chemicals. National Policy Interventions of India India has taken sound and effective measures for plastic waste management by putting a ban on single-use plastic items (having low utility and high littering potential) and imposing Extended Producer Responsibility (EPR) on plastic packaging. The policy initiatives made by the Ministry of Environment, Forest and Climate Change (MoEFCC) and the Ministry of Housing and Urban Affairs (MoHUA) are discussed below. a) Regulations by the MoEFCC The Government of India notified the Plastic Waste Management Rules, 2016, in suppression of the earlier Plastic Waste (Management and Handling) Rules, 2011, wherein the minimum allowed thickness of plastic carry bags was increased from 40 microns to 50 microns. Thereafter, the MoEFCC notified the Plastic Waste Management (Amendment) Rules, 2018, that phased out the multilayered plastic (MLP), which is “non-recyclable, or non-energy recoverable, or with no alternate use.” The Plastic Waste Management (Amendment) Rules, 2021, prohibited the manufacture, import, stocking, distribution, sale, and use of SUP, including polystyrene and expanded polystyrene, commodities from July 1, 2022. The SUP products include earbuds with plastic sticks, plastic sticks for balloons, plastic flags, candy sticks, and many others. To encourage reuse, the allowed thickness of plastic carry bags was increased from 50 to 75 microns from September 30, 2021, and to 120 microns from December 31, 2022. There is a blanket ban already in place on sachets using plastic material for packing, storing, or selling pan masala, gutkha, and tobacco. Moreover, the MoEFCC notified the Guidelines on EPR for plastic packaging through the Plastic Waste Management (Amendment) Rules, 2022 stipulating mandatory targets on EPR, recycling of plastic packaging waste, reuse of rigid plastic packaging and use of recycled plastic content. EPR is a regulatory approach according to which PIBOs (Producers, Importers and Brand Owners) are required to ensure responsible collection channelization, treatment and\/or disposal of plastic waste. Plastics are categorized into four groups under the EPR Guidelines, namely rigid packaging, flexible packaging, multilayered packaging, and plastic sheet packaging. b) Regulations by the MoHUA Under Swachh Bharat Mission-Urban (SBM-U) 2.0, the MoHUA has made efforts towards source segregation, collection, transportation, and processing of plastic waste. Material Recovery Facility (MRF) has been set up in all urban local bodies (ULBs), and awareness generation initiatives have been taken up for reducing SUP products and encouraging the use of substitute products. A ‘Plastic Waste Management Advisory’ was developed on sustainable management of plastic waste through ‘reduce, reuse, recycle and recover’ techniques. Also, ‘Swachh Survekshan’ in 2019 (an annual survey of cleanliness, hygiene and sanitation in villages, cities and towns) and ‘Star Rating Protocol’ in 2018 (aimed to institutionalize a mechanism for cities to achieve garbage-free status and sustainable cleanliness) were aligned with Plastic Waste Management (Amendment) Rules, 2021 to encourage cities to phase out SUPs. Apart from the constitution of a National Level Taskforce constituted by the MoHUA, all States and UTs have instituted Special Task Force (STF) for the elimination of identified SUP items and the development of comprehensive plastic waste management action plans. For effective monitoring of compliance with plastic waste management regulations, several online platforms are made functional, including the National Dashboard on the elimination of SUPs, Central Pollution Control Board (CPCB) Monitoring Module for Compliance on Elimination of SUPs, and CPCB Grievance Redressal App. Circular Plastics Economy Thrust by Governments Circular economy involves every stage of a plastic product’s lifetime from its production till it reaches the customer and ends up as plastic waste. It refers to a closed loop system in which the materials constantly flow without leaking into the environment, keeping the value of plastics in the economy. The Ellen MacArthur Foundation states that circular plastics economy approach offers several economic, social, and climate benefits: reduce annual volume of plastics entering our oceans by 80 per cent by 2040, reduce greenhouse gas emissions by 25 per cent, generate savings of USD 200 billion per year, and create 700,000 additional jobs. In India, 60 per cent of plastics (PET bottles, HDPE containers, PVC pipes) are recycled; these are mostly downcycled in an informal setting, and often ends up in landfills, open environment or ends up in oceans. Globally, it is estimated that only 9 per cent of plastic waste generated between 1950 and 2015 was recycled. India has the highest plastic recycling rate ranging from 47 to 60 per cent. India brought forward the EPR guidelines to strengthen circular economy of plastic packaging waste and allow for development of the waste management sector through involvement of formal and informal sector. The year-wise target for minimum level of recycling of plastic waste across different categories of plastic packaging is given in Figure 2. As per Plastic Waste Management Rules, 2016, Central Pollution Control Board, SPCBs and PCCs enforce the provisions of the rules, and ensure the registration of plastic brand owners and fulfilment of EPR. Various initiatives as per the EPR guidelines have been made to promote circular economy in the plastic waste management space. The enforceable prescription of minimum level of recycling of plastic packaging waste collected under EPR, along with the use of recycled plastic content will reduce plastic consumption and support recycling of plastic packaging waste. Other initiatives include centralized EPR portal (single point data repository for EPR guidelines), sale and purchase of EPR certificates (to set up a market mechanism), and environmental compensation towards non-fulfilment of EPR targets. In 2021, a Roadmap for Circular Economy for Plastics in India was developed by The Energy and Resources Institute (TERI) that entailed three key priority areas, namely adoption of sustainable material solutions, increase supply of good quality secondary plastics feedstock, and promote alternative uses of plastics waste. Private Sector Engagements for Plastic Waste Management Public-private programmes across the world use various innovative and scalable approaches through grants, technical assistance, and knowledge exchange platforms to manage plastic pollution. Few examples of effective private sector engagements include the World Economic Forum’s The Global Plastic Action Partnership (GPAP), the Ellen MacArthur Foundation’s Plastic Initiative, etc., that implement actionable programmes on plastic waste management. The GPAP is a knowledge exchange network that brings together plastic pacts and National Plastic Action Partnerships (NPAP). Currently, there are 13 Plastic Pacts and various NPAPs for many countries including India (Maharashtra) that engage businesses, government institutions, civil society organizations, NGOs, and citizen groups to build a shared vision of sustainable plastic waste management. Youth-focused initiatives engage and empower younger people in solving the plastic waste challenges. Various tools are used to involve and engage the youth—relevant curriculum for action-based outreach on ocean plastic pollution; literature review to develop a rapid assessment tool for measuring the impact of plastic pollution interventions; storytelling methods on social media to sensitize on plastic pollution. In April 2023, a new phase of the United Nations Environment Programme (UNEP) initiative, Tide Turners, a youth-led movement for improved plastic waste management in India, the UN, and the United Kingdom, was introduced for building capacities of youth and create a global movement against plastic pollution. Another example of private sector engagement is the Plastic Action Platform by rePurpose that aimed towards plastic waste management through grassroots innovation. The project covers 26 countries including India and aims to eliminate plastic waste generation substantially, and improve the lives of 10,000+ marginalized waste workers. In India, rePurpose Global partnered with Waste Ventures India to develop Project Neela Sapana in Chennai to arrest the marine leakage of MLPs by enabling the set-up of a materials recovery facility. About 80,8003 pounds of MLP and low-value plastic (LVP) have been collected and recovered as part of this project. Conclusion and Recommendations Considering the actions taken up at the national and state levels in India, a range of key considerations are needed to shape sustainable solutions for plastic waste management including uncertainties related to alternatives to SUPs (with respect to environmental fate and socio-economic impacts), challenges faced by the industries, impacts on underprivileged communities, and the informal recycling sector. A set of recommendations for achieving a circular plastics economy for India is given below. Although most states and UTs have imposed restrictions on the manufacture and usage of banned plastic carry bags and other SUP products, it lacks absolute compliance. Institutional mechanisms must be set up to monitor compliance in terms of manufacture and use of banned or restricted plastic items and prevent unscientific disposal of plastic waste. Design changes are needed to restrict the plastics used in new products by either using alternative, sustainable materials or by reducing the size of the products. Also, the lifespan of plastic products can be extended by including durability, reusability, repairability and upgradability in the design process. These aspects will lead to the overall reduction in the generation of plastic waste. Increased engagement of brand owners with ULBs is recommended for efficient plastic waste management through increased networking with plastic waste recyclers. All unregistered units must be brought under the purview of a legal framework and necessary legal actions must be taken to formalize them. There is a need to develop recyclable, cost-effective plastics as a viable substitute to their non-recyclable counterpart, and therefore it is important to explore and unlock the market potential of recycled plastics. Market-based tools such as tax exemptions, subsidies, or grants\/loans may be applied to support businesses to incentivize the prevention, minimization, and recycling of plastic waste. To promote circular plastics economy, systemic change is required from the product design stage as well as a paradigm shift is needed from single use to reuse by improving recycling infrastructure. SUPs can be controlled and eliminated by design alterations as well as by developing multi-use plastics to reduce the ‘use and throw’ consumption pattern. It is crucial to scale up critical infrastructure for plastic waste recycling and adequate investment in end-of-life innovation. Targeted capacity building programmes must be organized through public-private partnership initiatives for important stakeholders such as manufacturers, government officials, waste managers, consumers, representatives of the Producer Responsibility Organizations (PROs), and the informal sector leaders. Institutional Capacity Building initiatives must also be taken up for professionals to help enhance the capacity of governments, business, non-governmental groups, and community institutions to plan and manage better. Creating public awareness (through targeted public campaigns and education initiatives) on plastic waste prevention and minimization will lead to a positive change in the mindsets of people and businesses on production and consumption. Concerted actions by the government, NGOs, private sector, as well as voluntary actions by local authorities, businesses, schools, and communities involved in circular economy approach is pertinent for a sustainable plastic waste management system. The Government of India must bring about a comprehensive and circular economy approach to reduce plastic waste, increase plastics value recovery, and tackle plastic pollution with a goal to achieve ‘zero plastic waste by 2030’. References Bhardwaj, Naina. June 30, 2022. India Briefing. India’s New Plastic Waste Management Rules Effective from July 1, 2022. Accessed from: https:\/\/www.india-briefing.com\/news\/india-new-plastic-waste-management-rules-single-use-plastic-ban-effective-from-july-1-2022-25398.html\/ Central Pollution Control Board (CPCB). 2021. Annual Report 2019–20 on Implementation of Plastic Waste Management Rules, 2016. Accessed from: https:\/\/cpcb.nic.in\/uploads\/plasticwaste\/Annual_Report_2019-20_PWM.pdf Global Plastic Action Partnership (GPAP). 2023. Accessed from: https:\/\/www.globalplasticaction.org\/home International Knowledge Hub Against Plastic Pollution (IKHAPP). 2023. Important but ignored? The role of the informal recycling sector in a prospective international agreement on plastic pollution. Norwegian Institute for Water Research (NIVA). Oslo. International NGOs join hands to tackle plastic pollution. Packing South Asia (PSA). January 16, 2023. Accessed from: https:\/\/packagingsouthasia.com\/type-of-article\/industry-news\/ngos-join-hands-plastic\/ Kapur-Bakshi, S., Kaur, M., and Gautam, S., 2021. Circular Economy for Plastics in India: A Roadmap. New Delhi: The Energy and Resources Institute (TERI). Accessed from: https:\/\/www.teriin.org\/sites\/default\/files\/2021-12\/Circular-Economy-Plastics-India-Roadmap.pdf Karidis, Arlene. September 21, 2022. rePurpose Global’s Approach to Changing Plastic Waste Management. Accessed from: https:\/\/www.waste360.com\/plastics\/repurpose-globals-approach-changing-plastic-waste-management Parliament Library and Reference, Research, Documentation and Information Service (LARRDIS). December 2022. Single-Use Plastic Ban in India. Accessed from: https:\/\/loksabhadocs.nic.in\/Refinput\/New_Reference_Notes\/English\/12122022_171118_102120463.pdf Press Information Bureau (PIB), Government of India. Ministry of Environment, Forest and Climate Change (MoEF&CC). 17 February 2023. A total of 2.26 million tonnes of plastic packaging has been covered under Extended Producer Responsibility (EPR) for the year 2022-23. Accessed from: https:\/\/www.pib.gov.in\/PressReleseDetailm.aspx?PRID=1900282 Press Information Bureau (PIB), Government of India. Ministry of Housing and Urban Affairs (MoHUA). 16 March 2023. Plastic Waste Management. Accessed from: https:\/\/pib.gov.in\/PressReleasePage.aspx?PRID=1907632 Press Information Bureau (PIB), Government of India. Ministry of Environment, Forest and Climate Change (MoEF&CC). 3 March 2022. Historic resolution on Plastic Pollution adopted by 175 countries at the fifth United Nations Environment Assembly. Accessed from: https:\/\/pib.gov.in\/PressReleasePage.aspx?PRID=1802599 Press Information Bureau (PIB), Government of India. Ministry of Environment, Forest and Climate Change (MoEF&CC). 13 February 2023. Extended producer responsibility guidelines to strengthen circular economy of plastic packaging waste and allow for development of the waste management sector through involvement of formal and informal sector. Accessed from: https:\/\/pib.gov.in\/PressReleseDetailm.aspx?PRID=1898892 United Nations Environment Programme (UNEP). 20 April 2023 Press Release. UN, India and UK partner with young leaders globally to combat plastic pollution. Accessed from: https:\/\/www.unep.org\/news-and-stories\/press-release\/un-india-and-uk-partner-young-leaders-globally-combat-plastic Welsch, Chris. 17 February 2022. Bagging plastic and poverty. Accessed from: https:\/\/www.eib.org\/en\/stories\/indian-plastic-solution Avanti Roy-Basu, Associate Director of Mu Gamma Consultants, Gurgaon and Dr Girija K Bharat, Managing Director of Mu Gamma Consultants, Gurgaon. This work was supported by the India-Norway cooperation project on capacity building for reducing plastic and chemical pollution in India. This article and more from TerraGreen can be viewed here: https:\/\/terragreen.teriin.org\/","filter_flag":1}
{"title":"Coastal Park Material Recovery Facility construction project on track - Democratic Alliance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRhLm9yZy56YS8yMDIzLzA3L2NvYXN0YWwtcGFyay1tYXRlcmlhbC1yZWNvdmVyeS1mYWNpbGl0eS1jb25zdHJ1Y3Rpb24tcHJvamVjdC1vbi10cmFja9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRhLm9yZy56YS8yMDIzLzA3L2NvYXN0YWwtcGFyay1tYXRlcmlhbC1yZWNvdmVyeS1mYWNpbGl0eS1jb25zdHJ1Y3Rpb24tcHJvamVjdC1vbi10cmFja9IBAA?oc=5","id":"CBMiY2h0dHBzOi8vd3d3LmRhLm9yZy56YS8yMDIzLzA3L2NvYXN0YWwtcGFyay1tYXRlcmlhbC1yZWNvdmVyeS1mYWNpbGl0eS1jb25zdHJ1Y3Rpb24tcHJvamVjdC1vbi10cmFja9IBAA","guidislink":false,"published":"Wed, 19 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=200, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRhLm9yZy56YS8yMDIzLzA3L2NvYXN0YWwtcGFyay1tYXRlcmlhbC1yZWNvdmVyeS1mYWNpbGl0eS1jb25zdHJ1Y3Rpb24tcHJvamVjdC1vbi10cmFja9IBAA?oc=5\" target=\"_blank\">Coastal Park Material Recovery Facility construction project on track<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Democratic Alliance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Coastal Park Material Recovery Facility construction project on track - Democratic Alliance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vd3d3LmRhLm9yZy56YS8yMDIzLzA3L2NvYXN0YWwtcGFyay1tYXRlcmlhbC1yZWNvdmVyeS1mYWNpbGl0eS1jb25zdHJ1Y3Rpb24tcHJvamVjdC1vbi10cmFja9IBAA?oc=5\" target=\"_blank\">Coastal Park Material Recovery Facility construction project on track<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Democratic Alliance<\/font>","source.href":"https:\/\/www.da.org.za","source.title":"Democratic Alliance","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The City’s Mayoral Committee Member for Urban Waste Management, Alderman Grant Twigg, visited the construction site of the planned Coastal Park Material Recovery Facility (MRF). Once operational, this facility will allow for the dramatic increase in diversion of recyclable material from landfills in Cape Town. Read more below: The City of Cape Town’s Urban Waste Management Directorate is pleased that the construction of a large material recovery facility (MRF) at the Coastal Park landfill site is progressing well. About this Material Recovery Facility: It is designed to receive co-mingled clean and dry recyclables , and separate the materials so that they can be sold and used in manufacturing of new products . The MRF will create a minimum of 100 job opportunities. , and so that they can be . The MRF will create a It is expected that the facility will create capacity for sorting 65 tons of recycled material per day . This will allow the City to extend its separation at source recycling collection programme significantly. Currently expansion of recycling services in Cape Town is constrained by a lack of sorting capacity. . This will allow the City to extend its separation at source recycling collection programme significantly. Currently expansion of recycling services in Cape Town is constrained by a lack of sorting capacity. The MRF building will house mechanical separation equipment , including a bag splitter, a magnetic separator, screens, conveyors and baling facilities for various recyclable materials. The facility also has office facilities for the City and operator of the facility as well as a training centre for education on waste management. , including a bag splitter, a magnetic separator, screens, conveyors and baling facilities for various recyclable materials. The facility also has office facilities for the City and operator of the facility as well as a training centre for education on waste management. This new development will also provide thousands of households in the vicinity of Coastal Park with a new formal nine-bay drop-off facility , that will accept builder’s rubble, mixed waste, garden waste as well as recyclables not taken by the MRF. The drop off will also allow for waste reclamation to recover more recyclables and reusable items that would otherwise have ended up in the landfill site. , that will accept builder’s rubble, mixed waste, garden waste as well as recyclables not taken by the MRF. The drop off will also allow for waste reclamation to recover more recyclables and reusable items that would otherwise have ended up in the landfill site. The project has already won an award for excellence in construction due to innovative techniques used in the preparatory earthworks. Since then civil services, structural work, roads and heating ventilation and air conditioning (HVAC) installation has also been completed on site. due to innovative techniques used in the preparatory earthworks. Since then civil services, structural work, roads and heating ventilation and air conditioning (HVAC) installation has also been completed on site. The facility is expected to start operating around mid-November 2024, but currently construction is progressing ahead of schedule. ‘We are very pleased to see that the work on site is progressing so well that it is ahead of schedule. The project is the next key step in the City’s strategy to fundamentally change our relationship with waste and to minimise our city’s need for additional landfills in future. ‘Increasing plastic pollution is also a global issue. It is affecting even very remote environments. Currently private collection of recycling is prohibitively expensive for many, and use of drop-offs is sometimes inconvenient, so I am very excited for completion of this facility. This will allow thousands more families to start cleaning and separating recyclables from their general waste for collection by the City. ‘In the meantime, we would like to encourage residents to take their recyclables, rubble and garden waste to our drop-off sites that are situated in various areas so that together we can help reduce the waste that goes to landfill,’ said Alderman Twigg.","filter_flag":1}
{"title":"R186m recycling facility in Muizenberg set to operate in 2024 - CapeTown ETC","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhcGV0b3duZXRjLmNvbS9uZXdzL3IxODZtLXJlY3ljbGluZy1mYWNpbGl0eS1pbi1tdWl6ZW5iZXJnLW9wZXJhdGUtMjAyNC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhcGV0b3duZXRjLmNvbS9uZXdzL3IxODZtLXJlY3ljbGluZy1mYWNpbGl0eS1pbi1tdWl6ZW5iZXJnLW9wZXJhdGUtMjAyNC_SAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmNhcGV0b3duZXRjLmNvbS9uZXdzL3IxODZtLXJlY3ljbGluZy1mYWNpbGl0eS1pbi1tdWl6ZW5iZXJnLW9wZXJhdGUtMjAyNC_SAQA","guidislink":false,"published":"Thu, 20 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=201, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhcGV0b3duZXRjLmNvbS9uZXdzL3IxODZtLXJlY3ljbGluZy1mYWNpbGl0eS1pbi1tdWl6ZW5iZXJnLW9wZXJhdGUtMjAyNC_SAQA?oc=5\" target=\"_blank\">R186m recycling facility in Muizenberg set to operate in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CapeTown ETC<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"R186m recycling facility in Muizenberg set to operate in 2024 - CapeTown ETC","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmNhcGV0b3duZXRjLmNvbS9uZXdzL3IxODZtLXJlY3ljbGluZy1mYWNpbGl0eS1pbi1tdWl6ZW5iZXJnLW9wZXJhdGUtMjAyNC_SAQA?oc=5\" target=\"_blank\">R186m recycling facility in Muizenberg set to operate in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CapeTown ETC<\/font>","source.href":"https:\/\/www.capetownetc.com","source.title":"CapeTown ETC","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"A new recycling facility in Muizenberg is on track to start operations in November next year. The new material recovery facility (MRF) will process co-mingled clean and dry recyclables so that they can be sold and used to manufacture new products. Also read: Look: Cape learners compete in a recycling build-a-thon at Blue Route Mall Once complete, the R186 million MRF, located at the Coastal Park landfill site, will have the capacity to sort 65 tonnes of recycled material per day. Engineering News reports that this will enable the City of Cape Town to extend its separation-at-source recycling collection programme in light of a current lack of sorting capacity. Cape {town} Etc discount: Do you want to sample the world-class wines of the Cape Winelands? Indulge your senses with a wine and cheese pairing from Summerhill Wines in Stellenbosch for just R169. Get it here. ‘We are very pleased to see that the work on site is progressing so well that it is ahead of schedule,’ says Grant Twigg, City of Cape Town’s urban waste management MMC. ‘The project is the next key step in the city’s strategy to fundamentally change our relationship with waste and to minimise our city’s need for additional landfills in future. This will allow thousands more families to start cleaning and separating recyclables from their general waste for collection by the city.’ The MRF building will feature mechanical separation equipment such as a bag splitter, a magnetic separator, screens, conveyors and baling facilities. It will also house offices for city officials and a training centre for waste management education. At least 100 jobs will be generated via this project. Additionally, the new development will feature a nine-bay drop-off facility for builders’ rubble, mixed waste, garden waste and recyclables not accepted by the MRF. Looking for a 2009 Honda Civic 1.8 Lxi? Get the best deal here. Also read: Picture: Screenshot \/ Video by City of Cape Town \/ Alderman Grant Twigg \/ Facebook","filter_flag":1}
{"title":"Construction of new recycling facility in Cape Town on track for completion next year - Creamer Media's Engineering News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5lbmdpbmVlcmluZ25ld3MuY28uemEvYXJ0aWNsZS9jb25zdHJ1Y3Rpb24tb2YtbmV3LXJlY3ljbGluZy1mYWNpbGl0eS1pbi1jYXBlLXRvd24tb24tdHJhY2stZm9yLWNvbXBsZXRpb24tbmV4dC15ZWFyLTIwMjMtMDctMTnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5lbmdpbmVlcmluZ25ld3MuY28uemEvYXJ0aWNsZS9jb25zdHJ1Y3Rpb24tb2YtbmV3LXJlY3ljbGluZy1mYWNpbGl0eS1pbi1jYXBlLXRvd24tb24tdHJhY2stZm9yLWNvbXBsZXRpb24tbmV4dC15ZWFyLTIwMjMtMDctMTnSAQA?oc=5","id":"CBMiigFodHRwczovL3d3dy5lbmdpbmVlcmluZ25ld3MuY28uemEvYXJ0aWNsZS9jb25zdHJ1Y3Rpb24tb2YtbmV3LXJlY3ljbGluZy1mYWNpbGl0eS1pbi1jYXBlLXRvd24tb24tdHJhY2stZm9yLWNvbXBsZXRpb24tbmV4dC15ZWFyLTIwMjMtMDctMTnSAQA","guidislink":false,"published":"Wed, 19 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=200, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5lbmdpbmVlcmluZ25ld3MuY28uemEvYXJ0aWNsZS9jb25zdHJ1Y3Rpb24tb2YtbmV3LXJlY3ljbGluZy1mYWNpbGl0eS1pbi1jYXBlLXRvd24tb24tdHJhY2stZm9yLWNvbXBsZXRpb24tbmV4dC15ZWFyLTIwMjMtMDctMTnSAQA?oc=5\" target=\"_blank\">Construction of new recycling facility in Cape Town on track for completion next year<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Creamer Media's Engineering News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Construction of new recycling facility in Cape Town on track for completion next year - Creamer Media's Engineering News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiigFodHRwczovL3d3dy5lbmdpbmVlcmluZ25ld3MuY28uemEvYXJ0aWNsZS9jb25zdHJ1Y3Rpb24tb2YtbmV3LXJlY3ljbGluZy1mYWNpbGl0eS1pbi1jYXBlLXRvd24tb24tdHJhY2stZm9yLWNvbXBsZXRpb24tbmV4dC15ZWFyLTIwMjMtMDctMTnSAQA?oc=5\" target=\"_blank\">Construction of new recycling facility in Cape Town on track for completion next year<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Creamer Media's Engineering News<\/font>","source.href":"https:\/\/www.engineeringnews.co.za","source.title":"Creamer Media's Engineering News","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Cape Town’s new material recovery facility (MRF) at the Coastal Park landfill site should start operations in November next year. The R186-million MRF is designed to receive co-mingled clean and dry recyclables, with the materials separated so they can be sold and used in the manufacturing of new products. The MRF will create a minimum of 100 jobs. It is expected that the facility will have the capacity for sorting 65 t of recycled material a day. This will allow the City of Cape Town to extend its separation-at-source recycling collection programme significantly, as the expansion of recycling services is currently constrained by a lack of sorting capacity. The MRF building will house mechanical separation equipment, including a bag splitter, a magnetic separator, screens, conveyors and baling facilities for various recyclable materials. The facility will also house offices for city officials and the operator of the facility, as well as a training centre for waste management education. The new development will also provide a nine-bay drop-off facility that will accept builders’ rubble, mixed waste, garden waste, as well as recyclables not taken by the MRF. “We are very pleased to see that the work on site is progressing so well that it is ahead of schedule,” says City of Cape Town Urban Waste Management MMC Grant Twigg. “The project is the next key step in the city’s strategy to fundamentally change our relationship with waste and to minimise our city’s need for additional landfills in future. “This will allow thousands more families to start cleaning and separating recyclables from their general waste for collection by the city.”","filter_flag":1}
{"title":"Are our big waste players as green as they claim? - BusinessDesk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vYnVzaW5lc3NkZXNrLmNvLm56L2FydGljbGUvaW5mcmFzdHJ1Y3R1cmUvYXJlLW91ci1iaWctd2FzdGUtcGxheWVycy1hcy1ncmVlbi1hcy10aGV5LWNsYWlt0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vYnVzaW5lc3NkZXNrLmNvLm56L2FydGljbGUvaW5mcmFzdHJ1Y3R1cmUvYXJlLW91ci1iaWctd2FzdGUtcGxheWVycy1hcy1ncmVlbi1hcy10aGV5LWNsYWlt0gEA?oc=5","id":"CBMiYmh0dHBzOi8vYnVzaW5lc3NkZXNrLmNvLm56L2FydGljbGUvaW5mcmFzdHJ1Y3R1cmUvYXJlLW91ci1iaWctd2FzdGUtcGxheWVycy1hcy1ncmVlbi1hcy10aGV5LWNsYWlt0gEA","guidislink":false,"published":"Wed, 19 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=200, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vYnVzaW5lc3NkZXNrLmNvLm56L2FydGljbGUvaW5mcmFzdHJ1Y3R1cmUvYXJlLW91ci1iaWctd2FzdGUtcGxheWVycy1hcy1ncmVlbi1hcy10aGV5LWNsYWlt0gEA?oc=5\" target=\"_blank\">Are our big waste players as green as they claim?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessDesk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Are our big waste players as green as they claim? - BusinessDesk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vYnVzaW5lc3NkZXNrLmNvLm56L2FydGljbGUvaW5mcmFzdHJ1Y3R1cmUvYXJlLW91ci1iaWctd2FzdGUtcGxheWVycy1hcy1ncmVlbi1hcy10aGV5LWNsYWlt0gEA?oc=5\" target=\"_blank\">Are our big waste players as green as they claim?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessDesk<\/font>","source.href":"https:\/\/businessdesk.co.nz","source.title":"BusinessDesk","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Unlock all stories free for 10 days Stay informed on business, government and financial developments across New Zealand. Deeply researched, twice-edited and fact-checked news Annual subscribers also receive a complimentary subscription to The Wall Street Journal Personalised email news alerts, plus gift up to 5 stories a month to non-subscribers We won’t charge for 10 days. You can cancel anytime with two clicks, an email or a phone call. Find out more. We are serious about journalism.","filter_flag":1}
{"title":"Trash talk to dispel Townsville’s common waste myths - Townsville Bulletin","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50b3duc3ZpbGxlYnVsbGV0aW4uY29tLmF1L25ld3MvdG93bnN2aWxsZS90b3duc3ZpbGxlLWNpdHktY291bmNpbC1zaGluZXMtc3BvdGxpZ2h0LW9uLXJlY3ljbGluZy1pc3N1ZXMtdG8taGVscC10aGUtcGxhbmV0L25ld3Mtc3RvcnkvMDZiZDk0MzBlNGNlYzJjNDdiMzhkZGQzM2VkOGQ5OGHSAbUBaHR0cHM6Ly93d3cudG93bnN2aWxsZWJ1bGxldGluLmNvbS5hdS9uZXdzL3Rvd25zdmlsbGUvdG93bnN2aWxsZS1jaXR5LWNvdW5jaWwtc2hpbmVzLXNwb3RsaWdodC1vbi1yZWN5Y2xpbmctaXNzdWVzLXRvLWhlbHAtdGhlLXBsYW5ldC9uZXdzLXN0b3J5LzA2YmQ5NDMwZTRjZWMyYzQ3YjM4ZGRkMzNlZDhkOThhP2FtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50b3duc3ZpbGxlYnVsbGV0aW4uY29tLmF1L25ld3MvdG93bnN2aWxsZS90b3duc3ZpbGxlLWNpdHktY291bmNpbC1zaGluZXMtc3BvdGxpZ2h0LW9uLXJlY3ljbGluZy1pc3N1ZXMtdG8taGVscC10aGUtcGxhbmV0L25ld3Mtc3RvcnkvMDZiZDk0MzBlNGNlYzJjNDdiMzhkZGQzM2VkOGQ5OGHSAbUBaHR0cHM6Ly93d3cudG93bnN2aWxsZWJ1bGxldGluLmNvbS5hdS9uZXdzL3Rvd25zdmlsbGUvdG93bnN2aWxsZS1jaXR5LWNvdW5jaWwtc2hpbmVzLXNwb3RsaWdodC1vbi1yZWN5Y2xpbmctaXNzdWVzLXRvLWhlbHAtdGhlLXBsYW5ldC9uZXdzLXN0b3J5LzA2YmQ5NDMwZTRjZWMyYzQ3YjM4ZGRkMzNlZDhkOThhP2FtcA?oc=5","id":"CBMisQFodHRwczovL3d3dy50b3duc3ZpbGxlYnVsbGV0aW4uY29tLmF1L25ld3MvdG93bnN2aWxsZS90b3duc3ZpbGxlLWNpdHktY291bmNpbC1zaGluZXMtc3BvdGxpZ2h0LW9uLXJlY3ljbGluZy1pc3N1ZXMtdG8taGVscC10aGUtcGxhbmV0L25ld3Mtc3RvcnkvMDZiZDk0MzBlNGNlYzJjNDdiMzhkZGQzM2VkOGQ5OGHSAbUBaHR0cHM6Ly93d3cudG93bnN2aWxsZWJ1bGxldGluLmNvbS5hdS9uZXdzL3Rvd25zdmlsbGUvdG93bnN2aWxsZS1jaXR5LWNvdW5jaWwtc2hpbmVzLXNwb3RsaWdodC1vbi1yZWN5Y2xpbmctaXNzdWVzLXRvLWhlbHAtdGhlLXBsYW5ldC9uZXdzLXN0b3J5LzA2YmQ5NDMwZTRjZWMyYzQ3YjM4ZGRkMzNlZDhkOThhP2FtcA","guidislink":false,"published":"Sat, 08 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=189, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50b3duc3ZpbGxlYnVsbGV0aW4uY29tLmF1L25ld3MvdG93bnN2aWxsZS90b3duc3ZpbGxlLWNpdHktY291bmNpbC1zaGluZXMtc3BvdGxpZ2h0LW9uLXJlY3ljbGluZy1pc3N1ZXMtdG8taGVscC10aGUtcGxhbmV0L25ld3Mtc3RvcnkvMDZiZDk0MzBlNGNlYzJjNDdiMzhkZGQzM2VkOGQ5OGHSAbUBaHR0cHM6Ly93d3cudG93bnN2aWxsZWJ1bGxldGluLmNvbS5hdS9uZXdzL3Rvd25zdmlsbGUvdG93bnN2aWxsZS1jaXR5LWNvdW5jaWwtc2hpbmVzLXNwb3RsaWdodC1vbi1yZWN5Y2xpbmctaXNzdWVzLXRvLWhlbHAtdGhlLXBsYW5ldC9uZXdzLXN0b3J5LzA2YmQ5NDMwZTRjZWMyYzQ3YjM4ZGRkMzNlZDhkOThhP2FtcA?oc=5\" target=\"_blank\">Trash talk to dispel Townsville’s common waste myths<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Townsville Bulletin<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Trash talk to dispel Townsville’s common waste myths - Townsville Bulletin","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy50b3duc3ZpbGxlYnVsbGV0aW4uY29tLmF1L25ld3MvdG93bnN2aWxsZS90b3duc3ZpbGxlLWNpdHktY291bmNpbC1zaGluZXMtc3BvdGxpZ2h0LW9uLXJlY3ljbGluZy1pc3N1ZXMtdG8taGVscC10aGUtcGxhbmV0L25ld3Mtc3RvcnkvMDZiZDk0MzBlNGNlYzJjNDdiMzhkZGQzM2VkOGQ5OGHSAbUBaHR0cHM6Ly93d3cudG93bnN2aWxsZWJ1bGxldGluLmNvbS5hdS9uZXdzL3Rvd25zdmlsbGUvdG93bnN2aWxsZS1jaXR5LWNvdW5jaWwtc2hpbmVzLXNwb3RsaWdodC1vbi1yZWN5Y2xpbmctaXNzdWVzLXRvLWhlbHAtdGhlLXBsYW5ldC9uZXdzLXN0b3J5LzA2YmQ5NDMwZTRjZWMyYzQ3YjM4ZGRkMzNlZDhkOThhP2FtcA?oc=5\" target=\"_blank\">Trash talk to dispel Townsville’s common waste myths<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Townsville Bulletin<\/font>","source.href":"https:\/\/www.townsvillebulletin.com.au","source.title":"Townsville Bulletin","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Full Digital Access 12 Month Plan costs $208 (min.cost) for the first 12 months, charged as $16 every 4 weeks. This automatically renews after the first 12 months to be charged as $16 (min. cost) every 4 weeks unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.townsvillebulletin.com.au\/subscriptionterms for full details.","filter_flag":1}
