{"title":"Embracing ugly veg and the ugly side of poultry production to make more profitable and sustainable products - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDEvZW1icmFjaW5nLXVnbHktdmVnLWFuZC10aGUtdWdseS1zaWRlLW9mLXBvdWx0cnktcHJvZHVjdGlvbi10by1tYWtlLW1vcmUtcHJvZml0YWJsZS1hbmQtc3VzdGFpbmFibGUtcHJvZHVjdHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDEvZW1icmFjaW5nLXVnbHktdmVnLWFuZC10aGUtdWdseS1zaWRlLW9mLXBvdWx0cnktcHJvZHVjdGlvbi10by1tYWtlLW1vcmUtcHJvZml0YWJsZS1hbmQtc3VzdGFpbmFibGUtcHJvZHVjdHPSAQA?oc=5","id":"CBMinAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDEvZW1icmFjaW5nLXVnbHktdmVnLWFuZC10aGUtdWdseS1zaWRlLW9mLXBvdWx0cnktcHJvZHVjdGlvbi10by1tYWtlLW1vcmUtcHJvZml0YWJsZS1hbmQtc3VzdGFpbmFibGUtcHJvZHVjdHPSAQA","guidislink":false,"published":"Wed, 01 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=60, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDEvZW1icmFjaW5nLXVnbHktdmVnLWFuZC10aGUtdWdseS1zaWRlLW9mLXBvdWx0cnktcHJvZHVjdGlvbi10by1tYWtlLW1vcmUtcHJvZml0YWJsZS1hbmQtc3VzdGFpbmFibGUtcHJvZHVjdHPSAQA?oc=5\" target=\"_blank\">Embracing ugly veg and the ugly side of poultry production to make more profitable and sustainable products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Embracing ugly veg and the ugly side of poultry production to make more profitable and sustainable products - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMDEvZW1icmFjaW5nLXVnbHktdmVnLWFuZC10aGUtdWdseS1zaWRlLW9mLXBvdWx0cnktcHJvZHVjdGlvbi10by1tYWtlLW1vcmUtcHJvZml0YWJsZS1hbmQtc3VzdGFpbmFibGUtcHJvZHVjdHPSAQA?oc=5\" target=\"_blank\">Embracing ugly veg and the ugly side of poultry production to make more profitable and sustainable products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Copenhagen-based Reduced, which makes flavour enhancers based on upcycled raw materials, has joined forces with the international ingredient company Caldic to explore and scale upcycled ingredients for the food industry in the Nordics and Baltic states. The goal is to make ingredients that reduce food waste a larger part of food production, they say, and at the same time pave the way for further development of process technology and innovation in the upcycling of side streams from the food industry. The global products from food waste market size was valued at nearly $53 (€49.63) billion in 2022, according to a recent report by Future Market Insights. It estimates the market will grow at a CAGR of 4.6% to reach $83.26 (€77.9) billion by 2032. The collaboration therefore comes at ‘exactly the right time because the demand for innovation in the upcycling area has never been greater’, according to the companies. Spent hens: a ‘significant untapped resource’ The collaboration has so far launched with a series of organic flavour enhancers based on side streams from the food industry. One is fermented sauce made with chicken, koji and barley which makes use of spent laying hens sourced from Danish organic egg production. Spent hens are those at the end of their egg-laying cycle. With meat that’s too tough to eat, their commercial value has tended to be low. Typically, after being processed into ‘chick pulp’ in mobile chicken slaughter units they go on to be used in animal feed or for biogas production. They are often discarded. In Denmark alone, 8 million kilos of organic chickens are wasted annually. According to Reduced’s co-founder Emil Munck de Voss, these spent lying hens – Denmark is also estimated to currently house around 4.5 million hens in egg production – represent a “significant untapped resource if we are able to scale the conversion of these hens into human food. It is believed that the prices obtained for human food applications may be higher than those achieved for pet food or biogas purposes.” In the past, spent hen meat did go into soups. Today, however, most soup makers will use broiler meat to avoid bone splinters that can make the product unsafe for human consumption. Reduced, on the other hand, is using fermentation techniques to create products for human food applications. “We have been able to control a natural fermentation process at industrial scale,” de Voss told FoodNavigator. “We combine fungi with chicken and are then able to control the critical control parameters throughout the process and then extract the super umami-rich liquid by the end of this natural process that is organically certified and authorized by the food authorities from nine months of testing.” Upcycling wasted mushrooms​ The Reduced\/Caldic collaboration is also using Danish organic button mushrooms to produce umami flavouring. Industrial producers of Agaricus Bisporus​ mushrooms, which make up 45% of global mushroom production, have an 8-10% waste rate on all production every year, claimed de Voss. “For our partner in Denmark, that amounts to 203 tonnes of wasted organic Agaricus Bisporus​ a year. The mushrooms we are using usually are discarded for retail sales because they are too large, or too small to be packaged, broken or bruised. We use them for organic, clean label and great-tasting food ingredients and thereby we reduce food waste.” The flavour enhancers are distinguished by boosting the umami taste without containing additives, continued de Voss. So far, they have been used in meat products, meat hybrids and meat alternatives to reduce raw material costs, lower salt content and enhance flavour. “Our ingredients have the potential to lower costs by enabling the creation of meat hybrids,” he said. “Through a series of formulations, we have demonstrated that meat content in processed meat products can be reduced by 5-20% and substituted with vegetables and our flavour enhancers. This not only maintains the great taste but also lowers the cost by removing expensive meat content. We have demonstrated cost savings in between 5-10% working with formulations of sausages and beef patties.” Significantly less production time​ The main applications of the Reduced current portfolio include soups, ready meals, culinary sauces and the Danish start-up makes novel use of other side streams. In addition to its chicken- and mushroom-based umami flavours, it has made: shellfish stock from the invasive species of shore crabs on the Danish coast; organic vegetable stock made from Nordic seaweed; and organic veal stock made from bones from bull calves, which are left over from milk production. “We have developed a unique process for controlling the fermentation and processing of the ingredients in our bioreactors,” explained the co-founder. “This enables us to create uniform and food-safe ingredients at scale.” The technology is centred around controlling fermentation processes of side streams and generating flavours at accelerated production time, he told us. “Right now, we are building out the range of side streams we can process through the process technology to provide a broader portfolio of flavours. So - you can definitely expect new taste and flavour experiences.” Furthermore, we have begun developing functional systems that combine multiple components of ingredients to provide even greater value to our customers in terms of easy application, flavors, and cost-effectiveness. The appeal of upcycling for end consumers ​ Consumer interest in upcycled products is growing, added Ib Mortensen, Product Group Leader at Caldic. “My impression is that there is a very high interest in upcycled products – more so when the concept is coupled with sustainability than as a standalone, where the concept can sometimes be a bit too technical,” he said. “So the more the food producers work with story telling the more they will succeed with the ingredients. There is a high awareness among most consumers – certainly in the Nordics, but I believe it is true of most European countries – about the need to take care of our planet and to use its resources with care – and although there is now a pressure on peoples’ wallets, which will reduce over time, the interest in and awareness of protecting our environment is still very much present.”","filter_flag":1}
{"title":"TerraCycle takes recycling to a whole new level - Inhabitat","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vaW5oYWJpdGF0LmNvbS90ZXJyYWN5Y2xlLXRha2VzLXJlY3ljbGluZy10by1hLXdob2xlLW5ldy1sZXZlbC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vaW5oYWJpdGF0LmNvbS90ZXJyYWN5Y2xlLXRha2VzLXJlY3ljbGluZy10by1hLXdob2xlLW5ldy1sZXZlbC_SAQA?oc=5","id":"CBMiRmh0dHBzOi8vaW5oYWJpdGF0LmNvbS90ZXJyYWN5Y2xlLXRha2VzLXJlY3ljbGluZy10by1hLXdob2xlLW5ldy1sZXZlbC_SAQA","guidislink":false,"published":"Fri, 17 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=76, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vaW5oYWJpdGF0LmNvbS90ZXJyYWN5Y2xlLXRha2VzLXJlY3ljbGluZy10by1hLXdob2xlLW5ldy1sZXZlbC_SAQA?oc=5\" target=\"_blank\">TerraCycle takes recycling to a whole new level<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TerraCycle takes recycling to a whole new level - Inhabitat","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vaW5oYWJpdGF0LmNvbS90ZXJyYWN5Y2xlLXRha2VzLXJlY3ljbGluZy10by1hLXdob2xlLW5ldy1sZXZlbC_SAQA?oc=5\" target=\"_blank\">TerraCycle takes recycling to a whole new level<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","source.href":"https:\/\/inhabitat.com","source.title":"Inhabitat","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"“The good news is that most trash is technically recyclable.” This is the philosophy behind TerraCycle’s recycling program — an organized system for recycling, and upcycling, many items that are not recyclable at a local level. Continue reading below Our Featured Videos The problem with municipal recycling is that only a few materials are profitable enough to recycle. All other materials take too much time, energy, machinery and manpower to be worthwhile. With this in mind, TerraCycle takes a full-cycle view of ways to keep waste out of landfills, roping businesses and other stakeholders into the process. Related: New solar-powered robots will clean up Argentina’s waterways The TerraCycle recycling program mirrors most similar operations. Shipments of waste arrive at one of the company’s 35 Material Recovery Facilities (MRFs), which are located in the same country in which the waste originates. The waste is then sorted by material makeup, using a variety of innovative machinery and manpower. Once sorted, materials are sent to third party partners who process it into usable forms. This might be plastic pellets or metal sheeting, for example. Recycled materials are then given new life in a wide variety of products. Manufacturing companies use the newly-raw materials from TerraCycle to produce outdoor furniture and decking, watering cans, flooring tiles, playground surface covers, athletic fields, planters, compost bins and much more. TerraCycle even sells a small selection of upcycled products directly from its website. TerraCycle is a global program, yet also a community-based one. Presently operating in 21 countries, materials are collected worldwide. However, the power of collection happens at a community level where businesses and individuals can set up collection centers. The setup is easy and anyone can do it, although a fee is charged up front so businesses are often the best option for sponsoring boxes. Simply apply for the program and request boxes. When the boxes are filled, send them back using a prepaid shipping label at no cost. TerraCycle partners with an array of businesses who sponsor different recycling efforts. For example, Subaru (the car maker) offers drop-off locations at many of their dealerships where customers can drop disposable cups, lids, straws, candy and snack wrappers and coffee and creamer capsules. Several other recycling programs accept pet food bags and pouches, including Wellness, Holistic, A Pup Above and Halo. Similarly, there are programs for many lotions, face cream and other beauty products. Gatorade allows you to recycle Gatorade, Propel, EVOLVE and Muscle Milk sports nutrition pods and bar packaging. Other packaging waste includes toddler squeeze tubes, drink pouches, cigarette waste, clothing, cooking supplies, ink pens, and aerosol cans. Notable brands include Arm and Hammer, OxyClean, Barilla, Babybel, Burt’s Bees, Colgate, Febreze, Gillette, Hasbro, Lundberg, Popsockets, Rubbermaid, Swiffer, Taco Bell, Ziploc and many, many more. Since shipping items is an essential part of the process, TerraCycle works to minimize its carbon footprint with zero-carbon shipping on the initial box delivery and boxes made from certified responsibly-sourced forest products. Upon return, the plastic liner and the cardboard box are recycled. The company has also developed the Zero Waste Case, which is used to ship the Zero Waste Boxes. The case is made from 100% recycled PET (or polyethylene terephthalate, represented by resin code #1 on plastic containers) and TerraCycle encourages customers to reuse the case. If you no longer want the case, you can send it back to the company for use on future Zero Waste Box orders. TerraCycle is constantly investing in the research and development of new recycling processes with the goal of converting waste into usable products at the highest level. The company reports nearly all of the products returned are reused and that only a very small percentage is incinerated — basically only those items that shouldn’t be in the bin or those that are legally required to be incinerated, such as medical waste. In addition to recycling plastic and other waste, the TerraCycle Global Foundation arm of the company is working to clean up waterways with the goal of collecting waste in rivers before it reaches the ocean where it impacts the marine animals and ecosystem. The foundation achieves this mission by working with local communities who are highly impacted by water pollution. River traps help in the collection of waste from the waterways. The collected materials are then sent to a sorting center where they are weighed, sorted and baled. The system creates local jobs and workers are supported by the TerraCycle foundation. The company explained, “The Foundation works with local waste pickers to improve collection rates by providing fair wages, tools, supplies, financial literacy, education, care for children, and health and safety training.” The foundation’s project is funded through the sale of bracelets, frisbees and other products, which are made out of the waste materials collected from the water. + TerraCycle Images via TerraCycle","filter_flag":1}
{"title":"Australia's vegetable upcycling firm launches Nutri V goodies entering the snacking space - FoodNavigator-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wMy8yOC9BdXN0cmFsaWEtcy12ZWdldGFibGUtdXBjeWNsaW5nLWZpcm0tbGF1bmNoZXMtTnV0cmktVi1nb29kaWVzLWVudGVyaW5nLXRoZS1zbmFja2luZy1zcGFjZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wMy8yOC9BdXN0cmFsaWEtcy12ZWdldGFibGUtdXBjeWNsaW5nLWZpcm0tbGF1bmNoZXMtTnV0cmktVi1nb29kaWVzLWVudGVyaW5nLXRoZS1zbmFja2luZy1zcGFjZdIBAA?oc=5","id":"CBMijwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wMy8yOC9BdXN0cmFsaWEtcy12ZWdldGFibGUtdXBjeWNsaW5nLWZpcm0tbGF1bmNoZXMtTnV0cmktVi1nb29kaWVzLWVudGVyaW5nLXRoZS1zbmFja2luZy1zcGFjZdIBAA","guidislink":false,"published":"Wed, 29 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=88, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wMy8yOC9BdXN0cmFsaWEtcy12ZWdldGFibGUtdXBjeWNsaW5nLWZpcm0tbGF1bmNoZXMtTnV0cmktVi1nb29kaWVzLWVudGVyaW5nLXRoZS1zbmFja2luZy1zcGFjZdIBAA?oc=5\" target=\"_blank\">Australia's vegetable upcycling firm launches Nutri V goodies entering the snacking space<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Australia's vegetable upcycling firm launches Nutri V goodies entering the snacking space - FoodNavigator-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wMy8yOC9BdXN0cmFsaWEtcy12ZWdldGFibGUtdXBjeWNsaW5nLWZpcm0tbGF1bmNoZXMtTnV0cmktVi1nb29kaWVzLWVudGVyaW5nLXRoZS1zbmFja2luZy1zcGFjZdIBAA?oc=5\" target=\"_blank\">Australia's vegetable upcycling firm launches Nutri V goodies entering the snacking space<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","source.href":"https:\/\/www.foodnavigator-asia.com","source.title":"FoodNavigator-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"It recently launched Nutri V goodies, a range of puffed snacks. ​They contain two vegetable servings in each pack, and “offer a higher vegetable load than many other snack foods on the market​,” according to the firm. They are available in three flavours, namely salt and pepper pumpkin, cauliflower, and chilli and lime broccoli. Tapping on the relationship with Fresh Select – the main vegetable producer for Coles, the snacks are sold in 800 of its supermarkets, both in-store and online. Nutri V goodies' range © Nutri V The firm was previously primarily supplying vegetable powders to food manufacturers to incorporate into crackers, dips, breads, and snacks. CEO Raquel Said told NutraIngredients-Asia​ that the new launch would meet a clear customer need: “A lot of people were saying that they want an option for kids to have in their lunch boxes, and we want to drive nutrition in a convenient way. Anytime I was talking to people about product offerings, they ask when they can get their hands on the powder - to have a scoop of that in their foods. There were obvious next steps for us in terms of new product offerings as it makes sense to what consumer want and it’s also solving a problem in the farms,” ​Said explained. New product development​ The firm will next launch its vegetable powder pouches in the consumer space, and has been working on product development opportunities spanning yoghurts, drinks, and even enhanced pet foods. On the consumer trends driving growth in the space, its CEO said: “Especially in the snacking space, I’ve been seeing a lot of better-for-you trends. Companies want to take something that is indulgent and make it slightly better for you. Like adding a few profiles to banana bread and cupcakes. We’re also seeing interesting flavour pairings with vegetables​ [to] really enhance the flavours, like ​broccoli with lemon, salt, and pepper.”​ Aside from nutritional benefits, Said added that vegetable powder also functions well as a binder or emulsifier. She sees the potential of “hybrid products” in the plant-based market, such as creating nuggets with both chicken and vegetable powder. In line with its new product development plan is consumer education to provide more ways to access and consume vegetable powder, and the firm would be looking at partnerships with chefs for recipe ideas. “We're not saying that these should replace fresh bread and fresh vegetables. But if they can take you top up your servings of vegetables, then we've made a difference. If we can add a little bit of extra nutrition into people's diets in a convenient way, then we've been able to do our job.”​ Nutri V was founded in 2020 via a partnership​ between vegetable producer Fresh Select, and Australia’s national science agency CSIRO. Said explained how the partnership came about: “[Fresh Select and CSIRO] were basically looking at a project to see how we can use farm waste, and vegetables that don’t make it to the supermarket shelves. These vegetables just don’t meet certain specifications and the way they look might be slightly different, but I’ll be clear that there’s nothing nutritionally wrong with them.​ “​Our business model is that we take the vegetables, not just from our parent farm [at Fresh Select] but from farms across Melbourne and other states. We turn them into vegetable powders. That turns them into very nutrient-dense, small serving sized ingredient as we are essentially taking out the water. There is a large array of applications used from F&B to nutraceuticals.”​ Two areas for future innovation are microencapsulation and fermentation. “We’re working on a patented product with them around microencapsulation. What we’re seeing is an appetite for vegetable, plant-based Omega-3 and this is sort of in the nutraceutical space. We’re still in R&D at the moment. It’s an exciting space for food and nutraceuticals, and it’s what customers are asking for as well.​ “The second project is around fermentation. Those are novel ingredients that will be developed and launched in the marketplace. It is probably still a bit too early to talk about. But there's some new novel technology that's coming as well with our partnership,” ​Said elaborated. The firm is also assessing if its business model has the potential to scale. “At the present moment, the only facility we have is in the South - in Victoria. It can only process a certain amount of vegetables into powders. However, we know that there’s a waste problem with vegetables not just here, but in Queensland, Western Australia, and other parts of the world. ​ “We would really be interested to look at what our business model could look like if we take what we’ve done here and putting in other parts of the world or in Australia – to turn that waste into new foods.”​","filter_flag":1}
{"title":"Unwrapping Eco-Labels: What Do They Really Mean? - U.S. News & World Report","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5","id":"CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA","guidislink":false,"published":"Thu, 02 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=61, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5\" target=\"_blank\">Unwrapping Eco-Labels: What Do They Really Mean?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. News & World Report<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Unwrapping Eco-Labels: What Do They Really Mean? - U.S. News & World Report","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5\" target=\"_blank\">Unwrapping Eco-Labels: What Do They Really Mean?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. News & World Report<\/font>","source.href":"https:\/\/health.usnews.com","source.title":"U.S. News & World Report","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"You may be in the habit of checking the nutrition facts label on food products before putting them in your cart. Now, new eco-labels that signify the environmental impact of food are showing up on the front of packages and on restaurant menus. Getty Images It seems that carbon is the new calorie. Panera, Chipotle and Just Salad were the first restaurants to include carbon emissions on menu items. The labels estimate a food’s environmental impact as a carbon equivalent reflecting the greenhouse gas emissions or CO2 spent in the entire journey of a food product, from growing to transportation to cooking or production. This environmental impact is measured in grams or kilograms of carbon. Now there’s an entire movement to put climate change on the menu – from “climate positive” entrees to entire restaurants that are certified carbon-free. In the supermarket, foods and beverages are embellished with on-package seals that declare “carbon neutral” or “climate neutral.” Do Eco-Labels Matter? I’ll breakdown many of the label claim definitions, but let’s start with the question if these eco-labels can make a difference. Two recent studies suggest they do have the potential to nudge consumers to more climate-responsible food choices. One study conducted by researchers from Harvard and Johns Hopkins found that people may be less likely to choose red meat items from menus that were labeled “high climate impact.” The beef burger on the menu included the description: “This item is not environmentally sustainable. It has high greenhouse gas emissions and a high contribution to climate change.” Researchers at the University of Bristol in the U.K. found similar results in a study that used a traffic light system to rank eco-friendliness of menu items. The green traffic light symbol on a vegetarian burrito helped to significantly increase the likelihood that this more sustainable option was selected. Additionally, 90% of the study participants were supportive of eco-labels. Keep in mind, both of these studies were online experiments exposing people to hypothetical menu items instead of ordering at an actual restaurant. Yet the researchers believe the findings suggest eco-labels have the potential to make a positive impact in real-world settings. Seeking More Sustainable Choices Increasingly people are eager to make changes to their behaviors to benefit the planet. Over three-quarters (78%) agree they want to buy from companies that help them achieve a more sustainable and socially responsible life, according to GreenPrint’s Business of Sustainability Index. They’ll even pay more for sustainable products, yet 78% of those surveyed say that, despite their desire to support companies that align with their values, they don’t know how to identify environmentally friendly companies. Here’s where eco-labels could help. Over two-thirds (68%) use labels to determine if a product is environmentally friendly, with that number jumping to 78% for Generation Z and Millennial consumers. What Different Eco-Labels Mean Some of the so-called green and ethical labels have been around for years, such as USDA Organic, Non-GMO Project Verified, Fair Trade Certified, Rainforest Alliance Certified and Certified Humane Raised & Handled. Here’s a look at some of the newer eco-labels used in the food industry and what they mean. Carbon Neutral Certified Carbon neutral or carbon free does not mean a food produces zero emissions. It refers instead to a company compensating for all of the carbon or greenhouse gases emitted during its production and delivery. That’s where third-party organizations come in, such as Carbonfund. that helps companies calculate, reduce and offset their carbon footprint with projects that remove an equal amount of carbon from the atmosphere. Carbonfund’s Certified Carbonfree® products have \"net zero\" CO2 emissions, meaning brands measure and offset the carbon footprint of the products over their full lifecycle. This lifecycle focus is also called “cradle-to-grave,” which means the calculation includes the ingredient sourcing and packaging, product manufacturing, distribution, consumer use and eventual disposal. Carbon Trust is another organization offering carbon neutral certification for products. The group has certified over 27,000 individual product footprints, and many display the label in more than 40 countries. Climate Neutral Certified This label is certified by a nonprofit group called Climate Neutral that’s on a mission to make climate neutrality a priority for companies and individuals. Similar to Carbonfund, they work with companies to measure, reduce and offset greenhouse gas emissions with carbon credit investments that help to capture carbon – projects that include reforestation, mangrove rehabilitation, and landfill management. More than 300 brands have been certified by Climate Neutral, including Zero Carbon Coffee, Numi Organic Tea, and Bud Light Next. Regenerative Organic Certified Regenerative agriculture is often referred to as carbon farming because it restores soil biology, which pulls carbon out of the atmosphere. Regenerative organic agriculture is a collection of practices that focus on regenerating soil health and the entire farm ecosystem – from the animals to the workers. Developed by the nonprofit Regenerative Organic Alliance, this certification uses the USDA Certified Organic standard as a baseline and adds criteria for soil health, animal welfare and social fairness. The alliance was founded by the Rodale Institute, Dr. Bronner’s and Patagonia. Other members include Compassion in World Farming, Fair World Project and the Textile Exchange. Although “regenerative agriculture” has become a popular buzzword, the term is not fully defined and the claim is not regulated. Upcycled Certified Upcycled products are made with ingredients that would have otherwise been thrown out, such as the pulp created when fruits are turned into juice, the spent grain from the beer-making process or the cacao beans that are wasted when making chocolate. This new certification program was developed by the Upcycled Food Association, which has certified more than 200 food products and ingredients – representing 840 million pounds of food waste. One third of all food produced in the world ends up wasted, which accounts for 8% of global greenhouse gas emissions, according to the U.S. Environmental Protection Agency. The Upcycled Certification on-package mark signifies that a specified amount of upcycled ingredients were used. Upcycled certified products include ReGrained bread mixes, Pulp Pantry vegetable chips and Blue Stripes Urban Cacao chocolate bars and cacao water. Certified B Corporations While the Certified B Corporation label does not make any claim about a specific food, it does flag a company’s commitment to meet standards of social and environmental performance, accountability, and transparency on factors from supply chain practices and input materials to charitable giving and employee benefits. The certification is managed by B Lab, a nonprofit organization “transforming the global economy to benefit all people, communities and the planet.” The pledge serves as a legal framework for the company's corporate structure, which is intended to help balance profit with purpose. Carbon Confusion Eco-labels have exploded in recent years, totaling 456 globally, according to the Ecolabel Index, a directory of eco-labels across 25 industry categories including food. But not everyone agrees this is a positive trend. Matthew Hayek, an assistant professor in the department of environmental studies at New York University, believes the “climate neutral” or “climate positive” claims are confusing and misleading. Actually, these foods do not even exist, he says. The trouble is that these claims rely on carbon offsets – or those projects that are attempting to compensate for a product’s own emissions. While carbon offsets can play a role, it is important to ensure that offset projects are transparent, verifiable and result in real, permanent and additional emissions reductions, he says. Few of these labels give shoppers meaningful guidance in choosing environmentally superior products, he says. You may be tempted to choose an item with a “climate neutral” label because the item next to it does not make that claim. Yet, he says the non-labeled item could have a 10 times lower carbon footprint. “If you are feeling confused, there’s probably someone trying to confuse you,” Hayek says. What You Should Do So what should you do? Rather than relying on eco-labels, which may be providing an undeserved green halo, eat more plants and waste less food, Hayek says. Reducing meat and wasting none of it will go a long way in reducing your own personal carbon footprint at home. He also suggests paying attention to the label that really matters – the nutrition facts panel on the back of the package, which is federally-regulated, transparent and benefits from decades of hard science, all things that the current slate of climate labels lack.","filter_flag":1}
{"title":"This engineer created a sustainable brand to upcycle waste fabric and clothes - YourStory","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3lvdXJzdG9yeS5jb20vaGVyc3RvcnkvMjAyMy8wMy8xMDAtZW1lcmdpbmctd29tZW4tbGVhZGVycy10aGlzLWVuZ2luZWVyLWNyZWF0ZWQtYS1zdXN0YWluYWJsZS1icmFuZC10by11cGN5Y2xlLXdhc3RlLWZhYnJpYy10d3JpbC1zdG9yZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3lvdXJzdG9yeS5jb20vaGVyc3RvcnkvMjAyMy8wMy8xMDAtZW1lcmdpbmctd29tZW4tbGVhZGVycy10aGlzLWVuZ2luZWVyLWNyZWF0ZWQtYS1zdXN0YWluYWJsZS1icmFuZC10by11cGN5Y2xlLXdhc3RlLWZhYnJpYy10d3JpbC1zdG9yZdIBAA?oc=5","id":"CBMijwFodHRwczovL3lvdXJzdG9yeS5jb20vaGVyc3RvcnkvMjAyMy8wMy8xMDAtZW1lcmdpbmctd29tZW4tbGVhZGVycy10aGlzLWVuZ2luZWVyLWNyZWF0ZWQtYS1zdXN0YWluYWJsZS1icmFuZC10by11cGN5Y2xlLXdhc3RlLWZhYnJpYy10d3JpbC1zdG9yZdIBAA","guidislink":false,"published":"Fri, 03 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=62, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3lvdXJzdG9yeS5jb20vaGVyc3RvcnkvMjAyMy8wMy8xMDAtZW1lcmdpbmctd29tZW4tbGVhZGVycy10aGlzLWVuZ2luZWVyLWNyZWF0ZWQtYS1zdXN0YWluYWJsZS1icmFuZC10by11cGN5Y2xlLXdhc3RlLWZhYnJpYy10d3JpbC1zdG9yZdIBAA?oc=5\" target=\"_blank\">This engineer created a sustainable brand to upcycle waste fabric and clothes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">YourStory<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"This engineer created a sustainable brand to upcycle waste fabric and clothes - YourStory","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijwFodHRwczovL3lvdXJzdG9yeS5jb20vaGVyc3RvcnkvMjAyMy8wMy8xMDAtZW1lcmdpbmctd29tZW4tbGVhZGVycy10aGlzLWVuZ2luZWVyLWNyZWF0ZWQtYS1zdXN0YWluYWJsZS1icmFuZC10by11cGN5Y2xlLXdhc3RlLWZhYnJpYy10d3JpbC1zdG9yZdIBAA?oc=5\" target=\"_blank\">This engineer created a sustainable brand to upcycle waste fabric and clothes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">YourStory<\/font>","source.href":"https:\/\/yourstory.com","source.title":"YourStory","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Like many working women, Sujata Chatterjee often wondered what to do with the clothes in her wardrobe that she simply wouldn’t use again. “Everyone I spoke to kept saying they had the same problem. It got me thinking that if this was a problem for most people, there needed to be a sustainable solution,” says Sujata, in a conversation with HerStory. Researching her problem, Sujata realised that fabric wastage was a huge global issue, one that was rarely talked about. “There are World Economic Forum reports that say that up to 60% of all manufactured clothes are actually wasted. I found that no organisation was working on this, nobody was talking about it. I also realised that while I have excess in my wardrobe, there are so many who need these clothes and so many other women who need a livelihood,” Sujata says. Keen to figure out a solution, the engineer in her launched Kolkata-based ﻿Twirl.Store﻿. Sujata set out on her entrepreneurial journey in 2017 as an initiative to “reduce cloth wastage, encourage women empowerment, conserve natural resources like water, and meet the clothing needs of the less fortunate”. The founder felt it was important to build a solution that helped society at large and the environment, and “get the conversation started”. Twirl collects all unwanted clothing and fabric from individuals and organisations. A section of these are given to people in slums and villages for use. The rest of the material is upcycled into new products such as bags, accessories, and gift items, sold online and offline. People who donate are rewarded them with points that can be redeemed to buy upcycled products on the website. “All work is done by rural women. We convert waste into beautiful eco-friendly, handcrafted products,” says Sujata, who had no idea about fashion or the world of entrepreneurship. However, she learnt everything on the job. She says she faced an uphill battle when she started as her model was unique. Most people were naysayers and believed she would never be able to be successful “with zero experience in the space” and by basing herself in Kolkata. “Many told me that I should move to Bengaluru or Delhi, or go abroad. Also, solo women founders have it tough. Everyone wanted a male counterpart,” she recalls, adding that she decided to run the business out of Kolkata and only with women. Today, Twirl is an all women organisation and has a team of over 20. Advising all women, Sujata says, “Believe in yourself, because if you don’t believe in yourself, nobody will. We are too busy looking for support, validation, and encouragement, but it starts with yourself.”","filter_flag":1}
{"title":"Top 10 Expo West Food Trends for Grocers - Progressive Grocer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL3RvcC0xMC1leHBvLXdlc3QtZm9vZC10cmVuZHMtZ3JvY2Vyc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL3RvcC0xMC1leHBvLXdlc3QtZm9vZC10cmVuZHMtZ3JvY2Vyc9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL3RvcC0xMC1leHBvLXdlc3QtZm9vZC10cmVuZHMtZ3JvY2Vyc9IBAA","guidislink":false,"published":"Tue, 14 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=73, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL3RvcC0xMC1leHBvLXdlc3QtZm9vZC10cmVuZHMtZ3JvY2Vyc9IBAA?oc=5\" target=\"_blank\">Top 10 Expo West Food Trends for Grocers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Progressive Grocer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Expo West Food Trends for Grocers - Progressive Grocer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL3RvcC0xMC1leHBvLXdlc3QtZm9vZC10cmVuZHMtZ3JvY2Vyc9IBAA?oc=5\" target=\"_blank\">Top 10 Expo West Food Trends for Grocers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Progressive Grocer<\/font>","source.href":"https:\/\/progressivegrocer.com","source.title":"Progressive Grocer","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"If someone says \"mycelium,\" what comes to mind? Mushrooms? Fungi? \"The Last of Us\"? Absolutely nothing? What about steaks? At the 2023 Natural Products Expo West show in Anaheim, Calif., March 7-11, mycelium steaks were on the menu, along with other trendy new products such as cassava tortillas, baru nut trail mixes, nootropic drinks and a new plant-based milk made from bamnuts. [Read more: \"Expo West Live: Inflation-Proof Categories Driving Sales for Grocers\"] For five days, more than 85,000 attendees hit the show floor, which was packed with more than 3,000 exhibitors, including Meati, maker of the mycelium steaks. Meati's Classic Steak Best New Meat Alternative at the 2023 Natural Products Expo West NEXTY Awards. “The NEXTY award is the crown jewel of the natural and organic food industry, and we’re honored to be recognized as we launch nationally with Sprouts Farmers Market,” said Scott Tassani, president and COO of Meati Foods. “After years spent developing an animal-free meat that delivers flavor, nutrition, clean ingredients and sustainability, it’s especially meaningful to be recognized as a standout given the incredible food innovation and discriminating standards that push this industry forward.” Meati's Classic Steak aims to deliver a complete-protein, clean-label beef alternative that appeals not only to the natural products shopper but also to the everyday consumer looking to diversify with animal-free options. It is composed of more than 95% mycelium (mushroom root), with the remaining 5% comprising salt, natural flavor, fruit juice for color, oat fiber, vegetable juice and lycopene for color, providing 30% DV of protein, 29% DV of fiber and a plethora of micronutrients. The Boulder, Colorado-based startup founded in 2017 has raised an additional $20 million in funding since announcing a $150 million series C round last summer, bringing its cumulative funding to $250 million. Meati is one in a long list of new companies at Expo West trying to create buzz around next-gen plant-based products in categories such as candy, snacks, beverages and cereal. Along with Meati, Progressive Grocer identified nine other hot products or trends expected to grow in popularity in the coming year that grocers could leverage to boost sales. Nootropics and Adaptogenics Nootropic is the buzzy attribute that natural and organic shoppers are looking for in their foods, and even their drinks, now. One nootropics-focused company at Expo West was Local Weather, a functional sports drink made for \"however you choose to move, without leaving your mind behind.\" The beverage is made for roller skating, gaming or \"just chillin\" after a jump-rope marathon, the brand says. It's proper hydration for your body as well as your brain, superpowered with nootropics, and only 6 grams of cane sugar. Made cleaner, healthier and friendlier, to regulate your own personal “local weather,” the brand says. Meanwhile, other brands such as Mindright offer new chips and protein bars filled with nootropics. Speaking of functional beverages and foods, adaptogenic products were booming at Expo West. Space Tea, which calls itself the world's first adaptogenic mushroom, iced tea and lemonade beverage, showcased six flavors: Original, Golden Mango, Summer Watermelon, Lemon Zero, Hibiscus Zero and Matcha Zero. Space Tea is certified organic, non-GMO, gluten-free, and kosher. Adaptogenics are everywhere, including in mocktails, trail mix and sparkling waters. Water-Neutral Water While many water companies at Expo West were focused on getting out of single-use plastic and into aluminum cans, FreshPure Waters was focused on being \"water neutral.\" According to the company, it's the only water brand that offsets all carbon and water used in its manufacturing processes. Water neutral also means the company is investing in watersheds. Bulk water is already 1,2000% more green than bottled, the company says, so by going water neutral, the brand can keep expanding its sustainability commitments. Anti-Bloat Prebiotics, probiotics, post-biotics and everything everywhere all at once having to do with taking care of the gut were big themes in products at this year's show. Spare Tonic is one brand focused on gut health. The probiotic sparkling tonics come in flavors such as passionfruit yuzu; blueberry ginger; cucumber lime; lemon ginger; peach turmeric, and feature nutrients such as protein, B vitamins, electrolytes, and gut-healthy probiotics while low in calories and sugar. Meanwhile the front of the package of Enzymedica's pre- and probiotic Blueberry Fiber Cookies says \"FOR YOUR DIGESTIVE HAPPINESS; BEAT THE BLOAT.\" The cookies contain a probiotic called MB40 that is \"clinically proven to beat the bloat,\" the company says. The New High Fiber Speaking of gut health, it was amazing to see so many innovative brands making high-fiber sexy again. One such brand is Fiber Gourmet. The company has developed a line of low calorie, low carb and high fiber foods for those consumers looking to indulge in pasta, crackers and \"other comfort foods.\" Founder Tehila Mocton's products feature RS4, a good-for-you fiber-boosting starch that weighs in at a slim 0.4 calories per gram, compared to traditional flour at 4 calories per gram. According to the company, RS4 passes through the stomach and small intestine to reach the colon. There, it converts into short-chain fatty acids, feeding good bacteria. Fiber from RS4 is a natural appetite suppressant that helps you feel fuller for longer, meaning less snacking and more weight loss. And RS4 can help regulate blood sugar by bypassing digestion and reducing average levels over time. BFY 'Junk Food' Quite possibly the biggest crowd I saw on the show floor was the one at the Goodles booth. People were \"ooohing\" and \"ahhing\" over their high-protein prebiotic mac and cheese. How can a brand with such a great name possibly go wrong? Founded in 2022 by actress Gal Gadot, 4x CEO Jen Zeszut, former Annie's President Deb Luster, brand entrepreneur Paul Earle, and R&D leader Molly Michet, Goodles is reinventing the better-for-you junk food category with style. Quest Nutrition was at the show showcasing its Doritos-style chips, and Dole Packaged Foods showed off its new Dole Whip at home products. Upcycled Foods Food waste is an increasingly big issue in grocery, and cutting back on it was a hot topic at the show. I saw more brands than ever showing off their Certified Upcycled labels. The Upcycled Certified Program is the world’s first third-party certification program for upcycled food ingredients and products. The flagship of the program is the on-package mark, which helps retailers feature upcycled products on shelf, and indicates to consumers which products are upcycled certified, providing the opportunity to prevent food waste with every purchase. Developed by the Upcycled Food Association, the mark highlights upcycled ingredients and products procured and produced with surplus food or food by-products from manufacturing, that use verifiable supply chains and have a positive impact on the environment. One such company was RIND, which says it believes a healthy snack can be both good for you and the planet. \"Our mission is to help consumers SNACK BETTER and DO BETTER by eating the whole fruit, maximizing nutritional value and minimizing food waste,\" according to the company's website. In 2021, eating RIND products helped save more than 340,000 pounds of food waste, the company says. Frozen Innovations Frozen foods are hot as inflation-battered shoppers look to save money on groceries, and there was plenty of frozen innovation at Expo West. One such innovator was Bobabam; with their product, you can just warm up the frozen boba, add milk and bam — you have the boba teahouse experience at home. Fabalish has new falafel bites that come in cute flavors such as Cheddary Broccoli, Zesty Zucchini and Kickin' Carrot. The bites are vegan, gluten-free, organic, allergen free and made with whole veggies. And I can't forget to mention Swell, the first ever gelato made for dogs. According to the Oregon-based company, Swell was created out of nostalgia for a time when food was prepared with simple yet wholesome ingredients to be shared with those you love. Each of Swell's gelatos is handmade and crafted in small batches, making them unique and delicious. They come in six flavors with \"100% natural ingredients.\" Certified B Another certification that people were buzzing about at Expo West was Certified B. More and more companies are choosing to certify as a B Corp., which designates that a business is meeting high standards of verified performance, accountability and transparency on factors ranging from employee benefits and charitable giving to supply chain practices and input materials. Mega Foods, Portlandia Foods, Partake Foods, Pitaya Foods, Miyoko's Creamery, and others are part of a growing list of Certified B food companies. Low Sodium Salt As more U.S. consumers look to reduce their sodium intake, here comes MicroSalt, a developer and manufacturer of a proprietary low-sodium salt called MicroSalt. According to the company website, \"We are passionate about improving peoples’ lives with better-for-you seasonings and snacks by taking the lead in the industry by providing the best low-sodium salt solution, based on the mechanical transformation of the salt particle itself.\" The company's patented technology produces salt crystals that are approximately one hundred times smaller than typical table salt, delivering a powerful saltiness as the micro-grains dissolve in the mouth, with approximately 50% less sodium consumption. Additionally, the ultra-small particle size enhances product adhesion, which reduces waste and provides improved flavor consistency.","filter_flag":1}
{"title":"The Age of Food Delivery: The Issue of Plastic Overuse - 국민대학교","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcHJlc3Mua29va21pbi5hYy5rci9uZXdzL2FydGljbGVWaWV3Lmh0bWw_aWR4bm89MTAyODIy0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcHJlc3Mua29va21pbi5hYy5rci9uZXdzL2FydGljbGVWaWV3Lmh0bWw_aWR4bm89MTAyODIy0gEA?oc=5","id":"CBMiPmh0dHBzOi8vcHJlc3Mua29va21pbi5hYy5rci9uZXdzL2FydGljbGVWaWV3Lmh0bWw_aWR4bm89MTAyODIy0gEA","guidislink":false,"published":"Fri, 03 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=62, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcHJlc3Mua29va21pbi5hYy5rci9uZXdzL2FydGljbGVWaWV3Lmh0bWw_aWR4bm89MTAyODIy0gEA?oc=5\" target=\"_blank\">The Age of Food Delivery: The Issue of Plastic Overuse<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">국민대학교<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Age of Food Delivery: The Issue of Plastic Overuse - 국민대학교","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcHJlc3Mua29va21pbi5hYy5rci9uZXdzL2FydGljbGVWaWV3Lmh0bWw_aWR4bm89MTAyODIy0gEA?oc=5\" target=\"_blank\">The Age of Food Delivery: The Issue of Plastic Overuse<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">국민대학교<\/font>","source.href":"https:\/\/press.kookmin.ac.kr","source.title":"국민대학교","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"As the use of food delivery services has increased dramatically over the past three years of the COVID-19 pandemic, the use of plastic containers has increased accordingly. Not only do we have to focus on the hygiene of delivered food, but we also have to consider the problem of environmental pollution that comes with the overuse of plastic containers. After investigating the amount of plastic use for the 10 most popular delivery foods, a study published by the Korea Consumer Agency in February 2022 revealed that an average of 18.3 plastic containers were used per menu item. Reflecting the average number of food delivery orders, which is 2.8 times per week, 10.8kg of plastic containers are used annually per capita. Among these plastic containers, the recyclable ones were estimated to be only 45.5%, which is not even half. With the prolonging of the COVID-19 pandemic, the food delivery market expanded dramatically, followed by an increase in plastic use. According to Green Korea, consumers feel guilty about the huge amount of plastic containers that are involved in their food orders. A survey on how consumers feel when they throw away their food delivery trash showed that 42% answered that they feel uncomfortable and worried, and 34% responded that they feel guilty. Although it is best not to use plastic, using plastic is unavoidable. Therefore, multi-use containers are being suggested as an alternative, but South Korea is making slow progress on introducing relevant policies compared to other advanced countries such as Europe and Canada. However, little effort is being made to reduce the use of plastic containers for food delivery, such as giving consumers the option to select multi-use containers when they order their food. Through this system, food is packed and delivered in multi-use containers, after which the containers are picked up by a business specializing in multi-use containers. Currently, a number of restaurants in Gangnam-gu, Seoul, are engaging in this practice. Similarly, the Korea Environment Corporation and Seoul Metropolitan City have conducted a campaign to give consumers points for picking up their food with their own containers or plates. The use of multi-use containers, however, incurs expenses when they are picked up and washed, and these expenses are currently paid by consumers themselves or the public budget. As this financial burden has been pointed to as a limitation, some people insist that food delivery app companies should pay the expenses required for multi-use containers. Since such companies have increased in number and influence due to the prolonged COVID-19 crisis, some people say that they must take responsibility for their environmental impact, especially now that corporate social responsibility has become an important focus. Internationally, policies to reduce the use of plastic are being actively implemented. In the European Union, for example, the use of plastic containers is forbidden. Since last July, the 10 most widely used plastic products, such as food containers and vinyl bags, have been banned. In Canada, non-recyclable food delivery containers, vinyl bags, and plastic straws have been banned. The problem of plastic overuse has increased during the last three years of the COVID-19 pandemic, becoming a global environmental issue. As important as policy-making is, changing the daily habits of consumers is also vital in order to reduce the use of plastic. To this end, the 5R's of waste management have been introduced as a guideline for people in their daily lives. First, refuse unnecessary items such as disposable spoons and chopsticks when ordering delivery food if you do not really need them. Second, reduce the amount of goods you buy in the first place and choose reusable items over disposable ones. Specifically, replace all single-use eating utensils and paper plates with reusable alternatives. Third, reuse items by washing and repairing them. Fourth, recycle properly and try to use upcycled products, which are new products made using by-products. Last but not least, there is ROT, which includes using biodegradable products such as vinyl made with corn husks and wet wipes made with 100% wood pulp. Now that we are experiencing climate change and extreme weather events, people are becoming aware that the issue of environmental protection can no longer be ignored. Responsible consumption and production that considers the environment were deemed good in the past, but they are now becoming absolute necessities. It is time for us to take responsibility for our common resources and do our duty for future generations. aprilkim404@kookmin.ac.kr","filter_flag":1}
{"title":"Top 10 Best Handicraft Companies In USA 2023 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWJlc3QtaGFuZGljcmFmdC1jb21wYW5pZXMtaW4tdXNhL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWJlc3QtaGFuZGljcmFmdC1jb21wYW5pZXMtaW4tdXNhL9IBAA?oc=5","id":"CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWJlc3QtaGFuZGljcmFmdC1jb21wYW5pZXMtaW4tdXNhL9IBAA","guidislink":false,"published":"Mon, 06 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=65, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWJlc3QtaGFuZGljcmFmdC1jb21wYW5pZXMtaW4tdXNhL9IBAA?oc=5\" target=\"_blank\">Top 10 Best Handicraft Companies In USA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Handicraft Companies In USA 2023 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvdG9wLTEwLWJlc3QtaGFuZGljcmFmdC1jb21wYW5pZXMtaW4tdXNhL9IBAA?oc=5\" target=\"_blank\">Top 10 Best Handicraft Companies In USA 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"INTRODUCTION Handicrafts are becoming increasingly popular in the United States. From paintings and sculptures to unique jewelry, these handcrafted items are in high demand by those who appreciate quality craftsmanship and unique designs. In 2023, there are numerous handicraft companies across the country that offer a variety of products. In the Midwest, there is Blanketworks, which creates blankets and accessories from a blend of natural and synthetic fibers. The company offers a wide range of colors and patterns that allow customers to create their own personalized blankets. In the South, Cotton & Clay creates handmade pottery and ceramic dishes. This company focuses on creating functional pieces of art that can be used in the home. In the Northeast, there is North Shore Pottery, which specializes in creating one-of-a-kind vessels and decorative pieces. Each piece is handmade with care using traditional methods and materials. In the West Coast, Moondance Jewelry creates stunning pieces of jewelry using a variety of gemstones and precious metals. Every piece is unique and custom made for the customer. No matter where you live in the United States, there are sure to be plenty of handicraft companies available in 2023. By supporting local artisans, you can help promote the vibrancy of the handmade community. IMPORTANCE Handicraft companies in the United States are becoming increasingly important in 2023. This is due to a few key factors, such as an increased demand for handmade goods and products, the rise of online shopping, and a growing appreciation for craftsmanship. Handicraft companies are able to provide unique, one-of-a-kind products that customers find appealing and desirable. Additionally, many of these companies specialize in unique items that are difficult to find elsewhere. Customers appreciate the customized, personal touch that comes with shopping with handicraft companies. The popularity of e-commerce websites has made it easier than ever for consumers to shop from home. This has been particularly beneficial for handicraft companies, as they can now reach a much larger customer base. In addition, with the help of social media and other forms of digital marketing, handicraft companies can better promote their products, as well as let customers know about new products and special offers. As more people become interested in supporting small businesses, there is an increased demand for handmade items. Handicraft companies offer unique items that cannot be found in stores and this makes them attractive to customers. Furthermore, many of these companies are led by artisans who have a deep understanding of the craft and are passionate about delivering quality products. They take pride in the work they do and this is reflected in their products. The rise of sustainability initiatives has also helped to increase the importance of handicraft companies. Consumers are becoming more conscious of their environmental impact, which has encouraged them to purchase products that are locally sourced and produced in an eco-friendly manner. By shopping with handmade products, customers are supporting local businesses and helping to reduce their carbon footprint. Overall, handicraft companies are becoming increasingly important in 2023 as demand for their services and products grows. Customers appreciate the unique, customized products they offer, and the fact that they are supporting sustainable practices and local businesses. Handicraft companies provide an invaluable service and are sure to remain relevant in the years to come. Here are the top 10 best handicraft companies in USA 2023. Michael’s company – Michael’s company is a cutting-edge technology firm, specializing in artificial intelligence and machine learning. They provide services to a variety of clients, ranging from small startups to large corporations. Their team consists of highly skilled software engineers, data scientists, and AI experts. Their focus is on building powerful, intelligent systems that can learn from their environment and improve themselves over time. To accomplish this goal, the company uses a combination of deep learning, natural language processing, computer vision, and other advanced techniques. The company is constantly striving to stay ahead of the competition by investing in research and development, while maintaining a strong focus on delivering real-world results. Their products have been adopted by a number of prestigious organizations, including Fortune 500 companies. In order to ensure that their solutions remain competitive in the rapidly evolving field of AI, Michael’s company is committed to developing high-quality systems that are reliable, secure, and maintainable. They also strive to be socially responsible, focusing on ethical and responsible practices when using AI and machine learning technologies. They are dedicated to providing innovative solutions for a wide range of problems and take pride in delivering the best possible results for their clients. With a team of experienced professionals and a commitment to staying on the forefront of technology, Michael’s company is well positioned to continue to provide value to its customers for years to come. Darice – Darice is an international arts and crafts company that has been in business since 1954. The company specializes in providing a wide range of craft supplies, including ribbons, buttons, paint, beads, jewelry and more. Darice also sells a variety of party decorations and holiday items, as well as crafting tools such as scissors, glue and markers. In addition to selling products online, Darice operates numerous retail stores throughout the United States and Canada. Customers can also find Darice products at craft supply stores, big-box retailers and discount stores. The company prides itself on offering exceptional customer service and competitive prices. It strives to make each customer’s shopping experience enjoyable and stress-free. Darice values innovation and encourages customers to be creative with their projects. The company also offers regular sales and discounts, as well as free shipping for orders over $25. With its combination of quality products, unbeatable prices and outstanding customer service, Darice is a leader in the global arts and crafts industry. AC Moore – AC Moore is a specialty arts and crafts retailer based in Moorestown, New Jersey. They offer a wide variety of items such as yarn, ribbon, fabric, paint, paper, beads, scrapbooking supplies, home decor items, and more. They also provide classes, workshops, and demos to help customers learn new skills and techniques. AC Moore focuses on providing an excellent customer experience with friendly and knowledgeable in-store associates, competitive pricing, and a vast selection of products. AC Moore also provides an online store and mobile app offering valuable coupons and promotions. The company has over 145 stores located throughout the eastern United States. Their mission is to inspire creativity by offering a broad selection of high quality arts, crafts, and educational products at competitive prices. AC Moore offers a wide range of products for all sorts of creative projects from painting, drawing, and sculpting to needlework, jewelry making, scrapbooking, and more. With their many services and helpful staff, AC Moore is sure to have something for everyone! Hobby Lobby – Hobby Lobby is an American arts and crafts retail chain founded in 1972. It was originally a small family-owned business, but has since grown to become one of the largest arts and crafts retailers in the United States. Hobby Lobby stores offer more than 70,000 products ranging from home decor and fabrics to craft supplies and jewelry making tools. The company also provides a wide range of seasonal items such as holiday decorations, party supplies and gift ideas. The store also offers educational resources such as classes and workshops. Hobby Lobby offers competitive prices, often beating out competitors in its market. In addition to its physical locations, Hobby Lobby operates an online store which features a larger selection of products than those found in-store. The company employs more than 33,000 people and operates over 800 stores across the United States. Hobby Lobby is committed to providing customers with quality products and excellent customer service. The company strives to provide positive experiences for its customers by building relationships with them and supporting their creative pursuits. A.C. Moore Arts & Crafts – A.C. Moore Arts & Crafts is a chain of retail stores that specialize in arts, crafts and home decor items. Founded in 1985, the company has grown to over 145 stores across the United States, selling everything from custom framing to cake decorating supplies. A.C. Moore offers a wide range of products and services to meet customers’ needs for creativity and self-expression. They offer classes and workshops, as well as an online store with thousands of items available for purchase. Customers can find unique items like handmade pottery, paint-your-own ceramics, baking supplies, jewelry-making kits and more. In addition, the store provides special services such as customized framing, custom invitations, and custom orders. With a knowledgeable and friendly staff, A.C. Moore is a great place to find something special for yourself or someone else. Whether you’re looking for art supplies, scrapbooking materials, home decor items, or just something unique, you’ll be sure to find it at A.C. Moore. From craft ideas to party planning, A.C. Moore has everything you need to make every moment creative. Jo-Ann Fabric and Craft Stores – Jo-Ann Fabric and Craft Stores is a nationwide retailer of fabric, craft items, home decor, and more. Founded in 1943, the company has grown to include over 860 stores across the United States. Jo-Ann offers an extensive range of products from knitting and sewing supplies to quilting fabrics, yarns, and card making supplies. They also have a website where customers can shop for all their crafting needs online. The company also provides classes and workshops for those who want to learn more about crafting and crafting techniques. In addition, Jo-Ann offers discounts to customers on bulk orders and online purchases. With every purchase, customers are given exclusive access to special deals and discounts. Jo-Ann also provides customers with an exceptional customer service experience, ensuring that they receive quality merchandise and helpful advice when they need it. Jo-Ann’s commitment to providing quality products and services is evidenced by the fact that they are the only craft store chain to be named to the Top 100 Retailers list by Forbes Magazine. Whether you’re looking for fabrics, crafts, or home décor, Jo-Ann Fabric and Craft Stores has everything you need to complete your creative projects. Creative Expressions Company – Creative Expressions Company is an innovative and creative studio, founded in 2023. We specialize in designing and creating high-quality digital products that are sure to captivate any audience. Our team of professional graphic designers, web developers, and video editors have the experience and skill to bring any idea to life. Whether you’re looking for a website design, logo design, or a complete branding package, we’ve got you covered. We also specialize in creating stunning social media campaigns, promotional videos, and engaging infographics. No matter how complex your project, Creative Expressions Company has the expertise to handle it. Our professional services include custom web development, optimized search engine optimization, and a wide range of digital marketing solutions. We also offer dynamic eCommerce solutions tailored to your needs. We even provide customized WordPress websites built with modern features and usability. When it comes to branding, our team has a deep understanding of the latest trends and techniques, from colors to typography. We have years of experience in crafting compelling stories and slogans that will leave a lasting impression on your potential clients. At Creative Expressions Company, we strive to give each of our clients the individual attention they deserve. We take pride in helping you build a successful business, and grow your brand’s reputation in the digital world. From initial concept to finished product, you can trust us to deliver beautiful and effective results that are sure to make a positive impact on your bottom line. Ben Franklin Crafts Company – Ben Franklin Crafts Company is a family-owned store that has been in business for over 50 years. Located in Grand Rapids, Michigan, it offers customers a large selection of craft supplies and home décor items. Ben Franklin also carries a variety of scrapbooking and quilting materials, as well as holiday decorations and party supplies. In addition, they offer classes and workshops on different craft activities such as jewelry making and scrapbooking. They also have an extensive selection of high quality brands like Cricut, Brother, and Silhouette. The staff at Ben Franklin Crafts Company is friendly and knowledgeable, and they are always willing to help customers with their projects. It’s a great place to find everything you need to make crafts and decorate your home. Ben Franklin Crafts Company is dedicated to providing excellent customer service and helping people unleash their creativity. TerraCycle – TerraCycle is a global upcycling and recycling company that works to eliminate the idea of waste. Founded in 2001, TerraCycle collects difficult to recycle packaging and products and repurposes them into affordable and innovative recycled products. Their aim is to divert non-recyclable materials away from landfills and create innovative solutions for hard to recycle materials. They are involved in many projects around the world, including their Loop initiative which aims to minimize single-use plastic and create a closed loop system to reuse resources. TerraCycle’s main mission is to create a world where nothing is wasted. To achieve this goal, they focus on four main areas: Upcycling, Recycling, Composting and Education. With their upcycling initiatives, TerraCycle takes difficult to recycle items and turns them into creative, new products. Through this process, TerraCycle makes sure these items will never end up in landfills. Through their recycling initiatives, TerraCycle creates closed-loop systems for items such as coffee capsules, toothbrushes, and other hard to recycle items that are not recyclable through traditional methods. Using their composting initiatives, TerraCycle also helps to turn organic waste into valuable fertilizers and soil amendments. In addition, they offer educational initiatives to help people learn more about reducing, reusing, and recycling. With over 20 years of innovation and experience, TerraCycle has become an international leader in the circular economy. They have diverted billions of pieces of waste from landfills and created countless upcycled products in the process. TerraCycle is paving the way for a future with zero waste by leading the charge in creating a circular economy. Lakeshore Learning Materials – Lakeshore Learning Materials is a family owned and operated educational supplies company founded in 1954. They specialize in providing quality materials for early childhood and elementary classrooms. The company’s mission is to help teachers and parents create engaging, enriching, and inspiring learning environments for children. Lakeshore is headquartered in Carson, California and operates over 130 stores in the United States, Canada, and Puerto Rico. The company offers a wide variety of products including classroom furniture, manipulatives, language arts materials, math activities, science experiments, music and movement items, art supplies, and parent resources. Additionally, Lakeshore offers professional development sessions, seminars, and workshops for educators. Lakeshore also provides teachers with access to their online store, where they can purchase lesson plans and other materials from their own computer. In addition to its retail presence, Lakeshore has an extensive catalog model that allows customers to order items from the comfort of their own homes. With the catalog model, customers can have products shipped directly to their doorsteps. Furthermore, Lakeshore also offers a rewards program that allows customers to earn points for purchases and redeem them for gifts or discounts. Lakeshore’s commitment to providing high-quality educational materials and resources to teachers and parents has made it one of the most respected brands in the industry. For nearly 70 years, Lakeshore has remained dedicated to helping children develop creative minds and a love of learning. CONCLUSION Handicraft companies in the USA are thriving in 2023. With more people turning to sustainable, eco-friendly products, the demand for handmade items is higher than ever. Many craft companies have taken advantage of this trend by offering unique, one-of-a-kind items. They offer customers a wide range of services, ranging from custom orders to ready-made products. There has also been a rise in online marketplaces that allow crafters to reach a larger audience. The future looks bright for the industry, with many companies expanding their operations and increasing their product lines. Consumers can expect to see even more unique, high-quality products in the years ahead.","filter_flag":1}
