{"title":"Siemens and Microsoft launch Industrial Copilot for manufacturing - Tech Monitor","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vdGVjaG1vbml0b3IuYWkvdGVjaG5vbG9neS9haS1hbmQtYXV0b21hdGlvbi9zaWVtZW5zLW1pY3Jvc29mdC1haS1pbmR1c3RyaWFsLWNvcGlsb3TSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vdGVjaG1vbml0b3IuYWkvdGVjaG5vbG9neS9haS1hbmQtYXV0b21hdGlvbi9zaWVtZW5zLW1pY3Jvc29mdC1haS1pbmR1c3RyaWFsLWNvcGlsb3TSAQA?oc=5","id":"CBMiW2h0dHBzOi8vdGVjaG1vbml0b3IuYWkvdGVjaG5vbG9neS9haS1hbmQtYXV0b21hdGlvbi9zaWVtZW5zLW1pY3Jvc29mdC1haS1pbmR1c3RyaWFsLWNvcGlsb3TSAQA","guidislink":false,"published":"Tue, 31 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=304, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vdGVjaG1vbml0b3IuYWkvdGVjaG5vbG9neS9haS1hbmQtYXV0b21hdGlvbi9zaWVtZW5zLW1pY3Jvc29mdC1haS1pbmR1c3RyaWFsLWNvcGlsb3TSAQA?oc=5\" target=\"_blank\">Siemens and Microsoft launch Industrial Copilot for manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tech Monitor<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Siemens and Microsoft launch Industrial Copilot for manufacturing - Tech Monitor","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vdGVjaG1vbml0b3IuYWkvdGVjaG5vbG9neS9haS1hbmQtYXV0b21hdGlvbi9zaWVtZW5zLW1pY3Jvc29mdC1haS1pbmR1c3RyaWFsLWNvcGlsb3TSAQA?oc=5\" target=\"_blank\">Siemens and Microsoft launch Industrial Copilot for manufacturing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tech Monitor<\/font>","source.href":"https:\/\/techmonitor.ai","source.title":"Tech Monitor","query":"https:\/\/news.google.com\/rss\/search?q=\"Product life cycle management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Siemens is working with Microsoft to bring more AI systems into the manufacturing industry. The two companies are launching Siemens Industrial Copilot, an AI-powered assistant they have jointly developed to improve human-machine collaboration in factories. Microsoft CEO Satya Nadella, left, with Siemens counterpart Roland Busch. (Photo: Siemens) The launch is part of an ongoing partnership between the companies, which will also see Siemens’ Teamcenter software for product life-cycle management integrated with Microsoft Teams, a move the duo says will pave the way for “enabling the industrial metaverse“. How Siemens Industrial Copilot will work The Copilot will apparently allow users to generate, optimise and debug complex automation code, something that Siemens says will significantly shorten simulation times, reducing a task that previously took weeks to complete to a matter of minutes. The system is able to ingest automation and process simulation information from the Siemens Xcelerator digital platform and enhances this using Microsoft’s Azure OpenAI Service. It can also be used to boost productivity and efficiency across the industrial life cycle, Siemens says. Using natural language prompts, maintenance staff can be assisted with detailed repair instructions and engineers with quick access to simulation tools. The companies say customers will maintain full control over data they input into the platform, and say it is not used to train underlying AI models. “Together with Microsoft, our shared vision is to empower customers with the adoption of generative AI,” said Roland Busch, CEO of Siemens. “This has the potential to revolutionise the way companies design, develop, manufacture and operate. Making human-machine collaboration more widely available allows engineers to accelerate code development, increase innovation and tackle skilled labour shortages.” The companies say they envision AI copilots assisting professionals in various industries, including manufacturing, infrastructure, transportation and healthcare. Copilots for specific manufacturing sectors, such as automotive, consumer package goods and machine building, are already in the works, though no details have been revealed yet. Siemens says automotive supplier Schaeffler is an early adopter of the Industrial Copilot. No release date has been disclosed for the Copilot, but as of December Siemens will be making its Teamcenter for Microsoft Teams generally available. The new app uses generative AI to connect functions across the product design and manufacturing life cycle such as front-line workers to engineering teams by connecting Siemens’ Teamcenter software for product life-cycle management (PLM) with Teams to make data more accessible for factory and field service workers. “This will enable millions of workers who do not have access to PLM tools today to contribute to the design and manufacturing process more easily as part of their daily work,” a Siemens statement said. Are manufacturers enthusiastic about AI? Microsoft, along with all other major tech vendors, has been investing heavily in AI tools over the past year and stole a march on the competition through its partnership with ChatGPT creator OpenAI. View all newsletters Sign up to our newsletters Data, insights and analysis delivered to you By The Tech Monitor team Sign up here This investment seems to have given its Azure cloud platform an early revenue boost, but while the appetite for AI among tech leaders is high, most artificial intelligence projects in industry are still in the early stages. According to research released yesterday by Nash Squared, only one in ten organisations has embarked on a significant AI deployment. In manufacturing, there is enthusiasm for the potential benefits AI could bring, with 73% of tech leaders from the sector polled saying they believe the benefits of AI outweigh the drawbacks, slightly above the global average. The Nash Squared survey polled 50,000 IT decision-makers from around the world. Microsoft CEO Satya Nadella said the next generation of AI presents \"a unique opportunity to accelerate innovation across the entire industrial sector\". He added: “We’re building on our long-standing collaboration with Siemens and bringing together AI advances across the Microsoft cloud with Siemens’ industrial domain expertise to empower both frontline and knowledge workers with new, AI-powered tools, starting with Siemens Industrial Copilot.”","filter_flag":1}
