{"title":"We're Eco-designing, From R&D to Commercialization - Sanofi","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNhbm9maS5jb20vZW4vbWFnYXppbmUvc29jaWFsLWltcGFjdC93ZS1yZS1lY28tZGVzaWduaW5nLWZyb20tcmQtdG8tY29tbWVyY2lhbGl6YXRpb27SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNhbm9maS5jb20vZW4vbWFnYXppbmUvc29jaWFsLWltcGFjdC93ZS1yZS1lY28tZGVzaWduaW5nLWZyb20tcmQtdG8tY29tbWVyY2lhbGl6YXRpb27SAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LnNhbm9maS5jb20vZW4vbWFnYXppbmUvc29jaWFsLWltcGFjdC93ZS1yZS1lY28tZGVzaWduaW5nLWZyb20tcmQtdG8tY29tbWVyY2lhbGl6YXRpb27SAQA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNhbm9maS5jb20vZW4vbWFnYXppbmUvc29jaWFsLWltcGFjdC93ZS1yZS1lY28tZGVzaWduaW5nLWZyb20tcmQtdG8tY29tbWVyY2lhbGl6YXRpb27SAQA?oc=5\" target=\"_blank\">We're Eco-designing, From R&amp;D to Commercialization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sanofi<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"We're Eco-designing, From R&D to Commercialization - Sanofi","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LnNhbm9maS5jb20vZW4vbWFnYXppbmUvc29jaWFsLWltcGFjdC93ZS1yZS1lY28tZGVzaWduaW5nLWZyb20tcmQtdG8tY29tbWVyY2lhbGl6YXRpb27SAQA?oc=5\" target=\"_blank\">We're Eco-designing, From R&amp;D to Commercialization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sanofi<\/font>","source.href":"https:\/\/www.sanofi.com","source.title":"Sanofi","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"It refers to evaluating and improving our products' environmental footprint across their entire value chain. From raw material extraction and transformation, to manufacturing, all the way up to distribution and the end-of-life treatment. Eco-design is part of our strategy to optimize our products’ environmental performance. And we’ve made strong commitments. All our new products will be Eco-designed by 2025, and all top-20-selling products by 2030. Applying a Life Cycle Assessment Methodology Eco-design begins on day one. Thanks to an international standardized and science-based Life Cycle Assessment (LCA) methodology, we proactively evaluate the potential environmental impacts of our products according to multi-impact categories (e.g., climate change, water scarcity, fossil resource use) aligned with ISO 14040\/44 and European Commission Product Environmental Footprint (PEF) standards. Once we’ve assessed our products environmental profile, we identify, monitor and execute efficient improvement levers to deliver eco-innovative products. Since 2021, we completed 7 environmental LCAs.","filter_flag":1}
{"title":"5 Ways Tech Companies Can Improve Their Sustainability - Entrepreneur","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA","guidislink":false,"published":"Mon, 12 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=163, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5\" target=\"_blank\">5 Ways Tech Companies Can Improve Their Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrepreneur<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 Ways Tech Companies Can Improve Their Sustainability - Entrepreneur","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZ3JlZW4tZW50cmVwcmVuZXVyLzUtd2F5cy10ZWNoLWNvbXBhbmllcy1jYW4taW1wcm92ZS10aGVpci1zdXN0YWluYWJpbGl0eS80NTI5NTfSAQA?oc=5\" target=\"_blank\">5 Ways Tech Companies Can Improve Their Sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Entrepreneur<\/font>","source.href":"https:\/\/www.entrepreneur.com","source.title":"Entrepreneur","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Opinions expressed by Entrepreneur contributors are their own. In an era where environmental concerns have reached unprecedented levels, businesses across all industries face the imperative of adopting sustainable practices. Among the various industries around the globe, the technology sector has emerged as a prominent player, recognizing the pressing need to prioritize green initiatives. With growing consumer awareness and demand for eco-friendly solutions, tech companies have realized that sustainability is no longer a mere trend but a critical driver of success that has a significant impact on their bottom line. According to research conducted by Deutsche Bank, companies with high ratings for environmental, social, and governance (ESG) have a lower cost of debt and equity. These findings were corroborated by MSCI in 2020. Additionally, the findings show that companies with high ESG ratings outperform the market in the medium and long term. Further, by implementing stewardship-focused programs, companies have not only seen growth in their financials but also in brand awareness. By adopting circular economic models, implementing waste reduction programs, and increasing their focus on extended life cycles of their assets, companies are creating a shift toward doing business from an eco-friendly perspective. This shift has created the need for companies that specialize in helping large organizations develop sustainability plans, operate with a focus on being eco-friendly, reduce waste, and implement strong stewardship practices. Here are five strategies that tech companies around the globe are using to level up their green credentials while decreasing their negative impact. Related: This Is Why Your Business Should Prioritize Environmental Efforts 1. Embrace the circular economy The circular economy model is an economic framework that aims to minimize waste and maximize the efficient use of resources. In contrast to the conventional linear economy, circular economy promotes a closed-loop system where materials and products are continuously reused, repaired, remanufactured, or recycled to create new value. According to McKinsey, the European circular economy market size for electronics is expected to grow from €60 to €95 billion by 2030. Additionally, resource productivity is estimated to grow by 3 percent, which will generate cost savings of around €600 billion as well as €1.8 trillion in other economic benefits annually. For businesses, one of the most important resources they have at their hands is technology, be it software or hardware. Often, the largest and most impactful investments an organization makes are technology-related. With computer hardware accounting for around 30% of overall IT budgets, hardware spending is the largest portion of overall tech spending. Consequently, hardware products, such as laptops, tablets, and smartphones, are often at the top of the list in both cost and volume. The circular economy is based on the principles of designing for longevity and efficiency while minimizing waste and pollution. This is achieved by keeping assets and materials, such as smartphones or laptops, in use for as long as possible. Additionally, efforts are made to regenerate natural systems. In 2021, ATRenew reduced emissions by a total of 464,000 metric tons through re-commercializing pre-owned phones. This is equivalent to the carbon sink of about 1,533 square kilometers of urban forests in one year. 2. Invest in eco-friendly products and manufacturing One of the key benefits of the implementation of a circular economy model is the reduction in waste. By prioritizing the reusing, repairing, and recycling of resources, the circular economy model minimizes the amount of waste that ends up in landfills or incinerators. According to the European Environment Agency, waste management, industrial processes, and product use account for over 12% of greenhouse gas emissions in the EU. Consequently, a circular economy model reduces the environmental impacts associated with waste disposal and mitigates pollution and greenhouse gas emissions during manufacturing. Investing in eco-friendly manufacturing processes and products is crucial for minimizing environmental impact. According to the Ellen MacArthur Foundation, 80% of a product's environmental impact is decided in the initial design stages. Companies can increase their green credentials by using sustainable materials, reducing energy consumption, and minimizing waste. Further, sustainable practices attract environmentally conscious customers, positioning sustainable businesses as leaders in a competitive marketplace. In other words, embracing sustainability is both a moral and strategic imperative for the long-term success of any business. Related: How to Overcome the Shortage of Tech Talent in the US 3. Encourage and facilitate recycling Recycling plays a crucial role in reducing electronic waste (e-waste), so encouraging it is important in promoting and advancing a sustainable approach to technology. With technological advancements continuing to happen at an astonishing rate, it is becoming increasingly important for tech companies to take responsibility for the lifecycle of their products. Companies can help reduce e-waste and minimize their environmental impact by implementing effective strategies, such as trade-in programs or recycling events that incentivize consumers to recycle their old devices. For example, tech companies can establish partnerships or in-house programs that allow consumers to trade in their used devices in exchange for credit toward a new purchase. Not only does this encourage the recycling of devices, but it also promotes brand loyalty and customer satisfaction. Education and awareness campaigns can also be powerful tools, especially considering that many electronic devices contain valuable and limited resources. Materials like lead, silver, copper and gold are essential for manufacturing new technology, making recycling even more attractive. Related: The U.S. Has a Huge E-Waste Problem. But There Is Money To Make in Its Disposal. 4. Extend the lifecycle of devices Extending the lifespan of electronic devices offers both financial and environmental benefits. By offering repair services, manufacturers and third-party providers can help consumers prolong the lifespan of their electronic devices. Not only is this often cheaper than buying a new device, but it also reduces e-waste and minimizes the environmental impact of manufacturing a new device. Another approach businesses can take to extend the lifecycle of electronic devices is to sell their used devices. By selling thoroughly tested and repaired used devices at a reduced price with a warranty, consumers bask in a vibrant array of choices, extending beyond the realm of brand-new products. According to Counterpoint Research, the demand for refurbished smartphones continues to grow. In 2022, the global secondary smartphone market saw growth of 5% year-over-year, with refurbished iPhone sales growing by 16%. Additionally, the secondary market of refurbished devices also creates new opportunities for businesses and consumers to get some of their investments back, reducing the overall cost of ownership and making affordable technology more accessible. Manufacturers can also support the environment by making affordable replacement parts available and providing repair guides or tutorials. Companies can extend the lifespan of their products and foster customer loyalty simultaneously by embracing repairability and sustainability. 5. Foster a culture of sustainability Promoting sustainability within the company culture is essential for sustainable organizations aiming to make a positive environmental impact. Integrating sustainability into a company's core values, practices, and decision-making processes becomes a shared responsibility and commitment among employees, consumers, and stakeholders. This commitment then leads to a range of benefits for all involved parties, as well as the environment. Weaving a strong sustainability policy into a company's foundation as well as educating and engaging employees, sets a whole new standard that also comes with numerous benefits. Not only do sustainable organizations attract quality employees and sustainability-focused customers, but they also benefit financially. For example, after successfully defining and implementing a stewardship plan focusing on sustainability, REI now has one of the most successful circular commerce programs of any outdoor retail brand, taking in around 100,000 outdoor-related items to be traded or resold in their store locations in 2022. By integrating sustainability into all operations, tech companies can drive change and contribute to a more sustainable future. Related: 3 Ways You Can Bring Sustainability to Your Workplace","filter_flag":1}
{"title":"The future of materials - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA","guidislink":false,"published":"Fri, 02 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=153, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5\" target=\"_blank\">The future of materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The future of materials - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvdGhlLWZ1dHVyZS1vZi1tYXRlcmlhbHMuaHRtbNIBAA?oc=5\" target=\"_blank\">The future of materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www2.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Introduction: Eastman was founded in 1920 in Kingsport, Tennessee, by Eastman Kodak and spun off by Kodak as a new entity in 1994. Today, it is a global specialty materials company that produces a broad range of products for everyday life, such as innovative films for electric vehicles and resins for high-performance medical devices.50 The company’s vision is to continue innovating to make materials that enhance the quality of life while also being a thought and action leader to define the path for circularity globally. To that end, Eastman works closely with others to address the triple challenge: climate change, the global water crisis, and caring for the global population.51 Problem: Kodak operated a methanolysis plant from the mid-1980s to the mid-2000s to chemically recycle used polyesters and manufacture the recycled content into new products. However, customer demand for a sustainable solution was not there, and the economics of that plant declined, eventually leading to its closure.52 Eastman began considering sustainability in its strategy again in the early 2000s.53 At that time, Eastman started to explore once again whether it could innovate around its existing assets to develop more sustainable business practices and how it could work with partners toward common goals to reduce waste and emissions. Solution: In 2019, Eastman announced that it would start two chemical-recycling projects. The first would leverage an existing coal-gasification facility in Kingsport that had initially been completed in 1983 to produce chemicals from syngas rather than from petroleum. This plant would use Carbon Renewal Technology (CRT) to recycle most complex waste plastics (with the exception of PVC (polyvinyl chloride)) into syngas.54 Eastman would then use that syngas to produce acetic acid and other acetyls, building blocks for advanced materials, additives, and fibers.55 The second project would leverage the methanolysis technology originally developed by Kodak in the 1980s to break down PET into MEG and DMT, which Eastman would further manufacture into specialty copolyesters.56 This Polyester Renewal Technology (PRT), a form of depolymerization known as molecular recycling, allows Eastman to recycle polyester waste repeatedly without degradation over time and reduces greenhouse gas (GHG) emissions by 20%–30% compared to processes using fossil fuels.57 One of the biggest challenges facing Eastman within its commercial-scale recycling plants is collecting enough quality feedstock to feed the plant. To help ensure adequate feedstock, Eastman partnered with feedstock providers, invested in its ability to sort plastics (to avoid contamination), identified several different feedstock prototypes based on what’s available in the market, and used process chemistry to optimize those feedstocks. Eastman focused on a low feedstock cost and a premium for recycled products to make the economics work this time.58 Second, Eastman uses a mass-balance approach to track recycled content to receive revenue from its product and associated recycled content. The mass-balance approach traces, measures, and reports the amount of recycled materials used to create a product.59 This method is certified by International Sustainability and Carbon Certification (ISCC) and allows brands to report the percentage of recycled content allocated to their manufactured products. This way, brands can demonstrate that they have met their recycled content targets. Benefits: Chemical recycling has already helped reduce waste and emissions for Eastman and its partners. Eastman reports that it recycled more than 12 million pounds (about 5,500 metric tons) of plastic waste in 2021.60 And Eastman’s customers can benefit by acquiring recycled content to meet their emissions and waste targets. Eastman’s CRT process is also estimated to reduce GHG emissions by 20%–50% compared to processes using fossil fuels,61 and its PRT process is expected to reduce emissions by 20%–30%.62 The future: Eastman is expected to begin operations at its PRT plant in Kingsport later this year and has already announced two new PRT projects—one in France and another in the United States. The plant in France is expected to come online in 2026,63 with more than 80% of feedstock under definitive agreements and most rPET-packaging offtake under definitive agreements.64 Eastman has committed to recycling more than 250 million pounds (about 114,000 metric tons) of plastic by 2025 and more than 500 million pounds (about 227,000 metric tons) by 2030.65 The company also plans to innovate new ways to optimize its supply chain through waste takeback strategies, including pre- and postconsumer waste or forming a closed-loop system through brand partnerships. Eastman has noted two helpful market trends as it expands its recycling capabilities. First, companies are beginning to design products with recyclability in mind. This has led to simplifying the plastics used in a product so that sorting and recycling are easier. Second, companies are beginning to use preconsumer and postconsumer waste, expanding access to noncontaminated plastics feedstock.66","filter_flag":1}
{"title":"Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact? - PYMNTS.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA","guidislink":false,"published":"Fri, 09 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=160, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5\" target=\"_blank\">Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PYMNTS.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact? - PYMNTS.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9yZXRhaWwvMjAyMy9hcmUtc3VzdGFpbmFibGUtcHJhY3RpY2VzLWEtbW9uZXktc3Vjay1vci1hcmUtdGhleS1jcmVhdGluZy1wb3NpdGl2ZS1yZXRhaWwtaW1wYWN0L9IBAA?oc=5\" target=\"_blank\">Are Sustainable Practices a Money Suck or Are They Creating Positive Retail Impact?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PYMNTS.com<\/font>","source.href":"https:\/\/www.pymnts.com","source.title":"PYMNTS.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"In recent years, sustainability has become a hot topic across various industries, including the retail sector. Companies are increasingly under pressure to adopt environmentally friendly practices and reduce their carbon footprint. However, the question remains: Are sustainable practices a drain on finances or do they actually create a positive impact on retail businesses? The recent news of Selfridges and Hermès quietly exiting the Fashion Pact amid slow progress sheds some light on this ongoing debate. Sustainable practices in the retail industry encompass a wide range of initiatives, from reducing waste and using renewable materials to promoting ethical sourcing and fair trade. While these practices are undoubtedly crucial for the long-term well-being of the planet, they can also come with significant upfront costs. Implementing sustainable measures often requires investments in research and development, supply chain restructuring, and changes in manufacturing processes. Critics argue that these financial investments can strain a company’s resources, particularly smaller retailers with limited budgets. They argue that the focus on sustainability diverts funds from other essential areas, such as product development, marketing and expansion. Furthermore, the initial costs associated with sustainable practices can sometimes outweigh the immediate benefits, leading to skepticism about their financial viability. However, it is important to recognize the long-term benefits of sustainability. Consumers today, especially millennials and Gen Z, are conscious of the environmental and social impact of their purchasing decisions. They are more likely to support and patronize brands that align with their values and demonstrate a commitment to sustainability. In fact, a study found that 73% of global consumers are willing to change their consumption habits to reduce their environmental impact. By adopting sustainable practices, retailers can tap into this growing consumer demand and position themselves as environmentally responsible. This can lead to increased customer loyalty, positive brand image, and even attract new customers who prioritize sustainability. As consumers become more educated and aware of the impact of their choices, companies that fail to embrace sustainability risk losing market share and relevance. Sephora and H&M Sephora and H&M, giants in the retail industry, stand out for their pioneering efforts in sustainability. These initiatives not only resonate with customers but also draw shoppers back into their physical stores. According to a PYMNTS report in April, Sephora unveiled an initiative called Beauty (Re)Purposed, designed to address the issue of difficult-to-recycle packaging waste within the beauty industry. The initiative has been implemented across 600 Sephora stores in the United States and Canada. Conversely, H&M introduced Close the Loop, a program that enables customers to bring their unwanted clothing to designated in-store recycling bins and receive a coupon for their next purchase. The initiative has collected over 155,000 tons of textiles. Read more: Sephora, H&M Sustainability Programs Bet on In-Store Traffic and Sales Selfridges, Hermès Walk Back Pact Selfridges, a U.K.-based department store, and Hermès, the luxury fashion brand, recently made headlines by quietly exiting the Fashion Pact. The Fashion Pact, launched in 2019, is a coalition of fashion and textile companies committed to reducing the industry’s impact on the environment. Selfridges and Hermès’ departure raises questions about the effectiveness and progress of such collective sustainability efforts. It is essential to consider the broader context. Sustainable practices require ongoing commitment, continuous improvement, and measurable results. It is possible that Selfridges and Hermès found the Fashion Pact’s progress to be slow or insufficient in addressing their specific sustainability goals. This does not necessarily imply a complete abandonment of sustainable practices but rather a shift towards alternative approaches that better align with their strategies. The fact that Selfridges and Hermès were part of the Fashion Pact in the first place demonstrates their recognition of the importance of sustainability in the retail industry. It is crucial to acknowledge that sustainability is a complex and evolving field, and there is no one-size-fits-all solution. Each company needs to assess its unique circumstances, business model, and sustainability objectives to determine the most effective path forward.","filter_flag":1}
{"title":"Crop Science Innovation Summit 2023: Bayer sees more than doubling of accessible markets and potential to shape ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi4QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9pbi9uZXdzLXJlbGVhc2VzL2Nyb3Atc2NpZW5jZS1pbm5vdmF0aW9uLXN1bW1pdC0yMDIzLWJheWVyLXNlZXMtbW9yZS10aGFuLWRvdWJsaW5nLW9mLWFjY2Vzc2libGUtbWFya2V0cy1hbmQtcG90ZW50aWFsLXRvLXNoYXBlLXJlZ2VuZXJhdGl2ZS1hZ3JpY3VsdHVyZS1vbi1tb3JlLXRoYW4tNDAwLW1pbGxpb24tYWNyZXMtMzAxODU3ODQ1Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi4QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9pbi9uZXdzLXJlbGVhc2VzL2Nyb3Atc2NpZW5jZS1pbm5vdmF0aW9uLXN1bW1pdC0yMDIzLWJheWVyLXNlZXMtbW9yZS10aGFuLWRvdWJsaW5nLW9mLWFjY2Vzc2libGUtbWFya2V0cy1hbmQtcG90ZW50aWFsLXRvLXNoYXBlLXJlZ2VuZXJhdGl2ZS1hZ3JpY3VsdHVyZS1vbi1tb3JlLXRoYW4tNDAwLW1pbGxpb24tYWNyZXMtMzAxODU3ODQ1Lmh0bWzSAQA?oc=5","id":"CBMi4QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9pbi9uZXdzLXJlbGVhc2VzL2Nyb3Atc2NpZW5jZS1pbm5vdmF0aW9uLXN1bW1pdC0yMDIzLWJheWVyLXNlZXMtbW9yZS10aGFuLWRvdWJsaW5nLW9mLWFjY2Vzc2libGUtbWFya2V0cy1hbmQtcG90ZW50aWFsLXRvLXNoYXBlLXJlZ2VuZXJhdGl2ZS1hZ3JpY3VsdHVyZS1vbi1tb3JlLXRoYW4tNDAwLW1pbGxpb24tYWNyZXMtMzAxODU3ODQ1Lmh0bWzSAQA","guidislink":false,"published":"Thu, 22 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=173, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi4QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9pbi9uZXdzLXJlbGVhc2VzL2Nyb3Atc2NpZW5jZS1pbm5vdmF0aW9uLXN1bW1pdC0yMDIzLWJheWVyLXNlZXMtbW9yZS10aGFuLWRvdWJsaW5nLW9mLWFjY2Vzc2libGUtbWFya2V0cy1hbmQtcG90ZW50aWFsLXRvLXNoYXBlLXJlZ2VuZXJhdGl2ZS1hZ3JpY3VsdHVyZS1vbi1tb3JlLXRoYW4tNDAwLW1pbGxpb24tYWNyZXMtMzAxODU3ODQ1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Crop Science Innovation Summit 2023: Bayer sees more than doubling of accessible markets and potential to shape ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Crop Science Innovation Summit 2023: Bayer sees more than doubling of accessible markets and potential to shape ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi4QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9pbi9uZXdzLXJlbGVhc2VzL2Nyb3Atc2NpZW5jZS1pbm5vdmF0aW9uLXN1bW1pdC0yMDIzLWJheWVyLXNlZXMtbW9yZS10aGFuLWRvdWJsaW5nLW9mLWFjY2Vzc2libGUtbWFya2V0cy1hbmQtcG90ZW50aWFsLXRvLXNoYXBlLXJlZ2VuZXJhdGl2ZS1hZ3JpY3VsdHVyZS1vbi1tb3JlLXRoYW4tNDAwLW1pbGxpb24tYWNyZXMtMzAxODU3ODQ1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Crop Science Innovation Summit 2023: Bayer sees more than doubling of accessible markets and potential to shape ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Expectation to tap into more than 100 billion euros of value in accessible and ag-adjacent markets Unparalleled pipeline with estimated peak sales potential of more than 30 billion euros to promote regenerative agricultural practices and enable farmers to support both global food security and mitigation of climate change Includes transformative technologies like the Preceon Smart Corn System, next-generation insect and weed control traits in corn and soybeans, hybrid wheat, direct-seeded rice, a new first-of-its-kind herbicide molecule, as well as two new fungicides Industry-leading technologies such as alternatives to synthetic fertilizer, specialized cover crops and tools for carbon farming create upside potential and allow for productivity increases while preserving the soil and helping reduce the environmental impact of farming NEW YORK and MUMBAI, India, June 22, 2023 \/PRNewswire\/ -- Bayer today announced its Crop Science Division will capitalize on opportunities presented by the shift to regenerative agriculture to grow in adjacent markets in addition to its core business of seeds, traits, crop protection and digital. At its 2023 Innovation Summit, the company identified growth potential in segments like crop fertility, biologicals, biofuels, carbon farming, precision application services as well as digital platforms and marketplaces, all of which are serving the needs of agriculture. Overall, the company expects to access more than 100 billion euros in these adjacent markets annually, in effect doubling the division's potential market which today stands at more than 100 billion euro for the core portfolio alone. Importantly, by the middle of the next decade, Bayer envisions shaping regenerative agriculture on more than 400 million acres, built on the foundation of its leading agriculture input solutions. Rodrigo Santos, President of Bayer’s Crop Science Division and Member of the Board of Bayer AG at Bayer Crop Science Innovation Summit in New York This endeavor, in combination with the division's leading seeds, traits and crop protection R&D pipeline were showcased in New York, featuring holistic system solutions the company is uniquely positioned to provide, fueling long-term growth of the company as it propels its ambitious growth plan to drive regenerative agriculture. \"We are envisioning an even broader role in agriculture. With the most powerful innovation engine in the industry and leading market positions, Bayer is uniquely set to provide the solutions that farmers need in light of food security and climate change,\" said Rodrigo Santos, President of Bayer's Crop Science Division and Member of the Board of Bayer AG. \"We define regenerative agriculture as increasing food production, farm incomes and resilience in a changing climate while renewing nature. Our portfolio will deliver future innovations with regenerative agriculture at the core, and we will explore new market opportunities to further allow farmers to combine productivity, profitability, and sustainability benefits.\" Focus on solutions that drive regenerative agriculture Farmers around the globe can expect access to industry-leading innovations that not only deliver yield improvements, but which can also regenerate soil and minimize the impact of farming on the climate and broader environment – tailored to the different crops. On the farm of the future, the terabytes of data captured from the field as well as the tons of carbon dioxide sequestered, will be as important to the farmer as the yield that each field produces. Going forward, Bayer will focus its investment on solutions that deliver important pillars of regenerative agriculture. This includes improved productivity, social and economic wellbeing of farmers and communities, conservation of water, mitigation of climate change, improved soil health as well as preservation and restoration of biodiversity. To this end, Bayer's core portfolio of crop protection, seeds and traits and digital products is best positioned to grow, and significant advancements are being made annually. The company is investing in its industry-leading pipeline to accelerate the delivery of solutions that growers need. Late-stage transformative technologies are being combined with the annual refresh of the global seed portfolio and the addition of hundreds of new product registrations and formulations every year. Industry-leading pipeline delivers on the transformation of agriculture In 2022, 15 projects advanced, including new crop protection active ingredients, new seed traits and digital models. Bayer refreshed its seed portfolio with 500 new hybrid and variety deployments and its crop protection portfolio with 10 new formulation launches and more than 250 new registrations. The R&D investment of 2.6 billion euros before special items in 2022 continues to advance a pipeline with an estimated peak sales potential of more than 30 billion euros, half of which are incremental to the existing base. \"A bold vision takes a bold investment. It takes all five of our innovation platforms – breeding, biotechnology, chemistry, biologicals and data science to power this pipeline. But it is far more than these platforms alone – it is the convergence of this innovation that allows us to generate system solutions to solve our most pressing challenges,\" said Dr. Robert Reiter, Head of R&D at Bayer's Crop Science Division. \"Farmers need the best genetics with best-in-class traits, they need data-driven planting scripts to know when and where to plant those crops. And they need lower impact small molecule crop protection paired with late-season biological solutions and precision applications to sustainably protect those crops. We have a deep and proud history of successfully converting these engines into viable, valuable products for growers.\" Bayer's R&D pipeline includes several exciting and new technologies: Designer Seeds and Next Generation Breeding Technology: With its unmatched germplasm library, Bayer is advancing existing breeding technologies while also developing the next generation of tools like gene editing to create designer seeds for growers in crops like corn, soybeans, cotton and vegetables. The precision breeding program helps to improve both yield and efficiency for farmers, using AI technology to develop the right seeds for the right conditions. In addition, the company is hybridizing staple crops like rice and wheat, to improve their productivity and sustainability. Direct seeded rice has the potential to transform rice production, significantly reducing water consumption while increasing yields. Initial trials under the Bayer Direct Acres program are underway in India . With its unmatched germplasm library, Bayer is advancing existing breeding technologies while also developing the next generation of tools like gene editing to create designer seeds for growers in crops like corn, soybeans, cotton and vegetables. The precision breeding program helps to improve both yield and efficiency for farmers, using AI technology to develop the right seeds for the right conditions. In addition, the company is hybridizing staple crops like rice and wheat, to improve their productivity and sustainability. Direct seeded rice has the potential to transform rice production, significantly reducing water consumption while increasing yields. Initial trials under the Bayer Direct Acres program are underway in . Transformative Trait Technologies: The company is expanding its industry-leading expertise into new spaces, like the Preceon Smart Corn System, offering reduced plant height which brings multiple benefits to the farmer. This includes reducing the risk of losses from high wind, season-long access for more precise use of crop protection products and nutrient applications and the potential to optimize inputs, planting populations and field placement through digital tools. The system approach includes digital tools to support planting and showcases the transition from selling inputs to selling solutions. The first generation of short-stature corn to launch was developed via plant breeding and the next generation, expected mid-to-late this decade, was created using plant biotechnology and will expand the reach to more hybrids and acres. With the expertise in protein optimization technology, RNAi technology and biotech, Bayer is able to stack new trait technologies like short-stature corn with current and next-generation insect-control traits like its third-generation corn rootworm trait, to allow farmers to reap the benefits of insect and weed control with this shorter stature product. Other value-driving examples are Bayer's insect and herbicide tolerant soybean varieties with multiple modes of action for Brazil , which are essential to manage the changing pest and weed resistance challenges typical in a tropical environment. The company is expanding its industry-leading expertise into new spaces, like the Preceon Smart Corn System, offering reduced plant height which brings multiple benefits to the farmer. This includes reducing the risk of losses from high wind, season-long access for more precise use of crop protection products and nutrient applications and the potential to optimize inputs, planting populations and field placement through digital tools. The system approach includes digital tools to support planting and showcases the transition from selling inputs to selling solutions. The first generation of short-stature corn to launch was developed via plant breeding and the next generation, expected mid-to-late this decade, was created using plant biotechnology and will expand the reach to more hybrids and acres. With the expertise in protein optimization technology, RNAi technology and biotech, Bayer is able to stack new trait technologies like short-stature corn with current and next-generation insect-control traits like its third-generation corn rootworm trait, to allow farmers to reap the benefits of insect and weed control with this shorter stature product. Other value-driving examples are Bayer's insect and herbicide tolerant soybean varieties with multiple modes of action for , which are essential to manage the changing pest and weed resistance challenges typical in a tropical environment. Sustainable Small Molecules: New approaches to crop protection are expected to shape the industry in future. This includes development of an entirely new herbicide mode-of-action for broadacre weed control, the first in the industry for over three decades. This molecule has demonstrated effective control of key resistant grasses in research and is expected to be commercialized towards the end of this decade. Further examples include a new broad-spectrum fungicide for cereals, corn, fruits and vegetables with blockbuster potential in research phase 3 and a new mode of action broad-spectrum horticulture fungicide in research phase 2 with opportunities to extent to cereals and oil seed rape. Artificial Intelligence helps Bayer design the next generation of crop protection, putting sustainability and environmental impact reduction at the core. New products will enable farmers to tailor and target use in specific ways, for example by using PROTAC technology which is being co-developed with Oerth Bio that is designed to interact with only one target protein and safeguard beneficial organisms. Bayer is also optimizing application of existing chemicals through digital and AI technologies. Bayer's innovation engines will power agricultural evolution by equipping farmers with the tools, technologies, and options they need for the future of regenerative agriculture. Precision bred seed products will offer significant acceleration for the genetic gain of yield potential and will be protected by game-changing traits that enable no-till farming to improve soil health. Combined with innovative small molecules and biological solutions that can protect biodiversity and offer low to no-residue solutions, and verified soil improvements through digital tools and technologies, Bayer will shape the future of regenerative agriculture. Bayer to expand into new accessible ag-adjacent markets Beyond this core, Bayer is strongly positioned to expand into new market opportunities adjacent to its core offerings, for instance: Crop Fertility and Biological Breakthroughs: Biologically based nitrogen-fixation technologies can help farmers grow more with less, reducing emissions and costs for farmers in crops like corn and wheat. The potential biodiversity and soil health benefits from reduced synthetic nitrogen use are significant, and the company's early-stage technology holds great promise. With late season application of biological-based crop protection for insect and disease control, the company also sees opportunities for reduced residues in fruit and vegetable production, an attribute increasingly desired by consumers. As market leaders in biologicals with products like Serenade, and through its open innovation partnerships with Gingko, Kimitec, M2i and AlphaBio, Bayer is well positioned in this critical, rapidly growing space and has the ambition to reach more than 1.5 billion euros in sales by 2035. Biologically based nitrogen-fixation technologies can help farmers grow more with less, reducing emissions and costs for farmers in crops like corn and wheat. The potential biodiversity and soil health benefits from reduced synthetic nitrogen use are significant, and the company's early-stage technology holds great promise. With late season application of biological-based crop protection for insect and disease control, the company also sees opportunities for reduced residues in fruit and vegetable production, an attribute increasingly desired by consumers. As market leaders in biologicals with products like Serenade, and through its open innovation partnerships with Gingko, Kimitec, M2i and AlphaBio, Bayer is well positioned in this critical, rapidly growing space and has the ambition to reach more than in sales by 2035. Biofuels: Cover crops help farmers protect their fields in a sustainable way, promoting soil health. CoverCress, in which Bayer is the majority share owner, will open additional revenue streams from the sale of the same-named cover crop to biofuel makers. Oil extracted from CoverCress is designed to achieve a lower carbon intensity score and can be made into renewable fuels without competing against food crops, due to its planting in between seasons. With more uptake, there is significant market opportunity for this sustainable crop. Cover crops help farmers protect their fields in a sustainable way, promoting soil health. CoverCress, in which Bayer is the majority share owner, will open additional revenue streams from the sale of the same-named cover crop to biofuel makers. Oil extracted from CoverCress is designed to achieve a lower carbon intensity score and can be made into renewable fuels without competing against food crops, due to its planting in between seasons. With more uptake, there is significant market opportunity for this sustainable crop. Digital value chain: Advancements in precision agriculture and digital farming technology are helping farmers maximize the productivity and sustainability of their land and agricultural practices. Climate FieldView has become an essential decision tool with subscriptions on more than 220 million crop acres globally. In addition to delivering real-time agronomic insights to farmers, it also serves as the digital platform delivering tailored solutions like the Preceon Smart Corn System, combining Bayer's new short-stature corn hybrids with digital recommendations tailored to our customers' fields and performance goals. Beyond the farm, FieldView is the gateway to creating value chain solutions, serving as the system of record for our customers' climate-smart farming practices and powering Bayer's global carbon programs, including Bayer's ForGround platform in the US. Earlier this year, the company unveiled new cloud-based enterprise solutions: Bayer AgPowered Services, powered by the new Microsoft Azure Data Manager for Agriculture, offering a suite of advanced digital capabilities and robust digital infrastructure to accelerate innovation in the food and agriculture industries. Building from the new cloud offerings, innovators and companies across the farm and food value chains can accelerate their speed to value for customers, bring greater transparency to consumers, and deliver increased opportunity for farmers. Advancements in precision agriculture and digital farming technology are helping farmers maximize the productivity and sustainability of their land and agricultural practices. Climate FieldView has become an essential decision tool with subscriptions on more than 220 million crop acres globally. In addition to delivering real-time agronomic insights to farmers, it also serves as the digital platform delivering tailored solutions like the Preceon Smart Corn System, combining Bayer's new short-stature corn hybrids with digital recommendations tailored to our customers' fields and performance goals. Beyond the farm, FieldView is the gateway to creating value chain solutions, serving as the system of record for our customers' climate-smart farming practices and powering Bayer's global carbon programs, including Bayer's ForGround platform in the US. Earlier this year, the company unveiled new cloud-based enterprise solutions: Bayer AgPowered Services, powered by the new Microsoft Azure Data Manager for Agriculture, offering a suite of advanced digital capabilities and robust digital infrastructure to accelerate innovation in the food and agriculture industries. Building from the new cloud offerings, innovators and companies across the farm and food value chains can accelerate their speed to value for customers, bring greater transparency to consumers, and deliver increased opportunity for farmers. Carbon Farming: Bayer is a leading provider of solutions and platforms that support farmers in removing carbon from the atmosphere and reduce their emissions. No-till farming enabled by herbicide tolerant traits and the use of cover crops can help improve soil health, reduce soil erosion, and cut carbon emissions. As an added benefit, Bayer's Carbon Initiative opens new revenue streams to farmers by connecting them to the global carbon markets. Rodrigo Santos added: \"Bayer is well positioned to lead in the regenerative agriculture space due to our emphasis in digital transformation, commitment to innovation and strong partnerships. Our aim is to transform agriculture to be more productive, more sustainable, and have a net positive impact on the environment.\" About Bayer Bayer is a global enterprise with core competencies in the life science fields of health care and nutrition. Its products and services are designed to help people and the planet thrive by supporting efforts to master the major challenges presented by a growing and aging global population. Bayer is committed to driving sustainable development and generating a positive impact with its businesses. At the same time, the Group aims to increase its earning power and create value through innovation and growth. The Bayer brand stands for trust, reliability and quality throughout the world. In fiscal 2022, the Group employed around 101,000 people and had sales of 50.7 billion euros. R&D expenses before special items amounted to 6.2 billion euros. For more information, go to www.bayer.com. Contact for media inquiries: Alexander Hennig, phone +49 175 3089736 Email: [email protected] Snigdha Vishal, phone +91 9819170087 Email: [email protected] Contact for investor inquiries: Bayer Investor Relations Team, phone +49 214 30-72704 Email: [email protected] www.bayer.com\/en\/investors\/ir-team Find more information at www.bayer.com. Follow us on twitter.com\/bayer ahe (2023-0124E) Forward-Looking Statements This release may contain forward-looking statements based on current assumptions and forecasts made by Bayer management. Various known and unknown risks, uncertainties and other factors could lead to material differences between the actual future results, financial situation, development or performance of the company and the estimates given here. These factors include those discussed in Bayer's public reports which are available on the Bayer website at www.bayer.com. The company assumes no liability whatsoever to update these forward-looking statements or to conform them to future events or developments. Photo: https:\/\/mma.prnewswire.com\/media\/2108533\/Bayer_Crop_Science.jpg Logo: https:\/\/mma.prnewswire.com\/media\/2071681\/4101389\/Bayer_logo.jpg","filter_flag":1}
{"title":"85% of Vestiaire Resale Shoppers Buying Less But Better - Sourcing Journal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbmV3cy92ZXN0aWFpcmUtY29sbGVjdGl2ZS1pbXBhY3QtcmVwb3J0LWx1eHVyeS1mYXNoaW9uLXJlc2FsZS1tb25jbGVyLWphY3F1ZW11cy1jaGFuZWwtZ3VjY2ktNDQwOTA3L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbmV3cy92ZXN0aWFpcmUtY29sbGVjdGl2ZS1pbXBhY3QtcmVwb3J0LWx1eHVyeS1mYXNoaW9uLXJlc2FsZS1tb25jbGVyLWphY3F1ZW11cy1jaGFuZWwtZ3VjY2ktNDQwOTA3L9IBAA?oc=5","id":"CBMingFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbmV3cy92ZXN0aWFpcmUtY29sbGVjdGl2ZS1pbXBhY3QtcmVwb3J0LWx1eHVyeS1mYXNoaW9uLXJlc2FsZS1tb25jbGVyLWphY3F1ZW11cy1jaGFuZWwtZ3VjY2ktNDQwOTA3L9IBAA","guidislink":false,"published":"Tue, 20 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=171, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbmV3cy92ZXN0aWFpcmUtY29sbGVjdGl2ZS1pbXBhY3QtcmVwb3J0LWx1eHVyeS1mYXNoaW9uLXJlc2FsZS1tb25jbGVyLWphY3F1ZW11cy1jaGFuZWwtZ3VjY2ktNDQwOTA3L9IBAA?oc=5\" target=\"_blank\">85% of Vestiaire Resale Shoppers Buying Less But Better<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sourcing Journal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"85% of Vestiaire Resale Shoppers Buying Less But Better - Sourcing Journal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbmV3cy92ZXN0aWFpcmUtY29sbGVjdGl2ZS1pbXBhY3QtcmVwb3J0LWx1eHVyeS1mYXNoaW9uLXJlc2FsZS1tb25jbGVyLWphY3F1ZW11cy1jaGFuZWwtZ3VjY2ktNDQwOTA3L9IBAA?oc=5\" target=\"_blank\">85% of Vestiaire Resale Shoppers Buying Less But Better<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sourcing Journal<\/font>","source.href":"https:\/\/sourcingjournal.com","source.title":"Sourcing Journal","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"In a world where consumers buy more clothes but wear them less, Vestiaire Collective wants to disrupt consumption behavior by changing how people buy. The global fashion resale app’s second annual Impact Report revealed the extent to which resale platforms enable consumers to “upscale” their purchases—bringing some “much needed” disruption to the industry. “Our 2023 Impact Report tells an incredible story about the substantial impact we have achieved so far. As resale grows, we proudly lead the way by introducing socio-economic impact measurement,” Fanny Moizant, co-founder and president of Vestiaire Collective, said. “We have developed this report not as a beauty contest buy as a transparency exercise, going into all aspects of our business.” Buying a used garment extends its life by 2.2 years on average, reducing its carbon waste and water footprint by 73 percent, according to Patagonia’s ex-CEO Ryan Gellert. Most sold items (82 percent) on Vestiaire Collective replaced a firsthand purchase—up 12 points from last year. This decision to buy used instead of new, and the environmental impact avoided by doing so, is what the B Corp. calls its “displacement rate.” A survey found that 85 percent of Vestiaire users are willing to buy fewer and better-quality items, with 70 percent of fashion consumers encouraged to take better care of their items thanks to their resale value. All to say that buying pre-loved items can reduce environmental impact 10 times over, the report found. “Our unique circular business model not only sets us apart but also enables us to make a significant impact in driving sustainability within the fashion industry,” Max Bittner, CEO of Vestiaire Collective, said. The company has calculated the environmental cost of every purchase on Vestiaire Collective through the monetization method, which translates an environmental question into one that consumers can easily understand to help them quantify their impact. It compares different types of effects in different local contexts to create a standard. Total monetized environmental impact of buying new products versus buying through Vestiaire Collective in 2020 and 2022. Vestiaire Collective With that in mind, Vestiaire Collective has prevented almost three times more emissions than it generates, meaning it now has a net climate-positive impact without offsetting. Since 2009, the company has avoided 194,000 tons of CO2e, with one-fourth of that happening in 2022 alone. It has also reduced its carbon intensity. In 2022, Vestiaire Collective managed to stabilize its carbon intensity relative to its growth. Initiatives like reducing the carbon impact related to order delivery, reducing packaging impact and addressing office and warehouse energy use will help curb its impact. Vestiaire Collective’s resale-as-a-service (RaaS) incentivizes brands and retailers to offer a high-end solution for their customers to sell back their pre-loved items, which are then sold on Vestiaire Collective through a dedicated shop. So far, 18,000 Mytheresa items have been resold on Vestiaire Collective since the launch of their partnership last summer. This year, the company partnered with Chloé to develop the first resale experience to use digital identification, given how designer items typically increase in value once they reach vintage status. The secondhand market is currently worth roughly 5 percent of the overall apparel, footwear and accessories sector and could grow to as much as 40 percent, the report found. Last year’s most popular designer brands on Vestiaire Collective included Moncler, Jacquemus and Alexander McQueen, while the top three luxury brands were Chanel, Gucci and Louis Vuitton. Sustainability is the second and fastest-growing driver for Vestiaire Collective shoppers after circularity. Most sellers (84 percent) are inspired to give items a second life, the report found. Following the company’s decision to ban fast fashion last November, 70 percent of users switched to buying better quality brands. Now, Vestiaire Collective is lobbying with the EU to hold fast fashion companies accountable for their supply chains, waste management and textiles shipments to low-income countries. So far, 27 brands have been banned from the platform. “Fashion is one of the world’s biggest polluting industries, and for too long the industry has encouraged consumer behaviors that are too much for the planet to handle,” Moizant said. “By helping consumers buy fewer, but better items of pre-loved clothing, we can push the industry to move towards circular business models that embrace a love for fashion while transitioning to sustainable, environmentally responsible practices.” While resale is enjoying its moment in the sun, so is clothes swapping. The global clothing-changing app market is expected to grow at a significant CAGR of 5 percent from 2023 to 2030, according to A2Z Market Research. Irish secondhand swapping platform Nuw recently expanded into the U.S. to disrupt the apparel re-commerce industry with a sustainable alternative to fast fashion. The Nuw app. Nuw Founder Aisling Byrne in 2021 pioneered Nuw’s “clothes as currency” business model, which today has an 83 percent recirculation rate—about five times higher than the resale and thrift store channels. The app allows users to exchange old clothing for new-to-them (or sometimes brand-new) pieces. Users earn a gold or silver coin for reach item uploaded, which can then be redeemed for another item for 99 cents, plus shipping. Each time an item is exchanged, the “nuw” way to shop offsets an average of 25 percent of resources that would have been used to produce a new article. So far, with 34,000 items exchanged, approximately 500,000 gallons of CO2 and seven million gallons of water have been offset.","filter_flag":1}
{"title":"“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5","id":"CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5\" target=\"_blank\">“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5\" target=\"_blank\">“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Inspiring corporate peers and other investors In addition to fostering access to quality and affordable care, Philips’ involvement in the fund should help inspiring its corporate peers by showing that it’s possible to have a positive impact on such a pressing issue. As such, Philips serves as a catalyst, resulting in more Corporates, Foundations and Development Finance Institutions to support the Transform Health Fund. “Private capital can be the critical catalyst, especially when having a higher risk appetite. It demonstrates that private return-seeking capital can catalyze health system improvements at scale,” Annette Jung, Impact Finance Lead at Philips, emphasizes. For more information about the Transform Health Fund, its activities, and its supporters, and to become an investor, visit this website: Health Finance Coalition. [1] In addition to Philips, Transform Health Fund’s group of investors includes Merck & Co., Inc. (known as MSD outside of the United States and Canada), the U.S. International Development Finance Corporation (DFC), International Finance Corporation (IFC), Swedfund, FSD Africa Investments, Grand Challenges Canada (with funding from Global Affairs Canada), U.S. Agency for International Development (USAID), Netri Foundation, Anesvad Foundation, Chemonics International, and MCJ Amelior Foundation. [2] World Population Clock: 8 Billion People (LIVE, 2023) - Worldometer (worldometers.info)","filter_flag":1}
{"title":"Animal byproducts provide opportunity to cut carbon footprint of feed - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9uZXdzL2FuaW1hbC1ieXByb2R1Y3RzLXByb3ZpZGUtb3Bwb3J0dW5pdHktdG8tY3V0LWNhcmJvbi1mb290cHJpbnQtb2YtZmVlZC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9uZXdzL2FuaW1hbC1ieXByb2R1Y3RzLXByb3ZpZGUtb3Bwb3J0dW5pdHktdG8tY3V0LWNhcmJvbi1mb290cHJpbnQtb2YtZmVlZC_SAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9uZXdzL2FuaW1hbC1ieXByb2R1Y3RzLXByb3ZpZGUtb3Bwb3J0dW5pdHktdG8tY3V0LWNhcmJvbi1mb290cHJpbnQtb2YtZmVlZC_SAQA","guidislink":false,"published":"Wed, 28 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=179, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9uZXdzL2FuaW1hbC1ieXByb2R1Y3RzLXByb3ZpZGUtb3Bwb3J0dW5pdHktdG8tY3V0LWNhcmJvbi1mb290cHJpbnQtb2YtZmVlZC_SAQA?oc=5\" target=\"_blank\">Animal byproducts provide opportunity to cut carbon footprint of feed<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Animal byproducts provide opportunity to cut carbon footprint of feed - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9uZXdzL2FuaW1hbC1ieXByb2R1Y3RzLXByb3ZpZGUtb3Bwb3J0dW5pdHktdG8tY3V0LWNhcmJvbi1mb290cHJpbnQtb2YtZmVlZC_SAQA?oc=5\" target=\"_blank\">Animal byproducts provide opportunity to cut carbon footprint of feed<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"For European feed compounders, locally produced Processed Animal Proteins (PAPs) and rendered fat can replace soy meal and palm oil with a net reduction in carbon emissions Lifecycle analysis performed on behalf of the European Fat Renderers and Processors Association (EFPRA) has shown the carbon footprint benefits of using animal byproducts (ABP) in feed. For European feed compounders, locally produced Processed Animal Proteins (PAPs) and rendered fat can replace soy meal and palm oil with a net reduction in carbon emissions. Conducted by Blonk consultants, the results meet Global Feed LCA Institute (GFLI) standards so ABPs can be directly compared with other feed ingredients on its database. “Following the partial lifting of the ‘feed ban’ in the EU in autumn 2021, there is more interest in ABPs as feed ingredients,” said EFPRA technical director, Martin Alm. “Porcine PAPs are permitted in poultry feed, likewise poultry PAPs can be used in pig feed.” There are also markets for PAPs in aquafeed and pet food, and Category 3 rendered fat is an important feed ingredient too. New EU regulations on the use of products linked to deforestation further burnish the credentials of ABPs. The results Fourteen European rendering companies shared their environmental data from 2016-2018 to make the calculation (Fig. 1). There are results for four types of fat and seven types of protein meal which reflect the main ABPs available for feed production. Figure 1. What was measured to calculate the environmental impact Soybean, palm and rapeseed, the vegetable-based alternatives to animal-based proteins and fats, have a higher overall carbon footprint than the ABP-derived products. Figures 2 and 3 show the climate change impact per kg for ABP-derived products and vegetable alternatives including land use change. Figure 2. Climate change impact of meal products Figure 3. Climate change impact of oil products Palm and soy cultivation are highly associated with deforestation activities in Southeast Asia and South America over the past 20 years which is reflected by the relatively high contribution of land use change to climate change impact. Assessing the impact per kg of protein is even more favorable to ABPs because they are richer in protein than vegetable alternatives. Rapeseed and soybean meal contain 34% and 46% protein respectively whereas PAPs’ protein content ranges from 50-64%, other protein sources such as feather meal and blood meal are even higher. Hence, overall PAPs have a lower carbon footprint than rapeseed meal. Looking at fats, apart from rapeseed oil, all animal fats have a lower environmental footprint than their vegetable oil alternatives. In Europe, animal fats are the primary natural source of hard fats and their vegetable-based alternatives, palm oil or palm kernel oil have an environmental impact between 4 to 8 times higher. In the same way, poultry oil can be compared with oil from soy and rape which have an impact between 2.4-7.5 times higher. “Overall, the study shows that animal proteins and fats can play a significant role in reducing the environmental impact of feed and pet food. We want to make sure the feed sector is fully aware of this after the reintroduction of pig and poultry PAPs,” said Alm.","filter_flag":1}
{"title":"Cosmetics industry: Refreshing the approach to waste and overproduction - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpY3MtaW5kdXN0cnktcmVmcmVzaGluZy10aGUsMjIyNTTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpY3MtaW5kdXN0cnktcmVmcmVzaGluZy10aGUsMjIyNTTSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpY3MtaW5kdXN0cnktcmVmcmVzaGluZy10aGUsMjIyNTTSAQA","guidislink":false,"published":"Tue, 27 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=178, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpY3MtaW5kdXN0cnktcmVmcmVzaGluZy10aGUsMjIyNTTSAQA?oc=5\" target=\"_blank\">Cosmetics industry: Refreshing the approach to waste and overproduction<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cosmetics industry: Refreshing the approach to waste and overproduction - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpY3MtaW5kdXN0cnktcmVmcmVzaGluZy10aGUsMjIyNTTSAQA?oc=5\" target=\"_blank\">Cosmetics industry: Refreshing the approach to waste and overproduction<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Avery Dennison’s report \"The Missing Billions: The Real Cost of Supply Chain Waste\" reveals that more than 10% of beauty products worth an estimated $4.8 billion are wasted in supply chains. 6.2% of goods thrown away are the result of overproduction while 4% of inventory is thrown away due to spoilage or deterioration of the merchandise. Unsurprisingly, this is a growing concern for brands, which could be losing up to 2.8% of their annual profits. The other weighty consideration is the environmental impact of cosmetic waste related to shampoos, lotions, deodorants and other body care products. Today, plastic is responsible for more than 120 billion units of packaging produced each year by the cosmetics industry, the vast majority of which cannot be recycled. According to an OECD report, only 9% of plastic waste is recycled worldwide. This rate is expected to reach 17% by 2060. According to Avery Dennison’s survey of 60 cosmetics companies in the U.S., U.K., China, France and Japan, 23% of brands’ environmental impact comes from their supply chain activities. More than three-quarters (77%) of respondents currently track waste in their supply chain. However, 18% cited a lack of visibility and transparency between trading partners as the biggest barrier to their supply chain resilience. Using RFID technology is a solution that helps brands reduce supply chain waste. It creates a unique digital identity for each product and connects the physical with the digital. It provides valuable information that enables consumers to make better decisions, including transparency and carbon footprint. Recent technology developments leave RFID better suited for tagging small items, as well as those containing liquids and with metallic branding embellishments. Item-level RFID provides an added level of authenticity and traceability throughout a product’s entire journey: from factory to shelf and beyond. It can help identify packaging and contents more easily for recycling schemes or inform the consumer that, for example, no unsustainable palm oil was used. The atma.io connected product cloud helps brands achieve their zero waste goals throughout the supply chain. Currently, more than 28 billion items are managed by the atma.io platform across the apparel, retail, food and healthcare sectors. atma.io’s Real-time Carbon Impact Analytics tool also provides brands with data-driven insights regarding the carbon footprint of their products, including Scope 3 emissions and beyond. This is a powerful new tool that captures data from every stage of a product’s journey, from raw material to consumer, and can help firms as they work to comply with forthcoming EU ‘Digital Product Passport’ regulations. The atma.io Real-time Waste Elimination Tool uses artificial intelligence and machine learning to analyze and alert on anomalies and inefficiencies across the supply chain. This includes information about the overdue movement of products at a pallet level or even isolated individual items within a warehouse that are close to perishing or otherwise ‘lost’. These features help ensure action can be taken quickly and proactively in order to improve the efficiency of brands’ supply chains, minimize product loss and provide adequate stock to meet customer demands. It provides customers with access to a source of single truth, where a product’s origins and entire journey can be chronicled and made available to brands, retailers, and consumers and has the ability to manage emissions and highlight their sustainability directly in the connected product cloud. This versatile technology helps find relevant solutions to reduce waste and overproduction. By leveraging these digital ID solutions, brands can ensure better inventory visibility, increased sustainability and improved profitability.","filter_flag":1}
{"title":"Philips and Magazine TOILETPAPER Reframe Innovation with Refurb Editions | LBBOnline - Little Black Book","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3BoaWxpcHMtYW5kLW1hZ2F6aW5lLXRvaWxldHBhcGVyLXJlZnJhbWUtaW5ub3ZhdGlvbi13aXRoLXJlZnVyYi1lZGl0aW9uc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3BoaWxpcHMtYW5kLW1hZ2F6aW5lLXRvaWxldHBhcGVyLXJlZnJhbWUtaW5ub3ZhdGlvbi13aXRoLXJlZnVyYi1lZGl0aW9uc9IBAA?oc=5","id":"CBMiY2h0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3BoaWxpcHMtYW5kLW1hZ2F6aW5lLXRvaWxldHBhcGVyLXJlZnJhbWUtaW5ub3ZhdGlvbi13aXRoLXJlZnVyYi1lZGl0aW9uc9IBAA","guidislink":false,"published":"Thu, 29 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=180, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3BoaWxpcHMtYW5kLW1hZ2F6aW5lLXRvaWxldHBhcGVyLXJlZnJhbWUtaW5ub3ZhdGlvbi13aXRoLXJlZnVyYi1lZGl0aW9uc9IBAA?oc=5\" target=\"_blank\">Philips and Magazine TOILETPAPER Reframe Innovation with Refurb Editions | LBBOnline<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Little Black Book<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Philips and Magazine TOILETPAPER Reframe Innovation with Refurb Editions | LBBOnline - Little Black Book","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiY2h0dHBzOi8vbGJib25saW5lLmNvbS9uZXdzL3BoaWxpcHMtYW5kLW1hZ2F6aW5lLXRvaWxldHBhcGVyLXJlZnJhbWUtaW5ub3ZhdGlvbi13aXRoLXJlZnVyYi1lZGl0aW9uc9IBAA?oc=5\" target=\"_blank\">Philips and Magazine TOILETPAPER Reframe Innovation with Refurb Editions | LBBOnline<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Little Black Book<\/font>","source.href":"https:\/\/lbbonline.com","source.title":"Little Black Book","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Royal Philips, a global leader in health technology, today announced the launch of its ‘Better Than New’ campaign to create awareness and traction for Philips’ refurbished products. The creative thinking behind the campaign focuses on the tension between ‘new equals better’ and ‘better than new’. Responding to the needs of an increasing number of consumers and building on the company’s commitment to sustainability and driving a more circular economy, Philips’ goal is to make products that can be refurbished and reused. The Philips Refurb Editions ‘Better Than New’ campaign, which has been co-created with creative agency LePub (Amsterdam, the Netherlands) and co-founders of the Italian image-only magazine TOILETPAPER (artist Maurizio Cattelan and photographer Pierpaolo Ferrari), uses the creativity engendered by a seeming conflict of ideas – new equals better versus better than new – to turn the stereotypical idea of innovation on its head. Philips has always been at the forefront of innovation, the company’s purpose being to improve people’s health and well being through meaningful innovation. As part of Philips’ response to today’s consumers’ needs and through its commitment to sustainability and driving a more circular economy, it is the goal to make products that can be refurbished and reused. The environmental impact of using refurbished products is less than buying a new product because the need for raw materials and new parts is reduced. Today’s consumers are more informed and aware of the need for sustainability than ever before and keen on finding innovative ways to live more sustainable lifestyles. And as consumer behaviour shifts and changes, how people buy products and services and how brands sell them continues to evolve. Consumer surveys suggest that sustainability is playing an increasing role in how people buy – for example, 38% of consumers say they are willing to pay more for a durable product and 40% buy second-hand products. Philips believes that as well as a brand-new product there should be a brand new choice: the option of new or refurbished. Philips Refurb Editions – products that are given a second life with guaranteed Philips quality and the same two-year guarantee as a new product – offer consumers that exciting and simple alternative. It also means less waste. With more than 39,000 refurbished products finding a new home, Philips already avoided 139 tons of e-waste in 2022. “At Philips, we believe that innovation should be about making quality products that you can enjoy for a long time,” said Josefien Olij, global sr. director marketing communications at Philips. “We are proud to launch our latest innovation – Refurb Edition products that are not just as good as new, but better than new. The ‘Better Than New’ campaign is about creating greater awareness of the benefits of re-using perfectly good products, so consumers can use less and re-use more in a fun, easy, accessible way.” The ‘Better Than New’ campaign revolves around the need to use less and reuse more. The campaign uses the principles of innovation that Philips has consistently used in the past, reframing them to illustrate the new paradigm of reuse. The new message it conveys is that improving people’s lives does not have to rely on new products, it can also be achieved with products that are not new. “Philips has a great heritage in innovation,” said Milos Obradovic – chief creative officer’ LePub. “To launch this new initiative and show how a technology company can lead us into the future in a new way, we revisited the company’s rich past with a fresh take on what innovation can mean for the future.” To bring the idea to life, LePub searched the archives of Philips advertising and, in collaboration with creative art collective TOILETPAPER, refreshed Philips’ tradition of iconic print ads. TOILETPAPER’s art director Maurizio Cattelan and photographer Pierpaolo Ferrari revisited Philips’ vintage posters illustrating past innovations, injecting great wit and a powerful visual aesthetic. The result is a campaign true to Philips’ past but refreshed to illustrate Philips’ portfolio of refurbished products, with the disruptive and unconventional look of one of TOILETPAPER’s visual signatures – the retro-future. ‘’Creativity never gets old’’, said Maurizio Cattelan - Photographer Toiletpaper magazine. ‘’The new campaign for Philips has a retro-future perspective, where Philips vintage posters and past innovations are becoming new’’ added Pierpaolo Ferrari - photographer Toiletpaper magazine. The ‘Better Than New’ campaign is currently being rolled out in Germany and was launched in outdoor, print, and social media on June 15th, 2023. In the heart of Hamburg, Germany, a Pop Up store used the retro-future visual identity of the campaign to promote the proposition that refurb is the future, with products that people were able to buy virtually but experience live. It offered a compelling experience of how reusing products may be a better future for all of us.","filter_flag":1}
{"title":"Lab-grown chicken meat gets green light from federal regulators - CBS News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvbGFiLWdyb3duLWNoaWNrZW4tbWVhdC1nZXRzLWdyZWVuLWxpZ2h0LWZyb20tZmVkZXJhbC1yZWd1bGF0b3JzL9IBYWh0dHBzOi8vd3d3LmNic25ld3MuY29tL2FtcC9uZXdzL2xhYi1ncm93bi1jaGlja2VuLW1lYXQtZ2V0cy1ncmVlbi1saWdodC1mcm9tLWZlZGVyYWwtcmVndWxhdG9ycy8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvbGFiLWdyb3duLWNoaWNrZW4tbWVhdC1nZXRzLWdyZWVuLWxpZ2h0LWZyb20tZmVkZXJhbC1yZWd1bGF0b3JzL9IBYWh0dHBzOi8vd3d3LmNic25ld3MuY29tL2FtcC9uZXdzL2xhYi1ncm93bi1jaGlja2VuLW1lYXQtZ2V0cy1ncmVlbi1saWdodC1mcm9tLWZlZGVyYWwtcmVndWxhdG9ycy8?oc=5","id":"CBMiXWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvbGFiLWdyb3duLWNoaWNrZW4tbWVhdC1nZXRzLWdyZWVuLWxpZ2h0LWZyb20tZmVkZXJhbC1yZWd1bGF0b3JzL9IBYWh0dHBzOi8vd3d3LmNic25ld3MuY29tL2FtcC9uZXdzL2xhYi1ncm93bi1jaGlja2VuLW1lYXQtZ2V0cy1ncmVlbi1saWdodC1mcm9tLWZlZGVyYWwtcmVndWxhdG9ycy8","guidislink":false,"published":"Wed, 21 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=172, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvbGFiLWdyb3duLWNoaWNrZW4tbWVhdC1nZXRzLWdyZWVuLWxpZ2h0LWZyb20tZmVkZXJhbC1yZWd1bGF0b3JzL9IBYWh0dHBzOi8vd3d3LmNic25ld3MuY29tL2FtcC9uZXdzL2xhYi1ncm93bi1jaGlja2VuLW1lYXQtZ2V0cy1ncmVlbi1saWdodC1mcm9tLWZlZGVyYWwtcmVndWxhdG9ycy8?oc=5\" target=\"_blank\">Lab-grown chicken meat gets green light from federal regulators<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBS News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lab-grown chicken meat gets green light from federal regulators - CBS News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3MvbGFiLWdyb3duLWNoaWNrZW4tbWVhdC1nZXRzLWdyZWVuLWxpZ2h0LWZyb20tZmVkZXJhbC1yZWd1bGF0b3JzL9IBYWh0dHBzOi8vd3d3LmNic25ld3MuY29tL2FtcC9uZXdzL2xhYi1ncm93bi1jaGlja2VuLW1lYXQtZ2V0cy1ncmVlbi1saWdodC1mcm9tLWZlZGVyYWwtcmVndWxhdG9ycy8?oc=5\" target=\"_blank\">Lab-grown chicken meat gets green light from federal regulators<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CBS News<\/font>","source.href":"https:\/\/www.cbsnews.com","source.title":"CBS News","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"From \"free range\" to \"lab grown,\" some chicken served in restaurants — and eventually grocery store shelves — in the U.S. is taking the next step towards the future as \"cultivated\" meat earned approval from federal regulators. Two firms dedicated to growing and selling the cultivated — also known as lab-grown — meat were issued full approvals Wednesday from the U.S. Department of Agriculture to sell their chicken products in the U.S. The two California-based cultivated meat companies, Upside Foods and Eat Just, which makes the brand Good Meat, had requested the USDA label the firms' products the first meat for sale in the U.S. that does not come from slaughtered animals. In response, the USDA earlier this month granted their products the label \"cell-cultivated chicken.\" The development shepherds in a new movement among food suppliers looking to lower the costs of raising and maintaining livestock, reduce harm to animals at factory farms, as well as curb the environmental impact of growing feed, use of land space and animal waste from traditional methods of animal husbandry. \"Instead of all of that land and all of that water that's used to feed all of these animals that are slaughtered, we can do it in a different way,\" Josh Tetrick, co-founder and chief executive of Eat Just, told the Associated Press. Eat Just previously earned the world's first approval for cultivated meat in Singapore in 2020. Now, it has its eyes set on U.S. stomachs. The company's first major hurdle for U.S. sales was approval from the Food and Drug Administration to confirm its lab-grown meat was safe for human consumption, which was granted in March. Upside Foods also had its products deemed safe to eat by the FDA last fall. The majority of the roughly 250 pounds of meat consumed on average by each American every year is poultry, mainly chicken, according to a 2021 study from the Department of Agricultural and Consumer Economics at the University of Illinois Urbana-Champaign. This leaves a lot of room for cultivated meats to impact the carbon footprint of American consumption, especially for future summer barbecue seasons. The cultivated meat is grown using cells that come from a living animal or from stored cells from a once-living animal, according to Just Eat's website. The company says once the cell lines are selected, they're combined with a broth-like mixture that includes the amino acids, fatty acids, sugars, salts, vitamins and other elements cells need to grow. Then, the meat is grown inside a steel tank and formed into shapes like nuggets or cutlets. But lab-created meat does have its skeptics, as the industry contends with what Upside's Chief Operating Officer Amy Chen called \"the ick factor\" among some consumers, according to the Associated Press. However, she believes the proof is in the poultry. \"The most common response we get is, 'Oh, it tastes like chicken,'\" Chen told the AP. But it will still be a while before the products are stocked on grocery shelves. The two companies are starting small, with deals to first serve the new products in upscale restaurants. Upside will sell cultivated chicken to a San Francisco restaurant called Bar Crenn, while Good Meat dishes will be prepared by chef and restaurateur Jose Andrés' culinary experts at a Washington, D.C., restaurant. Jennifer Stojkovic, author of \"The Future of Food is Female\" and founder of the Vegan Women Summit, said in an interview conducted by environmental nonprofit the Footprint Coalition this is \"big news.\" \"At this rate, consumers in the U.S. may see cultivated meat on menus by the end of 2023,\" she wrote. Globally, there are more than 150 companies exploring lab-grown meat options and regulatory approvals should start increasing in coming months and years, according to a report from the Good Food Institute. That will lead to consumers having more choices in the future about where they source their meats, from down on the farm or from a lab.","filter_flag":1}
{"title":"At MakeUp in Paris Gotha Cosmetics bets on the - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9hdC1tYWtldXAtaW4tcGFyaXMtZ290aGEtY29zbWV0aWNzLDIyMTM10gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9hdC1tYWtldXAtaW4tcGFyaXMtZ290aGEtY29zbWV0aWNzLDIyMTM10gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9hdC1tYWtldXAtaW4tcGFyaXMtZ290aGEtY29zbWV0aWNzLDIyMTM10gEA","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9hdC1tYWtldXAtaW4tcGFyaXMtZ290aGEtY29zbWV0aWNzLDIyMTM10gEA?oc=5\" target=\"_blank\">At MakeUp in Paris Gotha Cosmetics bets on the<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"At MakeUp in Paris Gotha Cosmetics bets on the - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9hdC1tYWtldXAtaW4tcGFyaXMtZ290aGEtY29zbWV0aWNzLDIyMTM10gEA?oc=5\" target=\"_blank\">At MakeUp in Paris Gotha Cosmetics bets on the<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"In the continuation with the renewal of their image initiated at Cosmoprof Worldwide Bologna, Gotha Cosmetics will present a brand new booth at MakeUp in Paris, with a structure entirely enveloped in painted fabric using an exclusive technology made in Italy. Moreover, Gotha will also launch a new wave of innovation under the “Realignment: Move Fast, Embrace Low” macro-concept, focusing on products that feed the need for wellbeing and security. Within the macro-concept, Gotha identified three main trends: Dare to Care, Green Lab, Meta-disruptive. Driven by the understanding that the beauty ritual is a very intimate, personal and almost spiritual experience, the Dare to Care micro-collection proposes product solutions dedicated to consumers who want to rediscover their love for cosmetics, embracing makeup that is both special and practical. This collection promotes the joy of makeup, offering products that support self-expression and connection while leveraging multifunctional makeup hybrids. Focused on meeting the highest standards set by the most demanding consumers, the Green Lab collection is on the mission to deliver beauty results that go equally skin-deep as they are impactful on the surface, with a minimized environmental impact. The collection addresses those consumers who are sophisticated, knowledgeable, and curious but also uncompromising in terms of safety, quality and environmental-friendliness. Finally, the Metadisruptive collection is a phygital avant-garde collection. “By 2024, consumers and brands will inhabit increasingly fluid realities, moving seamlessly between the digital and physical worlds. This new circular existence will inspire new phygital aesthetics, while the acceleration of beauty into the metaverse will unlock unlimited possibilities for consumer and products interactions: accessible virtual beauty experiences that make everyday tasks simpler and more enjoyable are unlocking a new world of beauty experiences,” said Gotha.","filter_flag":1}
{"title":"Konica Minolta raises the level of sustainability in textile printing - Textilegence Magazine & Digital Platform","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRleHRpbGVnZW5jZS5jb20vZW4va29uaWNhLW1pbm9sdGEtcmFpc2VzLXRoZS1sZXZlbC1vZi1zdXN0YWluYWJpbGl0eS1pbi10ZXh0aWxlLXByaW50aW5nL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRleHRpbGVnZW5jZS5jb20vZW4va29uaWNhLW1pbm9sdGEtcmFpc2VzLXRoZS1sZXZlbC1vZi1zdXN0YWluYWJpbGl0eS1pbi10ZXh0aWxlLXByaW50aW5nL9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LnRleHRpbGVnZW5jZS5jb20vZW4va29uaWNhLW1pbm9sdGEtcmFpc2VzLXRoZS1sZXZlbC1vZi1zdXN0YWluYWJpbGl0eS1pbi10ZXh0aWxlLXByaW50aW5nL9IBAA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRleHRpbGVnZW5jZS5jb20vZW4va29uaWNhLW1pbm9sdGEtcmFpc2VzLXRoZS1sZXZlbC1vZi1zdXN0YWluYWJpbGl0eS1pbi10ZXh0aWxlLXByaW50aW5nL9IBAA?oc=5\" target=\"_blank\">Konica Minolta raises the level of sustainability in textile printing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textilegence Magazine & Digital Platform<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Konica Minolta raises the level of sustainability in textile printing - Textilegence Magazine & Digital Platform","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRleHRpbGVnZW5jZS5jb20vZW4va29uaWNhLW1pbm9sdGEtcmFpc2VzLXRoZS1sZXZlbC1vZi1zdXN0YWluYWJpbGl0eS1pbi10ZXh0aWxlLXByaW50aW5nL9IBAA?oc=5\" target=\"_blank\">Konica Minolta raises the level of sustainability in textile printing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textilegence Magazine & Digital Platform<\/font>","source.href":"https:\/\/www.textilegence.com","source.title":"Textilegence Magazine & Digital Platform","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Konica Minolta, one of the leading brands in digital textile printing will showcase a series of solutions which will positively impact the environment like step process reduction and waterless applications at ITMA 2023 on June 8-14. In the company’s booth B301 in Hall 7, which will be an active part of the exhibition, the visitors are able to view and touch fabrics printed with the latest technological innovations. Konica Minolta Director of Sales IJ Textile Gianluca Macchi, in a statement to Textilegence, said that the first ITMA exhibition after the pandemic is of great importance for the entire textile industry as it is an opportunity for companies to present their latest technological innovations, machinery, and materials in person. He added that it also represents a symbol of recovery for a sector severely affected by the pandemic and continued: “For us, it will be an opportunity to present new products and technological innovations that are sustainable and have a low environmental impact. The pandemic has accelerated the need for technological innovations and sustainable production processes in the textile industry. ITMA is the best opportunity for companies to present their solutions to meet these challenges and demonstrate their commitment to environmental sustainability.” Konica Minolta Director of Sales IJ Textile Gianluca Macchi “Konica Minolta proved itself as a sustainable corporation” Reminding that sustainability will be the central theme at the upcoming ITMA 2023 in Milan, where we will focus on environmental, eco-toxicological and economic sustainability, Gianluca Macchi mentioned that they proved itself as a sustainable corporation again and again. He stated that Konica Minolta was included in the list of the “2023 Global 100 Most Sustainable Corporations in the World” and received a GOLD-level recognition medal in the EcoVadis Sustainability Ratings for 2023, and said: “Furthermore our company was listed in the Top 5% of the most sustainable companies in its industry in the Sustainable Yearbook 2023 by S&P Global. This is the 13th straight year that Konica Minolta has been named in the Sustainability Yearbook demonstrating the company’s commitment to environmental sustainability. Our solutions are recognised worldwide as highly reliable and durable products; we develop our printers, inks and printheads using our proprietary technology. Thanks to these unique sources, we provide complete customer assurance through a unique interface and exceptional technical service.” “For a more sustainable printing process, the focus should be on chemical innovations” Gianluca Macchi pointed out that the printing process should be developed not only focusing on the mechanical process, but mainly with chemical innovations which should reduce, or even remove, certain steps of the actual printing textile process. He added that as a global multinational company, they offer their customers unique innovative solutions to optimize the current printing process and in this context, he emphasised the importance of their slogan: Rethink Textile Printing. He continued: “It is not just a slogan, but rather a way of living and thinking. The Rethink motto is an invitation not to stop doing things as usual, or as they have always been done, but to go further by pushing oneself to think outside the box, pushing always trying to innovate and change to adapt to the changing reality of the market. We are a company that has been in existence for 150 years and if we had not learnt to adapt we would not still be here trying to improve. It is a global campaign to ‘rethink print possibilities’ in the case of textile printing processes to look for and create environmentally friendly solutions that can create efficiencies in the printing and fabric creation processes.” Konica Minolta raises the level of sustainability in textile printing “In 25 years we increased productivity 500 times” Gianluca Macchi, mentioning their R&D studies, said that they always looking for total customer satisfaction and during the last years they focused on further improving reliability and product customisation for various needs. He underlined that the concept of sustainability at the 360° level is the driver of their developments, noting that as a printing machine manufacturer, since the launch of the first Nassenger 1 in 1998, they increased productivity 500 times reaching a top speed of 60 m\/min with Nassenger SP-1 keeping the maximum quality level in 25 years. He said that their R&D department is working in mid-terms on developing digital dyeing as well and concluded: “We invite all visitors who are looking for sustainable digital printing solutions to our booth at ITMA Milan. Konica Minolta along with our agent SPOT will also welcome all Turkish customers during the exhibition and be ready to discuss the advantages of our technologies.”","filter_flag":1}
{"title":"Industry orgs backs new bill set to offer regulatory pathway for non-nutritive animal food products - Pet Food Processing","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wZXRmb29kcHJvY2Vzc2luZy5uZXQvYXJ0aWNsZXMvMTcwODEtYWZpYS1iYWNrcy1uZXctYmlsbC1zZXQtdG8tb2ZmZXItcmVndWxhdG9yeS1wYXRod2F5LWZvci1ub24tbnV0cml0aXZlLWFuaW1hbC1mb29kLXByb2R1Y3Rz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wZXRmb29kcHJvY2Vzc2luZy5uZXQvYXJ0aWNsZXMvMTcwODEtYWZpYS1iYWNrcy1uZXctYmlsbC1zZXQtdG8tb2ZmZXItcmVndWxhdG9yeS1wYXRod2F5LWZvci1ub24tbnV0cml0aXZlLWFuaW1hbC1mb29kLXByb2R1Y3Rz0gEA?oc=5","id":"CBMiiwFodHRwczovL3d3dy5wZXRmb29kcHJvY2Vzc2luZy5uZXQvYXJ0aWNsZXMvMTcwODEtYWZpYS1iYWNrcy1uZXctYmlsbC1zZXQtdG8tb2ZmZXItcmVndWxhdG9yeS1wYXRod2F5LWZvci1ub24tbnV0cml0aXZlLWFuaW1hbC1mb29kLXByb2R1Y3Rz0gEA","guidislink":false,"published":"Tue, 13 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=164, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wZXRmb29kcHJvY2Vzc2luZy5uZXQvYXJ0aWNsZXMvMTcwODEtYWZpYS1iYWNrcy1uZXctYmlsbC1zZXQtdG8tb2ZmZXItcmVndWxhdG9yeS1wYXRod2F5LWZvci1ub24tbnV0cml0aXZlLWFuaW1hbC1mb29kLXByb2R1Y3Rz0gEA?oc=5\" target=\"_blank\">Industry orgs backs new bill set to offer regulatory pathway for non-nutritive animal food products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pet Food Processing<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Industry orgs backs new bill set to offer regulatory pathway for non-nutritive animal food products - Pet Food Processing","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wZXRmb29kcHJvY2Vzc2luZy5uZXQvYXJ0aWNsZXMvMTcwODEtYWZpYS1iYWNrcy1uZXctYmlsbC1zZXQtdG8tb2ZmZXItcmVndWxhdG9yeS1wYXRod2F5LWZvci1ub24tbnV0cml0aXZlLWFuaW1hbC1mb29kLXByb2R1Y3Rz0gEA?oc=5\" target=\"_blank\">Industry orgs backs new bill set to offer regulatory pathway for non-nutritive animal food products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pet Food Processing<\/font>","source.href":"https:\/\/www.petfoodprocessing.net","source.title":"Pet Food Processing","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"ARLINGTON, VA. — On June 8, the American Feed Industry Association (AFIA) commended the introduction of an amended act set to establish a regulatory pathway for animal nutrition products that offer non-nutritive benefits. The Innovative Feed Enhancement and Economic Development Act of 2023 (Innovative FEED Act) would amend the Federal Food, Drug and Cosmetic Act. The Association of American Feed Control Officials (AAFCO) also expressed its support of the act on June 20. Language from the act passed the Senate Committee of Health, Education, Labor and Pensions (HELP) in a 19-to-2 vote. “AAFCO is very supportive of the Innovative FEED Act and the modernization it will bring to the regulatory approval process,\" said Austin Therrell, executive director at AAFCO. \"This proposal provides a pathway for products that have the opportunity to greatly impact the feed industry, and still provides the appropriate level of oversight to ensure safety and consumer confidence.\" The bill was introduced by Senators Roger Marshall, R-Kan.; Tammy Baldwin, D-Wis.; Jerry Moran, R-Kan.; and Michael Bennet, D-Colo. The Innovative FEED Act would create a new category of animal food additives, called zootechnical animal food substances (ZAFS), that do not provide nutritional benefits, but instead offer gut health benefits to animals, reduce environmental emissions, or address human food safety issues. By creating a new regulatory pathway, the Innovative FEED Act would address restrictions established in the US Food and Drug Administration’s (FDA) 1998 Policy and Procedures Manual Guide 1240.3605. According to the AFIA, this policy has “prevented animal food manufacturers from clearly identifying the ways their products may bring about non-nutritive benefits… on the labels, unless they go through the FDA Center for Veterinary Medicine’s (CVM) cumbersome drug approval process.” Under the new bill, animal food substances that do not carry nutritive benefits would be regulated as food additives instead of drugs. The AFIA urged Congress to quickly pass the Innovative FEED Act, citing a number of reasons. According to the association, without congressional intervention, the CVM would continue to regulate these animal feed ingredients as animal drugs, limiting the industry’s innovation and its ability to offer products that address animal health and environmental issues. The act is also expected to impact the global competitiveness of US farmers and ranchers. According to the AFIA, many countries are already leveraging these types of animal feed ingredients to improve animal wellbeing and production, reduce the environmental impact of livestock production, and provide human food safety benefits. Without the introduction of the Innovative FEED Act, the US agriculture industry would continue to be at a competitive disadvantage. “Our industry is bringing forward innovative animal food solutions to benefit animal health, human food safety and the environment, and now, thanks to the leadership of several Senate leaders, we have the legislative solution needed to provide a modernized regulatory pathway to meet marketplace demands,” said Constance Cullman, president and chief executive officer of the AFIA. “We fully support the Innovative FEED Act and hope Congress will quickly approve this bill, giving our farmers and ranchers the tools they need, and putting our international counterparts on notice that we are fully equipped to compete in the future. “We cannot thank Senators Roger Marshall, Tammy Baldwin, Jerry Moran and Michael Bennet enough for their dedication to this important animal food issue,” she added. For more regulatory news affecting the pet food market, visit our Regulatory page.","filter_flag":1}
{"title":"Bayer: “Science for Better” - Brand Finance","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vYnJhbmRmaW5hbmNlLmNvbS9pbnNpZ2h0cy9iYXllci1zY2llbmNlLWZvci1iZXR0ZXLSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vYnJhbmRmaW5hbmNlLmNvbS9pbnNpZ2h0cy9iYXllci1zY2llbmNlLWZvci1iZXR0ZXLSAQA?oc=5","id":"CBMiOmh0dHBzOi8vYnJhbmRmaW5hbmNlLmNvbS9pbnNpZ2h0cy9iYXllci1zY2llbmNlLWZvci1iZXR0ZXLSAQA","guidislink":false,"published":"Wed, 28 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=179, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vYnJhbmRmaW5hbmNlLmNvbS9pbnNpZ2h0cy9iYXllci1zY2llbmNlLWZvci1iZXR0ZXLSAQA?oc=5\" target=\"_blank\">Bayer: “Science for Better”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Brand Finance<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bayer: “Science for Better” - Brand Finance","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOmh0dHBzOi8vYnJhbmRmaW5hbmNlLmNvbS9pbnNpZ2h0cy9iYXllci1zY2llbmNlLWZvci1iZXR0ZXLSAQA?oc=5\" target=\"_blank\">Bayer: “Science for Better”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Brand Finance<\/font>","source.href":"https:\/\/brandfinance.com","source.title":"Brand Finance","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"This article was originally published in the Brand Finance Chemicals 25 2023 report Agriscience is the use of scientific technologies to enhance agricultural productivity, sustainability, and profitability. The industry is highly driven by intellectual property, developing new technologies to improve crop yield, quality, and protection. Bayer (brand value USD3 billion) is the most valuable brand in the Agriscience industry in 2023. Agriscience represents 55% of the Bayer brand’s total brand value (USD5.5 billion). This total value also includes Bayer’s pharmaceutical and consumer health segments. Interview with Tom Armitage Tom Armitage, SVP, Global Communications, Crop Science, Bayer AG Bayer's brand value has increased for the second year in a row, with the Crop Science division representing half of Bayer’s total brand value. What are the successes and initiatives you can attribute to your continued brand growth? We are committed to investing in growing the reach and impact of the Bayer brand so that it can continue to act as a halo across all our divisions, from Consumer Health, through Pharmaceuticals to Crop Science. Our data shows that, just like consumers, patients and doctors, our farmer customers associate the Bayer brand with innovation, efficacy, and reliability. In the agricultural sector, the imperative to produce more food with fewer available resources means that innovation and new technologies are highly valued to increase farm output while minimising the impact of operations on the environment. This technology focus forms the basis of our latest creative execution, “Investing for Better”, which itself builds on the recently introduced overarching Bayer brand platform “Science for Better” where we aim to both reinforce the relevance to society of scientific innovation as well as to highlight the customer-centricity of our brand and company. Bayer has set ambitious sustainability goals, especially within the crop science division. What role do you hope Bayer can play in future global sustainability? The need to increase food security while also tackling climate change is a very real requirement and one that farmers all over the world can contribute to. Bayer expects to play a leading role in transforming agriculture for a more sustainable future. The agricultural sector has a disproportionate impact in helping to mitigate the causes of climate change while also holding the keys to climate adaptation. For instance, by tracking and measuring the carbon stored in soil as a result of soil-friendly agricultural practices, we can help farmers use their fields as a carbon store, creating new revenue streams for them and new opportunities for other companies to decarbonise. And, with seed breeding and genetics being at the heart of our operations, we are well-placed to help farmers grow crops that can better cope with changing weather patterns such as increased drought or flooding. Alongside the environmental benefits that our portfolio brings, we are committed to reducing the emissions from our own operations, increasing water quality and conservation on farms around the world, as well to reduce the environmental impact of our portfolio of crop protection products. “technology focus forms the basis of our latest creative execution, “Investing for Better”, which itself builds on the recently introduced overarching Bayer brand platform “Science for Better” where we aim to both reinforce the relevance to society of scientific innovation as well as to highlight the customer-centricity of our brand and company.” How does Bayer see the importance of investing in innovation to stay ahead of other brands? Innovation has been the backbone of this company for 160 years. In the agricultural sector, Bayer is out in front in terms of innovation with an industry-leading portfolio of seeds, traits, chemistry and digital tools that together create systems that benefit farmers in crops all over the world. More than anyone else, we invest significantly in innovation so we can continue to deliver value to farmers in the decades ahead, both in terms of increased productivity but also increased efficiency and reduced environmental impact: We spent approximately 2.9 billion euros in 2022 on innovation in Crop Science alone, both in our own internal programs to develop new products but also in external partnerships with other leading biotech and digital players in the agricultural industry. This gives us the opportunity to explore fields outside our traditional portfolio, such as biological alternatives for synthetic fertilizer. Beyond the Crop Science division, we also have a program designed to take bolder moves in emerging technologies called Leaps, which focuses on early-stage investments in life sciences start-ups and innovation-driven companies. Through the initial $1.7 billion funding, Bayer has invested in numerous successful ventures in areas ranging from cell and gene therapy, plant nutrition, digital services for agriculture and consumer health, as well as alternative proteins and cultivated meats. Everything that Leaps invests in is tied to the 10 major challenges facing humanity and how we can overcome them, helping Bayer to work towards its overall vision of “Health for All, Hunger for None.”","filter_flag":1}
{"title":"Oatly Rolls Out Plant-Based Cream Cheese in the United States; Mike Messersmith and Leah Hoxie Share - Deli Market News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vd2VsbC1wYWlyZWQvb2F0bHktcm9sbHMtb3V0LXBsYW50LWJhc2VkLWNyZWFtLWNoZWVzZS11bml0ZWQtc3RhdGVzLW1pa2UtbWVzc2Vyc21pdGgtYW5kLWxlYWgtaG94aWUtc2hhcmUvbGlsaWFuLWRpZXAvdGh1LTA2MTUyMDIzLTA4NDgvMTU2OTLSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vd2VsbC1wYWlyZWQvb2F0bHktcm9sbHMtb3V0LXBsYW50LWJhc2VkLWNyZWFtLWNoZWVzZS11bml0ZWQtc3RhdGVzLW1pa2UtbWVzc2Vyc21pdGgtYW5kLWxlYWgtaG94aWUtc2hhcmUvbGlsaWFuLWRpZXAvdGh1LTA2MTUyMDIzLTA4NDgvMTU2OTLSAQA?oc=5","id":"CBMiqwFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vd2VsbC1wYWlyZWQvb2F0bHktcm9sbHMtb3V0LXBsYW50LWJhc2VkLWNyZWFtLWNoZWVzZS11bml0ZWQtc3RhdGVzLW1pa2UtbWVzc2Vyc21pdGgtYW5kLWxlYWgtaG94aWUtc2hhcmUvbGlsaWFuLWRpZXAvdGh1LTA2MTUyMDIzLTA4NDgvMTU2OTLSAQA","guidislink":false,"published":"Thu, 15 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=166, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vd2VsbC1wYWlyZWQvb2F0bHktcm9sbHMtb3V0LXBsYW50LWJhc2VkLWNyZWFtLWNoZWVzZS11bml0ZWQtc3RhdGVzLW1pa2UtbWVzc2Vyc21pdGgtYW5kLWxlYWgtaG94aWUtc2hhcmUvbGlsaWFuLWRpZXAvdGh1LTA2MTUyMDIzLTA4NDgvMTU2OTLSAQA?oc=5\" target=\"_blank\">Oatly Rolls Out Plant-Based Cream Cheese in the United States; Mike Messersmith and Leah Hoxie Share<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deli Market News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Oatly Rolls Out Plant-Based Cream Cheese in the United States; Mike Messersmith and Leah Hoxie Share - Deli Market News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqwFodHRwczovL3d3dy5kZWxpbWFya2V0bmV3cy5jb20vd2VsbC1wYWlyZWQvb2F0bHktcm9sbHMtb3V0LXBsYW50LWJhc2VkLWNyZWFtLWNoZWVzZS11bml0ZWQtc3RhdGVzLW1pa2UtbWVzc2Vyc21pdGgtYW5kLWxlYWgtaG94aWUtc2hhcmUvbGlsaWFuLWRpZXAvdGh1LTA2MTUyMDIzLTA4NDgvMTU2OTLSAQA?oc=5\" target=\"_blank\">Oatly Rolls Out Plant-Based Cream Cheese in the United States; Mike Messersmith and Leah Hoxie Share<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deli Market News<\/font>","source.href":"https:\/\/www.delimarketnews.com","source.title":"Deli Market News","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"SWEDEN Vegan shoppers looking to add cream cheese back to their diets are in for a treat. It was recently announced that Oatly is rolling out its new cream cheese products to stores in the United States. Available in Plain and Chive & Onion, the new products deliver all the savory, tangy goodness of a traditional cream cheese without any dairy. \"Oatly has always been at the forefront of providing delicious plant-based alternatives and this new product is no different,\" said Mike Messersmith, President. \"We're extremely excited about the launch of our new cream cheese in the U.S., as it not only expands our mission to bring more plant-based consumption occasions to consumers, but also continues to prove the versatility and opportunity for oat-based products.\" Developed by food scientists at the company's Philadelphia, Pennsylvania, research and development (R&D) lab, the new dairy-free, gluten-free, and non-GMO products deliver the same performance and taste cream cheese lovers have come to expect. The products boast a rich and creamy texture, perfect for spreading on bagels, enhancing recipes, or enjoying as a delicious condiment. Made from Oatly's proprietary oat base, this new cream cheese offers yet another opportunity for people to easily make the switch from dairy to plant-based foods. According to a press release, that lifestyle generally has a lower environmental impact compared to consuming traditional dairy products. \"For decades, we've focused on the power of oats and the magic that happens when you unlock their potential,\" said Leah Hoxie, Senior Vice President of Innovation. \"With this new cream cheese, our U.S. R&D team spent over a year focused on bringing to market a truly great-tasting and performing plant-based option that mimics dairy cream cheese in all the best ways possible, minus the dairy.\" Now excuse me while I run to the store and hunt these products down!","filter_flag":1}
{"title":"K-beauty brand Melixir's multi-pronged approach to sustainability - CosmeticsDesign-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvay1iZWF1dHktYnJhbmQtbWVsaXhpci1zLW11bHRpLXByb25nZWQtYXBwcm9hY2gtdG8tc3VzdGFpbmFiaWxpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvay1iZWF1dHktYnJhbmQtbWVsaXhpci1zLW11bHRpLXByb25nZWQtYXBwcm9hY2gtdG8tc3VzdGFpbmFiaWxpdHnSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvay1iZWF1dHktYnJhbmQtbWVsaXhpci1zLW11bHRpLXByb25nZWQtYXBwcm9hY2gtdG8tc3VzdGFpbmFiaWxpdHnSAQA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvay1iZWF1dHktYnJhbmQtbWVsaXhpci1zLW11bHRpLXByb25nZWQtYXBwcm9hY2gtdG8tc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">K-beauty brand Melixir's multi-pronged approach to sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"K-beauty brand Melixir's multi-pronged approach to sustainability - CosmeticsDesign-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDYvMDgvay1iZWF1dHktYnJhbmQtbWVsaXhpci1zLW11bHRpLXByb25nZWQtYXBwcm9hY2gtdG8tc3VzdGFpbmFiaWxpdHnSAQA?oc=5\" target=\"_blank\">K-beauty brand Melixir's multi-pronged approach to sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Asia.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-asia.com","source.title":"CosmeticsDesign-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Particularly conscious about its environmental impact, one of Melixir’s goals is to make all products with 50% PCR (post-consumer recycled) plastics and glasses by 2023. In addition, the firm is investing in R&D to produce single-material containers to steer away from conventional multi-material usage in the cosmetics industry. To minimise paper consumption, it has stopped including leaflets with its products. Instead, the brand and product information are printed on the packaging itself. It has also done away with plastic or vinyl seals. As part of its commitment to environment conservation and to spread awareness of an eco-friendly lifestyle in various forms, the firm piloted a “Plastic-Free Store” in November 2020. The pop-up space in Seoul was designed to eliminate waste that is typically generated from store construction. For instance, the products were displayed on recycled waste and sustainable materials such as used cardboard packaging and paper boxes. After the event ended, the materials were repurposed and reused for another pop-up store in 2021. In May this year, the Plastic-Free Store was brought to Malaysia. “The response has been wonderful. Visitors liked our concept of combining sustainability and minimalist aesthetics with natural lighting of the space, where they could also enjoy a sensory experience of our key ingredients like bamboo and green tea.​ “In the future, we hope to translate ​our vision of connecting people and nature in the design of our flagship store. We want to continue the Plastic-Free Store approach as much as we can. [As for a permanent ‘sustainable store’], we will choose a location where our brand can find like-minded people and community to root ourselves in,” ​Hana Lee, CEO and founder of Melixir, told CosmeticsDesign-Asia​. Meanwhile, consumers can join the brand’s sustainability initiatives through its MeCycle programme, which creates new products from recycled plastics and glass that are then donated to other businesses. “Many of our customers are proud to take part in the programme. They send us their empty bottles to be recycled, and read about our efforts in a monthly sustainability report, which tracks the carbon reduction,” ​Lee said. Vegan Lip Butter ©Melixir Vigorous expansion​ Melixir’s biggest markets at the moment are South Korea and the US, while it is actively working with Sephora to expand to more Asian countries, including Singapore, Indonesia, Thailand, Hong Kong and India. “From K-drama to fashion and beauty, there is huge interest in Korean culture in South East Asia (SEA). We want to be the first in bringing the latest K-beauty trends to the region. Our Vegan Airfit Sunscreen is the top seller under the sunscreen category at Sephora Korea, and we are happy to introduce it to the SEA markets,” ​Lee added. Said to be lightweight and provide intensive hydration without being greasy, Melixir’s products appear to be a good fit for consumers in tropical SEA cities. “We have received positive feedback on how our products suit Asian skin, such as the texture and shades of our Vegan Lip Butter,”​ she added. In fact, the lip balm became highly sought after appearing in award-winning Korean film Decision To Leave ​last year. Microbiome-focused​ Founded in 2018, Melixir claims to be the pioneer vegan skin care brand in South Korea, which provided it with first-mover advantage. “We were the first to bring this new notion to the market. We are aware of what consumers of this generation wants ​— safe and healthy products for humans and the planet. A good brand should keep the promises they made at the very beginning [of their business] because with time, people will see the authenticity of the brand and support it.​ “At Melixir, we want to keep our three promises — 1) 100% vegan 2) designed for sensitive skin and 3) sustainably made — to create a bigger impact in the space,” ​Lee said. With four microbiome-friendly products in its line-up, the brand will continue to focus on developing new products targeting the skin microbiome. “We think that the maintenance of a healthy skin microbiome is a key area in skin care going forward. Thus, we are putting in effort to formulate safe and gentle products for people suffering from skin sensitivity.”​ While the firm believes that consumers’ purchasing decisions are increasingly driven by vegan and sustainable labels, product efficacy is an important factor that should not be neglected. “At the end of the day, people repurchase high-performance products that are effective. For this reason, we always try to achieve both vegan formulations and clinically proven results,” ​Lee explained.","filter_flag":1}
{"title":"Thai firms tapping secret formulas for 'alternative milk' - asianews.network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYXNpYW5ld3MubmV0d29yay90aGFpLWZpcm1zLXRhcHBpbmctc2VjcmV0LWZvcm11bGFzLWZvci1hbHRlcm5hdGl2ZS1taWxrL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYXNpYW5ld3MubmV0d29yay90aGFpLWZpcm1zLXRhcHBpbmctc2VjcmV0LWZvcm11bGFzLWZvci1hbHRlcm5hdGl2ZS1taWxrL9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vYXNpYW5ld3MubmV0d29yay90aGFpLWZpcm1zLXRhcHBpbmctc2VjcmV0LWZvcm11bGFzLWZvci1hbHRlcm5hdGl2ZS1taWxrL9IBAA","guidislink":false,"published":"Fri, 16 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=167, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYXNpYW5ld3MubmV0d29yay90aGFpLWZpcm1zLXRhcHBpbmctc2VjcmV0LWZvcm11bGFzLWZvci1hbHRlcm5hdGl2ZS1taWxrL9IBAA?oc=5\" target=\"_blank\">Thai firms tapping secret formulas for 'alternative milk'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">asianews.network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Thai firms tapping secret formulas for 'alternative milk' - asianews.network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vYXNpYW5ld3MubmV0d29yay90aGFpLWZpcm1zLXRhcHBpbmctc2VjcmV0LWZvcm11bGFzLWZvci1hbHRlcm5hdGl2ZS1taWxrL9IBAA?oc=5\" target=\"_blank\">Thai firms tapping secret formulas for 'alternative milk'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">asianews.network<\/font>","source.href":"https:\/\/asianews.network","source.title":"asianews.network","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"June 16, 2023 BANGKOK – The innovation of plant-based milk aims to increase its value, promote food security, and reduce environmental impact while catering to changing consumer trends. Thailand’s National Innovation Agency (NIA) is actively exploring development of diverse milk products that offer increased nutritional value, minimal environmental impact, and cater to milk enthusiasts of all ages. The push for “alternative milk” products goes hand in hand with Thailand’s commitment to the dairy industry. Organic dairy In 2003, Thailand entered into Free Trade Agreements (FTA) with Australia and New Zealand that included liberalisation of dairy and dairy product trade. Since then, Thai dairy farmers have had to produce high-quality organic raw milk and keep up with new trends to ensure survival and competitiveness in the global market. Dairy Home, a social enterprise company, is aiming to become a producer and distributor of organic milk products derived from an organic cow-rearing process. Their approach focuses on environmental sustainability and avoiding the use of chemicals in the production process. The underlying idea is that happy and well-cared-for cows result in delicious milk. This approach also helps reduce animal feed costs by utilising self-grown grass and employing farmers to care of the cows. The production process also focuses on minimising carbon emissions and using clean energy sources such as wind and solar power while incorporating a comprehensive waste management system. Dairy Home has been selected by the Commerce Ministry for the Local BCG (bio-circular green) Plus project in recognition of its potential for expansion both in the domestic and international market. Dairy Home currently offers a diverse range of products, including milk and yogurt, which are the result of in-house research and collaborations with educational institutions. These efforts aim to improve the production process and develop new products. The company says its commitment to innovation results in products that consistently capture consumers’ interest. For instance, their “bedtime milk” addresses insomnia with high levels of natural melatonin, promoting brain relaxation. It also has low-fat content, making it suitable for daily consumption. Dairy Home also produces oral health-focused milk products to help prevent tooth decay, including yoghurt drinks and compressed milk tablets containing dental-protective probiotics. These products are developed through research conducted by the Faculty of Dentistry, Songkhla Nakarin University, focusing on common oral diseases and epidemiology. However, not everyone can stomach cow’s milk. Individuals with lactose intolerance, which affects up to 70-75% of the global population and is prevalent among Asian populations, may face challenges in consuming dairy. Fortunately, alternative options such as plant-based milks are now available to cater to this group. Rice innovation One example is Diamond Fresh Rice Milk, extracted from fragrant young Hom Mali 105 rice and grains specially selected at their most nutritious stage. This product offers various health benefits and boasts high nutritional value, containing easily absorbable short-chain peptides with antioxidant properties that may boost the immune system. And the good news also extends to rice farmers. Diamond Fresh Organic Rice Milk helps mitigate the impact of price fluctuations in agriculture. However, recognising that expanding organic rice production could lead to oversupply, the company encourages its network of organic farmers to add value by creating health products that meet international standards. To spur sustainable growth in organic rice farming, Diamond Fresh Organic Rice Milk from 100% organic farms is the first and only such product in Thailand to be certified with organic standards. As the number of consumers allergic to cow’s milk continues to rise, with 15-20% of this group also tends to be allergic to soy milk, demand for plant-based foods and beverages among individuals following vegetarian or vegan diets is rising. Healthy sesame Sesamilk Foods Ltd is dedicated to researching and developing products that meet these consumers’ needs. The firm extracts the nutrients and other beneficial properties from premium-grade Thai sesame seeds, creating high-quality 100% sesame milk. Their product line includes White Sesame Milk, rich in nutrients and containing up to 392.4 milligrams of essential minerals per 200 millilitres, and Black Sesame Milk, renowned for its intense flavour and abundant vitamins and minerals. A highlight of Sesamilk products is their high calcium, phosphorus, magnesium, zinc, and dietary fibre content. Its 30 milligrams of sesame oil per 200 millilitres makes it an excellent choice for health-conscious consumers, says the company. It is also a low-sodium option. Sesamilk recently began exports to Japan, attracting interest from businesses in the food and beverage industry that previously relied on cow’s milk or soy milk as ingredients. Sesamilk Foods conducts its research and development in partnership with King Mongkut’s Institute of Technology Ladkrabang. The collaboration aims to create products that meet industry demands.","filter_flag":1}
{"title":"Paradox of Recycling: Greenpeace Study Warns of Increased Toxicity of Plastics - FFOODS Spectrum - nuFFooDS Spectrum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA2LzA5L3BhcmFkb3gtb2YtcmVjeWNsaW5nLWdyZWVucGVhY2Utc3R1ZHktd2FybnMtb2YtaW5jcmVhc2VkLXRveGljaXR5LW9mLXBsYXN0aWNzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA2LzA5L3BhcmFkb3gtb2YtcmVjeWNsaW5nLWdyZWVucGVhY2Utc3R1ZHktd2FybnMtb2YtaW5jcmVhc2VkLXRveGljaXR5LW9mLXBsYXN0aWNzLmh0bWzSAQA?oc=5","id":"CBMieWh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA2LzA5L3BhcmFkb3gtb2YtcmVjeWNsaW5nLWdyZWVucGVhY2Utc3R1ZHktd2FybnMtb2YtaW5jcmVhc2VkLXRveGljaXR5LW9mLXBsYXN0aWNzLmh0bWzSAQA","guidislink":false,"published":"Fri, 09 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=160, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA2LzA5L3BhcmFkb3gtb2YtcmVjeWNsaW5nLWdyZWVucGVhY2Utc3R1ZHktd2FybnMtb2YtaW5jcmVhc2VkLXRveGljaXR5LW9mLXBsYXN0aWNzLmh0bWzSAQA?oc=5\" target=\"_blank\">Paradox of Recycling: Greenpeace Study Warns of Increased Toxicity of Plastics - FFOODS Spectrum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">nuFFooDS Spectrum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Paradox of Recycling: Greenpeace Study Warns of Increased Toxicity of Plastics - FFOODS Spectrum - nuFFooDS Spectrum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vbnVmZm9vZHNzcGVjdHJ1bS5pbi8yMDIzLzA2LzA5L3BhcmFkb3gtb2YtcmVjeWNsaW5nLWdyZWVucGVhY2Utc3R1ZHktd2FybnMtb2YtaW5jcmVhc2VkLXRveGljaXR5LW9mLXBsYXN0aWNzLmh0bWzSAQA?oc=5\" target=\"_blank\">Paradox of Recycling: Greenpeace Study Warns of Increased Toxicity of Plastics - FFOODS Spectrum<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">nuFFooDS Spectrum<\/font>","source.href":"https:\/\/nuffoodsspectrum.in","source.title":"nuFFooDS Spectrum","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Findings emphasise the need for a more comprehensive approach to address the plastic pollution crisis Plastic waste has become an alarming global crisis, with its detrimental effects on the environment and human health that is well-documented. In an attempt to address this issue, recycling has been hailed as a solution to reduce plastic pollution. However, a recent study conducted by Greenpeace warns that recycling might inadvertently exacerbate the toxicity of plastics, hence contradicting the widely held belief that recycling is an unequivocally positive practice. Recycling has long been championed as an effective strategy to mitigate the environmental impact of plastic waste. The process involves converting discarded plastic into new products, conserving resources, reducing landfill space and minimising the need for virgin plastic production. Recycling also generates economic opportunities and promotes the circular economy. The Greenpeace study challenges the prevailing narrative by revealing the potential pitfalls of recycling. It highlights that the recycling of plastics, particularly those labelled as “low-value” or “mixed plastics”, often leads to the production of toxic byproducts. This is primarily due to the use of additives, such as flame retardants and plasticisers, which are commonly found in various plastic products. The research findings demonstrate that recycling processes can result in the breakdown of plastic polymers, thereby causing the release of hazardous chemicals. The resulting recycled plastic products may contain higher concentrations of toxic substances compared to their original counterparts. These chemicals pose risks to human health, both during the production process and when the recycled plastic is used in consumer goods. Moreover, the complexity of plastic waste streams hinders effective recycling. Mixed plastics, which are often difficult to separate and sort, present a significant challenge for recycling facilities. Consequently, the recycling process may not adequately remove or neutralise toxic additives, and it results in the persistence of hazardous chemicals in recycled plastics. Efforts should focus on reducing the production and consumption of plastic, promoting alternative materials and implementing more stringent regulations on the use of additives in plastic production. Additionally, investing in research and development to improve recycling technologies and processes is crucial for minimising the release of hazardous substances during recycling. A shift towards a circular economy, where products are designed for recyclability and the entire life cycle of plastics is considered, is essential. This entails not only improving recycling infrastructure, but also prioritising waste reduction, reuse and composting. It is imperative for policymakers, industry leaders and individuals to recognise the complexities associated with plastic recycling and work collectively towards sustainable solutions that mitigate the environmental and health risks associated with plastic waste. Only through a holistic approach can we strive for a plastic-free planet that truly prioritises the well-being of both the environment and humanity. Ashwin Bhadri, Founder & Chief Executive Officer, Equinox Labs Image credit- shutterstock","filter_flag":1}
{"title":"New investment in peat in fight against climate change - GOV.UK","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA","guidislink":false,"published":"Thu, 29 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=180, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5\" target=\"_blank\">New investment in peat in fight against climate change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GOV.UK<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New investment in peat in fight against climate change - GOV.UK","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L25ld3MvbmV3LWludmVzdG1lbnQtaW4tcGVhdC1pbi1maWdodC1hZ2FpbnN0LWNsaW1hdGUtY2hhbmdl0gEA?oc=5\" target=\"_blank\">New investment in peat in fight against climate change<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GOV.UK<\/font>","source.href":"https:\/\/www.gov.uk","source.title":"GOV.UK","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"New action to reduce peat carbon emissions, improve resilience to drought and support farmers following recommendations from the Chair of the Lowland Agricultural Peat Task Force Over £7.5 million of new funding for innovative water management projects to help mitigate the impacts of climate change Winners of £5 million Paludiculture Exploration Fund grant scheme also announced New investment and actions to improve lowland peat and reduce carbon emissions have been set out by the government today (Thursday 29 June). Peat soils contain over half the country’s terrestrial carbon stores and serve as a potent nature-based solution against climate change. However, as a result of centuries of drainage to create land suitable for agriculture, our peat soils are drying out, causing the organic matter they contain to decompose and release carbon into the atmosphere. Today, just 1% of England’s lowland peatlands remain in a near-natural state. By rewetting lowland peat soils, we can deliver carbon emission reductions, improve food security, boost wetland biodiversity, and better protect communities from flooding. To support the preservation and sustainable management of lowland peatlands, the government has announced that it will take forward action on all the recommendations made by Robert Caudwell, independent Chair of the Lowland Agricultural Peat Task Force, whose report is published today. Environment Minister Trudy Harrison said: Our peatlands are invaluable allies in our battle against climate change, housing over half of our terrestrial carbon stores and providing resilience for future farming. These new measures, which includes funding for innovative new water management schemes, bolster our efforts to protect and improve peat soils – enhancing carbon storage, preserving vital ecosystems, and paving the way for a more sustainable future. This comes alongside over £7.5 million of new funding to kickstart improvements in how we manage water resources to rewet and preserve peat soils. This funding will drive advancements in our understanding of the lowland peat water challenge to transform the way we use water in England’s lowland peat, and will also pay for the installation of infrastructure and monitoring technology to enable more control of water levels in these regions. The measures government is taking will also improve resilience to drought and safeguard productive farming on some of our most valuable agricultural land, supporting our rural economy and those whose livelihoods are intrinsically tied to the land. In 2020, the government established the Lowland Agricultural Peat Task Force to explore how to improve the condition of England’s lowland farmed peat whilst ensuring the continuation of productive agriculture for years to come. The Chair of the task force has put forward fourteen recommendations to government and the wider sector to ensure that lowland peat soils can be managed more sustainably. These recommendations include: New investment in water storage, management and control Public money for wetter modes of farming on peat soils Technical advice on keeping peat soils wetter Creating viable opportunities in private finance Raising the profile of lowland agricultural peat soils Adopting the task force’s roadmap to commercially viable paludiculture (farming on rewetted peat) Robert Caudwell, Chair of the Lowland Agricultural Peat Task Force said: I thank all the members of the Lowland Agricultural Peat Task Force for their time and commitment to finding ways of managing lowland agricultural peat that are sustainable and substantially reduce carbon emissions. All the evidence demonstrates that reducing carbon emissions from lowland peat is vital as part of the United Kingdom government’s plan to tackle climate change. The report and the U.K. government’s response are important first steps in a journey that will require partnership between all stakeholders, and I am confident that the work that is already underway will give farmers opportunities to develop their businesses and contribute to the challenge of net zero. The new funding is distributed across two pilots. The Lowland Agricultural Peat Small Infrastructure Pilot (£5.45m) will support the installation of infrastructure and monitoring technology to enable more control of water levels for the preservation and rewetting of lowland peat. Delivery of this project is being supported by the Association of Drainage Authorities. The Lowland Agricultural Peat Water Discovery Pilot (£2.2m), to be delivered by the Environment Agency, will allow local and water peatland partnerships to collaborate to develop costed water level management plans for lowland peat areas in England. Alan Lovell, Chair of the Environment Agency said: The Environment Agency welcomes the publication of the Caudwell report. Drawing on the report’s recommendations, we recognise that the sustainable management of the water environment through raising the water table within peat soils holds a pivotal role in protecting the carbon it stores. The report findings combined with further research and development provide useful support and incentives to farmers looking to transition to more climate friendly farming of peat soils. This is set out in our National Flood and Coastal Erosion Risk Management Strategy for England and Roadmap. Twelve projects across England are also set to receive support through the £5 million Paludiculture Exploration Fund grant scheme - administered by Natural England - to help understand and overcome barriers to developing paludiculture as a commercially viable farming practice on lowland peat soils. Tony Juniper, Chair of Natural England said: Lowland peatlands play an important role in combating climate change, by keeping carbon in the land and out of the air. Working with land managers and others, it is imperative we find ways to support livelihoods and produce what society needs while at the same time halting the degradation of peat soils. This is why I am so delighted that the £5 million Paludiculture Exploration Fund grant scheme will support twelve projects aimed at overcoming obstacles to developing economically viable farming on wet peat soils. This promising form of wetland agriculture holds tremendous potential for both revitalising peatlands and supporting profitable and sustainable rural businesses. Today’s announcements are part of the government’s commitments to drive international ambition on action to tackle climate change and work towards nature-based solutions, and demonstrate our ambition to deliver on our net zero pathway. The evidence generated by the projects will enable Defra to deliver on our lowland peat commitments within the government’s England Peat Action Plan, Net Zero Strategy, Environmental Improvement Plan, and Plan for Water. On lowland peat, Defra has already funded a new update to the Peatland Code, announced a £6.6m peatland research and development programme, and is developing new farming schemes to support rewetting, restoration and new farming methods in the lowlands. It will also be publishing the new England Peat Map next year. In recognition of the environmental benefits and the key role lowland peat soils play in food production, the government will continue to work with the Chair of the task force as well as farmers, landowners and the wider industry to take forward action on all the report’s recommendations for more sustainable forms of peatland management. Notes to editors: Lowland Agricultural Peat Task Force Robert Caudwell was chair of the Lowland Agricultural Peat Task Force – a group that was tasked with improving the condition of England’s farmed lowland peat. The task force ran between 2021 and 2022. It comprised a national group and four regional sub-groups, which advised on the circumstances of our most extensive lowland peatlands spanning North-East, North-West, South-West and East England. The Task Force was also supported by a sub-group composed of experts in paludiculture. Membership of the Task Force was as follows: Andrea Kelly, Broads Authority Charles Shropshire, G’s Global Chris Evans, UK Centre For Ecology & Hydrology (UKCEH) Daniel Johns, Anglian Water Deborah Land, Natural England Ian Moodie, Association of Drainage Authorities (ADA) Julie Foley, Environment Agency Olly Watts, RSPB Philippa Arnold, National Farmers Union (NFU) Richard Lindsay, University of East London (UEL) Stephen Briggs, Innovation for Agriculture Colleagues from Defra and the Environment Agency Project details Project: Lowland Agricultural Peat Water Discovery Pilot (2023-2025) Funding: £2.2 million Details: The Lowland Agricultural Peat Water Discovery Pilot, delivered by the Environment Agency, will help to improve Defra’s understanding of how water can be better managed to support the rewetting and preservation of lowland peatlands. The project will allow partnerships to collaborate locally to develop costed water level management plans for lowland peat areas in England. Project: Lowland Agricultural Peat Small-Infrastructure Pilot (2023-2025) Funding: £5.45 million Details: The Lowland Agricultural Peat Small Infrastructure Pilot will support the installation of infrastructure and monitoring technology, which will enable more control of water levels for the preservation and rewetting of lowland peat. Delivery of this project is being supported by the Association of Drainage Authorities. In addition to these projects, Defra is planning to support a research and development programme over the next two years with the Environment Agency to investigate questions around rewetting peat, such as water demand, supply and storage; water-management structures; flood-risk management; nature-based solutions for water quality; biodiversity and regulation. The new projects sit alongside an existing portfolio of work on lowland peat, which includes: Lowland Peat 3 This project forms part of the £6.6 million Lowland Peat Research and Development Programme, and will explore further the options, feasibility and wider impacts of managing lowland agricultural peat for reduced greenhouse gas emissions. The work will focus on water availability and distribution to rewet lowlands; impact of topography on rewetting; impacts and risks of more sustainable management practices; and implications on national food supplies. More information is available on the Lowland Peat Project 3 page. The Peatland Code Following a Defra funded research report on greenhouse gas data and emissions factors, the IUCN UK Peatland Programme launched an update to the Peatland Code in March 2023, which allowed lowland fen peatland to be included for the first time. The Peatland Code helps to promote the restoration and protection of peatlands in the UK through attracting private finance. The Peatland Code allows landowners with eligible peatlands to generate carbon units which can be sold to companies seeking to offset their residual carbon emissions. Paludiculture Exploration Fund Paludiculture, or farming on rewetted peat, is a system of agriculture for the profitable production of wetland crops under conditions that support the competitive advantage of these crops. It offers an opportunity to continue profitable agriculture on lowland peat while also managing the land in a way that benefits the environment and supports our net zero ambitions. The £5m Paludiculture Exploration Fund grant scheme application window was open from January 2023 to March 2023. Natural England are today announcing the twelve projects across England which have been successful in securing grants to support the reduction of barriers to developing commercially viable paludiculture on lowland peat soils. Paludiculture Exploration Fund: grant awardees Below is a list and brief description of the projects that this fund is supporting. The projects will explore: how water levels might be raised and managed how crop production might be increased new products and markets that might evolve from paludiculture crops · You can find follow these projects and other developments in paludiculture at www.paludiculture.org.uk AutoSpray Systems: Develop protocols & best working practices for the use of drones for seeding & crop maintenance in Paludiculture. The project will look at existing use of drones and explore potential new areas of use for drones in paludiculture scenarios. The project will focus on various potential crop management tasks as well as the use of drones to monitor crop health. The project will also explore the environmental impact of drone use. The Broads Authority: Fibre Broads The project aims to ‘unlock paludiculture’ through several outcomes. Through feasibility discussions with farmers, it will identify areas in the Broads most suited to wetland crops. In a strategic alliance it will promote and provide a demonstration of paludiculture fibre products to farmers in the region. To promote paludiculture sourced materials in developing consumer and construction products and explore new market opportunities for paludiculture products. Coates English Willow: Low impact Willow Growing as a Paludiculture Crop to produce a high value product ensuring a sustainable future for landowners on the lowland Somerset Moors The project will use willow to produce a sustainable, renewable product whilst protecting and preserving the peat on West Sedgemoor. Utilising hundreds of years of expertise and knowledge of willow and the land, the project will research and develop new science and technology for more efficient planting, with lower herbicide use, and improved harvesting practises and develop a high value product to provide sustainability to farming businesses. Farming and Wildlife Advisory Group Southwest: Developing sustainable land use options on the Somerset Levels Explore a viable land use on multiple pockets of land across the Somerset Levels & Moors (SL&M), overcoming economic and cultural barriers to raising water levels across hydrological blocks of peat. Provide an income stream for owners of the lowest-lying fields, enabling water tables to be raised in higher\/drier fields and reducing CO2 emissions without expensive hydrological engineering works. Explore paludiculture to improve water quality, specifically by reducing phosphate pollution levels within SSSI and Ramsar protected sites. To assess if paludiculture can play a role in supporting ecological diversity of the SL&M through targeted use within the landscape. Fenland SOIL Ltd: Mapping and identification of peatland suitable for change of land-use to paludiculture in the East Anglian Fens The project will work with farmers to build on work the group has already completed in an NCPGS discovery project. Creating and ground truthing detailed peat maps. Supporting these maps with productivity and water management opportunity data. Implementing hydrological modelling of the landscape to monitor water table fluctuation along with CO2 & CH4 emissions. Harper Adams University: The Paludiculture Innovation Project Research and development into the practical field preparation; water management and associated infrastructure needed to establish paludiculture crops. Demonstrated on the university site to use as an educational facility as well as building knowledge around the cropping techniques. Assessment of machinery requirements and opportunities. Collecting data on the above outcomes as well as social impact and value modelling to establish best practice, relevance, and barriers to paludiculture among the farming community. Lancashire Wildlife Trust : Typha production at scale – from field to market. The focus of the project is to develop understanding of the economics, practical issues, and environmental uplift of commercial Typha growing at field scale. Many practical aspects of growing crops on wet soil conditions will be explored from sowing through to management and harvesting. Adapting current mechanised processes and exploring new ones through farmer led experience. In support of this other food crops will be grown at trial scale to explore these opportunities. Manchester Metropolitan University: OPENpeat - Opportunities for Paludiculture and Engagement in the North West: promoting knowledge exchange and assessing opportunity OPENpeat will define and demonstrate the future role of paludiculture in a conservation and ecosystem services focussed landscape. Sharing best practice from existing and emerging paludiculture trials in UK and EU through direct farmer engagement and promote peer to peer learning between UK farmers. During the project period, activities including interviews and workshops aim to embed paludiculture discussion and willingness of farmers on lowland peat to experiment with paludiculture. Micropropagation Services: Solving The Peatland Crisis Through Sphagnum Farming – The Green Alternative to Peat The project will scale up the production of Sphagnum Farming to produce sustainable growing media to replace peat and support the English horticulture sector, whilst also supporting lowland peat farmers with this sustainable, profitable Sphagnum crop for their land. The project will create a commercially sustainable demonstration farm and overcome identified barriers throughout the supply chain. Saltyco: Typha seed heads for textile production: typha processing, agronomy and analysis for paludiculture market development and new knowledge for scaled cultivation To develop and scale up the process of seed separation for Saltyco’s patented BioPuff product. To explore the potential to use these seeds as planting source for new crop establishment. In addition to this, new uses and products will be explored for the Typha seeds to add further value to this paludiculture crop. UK Centre for Ecology & Hydrology: Overcoming Financial Barriers for Paludiculture with Biochar Integration The project aims to build on and expand trials of incorporating biochar in peat soils. Biochar is a charcoal-like product following the pyrolysis of biomass feedstocks under low oxygen conditions. Being high in carbon (>70%) and relatively stable, it is viewed as a form of carbon capture but may also improve other functions in soil and deliver other agronomic benefits. In this way, biochar has the potential to be an additional income stream for farmers considering paludiculture. Vitagrass Farms Ltd: Paludiculture Opportunities at Vitagrass The overall goal and vision for this project is to overcome the variety of barriers to paludiculture. The grant will explore the options that need to be considered to produce a business case. On production of the business case a small-scale trial site will explore a recommended paludiculture option.","filter_flag":1}
{"title":"Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5\" target=\"_blank\">Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2ludGVydmlld3MvaW5kdXN0cnktc3BlYWsvYmlzbGVyaS1pbnRlcm5hdGlvbmFsLXB2dC1sdGQvYW5nZWxvLWdlb3JnZS8xMzYxOS0x0gEA?oc=5\" target=\"_blank\">Angelo George | Chief Executive Officer | Bisleri International Pvt Ltd<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"We recycle more plastic than we consume Bisleri International Pvt Ltd, one of India’s leading packaged drinking water companies, has undertaken a project to upcycle PET bottles to create apparels, shoes, and other products, thus contributing to the circular economy. The project is part of the company’s initiative ‘Bottles for Change’ which aims to raise awareness about post-consumer plastic and encourage people to consider used plastic as a valuable resource for recycling, rather than waste. In an interview with Fibre2Fashion, Bisleri International CEO Angelo George shares his perspective on how the company’s PET upcycling process is making a positive impact on the planet. What are the key factors driving the demand for a sustainable lifestyle, and how has this shift impacted consumer behaviour in recent years? Consumer behaviour is undergoing a significant transformation as people are becoming increasingly conscious of the environmental and social issues. As a result, consumers are making deliberate choices on products and services with a reduced impact on the environment. Consequently, there is an expectation for businesses to actively contribute to positive change, and consumers also desire governments and other stakeholders to take responsibility. This shift is particularly evident in industries such as consumer goods, food and beverages, fashion, and mobility. The preference for local and organic food, reusable products, energy-efficient appliances, and renewable energy sources represents a transformative trend towards sustainable living. Furthermore, consumers are actively participating in discussions and initiatives related to recycling, water and biodiversity conservation, organic produce, and ethical sourcing. How does upcycling of PET bottles into apparel contribute to the growth of the circular economy? PET bottles are highly versatile and can be repurposed into a range of items. The upcycling process involves recycling and transforming used PET bottles into different products, exemplifying a circular approach that extends the lifespan of existing materials and reduces the need for new resources. Upcycling PET bottles into apparel plays a vital role in advancing India’s circular economy objectives. By reducing the demand for virgin materials like petroleum, which is used to produce new synthetic fibres, it helps conserve valuable resources. Simultaneously, this practice diminishes the amount of plastic waste that would otherwise accumulate in landfills and oceans as the bottles are transformed into high-value products. Moreover, upcycling offers ecological benefits by lowering the carbon footprint compared to traditional textile production, which typically consumes substantial energy, water, and raw materials. Scaling up upcycling practices can create significant employment opportunities and contribute to local economic development. What challenges and opportunities do companies face when incorporating upcycled PET bottles into their production processes for apparel? The conversion of PET bottles into apparel production processes presents both challenges and opportunities for companies. One primary challenge lies in ensuring a consistent supply of high-quality recycled PET material, which necessitates strict quality control measures. Additionally, specialised equipment and processes are required to convert the recycled material into fabric or other apparel components, potentially requiring investments in machinery and worker training. However, this integration can also yield opportunities for companies. It can cater to the growing consumer demand for sustainable and eco-friendly products, allowing businesses to differentiate themselves from their competitors and build brand equity. Besides, it can help decrease the environmental impact of textile production, resulting in cost savings, improved environmental performance, and a better reputation for the organisation by being conscious and purpose driven. What motivated Bisleri International to embark on sustainable practices and environmental stewardship? Sustainability is embedded in the core of Bisleri International’s business strategy. We were one of the first companies in India to recycle plastic since the 1990s, and we are passionate about plastic circularity. Our commitment to sustainability is based on our core principle, the Bisleri Greener Promise, which anchors our programmes for conserving natural resources and ensuring plastic circularity. We are one of the first FMCG companies in India to be plastic-neutral and water-positive. We recycle more plastic than we consume and replenish more water than we process for our business. Our business model focuses on the responsible extraction of groundwater. We have plants spread across the country to extract groundwater evenly, rather than mega-size plants at central locations, which depletes the water table. The proximity to the market reduces the carbon footprint as well. Our manufacturing processes convert >90 per cent of water processed into finished goods, reducing wastage. All our plants have robust water harvesting systems, and we restore water bodies to help recharge groundwater. Bisleri also repairs and maintains check dams to conserve precious rainwater to benefit farmers in rural areas. Our packaging materials have always been 100 per cent recyclable. Our approach has been to reduce, reuse and recycle plastic. Design innovations have helped us reduce over 10 per cent of virgin plastic consumption last year. Our focus on reusable containers to minimise virgin plastic consumption has made this segment almost 30 per cent of the business. Besides, we have been promoting the repurposing of used plastic in collaboration with recyclers. We have also invested in solar panels at our plants and are using electric delivery vehicles to improve energy efficiency and reduce carbon footprint in operations. Can you explain the process followed to collect and process used PET bottles for recycling? In 2018, we launched the programme ‘Bottles For Change’ to raise awareness that used plastic is a valuable resource that can be recycled. We educate people about the responsible disposal of used plastic and provide enabling systems to ensure that it is sent directly for recycling. We advocate a 3-stage process – clean the used plastic, segregate it at the source, and send it directly for recycling. We also provide collection infrastructure to ensure used plastic reaches recyclers directly and does not end up in landfills. The programme is active in 7 cities, and we have managed to reach over 600,000 people so far. The footprint covers some of the largest corporates, educational institutions and housing societies in India. We have also introduced a user-friendly mobile app that allows individuals and organisations to register for the programme. Through the app, users can easily locate nearby plastic agents to collect the clean and segregated plastic, which is then sold to recyclers. Once collected, PET waste is sorted, cleaned, and treated to remove other materials like caps, rings, or labels. The bottles are washed using a combination of hot and cold water and then processed through a PET treatment plant specially designed for recycling. Any irregular lumps or blocks of materials are crushed to produce flakes, which are then dried, mixed with pigments, extruded, and spun into filaments. These filaments are then cooled, collected, stretched, crimped, heat-treated, and cut into desired lengths depending on the final product. For example, for an apparel, the fibres are spun into yarn, wound onto bobbins, and woven into the fabric. It is then finished and dyed if necessary. Finally, the material is stitched to create various merchandise such as T-shirts and backpacks. How does your upcycling initiative contribute to the concept of the circular economy? Through our initiative, we have been able to collect valuable used plastic and upcycle them into highly valuable products. The upcycling practices have helped mitigate the requirement for natural resources and create new products, thereby reducing the impact on the environment. Through our ‘Bottles for Change’ programme, we promote sustainability and create employment opportunities for rag pickers, aggregators, and recyclers who repurpose used plastic to create higher-value items. We aim to create a citizen movement where everyone joins hands in achieving the sustainable goals of our nation. What products are created from the upcycling process of PET bottles? PET is widely recognised as the most recycled plastic worldwide, owing to its flexibility and lightweight properties that help ease upcycling into different new products. PET bottles can be transformed into a range of high-value items such as apparels, bags, shoes, plant pots, window blinds and utility items. Besides, it can also be upcycled into hard-bound industry products such as benches and paver blocks, among others. Can you share the impact Bottles For Change has created so far? Bottles For Change aims to create awareness among people to treat used plastic as a valuable resource by segregating and responsibly disposing it off, thereby preventing it from entering landfills. Our initiative strives to bring behavioural change by inculcating best practices among people to build a greener environment. Bottles for Change has made significant progress since its inception. We have successfully engaged with over 600,000 citizens through workshops and collection drives conducted at more than 3,500 housing societies, 680 educational institutions, 790 corporates, and 600 hotels and restaurants across 13 municipal corporations. All profits from the initiative are dedicated to improving the lives of the ragpickers. Which cities in India is Bisleri currently working on for the Bottles for Change programme? Are you also partnering with NGOs?","filter_flag":1}
{"title":"Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA","guidislink":false,"published":"Mon, 05 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=156, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5\" target=\"_blank\">Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9uZXdzL2JpZ2Jhc2tldC1yZWxlYXNlcy1ncmVlbi1yZXBvcnQtMjAyMi1zaG93Y2FzaW5nLWNvbW1pdG1lbnQtc3VzdGFpbmFiaWxpdHktaW5kaWFuLXJldGFpbNIBAA?oc=5\" target=\"_blank\">Bigbasket Releases The Green Report 2022, Showcasing Commitment to Sustainability in Indian Retail<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
{"title":"Thankyou unveils what’s next - Retail World","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvdGhhbmt5b3UtdW52ZWlscy13aGF0cy1uZXh0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvdGhhbmt5b3UtdW52ZWlscy13aGF0cy1uZXh0L9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvdGhhbmt5b3UtdW52ZWlscy13aGF0cy1uZXh0L9IBAA","guidislink":false,"published":"Wed, 14 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=165, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvdGhhbmt5b3UtdW52ZWlscy13aGF0cy1uZXh0L9IBAA?oc=5\" target=\"_blank\">Thankyou unveils what’s next<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail World<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Thankyou unveils what’s next - Retail World","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vcmV0YWlsd29ybGRtYWdhemluZS5jb20uYXUvdGhhbmt5b3UtdW52ZWlscy13aGF0cy1uZXh0L9IBAA?oc=5\" target=\"_blank\">Thankyou unveils what’s next<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail World<\/font>","source.href":"https:\/\/retailworldmagazine.com.au","source.title":"Retail World","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental Impact\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Thankyou has announced the “reimagining” of its current personal care products along with its launch into the home cleaning category. The personal care range features “reimagined” versions of the “cult favourite” Thankyou hand wash and body wash, nourishing and exfoliating body bars, and a new 48hr antiperspirant deodorant. While Thankyou’s signature plastic bottles will still be available, relaunched with bottles made from 98% recycled plastic, Thankyou has also launched a new line of “super sleek” refillable Forever Bottles made from recycled aluminium and refill containers made from 100% HDPE recycled materials. “The 100% recycled, infinitely recyclable aluminium Forever Bottles can be filled with Thankyou’s ethically made products, allowing customers to significantly reduce their household waste and environmental impact, all while supporting the Thankyou mission of eradicating global poverty,” says the brand. Home cleaning Entering the home cleaning category for the first time, Thankyou says it has decided to create a cleaning product that “outstripped” competitors in its versatility, affordability and design. “The 100% Natural Universal Cleaner – formulated for use on glass, tile, stone and other household surfaces – can be diluted to different degrees depending on its use, with the price point per 100ml for the diluted solution averaging at 33¢, as opposed to the average among other cleaning brands of $1.08,” says the brand. The hospital grade disinfectant Australian made formula – which contains an active plant-based lactic acid – has been certified to kill 99.99% of germs and is claimed to be effective at eradicating grease, stains and odours. It’s said to be “remarkably free” from harsh chemicals, too. The new offering is available Fragrance Free (no allergens) or scented with Botanical Grapefruit. It’s also available with the refillable Forever Bottles. Complimenting Thankyou’s Universal Cleaner are microfibre cloths. The 30cm x 30cm microfibre cloths are promoted as washable and reusable, made using recycled plastic fabric. They are available in “tastefully” muted greys, with “discrete” Thankyou labels on the side indicating the surface for which they are most suitable. Availability This week, products will begin to appear on the shelves of major retailers including Coles, Woolworths, independent grocers, Chemist Warehouse, and Big W. The entire range will also be available to purchase from Thankyou’s brand-new e-commerce site launching early next month.","filter_flag":1}
