{"title":"A Supreme Court Ruling May Make It Harder for Government Agencies to Use Good Science","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.scientificamerican.com%2farticle%2fsupreme-courts-chevron-deference-decision-could-make-science-based%2f&c=10367798155574025504&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.scientificamerican.com%2farticle%2fsupreme-courts-chevron-deference-decision-could-make-science-based%2f&c=10367798155574025504&mkt=en-us","summary":"The Supreme Court is considering the fate of Chevron deference, a 40-year legal principle that has shaped the role of government agencies. The outcome could affect medication approval, pollution ...","published":"Tue, 25 Jun 2024 10:30:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=10, tm_min=30, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"Scientific American","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A Supreme Court Ruling May Make It Harder for Government Agencies to Use Good Science","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The Supreme Court is considering the fate of Chevron deference, a 40-year legal principle that has shaped the role of government agencies. The outcome could affect medication approval, pollution ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.-7YUj4HjbBQACE_47SGM-C&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":466.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"The Supreme Court is considering the fate of Chevron deference, a 40-year legal principle that has shaped the role of government agencies. The outcome could affect medication approval, pollution regulation, and more The Supreme Court is set to rule as soon as Wednesday on a seemingly tedious pair of cases that question who should pay for congressionally mandated observers on fishing boats: the owners of the boats or a federal agency. But far from being small fish, the opinions may rejigger the balance of power among the branches of government and weaken the role of science in policymaking. These cases target a long-standing precedent called Chevron deference, which determines how courts evaluate a given federal agency’s interpretation of congressional statutes that guide that agency’s actions. These statutes often contain accidental or intentional ambiguities. And for the past 40 years, agencies have had the leeway to interpret those ambiguities because courts have recognized that these offices are staffed by people with special training and scientific expertise. But legal experts say that Chevron deference will almost certainly change—the only question now is whether the Supreme Court will completely overturn the principle or merely narrow it. And the Court’s decision will ripple far beyond the fishing community. The ruling could affect how medication is approved and what pollutants are regulated; it challenges the authority of a host of agencies, including the Food and Drug Administration, the Occupational Safety and Health Administration and the Environmental Protection Agency, where Chevron deference began. On supporting science journalism If you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today. “Rolling back Chevron is going to create a huge paradigm shift in how the government works and even how Congress legislates,” says Andrew Twinamatsiko, director of the Health Policy and the Law Initiative at Georgetown University. Chevron deference gets its name from a 1984 Supreme Court case that hinged on how the EPA chose to interpret Congress’s Clean Air Act. Under the administration of President Ronald Reagan, the EPA had decided to define the term “source” in a way that would allow a host of new industrial projects to evade pollution emission regulation, says David Doniger, an attorney at the Natural Resources Defense Council (NRDC), who argued—and lost—that case. In its original opinion for the 1984 case, the Court established two principles for evaluating an agency’s actions when it fulfills instructions from Congress. If the relevant statute was clear, the case determined, the agency would have to abide by it. If the statute was ambiguous, a court would have to defer to the agency’s reasonable interpretation of what it might mean—otherwise the judicial branch would risk overstepping its mandate and entering the realm of policymaking. In the situation Doniger and the NRDC had objected to, the court decided, the Clean Air Act was ambiguous, and the EPA had made a reasonable interpretation. So the agency’s relevant projects were not subject to the regulations. At the time, it was an unremarkable reminder of judicial restraint that had been the norm for a century, Doniger says. “It really wasn’t breaking new ground,” he says. “But it became a very concise restatement of that approach.” In the decades since the decision, the Chevron opinion has been cited more than 16,000 times in courts across the country. Even Doniger has come to appreciate the policy. A particularly important feature of Chevron deference, he says, is its nonpartisan nature. “It is a neutral principle,” Doniger says. “It lets conservative administrations cut back on the scope of these laws, and it lets liberal administrations do more with them.” A Threat to Scientific Expertise Judicial deference to agencies’ expertise is crucial to how U.S. medical and environmental regulation, in particular, currently works. For example, the FDA currently uses its discretion to loosen approval requirements for treatments of rare diseases, such as by permitting historical records to substitute for a control group in a clinical trial, says Reshma Ramachandran, an assistant professor at the Yale School of Medicine, who has a background in public policy. And the agency’s ability to regulate new products—such as vaping systems and genetic tests marketed directly to consumers—can rely on the ambiguity in terms such as “medical devices” in legislation from Congress. Ramachandran worries that if Chevron deference falls, the FDA will become more cautious out of fear of being taken to court and losing. “I think the government agencies are just going to be much more hesitant to follow the science and instead might make decisions based on the political and legal landscape,” she says. New treatments might take longer to be approved, and on the other end of the spectrum, people could be exposed to dangerous or misleading products that were able to evade regulation, she worries. Doniger cites the EPA’s regulation of carbon emissions as pollutants and OSHA regulations that targeted the spread of COVID in workplaces early in the pandemic as examples of the sort of situation in which Chevron deference can allow agencies to take the lead on topics that are firmly within their territory but about which Congress has yet to create detailed legislation. Since the development of Chevron deference, Congress and federal agencies have settled into a pattern that works, experts say. Congress writes legislation—which sometimes remains in place for decades—with ambiguities, and the agencies that know the relevant topics better turn that legislation into meaningful and practical policies. “Congress doesn’t have the time or expertise to fill in the details for thousands of regulations, and it’s hard to anticipate the twists and turns of the future and exactly what [lawmakers] need to spell out specifically,” says Dena Adler, a senior attorney at New York University’s Institute for Policy Integrity. Agencies use their expertise to turn broad-brush statutes into nitty-gritty policies, and the courts intervene only in extreme circumstances. Of course, that’s assuming Congress passes legislation in the first place, which is becoming increasingly difficult amid deep partisanship. “Since Congress is so gridlocked, we’re often using existing laws to meet novel challenges,” Adler says. Without Chevron deference, she fears courts may reject agencies’ attempts to fit new issues or technologies into the scope of existing laws. “I think this decision could have real implications for agencies’ ability to tackle the problems of the day like climate change,” she says. The Clean Air Act specifically directed the EPA to incorporate chemicals that would later be determined to be air pollutants, but not all legislation includes this kind of future-proofed language. Blurring the Lines of Agencies’ Authority Chevron precedent isn’t the only source of agencies’ authority, particularly on technical matters. In some situations, legislation does explicitly order a given agency to make certain evaluations, and agencies’ actions in these circumstances should be respected even without Chevron deference, Adler says. And other legal principles exist that support reasonable scientific judgements made by agencies, she notes. But Adler worries these principles may come under fire anyway as small-government advocates seek to blur the lines between such situations and those covered by Chevron deference, which applies exclusively to interpretations of congressional statutes. Regardless of whether Chevron is overturned or weakened, federal agencies will likely face a spike in lawsuits as adversaries feel out the boundaries of the Supreme Court’s decision, experts say. Challenges that succeed will force agencies to start fresh on a given issue after federal workers already spent years developing its related rule. Even unsuccessful challenges pull agency resources from other work, says Emily Hammond, a professor of law at the George Washington University. “It’s a huge distraction, and it’s also years and years of work,” they say. “It is a big disruption to have a rule overturned.” The less deference agencies expect to have in court—and the more often they expect to end up there—the more limited policies are likely to be, experts agree. Rather than using the full powers of the statutes Congress has written, agencies will likely err on the side of caution. Cultivating hesitancy within federal agencies isn’t necessarily antiscience, but it’s hardly proscience either. “Certainly that weakens the capacity of the government to respond when science reveals a threat to people’s health or people’s lives,” Doniger says. Weakening Chevron deference “doesn’t actually deny that COVID is transmitted in the workplace or that air pollution is causing cancer or causing climate change; it just makes it much harder for the government to do anything about it,” he says. “It comes down to whether the government can protect you.”","filter_flag":1}
{"title":"The delusion of advanced plastic recycling using pyrolysis","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.salon.com%2f2024%2f06%2f23%2fthe-delusion-of-advanced-plastic-recycling-using-pyrolysis_partner%2f&c=16037556626559289742&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.salon.com%2f2024%2f06%2f23%2fthe-delusion-of-advanced-plastic-recycling-using-pyrolysis_partner%2f&c=16037556626559289742&mkt=en-us","summary":"It’s hard to transform flimsy candy wrappers into sandwich bags, or to make containers that once held motor oil clean enough for milk ... but it would turn them into new products that can replace the ...","published":"Sun, 23 Jun 2024 03:45:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=23, tm_hour=3, tm_min=45, tm_sec=0, tm_wday=6, tm_yday=175, tm_isdst=0)","news_source":"Salon","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The delusion of advanced plastic recycling using pyrolysis","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"It’s hard to transform flimsy candy wrappers into sandwich bags, or to make containers that once held motor oil clean enough for milk ... but it would turn them into new products that can replace the ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.Cs7y3pAj-x1TYldLKyf2oS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":466.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"Last year, I became obsessed with a plastic cup. It was a small container that held diced fruit, the type thrown into lunch boxes. And it was the first product I’d seen born of what’s being touted as a cure for a crisis. Plastic doesn’t break down in nature. If you turned all of what’s been made into cling wrap, it would cover every inch of the globe. It’s piling up, leaching into our water and poisoning our bodies. Scientists say the key to fixing this is to make less of it; the world churns out 430 million metric tons each year. But businesses that rely on plastic production, like fossil fuel and chemical companies, have worked since the 1980s to spin the pollution as a failure of waste management — one that can be solved with recycling. Industry leaders knew then what we know now: Traditional recycling would barely put a dent in the trash heap. It’s hard to transform flimsy candy wrappers into sandwich bags, or to make containers that once held motor oil clean enough for milk. Now, the industry is heralding nothing short of a miracle: an “advanced”type of recycling known as pyrolysis — “pyro” means fire and “lysis” means separation. It uses heat to break plastic all the way down to its molecular building blocks. While old-school, “mechanical” recycling yields plastic that’s degraded or contaminated, this type of “chemical” recycling promises plastic that behaves like it’s new, and could usher in what the industry casts as a green revolution: Not only would it save hard-to-recycle plastics like frozen food wrappers from the dumpster, but it would turn them into new products that can replace the old ones and be chemically recycled again and again. So when three companies used ExxonMobil’s pyrolysis-based technology to successfully conjure up that fruit cup, they announced it to the world. “This is a significant milestone,” said Printpack, which turned the plastic into cups. The fruit supplier Pacific Coast Producers called it “the most important initiative a consumer-packaged goods company can pursue.” “ExxonMobil is supporting the circularity of plastics,” the August 2023 news release said, citing a buzzword that implies an infinite loop of using, recycling and reusing. They were so proud, I hoped they would tell me all about how they made the cup, how many of them existed and where I could buy one. Let’s take a closer look at that Printpack press release, which uses convoluted terms to describe the recycled plastic in that fruit cup: “30% ISCC PLUS certified-circular” “mass balance free attribution” It’s easy to conclude the cup was made with 30% recycled plastic — until you break down the numerical sleight of hand that props up that number. It took interviews with a dozen academics, consultants, environmentalists and engineers to help me do just that. Stick with me as I unravel it all. So began my long — and, well, circular — pursuit of the truth at a time when it really matters. This year, nearly all of the world’s countries are hammering out a United Nations treaty to deal with the plastic crisis. As they consider limiting production, the industry is making a hard push to shift the conversation to the wonders of chemical recycling. It’s also buying ads during cable news shows as U.S. states consider laws to limit plastic packaging and lobbying federal agencies to loosen the very definition of what it means to recycle. It’s “very, very, very, very difficult” to break down plastic that way. It’s been selling governments on chemical recycling, with quite a bit of success. American and European regulatorshave spent tens of millions subsidizing pyrolysis facilities. Half of all U.S. states have eased air pollution rules for the process, which has been found to release carcinogens like benzene and dioxins and give off more greenhouse gases than making plastic from crude oil. Given the high stakes of this moment, I set out to understand exactly what the world is getting out of this recycling technology. For months, I tracked press releases, interviewed experts, tried to buy plastic made via pyrolysis and learned more than I ever wanted to know about the science of recycled molecules. Under all the math and engineering, I found an inconvenient truth: Not much is being recycled at all, nor is pyrolysis capable of curbing the plastic crisis. Not now. Maybe not ever. In traditional recycling, plastic is turned into tiny pellets or flakes, which you can melt again and mold back into recycled plastic products. Even in a real-life scenario, where bottles have labels and a little bit of juice left in them, most of the plastic products that go into the process find new life. The numbers are much lower for pyrolysis. It’s “very, very, very, very difficult” to break down plastic that way, said Steve Jenkins, vice president of chemicals consulting at Wood Mackenzie, an energy and resources analytics firm. “The laws of nature and the laws of physics are trying to stop you.” Waste is heated until it turns into oil. Part of that oil is composed of a liquid called naphtha, which is essential for making plastic. There are two ingredients in the naphtha that recyclers want to isolate: propylene and ethylene — gases that can be turned into solid plastics. To split the naphtha into different chemicals, it’s fed into a machine called a steam cracker. Less than half of what it spits out becomes propylene and ethylene. This means that if a pyrolysis operator started with 100 pounds of plastic waste, it can expect to end up with 15-20 pounds of reusable plastic. Experts told me the process can yield less if the plastic used is dirty or more if the technology is particularly advanced. I reached out to several companies to ask how much new plastic their processes actually yield, and none provided numbers. The American Chemistry Council, the nation’s largest plastic lobby, told me that because so many factors impact a company’s yield, it’s impossible to estimate that number for the entire industry. With mechanical recycling, it’s hard to make plastic that’s 100% recycled; it’s expensive to do, and the process degrades plastic. Recycled pellets are often combined with new pellets to make stuff that’s 25% or 50% recycled, for example. But far less recycled plastic winds up in products made through pyrolysis. That’s because the naphtha created using recycled plastic is contaminated. Manufacturers add all kinds of chemicals to make products bend or keep them from degrading in the sun. Recyclers can overpower them by heavily diluting the recycled naphtha. With what, you ask? Nonrecycled naphtha made from ordinary crude oil! This is the quiet — and convenient — part of the industry’s revolutionary pyrolysis method: It relies heavily on extracting fossil fuels. At least 90% of the naphtha used in pyrolysis is fossil fuel naphtha. Only then can it be poured into the steam cracker to separate the chemicals that make plastic. So at the end of the day, nothing that comes out of pyrolysis physically contains more than 10% recycled material (though experts and studies have shown that, in practice, it’s more like 5% or 2%). Ten percent doesn’t look very impressive. Some consumers are willing to pay a premium for sustainability, so companies use a form of accounting called mass balance to inflate the recycled-ness of their products. It’s not unlike offset schemes I’ve uncovered that absolve refineries of their carbon emissions and enable mining companies to kill chimpanzees. Industry-affiliated groups like the International Sustainability and Carbon Certification write the rules. (ISCC didn’t respond to requests for comment.) Legislation in the European Union already forbids free attribution, and leaders are debating whether to allow other forms of mass balance. To see how this works, let’s take a look at what might happen to a batch of recycled naphtha. Let’s say the steam cracker splits the batch into 100 pounds of assorted ingredients. There are many flavors of this kind of accounting. Another version of free attribution would allow the company to take that entire 30-pound batch of “33% recycled” pouches and split them even further: A third of them, 10 pounds, could be labeled 100% recycled — shifting the value of the full batch onto them — so long as the remaining 20 pounds aren’t labeled as recycled at all. As long as you avoid double counting, Jenkins told me, you can attribute the full value of recycled naphtha to the products that will make the most money. Companies need that financial incentive to recoup the costs of pyrolysis, he said. But it’s hard to argue that this type of marketing is transparent. Consumers aren’t going to parse through the caveats of a 33% recycled claim or understand how the green technology they’re being sold perpetuates the fossil fuel industry. I posed the critiques to the industry, including environmentalists’ accusations that mass balance is just a fancy way of greenwashing. The American Chemistry Council told me it’s impossible to know whether a particular ethylene molecule comes from pyrolysis naphtha or fossil fuel naphtha; the compounds produced are “fungible” and can be used for multiple products, like making rubber, solvents and paints that would reduce the amount of new fossil fuels needed. Its statement called mass balance a “well-known methodology” that’s been used by other industries including fair trade coffee, chocolate and renewable energy. Legislation in the European Union already forbids free attribution, and leaders are debating whether to allow other forms of mass balance. U.S. regulation is far behind that, but as the Federal Trade Commission revises its general guidelines for green marketing, the industry is arguing that mass balance is crucial to the future of advanced recycling. “The science of advanced recycling simply does not support any other approach because the ability to track individual molecules does not readily exist,” said a comment from ExxonMobil. If you think navigating the ins and outs of pyrolysis is hard, try getting your hands on actual plastic made through it. It’s not as easy as going to the grocery store. Those water bottles you might see with 100% recycled claims are almost certainly made through traditional recycling. The biggest giveaway is that the labels don’t contain the asterisks or fine print typical of products made through pyrolysis, like “mass balance,” “circular” or “certified.” When I asked about the fruit cup, ExxonMobil directed me to its partners. Printpack didn’t respond to my inquiries. Pacific Coast Producers told me it was “engaged in a small pilot pack of plastic bowls that contain post-consumer content with materials certified” by third parties, and that it “has made no label claims regarding these cups and is evaluating their use.” I pressed the American Chemistry Council for other examples. “Chemical recycling is a proven technology that is already manufacturing products, conserving natural resources, and offering the potential to dramatically improve recycling rates,” said Matthew Kastner, a media relations director. His colleague added that much of the plastic made via pyrolysis is “being used for food- and medical-grade packaging, oftentimes not branded.” They provided links to products including a Chevron Phillips Chemical announcement about bringing recycled plastic food wrapping to retail stores. “For competitive reasons,” a Chevron spokesperson declined to discuss brand names, the product’s availability or the amount produced. In another case, a grocery store chain sold chicken wrapped in plastic made by ExxonMobil’s pyrolysis process. The producers told me they were part of a small project that’s now discontinued. In the end, I ran down half a dozen claims about products that came out of pyrolysis; each either existed in limited quantities or had its recycled-ness obscured with mass balance caveats. Then this April, nearly eight months after I’d begun my pursuit, I could barely contain myself when I got my hands on an actual product. I was at a United Nations treaty negotiation in Ottawa, Ontario, and an industry group had set up a nearby showcase. On display was a case of Heinz baked beans, packaged in “39% recycled plastic*.” (The asterisk took me down an online rabbit hole about certification and circularity. Heinz didn’t respond to my questions.) This, too, was part of an old trial. The beans were expired. Pyrolysis is a “fairy tale,” I heard from Neil Tangri, the science and policy director at the environmental justice network Global Alliance for Incinerator Alternatives. He said he’s been hearing pyrolysis claims since the ’90s but has yet to see proof it works as promised. “If anyone has cracked the code for a large-scale, efficient and profitable way to turn plastic into plastic,” he said, “every reporter in the world” would get a tour. If I did get a tour, I wondered, would I even see all of that stubborn, dirty plastic they were supposedly recycling? The industry’s marketing implied we could soon toss sandwich bags and string cheese wrappers into curbside recycling bins, where they would be diverted to pyrolysis plants. But I grew skeptical as I watched a webinar for ExxonMobil’s pyrolysis-based technology, the kind used to make the fruit cup. The company showed photos of plastic packaging and oil field equipment as examples of its starting material but then mentioned something that made me sit up straight: It was using pre-consumer plastic to “give consistency” to the waste stream. Chemical plants need consistency, so it’s easier to use plastic that hasn’t been gunked up by consumer use, Jenkins explained. But plastic waste that had never been touched by consumers, such as industrial scrap found at the edges of factory molds, could easily be recycled the old-fashioned way. Didn’t that negate the need for this more polluting, less efficient process? I asked ExxonMobil how much post-consumer plastic it was actually using. Catie Tuley, a media relations adviser, said it depends on what’s available. “At the end of the day, advanced recycling allows us to divert plastic waste from landfills and give new life to plastic waste.” I posed the same question to several other operators. A company in Europe told me it uses “mixed post-consumer, flexible plastic waste” and does not recycle pre-consumer waste. But this spring at an environmental journalism conference, an American Chemistry Council executive confirmed the industry’s preference for clean plastic as he talked about an Atlanta-based company and its pyrolysis process. My colleague Sharon Lerner asked whether it was sourcing curbside-recycled plastic for pyrolysis. If Nexus Circular had a “magic wand,” it would, he acknowledged, but right now that kind of waste “isn’t good enough.” He added, “It’s got tomatoes in it.” (Nexus later confirmed that most of the plastic it used was pre-consumer and about a third was post-consumer, including motor oil containers sourced from car repair shops and bags dropped off at special recycling centers.) Clean, well-sorted plastic is a valuable commodity. If the chemical recycling industry grows, experts told me, those companies could end up competing with the far more efficient traditional recycling. To spur that growth, the American Chemistry Council is lobbying for mandates that would require more recycled plastic in packaging; it wants to make sure that chemically recycled plastic counts. “This would create market-driven demand signals,” Kastner told me, and ease the way for large-scale investment in new chemical recycling plants. I asked Jenkins, the energy industry analyst, to play out this scenario on a larger scale. Were all of these projects adding up? Could the industry conceivably make enough propylene and ethylene through pyrolysis to replace much of our demand for new plastic? He looked three years into the future, using his company’s latest figures on global pyrolysis investment, and gave an optimistic assessment. At best, the world could replace 0.2% of new plastic churned out in a year with products made through pyrolysis. ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.","filter_flag":1}
{"title":"How the Recycling Symbol Duped People into Buying More Plastic","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.scientificamerican.com%2farticle%2fhow-the-recycling-symbol-duped-people-into-buying-more-plastic%2f&c=6129259725169411232&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.scientificamerican.com%2farticle%2fhow-the-recycling-symbol-duped-people-into-buying-more-plastic%2f&c=6129259725169411232&mkt=en-us","summary":"The simplicity of the recycling symbol belies its complicated role in corporate America’s quest to sell ever more plastic ...","published":"Wed, 19 Jun 2024 06:59:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=19, tm_hour=6, tm_min=59, tm_sec=0, tm_wday=2, tm_yday=171, tm_isdst=0)","news_source":"Scientific American","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How the Recycling Symbol Duped People into Buying More Plastic","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The simplicity of the recycling symbol belies its complicated role in corporate America’s quest to sell ever more plastic ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.HMnbZPBP4U7RSb1rH5TByS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":466.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"It’s Earth Day 1990, and Meryl Streep walks into a bar. She’s distraught about the state of the environment. “It’s crazy what we’re doing. It’s very, very, very bad,” she says in ABC’s prime-time Earth Day special, letting out heavy sighs and listing jumbled statistics about deforestation and the hole in the ozone layer. The bartender, Kevin Costner, says he used to be scared, too — until he started doing something about it. “These?” he says, holding up a soda can. “I recycle these.” As Streep prepares to launch her beer can into the recycling bin, Costner cautions her, “This could change your life.” Recycling, once considered the domain of people with “long hair, granny glasses, and tie-dyed Ts,” as the Chicago Tribune described it at the time, was about to go mainstream. The iconic chasing-arrows recycling symbol, invented 20 years earlier, was everywhere in the early 1990s. Its tight spiral of folded arrows seemed to promise that discarded glass bottles and yellowing newspapers had a bright future, where they could be reborn in a cycle that stretched to infinity. As curbside pickup programs spread across the United States, the practice of sorting your trash would become, for many, as routine as brushing your teeth — an everyday habit that made you feel a little more responsible. On supporting science journalism If you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today. What no one anticipated was just how emotionally attached people would become to recycling as the solution to America’s ugly trash problem. When the chasing arrows’ promise of rebirth was broken, they could get angry. One cold winter day in 1991, people in Holyoke, Massachusetts, chased after garbage trucks, yelling for them to stop, after the drivers had nabbed their sorted glass, cans, and cardboard from the curb. Strained by an influx of holiday-related trash, the city had instructed workers to forgo recycling and just throw everything away. Today, the recycling icon is omnipresent — found on plastic bottles, cereal boxes, and bins loitering alongside curbs across the country. The chasing arrows, though, are often plastered on products that aren’t recyclable at all, particularly products made of plastic, like dog chew toys and inflatable swim rings. Last year, the Environmental Protection Agency said that the symbol’s use on many plastic products was “deceptive.” Recycling rules can be downright mystifying. For years, people were told pizza boxes were too greasy to be recycled, but now many recycling centers accept them. Some cities accept juice boxes lined with invisible layers of aluminum and plastic; others don’t. And do the screw-on caps stay on plastic bottles or not? Recycling experts ask people to do a “little bit of homework” to figure out what their local recycling system can handle, but since households have hundreds of items with different packaging to keep track of, that’s asking a lot. The resulting confusion has made a mess of recycling efforts. Plastic wrap tangles around sorting equipment at recycling facilities, shutting down operations as employees try to cut it out of the equipment. Huge bales of paper shipped overseas can contain as much as 30 percent plastic waste. “Contamination is one of the biggest challenges facing the recycling industry,” the EPA said in a statement to Grist. It takes time and money to haul, sort through, and dispose of all this unwanted refuse, which makes recycling more of a burden for city budgets. Many cities have ended up cutting costs by working with private waste companies; some don’t even bother trying at all. About a quarter of Americans lack access to any recycling services. The difficulty of recycling plastic can make the chasing-arrows symbol near meaningless, with environmental groups calling plastic recycling a “false solution.” Only around 5 percent of plastic waste in the United States gets shredded or melted down so that it can be used again. Much of the rest flows into landfills or gets incinerated, breaking down into tiny particles that can travel for thousands of miles and lodge themselves in your lungs. Plastics threaten “near-permanent contamination of the natural environment,” according to one study, and pose a global health crisis, with plastic chemicals linked to preterm births, heart attacks, and cancer. So where did the three arrows go wrong? The trouble is that their loop has ensnared us. If some recycling is good, the thinking goes, then more recycling is better. That creates enormous pressure for packaging to be made recyclable and stamped with the arrows — regardless of whether trying to recycle a glass bottle or plastic yogurt container made much sense in the first place. David Allaway, a senior policy analyst at the Oregon Department of Environmental Quality, says that the facts just don’t support the recycling symbol’s reputation as a badge of environmental goodness. “The magnetic, gravitational power of recycling,” he said, has led “policymakers and the public to just talk more and more and more about recycling, and less and less and less about anything else.” 1970s First Earth Day Rally April 22 1970 Belmont Plateau Fairmont Park Philadelphia Pennsylvania USA. H. Armstrong Roberts\/ClassicStock\/Getty Images In the spring of 1970, an estimated 20 million Americans — 10 percent of the population — showed up for the first Earth Day, taking part in rallies, marches, and teach-ins, calling for clean air and clean water. Pollution had pushed its way into the national conversation. The year before, oil-soaked debris had caught fire in the Cuyahoga River in Cleveland, sending flames towering five stories high, and a drilling accident in Santa Barbara had spread an oil slick over more than 800 square miles of water. Smog regularly clouded skies from Birmingham, Alabama, to Los Angeles, dimming cities in the middle of the day. The idea of recycling seemingly burst onto the scene in 1970. Earth Day organizers educated people about the value of sorting through their trash and advocated for community recycling programs. People would gather up their bottles and cans in plastic crates and bags and drive to designated sites to drop them off, sometimes earning a few bucks in return. “The environmental crisis has come into the public consciousness so recently that the word ‘recycle’ doesn’t even appear in most dictionaries,” the environmentalist Garrett De Bell wrote a couple weeks before the Earth Day event. He pitted recycling as “the only ecologically sensible long-term solution” for a country “knee-deep in garbage.” It wasn’t long before the concept acquired its signature symbol. At the time, Gary Anderson was finishing up his master’s degree in architecture at the University of Southern California. He came across a poster advertising a contest to design a symbol for recycling, sponsored by the Container Corporation of America, a maker of cardboard boxes. Inspired by M.C. Escher’s Möbius strip, Anderson spent just a couple of days coming up with designs using the now-famous trio of folded, rotating arrows. The simplest of his designs won, and Anderson was awarded a $2,500 scholarship in 1970. The Container Corporation quickly put the logo in the public domain, hoping it would be adopted on all recycled or recyclable products in order to “spread awareness among concerned citizens.” The Möbius loop he created soon passed from his mind. “I just didn’t really think of the symbol that much,” he recalls. “It wasn’t used very much in the first couple of years.” One day several years later, however, Anderson was wandering through the streets of Amsterdam in the haze of jet lag when he came across a row of oversized bins emblazoned with a beach ball-sized version of his logo. The Netherlands, purportedly, was the first country to launch a nationwide recycling program in 1972. “It just really shocked me into a realization that there must be something about this symbol,” he said. Refashioning old materials into new things is a longstanding American tradition. Paul Revere, folk hero of the American Revolution, collected scrap metal and turned it into horseshoes. In the 19th century, used rags were turned into paper, and families stitched together scraps of fabric to create quilts. The desperation of the Great Depression taught people to make underwear out of cotton flour sacks, and the propaganda posters of World War II positioned recycling as a patriotic duty: “Prepare your tin cans for war.” “It was not in our DNA to be this wasteful,” said Jackie Nuñez, the advocacy program manager at the Plastic Pollution Coalition, a communications nonprofit. “We had to be trained, we had to be marketed to, to be wasteful like this.” One of the first lessons of “throwaway society” came in the 1920s, when White Castle became the first fast-food restaurant to sell its burgers in single-use bags, advertising them as clean and convenient. “Buy ’em by the sack,” the slogan went. In 1935, the big breweries that survived the Prohibition era started shipping beer in lighter, cheaper-to-transport steel cans instead of returnable glass bottles. Coca-Cola and other soda companies eventually followed suit. All those paper sacks and cans soon littered the sides of American roadways, and people started calling on the companies that created the waste to clean it up. Corporations responded by creating the first anti-litter organization, Keep America Beautiful, founded in 1953 by the American Can Company and the Owens-Illinois Glass Company. Keep America Beautiful’s advertisements in the 1960s looked like public service announcements, but they subtly shifted the blame for all the garbage to individuals. Some featured “Susan Spotless,” a girl in a white dress who would wag her finger at anyone who soiled public spaces with their litter. The pressure on American businesses didn’t go away, though. On the Sunday after Earth Day in April 1970, some 1,500 protesters showed up at Coca-Cola’s headquarters in Atlanta to dump hundreds of cans and glass bottles at its entrance. Two years later, Oregon passed the country’s first “bottle bill” requiring a 5-cent deposit on bottles and cans sold in the state, incentivizing people to return them, while Congress was considering banning single-use beverage containers altogether. Manufacturers successfully lobbied against a federal ban, arguing that jobs would be lost, as the historian Bartow J. Elmore recounts in the book Citizen Coke: The Making of Coca-Cola Capitalism. But corporations still wanted to relieve the public pressure on them and outsource the costs of dealing with the waste they were creating. Luckily for them, recycling was in vogue. In New York City, the war on waste was spearheaded by the Environmental Action Coalition, an organization raising funds for its “Trash Is Cash” community recycling program, with the long-term goal of getting recyclables picked up by city workers outside homes. Curbside recycling seemed to serve everyone’s interest: Environmentalists wanted to waste less, and companies could use it as an opportunity to shift the cost of dealing with waste onto city governments. Businessmen who volunteered with the Environmental Action Coalition solicited millions in donations from their colleagues in the 1970s, writing that recycling had “substantial promise” to fend off any legislation to ban or tax single-use containers. The campaign was a deliberate attempt to divert attention from more meaningful solutions like bottle bills, yet environmental groups embraced it, according to Recycling Reconsidered, a 2012 book by Samantha MacBride, who worked in New York City’s sanitation department for two decades. The New York City Council started its mandatory curbside pickup program in the late 1980s, several years after the first one began in Woodbury, New Jersey, requiring residents to set out their paper, metal, glass, and some types of plastic in bins at the curb. The idea picked up in cities across the country, with the number of curbside programs growing from 1,000 to 5,000 between 1988 and 1992, spreading the chasing arrows along with them. A woman recycling in Vermont, US, August 1980. Alfred Gescheidt\/Getty Images “It was in the late ’80s and early ’90s that this thing just becomes everywhere,” said Finis Dunaway, a professor of history at Trent University in Canada. America was running out of places to put its trash, a dilemma captured by the story of a nomadic garbage barge in 1987. In March of that year, a barge teeming with 6 million pounds of trash left Long Island, New York, looking to unload its freight where the landfills weren’t already full. States from North Carolina to Louisiana turned it away, and the barge spent months traveling around the Atlantic coast — all the way to Mexico, Belize, and the Bahamas — looking for a place to dispose of the garbage. In October, the barge made its way back to Brooklyn, where a court ordered that its contents be incinerated — but not before Greenpeace activists hung a giant banner on the boat: “NEXT TIME … TRY RECYCLING.” Annie Leonard, the former executive director of Greenpeace, told PBS Frontline in 2020 that she wonders whether that banner was a mistake. “I think we were overly optimistic about the potential of recycling,” she said, “and perpetuating that narrative led us astray.” There’s an iconic scene in the 1967 movie The Graduate, in which Dustin Hoffman’s character, Benjamin Braddock, gets cornered at his college graduation party by one of his parents’ friends. “I just want to say one word to you, just one word: plastics,” the older man says. “There’s a great future in plastics. Think about it.” One generation’s earnest advice for a successful career clashed with a new, skeptical attitude toward plastic, which had already become a byword for “fake.” By the early 1970s, scientists had learned that whales, turtles, and other marine life were getting tangled up in plastic debris, a problem that was killing 40,000 seals a year. They knew, too, that small plastic fragments were making their way into the ocean, and that plastic residues had entered people’s bloodstreams, presenting what an official from President Richard Nixon’s Council of Environmental Quality deemed a significant health threat, “potentially our next bad one.” The more people learned, the more plastic’s reputation transformed from all-purpose, indestructible wonder into something that maybe shouldn’t be trusted in your new microwave. Between 1988 and 1989, the percentage of Americans who believed plastic was damaging the environment rose from 56 to 72 percent. Larry Thomas, the president of the Society of Plastics Industry, warned in an internal memo that companies were starting to lose business, writing, “We are approaching a point of no return.” Beverage companies and the oil industry hoped to advertise their way out of the PR problem, laying out plans to spend $50 million a year to tout the polymer’s virtues with slogans like “plastics make it possible.” They also turned to recycling. Lewis Freeman, the former vice president of government affairs at the Society of the Plastics Industry, an industry group, told Grist that he has a vivid memory of a colleague coming into his office, saying, “We’ve got to do something to help the recyclers.” Freeman tasked the Plastic Bottle Institute — made up of oil giants like BP and Exxon, chemical companies, and can manufacturers — with figuring out how to clarify to recycling sorters what kind of plastic was what. In 1988, they came up with the plastic resin code, the numbering system from 1 to 7 that’s still in place. Polyethylene terephthalate, or PET (1), is used to make soft drink bottles; high-density polyethylene (2) is used for milk jugs; polyvinyl chloride (3) is used for PVC pipes in plumbing, and so on all through 7, the catch-all category for acrylic, polycarbonate, fiberglass, and other plastics. The Plastic Bottle Institute surrounded these numbers with the chasing arrows logo, giving the public the impression that they could throw all kinds of plastics into recycling bins, whether there was infrastructure to process them or not. The Connecticut Department of Environmental Conservation warned that the confusion it would cause “will have a severe impact on the already marginal economic feasibility of recycling plastics as well as on recycling programs as a whole.” Once the symbol was operational, Freeman said, “then everybody started putting it on everything.” Companies worked to make it official: Starting in 1989, the Plastic Bottle Institute lobbied for state laws mandating that the code numbers appear on plastic products. Their express purpose was to fend off anti-plastic legislation, according to documents uncovered by the Center for Climate Integrity. The laws eventually passed in 39 states. By the mid-1990s, the campaign to “educate” the public about plastic recycling had succeeded: Americans had a more favorable opinion of plastic, and efforts to ban or restrict production had died down. But recycling rates — the share of materials that actually get reprocessed — had barely improved. Instead, the United States started exporting plastic waste to China, where turning old plastic into new materials helped meet growing demand from manufacturers. Polling conducted for the American Plastics Council in 1997 showed that people who worked in waste management were losing hope that plastics could be recycled, while the public, journalists, and government officials believed they could be recycled at unrealistically high rates. The problem was, fulfilling what companies called the “the urgent need to recycle” wasn’t as easy as the advertisements made it look. For decades, industry insiders expressed serious doubts that recycling plastic would ever be profitable, with one calling the economic case “virtually hopeless” in 1969. There are thousands of plastic products, and they all need to be sorted and put through different processes to be turned into something new. The way packaging is molded — blown, extruded, or stamped — means that even the same types of plastic can have their own melting points. A PET bottle can’t be recycled with the clear PET packaging that encases berries. A clear PET bottle can’t be recycled with a green one. The plastics that do happen to get sorted and processed can only be “downcycled,” since melting them degrades their quality. Recycled plastic, it turns out, is more toxic than virgin plastic, liable to leach dangerous chemicals, so it can’t safely be turned into food-grade packaging. It’s also more expensive to produce. The result of this morass is that there is virtually no market for recycled plastics beyond those marked with 1s and 2s; the rest are incinerated or sent to landfills. Only 9 percent of the plastics ever produced have gone on to be recycled. As plastic waste piled up and public frustration mounted, the Sustainable Packaging Coalition — backed by corporate giants including Procter and Gamble, Coca-Cola, and Exxon Mobil — launched a bigger, more specific recycling initiative in 2008 called “How2Recycle.” It came with new labels that appeared to provide clarity about which elements of a product could be recycled, distinguishing between plastic wrap and coated trays, sometimes qualifying the recycling logo with “store drop-off” labels for plastic bags and film. But environmental advocates say that the How2Recycle labels, used by more than a third of the companies that package consumer goods, may be even more misleading than the resin code. For example, plastic yogurt containers made of polypropylene, number 5s, are considered “widely recyclable” under the system, yet only 3 percent of all the polypropylene containers produced actually get recycled. The plastic resin code with the chasing arrows certainly confused people — 68 percent of Americans surveyed in 2019 said they thought anything labeled with the code could be recycled. But the How2Recycle labels “put the lies on steroids,” said Jan Dell, the founder of the nonprofit The Last Beach Cleanup. It’s not just a tiny triangular indent on the bottom of a container anymore, but a large, high-contrast recycling logo that “stares you in the face.” Given the dismal state of plastic recycling, it might seem like the best thing to do is throw the chasing arrows in the garbage. But not all recycling is a failure. “Metals are the true success story,” said Carl Zimring, a waste historian at the Pratt Institute in Brooklyn. As much as three-quarters of all the aluminum that’s ever been produced is still in use, he said. Paper is also relatively easy to process, with more than two-thirds making its way into new products in the U.S. Even for a recycling standby like glass, though, less than a third gets broken down into fragments for new jars and bottles. The recycling logo still gives anything it touches — whether feasible to recycle or not — a green aura. Surveys show that a majority of Americans believe recycling is one of the most effective ways they can fight climate change, when experts say it’s unlikely to make much of a difference in reducing greenhouse gas emissions. That’s a credit to the iconic triangle, which has had 50 years to entrench itself in our culture. “It’s easy to bash on the image, or bash on corporations, without seeing this as something that is very powerful,” said Dunaway, the environmental historian. So is there a way to give the recycling symbol meaning again? When recycling started taking off in the early 1990s, there was no definitive, agreed-upon definition of what it meant. “Anything is recyclable, at least theoretically,” one lawyer pointed out in a legal journal in 1991. The effort to impose some sort of order came from California, often the national laboratory for environmental protection. The state passed the country’s first restrictions on green claims in 1990, prohibiting advertisers from using terms like “ozone-friendly” and “recyclable” on items that didn’t meet its standards (though that stipulation didn’t survive a challenge in court). Wider efforts to restrict the symbol, however, lacked strength and enforcement. In 1992, the Federal Trade Commission told advertisers they could call a product “recyclable” even if only 1 percent of their product was recycled. Not much else happened on that front until 2013, when the group that administers the plastic resin code, ASTM International, announced that it was replacing the chasing arrows with a solid triangle to reduce public confusion. It didn’t require manufacturers to rework their labels, though. A mountain of trash in 2010 in Sausalito, CA, United States. John Lund\/Getty Images Today, that might finally be changing. When China banned the import of most plastics in 2018, it revealed problems that had long remained hidden. The United States had been shipping 70 percent of its plastic waste to China — 1.2 billion pounds in 2017 alone. States set about finding ways to fix the recycling system, with some focusing on the confusion generated by the symbol itself. In 2021, California — the world’s fifth-largest economy — passed a “truth in labeling” law prohibiting the use of the chasing arrows on items that are rarely recycled. To pass the test, 60 percent of Californians need to have access to a processing center that sorts a given material; on top of that, 60 percent of processors have to have access to a facility that will remanufacture the material into something else. Though the bill faced opposition from companies right until it passed, the idea resonated with legislators, said Nick Lapis, the director of advocacy at Californians Against Waste. “It was pretty easy to understand that putting the chasing arrows symbol on a product that is not ever going to get recycled is not fair to consumers. Like, it just made so much intuitive sense that I think it kind of went beyond the lobbyist politics of Sacramento.” Across the country, public officials in New York, New Jersey, Massachusetts, Illinois, Minnesota, and Washington state are considering similar legislation. This spring, Maine passed a law to incentivize companies to use accurate recycling labels on their packaging. New rules around the recycling logo are also brewing at the national level. Last April, Jennie Romer, the EPA’s deputy assistant administrator for pollution prevention, called for the FTC to put an end to the “deceptive” use of the iconic chasing arrows on plastics in its upcoming revisions to the Green Guides for environmental marketing claims. “There’s a big opportunity for the Federal Trade Commission to make those updates to really set a high bar for what can be marketed as recyclable,” Romer told Grist. “Because that symbol, or marketing something as recyclable, is very valuable.” Once California’s law goes into effect next year, state laws will clash with each other, since many states still require the resin numbers on plastic packaging. “The question on everyone’s mind is, who’s going to win out?” said Allaway, the Oregon official. Talk of truth-in-labeling legislation has coincided with another trend — states trying to turn the costs for dealing with waste back on the manufacturers that produced it. Laws requiring “extended producer responsibility,” or EPR, for packaging have already been approved in Maine, Oregon, California, and Colorado. It’s already led to problems in California, since the EPR bill refers to the state’s truth-in-labeling law to determine which materials can be recycled, creating incentives for everything to be labeled as recyclable, Dell said. Even if the Federal Trade Commission updates the Green Guides to prohibit the deceptive use of the recycling symbol, it doesn’t change the fact that the guides are just suggestions. They don’t carry the weight of law. “The FTC itself has never enforced a false recyclable label, ever, ever, on plastics, not once,” Dell said. One of Dell’s favorite metaphors: “It’s the wild, wild West of product claims and labeling, with no sheriff in town.” So Dell has appointed herself de facto sheriff, suing companies over their false claims. In 2021, her organization reached a settlement with TerraCycle, Coca-Cola, Procter & Gamble, and six other companies that agreed to change labels on their products. Dell recently filed a shareholder proposal with Kraft Heinz in an attempt to force it to remove recyclability claims from marshmallow bags and mac-and-cheese bowls destined for the landfill. Another promising legal push is coming from California Attorney General Rob Bonta, who has been investigating fossil fuel and chemical companies for what he called “an aggressive campaign to deceive the public, perpetuating a myth that recycling can solve the plastics crisis.” Despite mounting awareness of plastic’s threat to public health, oil and chemical companies around the world make 400 million metric tons of the polymer every year, and production is on track to triple by 2060. It’s the oil industry’s backup business plan in the expectation that wealthy countries will shift away from gasoline in an effort to tackle climate change, since petroleum is the basic building block of plastics. Exxon Mobil, the world’s third-largest oil producer, ranks as the top plastic polymer producer. Stricter enforcement around the use of the chasing arrows could lead to more accurate labels, less public confusion, and better outcomes for recycling centers. But it’s worth asking whether more recycling should even be the goal, rather than solutions that are much better for the environment, like reducing, reusing, refilling, and repairing. As Anderson, the symbol’s inventor, says, “I don’t think it’s really fair to blame a graphic symbol for all of our lack of initiative in trying to do better.” This story was originally published by Grist, a nonprofit media organization covering climate, justice, and solutions.","filter_flag":1}
{"title":"Inside the Industry Push to Label Your Yogurt Cup ‘Recyclable’","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fgizmodo.com%2fgateway%2finside-the-industry-push-to-label-your-yogurt-cup-recy-1849652108&c=6882283067572922517&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fgizmodo.com%2fgateway%2finside-the-industry-push-to-label-your-yogurt-cup-recy-1849652108&c=6882283067572922517&mkt=en-us","summary":"Even if PP products were technically accepted by facilities that serve a majority of Americans — which researchers say they are not — polypropylene is much more commonly landfilled or incinerated than ...","published":"Tue, 18 Jun 2024 05:14:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=18, tm_hour=5, tm_min=14, tm_sec=0, tm_wday=1, tm_yday=170, tm_isdst=0)","news_source":"Gizmodo","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Inside the Industry Push to Label Your Yogurt Cup ‘Recyclable’","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Even if PP products were technically accepted by facilities that serve a majority of Americans — which researchers say they are not — polypropylene is much more commonly landfilled or incinerated than ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.YixtM8q2AjdHA7Gpne906y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":200.0,"news_imagemaxheight":200.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"This story was originally published by Grist. You can subscribe to its weekly newsletter here. Plastic recycling labels are everywhere: The ubiquitous “chasing arrows” symbol adorns everything from plastic bags and water bottles to kids’ toys. Most commonly, these symbols appear with a number — 1 through 7 — that identifies the type of plastic resin a product is made of. A number 1, for instance, corresponds to polyethylene terephthalate, or PET — the stuff that makes up water bottles. Number 6 is for polystyrene, used in foam cups and trays. The plastics industry insists these icons were never meant to indicate a product’s recyclability, even though that is how they are often perceived by consumers. In fact, most plastics are not recyclable, largely because there is no market for materials labeled 3 through 7. But that hasn’t stopped the widespread use of the chasing arrows. With no federal program to evaluate products’ recyclability and issue labels for them, third-party organizations have stepped in to play this role instead. One organization in particular, How2Recycle, has devised an elaborate hierarchy with several versions of its own recycling symbol, which it sells to hundreds of companies ranging from Lowe’s to Beyond Meat. The organization, whose parent nonprofit is based in Virginia, says it analyzes waste management systems nationwide to figure out whether companies’ products and packaging are recyclable and then issues a corresponding label. It’s ostensibly an attempt to clear up confusion among consumers about what should and shouldn’t go into the blue bin. The group describes its markers as “recycling labels that make sense.” This summer, How2Recycle declared a big victory for the companies it sells labels to: It now considers a wide set of products made from polypropylene, or PP — the resin corresponding to the number 5 — to be “widely recyclable,” meaning the organization thinks that more than 60 percent of Americans have access to a curbside or drop-off recycling program that accepts them. Polypropylene accounts for about 14 percent of the U.S.’s plastic production. The announcement makes polypropylene tubs, bottles, and jars — things like yogurt containers and ketchup bottles — eligible for How2Recycle’s top-tier recycling label: a chasing arrows symbol with no qualifications. But industry experts and environmental advocates have raised their eyebrows. Based on federal recycling data, independent national waste management surveys, and firsthand accounts from material sorting facilities, polypropylene recycling isn’t nearly as widespread as How2Recycle’s labeling implies. Even if PP products were technically accepted by facilities that serve a majority of Americans — which researchers say they are not — polypropylene is much more commonly landfilled or incinerated than turned into new products. This is because it is often filled with toxic chemical additives or contaminated with food waste, both of which make it difficult to turn it into new products. It’s usually less economical to sort out polypropylene for recycling than to simply discard it and make new products from virgin material. “Post-consumer PP packaging and products have never been recyclable or recycled … above a few percent,” said Jan Dell, an independent chemical engineer and founder of the advocacy group The Last Beach Cleanup. Through How2Recycle, she said, plastic and packaging companies are “creating their own non-verified data” and ignoring key provisions of the Federal Trade Commission’s Green Guides, a set of requirements meant to prevent companies from making deceptive claims about the environmental benefits of their products. As a result, Dell said, the industry has been allowed to deepen the public’s confusion about recycling, gulling people and policymakers into thinking that it will be able to keep pace with plastic manufacturers’ plans to dramatically scale up production. How2Recycle is part of a labyrinth of organizations and industry membership programs that promote “sustainable materials management.” When it officially launched in 2012, the organization branded itself as an attempt to clear up confusion among consumers about what they could recycle. Many companies — including Yoplait, Costco, REI, and Microsoft — were quick to sign on, eager to affix How2Recycle’s labels to their products. The program took the onus off of individual companies for claims about recyclability. How2Recycle would do all the necessary research into specific products’ recycling rates and community access to recycling programs, allowing participants to rest assured that their recycling labels were compliant with federal law. Today, more than 400 companies pay annual membership fees to place How2Recycle labels on their packages, including Amazon, Clif Bar, Walmart, Johnson & Johnson, and Starbucks. At the top of How2Recycle’s labeling hierarchy is a simple “chasing arrows” recycling symbol, which the organization gives to products that it says are accepted by curbside or drop-off recycling programs that serve at least 60 percent of the American population. This is the label that How2Recycle said in late July some polypropylene products would now be eligible for. Previously, in 2020, the organization had downgraded PP products from the unqualified chasing arrows to a “Check Locally” label that instructed consumers to verify whether their community’s recycling program would accept them. “As rigid polypropylene access, sortation, and end markets are on an upward trend across the U.S., we are excited to upgrade this packaging format,” Caroline Cox, How2Recycle’s director, said in a press release this summer. However, other sources paint a very different picture of the United States’ plastic recycling landscape — especially for polypropylene, which is far more difficult to turn into new products than How2Recycle’s labels make it seem. “It is not possible that 60 percent of Americans have access to established recycling systems that accept PP packaging of any type,” Dell, of The Last Beach Cleanup, said. First, she explained, industry data suggests that only 60 percent of Americans have access to any recycling program, let alone one that accepts polypropylene containers. Most facilities only accept plastics that are easier to recycle, such as bottles made of PET. And additional data that Dell is compiling for 2022 shows that only half of the country’s 373 material recovery facilities, or MRFs — specialized plants that process and sort all the items people toss in their blue bins — say they accept polypropylene tubs, one of the most recyclable PP products out there (think margarine containers and cottage cheese cups). As a result, only 28 percent of Americans have access to recycling programs that accept these polypropylene containers. “Overall accessibility for plastic recycling has dropped, if anything,” said John Hocevar, Greenpeace’s oceans campaign director. In recent years, labor shortages and high prices for recycled materials have caused cuts in curbside recycling programs, and many MRFs have stopped accepting most plastic resins. What’s more, Hocevar and others argue that the accessibility of recycling programs is a distraction from a more important metric: the real recycling rate. Just because polypropylene is collected doesn’t mean it will ultimately be recycled. According to the most recent available data from the Environmental Protection Agency, only 2.7 percent of polypropylene “containers and packaging” were recycled in 2018. If you include all forms of polypropylene, that number falls to just 0.6 percent. One reason PP is difficult to recycle is that it’s not as clean or pure as other kinds of plastic. Unlike products made from PET or high-density polyethylene (HDPE) — labeled with the numbers 1 and 2, respectively — polypropylene products, labeled with the number 5, often contain toxic additives that make it difficult to turn them back into usable items. Another reason is that PP is typically collected in bales of mixed plastic that include a variety of resins labeled with the numbers 3 through 7. In order to be recycled, PP must be picked out of these bales and then sold to an extremely limited number of facilities that will actually accept that plastic. (​​In 2020, Greenpeace estimated that the U.S. only had enough processing capacity to recycle less than 5 percent of its PP waste.) The whole process is prohibitively expensive, especially since the final product must be competitively priced against virgin plastics. According to the EPA, the U.S. generated more than 8 million tons of polypropylene waste in 2018, the most recent year for which data are available. Jeff Donlevy, a member of California’s Statewide Commission on Recycling Markets and Curbside Recycling and general manager of Ming’s Recycling, a company based in northern California, said that many facilities continue to accept polypropylene — even if they have no intention of recycling it — because of outdated, 10-or-more-year contracts with cities. At the time when many of these contracts were signed, MRFs said they would accept polypropylene because they could send mixed plastic bales to China for sorting and recycling. But in 2018, when China enacted its “National Sword” policy and closed its borders to most plastic waste imports, U.S. MRFs were saddled with a glut of resins that are uneconomical and logistically difficult to turn into new products. Of the roughly 80 MRFs in California, Donlevy said the vast majority are not recycling plastics made of resins labeled number 3 and above. This includes polypropylene, number 5. Most facilities are “just landfilling whatever number 5 they get,” he said. How2Recycle says on its website that it takes four factors into account when determining a product’s recyclability — collection, sortation, reprocessing, and end markets — but it is not transparent about the exact methodology it uses to evaluate these criteria. Much of its data comes from an industry report conducted by How2Recycle’s parent organization that looks at a “non-random” sample of large recycling programs throughout the U.S., along with a random sample of recycling programs in smaller communities. In the most recent edition of the report, these censuses consisted of web searches for each recycling program to determine what kinds of plastic they accept. Environmental advocates question the results of these analyses, but they say the larger issue is that How2Recycle fails to say anything about the real recycling rate of PP products. Again, the “widely recyclable” label is only supposed to reflect a material’s acceptance by curbside and drop-off recycling programs. But this information is not printed on the organization’s unconditional recycling labels. Donlevy said this oversight “misleads the public.” It may also contravene sustainable packaging guidelines from the Federal Trade Commission, or FTC, a government agency that promotes consumer protection. By slapping recycling labels without qualifiers onto polypropylene tubs and other containers, How2Recycle appears to be ignoring key provisions of the FTC’s Green Guides, a set of detailed but nonbinding requirements for claims about products’ environmental benefits. The U.S. government does not have a program to issue or approve recycling labels, so this is the primary check for labels created by private groups. At the broadest level, the FTC says it is deceptive to “misrepresent, directly or by implication, that a product or package is recyclable.” This means that companies should not use a recycling label without qualifiers — like How2Recycle’s gold standard chasing arrows symbol — unless they can prove that recycling facilities for their labeled products are available to at least 60 percent of consumers. Critically, the commission also calls on companies to substantiate that these facilities “will actually recycle, not accept and ultimately discard” labeled products. Marketers “should not assume that consumers or communities have access to a particular recycling program merely because the program will accept a product,” the FTC says in the Green Guides’ statement of basis and purpose. Although the guides aren’t legally binding, activity that is inconsistent with them can be used as evidence of a violation of the FTC Act’s provisions on “Unfair or Deceptive Acts or Practices” and can result in fines or additional rulemaking. State governments can also cite the Green Guides when building false advertising or consumer protection cases. Dell lamented that the FTC has never, to her knowledge, taken action to stop a company from misusing an unqualified recycling label. But courts have. Take, for example, a 2018 lawsuit filed by a consumer against Keurig over claims that the company’s polypropylene coffee pods were “recyclable.” Keurig argued that its labels were consistent with the Green Guides, but a U.S. District Court in California disagreed and refused to dismiss the case. The court said that even if the coffee pods were technically collected by municipal recycling programs, they were not in practice being recycled. Keurig settled the case this year for $10 million and has changed the labels on its coffee pods. Greenpeace argues that How2Recycle is using similar sleight with its own labels, claiming recyclability with insufficient substantiation. “Polypropylene does not come close to meeting the requirements” for recycling labels laid out by the FTC, the organization said in a press release. It is neither accepted at recycling facilities that serve 60 percent of the population nor actually recycled at a significant rate. In response to Grist’s request for comment, Paul Nowak — executive director of How2Recycle’s parent organization, GreenBlue — said that How2Recycle’s labels not only satisfy the Green Guides’ requirements but “go beyond them.” Although How2Recycle does not have internal data on the real recycling rate for polypropylene, Nowak said How2Recycle has reviewed “letters of support” from MRFs saying that they plan to expand their recycling capacity for polypropylene. Nowak declined to share these letters with Grist. How2Recycle’s website offers some clarification. Although the organization claims to consider “sortation” and “reprocessing” for products that will feature its labels, How2Recycle explains online that it ultimately does not take into account the real-world recycling rate when evaluating a product’s recyclability — in contrast to definitions of recyclability from other organizations, like the Ellen MacArthur Foundation, an international nonprofit that advocates for a circular economy. Nowak insists that How2Recycle spent “several months” verifying data on the increased recyclability of polypropylene. But Dell thinks there’s an irresolvable conflict of interest at play, since How2Recycle and the organizations whose data it cites are run and funded by companies that make and sell plastics. “We’ve got all these front groups funded by the plastics and products industry to create and perpetuate the myth that plastics are recyclable,” she said. The recent push to make polypropylene “widely recyclable” started outside How2Recycle, with a separate industry group called the Recycling Partnership — a nonprofit whose board of directors includes executives for major brands and plastic industry groups: Keurig Dr. Pepper, Nestlé, the Association of Plastic Recyclers, and the American Beverage Association, among others. The organization lists roughly 80 “funding partners” on its website, including two of North America’s main petrochemical industry trade groups, the American Chemistry Council and the Plastics Industry Association. In 2020, a few months after How2Recycle downgraded PP products to only be eligible for the “Check Locally” label, the Recycling Partnership launched a new initiative — directly funded by many plastic brands and industry trade groups — to “ensure the long-term viability of polypropylene.” The Recycling Partnership claims it contributed to a spike in polypropylene recycling over the past two years through a series of 24 grants worth $6.7 million. The group did not respond to Grist’s request for more information, but a press release notes that the funding helped “support sorting improvements and community education across the U.S.” According to the Recycling Partnership, these grants increased the amount of polypropylene recovered by 25 million pounds annually. Now, the group says its proprietary “National Recycling Database” shows 65 percent of Americans having access to PP recycling. According to Nowak, the Recycling Partnership approached How2Recycle with this data in early 2022, requesting that How2Recycle reevaluate its labeling for polypropylene. After what Nowak described as a lengthy evaluation process, he said the data matched what he was seeing with How2Recycle’s own analysis, as well as information provided by an outside consulting firm. In response to Grist’s request for comment, the consulting firm said it provided How2Recycle with access-to-recycling data and “end market” research to show there is a market for polypropylene that ultimately does get recycled. The firm did not share data on polypropylene’s real recycling rate and told Grist to reach out to the Recycling Partnership. How2Recycle, meanwhile, has its own web of connections to big brands and the plastics industry. The group’s parent organization, the Sustainable Packaging Coalition, is an industry working group whose members include Procter and Gamble, Coca-Cola, and the ExxonMobil Chemical Company, as well as a host of other plastic makers. GreenBlue, the umbrella organization that houses How2Recycle and the Sustainable Packaging Coalition, has a board of directors that includes executives from the Dow Chemical Company, Mars, the packaging companies Printpack and Westrock, and more. Nowak said he is aware of concerns over potential conflicts of interest, but that How2Recycle’s parent organizations are “very careful about who we start to work with.” At How2Recycle, he added, “we stay neutral in all that.” Dell has often spoken of the plastic labeling landscape as the “wild, wild West,” with “no sheriff in town” to protect consumers from deceptive recycling claims. The FTC, whose Green Guides may soon be updated for the first time since 2012, declined to comment on How2Recycle’s labeling system, and environmental advocates have expressed frustration that the commission hasn’t done more to enforce the guidelines. Without stronger government regulation, Dell said, “How2Recycle and the product companies have filled the void to become the deciders” of what should and shouldn’t bear the recycling label. But states are catching on. California passed nation-leading legislation last year making it illegal for companies to use the chasing arrows on products that are not actually being turned into new products. (In this case the state, rather than How2Recycle, will determine recyclability, and it will take into account both collection and the real recycling rate.) The law is expected to eliminate recycling symbols on virtually all plastic packaging that isn’t made of number 1 or number 2 resins, since those are the only kinds of plastic currently being recycled with significant regularity. It could have an impact on other states, too — if plastic manufacturers decide it is too cumbersome to create new product lines for the California market, they could decide to remove recycling symbols for the whole country. Hocevar of Greenpeace said the California bill is an important step in the right direction and called on other states to adopt similar policies. Environmental advocates have also cheered a separate effort from the California attorney general’s office, which announced in April that it was launching an investigation into the petrochemical industry’s “aggressive campaign to deceive the public” about the feasibility of recycling. To truly address the plastic pollution crisis, Hocevar and others say that the top priority should be turning off the tap — limiting the production of plastic that ultimately has to be dealt with. In the U.S., perhaps the most promising move in this direction is the proposed Break Free From Plastic Pollution Act, a far-reaching federal bill that would ban carryout plastic bags and other single-use plastic products, require plastics companies to launch and finance programs to manage the waste they produce, and place a moratorium on new petrochemical facilities until the EPA can undertake a comprehensive assessment of the industry’s environmental impact. In the meantime, Donlevy said that companies should stop trying to trick consumers into feeling good about their plastic consumption. “Producers have to realize they’re using plastic for their benefit and for the consumers’ benefit, which is fine,” he said. “But to put a recycling symbol and say that that cottage cheese or cream cheese or sour cream container is recyclable? You don’t need to do that, that’s not a part of the sales pitch. … The only plastics that are really getting recycled in the U.S. are number 1 and number 2 bottles.”","filter_flag":1}
{"title":"TCL introduces smart home energy solutions to make clean energy more accessible","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.pv-magazine.com%2f2024%2f06%2f25%2ftcl-introduces-smart-home-energy-solutions-to-make-clean-energy-more-accessible%2f&c=18139322889039110362&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.pv-magazine.com%2f2024%2f06%2f25%2ftcl-introduces-smart-home-energy-solutions-to-make-clean-energy-more-accessible%2f&c=18139322889039110362&mkt=en-us","summary":"What improvements to energy yield and efficiency have been realized in these new products? William Li ... to promote sustainable projects and contribute to the global low-carbon environmental ...","published":"Mon, 24 Jun 2024 17:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=17, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"pv magazine International","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TCL introduces smart home energy solutions to make clean energy more accessible","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"What improvements to energy yield and efficiency have been realized in these new products? William Li ... to promote sustainable projects and contribute to the global low-carbon environmental ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.kkYEqgcC8DTzfyq6nion5y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":356.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"What technological advancements are featured in TCL’s new n-type TOPCon cell and PV modules? William Li: Our new PV modules, spanning residential, commercial, and industrial sectors, feature advanced n-type G12R TOPCon cells. These cells are highly efficient, generate more power, and resist heat and light degradation. They have a low degradation rate of 0.40% and a low-temperature coefficient of -0.29%\/℃, ensuring superior performance over 30 years. Three-Cuts Technology enhances reliability by reducing internal power loss and hot spot risks. The overlapping cells eliminate inactive zones, boosting output and improving performance under shading. What improvements to energy yield and efficiency have been realized in these new products? William Li: Our new products enhance energy yield and efficiency through advanced PV module technology and the all-in-one TCL Home app. The n-type G12R TOPCon cells and the Three-Cuts Technology boost performance by minimizing power loss and eliminating inactive zones, resulting in module efficiencies of 23.2% and sustained high energy output of 730 W. It allows real-time monitoring and intelligent control, maximizing solar energy utilization and reducing waste. TCL is probably the only vendor in the residential market that provides the same brand products with one management system to reduce the complexity for installers and individual consumers. How does TCL’s Smart Home Energy Solution help homeowners lower their levelized cost of energy (LCOE)? William Li: TCL’s Smart Home Energy Solution lowers LCOE by integrating solar panels, energy storage, heat pumps, and smart EV charging into one cohesive system. The TCL Home app optimizes energy usage, reducing waste. Our peak-valley arbitrage feature allows the system to store electricity when prices are low and use or sell it when prices are high, maximizing savings. High-quality components ensure long-term reliability and lower maintenance costs. The efficient design of our heat pumps increases air volume and heat exchange efficiency, further reducing energy consumption and costs. Additionally, TCL Home manages home appliances, enabling smart energy management that aligns with appliance demand to achieve individual LCOE targets. How do the new solutions integrate technologies for owners of electric vehicles? William Li: TCL’s new solutions integrate EV technologies by offering smart chargers that balance charging power during peak hours and prevent overloading. Users can set accurate charging times via their mobile phones and manage everything through the TCL Home app. We ensure eco-friendly charging by using stored solar energy, reducing the carbon footprint and costs. Our advanced communication systems support multiple communication modes and international protocols, enhancing efficiency and user experience. How will the partnership between TCL PV Tech and BNP Paribas benefit homeowners? William Li: BNP Paribas Group's cooperation with TCL Group started in 2004. TCL is a global strategic client of BNP Paribas Group, one of TCL's main commercial banks in the European region. The breakthrough in consumer finance products between TCL PV Technology and Consors Finanz, a brand of BNP Paribas Personal Finance, is not only a further strengthening of the relationship at the strategic cooperation level, but also a joint effort to promote sustainable projects and contribute to the global low-carbon environmental protection cause. Additionally, TCL will design tailor-made solutions for homeowners with the best cost-effective offering, the simplest user interface via TCL Home, and the most reliable services to benefit homeowners and installers, as well as our channel partners. The questions and responses in this sponsored interview article were provided by TCL PV Technology.","filter_flag":1}
{"title":"Jolly Green Giants: The 7 Best ESG Stocks to Buy Now","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fjolly-green-giants-the-7-best-esg-stocks-to-buy-now-1033477339&c=2944306204389306473&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fjolly-green-giants-the-7-best-esg-stocks-to-buy-now-1033477339&c=2944306204389306473&mkt=en-us","summary":"Stock Market News, Stock Advice & Trading Tips At first glance, the idea of environmental, social and governance (ESG) ...","published":"Thu, 13 Jun 2024 09:18:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=13, tm_hour=9, tm_min=18, tm_sec=0, tm_wday=3, tm_yday=165, tm_isdst=0)","news_source":"Business Insider","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Jolly Green Giants: The 7 Best ESG Stocks to Buy Now","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Stock Market News, Stock Advice & Trading Tips At first glance, the idea of environmental, social and governance (ESG) ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips At first glance, the idea of environmental, social and governance (ESG) investments might seem more like a “heart” narrative as opposed to a financial one. In other words, in a perfect world, everyone would choose to support the best ESG stocks to buy. However, in a paradigm of limited resources, some things have to go. Usually, that something is anything related to moral directives. However, the concept that doing right must necessarily come at the expense of the bottom line might need a rethink. That may have been the case in a more cynical time. But these days, the emerging consumer cares deeply about sustainability and other holistic endeavors. Indeed, fostering a reputation for not prioritizing sustainability and other morally desirable attributes can hurt the bottom line. Plus, multiple organizations have started to call attention to the top performers in the ESG circuit. Earning these awards can lead to additional eyeballs. With that in mind, below are potentially the best ESG stocks to buy. Microsoft (MSFT) Source: VDB Photos \/ Shutterstock.com Tech giant Microsoft (NASDAQ:MSFT) is no stranger to innovation and overall business prowess. However, it would be remiss to have a discussion of the best ESG stocks to buy and not include MSFT. According to Investor’s Business Daily, the software (and hardware) juggernaut took the top spot in the publication’s 100 Best ESG Companies for 2023. I wouldn’t be surprised if took the checkered flag in first again for 2024. Microsoft offers so many initiatives covering sustainability and other holistic efforts targeting broader wellness and equity that it’s difficult to cover in any single article. For me, one of the most impressive ambitions that the company forwarded is its aim to be carbon negative – not just neutral – by 2030. By that, we’re talking about being profitable or accretive for the environment, rather than merely mitigating the damage done. Beyond that, the company has been killing it financially. In the past four quarters, its average earnings surprise has come out to 7%. Fiscal 2024 earnings per share may hit $11.79 on sales of $244.92 billion. That would be up 20.2% and 15.6%, respectively, from last year. Mastercard (MA) Source: David Cardinez \/ Shutterstock.com One of the biggest financial services firms in the world, Mastercard (NYSE:MA) is well known for its credit solutions. It also happens to be ranked among the best ESG stocks to buy. In particular, the company has a focus on empowerment. First, it fosters an ecosystem of diversity and opportunity, enabling individuals to reach their top potential. Second, Mastercard is attempting to merge the power of technology and the social need for equity together. Specifically, it wants everyone to participate in the digital economy, and is thus focused on connecting individuals to tools and resources that will enable them to reach prosperity. Finally, the credit services specialist is accelerating its efforts to promote a low carbon, regenerative economy. Notably, these initiatives are not coming at the expense of financial performance. Between the second quarter of 2023 to Q1 2024, the company’s average EPS hit $3.12. This translated to an earnings surprise of 3.35%. Analysts see EPS in fiscal 2024 reach $14.32 on sales of $27.85 billion. That would come out to 16.8% and 11% up, respectively, against the prior year. Caterpillar (CAT) Source: Shutterstock On the surface, Caterpillar (NYSE:CAT) might not immediately sound like one of the best ESG stocks to buy. As an industrial equipment manufacturer, Caterpillar plays a pivotal role in resource mining and energy projects. While these are no doubt important roles, such operations aren’t exactly holistically helpful for the environment. Still, CAT is actually one of IBD’s top ESG plays, ranked number six last year. While mining and manufacturing operations lead to a broader impact, Caterpillar is also engaged in helping to minimize carbon emissions. As well, the company is supporting its enterprise-level customers through new products, technologies and services to help facilitate reduced emissions. Plus, some of the resources that Caterpillar indirectly helps extract – like lithium – can potentially yield positive results through the ultimate end product (i.e. electric vehicles). Even better, the financials don’t appear to have suffered from its ESG efforts. In the past four quarters, the company’s average earnings surprise reached 3.35%. For fiscal 2024, analysts anticipate EPS of $14.32 on sales of $27.85 billion, up 16.8% and 11%, respectively, on a year-over-year basis. Bunge (BG) Source: JHVEPhoto\/ShutterStock.com Based in Chesterfield, Missouri, Bunge (NYSE:BG) plays a key role in the global food supply chain. In terms of industry, it falls under the farm products sector. Per its public profile, Bunge operates as an agribusiness, providing vital commodities such as oilseeds, grains (comprising of wheat and corn) and products for animal feed manufacturers. Because the company depends such much on a healthy environment, it’s no surprise that BG ranks among the best ESG stocks to buy. According to its website, one of the Bunge’s initiatives involves reducing greenhouse gas emissions and unlocking opportunities for sustainable growth. It also launched a program to help accelerate regenerative agriculture. If ever the criticism comes that “do-gooder” organizations can’t succeed financially, Bunge will prove doubters wrong. In the past four quarters, its average EPS clocked in at $3.36. During this period, the average earnings surprise soared to 27.55%. That’s wildly impressive. Admittedly, analysts anticipate a slowdown in fiscal 2024. However, the high-side revenue target of $62.38 billion may represent a nearly 5% growth rate from last year. Either way, analysts rate shares a consensus moderate buy. Mondelez (MDLZ) Source: Shutterstock A confectionary giant, Mondelez (NASDAQ:MDLZ) has delighted generations of consumers. It also happens to be one of the best ESG stocks to buy for its wide-ranging initiatives. According to its website, Mondelez has achieved a 100% success rate in implementing over the past four years food safety schemes that were benchmarked by the Global Food Safety Initiative. As well, 48% of the electricity used in its manufacturing sites have been sourced from renewables. That’s a sizable improvement over the 40% usage metric seen in 2022. So, Mondelez isn’t just talking the talk, it’s walking the walk. In addition, the company has stressed its social equity initiatives, fostering an environment of diversity and inclusion. In the past four quarters, Mondelez posted an average EPS of over 84 cents. This performance translated to an average earnings surprise of 7.08%. Therefore, even with such a strong focus on ESG directives, the financial print remains robust. For fiscal 2024, analysts are anticipating EPS may reach $3.50 on sales of $36.84 billion, up 9.7% and 2.3%, respectively, on a year over year basis. Marriott (MAR) Source: Tricky_Shark \/ Shutterstock.com A multinational organization, Marriott (NASDAQ:MAR) operates, franchises and licenses lodging brands. Primarily, the enterprise focuses on hotels, though it’s also involved in residential and timeshare properties. Presently, its portfolio covers over 30 hotel and timeshare brands at 8,785 locations. With the sustained interest in traveling and similar experiential expenditures, MAR could swing higher. Just as well, the company is succeeding under a framework of holistic positivity. By 2025, Marriott aims to have 80% of managed hotels participating in community service activities. In addition, it’s putting money into the mix to develop hospitality skills and opportunities among youth, diverse populations, women, people with disabilities and veterans and refugees. With such a strong commitment to improving society’s bottom line, some might wonder about Marriott’s own financials. Don’t worry – in the past four quarters, it posted EPS of nearly $2.52. This translated to an earnings surprise of 17.8%. For fiscal 2024, covering experts do see a possible dip in EPS. However, they’re also targeting revenue of $25.45 billion, up 7.3% YOY. Additionally, their blue-sky sales target for that year stands at $26.21 billion. Thus, MAR could rank among the best ESG stocks to buy. Clean Harbors (CLH) Source: Shutterstock A provider of environmental and industrial services, Clean Harbors (NYSE:CLH) makes an organic case for the best ESG stocks to buy. Part of its business involves the always critical hazardous waste disposal solution for companies, small waste generators and government agencies. Through its expansionary efforts, Clean Harbors features approximately 400 service locations in North America. These include over 50 hazardous waste management facilities. As the company states on its website, its business is sustainability. When circumstances go wrong, Clean Harbors is effectively a first responder for the environment and for overall social wellness. Thus, part of the bullish narrative for CLH stock centers on its natural monopoly. While other enterprises can compete with Clean Harbors, the barriers – including regulations – are quite steep. Financially, the company enjoyed a solid outing over the past four quarters except for Q3 2024. That turned out to be a sizable miss. Still, the average earnings surprise during the aforementioned period landed at 0.45%. For fiscal 2024, experts anticipate 7% growth in EPS to hit $7.48. Also, sales could rise 9% to reach $5.89 billion. It’s easily one of the best ESG stocks to buy. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. More From InvestorPlace The post Jolly Green Giants: The 7 Best ESG Stocks to Buy Now appeared first on InvestorPlace.","filter_flag":1}
{"title":"The best budget robot vacuums under $250","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.cbsnews.com%2fessentials%2fbest-cheap-robot-vacuums-under-250%2f&c=851609592172480176&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fwww.cbsnews.com%2fessentials%2fbest-cheap-robot-vacuums-under-250%2f&c=851609592172480176&mkt=en-us","summary":"The robot vacuum also has three levels of suction power, so you can choose between a more through clean and more quiet ... She's always testing new products to recommend. Some of her current ...","published":"Wed, 12 Jun 2024 05:53:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=12, tm_hour=5, tm_min=53, tm_sec=0, tm_wday=2, tm_yday=164, tm_isdst=0)","news_source":"CBS News","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The best budget robot vacuums under $250","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The robot vacuum also has three levels of suction power, so you can choose between a more through clean and more quiet ... She's always testing new products to recommend. Some of her current ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"CBS Essentials is created independently of the CBS News editorial staff. We may receive commissions from some links to products on this page. Promotions are subject to availability and retailer terms. Mamnv If you're looking to get your home in order for summer, but want to eliminate some of the drudge work, consider a robot vacuum, or a vacuum and mop combo. There are plenty of options priced under $250 from well-known and reliable brands. And just because these robot vacuums have lower price points doesn't mean they skimp on features. Some even respond to voice commands, self-dock when they're done and even mop your floors. For all sorts of tips about tools you can use to make cleaning a breeze, check out all of our home, kitchen & outdoor coverage, where you'll discover the five best robot vacuums for pet hair, a roundup of the best robot vacuums on Amazon and so much more. What is the best budget robot vacuum in 2024? Check out these great options for $250 or less from iRobot, Shark and more beloved brands. Best Roomba under $250: iRobot Roomba Vac Essential robot vacuum Amazon Featuring a three-stage cleaning system, the iRobot Roomba Vac Essential robot vacuum is able to handle carpets and hard surface floors like a pro. The robot vacuum also has three levels of suction power, so you can choose between a more through clean and more quiet operation. We like that the iRobot Roomba Vac Essential can be scheduled to clean automatically in neat rows, or can start cleaning via Alexa voice commands. There's also a spot cleaning setting where the robot will spin in place for up to two minutes. It cleans for up to 120 minutes on a single charge, and automatically returns to its base when its battery is low. The vacuum will alert you when its filter or brushes need replacing. Regularly $250, you can get this budget robot vacuum for just $180 at Amazon now. Most affordable robot vacuum: Lefant M210 Pro robot vacuum cleaner Amazon Here's a robot vacuum you can get for only $110. Lefant's M210 Pro robot vac is 4-star rated. It features anti-collision infrared sensors, so it won't bang into its surroundings. The robot vacuum detects \"stuck areas\" and adjusts its cleaning path automatically. This robot vacuum offers 120 minutes of run time and self-charging capabilities. And you can download the Lefant app to pair the Wi-Fi-enabled vac with your smartphone or smart home hub to control it remotely (even using voice command). This affordable vacuum is only $110 using an instant 50% off Amazon coupon. It's reduced from $220. Robot vac with the longest run time: Yeedi Vac 2 Pro robot vacuum and mop Amazon This multi-purpose cleaning device can vacuum and mop -- either performing one task at a time or doing both simultaneously. The robot vacuum features 3D object avoidance, which allows it to recognize objects in its path and move around them to avoid getting stuck. It also maps your home to find an efficient cleaning path. In fact, it can also identify your floor type and adjust its cleaning method accordingly. The Yeedi Vac 2 Pro robot vacuum and mop offers an impressive 3,000 Pa of suction power and a 240-minute run time. Right now, you can purchase this powerful cleaning tool for just $140, after using the $110 off instant coupon on Amazon. Best robot vacuum and mop combo: Mamnv robot vacuum and mop combo Amazon This Mamnv robot vacuum and mop combo features a 3.9 average star rating (out of more than 2,000 reviews). The 2-in-1 device offers 1400 Pa of suction power with four high-efficiency cleaning modes to mop and vacuum. It offers a slim design, so it can travel under furniture and easily maneuver around obstacles. You can control this vacuum via an app, remote control or with Alexa or Google Assistant voice commands. It works with any smartphone and a wide range of home hubs that allows you to easily create a cleaning schedule, change the cleaning mode and control the cleaning direction via the Tuya Smart app. It has advanced obstacle avoidance functionality that uses a set of sensors to intelligently identify and avoid walls, stairs, and obstacles. Thanks to its 2,500mAh battery capacity, it will continuously work up to 100 minutes and then return to its charging base. Best super thin robot vacuum: Eufy BoostIQ RoboVac 11S Max Amazon Not only has this robot vacuum earned an average star rating of 4.3 on Amazon (based on more than 12,700 reviews), it's also currently $100 off when you apply an instant coupon on Amazon. This brings the price of this normally $250 robot vac down to a mere $150. One thing that sets this robot vac apart from its competition is its super-thin (2.85 inch tall) design. This allows it to scoot under most furniture. It also offers quiet operation (just 55dB), so as it's busy cleaning the floors, you'll barely notice it's there. The 11S Max works equally well on hard floors and low-to-medium pile carpets. And thanks to its 2,000 Pa suction, it does a nice job cleaning up pet hair, too. On a fully charged battery, the 11S Max runs up to 100-minutes. It comes with a remote control, charging base, AC power adapter, a cleaning tool and one side brush. As you'd expect, this robot vac has built in sensors so it easily avoids colliding into furniture or falling down stairs. When its battery starts to run low, it automatically returns to its base to recharge.","filter_flag":1}
{"title":"Enviri Corporation Hosts 2024 Analyst Day in Philadelphia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fenviri-corporation-hosts-2024-analyst-day-in-philadelphia-1033492410&c=1635602765715295687&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d0442f647e8b1212f212eda2c14&url=https%3a%2f%2fmarkets.businessinsider.com%2fnews%2fstocks%2fenviri-corporation-hosts-2024-analyst-day-in-philadelphia-1033492410&c=1635602765715295687&mkt=en-us","summary":"Annual Growth Targets Include Mid-Single Digit Revenue Growth and 10 to 12 Percent Adjusted EBITDA GrowthEnviri Debt Reduction to ...","published":"Thu, 20 Jun 2024 06:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=6, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"Business Insider","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Enviri Corporation Hosts 2024 Analyst Day in Philadelphia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Annual Growth Targets Include Mid-Single Digit Revenue Growth and 10 to 12 Percent Adjusted EBITDA GrowthEnviri Debt Reduction to ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Environmental Cleanup\" \"new products\"&format=rss","text":"Enviri 3-Year Annual Growth Targets Include Mid-Single Digit Revenue Growth and 10 to 12 Percent Adjusted EBITDA Growth Enviri Debt Reduction to Continue with Credit Agreement Leverage (Ratio) Expected to Reach 2.5X by 2027 Event to Showcase Clean Earth’s Strategy, Favorable Financial Attributes and Growth Potential Clean Earth’s Adjusted EBITDA Margin Target Increased to 17 Percent, from 15 Percent Live Webcast to Begin at 9am Today (June 20) PHILADELPHIA, June 20, 2024 (GLOBE NEWSWIRE) -- Enviri Corporation (NYSE: NVRI), a global, market-leading provider of environmental solutions for industrial and specialty waste streams, is hosting an Analyst Day today, June 20, beginning at 9am ET. For those interested in learning how Enviri is creating value both for the environment and shareholders, please join us for the half-day event. Enviri’s Chairman and CEO, Nick Grasberger, and Senior Vice President and CFO, Tom Vadaketh, will provide an update on Enviri and the Company’s financial priorities and outlook. The event will also feature the accomplishments and outlook for Clean Earth as well as its unique business attributes and key initiatives. Jeff Beswick, Senior Vice President & Group President of Clean Earth, will engage in discussions on these and other topics through a series of presentations and a Q&A session, along with Clean Earth’s Chief Commercial Officer Elizabeth Peterson and Chief Financial Officer Michael Polcovich. “It has been a number of years since our last Analyst Day, since which Enviri has gone through a major business transformation,” said Mr. Grasberger. “Today, we are a leading environmental solutions company with strong market positions around the world. The majority of our revenues are recurring, and we expect to benefit from sustainability goals of our customers and evolving environmental regulation. These facts when combined with internal improvement initiatives have made Enviri into a less cyclical company with attractive growth potential today.” “In addition, our underlying businesses are performing well and our shorter- and longer-term outlook for each is positive. As a result, we’re targeting annual cash earnings growth of 10+ percent over the next few years. This along with significant deleveraging in the year ahead is expected to drive meaningful value creation for our shareholders.” Financial Targets During the Analyst Day, the Enviri management team will discuss how the business is poised to deliver attractive revenue and cash earnings growth. Further, the team will discuss how this growth will drive increased free cash flow and balance sheet deleveraging. More specifically, the Company will introduce 3-Year financial targets which include the following: Mid-single digit organic revenue growth on average over next 3 years Average adjusted EBITDA growth of 10 to 12 percent annually during this period Adjusted EBITDA targets of 17 percent for Clean Earth, 20 percent for Harsco Environmental and 10 percent for Harsco Rail Adjusted Free Cash Flow margin of 10 percent for Enviri’s business segments Credit Agreement Net Leverage Ratio of 2.5x at the end of 2027 Webcast and Registration A live webcast of the Analyst Day presentations and supporting materials will be accessible on the Investor Relations section of the Company’s website, www.enviri.com. In addition, those interested in participating in the event may use the following registration link: Enviri 2024 Analyst Day. Forward-Looking Statements The nature of the Company's business, together with the number of countries in which it operates, subject it to changing economic, competitive, regulatory and technological conditions, risks and uncertainties. In accordance with the \"safe harbor\" provisions of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, the Company provides the following cautionary remarks regarding important factors that, among others, could cause future results to differ materially from the results contemplated by forward-looking statements, including the expectations and assumptions expressed or implied herein. Forward-looking statements contained herein could include, among other things, statements about management's confidence in and strategies for performance; expectations for new and existing products, technologies and opportunities; and expectations regarding growth, sales, cash flows, and earnings. Forward-looking statements can be identified by the use of such terms as \"may,\" \"could,\" \"expect,\" \"anticipate,\" \"intend,\" \"believe,\" \"likely,\" \"estimate,\" \"outlook,\" \"plan,\" \"contemplate,\" \"project,\" “target” or other comparable terms. Factors that could cause actual results to differ, perhaps materially, from those implied by forward-looking statements include, but are not limited to: (1) the Company's ability to successfully enter into new contracts and complete new acquisitions, divestitures, or strategic ventures in the time-frame contemplated or at all, including the Company's ability to divest the Rail business; (2) the Company’s inability to comply with applicable environmental laws and regulations; (3) the Company’s inability to obtain, renew, or maintain compliance with its operating permits or license agreements; (4) various economic, business, and regulatory risks associated with the waste management industry; (5) the seasonal nature of the Company's business; (6) risks caused by customer concentration, the long-term nature of customer contracts, and the competitive nature of the industries in which the Company operates; (7) the outcome of any disputes with customers, contractors and subcontractors; (8) the financial condition of the Company's customers, including the ability of customers (especially those that may be highly leveraged or have inadequate liquidity) to maintain their credit availability; (9) higher than expected claims under the Company’s insurance policies, or losses that are uninsurable or that exceed existing insurance coverage; (10) market and competitive changes, including pricing pressures, market demand and acceptance for new products, services and technologies; changes in currency exchange rates, interest rates, commodity and fuel costs and capital costs; (11) the Company's ability to negotiate, complete, and integrate strategic transactions and joint ventures with strategic partners; (12) the Company’s ability to effectively retain key management and employees, including due to unanticipated changes to demand for the Company’s services, disruptions associated with labor disputes, and increased operating costs associated with union organizations; (13) the Company's inability or failure to protect its intellectual property rights from infringement in one or more of the many countries in which the Company operates; (14) failure to effectively prevent, detect or recover from breaches in the Company's cybersecurity infrastructure; (15) changes in the worldwide business environment in which the Company operates, including changes in general economic and industry conditions and cyclical slowdowns; (16) fluctuations in exchange rates between the U.S. dollar and other currencies in which the Company conducts business; (17) unforeseen business disruptions in one or more of the many countries in which the Company operates due to changes in economic conditions, changes in governmental laws and regulations, including environmental, occupational health and safety, tax and import tariff standards and amounts; political instability, civil disobedience, armed hostilities, public health issues or other calamities; (18) liability for and implementation of environmental remediation matters; (19) product liability and warranty claims associated with the Company’s operations; (20) the Company’s ability to comply with financial covenants and obligations to financial counterparties; (21) the Company’s outstanding indebtedness and exposure to derivative financial instruments that may be impacted by, among other factors, changes in interest rates; (22) tax liabilities and changes in tax laws; (23) changes in the performance of equity and bond markets that could affect, among other things, the valuation of the assets in the Company's pension plans and the accounting for pension assets, liabilities and expenses; (24) risk and uncertainty associated with intangible assets; and the other risk factors listed from time to time in the Company's SEC reports. A further discussion of these, along with other potential risk factors, can be found in Part I, Item 1A, “Risk Factors” of the Company’s most recently filed Annual Report on Form 10-K, as updated by subsequent Quarterly Reports on Form 10-Q, which are filed with the Securities and Exchange Commission. The Company cautions that these factors may not be exhaustive and that many of these factors are beyond the Company's ability to control or predict. Accordingly, forward-looking statements should not be relied upon as a prediction of actual results. The Company undertakes no duty to update forward-looking statements except as may be required by law. About Enviri Enviri is transforming the world to green, as a trusted global leader in providing a broad range of environmental services and related innovative solutions. The company serves a diverse customer base by offering critical recycle and reuse solutions for their waste streams, enabling customers to address their most complex environmental challenges and to achieve their sustainability goals. Enviri is based in Philadelphia, Pennsylvania and operates in more than 150 locations in over 30 countries. Additional information can be found at www.enviri.com.","filter_flag":1}
