{"title":"Ltd. Global Website | Compact CO2 Capture System Receives “Awards for Excellence” at the 2022 Nikkei Excellent ... - Mitsubishi Heavy Industries","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiJGh0dHBzOi8vd3d3Lm1oaS5jb20vbmV3cy8yMzAyMDEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiJGh0dHBzOi8vd3d3Lm1oaS5jb20vbmV3cy8yMzAyMDEuaHRtbNIBAA?oc=5","id":"CBMiJGh0dHBzOi8vd3d3Lm1oaS5jb20vbmV3cy8yMzAyMDEuaHRtbNIBAA","guidislink":false,"published":"Wed, 01 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=32, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiJGh0dHBzOi8vd3d3Lm1oaS5jb20vbmV3cy8yMzAyMDEuaHRtbNIBAA?oc=5\" target=\"_blank\">Ltd. Global Website | Compact CO2 Capture System Receives “Awards for Excellence” at the 2022 Nikkei Excellent ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mitsubishi Heavy Industries<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ltd. Global Website | Compact CO2 Capture System Receives “Awards for Excellence” at the 2022 Nikkei Excellent ... - Mitsubishi Heavy Industries","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiJGh0dHBzOi8vd3d3Lm1oaS5jb20vbmV3cy8yMzAyMDEuaHRtbNIBAA?oc=5\" target=\"_blank\">Ltd. Global Website | Compact CO2 Capture System Receives “Awards for Excellence” at the 2022 Nikkei Excellent ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mitsubishi Heavy Industries<\/font>","source.href":"https:\/\/www.mhi.com","source.title":"Mitsubishi Heavy Industries","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"About MHI Group Mitsubishi Heavy Industries (MHI) Group is one of the world’s leading industrial groups, spanning energy, smart infrastructure, industrial machinery, aerospace and defense. MHI Group combines cutting-edge technology with deep experience to deliver innovative, integrated solutions that help to realize a carbon neutral world, improve the quality of life and ensure a safer world. For more information, please visit www.mhi.com or follow our insights and stories on spectra.mhi.com.","filter_flag":1}
{"title":"Loliware scores $15.4m to replace single-use plastics with seaweed-based materials - AgFunderNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2xpd2FyZS1zY29yZXMtMTUtNG0tdG8tcmVwbGFjZS1zaW5nbGUtdXNlLXBsYXN0aWNzLXdpdGgtc2Vhd2VlZC1iYXNlZC1tYXRlcmlhbHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2xpd2FyZS1zY29yZXMtMTUtNG0tdG8tcmVwbGFjZS1zaW5nbGUtdXNlLXBsYXN0aWNzLXdpdGgtc2Vhd2VlZC1iYXNlZC1tYXRlcmlhbHPSAQA?oc=5","id":"CBMiamh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2xpd2FyZS1zY29yZXMtMTUtNG0tdG8tcmVwbGFjZS1zaW5nbGUtdXNlLXBsYXN0aWNzLXdpdGgtc2Vhd2VlZC1iYXNlZC1tYXRlcmlhbHPSAQA","guidislink":false,"published":"Mon, 20 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=51, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2xpd2FyZS1zY29yZXMtMTUtNG0tdG8tcmVwbGFjZS1zaW5nbGUtdXNlLXBsYXN0aWNzLXdpdGgtc2Vhd2VlZC1iYXNlZC1tYXRlcmlhbHPSAQA?oc=5\" target=\"_blank\">Loliware scores $15.4m to replace single-use plastics with seaweed-based materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Loliware scores $15.4m to replace single-use plastics with seaweed-based materials - AgFunderNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9sb2xpd2FyZS1zY29yZXMtMTUtNG0tdG8tcmVwbGFjZS1zaW5nbGUtdXNlLXBsYXN0aWNzLXdpdGgtc2Vhd2VlZC1iYXNlZC1tYXRlcmlhbHPSAQA?oc=5\" target=\"_blank\">Loliware scores $15.4m to replace single-use plastics with seaweed-based materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","source.href":"https:\/\/agfundernews.com","source.title":"AgFunderNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The seaweed advantage: Efforts to replace single-use plastics in foodservice (think cutlery, straws and cup lids) run the gamut, from reusable container services to bamboo sporks. Simultaneously, cities and countries are banning single-use plastics, the most recent being England. But as Loliware founder and CEO Sea Briganti tells AFN, such bans are impactful only if there’s something to replace the plastics. Seaweed has several advantages over other materials currently used to make alt-plastics. Terrestrial-based crops like canola or corn require fertilizers and water, and reinforce mono-cropping, a notable offender when it comes to emissions and biodiversity loss. Loliware grows its seaweed with ocean farmers around the world. (The company never harvests wild seaweed.) Besides creating more “blue economy” jobs around the world, seaweed farming can capture carbon from the atmosphere and recycle it to emit oxygen, says Briganti. Seaweed can capture five to 20 times more carbon per unit area than land-based forests. It permanently stores some of that carbon in the seafloor. Among seaweed’s other advantages are “its fast growth cycle, the fact that it’s capturing more carbon than terrestrial-based plants, and the fact that it’s oxygenating the ocean,” according to the company. Loliware’s seaweed-derived resins are also fully compatible with existing manufacturing plastic extruding equipment. This drives down costs, which are often a barrier to adoption when it comes to bioplastic products. How Loliware works: Loliware uses a circular system to grow and harvest seaweed, turn it into pellets, produce products from the pellets, then put the used products back into the ground. For the Blue Carbon Straw, which is the company’s first product, Loliware uses a five-step process. After harvesting and processing the seaweed, the team adds minerals and natural colors. “There’s a lot of green chemistry involved, all with ingredients from nature we’ve carefully selected.” This mix is then “pellatized” using an extrusion process. These ‘Sea Tech’ p ellets are similar to those used in plastic manufacturing. ellets are similar to those used in plastic manufacturing. Loliware’s seaweed-based pellets are then shipped to the manufacturer, where they are processed into straws. Straws are compostable and can decompose as fast as a banana peel. The straws will still break down in a landfill but Briganti says composting is superior, as it “creates nutrient-dense soil, and we want to capture that carbon in the soil.” Loliware currently works with Missouri-based plastics manufacturer Sinclair and Rush to make the straws. “They are a women-owned, 40-year-old factory,” says Briganti. “They’ve never invested in anything [bioplastic] in 40 years and they are so excited.” Loliware says it currently produces 100 million straws per year. These are sent to the company’s customers, which are mostly foodservice groups. Briganti says Loliware currently has 15 customers and will launch with 20 more this year. The latter will be a mix of large companies requiring hundreds of millions of straws as well as smaller businesses. Beyond the straw: Loliware’s began developing its Blue Carbon Straw in 2019, around the time straw bans began. Many were quick to point out that children, the elderly, disabled persons, and others actually need straws. The same holds true today, and Briganti says part of Loliware’s mission is “having an inclusive culture within the company” that recognizes that need. She says the straw portion of Loliware is fully scaled. In a way, it’s also “like a demonstration product.” “We really want to show the world that seaweed can compete with plastic at scale, that we can make a lot of [straws] at cost. We’re already on par with bioplastics and paper straws. And on performance, we outperform a lot of those incumbents.” Now the company is set to expand with new products made from its SeaTech pellets. Part of the pre-Series A funding will go to developing other single-use items such as cups, utensils, and films. In May, Loliware will launch a utensil set in London in response to the aforementioned ban on single-use plastics in England. Funding will also go towards more research and development. Legislative tailwinds are creating more opportunities for Loliware to bring its products to the masses. While part of the company’s base are early adopters, others are facing bans on plastic and in need of a better solution than paper, says Briganti. “Bans are only effective and impactful if you can provide businesses with solutions,” she adds. “It’s not fair, otherwise. We have to be collaborative here.”","filter_flag":1}
{"title":"How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using - SupplyChainBrain","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5","id":"CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA","guidislink":false,"published":"Mon, 06 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=37, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5\" target=\"_blank\">How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SupplyChainBrain<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using - SupplyChainBrain","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5\" target=\"_blank\">How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SupplyChainBrain<\/font>","source.href":"https:\/\/www.supplychainbrain.com","source.title":"SupplyChainBrain","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"An increasing number of manufacturers want to employ recycled materials and make production processes more eco-friendly, which is encouraging. Only a united commitment to source-recycled materials in place of virgin raw materials during production processes will create a stable demand for greener products, and build the planet-saving circular economy we so desperately need. How Manufacturers are Uniting to Build a Circular Economy Since the dawn of the industrial revolution, we have been locked into a linear economy that manufactures, creates waste, discards, and manufactures again. Our goal is to build a circular economy that does not produce waste. Repurposing previously used materials in new products is a key step forward to a circular economy. To build a global circular economy, manufacturers are considering recycled materials as they explore and produce products, instead of simply repurposing their own production waste. When we, as manufacturers, include recycling in both our production and our waste management, we design new products to reflect new methods of recovering components and materials from worn-out products. We close the loop by producing sustainable products, bolstering green markets, and raising awareness among consumers about the benefit of sustainable choices in purchases as well as disposal. How Manufacturing Companies are Introducing Recycled Steel into Their Processes My area of expertise is recycled steel produced with electric arc furnace technology. It happens to be an ideal material for sustainable development and a perfect example of the circular economy we call recycling. This is because steel is infinitely recyclable. Instead of dumping old appliances or automobiles into a landfill, steel products that have reached the end of their lives can go right back into the supply chain to become steel, again and again. Because of its recyclable properties, steel is a material of choice for increasing numbers of end-users, who are turning to recycled steel to help them meet their environmental design goals. Steel made with recycled ferrous scrap as its primary raw material can be used interchangeably with steel made from virgin materials for virtually all applications, such as iron ore and coking coal, for virtually all applications. To help us harvest this scrap steel, our customers recycle a wide variety of products such as end-of-life automobiles, appliances, decommissioned steel bridges and buildings, machinery, electrical and electronic equipment, and packaging. We receive and process scrap steel at numerous metal recycling locations, melt it in electric arc furnaces, and form it into new steel products. This recycled steel is showing up everywhere, serving needs in industries such as agriculture, automotive manufacturing, civil construction, distribution, energy production, and mining. In addition, steel is a crucial element in emission-reduction infrastructure projects such as solar and wind power solutions. We have honed our manufacturing process to incorporate recycled steel at a rate of 98%. Our use of recycled steel also reduces carbon emissions in several ways. Steel production using electric arc furnace technology generates a fraction of the carbon emissions per ton compared to production from virgin materials. During the process, 97% of water is reused, and 99.9% of dust is captured and recycled. In addition, we limit our CO2 emissions by sourcing and shipping scrap metal within a 500-mile radius. Globally, the steel industry must reduce current greenhouse gas emissions by over 50%. With this goal in mind, we are prioritizing greater energy and operational efficiency, increasing our use of scrap, expanding our use of sustainable forestry, employing renewable energy, and investing in new technologies and open innovation. Our mission is to be carbon neutral by 2050. Manufacturers are Moving Toward a Circular Economy As the sustainable development movement continues to grow, the trend toward manufacturers using recycled materials is gaining traction. Mounting pressure from community stakeholders, government officials, shareholders, customers, and employees to source materials responsibly is compelling manufacturers to examine their processes and make eco-friendly changes. In our linear economy, industrial processes are designed around virgin materials. Because of this, using recycled materials often leads to snags in a manufacturer's value chain. However, when we take time to adjust our production processes, we find the value in using recovered materials. Finding this value boosts the widespread drive to recover materials and reduces costs. This is why we must promote up-cycling during the early design process. As manufacturers, adopting recycled materials forces us to face new challenges in maintaining our supply of materials, modifying production processes, maintaining production efficiency, and gauging consumer demand for green products. These barriers are daunting, but they all have solutions. To build a circular economy, we must transform the supply chain, redesign products, and create consumer demand for sustainable products. Though a fully circular economy may be decades in the future, each time a manufacturer introduces waste-derived, recovered, or recycled materials into their products, we take a crucial step forward. Adam Parr is Director of Communications and Public Affairs at Gerdau.","filter_flag":1}
{"title":"Why Man-Made Cellulosic Fibers Could Amplify and Accelerate Sustainability Impact - Sourcing Journal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbWF0ZXJpYWxzL3NhdGVyaS1tYW4tbWFkZS1jZWxsdWxvc2ljLWZpYmVycy1zdXN0YWluYWJpbGl0eS1pbXBhY3QtY2lyY3VsYXJpdHktY2FyYm9uLW5ldXRyYWwtdmlzaW9uLTIwMzAtNDE0MDgwL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbWF0ZXJpYWxzL3NhdGVyaS1tYW4tbWFkZS1jZWxsdWxvc2ljLWZpYmVycy1zdXN0YWluYWJpbGl0eS1pbXBhY3QtY2lyY3VsYXJpdHktY2FyYm9uLW5ldXRyYWwtdmlzaW9uLTIwMzAtNDE0MDgwL9IBAA?oc=5","id":"CBMiqgFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbWF0ZXJpYWxzL3NhdGVyaS1tYW4tbWFkZS1jZWxsdWxvc2ljLWZpYmVycy1zdXN0YWluYWJpbGl0eS1pbXBhY3QtY2lyY3VsYXJpdHktY2FyYm9uLW5ldXRyYWwtdmlzaW9uLTIwMzAtNDE0MDgwL9IBAA","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbWF0ZXJpYWxzL3NhdGVyaS1tYW4tbWFkZS1jZWxsdWxvc2ljLWZpYmVycy1zdXN0YWluYWJpbGl0eS1pbXBhY3QtY2lyY3VsYXJpdHktY2FyYm9uLW5ldXRyYWwtdmlzaW9uLTIwMzAtNDE0MDgwL9IBAA?oc=5\" target=\"_blank\">Why Man-Made Cellulosic Fibers Could Amplify and Accelerate Sustainability Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sourcing Journal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why Man-Made Cellulosic Fibers Could Amplify and Accelerate Sustainability Impact - Sourcing Journal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqgFodHRwczovL3NvdXJjaW5nam91cm5hbC5jb20vc3VzdGFpbmFiaWxpdHkvc3VzdGFpbmFiaWxpdHktbWF0ZXJpYWxzL3NhdGVyaS1tYW4tbWFkZS1jZWxsdWxvc2ljLWZpYmVycy1zdXN0YWluYWJpbGl0eS1pbXBhY3QtY2lyY3VsYXJpdHktY2FyYm9uLW5ldXRyYWwtdmlzaW9uLTIwMzAtNDE0MDgwL9IBAA?oc=5\" target=\"_blank\">Why Man-Made Cellulosic Fibers Could Amplify and Accelerate Sustainability Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sourcing Journal<\/font>","source.href":"https:\/\/sourcingjournal.com","source.title":"Sourcing Journal","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Rising clothing consumption and a growing reliance on synthetic fibers have created a significant plastic pollution problem. An estimated 92 million tons of clothing waste is created each year, and with a reuse rate of just 1 percent, most of this textile waste will go to landfills. Synthetics—including polyester and spandex—accounted for 62 percent of the textile fiber market in 2020, according to Textile Exchange. Most synthetic materials cannot biodegrade in soil, taking hundreds of years to decompose and leaching chemicals into soil and groundwater. Polymer-based microfibers also shed from garments during manufacturing, wear and laundering, ending up in bodies of water and people’s bodies through inhalation, posing a health risk. Making the switch from synthetics to natural fibers is one way to fix fashion’s waste challenge. Man-made cellulosic fibers (MMCFs), or wood-based materials like viscose and lyocell, are particularly promising alternatives to synthetics due to their natural, renewable and biodegradable attributes. They are also very versatile. They can create textiles that range from silky to non-woven, allowing for applications including homeware, fashion and hygiene items. Despite these benefits, adoption remains low. MMCF production volume more than doubled between 1990 and 2021 to 7.2 million tons, and yet it still holds a mere 6 percent market share. Plant-based MMCFs can return to nature at end of life, as demonstrated by leading MMCF manufacturer Sateri, whose viscose has been certified by TUV Austria to be biodegradable in soil, water and marine environments, as well as home compostable. Fibers placed in these environs will break down into non-toxic organic material within 28 days. One main critique of MMCFs is the potential impact to forests. Knowing the origins of the fibers is therefore critical and must be proven. This is where Sustainable Forest Management Certifications, such as the Programme for the Endorsement of Forest Certification (PEFC) and Forest Stewardship Council (FSC) can play a key role in ensuring that apparel made out of wood-based cellulosic fibers such as viscose and lyocell are sustainably sourced and responsibly produced. Textile Exchange estimates the portion of certified wood-based fibers grew from 55 to 60 percent in 2020 to 60 to 65 percent in 2021, but that leaves upwards of 35 percent that is uncertified. Many brands and viscose companies, Sateri included, have committed to source only from renewable and sustainably managed plantations. In addition to sourcing certified materials proved via the PEFC chain of custody certification mechanism, Sateri requires all its dissolving wood pulp (DWP) suppliers to sign a Declaration of Commitment to its Pulp Sourcing Policy and provide greenhouse gas emissions information. Courtesy The other key concern around MMCF production is its chemical-intensive production process, which may potentially pose damage to the environment and health risks to people. And the industry has stepped up its efforts to address these issues head-on. Sateri and some leading viscose manufacturers, accounting for more than 50 percent of viscose production, have committed to best-in-class benchmarks such as the Zero Discharge of Hazardous Chemicals (ZDHC) MMCF Responsible Fibre Production Guidelines and the European Union Best Available Techniques Reference Document (EU-BAT BREF) on polymers. Sateri recognizes the need for the fashion industry to decouple growth from further resource impact. As a major raw material supplier, Sateri aims to support the industry’s ambition through its Vison 2030 long-term plan, which covers four dimensions of sustainability: Climate and Ecosystem Protection, Closed Loop Production, Innovation and Circularity, and Inclusive Growth. “Our vision articulates how we aspire to grow in a way that we put back more into the environment and society than we take,” said Miranda Chen, strategic marketing director at Sateri. “This would also be Sateri’s defining market differentiator underpinning our continued growth in volume and value.” Besides sustainability, Sateri focuses on the R&D of new products, which has promoted many kinds of cellulose fiber products, including viscose fiber EcoCosy®, Sateri Lyocell, and recycled fiber FINEX™. In 2022, Sateri’s R&D expenditures exceeded $88 million. Closing the loop Circularity can simultaneously tackle textile waste and reduce the volume of wood needed for fiber production. China, wherein Sateri’s operations are based, produces about half of the globe’s textile fiber volumes, and accounts for 60 percent of MMCF production. The country is also a significant consumer of these materials, at the mill and manufacturer level and at retail. China is taking an aggressive approach to circularity. In 2021, the government released a five-year plan that prioritizes material reuse, and in 2022, the National Development and Reform Commission set a 2025 goal to recycle a quarter of textile waste, producing 2 million metric tons of recycled fiber each year. Innovating around circularity, Sateri launched recycled fibers in 2020 under the FINEX™ brand, with up to 20 percent recycled content. Short for “Fiber Next”, FINEX™ is made from pre- and post-consumer materials mixed with wood pulp, resulting in circular fibers that are identical to virgin wood-based materials. Most recently, Sateri has successfully produced FINEX™ viscose fibers with up to 50 percent recycled content. MMCFs with values Along with responsible sourcing and circular practices, reducing the environmental impact of MMCFs revolves around the production process. At Sateri’s viscose and lyocell mills, the focus is on maximizing efficiency and minimizing waste. The company recovered 98 percent of sulphur in 2021. “Our viscose mills have been independently verified to be EU-BAT compliant, fulfilling the target set out in our 2030 plan two years ahead of schedule,” explained Chen. The company was the first viscose producer to achieve the Oeko-Tex Made in Green label, the standard’s most stringent certification that includes testing for hazardous substances and assessments of the factory’s environmental and social responsibility. As well as sustainability, Sateri places equal priority on quality. In addition to sustainability credentials, Sateri’s EcoCosy® fibers are breathable and skin-friendly with longer staple fiber lengths than other natural materials. Sateri’s functional viscose has softer hand feel, as well as anti-bacterial properties. EcoCosy has been used for everything from intimates and athleisure to fashion garments and childrenswear. “Advanced fiber manufacturing technology helps improve the softness of fibers,” said Chen. “It can be mixed with various fibers and yarn blends to meet consumers’ desires for comfort and softness.” Viscose can help brands meet current customer demands. “In the post-epidemic era, consumers’ purchasing habits have changed,” explained Chen. “People began to pay more attention to physical and mental health than work achievement. Consumers changed from hectic lifestyles to healthy and comfort living, which also impacted apparel purchases.” Sateri aims to become a net-zero producer by 2050 in step with the objectives of the United Nations Paris Climate Agreement to limit global warming to 1.5°C. As part of this commitment, Sateri has introduced carbon-neutral versions of its EcoCosy® viscose fibers, Sateri Lyocell and FINEX™ recycled fibers that are combined with credits to compensate for carbon emissions that cannot be avoided or reduced. “In addition to meeting our own goals, we also hope to support our customers meet their sustainability ambition to reduce the carbon intensity of their products,” said Chen. MMCF production is projected to possibly reach 10 million tons in the next 15 years, about double where it stands today. Whether around sustainability, circularity or adoption rates, wood-based fiber makers like Sateri are planting roots that will usher in more growth. Click here to learn more about Sateri.","filter_flag":1}
{"title":"Volvo CE launches electric loader conversion - electrive.com - www.electrive.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmVsZWN0cml2ZS5jb20vMjAyMy8wMi8yMS92b2x2by1jZS1sYXVuY2hlcy1lbGVjdHJpYy1sb2FkZXItY29udmVyc2lvbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmVsZWN0cml2ZS5jb20vMjAyMy8wMi8yMS92b2x2by1jZS1sYXVuY2hlcy1lbGVjdHJpYy1sb2FkZXItY29udmVyc2lvbi_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vd3d3LmVsZWN0cml2ZS5jb20vMjAyMy8wMi8yMS92b2x2by1jZS1sYXVuY2hlcy1lbGVjdHJpYy1sb2FkZXItY29udmVyc2lvbi_SAQA","guidislink":false,"published":"Tue, 21 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmVsZWN0cml2ZS5jb20vMjAyMy8wMi8yMS92b2x2by1jZS1sYXVuY2hlcy1lbGVjdHJpYy1sb2FkZXItY29udmVyc2lvbi_SAQA?oc=5\" target=\"_blank\">Volvo CE launches electric loader conversion - electrive.com<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">www.electrive.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Volvo CE launches electric loader conversion - electrive.com - www.electrive.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmVsZWN0cml2ZS5jb20vMjAyMy8wMi8yMS92b2x2by1jZS1sYXVuY2hlcy1lbGVjdHJpYy1sb2FkZXItY29udmVyc2lvbi_SAQA?oc=5\" target=\"_blank\">Volvo CE launches electric loader conversion - electrive.com<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">www.electrive.com<\/font>","source.href":"https:\/\/www.electrive.com","source.title":"www.electrive.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Volvo Construction Equipment (Volvo CE) is digging deeper to pave the way for the EV transition and has developed a new solution for mid-size range construction machinery. This time, it is a conversion of a 20-ton loader for a speedier market entry. Volvo CE has been making headlines since it announced targets towards carbon neutrality by 2040 and an electric vehicle share of 35 per cent of its sold machines in 2030. In today’s news, the company said again that when it comes to delivering a carbon-neutral construction industry, “we must act now”. This is also why, this time, Volvo CE opted for an EV conversion which may even be offered as a retrofit solution depending on the market demand, so the company. Together with CE Engineering Solutions and Parker Hannifin, formerly Parker Appliance Company or just Parker is an American corporation specialising in motion and control technologies. The cooperation resulted in the L120H Electric Conversion, which Volvo CE will make available this year for selected customers in Europe. 240 kWh batteries provide a runtime of approximately five hours in most medium-duty applications, and Volvo CE says it can charge from 0-100% in 1.5-2 hours. Standard features include Comfort Drive Control, Load Assist with On-Board Weighing, plus radar detection with a new Collision Mitigation System. In addition, the L120H Electric Conversion will be supported by dedicated electromobility applications, which allow the operator to check the battery and charging status and preheat the cab. This latest collaboration expands Volvo CE’s line of electric wheel loaders. Also, it follows the company’s investment in Dutch manufacturer Limach, announced in June, to broaden the electric excavator portfolio. With the L20 Electric and L25 Electric, Volvo CE already has two light electric wheel loaders in its range. However, the Arvika plant specialises in medium and heavy wheel loaders – so new products can also be expected. While the partnership approach allows for a speedier implementation to the market, according to Volvo CE, it happens in parallel with dedicated electric solutions like the EC230 Electric, a 23-ton battery electric excavator built on Volvo CE’s own advanced technology. Only last week, Volvo CE announced expanding its largest excavator factory in South Korea to prepare for electrifying the largest segments. “Both approaches (retrofit and EV dedicated) are needed if the industry is expected to reach carbon reduction targets,” says the company. “There is no time to wait – we need to deliver solutions that allow our customers to achieve their decarbonisation goals,” Carl Slotte, Head of Sales Region Europe at Volvo CE, added. “Our commitment to partnership allows us to take a leading position in transforming our industry with electric solutions that are built to fulfil market demand and tailored to suit the changing needs of our customers. Working together, we are scaling up our portfolio of electric machines, extending the versatility of our range and transforming our industry towards a carbon-neutral future.” To register interest in the L120H Electric Conversion, customers may contact their local Volvo CE dealer or email the company directly. volvoce.com","filter_flag":1}
{"title":"Incoming delivery Hyundai Mighty electric truck - Hyundai","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lmh5dW5kYWkuY29tL2F1L2VuL25ld3MvcHJlc3Mtcm9vbS9pbmNvbWluZy1kZWxpdmVyeS1oeXVuZGFpLW1pZ2h0eS1lbGVjdHJpYy10cnVja9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lmh5dW5kYWkuY29tL2F1L2VuL25ld3MvcHJlc3Mtcm9vbS9pbmNvbWluZy1kZWxpdmVyeS1oeXVuZGFpLW1pZ2h0eS1lbGVjdHJpYy10cnVja9IBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3Lmh5dW5kYWkuY29tL2F1L2VuL25ld3MvcHJlc3Mtcm9vbS9pbmNvbWluZy1kZWxpdmVyeS1oeXVuZGFpLW1pZ2h0eS1lbGVjdHJpYy10cnVja9IBAA","guidislink":false,"published":"Thu, 09 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=40, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lmh5dW5kYWkuY29tL2F1L2VuL25ld3MvcHJlc3Mtcm9vbS9pbmNvbWluZy1kZWxpdmVyeS1oeXVuZGFpLW1pZ2h0eS1lbGVjdHJpYy10cnVja9IBAA?oc=5\" target=\"_blank\">Incoming delivery Hyundai Mighty electric truck<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hyundai<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Incoming delivery Hyundai Mighty electric truck - Hyundai","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lmh5dW5kYWkuY29tL2F1L2VuL25ld3MvcHJlc3Mtcm9vbS9pbmNvbWluZy1kZWxpdmVyeS1oeXVuZGFpLW1pZ2h0eS1lbGVjdHJpYy10cnVja9IBAA?oc=5\" target=\"_blank\">Incoming delivery Hyundai Mighty electric truck<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hyundai<\/font>","source.href":"https:\/\/www.hyundai.com","source.title":"Hyundai","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"A continuation of Hyundai’s sustainable commercial vehicle momentum, Mighty electric follows on from XCIENT Fuel Cell, the brand’s first-ever hydrogen-powered heavy truck, currently deployed in Switzerland and California. Mighty electric has an estimated laden range of approximately 240km and is the ideal zero-emission workhorse for metropolitan and last-mile deliveries. Mighty electric’s 120kW, 320Nm traction motor is powered by a 114.5kWh battery system with rapid charging capability - 10% to 100% in under 70 minutes. This technology gives Mighty electric capabilities that perfectly complement those of the long-haul, heavy load XCIENT Fuel Cell prime mover, which HMCA is studying for a potential trial in Australia. Mighty electric will help drive an expansion in emissions-free commercial transport options by demonstrating its driveability and everyday practicality, while helping to reduce the carbon footprint of transport and logistics operations in Australia. Heavy vehicles make up only four percent of the national vehicle fleet, yet ICE heavy vehicles are responsible for 25 percent of all vehicle emissions in Australia. This means each Mighty electric will have a disproportionately large impact on total emissions reduction. The arrival of this efficient and effective electric truck will mark another important step towards Hyundai Motor Company’s global ambition to be carbon neutral in products and operations by 2045. “We are excited to announce Mighty electric truck for Australia as a key step in driving growth in emissions-free commercial vehicles,” Hyundai Motor Company Australia Chief Executive Officer, Ted Lee said. “Mighty electric will bolster our growing EV line-up and underlines Hyundai’s continuing commitment to developing sustainable mobility solutions,”he said. In addition to its efficient EV technology the Mighty electric represents the latest in cab, including comfort and convenience features such as a digital dash display, a multi-function steering wheel and a suspended driver’s seat.","filter_flag":1}
{"title":"Emerging Innovation: Meet 6 Standout Consumer Goods Brands - Consumer Goods Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZW1lcmdpbmctaW5ub3ZhdGlvbi1tZWV0LTYtc3RhbmRvdXQtY29uc3VtZXItZ29vZHMtYnJhbmRz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZW1lcmdpbmctaW5ub3ZhdGlvbi1tZWV0LTYtc3RhbmRvdXQtY29uc3VtZXItZ29vZHMtYnJhbmRz0gEA?oc=5","id":"CBMiU2h0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZW1lcmdpbmctaW5ub3ZhdGlvbi1tZWV0LTYtc3RhbmRvdXQtY29uc3VtZXItZ29vZHMtYnJhbmRz0gEA","guidislink":false,"published":"Tue, 28 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=59, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZW1lcmdpbmctaW5ub3ZhdGlvbi1tZWV0LTYtc3RhbmRvdXQtY29uc3VtZXItZ29vZHMtYnJhbmRz0gEA?oc=5\" target=\"_blank\">Emerging Innovation: Meet 6 Standout Consumer Goods Brands<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Consumer Goods Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Emerging Innovation: Meet 6 Standout Consumer Goods Brands - Consumer Goods Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZW1lcmdpbmctaW5ub3ZhdGlvbi1tZWV0LTYtc3RhbmRvdXQtY29uc3VtZXItZ29vZHMtYnJhbmRz0gEA?oc=5\" target=\"_blank\">Emerging Innovation: Meet 6 Standout Consumer Goods Brands<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Consumer Goods Technology<\/font>","source.href":"https:\/\/consumergoods.com","source.title":"Consumer Goods Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Worx American homeowners are starting to learn what many European countries have already figured out: There’s no reason to suffer the summer heat to do yardwork when a robot can do the job for you. Just as the Roomba revolutionized vacuuming, Worx’s robotic lawnmowers are hoping to transform lawncare. The company’s latest innovation, the Landroid Vision (shown at right), makes things easier than ever. “We joke around internally that if you have to interact with a robot, is it truly a robot?” Todd Zimmerman, VP of product at Worx, tells CGT. “We want to bring more convenience and ease of use to the field.” Robotic mowers tend to cost about the same as a rider mower — somewhere in the $1,000 to $1,500 range — but in the U.S., they represent less than 5% of the U.S. lawnmower market. Part of the reason for that is existing models require owners to install boundary wire as a perimeter marker. The Landroid Vision, though, uses an onboard sensor and camera array that communicates with the mower’s neural network to avoid obstacles (like rocks, hoses, and plant beds) and identify yard boundaries. The company has spent the last two years developing the technology to translate camera images to its proprietary onboard processing system. Teaching a robot what is and isn’t grass (and what’s safe to mow over) isn’t as easy as it might seem. There are also security and safety issues to refine. For instance, if someone is foolish enough to pick up the mower while it’s operating, it instantly shuts down; should someone steal the system, it locks down, requiring a PIN code. Worx may not be as familiar as other names in the lawn care space, but Zimmerman says that’s not a concern for the company right now. “Sometimes, it’s okay to be No. 2, because you can gain an understanding of what people are frustrated with in the category and overcome those issues. … We want to bring more convenience and ease of use [to the lawn care industry].”","filter_flag":1}
{"title":"Roadmap for achieving net-zero carbon buildings by 2040 - Architecture AU","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vYXJjaGl0ZWN0dXJlYXUuY29tL2FydGljbGVzL3JvYWRtYXAtZm9yLWFjaGlldmluZy16ZXJvLWNhcmJvbi1idWlsZGluZ3MtYnktMjA0MC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vYXJjaGl0ZWN0dXJlYXUuY29tL2FydGljbGVzL3JvYWRtYXAtZm9yLWFjaGlldmluZy16ZXJvLWNhcmJvbi1idWlsZGluZ3MtYnktMjA0MC_SAQA?oc=5","id":"CBMiWGh0dHBzOi8vYXJjaGl0ZWN0dXJlYXUuY29tL2FydGljbGVzL3JvYWRtYXAtZm9yLWFjaGlldmluZy16ZXJvLWNhcmJvbi1idWlsZGluZ3MtYnktMjA0MC_SAQA","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vYXJjaGl0ZWN0dXJlYXUuY29tL2FydGljbGVzL3JvYWRtYXAtZm9yLWFjaGlldmluZy16ZXJvLWNhcmJvbi1idWlsZGluZ3MtYnktMjA0MC_SAQA?oc=5\" target=\"_blank\">Roadmap for achieving net-zero carbon buildings by 2040<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture AU<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Roadmap for achieving net-zero carbon buildings by 2040 - Architecture AU","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vYXJjaGl0ZWN0dXJlYXUuY29tL2FydGljbGVzL3JvYWRtYXAtZm9yLWFjaGlldmluZy16ZXJvLWNhcmJvbi1idWlsZGluZ3MtYnktMjA0MC_SAQA?oc=5\" target=\"_blank\">Roadmap for achieving net-zero carbon buildings by 2040<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architecture AU<\/font>","source.href":"https:\/\/architectureau.com","source.title":"Architecture AU","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Researchers at the University of New South Wales have produced a free online guide to help architects, engineers and planners create a net-zero carbon built environment by 2040. Race to net zero carbon: A climate emergency guide for new and existing buildings in Australia is a national reference guide that details critical information about best practice materials and construction for whole-of-life net zero carbon buildings. “Historically, most professionals have only focused on reducing the operational carbon footprints of buildings,” said professor Deo Prasad, lead researcher of the guide. “Operational carbon refers to what is required for the building to run once it is built, like energy use in heating or cooling. “There are significant amounts of emissions embedded in the materials and construction of the building itself and these need to be addressed and offset in order for our built environment to be truly net zero.” The guide is the first of its kind to detail a holistic approach to achieving zero carbon buildings. “Our guide goes deeper than just operational offsetting. It illustrates a ‘whole of life’ approach to buildings – considering where building material comes from, how they are transported to the construction site, and so on,” Prasad said. The guide advocates for retrofitting existing buildings and reducing the use of new material as the best way to minimise embodied carbon. However, when that is not possible, the guide provides a roadmap for low-carbon materials such as green steel and concrete. It also details how materials could be reused after a building has been demolished in a circular economy. “Timber, aluminium and glass can be reused or recycled somehow into new products,” Prasad said. “It’s [also] possible to avoid demolishing old or undesirable buildings as their concrete structures can stay put and the building can be refurbished.” Prasad said he hopes the guide will help the building industry move towards net zero construction as a norm, rather than the exception. Globally, the built environment accounts for 37 percent of greenhouse gas emissions, and in Australian the built environment is responsible for 21 percent of the country’s emissions. “While the global community is aiming for net zero by 2050, the building sector has much greater potential and opportunity to reach net-zero operational emissions by 2030 and a 60 percent reduction in embodied carbon by 2030,” Prasad said. “These are the goals our guide aims to achieve.” He added that, “Governments should mandate net-zero construction codes, which will push for best performance to achieve net zero. They should lead by example and ensure all public buildings are net zero carbon and provide subsidies and rebates to incentivise change. “It’s not only about eliminating worst practices. It’s about adopting best practices, which, policy-wise, is also economically the right thing to do. “Our guide has all the knowledge the industry needs to achieve net zero – a roadmap that shows it can be done and, most importantly, the type of conversation clients can have with designers or government. “It’s essential that the industry – be it clients, government or designers – start speeding up the race to net zero carbon before it becomes too late in the climate emergency.” The guide is available for free on the UNSW Sydney website.","filter_flag":1}
{"title":"Tropicana launches two new juice flavours - Talking Retail","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRhbGtpbmdyZXRhaWwuY29tL3Byb2R1Y3RzLW5ld3MvZ3JvY2VyeS90cm9waWNhbmEtbGF1bmNoZXMtdHdvLW5ldy1qdWljZS1mbGF2b3Vycy0wMy0wMi0yMDIzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRhbGtpbmdyZXRhaWwuY29tL3Byb2R1Y3RzLW5ld3MvZ3JvY2VyeS90cm9waWNhbmEtbGF1bmNoZXMtdHdvLW5ldy1qdWljZS1mbGF2b3Vycy0wMy0wMi0yMDIzL9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LnRhbGtpbmdyZXRhaWwuY29tL3Byb2R1Y3RzLW5ld3MvZ3JvY2VyeS90cm9waWNhbmEtbGF1bmNoZXMtdHdvLW5ldy1qdWljZS1mbGF2b3Vycy0wMy0wMi0yMDIzL9IBAA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRhbGtpbmdyZXRhaWwuY29tL3Byb2R1Y3RzLW5ld3MvZ3JvY2VyeS90cm9waWNhbmEtbGF1bmNoZXMtdHdvLW5ldy1qdWljZS1mbGF2b3Vycy0wMy0wMi0yMDIzL9IBAA?oc=5\" target=\"_blank\">Tropicana launches two new juice flavours<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Talking Retail<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tropicana launches two new juice flavours - Talking Retail","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LnRhbGtpbmdyZXRhaWwuY29tL3Byb2R1Y3RzLW5ld3MvZ3JvY2VyeS90cm9waWNhbmEtbGF1bmNoZXMtdHdvLW5ldy1qdWljZS1mbGF2b3Vycy0wMy0wMi0yMDIzL9IBAA?oc=5\" target=\"_blank\">Tropicana launches two new juice flavours<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Talking Retail<\/font>","source.href":"https:\/\/www.talkingretail.com","source.title":"Talking Retail","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Strawberry & Banana is a not-from-concentrate juice blend of apple, strawberry, banana and blueberry. Designed as a breakfast juice, the flavour will join Tropicana’s classic fruit juice range and will be available in a variety of size formats including 1.7-litre (RRP £4.40), 1.35-litre (RRP £3.80) and 850ml (RRP £2.75). Pineapple & Pink Guava Crush will join Tropicana’s Sensations range, which the brand hopes will cater to “rest of the day” moments outside of breakfast. The juice is a blend of apples, pineapple and pink guava and comes in an 850ml bottle with an RRP of £2.75. Tropicana said the Pineapple & Pink Guava juice can also be enjoyed as a mocktail, “a growth product category in 2023.” Available to trade at the end of February 2023, the dual product launch will be supported by a cross-channel marketing strategy across digital and shopper marketing. The packaging of the new products are labelled as carbon neutral and recyclable, and highlight the juices’ hero fruit ingredients as well as their health benefits. Caroline Wilding, head of marketing, Juices UK at Tropicana Brands Group, said: “Tropicana is committed to creating delicious fruit juices that can be enjoyed from breakfast through to dinner, and these new additions are a testament to that. “Strawberry & Banana is a family favourite flavour combination that will keep everyone happy during the morning breakfast rush, whereas Pineapple & Pink Guava Crush extends our positioning as a go-to for rest of the day occasions with its mocktail-inspired fruit blend. “In 2023, we are continuing our partnership with Too Good To Go, giving consumers a little nudge to help the planet by reducing their food waste whilst also saving a little money for themselves.”","filter_flag":1}
{"title":"How Are Phone Manufacturers Improving Their Sustainability? - Mazuma Mobile","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA","guidislink":false,"published":"Thu, 02 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=33, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">How Are Phone Manufacturers Improving Their Sustainability?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mazuma Mobile<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Are Phone Manufacturers Improving Their Sustainability? - Mazuma Mobile","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">How Are Phone Manufacturers Improving Their Sustainability?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mazuma Mobile<\/font>","source.href":"https:\/\/www.mazumamobile.com","source.title":"Mazuma Mobile","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Sustainability is at the forefront of every business owner’s mind worldwide. It is even more so for the manufacturers of smartphones. As the demand for phones grows, so does the demand for environmentally responsible products and the need to address the growing concern of e-waste internationally. At Mazuma, sustainability and providing new life for old phones is at the heart of our business. However, how much effort is being taken by the industry giants responsible for making the phones? We look at what actions are being taken, particularly with the two biggest giants in tech, to reduce the impact of smartphones on the environment. Recycling and reusing materials There are many ways the big manufacturers are improving production; the most important is using recycled materials. For instance, Samsung, the leading android phone manufacturer, uses ocean-bound plastics such as discarded fishing nets to produce plastic components within their Galaxy range of phones. They also use it for the casings and details of their wearable tech, such as earbuds and smartwatches. Apple, another big player in the world of phones, also reuses recycled materials to create its range of iPhones. For example, in 2021, 59% of all the aluminium Apple used within its products came from recycled sources. In addition, all new iPhones, iPads, AirPods and Macs feature 100% recycled tin in their main logic motherboard solder. However, one of the biggest issues faced by every phone manufacturer was the use of plastic. The most significant way the tech industry solves this problem is by using PCM plastic (Post Consumer Material). This plastic has already lived its life in the form of something else, such as plastic bottles and carrier bags. By recycling these everyday items, the plastic is made into pellets that can be remoulded into new products. The use of PCM is part of many industries’ efforts to aim for a circular economy in which products are put back into the circle of production with the help of phone recycling facilities like ours. Reducing the carbon footprint of your phone A carbon footprint measures the total amount of greenhouse gases emitted into the atmosphere due to human activities, including burning fossil fuels, deforestation, and other land use changes. It is often expressed in terms of equivalent tons of CO2 and is used to understand and quantify the environmental impact of individual activities, organisations, and entire countries. Samsung is promising to reduce carbon emissions with its range of smart technology, allowing users to lower their own carbon footprints with their product. They also offer their action plan, which addresses the risks within their carbon footprint and their goals to lower these each year to improve their sustainability. Apple also products that reduce the user’s carbon footprint, with the likes of their Apple TV box, which reduces carbon footprint by up to 34%. Apple has also been carbon neutral since 2020 and aims to have all their products carbon neutral by 2030. Companies can improve their carbon footprint in various ways, including carbon offsetting, strict supply chain management and renewable energy sources supplying factories and offices. Most large phone manufacturers are being transparent in their aims to become more sustainable each year, with reports and plans visible on their websites. So if you are ever curious about the business behind your tech, check them out before buying their products for a more eco-conscious purchase. Developing longer-lasting products We all remember the scandal from 2018, when the Italian competition authority investigated the big two phone brands and their curious updates, making some smartphones within their older collections obsolete. Both companies were fined, and although they claimed they were unaware of the issues caused to older phones by the updates, it sparked a debate on the ethical practices of making smart devices poorly designed for future updates. The issue with smartphones is that they have come a long way from when they first came out, and naturally, phones will get left behind. For example, the iPhone 14 is a long way more advanced than the iPhone 6S, so developing updates that suit both iPhones and everything in between is not entirely practical. However, instead of making the phones obsolete, the newer updates will simply leave the phone vulnerable due to a lack of support. Any updates will no longer harm your devices, but you will be at risk for cyber-attacks. So, if you have an older device, why not consider getting a good price for it now with our sell my iPhone services? Environmentally friendly packaging One of the biggest issues when buying a new phone was all the unnecessary packaging it came with. Like most tech, there was an array of plastic wrap, polystyrene and plastic shells to keep everything in place. This is not only a waste of resources but also a nightmare when it comes to bin day after Christmas. To combat this waste, many phone companies are addressing their packaging and what is really required for a new phone. The plugs are one of the most noticeable recent removals from the box of new phones. Although these are essential for providing power for your phone to charge, most homes already have an abundance of them from previous phones and devices. Many homeowners are also changing their plug sockets to USB-compatible sockets removing the need for plugs altogether. This allowed many big brands of phones to take the plug out of the box, which helped to reduce unnecessary e-waste and even made the box much smaller, needing fewer materials. If you have bought a phone recently, you may have noticed very little printed on the box. In fact, if you were to buy a Samsung TV, you would see it is almost entirely brown with minimal information. Lack of printing helps reduce the ink needed to print onto the box, which also became an issue when the box needed to be recycled. This new basic design is much more environmentally friendly and can be done using pre-recycled materials. Next time you get a new phone, consider what is missing since the last time you bought one. Companies are working throughout the entire supply chain to reduce unnecessary packaging for products. Even the instruction booklet which comes with your shiny new phone is minimal, with everything else accessible online through the help of QR codes and links. The change is minimal but has greatly impacted the waste produced and the overall carbon footprint of a device. Trade-in services and phone recycling Obviously, achieving a circular economy, the aim of most tech industries, can only be made possible by selling your old phone back to the manufacturer. Most big names in phones will offer some form of a phone trade-in when you upgrade to help minimise the products heading to landfill and allow them to recycle the parts within their new phones. However, whilst we may not be able to manufacture the latest iPhone or Galaxy S24 (although you can buy many of the latest phones through our refurbished phones site), we do know a thing or two about recycling. Much like the industry’s tech giants, we at Mazuma are also looking to achieve a more sustainable planet. Our mission is to provide new old phones with new life due to programs such as our incredible Samsung trade-in services. Unlike the big names, recycling phones is our only mission, which means we are pretty much the experts. We offer some of the best prices online for many iPhones and android phones instead of a set figure. So, for example, when you sell an iPhone with us, we don’t provide you discounts or money off a new product; we offer you cash directly to your bank, often the same day we get your phone. By selling your broken phones with Mazuma, you are still contributing to the circular economy, but you are getting more money for your device and no pressure from us to buy a new one. Our services are straightforward, easy, and honest. So when it comes to trading in your phone to help promote a sustainable future, make sure you are doing so with someone who is an expert in recycling phones.","filter_flag":1}
{"title":"These companies are using bacteria to recycle electronic waste - Fairplanet","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmZhaXJwbGFuZXQub3JnL3N0b3J5L2VsZWN0cm9uaWMtd2FzdGUtcmVjeWNsaW5nLWJhY3RlcmlhL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmZhaXJwbGFuZXQub3JnL3N0b3J5L2VsZWN0cm9uaWMtd2FzdGUtcmVjeWNsaW5nLWJhY3RlcmlhL9IBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3LmZhaXJwbGFuZXQub3JnL3N0b3J5L2VsZWN0cm9uaWMtd2FzdGUtcmVjeWNsaW5nLWJhY3RlcmlhL9IBAA","guidislink":false,"published":"Mon, 06 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=37, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmZhaXJwbGFuZXQub3JnL3N0b3J5L2VsZWN0cm9uaWMtd2FzdGUtcmVjeWNsaW5nLWJhY3RlcmlhL9IBAA?oc=5\" target=\"_blank\">These companies are using bacteria to recycle electronic waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fairplanet<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"These companies are using bacteria to recycle electronic waste - Fairplanet","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmZhaXJwbGFuZXQub3JnL3N0b3J5L2VsZWN0cm9uaWMtd2FzdGUtcmVjeWNsaW5nLWJhY3RlcmlhL9IBAA?oc=5\" target=\"_blank\">These companies are using bacteria to recycle electronic waste<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fairplanet<\/font>","source.href":"https:\/\/www.fairplanet.org","source.title":"Fairplanet","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Scientists and researchers are embracing the use of non-harmful microbes-bacteria, fungi and algae to achieve a \"clean\" recycling of electronic waste, as conventional methods have come under scrutiny for relying on toxic chemicals that are harmful to the environment and human health. The explosive ubiquity of electronic gadgets is becoming a growing a menace, as their disposal continues to pose a major threat to human health and the environment. Based on current figures, over 52 million tonnes of electronic waste are generated annually across the globe. In 2022, researchers estimated that out of the roughly 16 billion phones owned by people around the world, an estimated 5.3 billion would become waste. The burden of Electronic waste A bulk of electronic waste containing hazardous materials such as mercury is dumped illegally and ends up in landfills or incinerated. These materials then leak into the soil, pollute water bodies and enter the food chain. Such was the case at an electronic waste disposal site in Central Accra, Ghana, where hens’ eggs were found to have chlorinated dioxins (a toxic material) at levels that were 220 higher than those permitted in Europe. Countries in the Global South have been bearing the brunt of the crisis, as wealthy nations continue to dump thousands of tonnes of electronic waste in the form of old computers, phones and tablets presented as donations. Researchers have begun to sound the alarm on this trend, warning that carbon emissions from the production, use and disposal of electronic devices will account for 14 percent of all emissions by 2040, an equivalent of one half of the emissions from the world transport sector today. The situation is predicted to reach critical levels in 2050, with up to 120 million tonnes of discarded electronics, if nothing is done. There have been multiple attempts at recycling such waste through various modern interventions, among them Pyrometallurgy and hydrometallurgy. But the latter involve the use of high temperatures and hazardous chemicals, which consume a great deal of energy and are harmful to both human health and the environment. Yet the recycling industry - estimated at USD 62.5 billion - continues to explore opportunities as the demand for precious metals soars to satiate the growing global appetite for electronic devices and as the availability of natural resources and rare earth elements dwindles. Is Clean recycling possible? As demand for eco-friendly, carbon-neutral technologies intensifies, researchers, scientists and private companies are exploring sustainable recycling options, among which is the use of beneficial bacteria and fungi in a process dubbed Bioleaching. Using non-toxic chemicals and less energy, the process has been hailed as the future of electronic waste recycling. \"At a time when the world is experiencing unprecedented availability of electronic gadgets - and dumping in equal measure, the biggest challenge has been [figuring out] how to safely discard them,\" Caleb Mtamisi, an environmentalist teaching at Kenyatta Universit and a vocal advocate for the recycling of e-waste, told FairPlanet. \"It is a big problem, especially in developing countries that do not have the requisite infrastructure to recycle,\" he added. \"This has far reaching environmental and health impacts. Numerous studies have pointed to the dangers that these countries are staring at with the e-waste menace.\" One of the companies that stepped up its efforts to provide biological e-waste recycling solutions is Mint Innovation, a New Zealand clean tech startup. Through a low-tech process of using naturally sourced microbes, the company is able to recover precious metals from crushed e-waste. Its bio-refinery in Sydney, Australia has potential to recycle more than 3,000 tonnes of e-waste, which can be repurposed to manufacture new products. The goal of the startup is to establish similar bio-refineries in all major cities around the world. Over in the UK, N2S, a company that offers IT lifecycle services, has been working with Coventry University to extract and recycle precious metals from electronic waste by using non-toxic bacteria. Coventry University has also extracted copper from computer circuit boards that were discarded and recycled them into high-quality foil using bioleaching, a process that could inspire industrial application. At the same time, IMC University of Applied Sciences Krems in Austria has been betting on bacteria and algae to recycle rare earth metals from electronic waste in a project dubbed REEgain. The initiative works with local waste management and recycling companies that supply electronic waste in a bid to promote inclusivity. Catalysing a circular economy Some experts state that in addition to reducing the harmful effects to human health and environment, the use of bacteria to recycle electronic waste is spurring a circular economy which they predict could have a market value of up to $4.5 trillion by 2030. \"Bioleaching has provided a unique model that not only guarantees safety of human health and environment, but harnessed a circular economy where what is produced doesn’t go to waste,\" noted Mtamisi, adding that, \"the process of that recycling fanned a market that is creating jobs.\" \"However,\" he cautioned, \"to make all this inclusive there is a need to bring into the equation manufacturers and producers of these electronics.\" Image by John Cameron.","filter_flag":1}
{"title":"Putting hydrogen to work on industrial heating | Imperial News - Imperial College London","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmltcGVyaWFsLmFjLnVrL25ld3MvMjQzMzkxL3B1dHRpbmctaHlkcm9nZW4td29yay1pbmR1c3RyaWFsLWhlYXRpbmcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmltcGVyaWFsLmFjLnVrL25ld3MvMjQzMzkxL3B1dHRpbmctaHlkcm9nZW4td29yay1pbmR1c3RyaWFsLWhlYXRpbmcv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vd3d3LmltcGVyaWFsLmFjLnVrL25ld3MvMjQzMzkxL3B1dHRpbmctaHlkcm9nZW4td29yay1pbmR1c3RyaWFsLWhlYXRpbmcv0gEA","guidislink":false,"published":"Mon, 27 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=58, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmltcGVyaWFsLmFjLnVrL25ld3MvMjQzMzkxL3B1dHRpbmctaHlkcm9nZW4td29yay1pbmR1c3RyaWFsLWhlYXRpbmcv0gEA?oc=5\" target=\"_blank\">Putting hydrogen to work on industrial heating | Imperial News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Imperial College London<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Putting hydrogen to work on industrial heating | Imperial News - Imperial College London","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LmltcGVyaWFsLmFjLnVrL25ld3MvMjQzMzkxL3B1dHRpbmctaHlkcm9nZW4td29yay1pbmR1c3RyaWFsLWhlYXRpbmcv0gEA?oc=5\" target=\"_blank\">Putting hydrogen to work on industrial heating | Imperial News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Imperial College London<\/font>","source.href":"https:\/\/www.imperial.ac.uk","source.title":"Imperial College London","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"A partnership between startup H2GO Power and Baxi will bring climate neutral heating to a wide range of industrial applications. H2GO Power, a hydrogen energy startup created at Imperial from research carried out at Cambridge University, has signed a partnership with major boiler manufacturer Baxi to develop systems that will decarbonise a wide range of industrial heating processes. Its first application will be using hydrogen to pre-heat natural gas before it enters the distribution system, without creating greenhouse gases. Dr Enass Abo-Hamed “This partnership is a key milestone for the company,” says Dr Enass Abo-Hamed, the company’s co-founder and Chief Executive. “Baxi is a market leader in the heating manufacturing industry, and it has chosen H2GO Power out of all the other solutions on the market as a partner to build new products with.” Hydrogen is a vital part of efforts to decarbonise the economy, both as a zero-carbon fuel in its own right, and as a means of storing energy from renewable sources. However, no-one has yet found an economic way of using pure hydrogen for industrial heating. This is the challenge that H2GO and Baxi have taken on. H2GO’s core technology is an innovative way of storing hydrogen. Instead of compressing the gas for storage in cylinders, its system allows hydrogen to be absorbed, stored and released in a safe, highly controlled way. This highly adaptable approach has been developed for a range of applications, from storing surplus renewable energy to industrial heating. This could stretch from the cement, glass, and ceramics industries, to chemicals, food and drink, and paper and pulp. \"Hydrogen is a viable alternative net zero energy carrier that can meet the needs of these hard to decarbonise sectors, and can be used for mass storage of variable renewables – such as wind and photovoltaics – to use at times of peak demand for heat,” says Karen Boswell, Managing Director at Baxi UK & Ireland. “Developing practical, cost-effective ways of storing hydrogen addresses both decarbonisation and energy reliability, making this project a particularly interesting solution for multiple use cases.\" Developed at Imperial H2GO’s technology is based on research carried out at the University of Cambridge, which was then developed further and commercialised at Imperial. In 2017, the H2GO team took part in the Cleantech Accelerator run by Imperial for the Climate Knowledge Innovation Community (Climate KIC), which has since evolved into the Undaunted climate change innovation partnership. Professor Nigel Brandon Dr Abo-Hamed then continued to develop the company through a Royal Academy of Engineering Enterprise Hub Fellowship, in the laboratory of Professor Nigel Brandon in the Department of Earth Science and Engineering. “Imperial really welcomed us when we moved from Cambridge and I started the RAE fellowship,” she says. “They gave us mentorship and access to courses, and we worked alongside engineers from Nigel's lab, and ended up applying for grants with them. So, we developed and learned from everything that was around us at Imperial.” Professor Brandon also joined H2GO Power’s advisory board, sharing his expertise as a scientist and a founder of the startups Ceres Power and RFC Power. “He's always been a mentor, and has advised me on a lot of matters in addition to technology development, such as how to think about the future of the product, and how to anticipate obstacles and design our way around them. The greatest leadership lessons I have acquired, I actually learnt from him.” H2GO Power joined Imperial’s White City Incubator in 2020, and currently has offices and laboratories there and in the near-by Scale Space. Inside the partnership Within the new partnership, Baxi will provide boilers that run on pure hydrogen, while H2GO will engineer the systems needed for each application. “Our teams have integration, automation and software capability, so that they can take the hydrogen boiler, and integrate it with a hydrogen storage system and a hydrogen production system,” Dr Abo-Hamed explains. We can take the hydrogen boiler, and integrate it with a hydrogen storage system and a hydrogen production system. Dr Enass Abo-Hamed H2GO Power While this approach will work with any production method for hydrogen, the ideal is to use green hydrogen, created using renewable sources such as solar or wind power. “Since a lot of hydrogen will be generated in this way, it needs to be stored in a very controlled and a very safe way, and that’s where our solution plays an important role.” The system also requires software able to manage the connection between the renewable energy source, hydrogen generation and consumption. “Our software is able to predict the best time to generate hydrogen, the best time to store it, and best time to use it,” Dr Abo-Hamed says. “When that is linked to demand from the user, there is no waste – economic waste, in this case – in the process. That matters, because costs are always a disadvantage with new technologies, and controlling them is the key to making them profitable and appealing to customers.” Getting gas moving The partnership includes plans for an industrial-scale demonstration project, hosted by Northern Gas Networks, which will test a system for safe, carbon-neutral gas pre-heating. Before gas can be supplied to homes and businesses through the distribution network, its pressure must be reduced. This process can cause the gas to freeze, so pre-heating takes place to allow the gas to flow. Traditional pre-heating units are highly energy and cost-intensive, often burning gas to create the heat, emitting carbon dioxide in the process. The system that H2GO Power and Baxi will test, called heat-in-the-box, sets out to lower the cost of pre-heating, while cutting out additional carbon emissions entirely. “If successful, the pilot will be a game changer for the UK and beyond,” says Dr Abo-Hamed. “We are also pleased to have the backing of the UK government from its £1 billion Net Zero Innovation Portfolio, which will go a long way in delivering our long-term ambition to reduce energy costs while playing a role in the transition.”","filter_flag":1}
{"title":"55 Women-Owned Businesses That Give Back & Do Good - Good Good Good","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5","id":"CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA","guidislink":false,"published":"Tue, 28 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=59, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5\" target=\"_blank\">55 Women-Owned Businesses That Give Back & Do Good<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Good Good Good<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"55 Women-Owned Businesses That Give Back & Do Good - Good Good Good","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiO2h0dHBzOi8vd3d3Lmdvb2Rnb29kZ29vZC5jby9hcnRpY2xlcy93b21lbi1vd25lZC1idXNpbmVzc2Vz0gEA?oc=5\" target=\"_blank\">55 Women-Owned Businesses That Give Back & Do Good<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Good Good Good<\/font>","source.href":"https:\/\/www.goodgoodgood.co","source.title":"Good Good Good","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"When it comes to making ethical and intentional purchases, it’s important to consider our carbon footprints, the labor practices of a company — and who owns and operates that company. And women-owned and operated businesses are often at the forefront of ethical consumption. It’s a theory that has even threatened women’s success: Women have greater moral reservations about ethical compromises in business. And you know what? We’re simply thrilled that many women business owners are strong in their convictions for a more ethical, just economy. Of course, gender is a complex, personal socially constructed concept, but it has very real implications on how we live, work, and thrive in our society. The systems that keep women from succeeding are the same systems that raise boys and men to prioritize capital over compassion — and we’re here to celebrate the people who are paving the way to the end of the patriarchy. According to the World Economic Forum, women started 49% of all new businesses in the U.S. in 2021, up 28% from just two years prior. More women are becoming entrepreneurs than ever before — and businesses owned by Black women represent the highest rate of growth in the number of total women-owned businesses. However, in the U.S., men still outnumber women two to one when it comes to business ownership. We’re here to remind you that you don’t need an excuse like Women’s History Month or International Women’s Day to support a woman-owned business. In fact, we’ve made it even easier to shop from diverse, women-run companies and social enterprises that make the world a better place year-round. Here is the ultimate guide to women-owned businesses — in fashion, home goods, health and beauty, food, lifestyle, pets, and media — that give back and do good. By the way, some of the links in this article are affiliate links, which means if you make a purchase after clicking a link, we may earn a commission at no extra cost to you. Thank you! ‍ The best women-owned and women-led businesses that make a difference Clothing & Accessories wearwell Co-founders: Erin Houston & Emily Kenney What’s good: wearwell is an ethical and sustainable clothing and accessory brand, carrying products specifically aligned with values of secondhand shopping, size inclusivity, vegan values, and uplifting women- and Black-owned businesses. 1% of every wearwell purchase is donated to a nonprofit of the customer’s choice, like FABSCRAP, Black Girl Ventures, and Holler Health Justice. → Shop wearwell ‍ Girlfriend Collective Co-founder & creative director: Ellie Dinh What’s good: Girlfriend Collective makes apparel and underwear made with 80% recycled plastic bottles (RPET). The brand also has a recycling program (the ReGirlfriend program) to help end the waste produced by clothing and contribute to a circular economy. → Shop Girlfriend Collective ‍ For Days Co-founders: Kristy Caylor & Mary Saunders What’s good: For Days accepts your pre-loved clothes and gives you $20 in Closet Cash toward your next purchase in the brand’s online shop, where you can buy new sustainable items and contribute to a new model of circular fashion. Also, 1% of every For Days purchase is donated to a nonprofit of your choice, like The Loveland Foundation or Every Body Texas. → Shop For Days ‍ Subset Co-founders: Cayla O’Connell & Lauren Sagadore What’s good: Subset (formerly Knickey) is a sustainable underwear brand that prioritizes the use of low-impact materials for an eco-friendly and ethical production cycle. The brand also has a recycling program and has recycled over 750,000 items. → Shop Subset ‍ INK & ALLOY Founder & CEO: Gretchen Hollingsworth What’s good: INK+ALLOY is an accessory brand selling colorful, bold handmade products like jewelry, keychains, and purses. The company donates 5% of all proceeds to the education of girls in India. → Shop INK & ALLOY ‍ Lisa Says Gah Founder: Lisa Bühler What’s good: Lisa Says Gah is a clothing and accessory brand dedicated to slow, sustainable, and ethical manufacturing. With a history of charitable giving, the brand has contributed thousands of funds to organizations like The Loveland Foundation, Black Mamas Matter Alliance, Transition Projects, and more. → Shop Lisa Says Gah ‍ Richer Poorer Co-founder & CEO: Iva Pawling What’s good: Richer Poorer makes sustainable essential clothing items, made with recycled or ethically sourced materials. The brand gives back through the Carbon Fund, as well as Dress For Success Worldwide West, and a number of voting rights organizations. → Shop Richer Poorer ‍ Birdy Grey Co-founders: Grace Lee & Monica Ashauer What’s good: Birdy Grey is a bridesmaid dress and wedding essentials company that partners with The Princess Project to provide pre-loved dresses and accessories to girls in need for prom and other special events. → Shop Birdy Grey ‍ TomboyX Co-founders: Fran Dunaway & Naomi Gonzalez What’s good: TomboyX makes underwear, bras, swimwear and other essentials that are made to be comfortable for everyone, regardless of where they fall on the size or gender spectrum. A certified B Corp, TomboyX is ethical and eco-friendly and has a long history of charitable contributions to LGBTQ+ and social justice organizations. → Shop TomboyX ‍ Mejuri Co-founder & CEO: Noura Sakkijha What’s good: Mejuri is a sustainable luxury jewelry company that focuses on traceability and transparency in its craftsmanship, with over 80% of its gold coming from recycled sources. Mejuri also created the Empowerment Fund, which provides women and non-binary people with broader financial and educational resources to empower themselves. → Shop Mejuri ‍ Wildfang Co-founders: Emma Mcilroy, Taralyn Thuot, & Julia Parsley What’s good: Wildfang creates fun, gender-free clothing with inclusivity and sustainability in mind. The brand is Climate Neutral certified and gives back 1% of its annual revenue to causes that matter, sharing funds with organizations like Planned Parenthood, RAICES, ProjectQ, and more. → Shop Wildfang ‍ Home Goods Parachute Home Founder & CEO: Ariel Kaye What’s good: Parachute is a Climate Neutral certified home goods company that prioritizes ethics and responsibility. Investing in both environmental and social justice, Parachute leads carbon offset projects around the globe and has created the Home for Dreams initiative, which supports Black-owned businesses with capital, advisory meetings, and brand amplification. → Shop Parachute Pssst… Check out our sustainable bedding guide for more great options like Parachute! ‍ TUSHY Founder: Miki Agrawal What’s good: TUSHY is a bidet company fighting for clean butts and a clean planet. By helping to remove our dependence on toilet paper and water, TUSHY aims to create a more hygienic and sustainable bathroom experience. Plus, a portion of TUSHY profits goes to building community toilets in areas around the globe, fostering a revolution of “dignified defecation.” → Shop TUSHY ‍ Mustard Made Co-founders: Jess & Becca Stern What’s good: Mustard Made is a colorful and playful home organization brand made by and for moms. Based in the UK (but with offices and products in the U.S.), Mustard Made donates £5 from every order to Beam, which supports people experiencing homelessness to find secure housing, jobs, and training opportunities. → Shop Mustard Made ‍ Jungalow Founder: Justina Blakeney What’s good: Jungalow carries all kinds of unique home goods, decor items, and wallpaper that all start as hand-painted designs by founder Justina Blakeney. Aside from prioritizing sustainable materials and thoughtful manufacturing, Jungalow also plants two trees for every one product purchased. The brand also supports a number of charitable partners like Girls Who Code, The Rainforest Alliance, Southern Poverty Law Center, and more. → Shop Jungalow ‍ Our Place Co-founder & co-CEO: Shiza Shahid What’s good: Our Place sells kitchenware and home goods like pans, glassware, and more, all designed to bring people together around food and honor the traditions of immigrants and BIPOC communities. Many of Our Place’s items are made with partially recycled materials and every order is packaged 100% plastic-free. Additionally, Our Place works with nonprofits like Feeding America to make good food more accessible to all. → Shop Our Place Pssst… check out our shopping guide to recycled glassware, too! ‍ Baloo Living Founder & CEO: Elizabeth Grojean What’s good: Baloo Living is a weighted blanket company that embraces the comforts of deep pressure stimulation without compromising its eco-friendly values. Baloo is a member of the NYC Fair Trade Coalition and Ethical Brand Directory and practices carbon neutrality through a partnership with Sea Trees by Sustainable Surf (which replants mangrove forests!). Baloo also donates a portion of profits to Pajama Program, which supports children facing adversity by providing the means to a healthy bedtime. → Shop Baloo Living ‍ Lorena Canals Founder & designer: Lorena Canals What’s good: Lorena Canals rugs, designed by none other than Lorena Canals, use no chemicals in its production process. The company also created a “RUGCYCLED” collection that uses cotton leftovers and scraps from their other products to maintain a zero-waste status. The Lorena Canals factory is in India, where more than 170 artisans make each of the pieces by hand under fair trade practices. This is also home to the brand’s Sakûla Project, which provides food and education to low-income children in India. → Shop Lorena Canals Pssst… Check out our guide to sustainable rugs for more! ‍ MINNIDIP Founder: Emily Vaca What’s good: MINNIDIP is a designer inflatable pool brand to help everyone have a pool party! MINNIDIP regularly donates to charitable partners in areas of environmental conservation, animal rights, childhood cancer and homelessness, and social justice. → Shop MINNIDIP ‍ Health & Beauty BLK & GRN Founder: Dr. Kristian Edwards What’s good: BLK & GRN was created out of a desire to normalize access to non-toxic beauty products for Black women and to fund Black women entrepreneurs who care about the planet and the products they use every day. All products offered by BLK & GRN are ethically sourced and are made by over 136 Black artisans. These personal care items are safe for people and the planet and cultivate the Black community with every dollar spent. → Shop BLK & GRN Pssst… Check out our guide to Amazon alternatives for more! ‍ OUI The People Founder: Karen Young What’s good: Personal care brand OUI The People creates sustainable skincare products and stainless steel razors that “go against the grain.” By prioritizing transparency from product to packaging, OUI The People makes bodycare cool for the planet. → Shop OUI The People ‍ Hero Cosmetics Co-founder & CEO: Ju Rhyu What’s good: Hero Cosmetics is a skincare brand (and home of the Mighty Patch). Designed to create effective solutions for acne, rosacea, and dark spots, Hero aims to remove the stigma of skin conditions — and treat them with care. The brand also works with Carbon Fund to reach full product carbon neutrality. → Shop Hero Cosmetics ‍ Megababe Founder: Katie Sturino What’s good: Megababe creates innovative products for normal body discomforts like boob sweat, chafing, and underarm bumps. Free of toxic chemicals and made with vegan ingredients, Megababe is good for you and the planet, all while embracing our beautiful bodies just as they are. → Shop Megababe ‍ Supergoop! Founder: Holly Thaggard, CEO: Amanda Baldwin What’s good: Holly Thaggard started Supergoop by working to make sunscreen available in schools in Texas. In addition to protecting its customers from the sun, Supergoop continues to donate SPF pumps to schools across the country through their Ounce by Ounce program. → Shop Supergoop ‍ RÓEN Beauty Founder & CEO: Tiffany Thurston Scott What’s good: Founded by clean makeup enthusiast Tiffany Thurston Scott, RÓEN Beauty creates makeup and beauty products formulated with ingredients that are vegan, gluten, and cruelty-free. The brand is also part of the Responsible Mice Initiative, which ensures that any mica used in makeup products is carefully selected from raw material manufacturers and 100% ethically sourced. The brand also partners with TerraCycle to help customers recycle their outer makeup packaging. → Shop RÓEN Beauty ‍ maude Founder & CEO: Éva Goicochea What’s good: maude makes body-safe sexual wellness essentials that are inclusive to all and made sustainably. The brand furthers its mission of accessible and inclusive sexual wellness by working closely with organizations like Advocates for Youth and SIECUS (Sexuality Information and Education Council of the United States)! → Shop maude → Explore our full reviews of all maude sex toys, maude lubes, and other maude products ‍ Pink Moon Founder & CEO: Lin Chen What’s good: Pink Moon is a skincare and wellness brand founded on the owner’s long-held practices of Traditional Chinese Medicine, Reiki, and Astrology. By partnering with EcoCart to provide carbon-neutral shipping, Pink Moon has offset over 334,000 pounds of carbon while providing its signature eco-conscious products. Pink Moon also donates 1% of every purchase to a nonprofit of your choice, like Animal Haven and Womankind. → Shop Pink Moon ‍ SAALT Co-founder & CEO: Cherie Hoeger What’s good: SAALT is on a mission to “bring periods out of the dark ages” by creating reusable, safe menstrual products for all. With menstrual discs and cups, as well as period underwear, the brand aims to make having a period better for the planet — and in general! A certified B Corp, SAALT also donates 2% of its revenue to provide period care to regions with the most need, and help fund initiatives in menstrual health, education, and sustainability. The brand has donated over 52,000 period products, cleaned up over 78,000 pounds of trash, and funded over 373,000 days of school for girls around the globe. → Shop SAALT ‍ Rael Co-founders: Yanghee Paik, Aness An & Binna Won CEO: Yanghee Paik What’s good: Rael is a holistic wellness brand that promotes full-cycle care (so they have goods for periods and skincare!), using cruelty-free and eco-conscious ingredients. Embracing Korean beauty science, Rael aims to provide high-performing period care across the globe. Rael is also on a mission to spread menstrual dignity to all, working with charitable partners like #HappyPeriod and I Support The Girls. → Shop Rael ‍ Ritual Founder & CEO: Katerina Schneider What’s good: Ritual was created when founder Katerina Schneider couldn’t find a prenatal vitamin she felt she could trust — so she set out to make her own. Ritual creates vitamins with completely traceable ingredients, from farms and suppliers that use regenerative agriculture practices. A certified B Corp, Ritual is also committed to its sustainability goals, aiming to have 100% sustainable packaging by 2025 and reach net zero emissions this year. → Shop Ritual ‍ Food Seattle Chocolate Co. Owner & CEO: Jean Thompson What’s good: Eating sweets has never been so good. Seattle Chocolate Co, and its sister company jcoco, make up an ethical chocolate umbrella that gives back. The company’s origin chocolate is directly sourced from small Peruvian Farms and it uses Rainforest Alliance Certified cocoa in its large line of products. As of 2022, the brand is also certified carbon neutral! Best of all, Seattle Chocolate Co. donates 10% of its net profits to Girls Inc, and jcoco donates fresh servings of food to those in need with every purchase. Partnering with food banks in Washington, California, and New York, the company has donated nearly 4 million servings of food. → Shop Seattle Chocolate Co. ‍ Sips By Founder & CEO: Staci Brinkman What’s good: A top-rated tea club and subscription service, Sips By works with hundreds of tea brands across the globe to bring people together over a steamy mug of tea. Sips By partners include other women-owned brands, as well as BIPOC-owned, AAPI-owned, and LGBTQ+-owned small businesses that practice ethical and sustainable sourcing. → Shop Sips By ‍ Fly By Jing Founder & CEO: Jing Gao What’s good: Fly By Jing creates spicy Schezwan sauces, spices, and dumplings inspired by the flavors of founder Jing Gao’s hometown of Chengdu. With bold, soulful tastes and bright design, Fly By Jing highlights the personal cultural histories of its founder — and the AAPI community. Adding a little spice to the fundraising scene, Fly By Jing has also worked with charitable partners like St. Jude Children’s Hospital and BeChinatown. → Shop Fly By Jing ‍ Diaspora Co. Founder & CEO: Sana Javeri Kadri What’s good: Sana Javeri Kadri started Diaspora Co. when she was 23 in 2017, selling just one item: Pragati Turmeric. Her desire was to create a radically new, equitable spice trade. Today, Diaspora Co. sources 30 single-origin spices from 150 farms across India and Sri Lanka, paying farm partners an average of over six times above the commodity price, investing in land stewardship, climate resistance, and delicious food systems. Part of this work is through the company’s Farm Worker Fund, which invests in the social and economic well-being of over 850 farm workers in South Asia. Diaspora Co. has also provided healthcare access to 25 women in the farm community. → Shop Diaspora Co. ‍ Women’s Bean Project Founder: Jossy Eyre, CEO: Tamra Ryan What’s good: The Women’s Bean Project is a nonprofit social enterprise that provides transitional employment and self-sufficiency to women experiencing poverty. Making nourishing products while nourishing the community, Women’s Bean Project now sells products through over 1,000 retailers, and has helped to keep 95% of their program graduates employed a year after completing their program. → Shop Women’s Bean Project ‍ Omsom Co-founders: Vanessa Pham & Kim Pham What’s good: Sisters Vanessa and Kim Pham created Omsom to offer sauce packets and starters that celebrate the multitudes of Asian flavors, stories, and communities. While opening up diverse flavor profiles and having conversations about big topics like xenophobia and the “ethnic aisle” in the grocery store, Omsom doesn’t shy away from being loud and proud. Through their brand, the duo has also worked to give back to the AAPI community, donating to Heart of Dinner, to feed AAPI elders in New York City. → Shop Omsom ‍ Partake Founder & CEO: Denise Woodard What’s good: Partake was born out of a mom’s desire to make tasty snacks for her daughter, who has many food allergies. Selling cookies, breakfast and baking mixes, and snack packs, every offering at Partake is certified gluten-free, non-GMO, and vegan. They are also free of the top nine allergens: wheat, tree nuts, peanuts, milk, eggs, soy, fish, sesame, and shellfish. While championing food inclusivity (did you know Black children are at a significantly higher risk for developing food allergies?) Partake also works with organizations like No Kid Hungry to fight food insecurity. Denise also founded Black Futures in Food & Beverage, an annual fellowship program that mentors HBCU students to help them secure internships and jobs in the food industry. → Shop Partake ‍ Buchi Co-Founders: Jeannine Buscher & Sarah Schomber What’s good: Buchi is a kombucha brand dedicated to community, collaboration, and culture (pun intended). Ingredients are sourced through closed-loop, carbon-neutral sugarcane processes, and for other ingredients, preference is given to independent, women-owned, and minority-owned suppliers. Buchi also partners with One Tree Planted to work on reforestation projects around the world. → Shop Buchi ‍ Lifestyle Package Free Shop Founder & CEO: Lauren Singer What’s good: Package Free Shop is your one-stop shop for sustainable everyday items. With zero or minimal packaging, every item sold by Package Free Shop can either be composted, reused, refilled, or recycled. The brand encourages shoppers to lean into a planet-forward lifestyle, and since its launch in 2017, has diverted 132 million plastic bags, 48 million plastic straws, and 3.8 billion plastic water bottles from oceans and landfills. → Shop Package Free Shop ‍ Thistle Farms Founder & President: Becca Stevens CEO: Tasha Kennard What’s good: Thistle Farms is a nonprofit social enterprise that makes candles, lotions, essential oils, and more. Not only does every purchase support women survivors of trafficking, prostitution, and addiction — but the organization also houses residents in a therapeutic setting that offers them housing, healthcare, therapy, work, and community. → Shop Thistle Farms ‍ Stasher Founder: Kat Nouri CEO: Shannon Morgan Stearns What’s good: Stasher creates alternatives to plastic bags, making it easy to reduce food and plastic waste. In fact, since its founding, the company has saved over 5.5 billion single-use plastic bags from entering waterways and oceans. Stasher also donates 1% of its sales to environmental nonprofits, totaling over $1.3 million in donations to date. → Shop Stasher ‍ The Little Market Co-founders: Lauren Conrad and Hannah Skvarla What’s good: The Little Market is a nonprofit fair trade shop that features ethically-sourced and artisan-made products. By celebrating individual artisans and their cultural techniques and traditions, the Little Market brings attention to social justice and human rights issues while extending opportunities for people around the world. → Shop The Little Market ‍ Marley’s Monsters Owner & president: Sarah Dooley What’s good: Marley’s Monsters creates handmade reusable products UNpaper towels, cloth napkins, dusters, and more. These sustainable alternatives help minimize your carbon footprint and save trees, all while making your home a bit more colorful. Marley’s Monsters also diverts all of its fabric waste by donating scraps to St. Vincent de Paul Society of Lane County and ENVIA Fashion, where they are upcycled into other new products like jewelry, hair accessories, and more. → Shop Marley’s Monsters ‍ Blueland Co-founder & CEO: Sarah Paiji Yoo What’s good: Blueland is a Climate Neutral certified B Corp that designs reusable and refillable cleaning products like laundry essentials, hand soaps, cleaning sprays, and more. Since 2019, Blueland products have helped eliminate over a billion single-use plastic bottles from landfills and oceans. → Shop Blueland ‍ Pets Rowan Co-founders: Michelle Arnau & Sally Clarke What’s good: Rowan is reinventing coat care with naturally-derived formulas made with human-grade, vet-approved ingredients that keep your pup’s skin healthy, fur shiny, and smelling like coconuts (there’s even dry shampoo for dogs!). Plus, 1% of every purchase is donated to a nonprofit of your choice, like The Street Dog Coalition or Sage Compassion for Animals. → Shop Rowan ‍ Springer Co-founder & CEO: Shannon Ross VP of Finance & COO: Diana Ross What’s good: Springer creates innovative products for dogs and their parents, like travel bottles, walking gear, and more. As a member of 1% for the Planet, Springer also donates 1% of its sales to nonprofits that protect the environment — because there’s no better playground for pups than Mother Earth. → Shop Springer ‍ Dandylion Founder & CEO: Carolyn Chen What’s good: Dandylion is a dog skin and coat care company with natural products created in collaboration with vet dermatologists, chemists, groomers, and over 100 dog parents. Products — like this no-rinse paw cleanser — are pH-balanced and formulated with sustainably sourced ingredients that are vegan and cruelty-free. All packaged with recycled, recyclable, compostable, or biodegradable options — often by Chen and her family themselves. Dandylion also gives back to animal rescue organizations like Hope For Paws. → Shop Dandylion ‍ Cat Cave Co. Founder & CEO: Holly Hudson What’s good: Cat Cave Co. makes cat beds and products from ethically-sourced, organic merino wool. The brand pays its workers 200% the average wage and gives back to local shelters and rescues. → Shop Cat Cave Co. ‍ Dog Threads Co-founder & CEO: Gina Marie Davis What’s good: Offering a large collection of matching dog and human apparel items, Dog Threads donates a portion of each purchase to an animal rescue nonprofit to help shelter animals in need. The brand also recycles its scrap fabric to create donated dog beds! → Shop Dog Threads ‍ FOUND My Animal Co-founders: Bethany Obrecht and Anna Conway What’s good: FOUND My Animal sells rope leashes, collars, pet apparel, and accessories that promote animal adoption. Unique to each leash is a simple, numbered brass tag that reads “FOUND” and a portion of all sales go to support animal welfare and rescue organizations. Pets available for adoption are also widely shared across the brand’s social media pages. → Shop FOUND My Animal ‍ Media Pantsuit Politics Co-founders: Sarah Stewart Holland & Beth Silvers What’s good: The hosts of the Pantsuit Politics podcast take a different approach to the news, looking at politics through lenses of nuance, compassion, and care. → Listen to Pantsuit Politics ‍ The Newsworthy Founder: Erica Mandy Erica Mandy is an award-winning broadcast journalist and former CBS news reporter who started The Newsworthy, a daily news podcast to help people stay informed in a convenient, unbiased, and fun way. Her show empowers hundreds of thousands of listeners to engage more deeply with the world around them. → Listen to The Newsworthy ‍ The GIST Co-founders: Ellen Hyslop, Jacie deHoop & Roslyn McLarty What’s good: We all love a great newsletter! The GIST is a fan-first sports media platform that is reinventing the dialogue around sports by providing equal coverage of women’s and men’s sports. Whether you’re checking out the newsletter or listening to the podcast, the GIST will be there with bit-sized and badass sports coverage. → Subscribe to The GIST ‍ The 19th News Co-founder & CEO: Emily Ramshaw Co-founder & publisher: Amanda Zamora Editor-in-Chief: Julia B. Chan What’s good: The 19th is a nonprofit newsroom beloved for its reporting at the intersection of gender, politics, and policy. Supported by members, philanthropy, and corporate underwriting, the 19th offers free-to-consume and free-to-publish journalism — especially produced for women, women of color, and the LGBTQ+ community. → Become a member of The 19th ‍ Girlboss Founder: Sophia Amoruso CEO: Lulu Liang What’s good: Girlboss is a modern media company providing women all over the world with the tools and mindset to succeed. Whether you’re reading the Girlboss Daily newsletter, shopping Girlboss goods created by women, or listening to Girlboss Radio, you’re uplifting ambitious women everywhere. → Subscribe to the Girlboss Daily newsletter","filter_flag":1}
{"title":"The banking trends that could shape the future - Forbes Australia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZvcmJlcy5jb20uYXUvbmV3cy9pbnZlc3RpbmcvdGhlLWJhbmtpbmctdHJlbmRzLXRoYXQtY291bGQtc2hhcGUtdGhlLWZ1dHVyZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZvcmJlcy5jb20uYXUvbmV3cy9pbnZlc3RpbmcvdGhlLWJhbmtpbmctdHJlbmRzLXRoYXQtY291bGQtc2hhcGUtdGhlLWZ1dHVyZS_SAQA?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LmZvcmJlcy5jb20uYXUvbmV3cy9pbnZlc3RpbmcvdGhlLWJhbmtpbmctdHJlbmRzLXRoYXQtY291bGQtc2hhcGUtdGhlLWZ1dHVyZS_SAQA","guidislink":false,"published":"Tue, 14 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=45, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZvcmJlcy5jb20uYXUvbmV3cy9pbnZlc3RpbmcvdGhlLWJhbmtpbmctdHJlbmRzLXRoYXQtY291bGQtc2hhcGUtdGhlLWZ1dHVyZS_SAQA?oc=5\" target=\"_blank\">The banking trends that could shape the future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Forbes Australia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The banking trends that could shape the future - Forbes Australia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZvcmJlcy5jb20uYXUvbmV3cy9pbnZlc3RpbmcvdGhlLWJhbmtpbmctdHJlbmRzLXRoYXQtY291bGQtc2hhcGUtdGhlLWZ1dHVyZS_SAQA?oc=5\" target=\"_blank\">The banking trends that could shape the future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Forbes Australia<\/font>","source.href":"https:\/\/www.forbes.com.au","source.title":"Forbes Australia","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"This year will not be without risk, but a move “back to business as usual” will be a focus for banking at a time of positive interest rates. Getty Images Banking trends will feel the gravity of a return to positive interest rates after many years of low and even negative rates, which meant that money was “effectively free”, says Alex Trott, Banking Sector Lead, Accenture Australia and New Zealand. He says deposit accounts are once again fuelling the industry, and balance sheets suddenly matter again. Accenture’s Banking Top 10 Trends for 2023 says the next 12 months will still see disruption but could be a year that heralds a return to “business as usual”. Rising interest rates will be “the rocket fuel that ignites” product innovation, says Trott, adding, “banks will quickly scrap their product silos and redirect their focus to the totality of their customers’ financial needs”. Cost savings gained from closing branches came at the expense of personal relationships and a deeper understanding of the customer’s needs and intentions. Digitalisation has made customers more self-reliant and less afraid of switching loyalties. “Banks will be inviting customers back,” says Trott, but the customer journey will be more tailored and purposeful and include non-financial products that help customers deal with challenges in housing, mobility and e-commerce.” Moving into the metaverse Trott says the metaverse will be one of the biggest trends in banking for years to come. “It’s hard to imagine everything the metaverse will encompass and it’s still a way off, but the trajectory is emerging.” – Alex Trott, Banking Sector Lead, Accenture Australia and New Zealand Banking’s leadership and cultures must catch up to the new demands of a more mobile, in-demand talent pool. “In the year ahead, we expect to see more banks changing their talent strategy: acknowledging the realities of the employment market and taking a more deliberate approach to aligning talent with the demands of the business strategy.” He says data will be treated like a product and help unlock the value it holds to help fundamentally change the way banking is done. “The real opportunity for banks that organise their data as a product is to collect the information once and then use it repeatedly,” he says. ‘Customer insights could be unlocked to sell new products proactively, and AI could help relationship managers in real time to dramatically improve customer interactions.” The role of fintech and digital-only banks is likely to diminish, and banks should be able to reassert themselves as the “rightful owners of banking” if they can develop or acquire market advantages and new technologies at reasonable prices and use these to enter new markets or expand their offerings. Banks will need to upskill on the personalisation of their offerings and focus on customer “intent” beyond the initial customer “journey”. Tackling legacy environments and creating modern banking operating systems for the next decades will be key to banks’ success in delivering more than their competitors. Risk is back, and the race to net zero Banks globally set aside around $834 billion in anticipation of a wave of credit losses due to the pandemic, but many came through relatively unscathed. However, the provision for an increase in delinquencies is up 9% on the same time in the previous year. “Clearly, banks believe the risk is back,” says Trott. On top of all of these changes, Trott says that banks are under growing pressure – by regulators as well as the gamut of their stakeholders – to play a constructive role in reducing greenhouse gas emissions. “They are expected not only to become carbon neutral in their own right but also to help … customers to transition to net zero. If these companies cannot or are reluctant to shrink their carbon footprint, banks will increasingly be expected to impose a risk premium or basically a higher cost of lending.” Look back on the week that was with hand-picked articles from Australia and around the world. Sign up to the Forbes Australia newsletter here.","filter_flag":1}
{"title":"Tropicana squeezes out two new flavours - Scottish Local Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnNscm1hZy5jby51ay90cm9waWNhbmEtc3F1ZWV6ZXMtb3V0LXR3by1uZXctZmxhdm91cnMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnNscm1hZy5jby51ay90cm9waWNhbmEtc3F1ZWV6ZXMtb3V0LXR3by1uZXctZmxhdm91cnMv0gEA?oc=5","id":"CBMiQWh0dHBzOi8vd3d3LnNscm1hZy5jby51ay90cm9waWNhbmEtc3F1ZWV6ZXMtb3V0LXR3by1uZXctZmxhdm91cnMv0gEA","guidislink":false,"published":"Mon, 06 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=37, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnNscm1hZy5jby51ay90cm9waWNhbmEtc3F1ZWV6ZXMtb3V0LXR3by1uZXctZmxhdm91cnMv0gEA?oc=5\" target=\"_blank\">Tropicana squeezes out two new flavours<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Scottish Local Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tropicana squeezes out two new flavours - Scottish Local Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnNscm1hZy5jby51ay90cm9waWNhbmEtc3F1ZWV6ZXMtb3V0LXR3by1uZXctZmxhdm91cnMv0gEA?oc=5\" target=\"_blank\">Tropicana squeezes out two new flavours<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Scottish Local Retailer<\/font>","source.href":"https:\/\/www.slrmag.co.uk","source.title":"Scottish Local Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Chilled juice brand Tropicana has added two new flavours to its range of pressed natural fruit juices: Strawberry & Banana joins the brand’s classic fruit juices range, while Pineapple & Pink Guava Crush is a tropical addition to its Sensations line-up. The new variants will be available to order from the end of February. Their launch will be supported by cross-channel activities across digital and shopper marketing. Strawberry & Banana is a pure juice blend of apple, strawberry, banana and blueberry. RSPs are £4.40 (1.7L), £3.80 (1.35L) and £2.75 (850ml). Pineapple & Pink Guava Crush is a blend of apples, pineapple, and on-trend pink guava. The RSP is £2.75 (850ml). It joins Tropicana’s Sensations range, which caters to ‘rest of the day’ moments outside of breakfast. Both contain Vitamin C to help support the normal function of the immune system and no added sugar. As with all Tropicana fruit juices, a 150ml glass counts as one of your five a day. The packaging of both new products is clearly labelled as carbon neutral and recyclable and showcases the hero ingredient fruits to emphasise the goodness of the flavours inside. Caroline Wilding, Head of Marketing, Juices UK at Tropicana Brands Group, commented: “Strawberry & Banana is a family favourite flavour combination that will keep everyone happy during the morning breakfast rush, whereas Pineapple & Pink Guava Crush extends our positioning as a go-to for rest of the day occasions with its mocktail-inspired fruit blend.”","filter_flag":1}
{"title":"Bridgestone India to invest INR 600 crore for expansion - ETAuto","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvdHlyZXMvYnJpZGdlc3RvbmUtaW5kaWEtdG8taW52ZXN0LWluci02MDAtY3JvcmUtZm9yLWV4cGFuc2lvbi85NzY0NTk2MdIBeWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL3R5cmVzL2JyaWRnZXN0b25lLWluZGlhLXRvLWludmVzdC1pbnItNjAwLWNyb3JlLWZvci1leHBhbnNpb24vOTc2NDU5NjE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvdHlyZXMvYnJpZGdlc3RvbmUtaW5kaWEtdG8taW52ZXN0LWluci02MDAtY3JvcmUtZm9yLWV4cGFuc2lvbi85NzY0NTk2MdIBeWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL3R5cmVzL2JyaWRnZXN0b25lLWluZGlhLXRvLWludmVzdC1pbnItNjAwLWNyb3JlLWZvci1leHBhbnNpb24vOTc2NDU5NjE?oc=5","id":"CBMidWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvdHlyZXMvYnJpZGdlc3RvbmUtaW5kaWEtdG8taW52ZXN0LWluci02MDAtY3JvcmUtZm9yLWV4cGFuc2lvbi85NzY0NTk2MdIBeWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL3R5cmVzL2JyaWRnZXN0b25lLWluZGlhLXRvLWludmVzdC1pbnItNjAwLWNyb3JlLWZvci1leHBhbnNpb24vOTc2NDU5NjE","guidislink":false,"published":"Mon, 06 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=37, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvdHlyZXMvYnJpZGdlc3RvbmUtaW5kaWEtdG8taW52ZXN0LWluci02MDAtY3JvcmUtZm9yLWV4cGFuc2lvbi85NzY0NTk2MdIBeWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL3R5cmVzL2JyaWRnZXN0b25lLWluZGlhLXRvLWludmVzdC1pbnItNjAwLWNyb3JlLWZvci1leHBhbnNpb24vOTc2NDU5NjE?oc=5\" target=\"_blank\">Bridgestone India to invest INR 600 crore for expansion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bridgestone India to invest INR 600 crore for expansion - ETAuto","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL25ld3MvdHlyZXMvYnJpZGdlc3RvbmUtaW5kaWEtdG8taW52ZXN0LWluci02MDAtY3JvcmUtZm9yLWV4cGFuc2lvbi85NzY0NTk2MdIBeWh0dHBzOi8vYXV0by5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL3R5cmVzL2JyaWRnZXN0b25lLWluZGlhLXRvLWludmVzdC1pbnItNjAwLWNyb3JlLWZvci1leHBhbnNpb24vOTc2NDU5NjE?oc=5\" target=\"_blank\">Bridgestone India to invest INR 600 crore for expansion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ETAuto<\/font>","source.href":"https:\/\/auto.economictimes.indiatimes.com","source.title":"ETAuto","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Advt Join the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETAuto App Get Realtime updates Save your favourite articles Scan to download App Bridgestone India, part of Bridgestone Corporation , announced that it would be investing over INR 600 crores to meet the increasing demand for quality passenger tyres in the country. The investment will not only upgrade technology but also increase capacity at its Chakan plant in Pune. The investment will be spread over three years.Stefano Sanchini, Managing Director, Bridgestone India, said, “Bridgestone India is bringing in its global technologies and manufacturing for the Indian market so as to suit the needs of aspiring Indian consumers that want more fuel-efficient tyres, and better products to suit the improved quality of Indian roads. As a global leader in tyre technology, Bridgestone is committed towards providing sustainable mobility solutions and the current investment of 70 million euros is in this direction”.Initial investment for capacity and technology upgradation will be EUR 70 million (over INR 600 crore) which will improve the plant capability in terms of technologies and capacities for the manufacture of tyres for the passenger car segment The Chakan plant in Pune commenced production from 2013 and today boasts of sustainable manufacturing practices including a solar power plant and a carbon-neutral biomass fuel- based boiler plant.Brdgestone serves the Indian automotive sector with superior mobility solutions. In September 2022 Bridgestone India introduced ‘Sturdo’ tyre with longer tyre life for the passenger vehicles segment. The tyre has a special tread compound that extends tyre life by up to 29% and improves ride quality on uneven roads. It also has a range of Ecopia tyres that are engineered with a combination of light and strong materials for greater fuel efficiency and to reduce carbon emissions.","filter_flag":1}
{"title":"Renault, Nissan set to invest Rs 5,300 crore in Tamil Nadu, launch 6 new vehicles - The Times of India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FydGljbGVzaG93Lzk3ODk3MTk4LmNtc9IBnAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FtcF9hcnRpY2xlc2hvdy85Nzg5NzE5OC5jbXM?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FydGljbGVzaG93Lzk3ODk3MTk4LmNtc9IBnAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FtcF9hcnRpY2xlc2hvdy85Nzg5NzE5OC5jbXM?oc=5","id":"CBMimAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FydGljbGVzaG93Lzk3ODk3MTk4LmNtc9IBnAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FtcF9hcnRpY2xlc2hvdy85Nzg5NzE5OC5jbXM","guidislink":false,"published":"Tue, 14 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=45, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FydGljbGVzaG93Lzk3ODk3MTk4LmNtc9IBnAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FtcF9hcnRpY2xlc2hvdy85Nzg5NzE5OC5jbXM?oc=5\" target=\"_blank\">Renault, Nissan set to invest Rs 5,300 crore in Tamil Nadu, launch 6 new vehicles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Renault, Nissan set to invest Rs 5,300 crore in Tamil Nadu, launch 6 new vehicles - The Times of India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FydGljbGVzaG93Lzk3ODk3MTk4LmNtc9IBnAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvcmVuYXVsdC1uaXNzYW4tc2V0LXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLXRhbWlsLW5hZHUtbGF1bmNoLTYtbmV3LXZlaGljbGVzL2FtcF9hcnRpY2xlc2hvdy85Nzg5NzE5OC5jbXM?oc=5\" target=\"_blank\">Renault, Nissan set to invest Rs 5,300 crore in Tamil Nadu, launch 6 new vehicles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","source.href":"https:\/\/timesofindia.indiatimes.com","source.title":"The Times of India","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"CHENNAI: Auto majors Renault and Nissan have announced a ₹5,300 crore ($600 million) investment in the state as part of their new India strategy. The funds will be spent on developing six new products which will be developed in India and sold both in domestic and export markets.The new products are four brand new 'C-segment SUV models' and two 'A-segment' electric vehicles. The new push will involve modernising the alliance 's Oragadam plant. The first of the new models will debut in 2025.The new product line up will lead to 80% capacity utilisation at the Oragadam plant, up from 47% currently. At 80% utilisation, the plant will crank out 400,000 units annually.The announcement is part of Nissan and Renault's new long-term vision for India.The announcement is part of Nissan and Renault's new long-term vision for India and the ramp up of production and R&D, launch of new products and uplift the Renault-Nissan centre into an international export hub will see up to 2,000 new jobs created at the Renault Nissan Technology & Business Centre in Chennai.At the same time, the Renault Nissan Alliance factory in Oragadam will become carbon-neutral with a significant increase in renewable energy generation. This is part of the Renault-Nissan-Mitsubishi Alliance global strategy of high value creation. The announcement was made in the presence of chief minister MK Stalin in Chennai on Monday.Guillaume Cartier, chairperson for Nissan's Africa, Middle East, India, Europe and Oceania region, said: \"India was the first Alliance plant and India will be at the centre of this new chapter of the Alliance, with new vehicles, new R&D activities and new export markets taking our joint operations to the next level.\"S Krishnan, additional chief secretary, industries, Government of Tamil Nadu, said: \"The Renault-Nissan Alliance in Tamil Nadu has had manufacturing and design facilities operating in the state for more than 15 years now. This is a very valuable and important relationship for the government of Tamil Nadu and the Alliance\".\"It employs about 15,000 people directly in the state and has been one of the mainstays in ensuring that Tamil Nadu remains the automotive capital of India and an important hub for the manufacture of automobiles and auto components and automobile design as well. We are very excited about this new proposal of modernization and fresh investment by the Renault-Nissan Alliance in Tamil Nadu,\" he added.The six new models will comprise of three for each company, engineered and built in Chennai. They will be built on common Alliance platforms while retaining the individual, distinctive styling of the respective brands. The new models will not only be aimed at Indian customers but will also signal a significant increase in exports from India. TNN","filter_flag":1}
{"title":"Renault, Nissan to invest Rs 5,300 crore in India: To launch six new vehicles - The Financial Express","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9hdXRvL2Nhci1uZXdzL3JlbmF1bHQtbmlzc2FuLXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLWluZGlhLXRvLWxhdW5jaC1zaXgtbmV3LXZlaGljbGVzLzI5Nzk5Mzcv0gGHAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2F1dG8vY2FyLW5ld3MvcmVuYXVsdC1uaXNzYW4tdG8taW52ZXN0LXJzLTUzMDAtY3JvcmUtaW4taW5kaWEtdG8tbGF1bmNoLXNpeC1uZXctdmVoaWNsZXMvMjk3OTkzNy9saXRlLw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9hdXRvL2Nhci1uZXdzL3JlbmF1bHQtbmlzc2FuLXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLWluZGlhLXRvLWxhdW5jaC1zaXgtbmV3LXZlaGljbGVzLzI5Nzk5Mzcv0gGHAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2F1dG8vY2FyLW5ld3MvcmVuYXVsdC1uaXNzYW4tdG8taW52ZXN0LXJzLTUzMDAtY3JvcmUtaW4taW5kaWEtdG8tbGF1bmNoLXNpeC1uZXctdmVoaWNsZXMvMjk3OTkzNy9saXRlLw?oc=5","id":"CBMiggFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9hdXRvL2Nhci1uZXdzL3JlbmF1bHQtbmlzc2FuLXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLWluZGlhLXRvLWxhdW5jaC1zaXgtbmV3LXZlaGljbGVzLzI5Nzk5Mzcv0gGHAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2F1dG8vY2FyLW5ld3MvcmVuYXVsdC1uaXNzYW4tdG8taW52ZXN0LXJzLTUzMDAtY3JvcmUtaW4taW5kaWEtdG8tbGF1bmNoLXNpeC1uZXctdmVoaWNsZXMvMjk3OTkzNy9saXRlLw","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9hdXRvL2Nhci1uZXdzL3JlbmF1bHQtbmlzc2FuLXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLWluZGlhLXRvLWxhdW5jaC1zaXgtbmV3LXZlaGljbGVzLzI5Nzk5Mzcv0gGHAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2F1dG8vY2FyLW5ld3MvcmVuYXVsdC1uaXNzYW4tdG8taW52ZXN0LXJzLTUzMDAtY3JvcmUtaW4taW5kaWEtdG8tbGF1bmNoLXNpeC1uZXctdmVoaWNsZXMvMjk3OTkzNy9saXRlLw?oc=5\" target=\"_blank\">Renault, Nissan to invest Rs 5,300 crore in India: To launch six new vehicles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Financial Express<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Renault, Nissan to invest Rs 5,300 crore in India: To launch six new vehicles - The Financial Express","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9hdXRvL2Nhci1uZXdzL3JlbmF1bHQtbmlzc2FuLXRvLWludmVzdC1ycy01MzAwLWNyb3JlLWluLWluZGlhLXRvLWxhdW5jaC1zaXgtbmV3LXZlaGljbGVzLzI5Nzk5Mzcv0gGHAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2F1dG8vY2FyLW5ld3MvcmVuYXVsdC1uaXNzYW4tdG8taW52ZXN0LXJzLTUzMDAtY3JvcmUtaW4taW5kaWEtdG8tbGF1bmNoLXNpeC1uZXctdmVoaWNsZXMvMjk3OTkzNy9saXRlLw?oc=5\" target=\"_blank\">Renault, Nissan to invest Rs 5,300 crore in India: To launch six new vehicles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Financial Express<\/font>","source.href":"https:\/\/www.financialexpress.com","source.title":"The Financial Express","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Renault and Nissan have announced to launch six new products in India, including four SUVs and two electric vehicles. The auto major will invest Rs 5,300 crore to support its new projects. Renault and Nissan have revealed their future road map for the Indian market. The companies will collaborate on six new vehicles for domestic and international customers which will include two new fully electric vehicles and four SUVs. The auto major has committed an investment of Rs 5,300 crore to support its new projects for the Indian market. Renault, Nissan new SUVs and EVs: Renault and Nissan’s six new models will comprise three for each company, engineered and built in Chennai. They will be built on common alliance platforms but with distinctive styling of the respective brands. This will include four new C-segment SUVs and two new A-segment electric vehicles which will be the first electric offerings for both Renault and Nissan in India. Also Read: Ola S1, S1 Air, S1 Pro variants explained: All you need to know Also Read Why should you wait for Mahindra Thar 5 door: New features revealed Tata Curvv spied ahead of launch, panoramic sunroof visible — Citroen Basalt rival Nissan X-Trail teased ahead of India launch — Compass, Tuscon rival Maruti Suzuki Fronx Velocity Edition — What is it? According to Renault Nissan Group, its fresh investment will add up to 2,000 additional new jobs at the Renault Nissan Technology & Business Centre in Chennai, Tamil Nadu. At the same time, the RNAIPL factory will become carbon-neutral with a significant increase in renewable energy generation by 2045. Also, under the new framework agreement, RNAIPL will move to ownership of 51% Nissan – 49% Renault. Follow: Express Drives on Instagram, Twitter, and Facebook Watch Video | Renault Kiger Review: Here’s what the company said: Guillaume Cartier, Chairperson for Nissan’s Africa, Middle East, India, Europe and Oceania region, said, “Renault and Nissan are fully committed to the Indian market, committed to electrifying the Indian market and committed to minimising our impact on the environment. For the first time, the Nissan line-up in India will reflect our global power in high-quality SUVs and EVs, bringing greater value to our employees, customers and communities.” Also Read: Hyundai Ioniq 5 vs Mini Cooper SE: Ioniq vs Iconic EVs comparison! Stay tuned with Express Drives for more updates and also, do subscribe to our YouTube channel for the latest auto news and reviews.","filter_flag":1}
{"title":"Renault Nissan Alliance Renewed – 4 Things To Know - MotorBeam.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L9IBT2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L9IBT2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L2FtcC8?oc=5","id":"CBMiS2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L9IBT2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L2FtcC8","guidislink":false,"published":"Tue, 14 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=45, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L9IBT2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L2FtcC8?oc=5\" target=\"_blank\">Renault Nissan Alliance Renewed – 4 Things To Know<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MotorBeam.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Renault Nissan Alliance Renewed – 4 Things To Know - MotorBeam.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiS2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L9IBT2h0dHBzOi8vd3d3Lm1vdG9yYmVhbS5jb20vcmVuYXVsdC1uaXNzYW4tYWxsaWFuY2UtcmVuZXdlZC00LXRoaW5ncy10by1rbm93L2FtcC8?oc=5\" target=\"_blank\">Renault Nissan Alliance Renewed – 4 Things To Know<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MotorBeam.com<\/font>","source.href":"https:\/\/www.motorbeam.com","source.title":"MotorBeam.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The Renault Bigster concept might launch in its production version in India New Renault Nissan alliance has made fresh commitments for the Indian market New Renault Nissan alliance has made some fresh investments along with renewed partnership for the Indian market. They have done an initial investment of Rs. 5300 crores for the new projects. Here are four things to know about this revised alliance – New Cars Six new cars have been confirmed for launch with this alliance, three for each company. These three models will be built on the common alliance platforms. However, both the brands will have their distinct design language. The new products will include two new SUVs and a new electric car. Yes, there will be a new generation Duster and a 7-seater version of it that is likely to be inspired by the Renault Bigster concept. Nissan will also share the same platform like we used to see the Duster Terrano duo in the Indian market. International Hub In Chennai The alliance wants to make India as the hub of their exports. The new products will not only be sold in the domestic market but will also be exported to the international markets. For this, the alliance will boost their Chennai plant utilisation to 80 percent. With the increase in production, they will create up to 2000 new jobs at their plant. Carbon Neutral Vehicle Manufacturing Renault Nissan Automotive India Private Limited has also announced their roadmap to carbon neutrality. They have an ongoing programme to transition to 100 percent renewable energy. They are also reducing energy consumption at the plant by 50 percent compared to today. Currently, the plant sources more than 50 percent of its electricity from renewables, including solar, biomass and wind. The existing solar plant will become more than six times bigger, expanding to a 14MW plant from 2.2MW today. New Partnership Renault and Nissan are realigning their shareholding in their joint operations. Renault Nissan Automotive India Private Ltd (RNAIPL) will move to an ownership of 51 percent for Nissan – 49 percent for Renault. Renault Nissan Technology Business Centre (RNTBCI) will move to an ownership of 51 percent for Renault – 49 percent for Nissan.","filter_flag":1}
{"title":"Nissan and Renault announce Rs 5,300crore investment in Tamil Nadu, to create 2,000 jobs - The Times of India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvbmlzc2FuLWFuZC1yZW5hdWx0LWFubm91bmNlLXJzLTUzMDBjcm9yZS1pbnZlc3RtZW50LWluLXRhbWlsLW5hZHUtdG8tY3JlYXRlLTIwMDAtam9icy9hcnRpY2xlc2hvdy85Nzg3NDkwNy5jbXPSAaMBaHR0cHM6Ly90aW1lc29maW5kaWEuaW5kaWF0aW1lcy5jb20vY2l0eS9jaGVubmFpL25pc3Nhbi1hbmQtcmVuYXVsdC1hbm5vdW5jZS1ycy01MzAwY3JvcmUtaW52ZXN0bWVudC1pbi10YW1pbC1uYWR1LXRvLWNyZWF0ZS0yMDAwLWpvYnMvYW1wX2FydGljbGVzaG93Lzk3ODc0OTA3LmNtcw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvbmlzc2FuLWFuZC1yZW5hdWx0LWFubm91bmNlLXJzLTUzMDBjcm9yZS1pbnZlc3RtZW50LWluLXRhbWlsLW5hZHUtdG8tY3JlYXRlLTIwMDAtam9icy9hcnRpY2xlc2hvdy85Nzg3NDkwNy5jbXPSAaMBaHR0cHM6Ly90aW1lc29maW5kaWEuaW5kaWF0aW1lcy5jb20vY2l0eS9jaGVubmFpL25pc3Nhbi1hbmQtcmVuYXVsdC1hbm5vdW5jZS1ycy01MzAwY3JvcmUtaW52ZXN0bWVudC1pbi10YW1pbC1uYWR1LXRvLWNyZWF0ZS0yMDAwLWpvYnMvYW1wX2FydGljbGVzaG93Lzk3ODc0OTA3LmNtcw?oc=5","id":"CBMinwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvbmlzc2FuLWFuZC1yZW5hdWx0LWFubm91bmNlLXJzLTUzMDBjcm9yZS1pbnZlc3RtZW50LWluLXRhbWlsLW5hZHUtdG8tY3JlYXRlLTIwMDAtam9icy9hcnRpY2xlc2hvdy85Nzg3NDkwNy5jbXPSAaMBaHR0cHM6Ly90aW1lc29maW5kaWEuaW5kaWF0aW1lcy5jb20vY2l0eS9jaGVubmFpL25pc3Nhbi1hbmQtcmVuYXVsdC1hbm5vdW5jZS1ycy01MzAwY3JvcmUtaW52ZXN0bWVudC1pbi10YW1pbC1uYWR1LXRvLWNyZWF0ZS0yMDAwLWpvYnMvYW1wX2FydGljbGVzaG93Lzk3ODc0OTA3LmNtcw","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvbmlzc2FuLWFuZC1yZW5hdWx0LWFubm91bmNlLXJzLTUzMDBjcm9yZS1pbnZlc3RtZW50LWluLXRhbWlsLW5hZHUtdG8tY3JlYXRlLTIwMDAtam9icy9hcnRpY2xlc2hvdy85Nzg3NDkwNy5jbXPSAaMBaHR0cHM6Ly90aW1lc29maW5kaWEuaW5kaWF0aW1lcy5jb20vY2l0eS9jaGVubmFpL25pc3Nhbi1hbmQtcmVuYXVsdC1hbm5vdW5jZS1ycy01MzAwY3JvcmUtaW52ZXN0bWVudC1pbi10YW1pbC1uYWR1LXRvLWNyZWF0ZS0yMDAwLWpvYnMvYW1wX2FydGljbGVzaG93Lzk3ODc0OTA3LmNtcw?oc=5\" target=\"_blank\">Nissan and Renault announce Rs 5,300crore investment in Tamil Nadu, to create 2,000 jobs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Nissan and Renault announce Rs 5,300crore investment in Tamil Nadu, to create 2,000 jobs - The Times of India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9jaXR5L2NoZW5uYWkvbmlzc2FuLWFuZC1yZW5hdWx0LWFubm91bmNlLXJzLTUzMDBjcm9yZS1pbnZlc3RtZW50LWluLXRhbWlsLW5hZHUtdG8tY3JlYXRlLTIwMDAtam9icy9hcnRpY2xlc2hvdy85Nzg3NDkwNy5jbXPSAaMBaHR0cHM6Ly90aW1lc29maW5kaWEuaW5kaWF0aW1lcy5jb20vY2l0eS9jaGVubmFpL25pc3Nhbi1hbmQtcmVuYXVsdC1hbm5vdW5jZS1ycy01MzAwY3JvcmUtaW52ZXN0bWVudC1pbi10YW1pbC1uYWR1LXRvLWNyZWF0ZS0yMDAwLWpvYnMvYW1wX2FydGljbGVzaG93Lzk3ODc0OTA3LmNtcw?oc=5\" target=\"_blank\">Nissan and Renault announce Rs 5,300crore investment in Tamil Nadu, to create 2,000 jobs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","source.href":"https:\/\/timesofindia.indiatimes.com","source.title":"The Times of India","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"CHENNAI: Auto majors Renault and Nissan have announced a Rs 5,300crore ($600 million) investment in Tamil Nadu as part of their new India strategy.The funds will be spent on developing six new products which will be developed in India and sold both in domestic and export markets. The six new products will include four brand new “C-segment SUV models” and two “A-segment” electric vehicles.The new push will involve modernising the alliance’s Oragadam plant. The first of the new models will debut in 2025. The new product line up will lead to 80% capacity utilisation at the Oragadam plant, up from 47% currently. At 80% utilisation, the plant will crank out 400,000 units annually.The announcement is part of Nissan and Renault’s new long-term vision for India and the ramp up of production and R&D, launch of new products. Uplifting the Renault-Nissan centre into an international export hub will see creation of up to 2,000 new jobs created at the Renault Nissan Technology & Business Centre in Chennai.The Renault Nissan Alliance factory in Oragadam will become carbon-neutral with a significant increase in renewable energy generation. This is part of the Renault-Nissan-Mitsubishi Alliance global strategy of high value creation.The announcement was made in the presence of chief minister MK Stalin in Chennai on Monday. Guillaume Cartier, chairman for Nissan’s Africa, Middle East, India, Europe and Oceania region, said: “India was the first alliance plant and India will be at the centre of this new chapter of the alliance, with new vehicles, new R&D activities and new export markets taking our joint operations to the next level.”S Krishnan, additional chief secretary, industries, Government of Tamil Nadu, said: \"The Renault-Nissan Alliance in Tamil Nadu has had manufacturing and design facilities operating in the state for more than 15 years now. This is a very valuable and important relationship for the government of Tamil Nadu and the alliance. It employs about 15,000 people directly in the state.","filter_flag":1}
