{"title":"Empowering Homes with Flexible Energy Solutions | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW1wb3dlcmluZy1ob21lcy13aXRoLWZsZXhpYmxlLWVuZXJneS1zb2x1dGlvbnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW1wb3dlcmluZy1ob21lcy13aXRoLWZsZXhpYmxlLWVuZXJneS1zb2x1dGlvbnPSAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW1wb3dlcmluZy1ob21lcy13aXRoLWZsZXhpYmxlLWVuZXJneS1zb2x1dGlvbnPSAQA","guidislink":false,"published":"Tue, 19 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=262, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW1wb3dlcmluZy1ob21lcy13aXRoLWZsZXhpYmxlLWVuZXJneS1zb2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Empowering Homes with Flexible Energy Solutions | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Empowering Homes with Flexible Energy Solutions | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvZW1wb3dlcmluZy1ob21lcy13aXRoLWZsZXhpYmxlLWVuZXJneS1zb2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Empowering Homes with Flexible Energy Solutions | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy management systems\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Hardware Manufacturers and Energy Management Systems Providers Historically, hardware manufacturers primarily concentrated on supplying energy-consumption hardware and controls such as heat pumps (HP), photovoltaic systems, batteries, electric vehicle charging infrastructure and enabling devices (such as smart controls and meters). These companies also offered software services, including systems maintenance. As flexible residential energy evolves, companies in this diverse group must shift their focus to providing home energy management systems. They will be able to orchestrate a comprehensive range of components, including EV wall boxes, heat pumps, and PV inverters. The HEMS becomes a control point for home energy consumers, compensating them for the flexibility they provide to the energy system. HEMS can be sold as standalone equipment or in a Hardware-as-a-Service (HaaS) offering, which would include hardware, software, maintenance and support. These would help consumers adopt efficient usage patterns to cut spending and minimize their carbon footprint. In addition, with the HaaS model, companies can leverage their expertise in the energy market to cross-finance attractive consumer offers from multiple third-party vendors. “Almost every household in Europe has a heating system and these systems are responsible for 79% of residential energy consumption. Hence home heating is the most important pillar when optimizing home energy. A platform which can connect and manage any system from any manufacturer is the key to offer efficiency propositions to every household.” —Christian Deilmann, Co-Founder and CPO, tado°, one of the leading providers of heating & energy management solutions for home owners “Energy flexibilization is the logical next step. Customers want one point of contact for this and not a multitude of specialized providers. We are increasingly seeing a complete integration of the range of products and services offered by providers of decentralized energy services.” —Peter Bachmann, Vice President Strategy and Customer Solutions, Solarwatt, one of the leading providers of solar energy hardware Digital Energy Retailers The majority of new energy businesses consists of young companies with expertise in digital go-to-market strategies and cost efficiency. They aim to enter the energy retailer market and revolutionize its pricing dynamics with flexible pricing based on supply and demand conditions. Additionally, certain players in this category are smartly positioning themselves as energy management platform providers that combine hardware, particularly battery storage, with dynamic pricing, enabling customers to reduce their energy costs. Energy is stored in the battery when prices are low and then drawn from the battery when prices are high. To overcome the twin obstacles to success in their segment of the market—slim profit margins and limited customer loyalty—digital energy retailers can expand into hardware and HEMS, while also buying and selling energy based on flexible residential strategies. But to thrive here, companies must give customers access to up-to-the-minute usage data and cost efficiency, attract consumers through positive user-experience, and create a robust brand presence in the \"new energy world.\" “Energy storage can be a fundamental piece and absolutely necessary for renewable energy to be built at the scale that is needed in order to phase out fossil fuels. That is a true way of dealing with climate change.” —Edgeir Aksnes, Co-Founder & CEO, Tibber, one of the leading digital energy retailers Integrators and Solution Providers In recent years these emerging providers, often starting as PV installers, have expanded by offering other flexible energy equipment, such as heat pumps and EV charging stations. This fed into the increased public awareness of energy self-sufficiency and the desire to easily manage energy in the home. In some cases these businesses also positioned themselves as energy retailers. Capitalizing on the scarcity of residential energy system installers, these companies offer consumers a one-stop source for a broad-scale residential energy solution. They thus can present themselves as trusted providers, meeting the diverse needs of customers seeking comprehensive energy solutions. In this new market, being the \"first to the customer\" can be a competitive advantage. In this new market, being the \"first to the customer\" can indeed offer a competitive advantage. This is especially true for new residential construction projects and complete home retrofits, where consumers are more inclined to invest in all-in-one energy solutions from a single provider. However, for integrators the current market is still somewhat limited beyond high-investment photovoltaic (PV) and all-in-one solutions. To grow their soup-to-nuts offerings, the companies can create a lock-in effect through maintenance, the ability to work with any type of hardware and software, add-on services as energy innovation occurs, and perhaps financing options. B2B Software for Energy Management Systems Providers A spate of software startups has emerged that develop software-based energy management systems for B2B partners, including energy retailers and home appliance providers. These companies offer seamless integration of various components such as heat pumps, EV charging stations, photovoltaic systems, and energy storage. They play a pivotal role in the residential energy flexibilization ecosystem by, for instance, providing the software for digital energy retailers to do dynamic pricing and to facilitate communication among myriad flexible energy equipment. Until now, the main challenge for these providers has been the immaturity of flexible energy hardware, exacerbated by the slow deployment of smart meters. However, smart meters that can manage high-performance energy usage among disparate equipment are being installed much more quickly than before. And HEMS providers are more actively emphasizing innovative technologies to attract and retain consumers. To support all this, software companies must develop applications that integrate as many energy systems as possible from original equipment manufacturers and enable fast and convenient onboarding and installation for consumers. Most importantly, software vendors must know how to optimize power consumption. Traditional Utilities and Incumbent Retailers A notable trend among traditional power retailers is their increasing focus on adaptive strategic investment. While power generation and trading remain their core business, some are now investing in software solutions that support flexible energy and a more sustainable energy ecosystem. Part of their motivation is to prevent high-value customers from switching to attractive newcomers in energy flexibility and loss of margin from their traditional business lines. With these investments, incumbent companies have generally avoided developing new approaches in-house. Instead they are taking stakes or partnering with companies that offer energy flexibility equipment and solutions, including services that provide grid balancing and stabilization and photovoltaic storage. In addition, dynamic electricity tariffs based on supply and demand have already become a standard offering among major energy retailers, and many of them are actively developing HEMS solutions. This strategic shift among traditional power retailers reflects their recognition of the changing energy landscape and consumer demands for flexible and sustainable energy solutions. By investing in energy innovation, they can remain competitive in the renewable energy and consumer-centric market. “Incumbent players need to take action and participate in the emerging market opportunity of energy flexibilization. They can successfully do so by leveraging their strong customer base and vast experience in energy retail\/trading.” —Philipp Klenner, Senior Vice President Future Energy Home, EON, a major energy utility In this picture of the flexible residential energy landscape, we have left out segments of the energy industry that are broader and not focused solely on activities at the residential level. In coming years such companies are more than likely to reach into the homeowner market. In particular, demand response and VPPs are more linked to utilities and power generation and at this point have few interactions with residential players. Some retail-focused smart home systems providers deal directly with consumers. Apart from offerings that control entertainment or appliances, these companies have solutions that can measure, track, and help manage home energy usage. However, these smart home providers are not yet prepared for energy consumption management because they are either still focused on their profitable hardware business or concentrating on going broad (automate more and more parts of the home) rather than going deep on energy and HEMS. As flexible residential energy becomes more commonplace, we suspect that smart home systems will play a bigger role. Not A Winner Takes All Market Because of residential energy flexibilization's multiple dimensions and myriad new innovations, it is not likely to be a one-sided marketplace with a small handful of dominant players poised to lead the industry in the near future. While there is potential to create a consumer lock-in effect through superior products and services and by getting into the game early, these relationships will not be particularly sticky since consumers will have the option to switch from one provider to another relatively easily and inexpensively. Moreover, the residential building technology market is predominantly localized, with distinct preferences, market structures, and regulations providing openings for many new companies to join the fray. In this market, collaboration among companies is essential to integrate various hardware technologies and to foster innovation. Rather than winner takes all, the flexible residential energy market should be viewed as an ecosystem. Indeed, collaboration among companies is essential to integrate various hardware technologies—which appeals to consumers—and to foster innovation on top of existing energy systems. Hardware providers need to join with software companies to offer integrated HEMS technology. Software providers should build platforms that achieve broader reach. This diverse ecosystem can synergize the capabilities of manufacturers, suppliers, technology firms, investors, and regulators. Thus, companies must assume multiple roles. They can actively orchestrate ecosystem development, establish common standards, and determine value distribution among participants. As contributors, they provide value-added services, products, or assets to enhance the effectiveness and efficiency of the market for all participants. “As Europe faces an accelerated transition towards a low carbon energy mix, the legacy grid infrastructure is being put under increasing scrutiny and pressure. As residential homes race to electrify, there is significant value to be unlocked by tapping into consumption management and demand response services.” —Tim He, Partner & Energy Transition Lead, Summa Equity, which holds a stake in Tibber “As investors, we are particularly excited about solutions that facilitate faster access to, and efficient participation in, the flexibility markets. We do not see one dominant strategy that will take the entire market of home energy flexibility all at once. Rather we observe a multitude of approaches that pick different starting points ranging from pure software plays to more integrated approaches combining software and assets in their value proposition.” —Florian Reichert, Partner & Managing Director, Picus Capital, an Enpal investor What It Takes to Be Successful Despite the collaboration and co-competition within the ecosystem, intense rivalry for the consumer's attention will persist. In our view three strategic steps should be emphasized to successfully attract and retain customers: Be the first to reach the customer. Move quickly to establish a strong presence in the core energy flexibilization segment that you are targeting and then expand by value-added services alone or in collaboration with others in the ecosystem. For instance, electricity providers could offer home energy management systems or hardware with integrated HEMS. Critical for companies with a large consumer base is leveraging these customer relationships to introduce additional solutions and generate new revenue streams. Offer consumers maximum savings and convenience. Companies that can provide products or services with substantial cost savings for consumers without sacrificing convenience will have a competitive advantage. For example, optimizing heat pumps or charging electric vehicles in a way that minimizes the consumer's involvement while still achieving energy savings would be extremely attractive. As would be finding the optimal balance to provide cost savings and grid flexibility. Provide simple and comprehensive solutions. Offering straightforward and comprehensive products and services is essential to maximize the lock-in effect and customer loyalty. Integrators may have an advantage if they can offer seamless and user-friendly experiences in integrating energy retailing and HEMS. Given the growth potential in flexible residential energy, all types of companies should be able to branch out from their core offerings—often by collaborating with others in their ecosystems—to offer more comprehensive solutions over time. Often overlooked in discussions about energy flexibility is the vital role that specialists and craftspeople play in installing these new technologies. For every company, ensuring installation capacity by building strong partnerships and positive relationships with installation professionals is essential to satisfy consumer expectations for speed of installation and quality. Accordingly, companies must invest heavily in strengthening either their own installation capabilities or in forming partnerships with installers. And they must adopt training programs that equip craftspeople with the necessary skills and knowledge to efficiently install the technology. Time for Action Residential energy flexibilization creates new market opportunities for all players in the building and energy technology sector. No single player can achieve complete dominance. Instead, success lies in the ability of individual providers to combine the right capabilities within an effective ecosystem. The pivotal question becomes: What role does a company play within this ecosystem; is it an orchestrator shaping the ecosystem or a contributor? To answer this question, all players, including early movers, must carefully observe, analyze, and adapt their own positions, as well as assess the current state, competition, and prospects of the market. The market is evolving rapidly, and no one can afford complacency or resting on past achievements. Ultimately, success in the era of flexible residential energy will hinge on the right strategy, a holistic ecosystem approach, and swift action to strengthen individual positions.","filter_flag":1}
{"title":"New home energy management “ecosystem” lands, backed by solar heavyweight - One Step Off The Grid","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5","id":"CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5\" target=\"_blank\">New home energy management “ecosystem” lands, backed by solar heavyweight<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">One Step Off The Grid<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New home energy management “ecosystem” lands, backed by solar heavyweight - One Step Off The Grid","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vb25lc3RlcG9mZnRoZWdyaWQuY29tLmF1L25ldy1ob21lLWVuZXJneS1tYW5hZ2VtZW50LWVjb3N5c3RlbS1sYW5kcy1iYWNrZWQtYnktc29sYXItaGVhdnl3ZWlnaHQv0gFsaHR0cHM6Ly9vbmVzdGVwb2ZmdGhlZ3JpZC5jb20uYXUvbmV3LWhvbWUtZW5lcmd5LW1hbmFnZW1lbnQtZWNvc3lzdGVtLWxhbmRzLWJhY2tlZC1ieS1zb2xhci1oZWF2eXdlaWdodC9hbXAv?oc=5\" target=\"_blank\">New home energy management “ecosystem” lands, backed by solar heavyweight<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">One Step Off The Grid<\/font>","source.href":"https:\/\/onestepoffthegrid.com.au","source.title":"One Step Off The Grid","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy management systems\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"A new home energy management “ecosystem” has been launched in Australia, promising to optimise solar and battery savings by monitoring and automating the use of household appliances, including scheduled electric vehicle charging. Nasdaq listed Maxeon Solar, a spin-off from SunPower in the US, says its SunPower One suite of products and services is now available through authorised dealers and installers in Australia, where it will be showcased at the upcoming All-Energy Australian event in October (see below for more details). SunPower One, an offering which Maxeon has developed in collaboration with Samsung Electronics, is one of a number of home energy management systems being brought to market as solar companies evolve into experts in the electrification of everything. Maxeon says the suite of products includes its residential solar panels, the new SunPower Reserve storage system, the upcoming SunPower Drive EV charging solution and a range of other energy services – coordinated through an app. “The SunPower One app goes beyond just monitoring the output of a homeowner’s solar panels, and proactively offers users energy insights that show in detail the devices that are consuming electricity in the home, highlighting opportunities to better utilise PV production, battery capacity, and EV charging scheduling to enhance financial savings,” the company says. The website says the app can send users notifications on how to make simple but effective changes to energy use and to how much solar energy is consumed or stored. “For example, this might come through on your phone: ‘Turn your AC down by 1° to save 6% more energy today’.” it says. “Moving beyond panels is not just about introducing new products but leveraging our technological prowess to accelerate the adoption of clean energy,” said Maxeon chief product officer, Ralf Elias, in a statement. “Our investments in improving the digital experience of our customers, combining industry-leading easy-to-install hardware with innovative services, and expanding the solution with integrations like Samsung SmartThings all help to solve pain points for consumers and installers.” Australian customers will get the latest about the SunPower One Home Energy Experience at Maxeon’s booth, VV131, during All Energy Australia, this October 25-26.","filter_flag":1}
{"title":"Octopus Energy introduces new residential heat pumps – pv magazine International - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE4L29jdG9wdXMtZW5lcmd5LWludHJvZHVjZXMtbmV3LXJlc2lkZW50aWFsLWhlYXQtcHVtcHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE4L29jdG9wdXMtZW5lcmd5LWludHJvZHVjZXMtbmV3LXJlc2lkZW50aWFsLWhlYXQtcHVtcHMv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE4L29jdG9wdXMtZW5lcmd5LWludHJvZHVjZXMtbmV3LXJlc2lkZW50aWFsLWhlYXQtcHVtcHMv0gEA","guidislink":false,"published":"Mon, 18 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=261, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE4L29jdG9wdXMtZW5lcmd5LWludHJvZHVjZXMtbmV3LXJlc2lkZW50aWFsLWhlYXQtcHVtcHMv0gEA?oc=5\" target=\"_blank\">Octopus Energy introduces new residential heat pumps – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Octopus Energy introduces new residential heat pumps – pv magazine International - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzA5LzE4L29jdG9wdXMtZW5lcmd5LWludHJvZHVjZXMtbmV3LXJlc2lkZW50aWFsLWhlYXQtcHVtcHMv0gEA?oc=5\" target=\"_blank\">Octopus Energy introduces new residential heat pumps – pv magazine International<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy management systems\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"UK energy company Octopus Energy has launched new heat pumps for residential applications. “The system will enter the market with a 6 kW heat pump – aimed at a typical three-bed UK home – with more and larger models following over the next six months,” the manufacturer said, noting that the new product will be available for sale in December for the UK and other major European markets. Yes – FREE for small homes with an up-to-date hot water tank and heating system. Where a bit of work's needed, Cosy Octopus starts at £3,000 (after the Boiler Upgrade Scheme). Cosy 6 is a 6 kW heat pump (great for the avg 3 bed home). Larger models coming in next 6 months. pic.twitter.com\/x3oNH4PvqH Popular content — Octopus Energy (@OctopusEnergy) September 14, 2023 The company said it makes the new Cosy 6 heat pump at its facility in Craigavon, Northern Ireland. It said the new product features two control systems – Cosy Hub and Cosy Pods. “Cosy Octopus is free for homes that don’t need any work to fit the system after the Boiler Upgrade Scheme (BUS),” the company said, “Homes that need adjustments – such as new radiators, piping or a hot water tank – will get the system from around GBP 3,000 (around $3,700) after the grant.”","filter_flag":1}
{"title":"PV Tech exclusive: Huawei's Chen GuoGuang discusses latest innovations, staying ahead in the industry, and ... - Nation","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmF0aW9uLmFmcmljYS9rZW55YS9icmFuZC1ib29rL3B2LWFuZC1lbmVyZ3ktc3RvcmFnZS1odWF3ZWktcy1sYXRlc3QtaW5ub3ZhdGlvbnMtNDM1NTI1NNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmF0aW9uLmFmcmljYS9rZW55YS9icmFuZC1ib29rL3B2LWFuZC1lbmVyZ3ktc3RvcmFnZS1odWF3ZWktcy1sYXRlc3QtaW5ub3ZhdGlvbnMtNDM1NTI1NNIBAA?oc=5","id":"CBMiYGh0dHBzOi8vbmF0aW9uLmFmcmljYS9rZW55YS9icmFuZC1ib29rL3B2LWFuZC1lbmVyZ3ktc3RvcmFnZS1odWF3ZWktcy1sYXRlc3QtaW5ub3ZhdGlvbnMtNDM1NTI1NNIBAA","guidislink":false,"published":"Fri, 01 Sep 2023 15:46:55 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=1, tm_hour=15, tm_min=46, tm_sec=55, tm_wday=4, tm_yday=244, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmF0aW9uLmFmcmljYS9rZW55YS9icmFuZC1ib29rL3B2LWFuZC1lbmVyZ3ktc3RvcmFnZS1odWF3ZWktcy1sYXRlc3QtaW5ub3ZhdGlvbnMtNDM1NTI1NNIBAA?oc=5\" target=\"_blank\">PV Tech exclusive: Huawei's Chen GuoGuang discusses latest innovations, staying ahead in the industry, and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nation<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PV Tech exclusive: Huawei's Chen GuoGuang discusses latest innovations, staying ahead in the industry, and ... - Nation","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbmF0aW9uLmFmcmljYS9rZW55YS9icmFuZC1ib29rL3B2LWFuZC1lbmVyZ3ktc3RvcmFnZS1odWF3ZWktcy1sYXRlc3QtaW5ub3ZhdGlvbnMtNDM1NTI1NNIBAA?oc=5\" target=\"_blank\">PV Tech exclusive: Huawei's Chen GuoGuang discusses latest innovations, staying ahead in the industry, and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nation<\/font>","source.href":"https:\/\/nation.africa","source.title":"Nation","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy management systems\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Huawei Digital Power is a leader in the integration of digital and power electronics technologies, and has created a suite of smart PV and energy storage solutions to address the needs of the utility scale, commercial and industrial, and residential sectors. Huawei’s President of Smart PV,Chen GuoGuang, offers insights: Q：What would you say are the highlights among the new products and solutions Huawei unveiled at this year’s SNEC exhibition? A：During SNEC, we introduced our full-scenario Smart PV & ESS solution for the utility, commercial and industrial, and residential sectors, which we describe as full-scenario. In all three cases, the aim of our solution is to help customers and partners to achieve lower LCOE and enhance the safety of the applications used. Another very important feature is that, for all the solutions, we are now using grid forming technology, which can be used to support the grid instead of impacting it. For all our products, we are adopting an innovative architecture. For example, you know that Huawei has been leading the string concept in the industry for the past decade. When we look at the industry’s overall string inverter market-share, we see it has increased from 40 percent in 2014 to almost 80 percent last year. We are proud to see Huawei leading this trend, and now many manufacturers have followed. We have extended this architecture to our energy storage products as well, because it’s clear that with the string concept, a customer can see more benefit in terms of a levelized cost of storage. Q: The PV and energy storage sectors are currently seeing significant growth and a number of new entrants, leading to a crowded and competitive market. How does Huawei plan to maintain its leading position and sustainable development amidst this intense competition? A: The market is growing. Products are improving. The advantage for Huawei is that we have invested a lot in R&D. We do what we say, so we now have three ‘generations’ and a research and development strategy which covers any of our solutions and products. We have three teams, the first of which is focusing on research, on technology for three to five years into the future. The second team is concentrating on technology development, on solutions for the next one to three years, and our third team is responsible for product development, meaning products planned for delivery within the year. With this three generational R&D strategy and continued heavy investment, I believe that we are better positioned to enable each of our products and solutions to perform well on release. There is also what we hear from feedback from the market, of course. If you look at key features, either at product or solution level, you will find that what we ultimately deliver has been influenced by what the market has told us. We always want to be leading the industry standard, as in the case of the string concept I mentioned earlier. It’s the same with smart string energy storage systems, in that the final offering has evolved during the last two years, from product to solution. For utility-scale, this year we launched the smart PV generator, by combining smart PV plus energy storage systems. From last year to this year, we are commissioning the biggest microgrid in the world in Saudi Arabia. That involves 400MW of PV plus a 1.3 GWh power battery. It is going to supply power to more than a million people, so it is clearly very much a flagship project. Once we commission this project, we can use the solution for other areas, of course. We are changing the control model from current source to voltage source, and we are able to equip this Smart PV & ESS generator with a similar feature to the synchronous condenser traditionally used by power plants. With this innovation, a smart PV + ESS can be widely used with any grid. We believe this is a hugely important development which will enable PV to grow significantly over the coming three to five years. We also have a one-stop solution for C&I (commercial and industrial), and residential, based on modular power electronics and a full range of smart string energy storage systems. We have a charger for C&I and a fast charger together with PV storage. For residential, we combine PV and storage with an AC charger. We also have our energy management systems, so you can see this is clearly a one-fits-all scenario, in which the customer can benefit from continually developing solutions. Q: What is your perspective on the outlook for this year’s PV and storage market? How do you see global installation expectations and the future of combined solar-storage solutions? A: PV markets have grown from last year from, say, 280GW to 300GW up to now, so this figure will probably reach 500GW. We are seeing significant growth in China, as well as in overseas markets. In terms of storage, I think we are also seeing a clear trend for fast growth. This is due to both PV and wind applications, where there is a clear demand for renewable power plants to incorporate storage to support the grid. Grid forming technology is also being developed for use with renewable plants, as you know. Cumulative renewable energy installations have already reached relatively high levels. For PV, it’s over 1,400GW. For wind, it’s between 700GW to 800GW. Grid compatibility and stability is, however, becoming a challenge, which is why the combination of PV and storage is increasingly important. This is a clear trend and I see renewable power plants, both solar and wind based, incorporating storage in their future planning, going on to stabilise the grid by applying grid forming technology within the solution. To interact with Huawei Team of Experts, email [email protected].","filter_flag":1}
{"title":"Which transport hub wants to be the world's greenest airport? - CityMetric","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvaG9uZy1rb25nLWdyZWVuZXN0LWFpcnBvcnQtcGxlZGdl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvaG9uZy1rb25nLWdyZWVuZXN0LWFpcnBvcnQtcGxlZGdl0gEA?oc=5","id":"CBMiR2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvaG9uZy1rb25nLWdyZWVuZXN0LWFpcnBvcnQtcGxlZGdl0gEA","guidislink":false,"published":"Mon, 11 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=254, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvaG9uZy1rb25nLWdyZWVuZXN0LWFpcnBvcnQtcGxlZGdl0gEA?oc=5\" target=\"_blank\">Which transport hub wants to be the world's greenest airport?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CityMetric<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Which transport hub wants to be the world's greenest airport? - CityMetric","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vY2l0eW1vbml0b3IuYWkvc3VzdGFpbmFiaWxpdHkvaG9uZy1rb25nLWdyZWVuZXN0LWFpcnBvcnQtcGxlZGdl0gEA?oc=5\" target=\"_blank\">Which transport hub wants to be the world's greenest airport?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CityMetric<\/font>","source.href":"https:\/\/citymonitor.ai","source.title":"CityMetric","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy management systems\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Hong Kong International Airport (HKIA) is embarking on an ambitious journey to secure its place as the world’s greenest airport, according to the release of the Airport Authority Hong Kong Sustainability Report. Driven by a commitment to sustainable development and environmental stewardship, HKIA has adopted a multifaceted approach to reduce its environmental footprint while championing climate resilience and green design, the report claims. An aircraft flies over Hong Kong. (Photo by Pisa Photography\/Shutterstock) HKIA’s mission to become the epitome of environmental responsibility has led to the implementation of notable initiatives. These efforts encompass a broad spectrum, including reducing carbon emissions, curtailing energy consumption, and advocating climate resilience and eco-friendly design. As air travel rebounds to pre-pandemic levels, HKIA is resolute in mitigating its direct and indirect emissions. The airport annually measures, reduces and discloses its carbon footprint. HKIA has achieved Level 4 “Transformation” in the Airport Carbon Accreditation (ACA) programme, a globally recognised certification standard for airports. This achievement, the report claims, reflects HKIA’s comprehensive carbon management plan and its collaborative efforts to engage stakeholders in accelerating carbon reduction across the airport in an effort to be the world’s greenest. Additionally, HKIA continues to execute its Climate Adaptation and Resilience Plan (CARP) to navigate climate-related risks and seize opportunities. Greenest airport: HKIA’s 2050 net-zero carbon pledge In a move towards a sustainable future, HKIA unveiled the HKIA 2050 Net Zero Carbon Pledge. This pledge aligns with global climate goals, aiming to limit global warming to 1.5°C. It also dovetails with the Hong Kong Special Administrative Region (HKSAR) Government’s carbon neutrality target and the Airports Council International’s (ACI) long-term vision of achieving net-zero emissions by 2050 for the aviation sector. Hong Kong International Airport: can it be the world’s greenest? (Photo by Lo Kin-hei\/Shutterstock) This commitment has the support of 29 of HKIA’s key aviation-related business partners across various sectors, including airlines, aircraft maintenance, aviation fuel, cargo handling, and more. The airport has also initiated various efforts to promote renewable energy generation through on-site solar projects, investigate the feasibility of hydrogen application as a clean energy source, and bolster energy efficiency through solutions like LED lighting and energy management systems. Championing biodiversity and noise management Recognising its proximity to rich marine and terrestrial ecosystems, the report outlines HKIA’s commitment to the conservation and enhancement of biodiversity. The airport has taken green significant steps, such as implementing a Marine Ecology and Fisheries Enhancement Strategy (MEFES) and supporting the independent Marine Ecology Enhancement Fund (MEEF) and Fisheries Enhancement Fund (FEF) to protect local ecosystems and species, including the Chinese white dolphin. In parallel, HKIA takes a proactive approach to noise management, ensuring that the impact of noise generated by aviation operations is minimised for surrounding communities. The implementation of the Noise Quota Count Scheme and various noise-mitigating measures are put forward as evidence of the airport’s dedication to maintaining a ‘harmonious environment for all’. HKIA’s pursuit of sustainability and the goal of being the ‘world’s greenest airport’ hopefully sets a precedent for transport hubs worldwide. [Read more: Hong Kong surpasses Singapore as a green finance hub]","filter_flag":1}
