{"title":"Environmental Chemist","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.purdue.edu%2fscience%2fcareers%2fwhat_can_i_do_with_a_major%2fCareer%2520Pages%2fenvironmental_chemist.html&c=12973979222863015297&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.purdue.edu%2fscience%2fcareers%2fwhat_can_i_do_with_a_major%2fCareer%2520Pages%2fenvironmental_chemist.html&c=12973979222863015297&mkt=en-us","summary":"Environmental chemists design pollution control and cleanup processes and systems ... including development and testing of new products, advising companies on how to comply with regulations, and ...","published":"Tue, 09 Feb 2021 01:02:00 GMT","published_parsed":"time.struct_time(tm_year=2021, tm_mon=2, tm_mday=9, tm_hour=1, tm_min=2, tm_sec=0, tm_wday=1, tm_yday=40, tm_isdst=0)","news_source":"Purdue University","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Environmental Chemist","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Environmental chemists design pollution control and cleanup processes and systems ... including development and testing of new products, advising companies on how to comply with regulations, and ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"Environmental Chemist Environmental chemists design pollution control and cleanup processes and systems. They also serve as emergency advisors, helping to contain and clean up chemical spills and explosions or runoff of pesticides from farm fields into rivers and lakes. Summary the fate and effects of chemicals because the technology to measure the damage did not exist. As the technology for measuring leakage from landfills was developed, for example, industry recognized the potential for chemicals to negatively impact the environment—and the attendant social, political, and economic ramifications. As a result of these new data, chemists were able to help design pollution abatement systems that minimize the unwanted elements escaping into the environment. They also applied their knowledge to develop remediation systems to clean up contaminated areas. A new frontier is pollution prevention, also known as green chemistry. Chemists are working with industry and government to: ensure that chemicals are handled, stored and transported properly to keep them from entering the environment discover less harmful alternatives to replace commonly used toxic chemicals; and invent new environmentally safer industrial chemical processes. Some environmental chemists spend time wading in streams, sampling air and soils, and analyzing and interpreting data in their labs. But as the field expands, daily activities grow increasingly varied, including development and testing of new products, advising companies on how to comply with regulations, and studying public policies and laws. Educational Requirements The chemical industry is the largest employer of environmental chemists, but many work for government agencies and waste management companies. A bachelor’s, Master’s or PhD degree will qualify students to enter this field. Beyond obtaining a solid foundation in chemistry, aspiring environmental chemists do well with an interdisciplinary orientation, with knowledge of biology, ecology, genetics, hydrogeology, and soils. Courses in environmental studies are recommended. For industrial jobs, courses in industrial chemistry and chemical engineering are also suggested. Teamwork skills and the ability to communicate effectively with non-technical audiences are also increasingly important. Salary Information 2023 According to salary.com, the average salary for an Environmental Chemist in 2023 was $73,518. Want to know more? Get Connected Belonging to professional organizations & LinkedIn groups can provide you with networking, informational interviewing, & job shadowing opportunities, as well as assist you with finding internships and jobs. Get Experience Research & Internship Listings Find a Job Job Search Sites Related to Your Major Information retrieved from Career Trend: What Is the Salary & Benefits of an Environmental Chemist? and Cengage: Environmental Chemist.","filter_flag":1}
{"title":"International Journal of Pollution and Noise Control","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2finternational-journal-pollution-noise-control-150200002.html&c=6382002534059923142&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2finternational-journal-pollution-noise-control-150200002.html&c=6382002534059923142&mkt=en-us","summary":"The \"International Journal of Pollution and Noise Control\" journal has been added to ResearchAndMarkets.com's offering.International Journal of Pollution and Noise Control intends to provide its ...","published":"Thu, 20 Jun 2024 08:02:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=8, tm_min=2, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"YAHOO!Finance","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"International Journal of Pollution and Noise Control","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The \"International Journal of Pollution and Noise Control\" journal has been added to ResearchAndMarkets.com's offering.International Journal of Pollution and Noise Control intends to provide its ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"Company Logo Dublin, June 20, 2024 (GLOBE NEWSWIRE) -- The \"International Journal of Pollution and Noise Control\" journal has been added to ResearchAndMarkets.com's offering. International Journal of Pollution and Noise Control intends to provide its readers with swift and concrete information on the advancements in the field of pollution control. Editors recommend high quality papers that are original and comprehensive in nature and those that focus on the application of the work done. Journal also encourages review articles that cover all aspects of pollution control and that can have an immediate impact on the ongoing research. For more information about this journal visit https:\/\/www.researchandmarkets.com\/r\/ipfldk About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. CONTACT: CONTACT: ResearchAndMarkets.com Laura Wood,Senior Press Manager press@researchandmarkets.com For E.S.T Office Hours Call 1-917-300-0470 For U.S.\/ CAN Toll Free Call 1-800-526-8630 For GMT Office Hours Call +353-1-416-8900 ","filter_flag":1}
{"title":"The Next American Frontier","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.theatlantic.com%2fpast%2fdocs%2fissues%2f83mar%2freich.htm&c=8269114544521621125&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.theatlantic.com%2fpast%2fdocs%2fissues%2f83mar%2freich.htm&c=8269114544521621125&mkt=en-us","summary":"Overall, capital expenditures on pollution control and safety combined have ... These industries are the gateways through which new products and processes emerge. Rather than abandoning these ...","published":"Thu, 08 Dec 2011 13:29:00 GMT","published_parsed":"time.struct_time(tm_year=2011, tm_mon=12, tm_mday=8, tm_hour=13, tm_min=29, tm_sec=0, tm_wday=3, tm_yday=342, tm_isdst=0)","news_source":"The Atlantic","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Next American Frontier","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Overall, capital expenditures on pollution control and safety combined have ... These industries are the gateways through which new products and processes emerge. Rather than abandoning these ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"The Atlantic Monthly | March 1983 ..... The Next American Frontier he worldwide recession that began 1981 will end eventually. Some say it already has ended. But the underlying problems of the American economy will not come to an end with the next upturn in the business cycle, unless American industry undertakes some basic changes in its organization of production. Unemployment will remain high. Millions of jobs in the nation's basic industries will never return. And the American standard of living will continue to decline. Between 1920 and 1970, business, labor, and government hewed to a set of organizing principles—originally called \"scientific management\"—in which tasks were simplified, ordered according to pre-established rules, and carefully monitored. These principles were put into effect by a new class of professional managers. High-volume, scientifically managed industry, producing standardized goods, generated vast economies of scale and levels of wealth unparalleled in history. The management era ended for America around 1970. Its decline began, ironically, just as many Europeans were coming to view the mastery of high-volume production as the \"American challenge,\" which Europe had either to emulate or to succumb to. Gradually the economic cycles began to follow a downward trend, and over the next decade America's industry was progressively idled. The proportion of U.S. manufacturing capacity employed in production, which had reached 86 percent in 1965, averaged around 80 percent during the 1970s, and fell to less than 70 percent by 1982. Only 3.5 percent of the labor force was jobless in 1969, but thereafter unemployment climbed persistently, reaching almost 11 percent last year. By the 1980s, the core industries of the management era—steel, automobiles, petrochemicals, textiles, consumer electronics, electrical machinery, metal—forming machinery—were in trouble. Productivity growth slowed from an average yearly increase of 3.2 percent between 1948 and 1965 to an average of 2.4 percent between 1965 and 1973. The rate of growth then dropped to 1.1 percent between 1973 and 1978, and in 1979 American productivity began actually to decline. Meanwhile, productivity growth in Japan and several Western European nations stayed relatively high. After 1965, American real incomes slowed their long climb. Between 1965 and 1981, the average U.S. worker's real wages declined by one fifth. The American engine of prosperity had stalled. Standardized production had brought America unparalleled wealth. True, our national well-being was interrupted by a depression and by periodic recessions. But these were interruptions, nothing more. Standardized production always restored prosperity, consistently exceeding previous levels, consistently achieving more efficiency and greater volume. As the trusted formula has ceased to work, America has been ready to embrace any explanation but the most obvious: the same factor that once brought prosperity—the way the nation organizes itself for production—now threatens decline. Everywhere America has looked, it has seen the symptoms of its economic impasse, but it has been unable to recognize the actual causes because the roots of the problem are so deeply embedded in our business enterprises, labor unions, and government institutions. Government regulation served as a convenient rhetorical scapegoat in the 1980 presidential election, but offers no real explanation. Environmental laws indeed require firms to invest in new equipment, but those requirements have imposed only modest costs. During the 1970s, the U.S. steel industry spent an average of $365 million annually to reduce pollution and improve worker safety—about 17 percent of its annual capital investment during the decade. Of this cost, 48 percent was subsidized by state and local governments through industrial-development bonds. Spending by European steelmakers was of an equal magnitude. During the same period, Japanese steel manufacturers spent substantially more for these purposes. Safety regulations also add some costs to operations, but the reduction in accidents has meant savings in time and expense that go far to offset these extra costs. Overall, capital expenditures on pollution control and safety combined have never exceeded 6 percent of industrial investment, and can be blamed for at most around a tenth of the slowdown in productivity. Nor do government deficits explain any major part of the problem. There is no evidence that deficits have been nearly large enough to discourage private investment and economic growth substantially. Indeed, through much of the 1970s, the governments of West Germany, Japan, and France maintained a much larger public debt in proportion to the national economy than did the U.S. government. Inadequate capital formation has not been the problem either. Between 1965 and 1980, even in the face of inflation, the country continued to invest about 10 percent of its gross national product in plant and equipment; for the period between 1977 and the present, the rate is more than 11 percent, and early last year it reached 11.7 percent—its highest level since 1928. Indeed, investment in manufacturing as a percent of the total output of goods increased substantially—from 10.8 percent between 1960 and 1964 to 14.8 percent between 1973 and 1978. This level of manufacturing investment was not significantly below that of America's foreign competitors. Other proposed explanations also have failed. U.S. investment in research and development declined from 3 percent of gross national product at the start of the 1970s. to 2 percent at the start of the 1980s. But this decline stemmed mostly from the slowdown in publicly financed defense and space programs, which affected American industry only indirectly. In any event, the decline in America's productive growth actually began in the late 1960s, well before any cutback in research expenditures. Nor can responsibility be placed on escalating energy prices. The oil shock affected all nations, many of which, including Germany and Japan, were much more dependent on imported energy resources than was America. Even more to the point, America's economic decline pre-dated the oil embargo, in 1973. Nor can the blame be put on the inevitable drop in output from America's mines, on the slowdown in the movement of American labor out of agriculture, on the entrance of women and young people into the labor force, or on unfair trade practices by foreign manufacturers. Even taken together, these explain only a small part of our gradual, steady economic decline relative to other leading industrial nations. They overlook the worldwide reorganization of production and America's failure to adapt to it. The central problem of America's economic future is that the nation is not moving quickly enough out of high-volume, standardized production. The extraordinary success of the half-century of the management era has left the United States a legacy of economic inflexibility. Thus our institutional heritage now imperils our future. merica's relative decline has been rooted in changes in the world market. Prior to the mid1960s, foreign trade did not figure significantly in our economy. Only a small proportion of American-made goods were traded internationally; an equally small amount of foreign production entered the United States. This situation changed dramatically. In 1980, 19 percent of the goods Americans made were exported (up from 9.3 percent in 1970), and more than 22 percent of the goods Americans used were imported (also up from 9.3 percent in 1970). But even those figures understate the new importance of foreign competition. The most telling statistic is this: By 1980, more than 70 percent of all the goods produced in the United States were actively competing with foreign-made goods. America has become part of the world market. American producers have not fared well in this new contest. Beginning in the mid-1960s, foreign imports have claimed an increasing share of the American market. By 1981, the United States was importing almost 26 percent of its cars, 17 percent of its steel, 60 percent of its televisions, radios, tape recorders, and phonographs, 43 percent of its calculators, 27 percent of its metal-forming machine tools, 35 percent of its textile machinery; and 53 percent of its computerized machine tools. Twenty years before, imports had accounted for less than 10 percent of the American market for each of these products. America's declining share of the world market has been particularly dramatic in capital-intensive, high-volume industries. Since 1963, America's share of the world market has declined in a number of important areas: automobiles, by almost one third; industrial machinery, by 33 percent; agricultural machinery, by 40 percent; telecommunications machinery, by 50 percent; metal-working machinery, by 55 percent. The globe is fast becoming a single marketplace. Goods are being made wherever they can be made the cheapest, regardless of national boundaries. And the most efficient places for much mass production are coming to be Third World countries. The International Labor Office estimates that every year between 1980 and 2000, 36 million people will enter the world labor force, and 85 percent of them will be from developing nations. The newly integrated world market will put many of them to work at America's old specialty of high-volume, standardized production. Over a period of only fifteen years, many of the world's developing countries have begun to specialize in capitalintensive production. Their production costs are lower than those of the United States, both because their workers are content with lower real wages and because some of these countries have better access to cheap materials. Moreover, the demand for many standardized commodities has been growing faster in developing nations than in industrialized nations, whose citizens already possess these products; and it is often more profitable to manufacture them within these growing markets than it is to ship them there. One important trend is often overlooked: the hourly output of workers in these newly industrialized nations is catching up to the output of American workers, simply because they are beginning to use many of the same machines. Developing countries have been able to buy (from international engineering and capital-equipment firms) the world's most modern steel-rolling mills, paper machines, and computerized machine tools. The growth of large-scale retail outlets in industrialized nations has given developing countries an efficient way to distribute their wares. Korean television manufacturers, for example, have gained a sizable share of the U.S. television market by selling to no more than a dozen large American department-store chains. By the mid-1960s, Korea, Hong Kong, Taiwan, Singapore, Brazil, and Spain were specializing in simple products—clothing, footwear, toys, and basic electronic assemblies—that required substantial amounts of unskilled labor but little capital investment or technology. Between 1970 and 1975, Korea's exports of textiles increased by 436 percent, Taiwan's by 347 percent, and Hong Kong's by 191 percent. Japan's response was to shift out of these simple products into processing industries, such as steel and synthetic fibers, that required substantial capital investment and raw materials, but used mostly unskilled arid semiskilled labor and incorporated relatively mature technologies that were not subject to major innovations. Between 1966 and 1972, the Japanese steel industry increased its steelmaking assets by more than 23 percent a year. As its own steel needs began to level off in the early 1970s, Japan increased its exports of raw steel. It invested in more than fifty finishing facilities in developing countries in order to expand its market share. By the mid-1970s, Korea, Hong Kong, Taiwan, Singapore, Brazil, Spain, and Mexico had followed Japan—shifting their export mix toward the basic capital-intensive processing industries. All told, these developing countries increased their share of world steelmaking capacity from 9 percent in 1974 to 15 percent by 1980. As less-developed countries moved into steel produm tion, Japan reduced its domestic steelmaking capacity and became a major exporter of steel technology—engineering services and equipment. Japan moved its industrial base into more complex products, such as automobiles, color televisions, small appliances, consumer electronics, and ships—industries requiring considerable investment in plant and equipment as well as sophisticated new technologies. At the same time, Malaysia, Thailand, the Philippines, Sri Lanka, India, and other poorer countries were taking over the production of clothing, footwear, toys, and simple electronic assemblies. Workers in these countries earned, on average, no more than $25 a month. By 1980, Korea, Hong Kong, Singapore, Brazil, Spain, and Mexico had increased their production of complex products such as automobiles, color televisions, tape recorders, CB transceivers, microwave ovens, small computers, and ships. Korea already has the largest single shipyard in the world; and with its salary rates averaging only one third those of major Japanese shipyards, Korea may surpass Japanese tonnage in five years. Almost all of the world's production of small appliances (whether Panasonic, Philips, General Electric, Sony, Zenith, or an obscure brand) is now centered in Hong Kong, Korea, and Singapore. Components and product designs are bought from major companies; financing is arranged through Japanese, U.S., and European banks; and distribution is handled through large retailers, such as Sears, Roebuck, or through the established distribution channels of large Japanese or American consumer-electronics companies. The trend is becoming clear enough. First, America's basic steel, textile, automobile, consumer-electronics, rubber, and petrochemical industries (and the other high-volume industries that depend on them) are becoming uncompetitive in the world. Second, now that production can be fragmented into separate, globally scattered operations, whole segments of other American industries are becoming uncompetitive. Whatever the final product, those parts of its production requiring high-volume machinery and unsophisticated workers can be accomplished more cheaply in developing nations. Automation, far from halting this trend, has accelerated it. Sophisticated machinery is readily moved to low-wage countries. Robots and computerized machines further reduce the need for semiskilled workers in high-volume production (except for workers with easily learned maintenance and programming skills). For example, robots in the automobile industry are replacing workers at more semiskilled jobs, such as welding and spot welding, than unskilled jobs. Meanwhile, automated inspection machines are reducing the cost of screening out poor-quality components—thereby encouraging firms in industrialized nations to farm out the production of standardized parts to developing nations. hat began in the 1960s as a gradual shift became by the late 1970s a major structural change in the world economy. Assembly operations were being established in developing countries at a rapid clip, and America's manufacturing base was eroding precipitously. The recession of the past two years has stalled growth around the globe and plunged several developing nations into near bankruptcy. But it is important to distinguish these short-term phenomena—brought on by a temporary oil glut and high interest rates—from long-term trends that have been growing for two decades and surely will resume. Other industrialized nations have faced the same competitive threat. Since the mid-1960s, European industries have faced an ever-greater challenge from low-wage production in developing countries. And since the late 1970s, Japan has been challenged as well. Japan is no longer a low-wage nation—the real earnings of Japanese workers are approaching those of their European and American counterparts. Japan, West Germany, France, and other industrialized countries have sought to meet this challenge by shifting their industrial bases toward products and processes that require skilled workers. Skilled labor is the only dimension of production where these countries retain an advantage. Technological innovations can be bought or imitated by anyone. High-volume, standardized-production facilities can be established anywhere. But production processes that depend on skilled labor must stay where the skilled labor is. The fate of British industry over the past twenty-five years illustrates this new reality. Britain has consistently led the world in major technological breakthroughs, such as continuous casting for steel, monoclonal antibodies, and CAT-scan devices. But because British businesses lacked the organization and their workers lacked the skills necessary to incorporate these inventions into production processes quickly enough, the British have reaped no real competitive advantage from them. These inventions were commercialized in Japan and the United States. Industrialized countries are therefore moving into precision castings, specialty steel, special chemicals, and sensor devices, as well as the design and manufacture of fiberoptic cable, fine ceramics, lasers, large-scale integrated circuits, and advanced aircraft engines. Emerging industries such as these hold promise of generating new wealth and employment as their markets expand. Some of these products or processes require precision engineering, complex testing, and sophisticated maintenance. Others are custom-tailored to the special needs of customers. The remainder involve technologies that are changing rapidly. All three are relatively secure against low-wage competition. These product categories—precision-manufactured, custom-tailored, and technology-driven—have a great deal in common. They all depend on the sophisticated skills of their employees, skills that are often developed within teams. And they all require that traditionally separate business functions (design, engineering, purchasing, manufacturing, distribution, marketing, sales) be merged into a highly integrated system that can respond quickly to new opportunities. In short, they are premised on flexible systems of production. Flexible-system production has an advantage over highvolume, standardized production whenever solving new problems is more important than routinizing the solution of old ones. The unit costs of producing simple, standardized products such as cotton textiles, basic steel, or rubber tires generally decline more with long production runs than with improvements in the production process. Manufacturers of these products therefore do well to emphasize large capacity, cheap labor, and cheap raw materials rather than flexible systems. This does not mean that industrialized countries must abandon their older industries—steel, chemicals, textiles, and automobiles. These industries are the gateways through which new products and processes emerge. Rather than abandoning these older industries, other industrialized countries are seeking to restructure them toward higher-valued and technologically more sophisticated businesses—specialty steel, special chemicals, synthetic fibers, and precision-engineered automobiles and auto components. As this adjustment occurs, they can allow the lowest-skilled standardized segments of their production to migrate to developing countries. Of all industrialized countries, Japan has made the most rapid shift from standardized production to flexible-system production, and rather than forsaking its older industries has accelerated their evolution. Japanese auto makers are experimenting with a variety of fuel-saving materials. They are developing complex manufacturing systems, and have reduced to eighty-four hours the amount of labor required to produce each car (in contrast to 145 hours per car in America). By the same token, Japan's production of high-quality polyester-filament fabrics, requiring complex technologies and skilled labor, now accounts for 40 percent of its textile exports. Japan has substantially reduced its capacity to produce basic steel, basic petrochemicals, small appliances, ships, and simple fibers, while dramatically expanding its capacity in the higher-valued, more specialized segments of these industries. To accomplish this transformation, it has applied such innovations as process-control devices, fiber-optic cable, complex polymer materials, and very large-scale integrated circuits. Japanese companies are also packaging some standard products—copiers and typewriters, for instance—within technologically complex product systems, such as office communications and computer-aided manufacturing, which require custom design and servicing. In Japan's flexible-system enterprises, the distinction between goods and services is becoming blurred. Japan has reduced its capacity in the capital-intensive, high-volume segments of its basic industries by scrapping plant and equipment, by simultaneously investing in new high-volume capacity in Korea, Taiwan, Singapore, and Brazil, and by retraining workers for higher-skilled jobs. West Germany and France are having more difficulty shifting their economies, but each country is making progress. Although the current recession has slowed industrial adjustment in both nations, Germany nevertheless has reduced its basic steel, chemical, and automobile-making capacity somewhat, and has shifted more of its production into specialty steel, pharmaceuticals, and precision machinery. Even Taiwan and Korea are seeking to shift into flexible-system industries. Korea is now establishing a semiconductor research-and-development association, jointly funded by government and industry. Taiwan is building a science-based industrial park at Hsinchu. For the United States, however, the shift has been slow and painful. The country has been far less successful than other industrialized nations in increasing its manufacturing exports to cover its increasing import bill. Recently, Japan and the nations of Western Europe have been selling America more manufactured goods than America has been selling back to them. Sales of grain and coal and revenues from services have helped ease America's trade imbalance. But these enterprises alone cannot guarantee our economic future. The most accessible coal will have been mined within the next few years; additional coal will be more costly to retrieve, not only in terms of machinery and equipment but also in damage to the environment and injuries to workers. Nor can grain exports be relied upon indefinitely; improvements in agricultural production will spread to the areas of the globe with favorable climate and soil conditions, and our soil will gradually become depleted. Nor can we rely on services. The nation's service exports depend on the vigor of its future manufacturing base. Approximately 90 percent of America's income from services consists of the investment income of its manufacturing firms and, to a lesser extent, of individuals. But this income has declined significantly since the mid-1960s. In 1965, America received 3.6 times as much investment income as it paid out to foreign firms and individuals in dividends and royalties, but by 1978 the ratio of investment income to payments was 1.8 to 1. As foreign firms continue to gain strength relative to their American counterparts in merchandise businesses, this pattern will continue. These trends pose a troubling question. If it is true that the economic future of countries lies in technically advanced, skill-intensive industries, why have American firms failed to respond by adopting the new products and processes? The answer is that the transition requires a basic restructuring of business, labor, and government. A reorganization of this magnitude is bound to be resisted, because it threatens vested economic interests and challenges established values. The transition has been easier for Japan and for some continental Europeans, both because they never fully embraced high-volume, standardized production and because they have historically linked their economic development with social change. As America has forfeited world industrial leadership to Japan, American business leaders have become obsessed with Japanese management. The business press daily praises Japanese practices such as the informal worker groups known as \"quality circles,\" said to encourage commitment, soften workplace conflict, and improve product quality. American management consultants advise business executives to convert to less abrasive forms of management, such as \"Theory Z,\" hailed as the key to Japan's success. The infatuation with Japan's management technique obscures the point that flexible-system processes cannot simply be grafted onto business organizations that are designed for the production of standardized goods. Flexiblesystem production is rooted in discovering and solving new problems; high-volume, standardized production basically involves routinizing the solutions to old problems. Flexible-system production requires an organization designed for change and adaptability; high-volume, standardized production requires an organization geared to stability. American business leaders are responding to the superficial novelty of Japanese management without acknowledging the underlying differences in the organization of production. They hope to upgrade their management techniques while retaining intact the old structure. Yet the answer lies not in new techniques but in a new productive organization, requiring a different, less rigidly delineated relationship between management and labor. he basic premises of high-volume. standardized production—the once-potent formula of scientific management—are simply inapplicable to flexible-system production. The distinct principles of flexible-system production are understood—perhaps intuitively—by many small, upstart companies in America producing new micro-electronic products and computer software or creating advertisements and films. They are also understood by a few highly successful larger companies—IBM and Hewlett-Packard, for instance. The same principles dominate many Japanese manufacturing and trading companies, and European producers of such items as precision castings, computerized machine tools, and customized telecommunications equipment. The tasks involved in flexible-system production are necessarily complex, since any work that can be rendered simple and routine is more efficiently done by low-wage labor overseas. Thus no set of \"standard operating procedures\" locks in routines or compartmentalizes job responsibilities. Skill-intensive processes cannot be programmed according to a fixed set of rules covering all possible contingencies. The work requires high-level skills precisely because the problems and opportunities cannot be anticipated. Producers of specialized semiconductor chips or multipurpose robots, for example, must be able to respond quickly to emerging and potential markets. Delicate machines break down in complex ways. Technologies change in directions that cannot be foreseen. The more frequently products and processes are altered or adapted, the harder it is to translate them into reliable routines. Again, if problems and opportunities could be anticipated and covered by preset rules and instructions, production could be moved abroad. Finally, workers' performance cannot be monitored and evaluated through simple accounting systems. In flexiblesystem production, the quality of work is often more important than the quantity. As machines and low-wage labor overseas take over those tasks that demand only speed and accuracy, workers' skill, judgment, and initiative become the determinants of the flexible-system enterprise's competitive success. Moreover, in devising and manufacturing such complex items as customized herbicides, titanium alloys, or computer-software systems, tasks are often so interrelated that it becomes impossible to measure them separately; since each worker needs the help and cooperation of many others, success can be measured only in reference to the final collective result. For these reasons, the radical distinction heretofore drawn between those who plan work and those who execute it is inappropriate to flexible-system production. When production is inherently non-routine, problem-solving requires close working relationships among people at all stages in the process. If customers' special needs are to be recognized and met, designers must be familiar with fabrication, production, marketing, and sales. Salespeople must have an intimate understanding of the enterprise's capability to design and deliver new or customized products. Flexible systems can adapt quickly only if information is widely shared within them. There is no hierarchy to problem-solving: solutions may come from anyone, anywhere. In flexible-system enterprises, nearly everyone in the production process is responsible for recognizing problems and finding solutions. In high-volume, standardized production, professional managers, staff specialists, and even low-level production workers typically get much of their training before joining the organization, and seldom venture far from a fairly narrow specialty. They move from one organization to another, but they remain within that single specialty. By contrast, in flexible-system production much of the training of necessity occurs on the job, both because the precise skills to be learned cannot be anticipated and communicated in advance and because individuals' skills are typically integrated into a group whose collective capacity becomes something more than the simple sum of its members' skills. Over time, as the group members work through various problems, they learn about each other's abilities. Like a baseball team, they practice together to increase their collective prowess. Their sense of membership in the enterprise is stronger and more immediate than any abstract identification with their profession or occupational group. They move from one specialty to another, but they remain within a single organization. The Japanese have been more successful than Americans in devising the newest generation of large-scale integrated circuits, because production entails complex and interrelated tasks that can only be perfected by a relatively stable team. Rapid turnover in U.S. companies has hindered this organizational learning. The high-volume, standardized enterprise is organized into a series of hierarchical tiers. Flexible-system production suggests a relatively \"flat\" structure: in most firms that stake their success on specialized or technically based products, there are few middle-level managers, and only modest differences in the status and income of senior managers and junior employees. The enterprise is typically organized as a set of relatively stable project teams that informally compete with one another for resources, recognition, and projects. Finally, because flexible-system production is premised oh ever-changing markets and conditions, it is less vulnerable than high-volume production to shifts in demand. Its machines and workers are not locked into producing long runs of any single standardized good. For this reason, flexible-system enterprises have less need to diversify into several lines of business as insurance against declining demand in any one. Flexible-system producers thrive on instability. Too much stability, and they would gradually lose their market to high-volume, standardized producers in low-wage countries. In all these respects, the organization of high-volume production is so fundamentally different from that of flexible-system production that the transformation is exceedingly difficult. Because the roles, experiences, training, and expectations of professional managers and workers in high-volume production differ so sharply from those that flexible-system production calls for, neither group is prepared to adapt smoothly to such a transformation. In fact, they are likely to resist it. That is what has happened. Because America's blue-collar workers often lack the skills and training necessary for flexible-system production, they have clung to the job classifications, work rules, and cost-of-living increases that brought them some security under standardized production. By the same token, because America's professional managers are ill equipped to undertake the necessary shift from high-volume production to flexible systems, they have resorted to various ploys designed to maintain or increase their firms' earnings without new productive investment. \"Paper entrepreneurialism\" of this kind merely rearranges industrial assets, while wasting the time and abilities of some of America's most talented people. aper entrepreneurialism is the bastard child of scientific management. It employs the mechanisms and symbols developed to direct and monitor high-volume production, but it involves an even more radical separation between planning and production. Paper entrepreneurialism is a version of scientific management grown so extreme that it has lost all connection with the actual workplace. Its strategies involve generating profits through the clever manipulation of rules and numbers that only in theory represent real assets and products. At its most pernicious, paper entrepreneurialism involves little more than imposing losses on others for the sake of short-term profits for the firm. The others are often members of the taxpaying public, who end up subsidizing firms that creatively reduce their tax liability. The others are sometimes certain of the firms' shareholders who end up indirectly subsidizing other shareholders. Occasionally, the others are unlucky investors, consumers, or the shareholders of other firms. Because paper gains are always at someone else's expense, paper entrepreneurialism can be a ruthless game. It can also be fascinating, and lucrative for those who play it well. When the management era began to collapse, in the late 1960s, professional managers, seeking to limit the damage, turned to the tools they had at hand. The ideology of management control was so deeply ingrained that the instinctive reaction of professional managers was typically to define, even more precisely than before, the rules and working relationships within their firms, seeking thereby to solidify their control. But because the environment was changing so rapidly—with the entrance of new foreign competitors, new products, new manufacturing processes, and the opening of new global markets—the rules and controls had to be extraordinarily elaborate. They became even more intricate as the pace of change accelerated. To coordinate the increasingly complex tasks of production, managers introduced complex techniques of \"matrix management,\" through which employees reported to several different managers for different dimensions of their work. (An employee engaged in, say, the marketing of refrigerators in South America would report to three managers—in charge of marketing, refrigerators, and South American sales, respectively.) When the matrices became too complicated, resulting in endless conflicts and confusion, organizational-development consultants were called in to design and coordinate \"project teams.\" When this team structure had so muddled personal accountability that employees began to engage in buck-passing and bureaucratic gamesmanship, managers added still more controls: budget reviews, computer-based management-information systems, narrative reports on operations, monthly \"flash\" reports, formal goal-setting systems, and detailed performance-evaluation and incentive-compensation systems. These ever-more-elaborate systems of managerial control brought with them additional layers of staff to devise the new rules and procedures, to design and monitor systems of performance appraisal, to referee the inevitable confusion over responsibility, and to mediate conflicts. Between 1965 and 1975, the ratio of staff positions to production workers in American manufacturing companies increased from 35 per 100 to 41 per 100. In certain industries, the jump has been even more dramatic. In electrical machinery, the ratio increased from 46 staff jobs for each 100 production jobs to 5 per 100; in non-electrical machinery, from 43 to 59; in chemicals, from 66 to 78. Companies with 2,500 or more employees have had a higher proportion of staff positions relative to production workers (44 per hundred in 1972) than companies with fewer than 500 employees (32 per hundred). The largest companies have the highest ratio of staff to production workers. By 1979, half of the employees of Intel—the microprocessor manufacturer—were engaged in administration. When an engineer wanted a mechanical pencil, processing the order required twelve pieces of paper and ninety-five administrative steps. It took 364 steps to hire a new employee. This sudden proliferation of staff positions within American firms is particularly striking by comparison with firms in other nations. In the typical Japanese factory, for example, foremen report directly to plant managers. The foreman in the typical American factory must report through three additional layers of management. Until very recently, Ford Motor Company had five more levels of managers between the factory worker and the company chairman than did Toyota. Bureaucratic layering of this sort is costly, and not only because of the extra salaries and benefits that must be paid. Layers of staff also make the firm more rigid, less able to make quick decisions or adjust rapidly to new opportunities and problems. In the traditional scientifically managed, high-volume enterprise, novel situations are regarded as exceptions, requiring new rules and procedures and the judgments of senior managers. But novel situations are a continuing feature of the new competitive environment in which American companies now find themselves. The typical sequence now runs something like this: A salesman hears from a customer that the firm's latest bench drill cannot accommodate bits for drilling a recently developed hard plastic. The customer suggests a modified coupling adapter and an additional speed setting. The salesman thinks the customer's suggestion makes sense, but he has no authority to pursue it directly. Following procedures, the salesman passes the idea on to the sales manager, who finds it promising and drafts a memo to the marketing vice president. The marketing vice president also likes the idea, so he raises it in an executive meeting of all the vice presidents. The executive committee agrees to modify the drill. The senior product manager then asks the head of the research department to form a task force to evaluate the product opportunity and design a new coupling and variable-speed mechanism. The task force consists of representatives from sales, marketing, accounting, and engineering. The engineers are interested in the elegance of the design. The manufacturing department insists on modifications requiring only minor retooling. The salespeople want a drill that will do what customers need it to do. The finance people worry about the costs of producing it. The marketing people want a design that can be advertised and distributed efficiently, and sold at a competitive price. The meetings are difficult, because each task-force member wants to claim credit for future success but avoid blame for any 'possible failure. After months of meetings, the research manager presents the group's findings to the executive committee. The committee approves the new design. Each department then works out a detailed plan for its role in bringing out the new product, and the modified drill goes into production. If there are no production problems, the customer receives word that he can order a drill for working hard plastics two years after he first discussed it with the salesman. In the meantime, a Japanese or West German firm with a more flexible, teamlike approach has already designed, produced, and delivered a hard-plastics drill. As the bureaucratic gap between executives and production workers continues to widen, the enterprise becomes more dependent on \"hard,\" quantifiable data, and less sensitive to qualitative information. Professional managers concentrate on month-to-month profit figures, data on growth in sales, and return on investment. \"Softer,\" less quantifiable information—about product quality, worker morale, and customer satisfaction—may be at least as important to the firm's long-term success. But such information cannot be conveyed efficiently upward through the layers of staff. Even if such qualitative information occasionally works its way to senior executives without becoming too distorted in the process, it is often still ignored. Information like this does not invite quick decisions and crisp directives. Even quantifiable information becomes distorted as it moves up the corporate hierarchy, because it must be summarized and interpreted. Distortions also occur intentionally. Lower-level managers, dependent on senior managers for rewards and promotions, naturally want to highlight good news and suppress bad news. In reporting their costs, for example, they may seek to outmaneuver the accounting department (which determines how overhead costs are distributed among units) by shifting some overhead to another unit. Since lower-level managers are competing with other managers for scarce investment resources, they are likely to present overly optimistic estimates for the projects they seek to fund. Their forecasts may underestimate costs, overestimate market demand, and leave out certain expenses altogether. The planning systems that process these estimates become arenas for organizational gamesmanship. rofessional managers at the top of American firms have come to preside over a symbolic economy. The systems of management control that they initiated in the late 1960s in efforts to maintain profitability have become more intricate and elaborate as the global market has grown less predictable, requiring additional layers of managers and staff specialists. As the bureaucratic distance between senior managers and production workers has increased, the rules and numbers in which senior managers deal have become more and more disconnected from the everyday processes of production—distorted by excessive reliance on \"hard\" data, by communication failures, and by gamesmanship. Paper entrepreneurialism relies on financial and legal virtuosity. Through shrewd maneuvering, accounting and tax rules can be finessed, and the numbers on balance sheets and tax returns manipulated, giving the appearance of greater or lesser earnings. Assets can be rearranged on paper to improve cash flow or to defer payments. And threatened lawsuits or takeovers can be used to extract concessions from other players. Huge profits are generated by these ploys. They are the most imaginative and daring ventures in the American economy. But they do not enlarge the economic pie; they merely reassign the slices. The conglomerate enterprise is one manifestation of paper entrepreneurialism. Before the late 1960s, American business enterprises generally expanded only into lines of business related to their original products. They moved into markets where their managerial, technical, and marketing skills could be applied anew, giving them a real competitive advantage. The conglomerate enterprises that mushroomed during the 1970s—multibusiness giants such as Gulf + Western, LTV, Textron, Litton, United Technologies, Northwest Industries, and ITT—are entirely different. They have grown by acquiring existing enterprises, often in wholly unrelated fields. Gulf + Western, for example, owns Paramount Pictures, Consolidated Cigar (one of America's largest cigar-makers), Kayser-Roth (a major apparel-maker), A. P. S. (an auto-parts supplier), one of America's largest zinc mines, Madison Square Garden, Simon & Schuster(publishers), Simmons (mattresses), the Miss Universe and Miss U.S.A. pageants, and a large sugarcane plantation. ITT (the world's eighth-largest corporation) owns Wonder Bread, Sheraton Hotels, Hartford Insurance, Avis Rent-a-Car, Bobbs-Merrill Publishing, and Burpee Lawn and Garden Products. Conglomerate enterprises rarely, if ever, bring any relevant managerial, technical, or marketing skills to the new enterprises they acquire. Their competence lies in law and finance. Their relationship to their far-flung subsidiaries is that of an investor. Indeed, many conglomerates function almost exactly like mutual funds, except that the staff at conglomerate headquarters presumably has slightly more detailed information about their subsidiaries than mutualfund advisers have about the companies within their portfolios. Some conglomerates have come a step closer to mutual funds by becoming minority owners of a variety of other companies. Gulf + Western actually maintains a $536 million portfolio of stocks in sixteen companies. Financial advisers within conglomerates like these decide which stocks to purchase or sell according to precisely the same criteria that financial advisers to mutual funds employ. Like the mutual fund, the conglomerate organization does not create new wealth or render production more efficient. It merely allocates capital, duplicating—though awkwardly—the functions of financial markets. The paper advantages of conglomeration extend beyond speculation and risk-spreading, however. Dexterous tax and accounting manipulations can extract paper profits from economically senseless acquisitions. Whenever a firm's stock-market price falls below its book value (the assumed market value of the firm's total assets, if they were sold off bit by bit), another firm can post significant gains on its balance sheet simply by acquiring the undervalued firm and consolidating the two sets of books. Thus, the acquiring firm's earnings increase with minimal effort. As the American economy has declined, the stock of many companies has fallen to less than book value in this way. The stock market is not being irrational; companies like these are probably worth more disassembled than they are as continuing operations. But conglomeration does not redeploy these assets; it merely displays them more attractively on a new, consolidated balance sheet. If the acquired firm has lost money in recent years, so much the better. The conglomerate that acquires it can use the losses to reduce its tax liability. Even if the assets of the acquired firm are purchased for more than their stated value in the acquired firm's books, the game is still on—the acquiring company has a higher basis for depreciating its new assets for tax purposes. (The 1982 tax law has made this route somewhat more treacherous.) U. S. Steel's purchase of Marathon Oil Company, for example, saved the steelmaker about $500 million in taxes in the first year and will save at least $1 billion more over the productive life of Marathon's Yates oil field, since tax laws let the oil field be valued for tax purposes at a higher cost than the property represented in Marathon's books. Because U.S. Steel can take new depletion deductions against this highvalued property, the Yates reserves are worth far more to it than they were to Marathon, which had already extracted what it could of the oil field's tax-deduction potential. The field's tax benefits were renewable through transfer, even if the oil was not. Conglomeration has been proceeding at a breakneck pace. By 1972, 33 percent of the employees of America's manufacturing companies were involved in lines of business totally unrelated to the primary businesses of their companies. In 1977, American companies spent $22 billion acquiring one another. In 1979, they spent $43.5 billion. That year, sixteen firms, each worth more than $500 million, were gobbled up, including Belridge Oil ($3.65 billion, bought by Shell Oil); C.I.T. Financial ($1.2 billion, by RCA); and Reliance Electric ($1.16 billion, by Exxon). All records were shattered in 1981, when $82 billion was spent on acquisitions. Du Pont paid a staggering $7.5 billion for Conoco; Fluor, $2.7 billion for St. Joe Minerals; and Gulf Oil, $325 million for Kemmerer Coal. The pace continued last year with U.S. Steel's purchase of Marathon Oil for $5.9 billion. Despite widely advertised concern over a capital shortage and calls for corporate tax breaks to spur new investment, firms bent on acquisition have seldom been deterred by price. Corporations have been paying premiums of 50 and even 100 percent over the market value for the stock of the companies they seek to acquire. Even during the \"go-go years\" of the late 1960s, when \"funny money\" fueled a short-lived merger explosion, premiums rarely exceeded 25 percent. All this has been accompanied by some of the heaviest bank borrowings in history. Du Pont borrowed $3.9 billion to buy Conoco, at an interest rate close to 20 percent. Texaco negotiated a loan of $5.5 billion from an international consortium of banks led by Chase Manhattan. Fluor Corporation borrowed $1 billion to buy St. Joe Minerals-a debt equal to Fluor's entire revenues for the first quarter of 1981. As late as the early 1960s, \"unfriendly\" takeovers were virtually unheard of. Since then, they have become a standard strategy of paper entrepreneurialism. Fear of a takeover bid haunts America's corporate boardrooms. In a 1981 survey of chief financial officers in America's 480 largest industrial firms, 49 percent thought that their companies were vulnerable to a takeover; even of the remaining group, 38 percent said that they had developed formal plans aimed at thwarting takeover bids. The fear is well founded. Of the 249 firms that have faced unfriendly takeover attempts within the past three years, only fifty-two have successfully withstood the assault and remained independent. The fear of takeover has generated an array of paperentrepreneurial strategies. Many targets of takeover bids, fleeing acquisition by a company unfriendly to their present managers, are running into the arms of another, more congenial firm. When WUI, an international telecommunications firm, learned that Continental Telephone Corporation was on its trail, it sought to be acquired instead by Xerox. Some target companies seek immunity by pre-emptively buying companies in the would-be acquirer's own industries, so that antitrust laws block the acquisition attempt. Daylin, Inc., defending itself against WR. Grace's recent tender offer, sought to purchase Narco Scientific, Inc.—a maker of equipment in a product line so similar to Grace's that Grace would be barred from taking over Daylin. One of the more bizarre—and expensive—defense strategies is for a target company simply to reduce its cash reserves and thus become less attractive to potential predators. This may explain J. Ray McDermott & Co.'s $758 million acquisition of Babcock & Wilcox, and Kennecott Copper Corporation's $567 million purchase of Carborundum. Increasingly, target companies are paying would-be acquirers high premiums to buy back blocks of stock that the acquirers have amassed. As a lawyer experienced in such tactics recently explained to The Wall Street Journal, \"Look, I now have 7 percent or 8 percent of your stock. I'm not going after your company. But if you don't buy back the block from me at a premium, I know five or six guys who are interested and could take you over.\" This is the corporate equivalent of a demand for ransom. And paper entrepreneurs are generating large earnings from such threats. Even if the target company refuses to pay the ransom, its stock typically shoots up when Wall Street learns that a takeover may be afoot. Thus the paper entrepreneur can generate earnings simply by selling the block of stock in the open market. Bendix recently made $75 million after taxes by buying and then selling back 20 percent of the outstanding stock of Asarco. Gulf + Western announced in September of 1980 that it had made open-market purchases of large blocks of stock in two companies: a 7.4 percent interest in Oxford Industries, Inc., and a 10.4 percent interest in Robertshaw Controls Company. Two months later, both Oxford and Robertshaw bought back their shares, for a total of $2.1 million more than Gulf + Western had paid for them. he largest gains from conglomeration lie in their potential for opening access to ready cash at low or no cost, while simultaneously avoiding or deferring income taxes. Financial conglomerates offer particularly rewarding possibilities along these lines. Consider, for example, Baldwin-United—a company that until 1968 was known for the Baldwin piano, which it had been making since 1891. Piano sales were growing slowly, and the pressure from foreign competition was increasing. So Baldwin purchased a bank, twelve insurance companies, a savings-and-loan company, some mortgagebanking companies, America's largest mortgage-insurance company, and America's two largest trading-stamp companies. Many of these companies have been cheap sources of cash. The insurance companies have provided low-cost funds in the form of premiums; the savings-and-loan company has brought in deposits at low; passbook rates; the mortgage-banking and servicing companies have transferred billions of dollars in mortgage and real-estate tax payments from borrowers to lenders, while holding the funds for up to several weeks in the process; and the trading-stamp companies sell stamps to merchants, who give them to customers, who are unlikely to redeem them for months or years, if ever. Baldwin has further enlarged its earnings by avoiding or deferring taxes on these cash flows. Baldwin's mortgage-banking acquisition had unrealized losses in its loan portfolio, which Baldwin then used against its overall earnings; Baldwin also deducts the commissions it pays to its brokers in the year paid, which occasionally generates large tax losses. With these ample deductions, Baldwin has been able to redeem the bonds that its mortgage-insurance company bought, with tax impunity. As a result of all these financial and tax ploys Baldwin's return on equity has increased from 13 percent to 31 percent since 1968, and its earnings per share have grown at a 20 percent annual rate. Conglomerates offer no particular efficiency in allocating capital to its best use. Investors who wanted to buy into a particular bundle of industries could simply have bought stocks separately. American investors gain nothing from having the bundle prepackaged in the form of a diversified conglomerate. Indeed, conglomerates undermine the efficiency of America's capital market by eliminating investors' option to buy into Bobbs-Merrill alone, for example, without taking stock in all the rest of ITT's hodgepodge of businesses. Nor, as we have seen, do conglomerates serve any useful industrial purpose. Unlike earlier multidivisional firms, which featured some complementarity among operations, modern conglomerates are typically little concerned with the actual economic functions of the various subsidiaries, beyond the interest a landlord might take in a sharecropper's labors. Nor do they benefit employees. When one of a conglomerate's businesses begins to falter, only capital assets are salvaged and redeployed. Workers typically are left to fend for themselves. Thus modern conglomerates are economically sterile. Their only effects are to facilitate paper entrepreneurialism and to spare managers the need to stake their careers on anything so risky as a single firm trying to make products. The growth of conglomerates illustrates managers' discretionary power to serve their own goals, and reveals how far economic change since the end of the management era has separated managers' incentives from socially productive results. Paper entrepreneurialism does not rely solely on acquisitions, of course. Every month or so, another innovative paper ploy is unveiled. For example, many companies are now engaging in an expensive and financially empty exchange of new stock for old bonds. It works like this: A company that sold long-term bonds when interest rates were lower—and, thus, so was the yield, or \"coupon,\" the bond had to offer—still carries the debt on its books at the original face value, even though the outstanding bonds are in fact being traded on the market at a discount because they yield less per dollar of face value than new financial assets. (That is, the books may show debt of $10 million, even though the market value of the bonds has fallen to $7 million.) This debt bothers the firm's managers, who want the balance sheet to seem as unencumbered by indebtedness as possible. So investment brokers have gone into the business of buying up old bonds at their (low) market value and offering to return them to the issuing firm in exchange for new shares of common stock. By buying back its old bonds, the company can claim to have \"retired\" a deceptively large chunk of debt, based on the financially irrelevant face value of the bonds, and so managers are willing to pay the broker handsomely for engineering the swap. The company makes a precisely offsetting trade—a certain market value of stock for an equal market value of bonds. The cost: millions in brokers' fees and premiums. The only result: some gullible investors may be led to believe that the company has suddenly become less burdened by debt, and therefore more valuable. And the ruse is taxfree, treated as a non-taxable corporate reorganization so long as the broker handles the mechanics. Since August of 1981, more than a hundred such exchanges have swept at least $2 billion in debt from corporate balance sheets. Even U. S. Steel managed to use this ploy to report a profit for the depressed second quarter of 1982, despite its sizable losses in the steel business. Like other gimmicks, this one will go out of fashion in a year or two, when investors and the Internal Revenue Service catch on, and another innovation will replace it. Paper entrepreneurs also display their virtuosity in \"creative\" accounting. In 1978, for example, when slumping car sales began to push Chrysler Corporation deeper into the red, forcing the auto maker to halt production at many plants and cut its dividends by 60 percent, the company still managed to project a fourth-quarter profit. Thanks to a little-noticed actuarial adjustment, Chrysler had merely changed the assumed rate of return on its employee-pension portfolio to 7 percent from 6 percent, reducing pension costs and adding about $50 million to its profits. This alteration was likely to escape the eyes of analysts and auditors, who are seldom trained in pension matters. Chrysler did nothing illegal. Indeed, it disclosed in a footnote to its annual report that it had made the actuarial change, although it did not state any figures. Other methods of \"earnings management\" abound: showing certain transactions as collateral borrowings rather than as sales; overstating or understating inventories; failing to account fully for the effect of inflation on the value of inventories or profits; overstating the value of good will gained from a merger or acquisition; and understating the price paid for an acquisition. For example, GE paid about $2 billion worth of stock to acquire Utah International in 1976, but \"pooling-of-interest\" accounting rules let GE show a price of only $548 million on its balance sheet. Utah International's $196 million profit in 1977 looked much better on $548 million than it would have on $2 billion. None of these ploys is illegal. Nor do they violate generally accepted accounting principles, which give firms wide latitude in reporting their earnings. Given the complexity of modern business practices and the uniqueness of each firm, more rigid accounting rules might actually lead to greater distortions. And that is the point. The set of symbols developed to represent real assets has lost the link with any actual productive activity. Finance has progressively evolved into a sector all its own, only loosely connected to industry. And this disconnectedness turns business executives into paper entrepreneurs—forced to outsmart other participants, or be themselves outsmarted. All of this paper entrepreneurialism takes place against a background of mounting lawsuits. Professional managers in companies targeted for takeover are suing their predators. Shareholders are suing managers. Acquiring companies are suing the officers of the companies they have acquired. Purchasers of futures contracts are suing sellers who cannot meet the payments. The number of business lawsuits stemming from breach of contract, antitrust, or alleged \"wasting\" of corporate assets has increased fourfold since 1965. ne must be clear about the problem of paper entrepreneurialism in America. Paper entrepreneurialism does not directly use up economic resources. Every economy needs some paper entrepreneurs to help allocate capital efficiently among product entrepreneurs. The problem is that paper entrepreneurialism has replaced product entrepreneurialism as the most dynamic and innovative occupation in the American economy. Paper entrepreneurs produce nothing of tangible use. For an economy to maintain its health, entrepreneurial rewards should flow primarily to products, not paper. As Lord Keynes recognized nearly fifty years ago, \"When the capital development of a country becomes a by-product of the activities of a casino, the job is likely to be ill-done.\" Ours is becoming an economy in which resources circulate endlessly among giant corporations, investment bankers, and their lawyers, but little new is produced. Financial resources are kept liquid in order to meet the next margin call, to enter the next position, or to exploit the next takeover opportunity. They are not applied in earnest to any single undertaking, for fear that they will soon be needed for something else. There is scant investment in new products or processes, because such endeavors tie up resources for too long. In 1979, RCA Corporation complained publicly that it lacked the $200 million that would be needed to develop a video-cassette recorder, although recorders are the fastestgrowing appliance of the decade. RCA thereby ceded the video-cassette market to the Japanese. But RCA had no qualms about spending $1.2 billion to buy a lackluster finance company that same year. In 1979, U.S. Steel decided to scrap its plan for building a new steel plant. Instead, it began building a cash reserve to acquire some other, more promising company, such as Marathon Oil. While business leaders are otherwise engaged, America's industrial base remains wedded to high-volume, standardized production. Flexible-system production does not fit well into large conglomerate enterprises. The enterprises are too diffuse and fragmented to generate team spirit, too unwieldy and bureaucratic to accommodate novel approaches to new problems. Real-product entrepreneurs bridle at the red tape.. Employees are discouraged from choosing unorthodox solutions. It is often difficult, from the mire of conglomerate headquarters, to identify unique customer needs. Big companies also tend to wait for markets to develop; they are not equipped successfully to pursue the markets that do not yet exist. Exxon's plunge into the \"office of the future\" has been an unmitigated disaster. The company is losing money at a rate that would bankrupt almost anyone else—in 1980 alone, its office-equipment division lost $150 million on sales of $270 million. Industrial giants such as Monsanto, Ford, and Sylvania, which tried several years ago to develop their own commercial semiconductor operations, failed miserably and withdrew from this rapidly changing market. Other large companies—RCA, TRW, Westinghouse—have not done much better. But perhaps the greatest cost is in human talent. Today's corporate executives spend an increasing portion of their days fending off takeovers, finding companies to acquire, conferring with their financial and accounting specialists, and responding to depositions in lawsuits, instead of attending to their products. Indeed, approximately 40 percent of the chief executive officers of America's largest firms have backgrounds in law or finance and rose to their present positions from company legal or financial staffs. This is in sharp contrast to the past. In 1950, only 13 percent of America's key chief executive officers had legal or financial backgrounds. Most came up through the ranks from marketing, engineering, or sales. Increasingly over the past fifteen years, the most sought-after jobs among business-school graduates have been in finance and consulting, where the specialty is rearanging assets and shuffling corporate boxes—and from where bright young MBAs have their best shot at becoming corporate executives. Only 3 percent of Harvard Business School's 1981 graduates took jobs in production and 18.6 percent in sales and marketing, while 21.6 percent went into finance. Young people seeking quick affluence without much risk have turned to the practice of law, where America's highest-paying entry-level jobs are found. In a recent survey, 24 percent of Harvard freshmen said they were planning a career in law; only 7 percent were going into science. In 1982, New York City's largest law firms were paying their young recruits, fresh out of law school, $48,000 a year. In 1980, the median income for partners in New York's largest law firms was $242,685, up 50 percent from 1975. Law firms can afford to pay these exorbitant salaries because legal fees keep rolling in. Between 1940 and 1960, only about one American in 600 was a lawyer. Between 1971 and 1981, the number of practicing attorneys increased by 64 percent. America now has more than 590,000 lawyers—one for every 400 citizens. Over the same decade, however, there was only a 15 percent rise in the number of engineers, and a 25 percent rise in the number of laborers. Only about one of every 10,000 citizens in Japan is trained in law, while one out of twentyfive Japanese citizens is trained in engineering or science. More than 65 percent of all seats on the boards of Japanese manufacturing companies are occupied by people who are trained as engineers; roughly the same percentage of seats on American boards are taken by people trained in law, finance, or accountancy. Thus, in Japan, many problems that arise in business are viewed as problems of engineering or science, for which technical solutions can be found. In present-day America, the same problems are apt to be viewed as problems of law or finance, to be dodged through clever manipulation of rules or numbers. Increasingly, professional education in America stresses the manipulation of symbols to the exclusion of other sorts of skills—how to collaborate with others, to work in teams, to speak foreign languages, to solve concrete problems—that are more relevant to the newly competitive world economy. And more and more, the career ambitions of Americas best students have turned to professions that allow them to continue attending to symbols, from quiet offices equipped with a telephone, a Telex, and a good secretary. The world of real people, engaged in the untidy and difficult struggle with real production problems, becomes ever more alien to America's best and brightest. Paper entrepreneurialism is both cause and consequence of America's faltering economy. Paper profits are the only ones easily available to professional managers who sit isolated atop organizations designed for a form of production that is no longer appropriate to America's place in the world economy. At the same time, the relentless drive for paper profits has diverted attention and resources away from the difficult job of transforming the productive base. It has retarded the transition that must occur, and made change more difficult in the future. Paper entrepreneurialism thus has a self-perpetuating quality that, if left unchecked, will drive the nation into further decline. What do you think? Discuss this article in the Politics & Society conference of Post & Riposte. Copyright © 1983 by Robert B. Reich. All rights reserved. The Atlantic Monthly; March 1983; The Next American Frontier; Volume 251, No. 3; pages 43-58.","filter_flag":1}
{"title":"How Tata Steel is leading sustainability in the steel sector","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2favenuemail.in%2fhow-tata-steel-is-leading-sustainability-in-the-steel-sector%2f&c=5405140777589256373&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2favenuemail.in%2fhow-tata-steel-is-leading-sustainability-in-the-steel-sector%2f&c=5405140777589256373&mkt=en-us","summary":"As a responsible and trusted corporate citizen with a brand name that is recognised and respected within and beyond India’s border, Tata Steel has for the last more than a decade successfully embarked ...","published":"Sun, 23 Jun 2024 05:59:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=23, tm_hour=5, tm_min=59, tm_sec=0, tm_wday=6, tm_yday=175, tm_isdst=0)","news_source":"avenuemail.in","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Tata Steel is leading sustainability in the steel sector","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"As a responsible and trusted corporate citizen with a brand name that is recognised and respected within and beyond India’s border, Tata Steel has for the last more than a decade successfully embarked ...","news_image":"http:\/\/www.bing.com\/th?id=OVFT.zK9k7ZygrjX593YfuPbYJC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":365.0,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"Advertisements June is being observed as Sustainability Month across locations of Tata Steel Steel sector today, both globally and in India is being closely watched by sustainability advocates for its role in building an environmentally responsible ecosystem that not only continues to produce the world’s favourite alloy but one that does not leave behind any unwanted residue that could pollute the air, water, or earth. As an energy and other resources intensive sector, the sustainability challenge faced by the steel sector is no ordinary one and demands a fundamental shift in how it has been operating for decades now. It is in this context that Tata Steel, India’s oldest steel maker and one with a global footprint is fast emerging as a leader in sustainability too. As a responsible and trusted corporate citizen with a brand name that is recognised and respected within and beyond India’s border, Tata Steel has for the last more than a decade successfully embarked on a remarkable sustainability journey that is setting new benchmarks on a wide range of environmental parameters not only for its own operations but also for others to emulate too. In an effort to minimise its carbon footprint and pivot towards sustainable practices, Tata Steel is committed to the Tata Group’s stated objective of achieving Net Zero emissions by 2045 as part of the group-wide Project Aalingana. As we celebrate the Sustainability Month (in June every year) flagged by the World Environment Day (on June 5) let us look at the some of the key initiatives and achievements of Tata Steel in these two vital and interconnected challenges. Water Water is one of the critical resources for producing steel. Over the last 5 years, Tata Steel has reduced the specific freshwater consumption (m3\/tcs) for its crude steel manufacturing sites in the country by 33%. It has managed to do this by implementing various water conservation projects at its steelmaking and mining sites. These include deploying dry processes for reduction, pumping infrastructure for water recovery, and a central effluent treatment plant with reverse osmosis to treat and recycle effluent in steelmaking processes. The treated effluents are being reused for low-end applications like coke quenching, blast furnace slag granulation, steel slag quenching, sinter and pellet mixing, gas cleaning plant, horticulture, dust suppression, etc. Air Reduction of dust emission is one of the thrust areas to improve air quality across the Tata Steel’s operating sites. This has been achieved through upgraded pollution control equipment, implementation of new technologies, consistent internal efforts and maintenance strategies. These measures have helped Tata Steel to significantly reduce its stack dust emissions in the country. From 1994-95 to 2023-24, stack dust emissions were reduced by 97.8% and 67% at the Jamshedpur and Kalinganagar steelworks respectively. Similarly, since its acquisition in 2018-19, the Meramandali plant’s (India’s largest flat steel production plant) stack dust emissions have also been reduced by 54% by 61% at Gamharia (Tata Steel Long Products). Solid Waste Management Committed to its ‘Zero Waste to Landfill’ target, Tata Steel handles around 16 million tonnes of by-products per annum (MTPA), spanning 25+ product categories with 250+ stock keeping units or SKUs. As a one of its kind in the industry , a dedicated Industrial By-Products Management Division handles the by-products generated in the value chain of the steel making process. Most of the by-products generated forms a key raw materials source for various industries like cement, chemicals, construction, railways and power. In FY 2023-24, Tata Steel achieved 100% solid waste utilisation at Jamshedpur, Kalinganagar, Meramandali, and Gamharia. Steel making (LD) slag , a by-product during steel making process , has had been a challenge for the entire steel industry owing to its propoeties and limited applicates and traditionally had been posing an environmental challenge as it would largely go into landfills, in the past. Tata Steel became the first plant in India to implement the in-house developed technology of accelerated weathering (steam aging facility) of steel slag on an industrial scale. This has enabled manufacturing of superior quality aggregates which are used as replacement of natural aggregates in road construction. In a first of its kind initiative in the country, Tata Steel launched two new products – Tata Aggreto and Tata Nirman, for application in road, fly ash brick and cement manufacturing. Apart from extensive utilization in National Highways, State Highways, city roads and rural roads (under Pradhan Mantri Gram Sadak Yojna, PMGSY), these products have been successfully used to construct over 1 kilometre stretch of road connecting the Sino-Indian border in Arunachal Pradesh by Border Roads Organisation (BRO). Tata Aggreto and Tata Nirman has been tested to be a superior product over natural aggregates in road construction industry helping in conservation of natural biodiversity. Tata Steel has also developed a patented sustainable waste management technology for utilising Basic Oxygen Furnace slag to manufacture a sulphur-rich nutrient supplement branded ‘Dhurvi Gold’. Blast Furnace slag is another voluminous solid waste or by-product generated from integrated steel plants. Based on this material, Tata Steel has introduced a new brand – Tata Dureco, which is Ground Granulated Blast Furnace Slag (GGBS). It is a GreenPro certified sustainable product which can be used as partial replacement of cement in concrete production and is extensively used in construction industry. Tata Dureco has been used in developing some of the iconic nation building projects in the country and has gathered interest for may key projects both in domestic as well as international markets. Other key initiatives include a one-of-a-kind endeavour to convert the hazardous sludge of steel plant into value-added pellets, replacement of coal tar usage in blast furnace by low-sulphur furnace oil which is a greener alternative. Tata Steel has also developed eco-friendly light construction products such as green paver blocks and interlocking blocks, which are manufactured using iron and steel slags. Cutting Carbon footprint As part of its efforts to reduce carbon footprint from its manufacturing processes, Tata Steel has adopted the ‘circular economy’ route, a key element of which is recycling of steel scrap. The company is implementing innovative strategies to enhance steel scrap utilisation in steelmaking, including establishing an Electric Arc Furnace (EAF) based long products steel plant in Ludhiana. This plant will have a minimal carbon footprint and a capacity of 0.75 MnTPA, maximising the use of steel scrap. Clean energy transition India is currently undergoing one of the world’s largest clean energy transitions that is impacting every industrial sector. Given that steel making is an energy-intensive sector, Tata Steel too is increasing its clean energy portfolio by partnering with Tata Power Renewable Energy Ltd to establish approximately ~966 MW of solar and wind hybrid renewable power capacity under a captive arrangement. This initiative will address 379 MW of the Company’s power requirement in India and facilitate an annual reduction of over 2 million tonnes of CO2 emissions. Biodiversity Conservation Tata Steel has persistently made efforts to improve its performance in biodiversity conservation and reduce its impact on the ecosystem. It endeavours to avoid, minimise, regenerate, restore and transform its biodiversity impact. The Company’s operations are not located in any of the identified biodiversity hotspots or protected areas. In consultation with stakeholders and experts, the Company has developed Biodiversity Management Plans (BMPs) for 17 sites and plans to cover the remaining ones. In Jharia, Tata Steel has championed bamboo plantation in the leasehold and barren community land, aggregating to about 110 acres. A strong collaboration with farmers in the plantation areas generates new livelihood opportunities, reducing their vulnerability to climate change. In Gamharia, a 30-acre barren ash mound within the plant premises was stabilised by developing a rich biodiversity park, Kailash Top, with around 25,000 plants and shrubs. The water requirement is managed through treated wastewater from the captive effluent treatment plant, realising the principle of circularity. In Jamshedpur, Tata Steel has created a new 1-acre water body in the Sidhgora area, with a capacity of 10 million litres. In Meramandali, a 9.5-acre pond was renovated. With a 25 million litres capacity, the water body touches the lives of 600 people. In recent past, nature trails, biodiversity parks and urban forests have been set up in Kadma, CH area, Sonari, Sidhgora among other places of Jamshedpur besides rejuvenation of water bodies in CRM Bara and other strategically important locations of Jamshedpur. Recognitions Tata Steel’s efforts have been receiving global recognition in some of the most important sustainability forums. The company has been recognised as a Steel Sustainability Champion 2024 by worldsteel for the seventh consecutive year for its commitment and action to sustainable development and adherence to world-class standards. Earlier this year, the company’s plants in Kalinganagar and Meramandali received ResponsibleSteelTM Certification, while the same status was conferred on its Jamshedpur plant in 2022, making it the first one in India to receive this prestigious status.","filter_flag":1}
{"title":"Quality, Test & Measurement News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.globalspec.com%2fnewsletter%2fpub%2f100%2fquality-test-measurement&c=8285740011896809389&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.globalspec.com%2fnewsletter%2fpub%2f100%2fquality-test-measurement&c=8285740011896809389&mkt=en-us","summary":"Quality, Test & Measurement covers enterprise improvement methodologies intended to prevent and eliminate product and process defects. These test and measurement tools are used to inspect new products ...","published":"Wed, 05 Jun 2024 04:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=5, tm_hour=4, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=157, tm_isdst=0)","news_source":"Engineering360 News","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Quality, Test & Measurement News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Quality, Test & Measurement covers enterprise improvement methodologies intended to prevent and eliminate product and process defects. These test and measurement tools are used to inspect new products ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"5G & Digital Networking Get the most important news, product releases and research from the world of telecommunications, relating to 5G, 6G, Wi-Fi, Bluetooth, NFC and other data sharing technologies, and providing a high-level review of the widespread impact in all industries from these technologies. Acoustics & Audio Technology News and insights about all things audio engineering. Learn about audio chips, microphones, cutting-edge headphone technologies, recording technologies, connectors, sound abatement and anechoic technologies and more. Aerospace Technology Covering the technologies, products and data that power aircraft, drones, spacecraft and satellites. Alternative & Renewable Energy Renewable energy news and features cover solar, wind, hydroelectric and other alternative energy technologies. Appliance Technology Design, performance and component trends for consumer, commercial and medical appliances are tracked. Automotive Technology Focuses on new developments in the automotive space including electric and self-driving vehicles as well as autonomous trucks and other emerging means of transportations such as eBikes and scooters. Careers & Education \"For practicing, prospective and retired engineers, stay up to date on all aspects of the engineering career. From college and coursework, to licensing and continuing education, and engineering management and quality of life – this is the comprehensive newsletter to life as an engineer. Access to career tips, trends and opportunities for current engineers, challenges and insights into engineering management, and news updates on those studying to be tomorrow's engineers. \" Chemical Manufacturing News and analysis on the production of chemical agents and solutions - everything from acids, dyes or drugs to rubber and polymer materials. Coatings & Surface Engineering Offers insights into the latest developments in the surface engineering industry, with a focus on films, coatings and other surface technology. Components for RF & Microwave Reports on the latest developments and applications for microwave and radio frequency systems. Connected Electronics Get news and analysis on the smart, interconnected technologies and devices that are creating automation and efficiencies on a personal level. Smart phones, networking technology, cloud and edge computing, smart homes, software, consumer robots and more – it is all here. Construction Equipment Analysis on the latest in construction equipment and technologies, including tools, trucks, cranes, material handling equipment and safety gear. Data Acquisition Focuses on measurement of machinery or conditions, and the conversion of that data into a digital medium for monitoring and management. Defense & Security Technology Offers readers the latest on the defense and security realm, including military, cyber security, data privacy, personal security and everything in between. Display Technologies Offers information on interface many kinds, including LED and LCD displays, touchscreens, flat panels, interfaces, work stations and more. Electrical Components Reports new developments in batteries, power supplies, capacitors and other components used to design consumer and commercial products. Electronic Components Delivers information on circuit boards, interconnect devices and other components used to design and manufacture consumer electronics, computers and industrial equipment. Electronic Design Solutions The latest news, data and technologies that help electronics engineers design and select innovative components, systems and products for consumer and industrial markets. Stay informed about advances in electronic hardware and embedded software. Electronic Test Equipment Details the emerging and established systems for electronic test equipment including extreme ultraviolet lithography, wafer cleaning systems, analysis platforms, oscilloscopes and other equipment. Electronics360 Electronics360 Weekly features the top stories, latest news, charts and more from Electronics360. Engineering in Motion Videos of interesting, creative or innovative new technologies from a variety of industries. Environmental Technology Reports on sustainability, pollution control, waste management, conservation and enviromental technology. Factory Engineering A look at news, data and studies from the manufacturing engineering, facilities management and construction fields. Fastening, Joining & Assembly Offers news and analysis on mechanical fasteners, welding and joining processes, assembly equipment and processes, and joint inspection. Fluid Control Stay in touch with novel solutions, insights and news from the world of fluid control. We focus on pumps, valves, seals, meters and other devices that permit, amplify or restrict any type of fluid – water, chemical, hydraulic or otherwise. Food & Beverage Technology News and insights in food processing, quality control, distribution, plant processing technology and sanitation. HVAC Provides technological news, features, analysis and product briefs for climate control engineers and professionals. Hydraulics & Pneumatics Details the latest developments and research surrounding hydraulic and pneumatic technologies. Industrial IoT Details the systems and associated components surrounding automated manufacturing, assembly and inspection. Industrial MRO Provides news and analysis into emerging and current maintainance, repair and operations of industrial and electronic processes. Industrial Processing Equipment Focuses on motors and drives, conveyors, filtration systems, mixing and blending equipment and other products and solutions used in large-scale manufacturing of fluids, gases, and powders. Innovators & Makers Coverage of novel innovations, materials and applications, including those who operate 3D printers, laser cutters, Raspberry Pi, Arduinos and other high-tech machinery in a hobbyist, artisan or entrepreneurial capacity. Lab Equipment News and info on scientific instruments, equipment and materials for industrial R&D, manufacturing and healthcare engineering. Light & Laser The latest news and analysis into laser technologies and the manipulation and distribution of light such as emerging LEDs and their uses across a variety of industries. Machining & Metal Working Offers information and in-depth analysis about drilling, cutting and surface preparation, as well as welding and metal joining technologies. Manufacturing Technology News, features, products and more about modern manufacturing - robotics, machinery, process engineering, Industry 4.0, product development and more. Material Handling & Logistics Covers assorted topics including industrial automation, material handling, design and analysis software, mechanical components, networking and communications, display technologies, drives, electrical components, mechanical power transmission, motion control components, motors, robotic systems, sensors and switches and wireless technology to name just a few. Materials Solutions Delivers news on the synthesis and application of metals, specialty alloys, glass, ceramics, fibers and fabrics, plastics and composite materials. Mechanical Components Info on the mechanical parts that drive machinery, such as fasteners, power transmission, seals, springs, shock and vibration, solenoids, tools and bearings. Mechanical Power Transmission Provides insights from the world of mechanical power transmission. Topics include power system components like brakes, clutches, chains and couplings, as well as new system designs. Medical Device Design Regular insight into the technologies at the forefront of medical science – wearables, prosthetics, AI, robots and more – as well as the critical areas of equipment design, manufacturing and facility engineering. Military & Ruggedized Electronics Provides news about new mission-critical electronics-focused projects and systems designed for military, aerospace and defense use. Motion Control Components News and analysis from the world of mechanical motion controls. Bearings, motors and tranmissions, actuators, sensors, slides, spings and much, much more. Motors & Drives New developments and case studies pertinent to engineers designing or specifying AC, DC, servo and other motors and associated drive types. Oil & Gas Technology Covers oil and gas topics ranging from exploration and drilling to tank filling and product processing. Polymer & Composite Materials Delivers the latest in new plastic materials across all industries, including thermoplastics, thermosets, composites, surface technologies and composites. Power Grid Technology Reports trends in centralized and on-site power production, transmission & distribution, prime movers, fuels and generation technologies. Power Supplies & Devices Tracks new developments in power supply systems and components integral to computers, telecommunications, process control and automation. Process Technology Delivers content and news on the chemical manufacturing of fluids, gases and powders from raw materials. Product Design Software New simulation products and trends that help design and product engineers investigate thermal, mechanical, electrical or other effects. Robots & Automation News on key robotics technologies, including software, motion control, power supplies, materials and machine learning, as well as emerging applications. Scientific Instruments Offers insights on scientific instruments, apparatus, software, detectors and technqiues in science research. Semiconductor Manufacturing Insights into semiconductor manufacturing, and the MEMS technologies that use semiconductors. Sensing Technologies News, features, products and analysis about the latest MEMS, sensors and switches and their use in emerging and established technologies. Shock, Vibration & Noise Reports, analysis and data for solutions to prevent or minimize industrial shock, vibration and noise. Software Engineering & Programming The news, resources and knowledge needed to advance in the software engineering industry. Specs & Techs Covers all the technologies engineers need for new product development: from mechanical, electrical, and electronic components to engineering software, fluid power, materials, and more. Structural & Civil Engineering Gather insights and updates from the world of civil engineering, from the design and architecture phase all the way through construction. We cover the materials, tools and technologies that bring buildings, residences, roadways, utilities and more to life. The Marketing Maven Covers all the technologies engineers need for new product development: from mechanical, electrical, and electronic components to engineering software, fluid power, materials, and more. Transportation Technology News, products and analysis on the transportation industry and supply chain. Land, sea, air and space - it all fits here. Water & Wastewater Systems News for industrial and municipal water\/wastewater system operators covers treatment and delivery technologies, products and regulations. Wire & Cable Technology News of interest for manufacturers and users of various wire and cable technologies and assemblies in the electrical, communications and other sectors.","filter_flag":1}
{"title":"Industrial Processing Equipment News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.globalspec.com%2fnewsletter%2fpub%2f53%2findustrial-processing-equipment&c=14798894341501915042&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.globalspec.com%2fnewsletter%2fpub%2f53%2findustrial-processing-equipment&c=14798894341501915042&mkt=en-us","summary":"Description: Engineering360's Industrial Processing Equipment Newsletter covers products and solutions used in large-scale manufacturing of fluids, gases, and powders. Subscribers will find ...","published":"Tue, 12 Mar 2024 20:41:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=3, tm_mday=12, tm_hour=20, tm_min=41, tm_sec=0, tm_wday=1, tm_yday=72, tm_isdst=0)","news_source":"Engineering360 News","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Industrial Processing Equipment News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Description: Engineering360's Industrial Processing Equipment Newsletter covers products and solutions used in large-scale manufacturing of fluids, gases, and powders. Subscribers will find ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"Past Issues of this eNewsletter How Data-driven Analysis Can Help Reduce Downtime; Innovative food and beverage heating and temperature control solutions Smarter, faster, easier: Laser sensors with integrated industrial Ethernet interface; Process and product innovation for a safer, smarter and more sustainable mining industry; Gentle, thorough, indirect thermal processing Food packager turns to immersion heater for maintaining liquid temperature; Filtration system elements: Essential to optimized equipment performance; Improve product quality and reduce downtime with paxton air knives SMART laser scanners with increased performance; Reduce costs by 30% with process fan redesigns; Do you need instantaneous and reliable hot water?; Effective and versatile spot cooling with cold air guns; Mixing tanks: Powering microencapsulation for enhanced biomedical and culinary advancements An all-in-one guide to gas dehydration units; Monitoring flammable vapors and gases in industrial processes; Hannay SSN700 stainless steel spring rewind reels; Effective and versatile spot cooling with Vortec cold air guns; Custom manufacturer — supplying OEM's since 1972 ROSS multi-shaft mixers are robust and versatile; Outlook of electric vehicles; Extreme duty inductive linear position sensors; Liquid processing solutions at any scale; Highly efficient indirect drying Automated inline 3D inspection of geometry, form and surface; How to choose the best drag chain conveyor; Optimizing brownfield chemical plants with instrumentation; Effective and versatile spot cooling with cold air guns How high-performance micrometers set new standards in precision and versatility; Precision drop-in replacement hygrometer is American made and NIST traceable Pharma industry trends discussion series — Hygienic design; Webinar: Indian Boiler regulations — recent changes; Airfoil bearings vs magnetic bearings in turbo blowers Volume 18 - Issue 18 - 12\/11\/2023 Robust industrial-grade flow meters — no flow conditioning required; EP Type-2 shaft seal; Precision dew, frost point and relative humidity transmitter for industrial use; Use of industrial heating appliances in the food industry Volume 18 - Issue 17 - 11\/17\/2023 7 examples of laser scanners improving quality and performance in machine building and factory automation; Do you need instantaneous and reliable hot water? Volume 18 - Issue 16 - 11\/03\/2023 Inline thickness monitoring of of strip and plate materials; Single pair Ethernet: For fast and direct communication with machines Volume 18 - Issue 15 - 10\/20\/2023 Space-compliant power supply scheme for quad ARM® Cortex®-A72 processing module QLS1046 from Teledyne e2v; Customize construction styles to your application with Duraband (Micaband) heaters Volume 18 - Issue 14 - 10\/06\/2023 eBook download: Basic Electronics Principles; 3D laser scanners for inline inspection; Navigating the highs and lows of the semiconductor industry Volume 18 - Issue 13 - 09\/01\/2023 The MTA pump is ideal for most chemical applications; Gas Detection Handbook — Key concepts and reference materials for installed gas monitoring systems; Color sensors in food production Volume 18 - Issue 12 - 08\/18\/2023 Interview; An overview of functional safety in the process industry Volume 18 - Issue 11 - 08\/04\/2023 Injection molded parts without breaking the bank; Hannay SSN700 stainless steel spring rewind reel Volume 18 - Issue 10 - 07\/07\/2023 eBook download: Guide to Understanding Inductors; Color sensor systems for material, surface, turbidity and gloss; The proven choice for low and high viscosity industrial mixing; Power or manual rewind hose reels; Airfoil bearings vs magnetic bearings in turbo blowers Volume 18 - Issue 9 - 06\/16\/2023 Flow meters for clean process fluid applications; Hannay N700 spring rewind reel; Chromalox solutions for sustainable decarbonization Volume 18 - Issue 8 - 06\/02\/2023 Thermon offers precision heating and temperature control to meet the needs of the food and beverage industry; Hydrogen gas flow measurement: Rising up to the challenge; Abrasive fluid dispenser — Superior sealing solution for aggressive media Volume 18 - Issue 7 - 05\/05\/2023 eBook download: Design Considerations for Current Sense Transformers; High-resolution temperature process monitoring; MECO EP Type-2 shaft seal; How to leak check a vacuum furnace; Connect the physical and digital worlds through data Volume 18 - Issue 6 - 04\/21\/2023 VoltbusterTM material handling hose for high-static applications; Decarbonizing combustion in steam methane reformers; Selecting the right fans for wind power; Learn about Tempco's custom manufacturing process — cast-in heaters Volume 18 - Issue 5 - 04\/07\/2023 What purpose do chemical heaters in the industrial sector serve?; New space flow for digital processing solutions Volume 18 - Issue 4 - 03\/03\/2023 Automated 3D inspection of geometry, form and surface; The complete bulk bag filler customization guide; Abrasive fluid dispenser — Superior sealing solution for aggressive media Volume 18 - Issue 3 - 02\/17\/2023 The importance of accurately measuring industrial nitrogen oxide emission; The role of flow control in desalination; Augmented Reality is transforming manufacturing Volume 18 - Issue 2 - 02\/03\/2023 Nanoprecise distance and thickness measurements with interferometers; The importance of electric actuation in carbon capture and storage","filter_flag":1}
{"title":"Nanocatalysts Global Strategic Research Report 2023-2024 & 2030 - Expanding Role of Renewable Fuels in the Global Energy Mix Reflects Opportunities - ResearchAndMarkets.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240614665097%2fen%2f&c=6732450236713219404&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240614665097%2fen%2f&c=6732450236713219404&mkt=en-us","summary":"The \"Nanocatalysts - Global Strategic Business Report\" report has been added to ResearchAndMarkets.com's offering. The global market for Nanocatalysts is estimated at US$2.5 Billion in 2023 and is ...","published":"Fri, 14 Jun 2024 04:17:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=14, tm_hour=4, tm_min=17, tm_sec=0, tm_wday=4, tm_yday=166, tm_isdst=0)","news_source":"Business Wire","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Nanocatalysts Global Strategic Research Report 2023-2024 & 2030 - Expanding Role of Renewable Fuels in the Global Energy Mix Reflects Opportunities - ResearchAndMarkets.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The \"Nanocatalysts - Global Strategic Business Report\" report has been added to ResearchAndMarkets.com's offering. The global market for Nanocatalysts is estimated at US$2.5 Billion in 2023 and is ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"DUBLIN--(BUSINESS WIRE)--The \"Nanocatalysts - Global Strategic Business Report\" report has been added to ResearchAndMarkets.com's offering. The global market for Nanocatalysts is estimated at US$2.5 Billion in 2023 and is projected to reach US$4.1 Billion by 2030, growing at a CAGR of 6.4% from 2023 to 2030. This comprehensive report provides an in-depth analysis of market trends, drivers, and forecasts, helping you make informed business decisions. The global nanocatalysts market is on the brink of rapid growth, driven by recent advancements in nano-catalysis and its expanding range of applications. Popular synthesis methods for nanocatalysts include sol-gel processes, hydrothermal synthesis, and chemical vapor deposition, among others. These methods enable the production of nanocatalysts with highly specific properties and functionalities, enhancing their efficiency and effectiveness in various catalytic processes. The latest developments in nano-catalysis highlight its increasing significance in industries such as energy, environmental protection, and chemical manufacturing. Nanocatalysts are being utilized to improve the efficiency of chemical reactions, reduce energy consumption, and minimize environmental impact. For instance, they play a crucial role in the production of clean energy, pollution control, and the synthesis of fine chemicals. Key Insights: Market Growth: Understand the significant growth trajectory of the Refinery & Petrochemicals application segment, which is expected to reach US$1.7 Billion by 2030 with a CAGR of 6.7%. The Environment application segment is also set to grow at 7.5% CAGR over the next 8 years. Regional Analysis: Gain insights into the U.S. market, estimated at $631.9 Million in 2023, and China, forecasted to grow at an impressive 7.4% CAGR to reach $547.3 Million by 2030. Discover growth trends in other key regions, including Japan, Canada, Germany, and the Asia-Pacific. Why You Should Buy This Report: Detailed Market Analysis: Access a thorough analysis of the Global Nanocatalysts Market, covering all major geographic regions and market segments. Competitive Insights: Get an overview of the competitive landscape, including the market presence of major players across different geographies. Future Trends and Drivers: Understand the key trends and drivers shaping the future of the Global Nanocatalysts Market. Actionable Insights: Benefit from actionable insights that can help you identify new revenue opportunities and make strategic business decisions. Key Questions Answered: How is the Global Nanocatalysts Market expected to evolve by 2030? What are the main drivers and restraints affecting the market? Which market segments will grow the most over the forecast period? How will market shares for different regions and segments change by 2030? Who are the leading players in the market, and what are their prospects? Report Features: Comprehensive Market Data: Independent analysis of annual sales and market forecasts in US$ Million from 2023 to 2030. In-Depth Regional Analysis: Detailed insights into key markets, including the U.S., China, Japan, Canada, Europe, Asia-Pacific, Latin America, Middle East, and Africa. Company Profiles: Coverage of major players such as BASF SE, Dow, Inc., Evonik Industries AG, and more. Complimentary Updates: Receive free report updates for one year to keep you informed of the latest market developments. Select Competitors (Total 55 Featured): BASF SE Dow, Inc. Evonik Industries AG Johnson Matthey Plc Kronos Worldwide, Inc. Nexceris PQ Corporation TitanPE Technologies, Inc. Umicore N.V. Venator Materials PLC W. R. Grace & Co. Zeolyst International Key Attributes: Report Attribute Details No. of Pages 232 Forecast Period 2023 - 2030 Estimated Market Value (USD) in 2023 $2.5 Billion Forecasted Market Value (USD) by 2030 $4.1 Billion Compound Annual Growth Rate 7.3% Regions Covered Global MARKET OVERVIEW The Nanotechnology Revolution Has Arrived! Catalysis and Catalysts - An Overview A Prelude to Nanocatalysts Popular Synthesis Methods Latest Development in Nano-Catalysis and its Uses Global Economic Update Competitive Landscape Nanocatalysts - Global Key Competitors Percentage Market Share in 2023 (E) Global Market Prospects and Outlook Global Nanocatalysts Market Poised to Exhibit Rapid Growth Nanocatalysts Market - Regional Assessment Recent Market Activity Competitive Market Presence - Strong\/Active\/Niche\/Trivial for Players Worldwide in 2023 (E) MARKET TRENDS & DRIVERS Environment & Sustainability Take Precedence Post-Pandemic Global Market for Sustainability Technologies (In US$ Billion) Year Market Size (In US$ Billion) Pandemic Induced Accelerated Focus on the Environment & Sustainability to Drive Demand for Low-Cost, Energy Efficient and Eco-Friendly Catalysts Nanocatalysts Find Increasing Demand in Environmental Application Growing Emphasis on Clean Technologies Bodes Well Global Clean Technologies Market Reset & Trajectory - Growth Outlook (In %) For Years 2019 Through 2025 Rise of Nanocatalysts in Refining & Petrochemical Processes to Spur Growth in the Market Here's How Nanocatalysts Help Enhance Petrochemical Reactions Global Demand for Petroleum Products in Million Barrels Per Day (2019, 2020, 2030, 2040) Nanocatalysts Emerge as Eye-Grabbing Option for Hydrotreating in Petroleum Industry Rising Demand for Nanocatalysts in Oil and Gas Sector Sustaining Expansion in Oil & Gas Sector Augurs Well Global Energy Demand & Growth (In Million Tonnes of Oil Equivalent (Mtoe)) for the Years 1990, 2000, 2010, 2020, 2030 and 2040 Impact of Covid-19 on the Oil & Gas Industry Global Average Annual Brent Crude Oil Price (In US$ Per Barrel) for Years 2017 through 2022 Global Oil Production (In Million Barrels Per Day) for Years 2018 through 2022 Expanding Role of Renewable Fuels in the Global Energy Mix Reflects Opportunities for Nanocatalysts Global Energy Mix: 1990 Vs 2020 Biofuel Remains an Indispensable Element of Inclusive Clean Energy & Susceptibility Initiatives Nanocatalysts Potential to Create Biodiesel Increasing Demand for Nanocatalysts in the Chemical Industry Bodes Well for Market Growth Nanocatalysts Underpin Green Movement with Plethora of Chemical Applications The Quest for Lightweight Fuel Efficient Cars to Spur Use of Nanotechnology in Automotive Applications Lightweighting Trend in Auto Parts: Average Weight of a Passenger Car (In Kgs) for the Years 1990, 2000, 2006, 2016 & 2019 Growing Demand for Clean Water and Widening Gap between Safe and Reliable Water Supply Drives the Demand for Nanocatalysts in Water Purification Global Water Consumption by End-Use Sector (in %) Growing Demand for Nanocatalysts in the Food Industry New Approach to Synthesize Gold\/Cobalt Binary Nanocatalysts for Hydrogen Storage New Approach to Synthesize Gold\/Cobalt Binary Nanoparticles For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/bnk1e5 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends.","filter_flag":1}
{"title":"Farmers concerned about ‘forever chemicals’ found in wastewater sludge","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.newstribune.com%2fnews%2f2024%2fjun%2f07%2ffarmers-concerned-about-forever-chemicals-found%2f&c=17558565247860223588&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fwww.newstribune.com%2fnews%2f2024%2fjun%2f07%2ffarmers-concerned-about-forever-chemicals-found%2f&c=17558565247860223588&mkt=en-us","summary":"Maine also assists impacted farmers with PFAS testing and infrastructure updates to help them \"transition to new products and ... the DNR water pollution control branch chief, said DNR doesn ...","published":"Thu, 06 Jun 2024 21:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=6, tm_hour=21, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=158, tm_isdst=0)","news_source":"News Tribune","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Farmers concerned about ‘forever chemicals’ found in wastewater sludge","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Maine also assists impacted farmers with PFAS testing and infrastructure updates to help them \"transition to new products and ... the DNR water pollution control branch chief, said DNR doesn ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"Adam Nordell and his wife, Johanna Davis, were hitting their stride as organic vegetable and grain farmers in Unity, Maine, when they got some ominous news. Their farm was listed on a map of locations where sewage sludge had been spread decades before. The couple soon discovered their land was severely contaminated with PFAS, the so-called \"forever chemicals\" associated with cancer, reproductive effects and decreased fertility. They had bought the land from a man recently diagnosed with terminal pancreatic cancer, which has been linked to the chemicals. \"We're terrified,\" Nordell said. \"We're sitting on top of the site that may have caused the death or pancreatic cancer of the previous farmer.\" Within four months, the couple shut down the farm. Nordell has since become an advocate for ending sewage sludge spreading, and the state has banned the practice. \"This is an incredible, fundamental betrayal of what we were trying to do -- all of us, organic farmers, conventional farmers,\" Nordell said. \"We're all trying to serve our communities to grow good healthy food, and our ability to do that is undermined by a waste management decision.\" Farmers in Maine, Michigan and Texas have discovered high levels of PFAS contamination following the application of sewage sludge on or near their land. According to a report from the Environmental Working Group, an estimated 20 million acres of farmland in the U.S. could be contaminated with PFAS from sewage sludge, yet neither the U.S. Environmental Protection Agency nor the U.S. Department of Agriculture require testing sludge for PFAS or providing compensation for farmers who have been affected. There are currently 73 PFAS-contaminated farms in Maine, as well as more than 500 contaminated wells, said Sarah Woodbury, the programs and policy vice president at Defend Our Health, an environmental public health advocacy organization. In 2022, Maine became the first and only state so far to ban the application of sewage sludge. Absent federal regulation and farmer protections The EPA promotes the \"beneficial reuse\" of sewage sludge, sometimes referred to as biosolids, as a fertilizer and soil conditioner. Sludge contains nitrogen and phosphorus, nutrients needed for plant growth. Farmers can save thousands of dollars in fertilizer costs by using the material, which is often provided for free. In 2022, major wastewater treatment plants in the U.S. generated nearly 4 million dry metric tons of sewage sludge, most of which was applied to land, according to EPA data. The EPA's 503 Rule, which sets minimum standards for sewage sludge treatment, does not address PFAS, although the agency plans to conduct a risk analysis by the end of this year. Jared Hayes, a senior policy analyst at the Environmental Working Group, said the risks associated with PFAS \"should be better communicated to the farmers.\" Hayes said that labels warning of potential PFAS in the products could help farmers make a more informed choice. Courtney Briggs, the senior director of government affairs at the American Farm Bureau Federation, said PFAS contamination is an \"emerging\" and \"alarming\" issue for its members. \"It sets off alarm bells and starts to create anxiety when you have a situation where, unbeknownst to you and through no fault of your own, your land could be contaminated by a forever chemical,\" Briggs said. \"That, of course, is anxiety provoking for a lot of our members.\" Briggs said the Farm Bureau has been working to educate members of Congress and policymakers about the impacts of PFAS contamination in agriculture, and that farmers need protection from liability. \"We don't use the chemical,\" Briggs said. \"We don't interact with the chemical. It just naturally finds its way to farm fields, and PFAS chemicals like to stick to organic matter. So once they hit a soil, a lot of times it'll stay there.\" Briggs said there is no law to protect farmers from liability for PFAS found on their property. \"Farmers should not be held liable for something that they didn't do,\" Briggs said. State and federal agriculture officials declined to comment on the issue. \"These issues are all under the guidance of the Department of Natural Resources. It isn't appropriate for us to comment,\" Christi Miller, the communications director at the Missouri Department of Agriculture, said in an email. \"We would defer you to the EPA to assist with your questions,\" a USDA spokesperson said in an email. Michigan farmer forced to shut down operations Meanwhile, cases of farm contamination continue to grow. Two years ago, the state of Michigan ordered farmer Jason Grostic to shut down his 400-acre cattle farm after testing revealed high levels of PFAS in his farm's soil and beef. Grostic, a Michigan farmer whose family has worked on his property for over a hundred years, had spread biosolids on his land as fertilizer. Grostic said he had not been aware of PFAS at the time and knew that the sludge was \"an EPA-approved product.\" From April to November 2022, the state paid for the feed they required him to continue feeding his cattle, Grostic said. Then the state gave the cows to Michigan State University for research purposes. The university now pays Grostic \"a small wage\" to care for the livestock, he said. He still lives on his property. State employees told him the shutdown of his farm would be temporary, he said. \"Here I am two years later, and I'm still not back to work,\" Grostic said. \"They bought my cows for me to destroy them, and I'm not allowed to have new ones. He said if \"the government's gonna give the permits to put the chemical in the soil, they should be the ones that should be responsible for fixing it.\" Maine supporting impacted farmers The seeds of Maine's crackdown were planted in 2017, when Fred and Laura Stone had to shut down their dairy farm due to extreme levels of PFAS contamination from spreading sludge on their farm decades ago, Woodbury said. Maine has since created a $60 million fund to help PFAS-impacted farmers. Eventually, Maine passed legislation requiring the testing of farms where sludge had been spread. Maine also assists impacted farmers with PFAS testing and infrastructure updates to help them \"transition to new products and production methods.\" However, the state does not help farmers with health monitoring and treatment following their exposure to PFAS. A 2022 report from the National Academies of Sciences, Engineering and Medicine proposes the Centers for Disease Control and Prevention \"advise clinicians to offer PFAS blood testing to patients who are likely to have a history of elevated exposure, such as those with occupational exposures or those who live in areas known to be contaminated.\" Texas farmers sue over sludge In Texas, five farmers are suing Synagro for providing fertilizer they said contaminated their water supply, affected their health, damaged their land and killed their livestock after a neighboring farmer spread it on his land. Dana Ames, an environmental crimes investigator with the Johnson County Constable's Office, collaborated with Public Employees for Environmental Responsibility, or PEER, an environmental group, to test the farmers' water, soil, wildlife and livestock. Results found high levels of PFAS in well water, surface water, soil, fish and a stillborn calf, according to the lawsuit. Ames also obtained a sample of Synagro's fertilizer and had it tested. Many of the PFAS found in the sample were also present on the farms, according to the lawsuit. \"The results we got back are very damning,\" said Ames, who is pursuing a criminal case on the matter. Ames predicted \"a heck of a lot of lawsuits coming\" as more people nationwide test for contaminants from sludge. The lawsuit claims Synagro should have known the risks of the product and failed to warn users. In a fact sheet on its website, Synagro says that biosolids are beneficial, safe and regulated by the EPA. \"Biosolids can be safely applied to soil as a fertilizer and\/or soil conditioner to improve and maintain agricultural and forest lands as well as to restore damaged acreage,\" the statement says. Missouri farmers fear for their land While no Missouri farmers have yet reported the high PFAS contamination levels found in the Maine, Michigan and Texas cases, some are concerned about how their farms could be affected by wastewater sludge spread in their area. In addition to sludge from wastewater treatment plants, another kind of waste is commonly applied to fields as fertilizer -- wastewater sludge from food processing operations such as meat and poultry processors. The practice has caused an uproar in southwest Missouri, where the Missouri Department of Natural Resources fined Denali Water Solutions, a waste disposal company based in Arkansas, for clean water law violations and forced the company to empty its waste lagoons. DNR has proposed issuing permits for three other companies to spread sludge on 9,000 acres of land in southwest Missouri, and other permit applications are pending. Karen McAllister lives on a farm in Jacksonville, a rural community in Randolph County, Missouri. Three years ago, she said the family became \"prisoners\" in their own house due to \"nauseating\" odors from waste Denali spread on a field across from them. McAllister's concerns extend beyond the smell. \"We worry about our soil health and our crops,\" McAllister said. She is also concerned the sludge can leach into the groundwater, \"and we all pull from the same groundwater,\" McAllister said. Lynn Morehead, a farmer in Seneca, a community in southwest Missouri's Newton County, is worried that his water source may be contaminated by sludge his neighbors spread from Denali and Bub's Inc., another wastewater disposal company. Some residents have called for DNR to require testing wastewater sludge for PFAS. Heather Peters, the DNR water pollution control branch chief, said DNR doesn't do this because there is no federal or state standard. \"Until somebody implements a regulation that says, 'This is a problem at this level,' we typically don't have the authority to require sampling,\" Peters said. \"So the short answer is, I haven't seen any sample results from any of these materials yet.\" \"Do we know that there's PFAS pretty much everywhere? Yes,\" she added. \"And I do think if we start sampling, we're gonna find PFAS almost everywhere.\" Courtesy of Defend Our Health Adam Nordell launched into advocacy work after finding PFAS contamination on his farm in Maine. Courtesy of Defend Our Health Sarah Woodbury is the programs and policy vice president at Defend Our Health, an environmental public health advocacy organization. Defend Our Health Maine dairy farmer Fred Stone leads his cow, Lida Rose, at a press conference March 2019, when he spoke about PFAS contamination from sewage sludge he had spread on his land years before. Stone said his land was ruined by the sludge and the farm was eventually shut down. ","filter_flag":1}
{"title":"Top 50 Socially Responsible Companies 2013","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fmacleans.ca%2fcanada-top-50-socially-responsible-corporations-2013%2f&c=3724921621900435006&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d073ddd47bfae539563ff596a2b&url=https%3a%2f%2fmacleans.ca%2fcanada-top-50-socially-responsible-corporations-2013%2f&c=3724921621900435006&mkt=en-us","summary":"96 per cent of all new products include “design-for-environment” principles early in the design phase. Dell Inc. Reduced its packaging while increasing the amount of recycled, recyclable and ...","published":"Thu, 11 May 2023 13:20:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=11, tm_hour=13, tm_min=20, tm_sec=0, tm_wday=3, tm_yday=131, tm_isdst=0)","news_source":"Macleans.ca","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 50 Socially Responsible Companies 2013","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"96 per cent of all new products include “design-for-environment” principles early in the design phase. Dell Inc. Reduced its packaging while increasing the amount of recycled, recyclable and ...","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"query":"https:\/\/www.bing.com\/news\/search?q=\"Pollution Control\" \"new products\"&format=rss","text":"Top 50 Socially Responsible Companies 2013 For the fifth year in a row, Maclean’s has partnered with Sustainalytics, a global leader in sustainability analysis, to select 50 leaders in corporate social responsibility–companies who know that doing good is just good business. Canada’s Top 50 Socially Responsible Companies were selected on the basis of their performance across a broad range of environmental, social, and governance indicators and rank at the top of their industry groups. BEST IN CLASS For these companies, corporate social responsibility is a key part of the way they do business BANKS PERSONAL, COMMERCIAL, CORPORATE, INVESTMENT BANKING, AND CREDIT UNIONS Banks continue to face scrutiny for their lending and investment activities, including those related to environmentally sensitive projects. Some banks have effectively used their market power to back high-impact sustainable projects such as renewable energy. Credit unions and co-operatives are increasingly influential, due not only to their prudent lending practices but also their development of local communities. Bank of Montreal BMO’s board diversity policy ensures that women represent at least a third of the bank’s independent board of directors. Equity and debt financing to the renewable energy sector amounted to $3.6 billion in fiscal 2012, one of the highest among Canadian banks for that year. BMO funds a nationwide financial literacy program that aims to educate 45,000 students on personal finance over three years. The Co-Operators Group Ltd. Active participant in the United Nations Environment Programme Finance Initiative and the first North American signatory to the UN Principles for Sustainable Insurance. Offers sustainable insurance products, including its “EnviroGuard” endorsement and LEED home coverage, which provides either additional coverage or discounts for environmentally responsible home owners. Having reduced greenhouse-gas emissions by 15 per cent since 2007, the group has set an aggressive target of zero net emissions, across its facilities and in its business travel, by 2020. Desjardins Group Desjardins General Insurance offers a 20 per cent “green savings” premium for electric cars, in addition to 10 per cent savings on fuel-efficient cars and 15 per cent on hybrid vehicles. A Canadian leader in micro-financing, supporting 19,600 micro-entrepreneurs, over eight years, in small-business ventures. Helps newcomers to Canada integrate in Quebec’s job market by providing loans for certificates or training for workers previously trained abroad. Royal Bank of Canada As part of its enhanced sourcing policy, RBC has made a public commitment to work with suppliers to address conflict minerals in its supply chain. Underwrote Canada’s first investment-grade solar bond, issued in 2012. The $172-million bond supports two solar farms in Ontario with a combined production capacity of 40 megawatts that will feed into the Ontario power grid. TD Bank Group TD’s new responsible procurement policy states that the company will endeavour to source products and services that protect human rights, ethics, diversity\/inclusion and the environment. Since 2012, “TD Forests” has protected 487 hectares of critical forest habitat across North America as part of its commitment to protect more than two football fields per day of North American forest habitat over the next five years. Vancity (Vancouver City Savings Credit Union) Pioneered responsible investing by launching Canada’s first ethical fund in 1986 and by integrating environmental and social issues into investment strategy. Adopted a “living wage policy” whereby 100 per cent of eligible Vancity employees are paid at least $19.14 per hour (salary and benefits), well above B.C.’s minimum wage of $10.25. Approved $386 million in community-impact loans in 2012—loans to organizations that demonstrate positive social, environmental, or cultural impact—representing around one-third of all approved loans to organizations. ENERGY & UTILITIES OIL & GAS EXPLORATION AND PRODUCTION, POWER GENERATORS Energy and utility companies are major emitters of greenhouse gases and other air pollutants that contribute to climate change, acid rain and smog. As these companies expand their operations to higher-risk and remote areas, health and safety issues, bribery and corruption, and community relations present new and urgent challenges. Recent industry collaborations have allowed companies to share best practices, develop common evaluation methods and accelerate significant change. Cenovus Energy At its Foster Creek and Christina Lake operations, the company maintains one of the lowest and most efficient “steam-to-oil” ratios—the amount of steam required to produce one barrel of oil—thus reducing overall energy use. At its oil-sands operations, fresh water from underground aquifers constitutes less than five per cent of water used. The remainder is salt water that can’t be used for agriculture or drinking. Suncor Energy Inc. A founding member of Canada’s Oil Sands Innovation Alliance, consisting of 14 companies legally bound to share solutions that mitigate the environmental impact of oil-sands production. This collaborative effort focuses on tailings, water, land use and emissions. Partnered with the Walrus Foundation to host a series of conversations on energy use among Canadians. The forums help to foster an ongoing conversation about local, national and international energy use and production. Talisman Energy Inc. Demonstrates strong transparency by reporting annually on its environmental- and safety-performance targets and progress. In 2011, the company surpassed its safety goal, reducing its lost-time injury-frequency rate by 45 per cent. In 2012, the company’s goal was to reduce this rate by a further 15 per cent. Established “shale operating principles” to ensure its hydraulic fracturing activities are conducted in a safe, environmentally responsible manner that is beneficial to local communities. TransAlta Corp. As part of TransAlta’s commitment to reclaim land to a state that is equivalent or better than it was before mining activities, the company has planted 1.5 million trees at its former Centralia Mine. As Canada’s largest wind power operator, TransAlta has decreased its percentage of energy derived from coal by 13 per cent in the past decade, and renewable energy now accounts for nearly 25 per cent of its generating capacity. FOOD & BEVERAGE SOFT DRINKS, PACKAGED FOODS, RESTAURANTS In response to consumer and regulatory pressure, food and beverage companies are focusing on innovation and education to launch healthier and more sustainable foods. As demand increases across new markets, companies must work closely with suppliers to ensure safe working conditions and product quality. Natural resource shortages, climate change and waste management remain critical issues. Danone For one-third of its global managers, Danone has linked year-end bonuses to managers’ progress in reducing the carbon footprint of departments. “Danone.Communities,” a mutual fund, funds small, socially minded businesses in developing countries to foster entrepreneurship and empower local people with a steady source of income. Kellogg Company As part of its Breakfasts for Better Days™ Hunger Relief Initiative, Kellogg has pledged to provide more than half a billion breakfasts globally by the end of 2016. In its 2012 and 2013 human-rights campaign, it was recognized as a “best place to work for LGBT equality.” Molson Coors Brewing Company The first major brewer in Canada to convert its brewing by-products, such as spent yeast and waste beer, into fuel-grade ethanol. Molson aluminum cans are made with a minimum 67 per cent recycled content (up from 42 per cent in 2007) while kegs are refilled more than 200 times over their 25-year lifespan. PepsiCo, Inc In 2012, PepsiCo’s Frito-Lay North America division’s fleet of all-electric trucks surpassed one million miles driven, eliminating the need for approximately 200,000 gallons of diesel fuel. “One Simple Thing” program gives employees the option to add a work-life balance goal, such as flexible working arrangements, to performance appraisals. Starbucks Corporation Since implementing its supplier social responsibility standards in 2006, Starbucks has engaged in more than 500 factory assessments and continues to work with more than 70 factories on improving their social and environmental standards. As part of its 2015 global-responsibility goals, Starbucks aims to volunteer one million community service hours globally. Starbucks has achieved LEED certification for 116 stores in 12 countries, with 69 per cent of company-owned stores built to achieve certification in 2012. Tim Hortons Inc. As part of its green building design, the company requires its Canadian millwork suppliers to use only wood certified by the Forest Stewardship Council in Canadian restaurants. By expanding recycling and waste-diversion programs at its distribution centres, it is currently diverting 80 per cent of its waste from landfill. Aims to have 17,000 economically disadvantaged children participate in Tim Horton Children’s Foundation camps and programs by the end of 2015. INDUSTRIALS INDUSTRIAL CONGLOMERATES, MACHINERY, AEROSPACE, AND DEFENCE Many industrial companies are involved in intensive manufacturing processes where employee health and safety is paramount. Additionally, the use of chemical coatings, heavy metals and volatile organic compounds results in significant greenhouse-gas emissions and hazardous waste generation. Leading companies are integrating sustainable practices into early design decisions and product innovations. 3M Co. Since 1990, 3M has reduced its volatile organic air emissions by 95 per cent through the development of solvent-free technologies, pollution-prevention programs and the use of pollution-control equipment. 3M’s corporate operating committee, comprised of the CEO and his direct reports, is directly responsible for setting, approving and directing the company’s sustainability strategy. Bombardier, Inc. Won an international innovation award for its “TrackSafe Technology,” which increases the safety and productivity of railway track workers. Encourages employees to submit energy-efficiency and emission-reduction project ideas to its Green Fund. The company’s transportation division plans to launch approximately 400 Green Fund projects in an effort to achieve carbon neutrality by 2020. General Electric Company In 2013, introduced its “GE 2.5-120” wind turbine prototype, reportedly the world’s most efficient wind turbine. The turbine uses industrial Internet to manage the variability of wind, providing smooth predictable power. Donated $4 million to the Robin Hood Foundation for hurricane Sandy relief efforts and a further $1.1 million to the American Red Cross Disaster Relief Fund and United Way of America to support related efforts. Philips Electronics One of the few companies to feature its social and environmental performance alongside its financial performance in reports. Worked with more than 300 suppliers in 2012 to investigate the presence of conflict minerals in its products, encouraging their participation in the Electronics Industry Citizenship Coalition’s Conflict Free Smelter program. In 2012, sales from Green Products rose to 45 per cent, up from 39 per cent in 2011—on track to reach the company’s new target of 50 per cent in 2015. MATERIALS GOLD, PRECIOUS AND DIVERSIFIED METALS, MINING, PACKAGING As one of the most carbon-intensive industries, mining and materials companies face considerable exposure to a broad scope of environmental issues, including emissions, waste, biodiversity and land protection. In particular, companies engaged in gold mining have to ensure the safe handling, storing and disposal of cyanide, widely used in the industry to separate gold from the ore. These companies must also address employee and contractor health and safety, and community relations. If poorly managed, these issues can result in significant reputational and financial impacts. Cascades Inc. The expansion of its Lachute tissue paper plant received LEED Gold certification, making it the first plant to obtain LEED-NC certification (New Construction) in the paper industry in Canada. Environmentally friendly products include 100 per cent recycled paper towel and tissue and biodegradable food containers. Through its profit-sharing plan, all employees are eligible to receive quarterly bonuses and an annual bonus based on Cascade’s profits. IAMGOLD Implemented a substantial environmental program to manage its tailings. The program is aligned with the Mining Association of Canada’s Guide to the Management of Tailings Facilities, considered an industry best practice. Using the International Union for Conservation of Nature’s biodiversity mapping and assessment tool to develop a company-wide biodiversity management program. Potash Corp. of Saskatchewan Inc. (PotashCorp) One of the few mining companies to have adopted the “say on pay” approach, which allows shareholders to submit a non-binding vote on executive compensation. Implemented several projects to conserve water and, in 2012, 90 per cent of the fresh water used for operations was recycled. The company exceeded its target to reduce greenhouse-gas emissions per tonne of product produced by 10 per cent between 2007 and 2012, achieving a 13 per cent reduction during that period. Teck As part of its strong consultation mechanisms, business units are required to provide regularly updated community-relations plans and engage specifically with women and other vulnerable community groups. Partnering with international organizations and NGOs to reduce child mortality and illnesses due to zinc deficiency, which contributes to the death of nearly 450,000 children under five years of age each year. RETAILING FOOD SPECIALTY, GENERAL MERCHANDISE, HOME IMPROVEMENT When it comes to employee and contractor rights, retailers continue to attract concern from a variety of stakeholders. Additionally, greenhouse-gas emissions from retail facilities, transportation and logistics and waste management are key environmental challenges. Effective management of these issues directly contributes to a retailer’s reputation, which is of particular importance in a consumer-driven industry. Best Buy Co. Inc. As a member of the Electronics Industry Citizenship Coalition, the company works with industry peers to monitor and assess the human-rights performance of its high-risk suppliers. Engages employees on its sustainability efforts by distributing “sustainability scorecards” to stores, so employees can determine how their sustainability efforts drive business success. The scorecard tracks employees’ impact in community relations, consumer-electronics recycling and retail-energy performance. Loblaw Companies Limited Loblaw brand Scholarship Programme will grant 200 educational scholarships in 2013 to its employees, their family members and Loblaw’s customers. Set a 2013 target to source 100 per cent of its seafood from sustainable sources. Aims to obtain 100 per cent of its pork entirely from Canada. Rona Inc Gives preference to forest product suppliers who develop economic links with indigenous communities and who demonstrate responsible management or protection of areas of traditional importance. Works with the International Life Cycle Chair, a research unit of Polytechnique Montréal, to assess environmental performance over a product’s entire lifetime, from extraction of primary resources to end-of-life management, including manufacturing, packaging and disposal. Canadian Tire Corp. Ltd. Has a six-member social-responsibility board committee in place, accountable for balancing the company’s environmental and social performance with economic growth. Reducing greenhouse-gas emissions from its fleet by replacing trucks with more efficient models, increasing the use of long-combination vehicles and converting from road transportation to rail for certain routes. TECHNOLOGY HARDWARE, SOFTWARE, SOFTWARE SERVICES, SEMICONDUCTORS Given the industry’s rapid consumption cycles and continuous pressure to innovate, technology companies are exposed to significant supply-chain risks, including worker safety and human-rights concerns, along with serious environmental impacts. Leading companies involve their suppliers throughout the value chain to minimize negative impacts over the course of a product’s lifecycle. Accenture plc As a member of the United Nations Global Compact, the company published its fourth progress report in 2013, demonstrating its achievement against goals related to human rights, labour standards, anti-corruption and environmental principles. Surveys all new suppliers on whether they have undertaken environmental assessments and set targets for reducing their environmental impact. Cisco Systems Inc. Worked closely throughout its supply chain to see 100 per cent of its contract manufacturers, 80 per cent of its component suppliers and more than 90 per cent of its global transportation partners report to the Carbon Disclosure Project. Partners with governments and NGOs to set up “community knowledge centres” across sub-Saharan Africa, offering Internet connectivity, technology courses, language skills and online information portals. 96 per cent of all new products include “design-for-environment” principles early in the design phase. Dell Inc. Reduced its packaging while increasing the amount of recycled, recyclable and renewable content. As a result, Dell has eliminated more than 20 million pounds of packaging material since 2008. Conducts regular supplier audits to ensure that human rights, health and safety and other criteria are respected by its suppliers. Replaced all Dell laptop displays with LED illumination, eliminating the use of mercury in all new laptops manufactured. Intel Corp. Tripled its goal to reduce absolute greenhouse-gas emissions by 20 per cent from 2007 to 2012, achieving a 60 per cent reduction. Through its “World Ahead 1Mx15 Health Program,” Intel aims to provide technical training to one million health care workers in developing countries by the end of 2015. International Business Machines Corp. (IBM) Created the “WaterWatchers” app for mobile devices in South Africa to report water leaks, faulty water pipes and conditions of water canals. The data will be used to identify challenges to the country’s water distribution systems. To provide accessible energy data and to encourage greater use of electric vehicles, IBM is partnering with automotive and utility companies to develop robust communication systems between electric vehicles and the power grid. SAP Canada Inc. At the end of 2012, roughly 60 per cent of SAP’s total electricity consumption came from renewable sources, up from 47 per cent in 2011. SAP’s online network and mobile app, Charitable Transformation (ChariTra) connects volunteers with organizations that meet volunteers’ specific time and skill requirements. TELECOM\/ELECTRONICS TELEPHONY SERVICES, ELECTRONIC EQUIPMENT, COMMUNICATION EQUIPMENT, CONSUMER ELECTRONICS Similar to the technology industry, complex supply-chain risks present challenges, particularly the sourcing of conflict minerals. Water use, emissions and waste generation account for much of the industry’s environmental footprint. BCE Inc. BCE’s five-year, $50-million mental health initiative aims to enhance awareness, understanding and treatment of mental illness and promote access to care and research across Canada. BCE’s new Quebec data centre, built according to LEED Gold standards, is ranked among the top two per cent of the most energy-efficient data centres in North America. Nokia Corp. “Nokia Life” is a text-based information service designed for users in emerging markets, offering actionable advice and education on topics such as health care, local markets and agriculture, in an effort to facilitate learning and improve quality of life. Strong waste-reduction goals are in place, ensuring that all new products are free of toxic materials such as bromine and chlorine. Five out of seven Nokia factories have diverted 100 per cent of waste from landfills or are within one per cent of this target. Panasonic Corporation New Econavi home appliances and electronics, introduced in Japan and Asia, feature intelligent sensors that collect data to automatically optimize energy and water consumption based on customers’ usage and lifestyle. Scheduled to launch in 2014, Panasonic is implementing a Japanese urban development concept called Fujisawa Sustainable Smart Town, which will deploy innovative urban services and energy systems based on Panasonic’s Eco Ideas for green lifestyles. Sony Corporation The CSR Forum provides headquarters employees an opportunity to learn about corporate social responsibility through free lectures, film screenings and other activities. Sony Canada conducts independent audits of recyclers and downstream waste-processing firms to ensure that waste is managed with minimal impacts on worker health and safety and the environment. Telus Corp. Telus employees have completed more than 4,500 training courses with environmental and safety themes such as responding to spills and releases, safety reporting and transportation and disposal of waste. Launched TelusHealth.com, an online hub to provide customers with improved access to medical professionals, educational information and personal health data. TEXTILES, FOOTWEAR & APPAREL APPAREL, ACCESSORIES, FOOTWEAR, SPORTSWEAR Recent high-profile controversies surrounding industry working conditions have put labour concerns back in the spotlight. Throughout the supply chain, poor labour conditions threaten basic human rights and present reputational risks to consumer-sensitive companies. Moreover, environmental impacts persist, including high levels of water consumption and waste-water discharge. Increasingly, companies are participating in multi-stakeholder initiatives to address environmental and social risks associated with manufacturing and consumption. Adidas One of 33 global brands to send a “climate declaration” to the U.S. Congress, urging immediate action on climate change. As part of its 2012 London Olympic Games sponsorship, volunteers wore Adidas jackets and shirts made from 100 per cent recycled materials, and athletic shoes containing more than 50 per cent recycled content, for a total of 1.5 million Adidas products containing sustainable materials. Gildan Activewear Gildan requires its suppliers to sign a statement ensuring they do not procure cotton originating from Uzbekistan, where child and forced labour are routinely used. When conducting acquisitions in emerging markets, Gildan performs an extensive due-diligence process that includes an assessment of social and environmental risks. Hennes & Mauritz AB New Conscious Exclusive collection of evening wear features gowns and suits made from 100 per cent recycled polyester and organic cotton. Through its Bangladesh development plan, H&M supports long-term social development by strengthening workers’ influence, increasing skill levels and wages, and creating stability in the labour market. Nike Inc. One of the few manufacturers to have an executive-level committee in place, chaired by the CEO, charged with driving sustainable innovation. Nike’s materials sustainability index assigns scores to materials used in production based on sustainability factors such as the amount of water they require. Efficient materials and vendors stand a better chance of being selected as Nike suppliers. Zara (Industria de Diseño Textil SA) As part of its 2020 “commitment to zero discharge,” Zara will begin publicly disclosing discharges of hazardous chemicals. By the end of 2013, the company aims to have discharge data on 100 Asian suppliers available on a public online platform. Signatory to the CEO Water Mandate, a United Nations initiative to support companies in the development, implementation and disclosure of their water-related strategies and solutions. Gap Inc. Dramatically decreased plastic packaging used to ship products, reducing the company’s overall waste by 57,000 tonnes annually. Many of Gap’s social responsibility specialists grew up in the regions where they work and are able to directly engage with workers and factory owners to assist them in meeting the company’s code of vendor conduct. TRANSPORTATION & LOGISTICS AUTOMOBILES, RAILROADS, SHIPPING As a leading contributor to global emissions, the transportation industry is subject to increasingly stringent emission regulations. Simultaneously, consumers face persistently high fuel costs. These trends are driving some companies to make improvements in vehicle fuel efficiency and pursue innovative design. Social concerns such as employee safety and union relations continue to be highly relevant. BMW BMW’s i3 and i8 electric cars integrate lightweight carbon fibre to reduce weight and overall fuel requirements. Its new Washington state carbon-fibre plant was chosen primarily because of the availability of renewable energy to power production. Holds an annual competition for its suppliers to introduce sustainability solutions. The best idea is awarded with the BMW Group Supplier Innovation Award in the category of sustainability. Canadian National Railway Co. Integrating hybrid and alternative fuel vehicles into its fleet, which are up to 20 per cent more fuel-efficient, producing 40 per cent fewer nitrogen oxides. Provides customers with web-based carbon emissions and carbon credit calculators to estimate the environmental impact of their rail shipments. Ford Motor Company Set a goal to reduce its facility-based CO2 emissions by 30 per cent by 2025 compared to a 2010 baseline. Developed and launched the first inflatable safety belt, designed to dramatically reduce the risk of injuries to rear-seat occupants, especially children. United Parcel Services Inc. Reduced aircraft emissions by lowering flight speeds and implementing computer-optimized flight plans, computer-managed aircraft taxi times and fuel-efficient towing tugs. Offers an externally verified carbon neutral shipping program, allowing customers to purchase offsets at affordable prices. Granted $2.2 million to environmental organizations to support forest protection and the planting of one million trees in 2012 and 2013. Volkswagen","filter_flag":1}
