{"title":"Chapter 13: Department of Engineering","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fwww.scu.edu%2fbulletin%2fgraduate%2fschool-of-engineering%2fchapter-13-department-of-engineering.html&c=12778067266367301968&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fwww.scu.edu%2fbulletin%2fgraduate%2fschool-of-engineering%2fchapter-13-department-of-engineering.html&c=12778067266367301968&mkt=en-us","summary":"civic and professional virtues in guiding sustainable energy practices. The primary purpose of Co-op education is to give students an opportunity to gain practical knowledge in their field of study.","published":"Sat, 02 Jan 2021 16:12:00 GMT","published_parsed":"time.struct_time(tm_year=2021, tm_mon=1, tm_mday=2, tm_hour=16, tm_min=12, tm_sec=0, tm_wday=5, tm_yday=2, tm_isdst=0)","news_source":"Santa Clara University","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chapter 13: Department of Engineering","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"civic and professional virtues in guiding sustainable energy practices. The primary purpose of Co-op education is to give students an opportunity to gain practical knowledge in their field of study.","query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy Practices\" \"new products\"&format=rss","text":"Chapter 13: Department of Engineering In addition to the courses offered by the individual departments, the School of Engineering also offers the following courses which are interdisciplinary in nature. Course Descriptions ENGR 245. Innovation, Entrepreneurship, and the Evolution of Silicon Valley This course will explore technological innovation by studying the evolution of technologies and industries in Silicon Valley. We will review the development of fundamental technologies such as vacuum tubes, semiconductors, and biotechnology, and systems such as radar, communications, aerospace, personal computing, the internet, social media and platforms. This approach will help students to understand 1) the defining features of this region and how it has continued to lead in global technology development even as the fundamental technologies have changed, and 2) the complexity of the innovation process and the influence of the public sector, academia, investors, and other entities on innovation and entrepreneurship. Also listed as ENGR 145. (4 units) ENGR 256. Introduction to NanoBioengineering* This course is designed to present a broad overview of diverse topics in nanobioengineering, with emphasis on areas that directly impact applications in biotechnology and medicine. Specific examples that highlight interactions between nanomaterials and various biomolecules will be discussed, as well as the current status and future possibilities in the development of functional nanohybrids that can sense, assemble, clean, and heal. Also listed as BIOE 256. (2 units) ENGR 257. Introduction to Biofuels Engineering* This course will cover the basic principles used to classify and evaluate biofuels in terms of thermodynamic and economic efficiencies as well as environmental impact for resource recovery. Special emphasis will be placed on emerging applications, namely Microbial Fuel Cell Technology and Photo-bioreactors. Also listed as BIOE 157\/257. Prerequisite: BIOE 21 or BIOL 1B, CHEM 13, PHYS 33. (2 units) ENGR 260. Nanoscale Science and Technology* Overview of key elements of physics, chemistry, biology, and engineering underlying this interdisciplinary field. Bulk vs. surface properties of materials. Surface phenomena and quantum phenomena. Self-assembly and soft lithography. Nanoscale materials characterization. Carbon nanotubes, inorganic nanowires, organic molecules for electronics, biological and bio-inspired materials. Emerging applications of nanoscale materials. Prerequisite: Graduate standing. (2 units) ENGR 261. Nanotechnology and Society Addresses the fundamental scientific and technological underpinnings of the important new field of nanotechnology. Examines how our understanding and our technological capabilities have evolved over the past century, and how nanotechnology proposes new applications that can address social and economic goals. An appreciation of the interaction between these goals and the evolution of the technology is central to the course. Students will develop critical thinking about the prospects for nanotechnology in order to be able to assess the relevant ethical and social issues, and also the possibility and\/or likelihood of the development of specific applications. (4 units) ENGR 262. Nanomaterials* Physics, chemistry, and materials science of materials in the nanoscale. Thin films, inorganic nanowires, carbon nanotubes, and quantum dots are examples covered in detail as well as state-of-the-art synthesis processes and characterization techniques for these materials as used in various stages of technology development. Also listed as ELEN 360. Prerequisites: ENGR 260 and ELEN 261. (2 units) ENGR 271. Energy Conservation It is by no means clear that the shortage of carbon-free energy can be resolved by identifying alternative resources. As a result, conservation must play a key role in the development of new energy policies, both locally and globally. This course explores how conservation and sustainability relate to each other, with special emphasis on the value of cost-effective, innovative water recycling, and strategies for reducing the use of electrical energy. (2 units) ENGR 272. Energy Public Policy The class will survey the types of energy used historically from traditional biomass to coal, to natural gas, to nuclear and renewables, as well as the increasingly diverse possibilities for future use discussed in current policy debates. Coverage will also include a historical review of regulation and policy in the energy industry. The geographic scope will be international. The field of energy analysis and policy is inherently interdisciplinary. Prerequisite: ELEN 280\/MECH 287. (2 units) ENGR 273. Sustainable Energy and Ethics This course explores the ethical implications of energy production, distribution, and consumption, with the aim of understanding those normative considerations that motivate public, institutional and private bodies to develop sustainable energy policies and practices. Through examination of texts and case studies, students will learn to critically analyze, develop and defend ethical judgments and practices with respect to energy. Topics include considerations of environmental justice; tension between global and local spheres of ethical concern; the rights and interests of potential stakeholders, both human and non-human; our duties with respect to prevention or mitigation of harms and management of risk; our ethical obligations to future generations; and the role of personal, civic and professional virtues in guiding sustainable energy practices. (2 units) ENGR 288. Co-op Education The primary purpose of Co-op education is to give students an opportunity to gain practical knowledge in their field of study. This course is designed to prepare them for such an experience, by providing the appropriate academic background that is required for an internship. It consists of a series of lectures on topics that will familiarize them with the Silicon Valley working environment and will enable them to relate their experience in the industry to their academic program. This course is required for all students who wish to enroll in ENGR 289 (Extended Co-op Education). Attendance is mandatory. (1 unit) ENGR 289. Extended Co-op Education Students who wish to do an academic internship must be enrolled in this class. The course may be taken for credit up to three times, and students are required to submit a final report in each quarter in which they are enrolled. The final report should focus on skills, experiences, and insights that they acquired in the current term. In order to get a passing grade, students must also submit a supervisor report, which evaluates their performance during the most recent ten week period. Prerequisite: ENGR 288. (1 unit) ENGR 293. Directed Research Special research directed by a faculty member. By arrangement. Prerequisite: Registration requires the faculty member’s approval. (1–6 units per quarter) ENGR 302. Managing in the Multicultural Environment Provides practical, theoretical, and experiential tools to manage a multicultural workforce. Cases from Silicon Valley engineering environments will be studied. Topics will include: (1) insights into various cultures’ approaches to time, information, planning, decision making, relationships, power, and change; (2) developing leadership, motivation, and participation in multicultural teams; (3) creating an environment that maximizes the benefits of diversity and retains workers from a variety of cultural backgrounds; (4) resolving conflict when there are different cultural approaches; and (5) the role of corporate culture for multicultural and global companies. (2 units) ENGR 303. Gender and Engineering This course, based on brain science, culture, and communication, provides a foundation for managing the different worlds—the various cultural lenses, paradigms, and different competencies—many women and men bring to an engineering workplace. Gender Competence, effective management of differences increases “fire prevention,” customer focus, and innovation in research, development, and marketing of products; and advancement of both women and men. (2 units) ENGR 304. Building Global Teams Challenges of working virtually and globally. Building global teams. Working across cultures and distance; achieving goals while managing differences. Diverse approaches to managing task, time, and hierarchy. Social interactions and decision-making. Culture’s impact on teamwork. Global leader dimensions. Trust building. Empowering self and others. Business practices in China, India, Russia, and other countries. (2 units) ENGR 306. Engineering and the Law Exploration of legal issues affecting project engineers, contractors, and owners. Topics include structure of project teams, contracts, standard of care, insurance, and dispute resolution. Evolving legal issues with Integrated Project Delivery (IPD) and Building Information Modeling (BIM). (2 units) ENGR 330. Law, Technology, and Intellectual Property Study of available legal provisions for establishing, receiving, preserving, and enforcing intellectual property rights in research, development, engineering, and marketing of products. Includes a study of patents, trade secrets, copyrights, mask works, trademarks, and employer-employee contracts regarding intellectual property. (2 units) ENGR 332. How Engineers, Businesspeople and Lawyers Communicate with Each Other It can be challenging to communicate and collaborate effectively with people from different disciplines. This course will help students from business, engineering, and law learn to understand each other’s perspectives, speak each other’s language, and work together effectively in a collaborative environment. Students from different schools will be organized into teams to work together on a simulated project involving a technological matter, such as privacy\/security or IP. Also listed as LAW 371. (3 units) ENGR 334. Energy, Climate Change, and Social Justice The field of climate ethics has emerged recently to negotiate the serious and complex ethical choices facing human society as we balance energy, environmental, and economic development needs. Social science and ethical lenses are used to examine energy use and climate disruption in light of the moral principle of social justice. This course gives graduate engineering students the background and skills to communicate these issues in several different modes. It consists of three main thematic parts: energy choices; social vulnerabilities; and difficult policy dilemmas. (2 units) ENGR 336. Engineering for the Developing World How does one innovate products and services for developing countries? How can complex problems be tackled with simple technologies and low-cost business models? This course presents a framework of engineering design and management techniques that are appropriate for developing markets. Topics such as “ruggedization,” cost control, and local resource use will be explored through a variety of examples and case studies, which range from alternative energy and low-cost diagnostics to mobile applications and micro entrepreneurship. This course examines the potential social benefits that design, manufacturing, and business innovation can provide to address various challenges in the developing world. (2 units) ENGR 338. Mobile Applications for Emerging Markets The mobile revolution is changing the lives of people across the globe, from Wall Street to Main Street to rural villages. This course will provide an overview of the technological innovation, including applications and instrumentation, which the mobile revolution is spawning, particularly in underserved communities globally. It will feature guest speakers from technology companies involved in Mobile R&D, look at market and beneficiary needs, and discuss how to innovate products and services for these customers and how to tackle complex “life” problems with simple technologies, applications, and business models, using real-life case studies. (2 units) ENGR 339. Energy Storage Systems* Energy storage systems play an essential role in the utilization of renewable energy. They are used to provide reserve power under different circumstances and needs such as peak shaving, load leveling, and ancillary services. Power electronics equipment converts the battery power into usable grid power. The course will survey batteries, pumped storage, flywheels, ultracapacitors, etc., with an analysis of the advantages and disadvantages, and uses of each. Also listed as ELEN 287. (2 units) ENGR 340. Distributed & Renewable Energy This course surveys energy engineering and entrepreneurship in emerging market countries, with an emphasis on strategies for coping with the absence of a grid. It analyzes strategies for energy generation, transmission, and storage at household, community and regional scales drawing from sector and case studies in the developing world. (2 units) ENGR 341. Innovation, Design, and Spirituality IDS provides opportunity for the SCU graduate engineering student to begin to integrate knowledge gained in other engineering coursework with innovation management, design thinking and spiritual development, particularly in entrepreneurial and intrapreneurial contexts, whether for commercial and\/or social benefit. The 2-credit course assumes engineers play significant roles in innovating efforts in their future employments and deployments. As a result, IDS aims to deepen the engineering student’s leadership character, competences and capacity, especially for these contexts and deployments. (2 units) ENGR 342. 3D Print Technology and Society This class is designed to introduce students to 3D print technology, which offers a range of exciting possibilities for product design, delivery, and democratization of entrepreneurship. Along with hands-on experience of the technology, students will be exposed to the ecosystem engaged by the technology. Implications for life sciences, career opportunities, entrepreneurship, and restructuring of global markets and society will be examined. (2 units) ENGR 350. Success in Global Emerging Markets Strategies and tactics for moving new products and technologies into global emerging markets, comprehending cultural impact, and creating new markets. Understanding your company’s objective, determining what is possible, and developing practical go-to-market strategies. Topics include new ventures, sustainability, social responsibility, risk assessment and mitigation. (2 units) ENGR 351. New Paradigm for Technology-Global Mindfulness Leadership The main purpose of this course is to examine the role that leadership and strategic vision play in a globalized interconnected business environment. Emphasis will be placed on developing critical thinking and collaborative skills through research projects and case studies. (2 units) ENGR 371. Space Systems Design and Engineering I* A review of the engineering principles, technical subsystems, and design processes that serve as the foundation of developing and operating spacecraft systems. This course focuses on subsystems and analyses relating to orbital mechanics, power, command and data handling, and attitude determination and control. Note: ENGR 371 and 372 may be taken in any order. Also listed as MECH 371. (4 units) ENGR 372. Space Systems Design and Engineering II* A review of the engineering principles, technical subsystems, and design processes that serve as the foundation of developing and operating spacecraft systems. This course focuses on subsystems and analyses relating to mechanical, thermal, software, and sensing elements. Note: ENGR 371 and 372 may be taken in any order. Also listed as MECH 372. (4 units) *Eligible for Technical Stem in Engineering Management","filter_flag":1}
{"title":"Chapter 12: Department of Engineering","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fwww.scu.edu%2fbulletin%2fgraduate%2fschool-of-engineering%2fchapter-12-department-of-engineering.html&c=2977846970725826635&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fwww.scu.edu%2fbulletin%2fgraduate%2fschool-of-engineering%2fchapter-12-department-of-engineering.html&c=2977846970725826635&mkt=en-us","summary":"(2 units) ENGR 350. Success in Global Emerging Markets Strategies and tactics for moving new products and technologies into global emerging markets, comprehending cultural impact, and creating new ...","published":"Fri, 10 Sep 2021 13:42:00 GMT","published_parsed":"time.struct_time(tm_year=2021, tm_mon=9, tm_mday=10, tm_hour=13, tm_min=42, tm_sec=0, tm_wday=4, tm_yday=253, tm_isdst=0)","news_source":"Santa Clara University","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chapter 12: Department of Engineering","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"(2 units) ENGR 350. Success in Global Emerging Markets Strategies and tactics for moving new products and technologies into global emerging markets, comprehending cultural impact, and creating new ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy Practices\" \"new products\"&format=rss","text":"Chapter 12: Department of Engineering The Graduate Core is one of the distinguishing features of the Master’s program at Santa Clara University. Because of its breadth and interdisciplinary nature, the Core requires courses that transcend departmental boundaries, and address questions that relate to the societal impact of engineering, as well as ways in which this impact can be shaped. We offer a wide range of such courses, which are designated with the prefix ENGR (to emphasize the fact that they belong to the category of General Engineering). Course Descriptions ENGR 238 Critical Tools for Social and Environmental Projects This class offers vital tools for completing projects in unfamiliar communities and\/or cultures. Students will learn how to read and understand the human and environmental ecosystem where they and their projects are immersed and incorporate this information into their design process to develop solutions that are socially, economically, and environmentally appropriate. Students will also learn how to implement a quick \"need assessment evaluation\" to uncover the scope, depth, impact and local perception of the need they will solve, while familiarizing themselves with approaches and tools for problem-solving and innovation. Also listed as ENGR 138. Prerequisite: Graduate standing (2 units) ENGR 245 Innovation, Entrepreneurship, and the Evolution of Silicon Valley This course will explore technological innovation by studying the evolution of technologies and industries in Silicon Valley. We will review the development of fundamental technologies such as vacuum tubes, semiconductors, and biotechnology, and systems such as radar, communications, aerospace, personal computing, the internet, social media and platforms. This approach will help students to understand 1) the defining features of this region and how it has continued to lead in global technology development even as the fundamental technologies have changed, and 2) the complexity of the innovation process and the influence of the public sector, academia, investors, and other entities on innovation and entrepreneurship. Also listed as ENGR 145. (4 units) ENGR 256. Introduction to NanoBioengineering This course is designed to present a broad overview of diverse topics in nanobioengineering, with emphasis on areas that directly impact applications in biotechnology and medicine. Specific examples that highlight interactions between nanomaterials and various biomolecules will be discussed, as well as the current status and future possibilities in the development of functional nanohybrids that can sense, assemble, clean, and heal. Also listed as BIOE 256. (2 units) ENGR 257. Introduction to Biofuels Engineering This course will cover the basic principles used to classify and evaluate biofuels in terms of thermodynamic and economic efficiencies as well as environmental impact for resource recovery. Special emphasis will be placed on emerging applications, namely Microbial Fuel Cell Technology and Photo-bioreactors. Also listed as BIOE 157\/257. Prerequisite: BIOE 21 or BIOL 1B, CHEM 13, PHYS 33. (2 units) ENGR 260. Nanoscale Science and Technology Overview of key elements of physics, chemistry, biology, and engineering underlying this interdisciplinary field. Bulk vs. surface properties of materials. Surface phenomena and quantum phenomena. Self-assembly and soft lithography. Nanoscale materials characterization. Carbon nanotubes, inorganic nanowires, organic molecules for electronics, biological and bio-inspired materials. Emerging applications of nanoscale materials. Prerequisite: Graduate standing. (2 units) ENGR 261. Nanotechnology and Society Addresses the fundamental scientific and technological underpinnings of the important new field of nanotechnology. Examines how our understanding and our technological capabilities have evolved over the past century, and how nanotechnology proposes new applications that can address social and economic goals. An appreciation of the interaction between these goals and the evolution of the technology is central to the course. Students will develop critical thinking about the prospects for nanotechnology in order to be able to assess the relevant ethical and social issues, and also the possibility and\/or likelihood of the development of specific applications. (4 units) ENGR 262. Nanomaterials Physics, chemistry, and materials science of materials in the nanoscale. Thin films, inorganic nanowires, carbon nanotubes, and quantum dots are examples covered in detail as well as state-of-the-art synthesis processes and characterization techniques for these materials as used in various stages of technology development. Also listed as ECEN (ELEN) 360. Prerequisites: ENGR 260 and ECEN (ELEN) 261 or ECEN (ELEN) 151. (2 units) ENGR 271. Energy Conservation It is by no means clear that the shortage of carbon-free energy can be resolved by identifying alternative resources. As a result, conservation must play a key role in the development of new energy policies, both locally and globally. This course explores how conservation and sustainability relate to each other, with special emphasis on the value of cost-effective, innovative water recycling, and strategies for reducing the use of electrical energy. (2 units) ENGR 272. Energy Public Policy The class will survey the types of energy used historically from traditional biomass to coal, to natural gas, to nuclear and renewables, as well as the increasingly diverse possibilities for future use discussed in current policy debates. Coverage will also include a historical review of regulation and policy in the energy industry. The geographic scope will be international. The field of energy analysis and policy is inherently interdisciplinary. Prerequisite: ECEN (ELEN) 280\/MECH 287. (2 units) ENGR 273. Sustainable Energy and Ethics This course explores the ethical implications of energy production, distribution, and consumption, with the aim of understanding those normative considerations that motivate public, institutional and private bodies to develop sustainable energy policies and practices. Through examination of texts and case studies, students will learn to critically analyze, develop and defend ethical judgments and practices with respect to energy. Topics include considerations of environmental justice; tension between global and local spheres of ethical concern; the rights and interests of potential stakeholders, both human and non-human; our duties with respect to prevention or mitigation of harms and management of risk; our ethical obligations to future generations; and the role of personal, civic and professional virtues in guiding sustainable energy practices. (2 units) ENGR 288. Co-op Education The primary purpose of Co-op education is to give students an opportunity to gain practical knowledge in their field of study. This course is designed to prepare them for such an experience, by providing the appropriate academic background that is required for an internship. It consists of a series of lectures on topics that will familiarize them with the Silicon Valley working environment and will enable them to relate their experience in the industry to their academic program. This course is required for all students who wish to enroll in ENGR 289 (Extended Co-op Education). Attendance is mandatory. (1 unit) Note: Engr 288 must be taken before you can start an internship and is not offered in the Summer quarter. ENGR 289. MS Extended Co-op Education Students who wish to do an academic internship must be enrolled in this class. The course may be taken for credit up to three times, and students are required to submit a final report in each quarter in which they are enrolled. The final report should focus on skills, experiences, and insights that they acquired in the current term. In order to get a passing grade, students must also submit a supervisor report, which evaluates their performance during the most recent ten-week period. Prerequisite: ENGR 288. (1 unit) ENGR 293. Directed Research Special research directed by a faculty member. By arrangement. Prerequisite: Registration requires the faculty member’s approval. (1–6 units per quarter) ENGR 302. Managing in the Multicultural Environment Provides practical, theoretical, and experiential tools to manage a multicultural workforce. Cases from Silicon Valley engineering environments will be studied. Topics will include: (1) insights into various cultures’ approaches to time, information, planning, decision making, relationships, power, and change; (2) developing leadership, motivation, and participation in multicultural teams; (3) creating an environment that maximizes the benefits of diversity and retains workers from a variety of cultural backgrounds; (4) resolving conflict when there are different cultural approaches; and (5) the role of corporate culture for multicultural and global companies. (2 units) ENGR 303. Gender and Engineering This course, based on brain science, culture, and communication, provides a foundation for managing the different worlds—the various cultural lenses, paradigms, and different competencies—many women and men bring to an engineering workplace. Gender Competence, effective management of differences increases “fire prevention,” customer focus, and innovation in research, development, and marketing of products; and advancement of both women and men. (2 units) ENGR 304. Building Global Teams Challenges of working virtually and globally. Building global teams. Working across cultures and distance; achieving goals while managing differences. Diverse approaches to managing task, time, and hierarchy. Social interactions and decision-making. Culture’s impact on teamwork. Global leader dimensions. Trust building. Empowering self and others. Business practices in China, India, Russia, and other countries. (2 units) ENGR 306. Engineering and the Law Exploration of legal issues affecting project engineers, contractors, and owners. Topics include structure of project teams, contracts, standard of care, insurance, and dispute resolution. Evolving legal issues with Integrated Project Delivery (IPD) and Building Information Modeling (BIM). (2 units) ENGR 330. Law, Technology, and Intellectual Property Study of available legal provisions for establishing, receiving, preserving, and enforcing intellectual property rights in research, development, engineering, and marketing of products. Includes a study of patents, trade secrets, copyrights, mask works, trademarks, and employer-employee contracts regarding intellectual property. (2 units) ENGR 332. How Engineers, Businesspeople and Lawyers Communicate with Each Other It can be challenging to communicate and collaborate effectively with people from different disciplines. This course will help students from business, engineering, and law learn to understand each other’s perspectives, speak each other’s language, and work together effectively in a collaborative environment. Students from different schools will be organized into teams to work together on a simulated project involving a technological matter, such as privacy\/security or IP. Also listed as LAW 371. (3 units) ENGR 334. Energy, Climate Change, and Social Justice The field of climate ethics has emerged recently to negotiate the serious and complex ethical choices facing human society as we balance energy, environmental, and economic development needs. Social science and ethical lenses are used to examine energy use and climate disruption in light of the moral principle of social justice. This course gives graduate engineering students the background and skills to communicate these issues in several different modes. It consists of three main thematic parts: energy choices; social vulnerabilities; and difficult policy dilemmas. (2 units) ENGR 336. Engineering for the Developing World How does one innovate products and services for developing countries? How can complex problems be tackled with simple technologies and low-cost business models? This course presents a framework of engineering design and management techniques that are appropriate for developing markets. Topics such as “ruggedization,” cost control, and local resource use will be explored through a variety of examples and case studies, which range from alternative energy and low-cost diagnostics to mobile applications and micro entrepreneurship. This course examines the potential social benefits that design, manufacturing, and business innovation can provide to address various challenges in the developing world. (2 units) ENGR 337 Innovating with Impact - Social Entrepreneurship Social Entrepreneurship is a rapidly growing discipline that harnesses the power of leadership, entrepreneurship, business, and social impact to address society's most pressing social challenges. This course is designed for students who want to explore and analyze social enterprises and gain in-depth insights into economic and social value creation across several different sectors including poverty alleviation, financial services, energy, and sustainability. In this class, students will also compare various social ventures and their approaches and learn to analyze and evaluate their impact, and formulate possible improvements to their models. Through case studies, lectures, classroom dialogue, and individual assignments, students will learn the root causes of social problems, and how to use the tools of business to create financial, social, and environmental value. (2 units) ENGR 338. Mobile Applications for Emerging Markets The mobile revolution is changing the lives of people across the globe, from Wall Street to Main Street to rural villages. This course will provide an overview of the technological innovation, including applications and instrumentation, which the mobile revolution is spawning, particularly in underserved communities globally. It will feature guest speakers from technology companies involved in Mobile R\\&D, look at market and beneficiary needs, and discuss how to innovate products and services for these customers and how to tackle complex “life” problems with simple technologies, applications, and business models, using real-life case studies. (2 units) ENGR 339. Energy Storage Systems Energy storage systems play an essential role in the utilization of renewable energy. They are used to provide reserve power under different circumstances and needs such as peak shaving, load leveling, and ancillary services. Power electronics equipment converts the battery power into usable grid power. The course will survey batteries, pumped storage, flywheels, ultracapacitors, etc., with an analysis of the advantages and disadvantages, and uses of each. Also listed as ECEN (ELEN) 287. (2 units) ENGR 340. Distributed & Renewable Energy This course surveys energy engineering and entrepreneurship in emerging market countries, with an emphasis on strategies for coping with the absence of a grid. It analyzes strategies for energy generation, transmission, and storage at household, community and regional scales drawing from sector and case studies in the developing world. (2 units) ENGR 341. Innovation, Design, and Spirituality IDS provides opportunity for the SCU graduate engineering student to begin to integrate knowledge gained in other engineering coursework with innovation management, design thinking and spiritual development, particularly in entrepreneurial and intrapreneurial contexts, whether for commercial and\/or social benefit. The 2-credit course assumes engineers play significant roles in innovation efforts in their future employments and deployments. As a result, IDS aims to deepen the engineering student’s leadership character, competences and capacity, especially for these contexts and deployments. (2 units) ENGR 342. 3D Print Technology and Society This class is designed to introduce students to 3D print technology, which offers a range of exciting possibilities for product design, delivery, and democratization of entrepreneurship. Along with hands-on experience of the technology, students will be exposed to the ecosystem engaged by the technology. Implications for life sciences, career opportunities, entrepreneurship, and restructuring of global markets and society will be examined. (2 units) ENGR 350. Success in Global Emerging Markets Strategies and tactics for moving new products and technologies into global emerging markets, comprehending cultural impact, and creating new markets. Understanding your company’s objective, determining what is possible, and developing practical go-to-market strategies. Topics include new ventures, sustainability, social responsibility, risk assessment and mitigation. (2 units) ENGR 351. New Paradigm for Technology-Global Mindfulness Leadership The main purpose of this course is to examine the role that leadership and strategic vision play in a globalized interconnected business environment. Emphasis will be placed on developing critical thinking and collaborative skills through research projects and case studies. (2 units) ENGR 371. Space Systems Design and Engineering I A review of the engineering principles, technical subsystems, and design processes that serve as the foundation of developing and operating spacecraft systems. This course focuses on subsystems and analyses relating to orbital mechanics, power, command and data handling, and attitude determination and control. Note: ENGR 371 and 372 may be taken in any order. Also listed as MECH 371. (4 units) ENGR 372. Space Systems Design and Engineering II A review of the engineering principles, technical subsystems, and design processes that serve as the foundation of developing and operating spacecraft systems. This course focuses on subsystems and analyses relating to mechanical, thermal, software, and sensing elements. Note: ENGR 371 and 372 may be taken in any order. Also listed as MECH 372. (4 units) ENGR 389. Ph.D. Extended Co-op Education Ph.D. students who have passed their comprehensive examination and have the approval of their thesis advisor may enroll in this class. The course may be taken for credit up to three times, and students are required to submit a final report in each quarter in which they are enrolled. The final report should focus on skills, experiences, and insights that they acquired in the current term. In order to get a passing grade, students must also submit a new supervisor report, which evaluates their performance during the most recent ten-week period. P\/NP grading. Prerequisite: ENGR 288 and Ph.D. Student status. (1 unit)","filter_flag":1}
{"title":"Europe Battery Binders Industry Research 2024-2031: Focus on Water Based Battery Binders, Competitive Pricing Pressures, Growing Awareness of Bio Alternatives, Startup ...","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240524984559%2fen%2fEurope-Battery-Binders-Industry-Research-2024-2031-Focus-on-Water-Based-Battery-Binders-Competitive-Pricing-Pressures-Growing-Awareness-of-Bio-Alternatives-Startup-Landscape---ResearchAndMarkets.com%2f&c=6490711557753583752&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240524984559%2fen%2fEurope-Battery-Binders-Industry-Research-2024-2031-Focus-on-Water-Based-Battery-Binders-Competitive-Pricing-Pressures-Growing-Awareness-of-Bio-Alternatives-Startup-Landscape---ResearchAndMarkets.com%2f&c=6490711557753583752&mkt=en-us","summary":"With an increasing uptake of EVs and a concerted effort towards sustainable energy practices, the market for battery binders is anticipated to witness robust expansion across Europe. Binders serve ...","published":"Fri, 24 May 2024 04:42:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=5, tm_mday=24, tm_hour=4, tm_min=42, tm_sec=0, tm_wday=4, tm_yday=145, tm_isdst=0)","news_source":"Business Wire","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Europe Battery Binders Industry Research 2024-2031: Focus on Water Based Battery Binders, Competitive Pricing Pressures, Growing Awareness of Bio Alternatives, Startup ...","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"With an increasing uptake of EVs and a concerted effort towards sustainable energy practices, the market for battery binders is anticipated to witness robust expansion across Europe. Binders serve ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy Practices\" \"new products\"&format=rss","text":"DUBLIN--(BUSINESS WIRE)--The \"Europe Binders in Battery Market: Analysis and Forecast, 2022-2031\" report has been added to ResearchAndMarkets.com's offering. The Europe binders in battery market (excluding U.K.) is projected to reach $1,039.2 million by 2031 from $365.1 million in 2022, growing at a CAGR of 12.33% during the forecast period 2022-2031 The growth of the binder market in batteries is expected to be driven by the increasing adoption of electric vehicles and greater investments in battery installations within the renewable energy sector. Although these factors provide positive momentum, obstacles to market growth include difficulties related to the advancement of electrodes without binders and the continual demand for maintaining high-quality standards. Market Introduction The Europe Binders in Battery Market is positioned for significant growth, buoyed by the escalating demand for electric vehicles (EVs) and substantial investments in renewable energy storage infrastructure. With an increasing uptake of EVs and a concerted effort towards sustainable energy practices, the market for battery binders is anticipated to witness robust expansion across Europe. Binders serve as crucial components in enhancing battery performance and longevity, thus playing a pivotal role in the evolving landscape of electric transportation and renewable energy initiatives. However, challenges such as the development of binder-free electrodes and the persistent need for maintaining stringent quality standards may present hurdles to market growth. As Europe continues to lead in the adoption of environmentally friendly technologies, the Binders in Battery Market is poised for noteworthy progress to cater to the rising demand for energy storage solutions. How can this report add value to an organization? Product\/Innovation Strategy: The product segment helps the reader to understand the different types of binders available for batteries and their potential. Moreover, the study provides the reader with a detailed understanding of the different binder chemistry, namely, polyvinylidene fluoride, styrene-butadiene rubber, carboxymethyl cellulose, polytetrafluoroethylene, and others. Growth\/Marketing Strategy: Business expansion, partnership, collaboration, and joint venture are some key strategies adopted by key players operating in the space. Competitive Strategy: Key players in the Europe binders in battery market analyzed and profiled in the study involve binder providers. Moreover, a detailed competitive benchmarking of the players operating in the Europe binders in battery market has been done to help the reader understand how players stack against each other, presenting a clear market landscape. Additionally, comprehensive competitive strategies such as partnerships, agreements, and collaborations will aid the reader in understanding the untapped revenue pockets in the market. Some of the prominent names established in this market are: Arkema BASF SE Solvay Synthomer PLC Northvolt AB Key Topics Covered: Executive Summary Scope of the Study 1 Markets 1.1 Industry Outlook 1.1.1 Trends: Current and Future 1.1.1.1 Focus on Water Based Battery Binders 1.1.1.2 Increasing Customer Awareness regarding Electric Vehicles 1.1.2 Supply Chain Network\/MAP 1.1.3 Value Chain Analysis 1.1.4 Impact of COVID-19 on the Binders in Battery Market 1.1.5 Ecosystem\/Ongoing Programs 1.1.5.1 Consortiums and Associations 1.1.5.2 Regulatory Bodies 1.2 Business Dynamics 1.2.1 Business Drivers 1.2.1.1 Increasing Demand for Electric Vehicles 1.2.1.2 Growing Investments and Installations in Renewable Energy Sector 1.2.1.3 Improved Battery Performance due to Advance Multifunctional Binders 1.2.2 Business Challenges 1.2.2.1 Highly Competitive Market Creating Constant Pressure to Maintain High Performance and Quality of Binders at Competitive Price 1.2.2.2 Development of Binder Free Electrode Technologies for Advance Batteries 1.2.3 Business Opportunities 1.2.3.1 Integration of Internet of Things (IoT) and Artificial Intelligence (AI) Technologies in Consumer Electronics 1.2.3.2 Increasing Awareness about Bio-Based Products 1.2.4 Business Strategies 1.2.4.1 Product Development 1.2.4.2 Market Development 1.2.5 Corporate Strategies 1.2.5.1 Partnerships, Collaborations, and Joint Ventures 1.3 Snapshots of Battery Manufacturing Equipment's Market 1.4 Start-Up Landscape 2 Region 2.1 Europe 2.1.1 Market 2.1.1.1 Key Manufacturers\/Suppliers in Europe 2.1.1.2 Business Challenges 2.1.1.3 Business Drivers 2.1.2 Application 2.1.3 Product 2.1.4 Europe: Country-Level Analysis 2.1.4.1 Germany 2.1.4.1.1 Market 2.1.4.1.1.1 Buyer Attributes 2.1.4.1.1.2 Key Manufacturers\/Suppliers in Germany 2.1.4.1.1.3 Business Challenges 2.1.4.1.1.4 Business Drivers 2.1.4.1.2 Application 2.1.4.1.3 Product 2.1.4.2 France 2.1.4.3 Italy 2.1.4.4 Spain 2.1.4.5 Rest-of-Europe 2.2 U.K. 3 Markets - Competitive Benchmarking & Company Profiles 3.1 Competitive Benchmarking 3.1.1 Competitive Position Matrix 3.1.2 Product Matrix for Key Companies 3.1.3 Market Share Analysis 3.2 Company Profiles 3.2. Company Overview 3.2.1.1 Role in the Binders in Battery Market 3.2.1.2 Product Portfolio 3.2.1.3 Business Strategies 3.2.1.3.1 Market Development 3.2.1.4 Corporate Strategies 3.2.1.4.1 Partnerships, Collaborations, and Joint Ventures 3.2.1.5 R&D Analysis 3.2.1.6 Analyst view For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/iab1gz About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends.","filter_flag":1}
{"title":"India Microgrid (CHP, Natural Gas, Solar PV, Diesel, Fuel Cell, Remote, Grid Connected, Hybrid) Market Size, Share & Trends Analysis Report 2024-2030","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fuk.finance.yahoo.com%2fnews%2findia-microgrid-chp-natural-gas-150600224.html&c=6973767169975267151&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d18ec76414ba00dafb7a75d75cf&url=https%3a%2f%2fuk.finance.yahoo.com%2fnews%2findia-microgrid-chp-natural-gas-150600224.html&c=6973767169975267151&mkt=en-us","summary":"India's focus on renewable energy development, including microgrids, aligns with global trends towards sustainable energy practices and underscores the country's efforts to address energy challenges ...","published":"Tue, 25 Jun 2024 04:06:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=4, tm_min=6, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"Yahoo Finance","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"India Microgrid (CHP, Natural Gas, Solar PV, Diesel, Fuel Cell, Remote, Grid Connected, Hybrid) Market Size, Share & Trends Analysis Report 2024-2030","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"India's focus on renewable energy development, including microgrids, aligns with global trends towards sustainable energy practices and underscores the country's efforts to address energy challenges ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Sustainable Energy Practices\" \"new products\"&format=rss","text":"Company Logo Indian Microgrid Market Indian Microgrid Market Dublin, June 25, 2024 (GLOBE NEWSWIRE) -- The \"India Microgrid Market Size, Share & Trends Analysis Report by Power Source (CHP, Natural Gas, Solar PV, Diesel, Fuel Cell) By Connection Type (Remote, Grid Connected, Hybrid), End-use, and Segment Forecasts, 2024-2030\" report has been added to ResearchAndMarkets.com's offering. The India microgrid market size is anticipated to reach USD 8.01 billion by 2030 and is anticipated to grow at a CAGR of 19.4% from 2024 to 2030 One of the key factors propelling the market expansion includes the increasing demand for reliable and uninterrupted power supply, especially in remote and rural areas where grid connectivity is limited or unreliable. ADVERTISEMENT Furthermore, government initiatives and policies promoting renewable energy sources and enhancing energy security significantly drive market growth. For instance, The Ministry of New and Renewable Energy in India aims to achieve 500 GW of installed electricity capacity from non-fossil sources by 2030, highlighting the significance of integrating and managing renewable energy through microgrids. This ambitious goal underscores India's commitment to transitioning towards cleaner energy sources and reducing dependence on fossil fuels. India's focus on renewable energy development, including microgrids, aligns with global trends towards sustainable energy practices and underscores the country's efforts to address energy challenges while promoting environmental sustainability. In addition, the Indian government has introduced policies supporting clean energy and grid modernization, particularly in rural areas, to boost the adoption of microgrid solutions. These policies create a favorable environment for deploying microgrids in the energy infrastructure. Moreover, technological advancements in smart grid technologies, IoT integration, and digitalization are accelerating the adoption of microgrids in India. These innovations enable efficient monitoring, control, and optimization of microgrid operations, improving performance and cost-effectiveness. Integrating advanced communication and control systems enhances grid resilience and flexibility, making microgrids an attractive option for utilities and end-users. Furthermore, increasing focus on energy independence and resilience against grid disruptions drives the interest in microgrid solutions among commercial and industrial sectors in India. Story continues Businesses recognize the benefits of having a reliable backup power source to ensure uninterrupted operations during grid outages or emergencies. Microgrids offer a viable alternative to traditional backup generators by providing cleaner energy options and enabling better management of energy resources. These driving factors collectively contribute to market expansion, offering sustainable energy solutions that cater to diverse energy needs across the country. India Microgrid Market Report Highlights The CHP segment dominated the market and accounted for a share of over 43% in 2023 owing to the shift from conventional Separate Heat and Power (SHP) setups to utilizing a single fuel source for energy generation, underscoring the efficiency and cost-effectiveness of CHP systems in powering microgrids Based on the connection type, the grid-connected segment led the market with a share of around 65% in 2023 as they utilize multiple generators, distribution networks, and advanced controls, enhancing grid resiliency, electricity quality, and reducing carbon footprint. These systems provide various benefits, leading to increased demand and market dominance The education end-use segment dominated the market in 2023 owing to the increased government spending on education infrastructure and extensive power supply requirements in this sector In December 2021, NTPC Ltd., India's largest power-generating company, announced its first green hydrogen microgrid project for its Simhadri plant in Andhra Pradesh, India. This project is a significant step towards India's commitment to achieving its climate goals and underscores NTPC's dedication to sustainable energy solutions Company Profiles Eaton Corporation Plc Exelon Corporation General Electric Company Gram Power India Pvt Ltd Greenpeace Foundation Hitachi Ltd Regain Paradise Schneider Electric SE Siemens India Private Limited Toshiba India Pvt Ltd Key Attributes: Report Attribute Details No. of Pages 70 Forecast Period 2023 - 2030 Estimated Market Value (USD) in 2023 $2.38 Billion Forecasted Market Value (USD) by 2030 $8.01 Billion Compound Annual Growth Rate 19.4% Regions Covered India Key Topics Covered: Chapter 1. Methodology and Scope Chapter 2. Executive Summary 2.1. Market Outlook 2.2. Segment Outlook 2.3. Competitive Insights Chapter 3. India Microgrid Market Variables, Trends & Scope 3.1. Market Lineage Outlook 3.1.1. Parent Market Outlook 3.1.2. Related\/ancillary Market Outlook 3.2. Market Dynamics 3.2.1. Market Driver Analysis 3.2.2. Market Restraint Analysis 3.3. India Microgrid Market Analysis Tools 3.3.1. Industry Analysis - Porter's 3.3.2. PESTEL Analysis Chapter 4. India Microgrid Market: Power Source Estimates & Trend Analysis 4.1. Power Source Market Share, 2023 & 2030 4.2. Segment Dashboard 4.3. India Microgrid Market by Power Source Outlook 4.4. Market Size & Forecasts and Trend Analyses, 2018 to 2030 for the Following 4.4.1. CHP 4.4.1.1. Market Estimates and Forecasts 2018 to 2030 (USD Million) (MW) 4.4.2. Natural Gas 4.4.3. Solar PV 4.4.4. Diesel 4.4.5. Fuel Cell Chapter 5. India Microgrid Market: Connection Type Estimates & Trend Analysis 5.1. Connection Type Market Share, 2023 & 2030 5.2. Segment Dashboard 5.3. India Microgrid Market by Connection Type Outlook 5.4. Market Size & Forecasts and Trend Analyses, 2018 to 2030 5.4.1. Remote 5.4.1.1. Market Estimates and Forecasts 2018 to 2030 (USD Million) (MW) 5.4.2. Grid Connected 5.4.3. Hybrid Chapter 6. India Microgrid Market: End-use Estimates & Trend Analysis 6.1. End-use Market Share, 2023 & 2030 6.2. Segment Dashboard 6.3. India Microgrid Market by End-use Outlook 6.4. Market Size & Forecasts and Trend Analyses, 2018 to 2030 6.4.1. Government 6.4.1.1. Market Estimates and Forecasts 2018 to 2030 (USD Million) (MW) 6.4.2. Education 6.4.3. Commercial 6.4.4. Utility 6.4.5. Defense Chapter 7. Competitive Landscape 7.1. Recent Developments & Impact Analysis, by Key Market Participants 7.2. Company\/Competition Categorization 7.3. Vendor Landscape 7.3.1. List of Key Distributors and Channel Partners 7.3.2. Key Customers 7.3.3. Key Company Heat Map Analysis, 2023 For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/c9zuyi About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment CONTACT: CONTACT: ResearchAndMarkets.com Laura Wood,Senior Press Manager press@researchandmarkets.com For E.S.T Office Hours Call 1-917-300-0470 For U.S.\/ CAN Toll Free Call 1-800-526-8630 For GMT Office Hours Call +353-1-416-8900 ","filter_flag":1}
