{"title":"Enhancing waste resource efficiency: circular economy for sustainability and energy conversion - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5\" target=\"_blank\">Enhancing waste resource efficiency: circular economy for sustainability and energy conversion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Enhancing waste resource efficiency: circular economy for sustainability and energy conversion - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTMwMzc5MtIBAA?oc=5\" target=\"_blank\">Enhancing waste resource efficiency: circular economy for sustainability and energy conversion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"This study explores optimizing waste resource efficiency through the Circular Economy (CE) framework. Motivated by the imperative to enhance resource efficiency and mitigate waste’s environmental impact, we examine the CE concept’s extension of product life cycles, while minimizing waste. We conduct a comprehensive review to explore the core CE principles across all stages of the product lifecycle and provide an in-depth analysis of waste treatment practices in Poland, emphasizing potential energy conversion methods like biogas production and incineration. Our findings underscore the importance of prioritizing waste incineration plant design for quicker payback, aligning with circular rational economic practices. Strategies such as improving biogas production, establishing solid bio-waste fermentation facilities, promoting sortable packaging, and incentivizing sustainable sorting emerge to optimize waste management. These findings highlight the pivotal role of economic, environmental, and energy considerations in shaping sustainable waste management strategies. Introduction The concept of a circular economy (CE) has gained remarkable traction in recent years, presenting a compelling vision of our Earth as a closed-system spaceship where resources efficiently circulate. Within this grand metaphor, our global society, encompassing economic, environmental, social, and cultural facets, plays a pivotal role in maintaining equilibrium. One of the core tenets of CE, as advocated by the EU CE Strategy (EU COM\/2015\/0614), underscores the significance of waste management in achieving optimal environmental outcomes and reintroducing valuable materials into the economy to maintain sustainability. This article meticulously explores the waste management component within this celestial circular system. Despite the prolific discussions surrounding CE, a universally accepted definition remains elusive, with over 200 variations scattered throughout scientific literature (Adamczak, 2022). CE, an evolutionary concept rooted in traditional waste management, holds relevance in both municipal and industrial domains. While scholarly discourse revolves around solid and liquid waste management, focusing on processing technologies, selective collection, and disposal methods, broader CE discussions, including the ambitious goal of achieving zero waste, often originate from the influential work of the Ellen MacArthur Foundation. Curiously, amid these discussions, a significant research gap exists—the role of urban energy self-sufficiency within the CE framework. This research void has recently gained prominence, partly due to geopolitical events such as the Russia-Ukraine conflict, which cast a spotlight on concerns surrounding energy supply (Gabon et al., 2023; Apostu et al., 2023). Moreover, rapid economic and population growth over the past half-century has led to the excessive consumption of global resources, surpassing the Earth’s regenerative capacity (Popescu et al., 2022). Urbanization and population expansion have significantly escalated global material consumption, straining both individual and planetary resources. Remarkably, a mere 1% reduction in material and energy consumption across all sectors could generate an economy-boosting value of PLN 19.5 billion, underscoring the urgency of sustainable resource management (Deloitte, 2018). The extraction of raw materials, which has tripled from 1970 to 2017, now stands at a staggering 60 billion tons annually, equivalent to 22 kg per person daily (Fiksel, 2006). In the European Union alone, 2.2 billion tonnes of waste are generated annually, with municipal waste accounting for 27% of this total (Haglung, 2011). Alarmingly, resource extraction is responsible for 50% of human-generated carbon emissions and 90% of biodiversity impacts, with projections indicating a doubling of these impacts by 2060, according to the UN International Resource Panel (UN IRP) (Kamiński, 2020). The central question arises: How can more reusable or recyclable fractions be extracted from this challenging mixed waste? Traditional solutions like increasing public education, while viable, may require substantial time for meaningful impact. Additionally, legal and financial restrictions may expedite educational efforts but could lead to social resistance and electoral consequences. These observations underscore the importance of redefining waste within the CE concept, emphasizing its potential as a valuable raw material (D’Admo et al., 2022; Luttenberger, 2020; Khan et al., 2023). This article endeavors to bridge the gaps in waste management strategies within the broader context of the CE, with a specific focus on the potential for achieving energy self-sufficiency in cities. We assert that pursuing 100% recycling and reuse of all waste fractions is economically unwarranted. Instead, specific waste fractions, when transformed into biogas or incinerated for heat and electricity production, represent more effective waste management practices. Furthermore, the carbon dioxide emissions generated by combustion can be mitigated through urban transformation into green cities, where increased vegetation assists in absorbing carbon dioxide from the air. To address these issues, we provide a comprehensive review focusing on the core principles of the CE and elucidating strategies for managing specific waste fractions. Our theoretical review provides a holistic perspective on the CE’s evolving discourse. Within this review, we delve into the multifaceted dimensions of the CE, dissecting its theoretical foundations, including principles of waste reduction, resource reuse, and the extraction of value from waste materials. This theoretical contribution enables a deeper understanding of the CE’s conceptual framework, offering valuable insights for researchers and policymakers engaged in sustainable waste management within this dynamic paradigm. To illustrate the multifaceted dynamics of waste management within the context of CE principles, we present the Orli Staw installation plan, a municipal waste treatment facility in Poland serving 23 municipalities with 350,000 residents. This case exemplifies the innovative potential of the CE by harnessing kitchen and garden biowaste to produce biogas, thereby reducing waste, promoting resource reuse, and achieving local energy self-sufficiency. By focusing on bio-waste and employing a fermentation module for biogas generation, the plant redefines waste as a valuable resource. This groundbreaking approach not only aligns with CE principles but also addresses critical challenges related to resource scarcity and environmental sustainability. The Orli Staw plant’s transformation of waste into a valuable energy source offers a pioneering model for sustainable waste management, making it a significant case study with implications for circular economies worldwide. The primary contribution of this article is the synthesis of insights into the role of waste management in achieving energy self-sufficiency within the CE framework. By highlighting waste management’s vital role in urban energy self-sufficiency, we emphasize the importance of a balanced approach to waste management and resource utilization. This synthesis provides practical insights into the integration of waste management strategies into the broader context of sustainable urban development, offering a nuanced perspective on this critical aspect of CE implementation. In summary, our fundamental conclusion underscores the imperative for waste management to waste perceive as a dual asset: firstly, as a valuable raw material that can be reintegrated into the economy, and secondly, as a potent energy resource capable of enhancing the energy portfolio of cities. This dual perspective on waste not only aligns with the principles of CE but also offers a pragmatic solution to address contemporary challenges related to resource utilization and urban energy self-sufficiency. The remainder of this paper unfolds as follows: In Section 2, we embark on a theoretical exploration, offering a comprehensive review of waste management within the context of the CE framework. Section 3 takes a deep dive into the practical realm, focusing on the Orli Staw case study in Poland, where we substantiate the concept of waste as a valuable resource for energy transformation with empirical evidence. Finally, Section 4 serves as the culmination of our discourse, where we draw our key findings, and articulate our conclusive remarks. Theoretical framework of CE The view mentioned in the introduction that our planet is basically a huge spaceship speeding through space, recharged by solar energy and equipped with closed-circuit systems is becoming more and more popular in human society. There are many ways to understand and define the CE. One such definition defines the CE as a production and consumption model that involves sharing, borrowing, reusing, repairing, refurbishing and recycling existing materials and products for as long as possible. This extends the product life cycle. In practice, this means minimizing waste. When a product’s life cycle comes to an end, the raw materials and waste that comes from it should stay in the economy through recycling. They can be successfully reused, thus creating additional value. 1United Nations forecasts [based on the Food and Agriculture Organization (FAO) and the World Water Council] assume that by 2050 the world population will increase by 1\/3, which will translate into the pace of moving to cities and a 50% increase in demand for water and energy during this period (Lasecki et al., 2021). Circular fashion has been present in the literature since the late 1960s. The concept of Circural Fashion appeared in 2014 and is currently one of the most popular concepts of sustainable development in fashion (Global Fashion Agenda’s 2020 Circural Fashion System Commitment was signed by 90 fashion brands). The phrases “spaceship Earth” (1960), “stocks for processing” (1966), The Closing Circle (1971), closed-loop economy (1981) alluded to CE (Meadows et al., 1973). The CE paradigm began to develop in the early 1970s, when scientists, politicians and recruits gathered around the Club of Rome began research on the future of the earth’s natural environment, its limited raw material resources and the place occupied by humans in the ecosystem. The result of this research was the first report prepared for the Club of Rome entitled “Limits to Growth” (The Limits to Growth 1972). It was in this report that the idea of a CE emerged, where the authors of the report stated that: “Natural ecosystems can absorb many waste products of human activity and process them into substances useable, or at least harmless to other forms of life”. However, when a waste product is released in large quantities, natural absorption mechanisms can become saturated. The waste products of human civilization can accumulate in a given environment until they finally become visible, annoying and even harmful. Therefore, larger consuming countries can learn how to recover and regenerate used materials. They can develop new methods to increase the durability of products made from scarce raw materials. They can introduce social and economic patterns of behavior that would meet needs while minimizing (rather than maximizing) use and dissipation of irreplaceable substances that man currently possesses (Niutanen and Korhonen, 2003). CE is an economic concept in which products, materials and raw materials should remain in the economy if possible, and the generation of waste should be minimized as much as possible (Oberle et al., 2019). This idea considers all stages of the product life cycle, starting from its design, through production, consumption, collection as waste, to its management. CE is a model of economic development in which–while maintaining the condition of efficiency–the following basic assumptions are met: 1) the added value of raw materials\/resources, materials and products is maximized or the amount of waste generated is minimized, and the resulting waste is managed in accordance with the hierarchy of waste management methods (waste prevention, preparation for re-use, recycling, other recovery methods, disposal) (Pagotto and Halog, 2015)2. The Ellen MacArthur Foundation3 states that the CE is based on three principles: 1) limit waste and pollution; 2) circulate products and materials (at their highest value)and 3) regenerate nature. The first principle of the CE is to eliminate waste and pollution. Currently, our economy works in a take-make-waste system. We take raw materials from the Earth, we make products from them, and eventually we throw them away as waste. Much of this waste ends up in landfills or incinerators and is lost. This system cannot work in the long term because the resources on our planet are finite. The second principle of the CE is to circulate products and materials at their highest value. This means keeping materials in use, either as a product or, when that can no longer be used, as components or raw materials. This way, nothing becomes waste and the intrinsic value of products and materials are retained. The third principle of the CE is to regenerate nature. By moving from a take-make-waste linear economy to a CE, we support natural processes and leave more room for nature to thrive4. The CE system diagram, known as the butterfly diagram illustrates the continuous flow of materials in a CE.5There are two main cycles–the technical cycle and the biological cycle. In the technical cycle, products and materials are kept in circulation through processes such as reuse, repair, remanufacture and recycling. In the biological cycle, the nutrients from biodegradable materials are returned to the Earth to regenerate nature5. According to the Ellen MacArthur Foundation on the left-hand side of the butterfly diagram is the biological cycle, which is for materials that can biodegrade and safely return to the earth. 6This cycle mainly concerns products that are consumed, such as food. However, some other biodegradable materials, such as cotton or wood, may eventually make their way from the technical cycle into the biological cycle once they have degraded to a point where they can no longer be used to make new products. At the heart of the biological cycle is the concept of regeneration. It is the third principle of the CE. Instead of continuously degrading nature, as we do in the linear economy, in the CE we build natural capital. Once food is harvested and consumed, the nutrients in organic waste streams can be collected, and returned to the soil via processes like composting and anaerobic digestion. If nutrients are not returned, soil becomes depleted, meaning farmers are forced to rely increasingly on chemical fertilisers to keep farmland productive. On the right-hand side of the butterfly diagram is the technical cycle, relevant for products that are used rather than consumed. The diagram shows that smaller inner loops are surrounded by the larger outer loops. These inner loops are where most value can be captured because they retain more of the embedded value of a product by keeping it whole. Take a smartphone, for example,–a working phone is worth more than the sum of its parts because the time and energy that went into making it is not lost. Therefore, inner loops like sharing, maintaining, and reusing should be prioritized above the outer loops that see the product broken down and remade. These loops also represent a cost saving to customers and businesses as they make use of products and materials already in circulation, rather than investing in making them new. 7The approach to CE is changing around the world. Not only as a problem to solve, but also as a business opportunity. For example, in Denmark, cooperation within the CE framework between business and industry is proposed in order to change the approach to production and consumption, creating new businesses and new jobs to make the lifestyle more sustainable (Luttenberger, 2020). Individual economic sectors are taking the essence of CE more and more seriously. One such example is the transformation from a linear to a circular approach in the food production industry in Australia. M. Pagotto and A. Halog (Pagotto and Halog 2015) present recommendations for this industry, based on the research of other scientists, which, among other things, are to improve environmental sustainability: “Our first recommendation is the implementation of a “sustainable resource management” (SRM) for the entire Australian agri-food industry chain. SRM is an integrated approach that manages materials\/resource life cycles aiming to achieve economic efficiency and environmental sustainability (Fiksel, 2006). Implementing SRM will support the Australian food producers and suppliers in identifying inefficiencies in the production processes, reducing production and waste costs, increasing competitiveness and improving the producers. The second recommendation involves the implementation of integrated waste management, energy, and fertilizer production in large centralized (regional) units or smaller decentralized local units, such as farm scale or industrial districts (Niutanen and Korhonen 2003). This strategy can transform the current linear production system utilized in the Australian food industry to a roundput production system where the organic food wastes and wastewater are treated to produce energy, recycled water, and fertilizer, which are later returned as valuable inputs (Niutanen and Korhonen 2003). The third recommendation proposes the increase of biofuel\/bioenergy production in Australia using available, nonfood biomass by-products generated by the agri-food industry. The Australian government should distribute financial incentives for constructing biorefineries. These biorefineries will transform organic materials, such as agricultural residues and food wastes, into valuable biofuels and chemicals (Pagotto and Halog, 2015). The last recommendation suggests that the Australian government should invest in research, professional training, and dissemination of the “mixed farming system” (MFS). This system will minimize the costs and emissions generated by transportation of feedstock that is required to feed the livestock raised in feedlots system (Pagotto and Halog, 2015).” The diagram and its description present the essence of the CE in a nutshell. The practical application of this idea encounters some resistance in the societies of various countries. According to one of the laws of harmony presented by Karol Adamiecki: “The Law of Inertia of Habits and the Law of Contradiction,” any undertakings involving the introduction of specific innovations or improvements in the company evoke a certain resistance in the employee teams aimed at rejecting this change and restoring the current state. Therefore, it is of great importance to properly prepare changes, train employees and participate in the process of implementing improvements, limiting the scale of this resistance. 8,9The quoted law of inertia of habits and the law of contradiction can be applied not only to the employees of a given enterprise, but also to individual governments or population groups. One such exception is the Japanese city of Kamikatsu, where a special recycling center has been set up, where over 30 waste fractions are sorted. Thanks to such solutions, as much as 80 percent waste produced by the local community is reused, recycled or composted. Only 20 percent goes to landfills. Kamikatsu inspires other cities, including Turkey and San Diego, where a plan was announced to reduce landfilled waste by 75% by 2030. By 2040, it would become completely zero waste. New York has similarly ambitious plans—it wants to reduce the amount of garbage to zero in the next 15 years10. Other examples of the transformation of waste management towards CE exemplified in Europe. Sweden use of heat generated in wastewater fermentation processes in heat pump systems. According to Gunnar Haglung, Haglung, 2011 about 80% of the heat in the Swedish district heating network, i.e. 40% of all heat, comes from energy sources that in many other countries of the world are not used at all but literally wasted. G. Haglung proposes that cities with up to 20,000 inhabitants residents invested in biomass-fired heating plants. In turn, cities with a population of 20,000 inhabitants up to 100 thousand inhabitants should invest in biomass-fired CHP plants, and in cities with more than 100,000 inhabitants, municipal waste should be managed on site, among others in incineration plants in cogeneration with the use of biomass. In addition, Sweden also introduced a tax on CO 2 and for incineration plants operating without cogeneration in the generation of heat and electricity. Segregation at source popularized in Poland by Eng. Andrzej Bartoszkiewicz. In addition, since 2005, a full ban on landfilling has been in force, which was widely consulted with the Swedish society. Heat in Swedish cities equipped with district heating is supplied in addition to incineration plants, biogas, geothermal energy, heat pumps or fossil fuels from industrial heat waste. The Swedish example described shows the country’s determination towards CE and the pursuit of energy independence. The entire economic mechanism is that energy is produced from waste delivered to, e.g., incineration plants, the cost of which is lower compared to coal or gas. Those who deliver waste must pay for it, which on the one hand, as mentioned, reduces the costs of energy production, and on the other hand, in a way, stimulates society to produce less waste, for the collection of which they also must pay. Swedish society has agreed to this transformation. Other societies are slower to adopt similar solutions. Due to the extensive discussion taking place on increasing the efficiency of the use of waste resources and thus converting energy, it is worth analyzing the possibilities of biogas production in solid waste processing installations. The presented case study concerns one of the most dynamically developing installations in Poland, which sorts waste, both municipal and industrial, for the recovery of the so-called commercial fractions and biodegradable waste for biogas production. Therefore, it seems that this example is worth disseminating where the preference is still mainly to store waste without considering it as a source of commercial products on the one hand, and on the other hand, the possibility of achieving energy independence first of all for a given installation, and then of other municipal entities or farms. homework. In Poland, the first installations producing biogas from municipal waste were built in 2010-2017. Most of them use a biofraction separated from mixed\/residual waste. Currently, most of them plan to change the input to selectively collected bio-waste. Some of them have undertaken investment activities in this area. Biogas produced from mixed waste is characterized by a high content of H 2 S reaching 2,000 ppm and a high content of silicon compounds (siloxanes), which requires its cleaning and makes it difficult to operate cogeneration engines. The average biogas productivity in such installations is in the range of 80–120 m3\/Mg (source: Szewczyk’s own survey). So far, in Poland there is no installation producing biomethane from biogas, injected into the grid or used to drive means of transport in the form of bioCNG or bioLNG. This is due to the lack of favorable legislation enabling the injection of biomethane into the grid. Powering vehicles with biomethane is also at the planning stage. In all installations operating in Poland that process solid waste, the generated electricity and heat is used for its own needs, and surplus electricity is sold to the grid. One of the installations operates in the trigeneration mode and has a bromolite absorption refrigeration system. This system generates cold from the waste heat, which is used for air-conditioning the rooms. Currently, in Poland, approximately 200,000 Mg\/year of bio-waste is managed in operating fermentation installations. Generally, it is estimated that the amount of biowaste generated in Poland exceeds 2,000,000 Mg\/year. With a conservative estimated average productivity of operating installations of approx. 100 m (Fiksel, 2006)\/Mg, this gives a potential biogas production capacity of approx. 200 million m (Fiksel, 2006)\/year. This biogas has a methane content of 50%–60%. These installations also have the ability to co-digestate other types of waste, not only from municipal sources, but also from trade, catering and agri-food processing, which can significantly increase Poland’s potential in this area. The advantage of this type of installation is their territorial dispersion as well as the stability and predictability of energy production, as well as its controllability, which, unlike other RES (wind, sun), stabilizes the power grid, reducing the need for its expansion. Case studies In many societies processes like Kamikatsu proceed relatively slowly. This is illustrated by the example of the Municipal Waste Treatment Plant Orli Staw (ZUOK). This plant serves 23 municipalities with a population of approximately 350,000. These inhabitants produce approx. 120,000 Mg\/year of municipal waste. All generated municipal waste goes to the ZUOK. This stream also includes selectively collected kitchen and garden biowaste. The installation in Orli Staw, as in other installations in Poland, the level of recycling and its structure are presented in Table 1. TABLE 1 TABLE 1. Practical possibilities of achieving recycling levels on the example of the installation in Orli Staw. The data presented in Table 1 shows that the efficiency of waste segregation in some European societies is low. The so-called mixed waste (unsegregated) from 50%–80% in the structure of waste collected from residents. From a practical point of view, this waste is basically the easiest to landfill or burn to obtain electricity and heat. However, the question is how can more reusable or recyclable fractions be obtained from this mixed waste? The first answer that comes to mind is to increase the level of education of the inhabitants. This process may take many years. Legal and financial restrictions can also be applied, which theoretically should accelerate the education process, or trigger social protests, which then translate into the results of elections to central or local authorities. Generally, the idea of CE is to define waste not as waste, but as a raw material. In the Orli Staw plant, the focus is now on the energy use of bio-waste by installing a module for obtaining biogas from this waste (fermentation module). This module uses both green and kitchen waste. The technology used is so universal that it produces biogas even from contaminated biodegradable fractions. This biogas is then used to produce electricity and heat for the plant, and surpluses are stored for resale. From the residues of these wastes after the fermentation and composting process, solid and liquid fertilizer is obtained. According to P. Szewczyk, the solution used for selectively collected municipal bio-waste is better than in the case of rural biogas plants, which require a more stable and clean material input. The fermentation installation at ZUOK Orli Staw was built in 2021-2022 and commissioned in 2023. After the first stage of implementation, it has the capacity to process 15,000 Mg\/year. The input to the installation is mainly selectively collected municipal bio-waste. Since 2017, when the implementation of selective collection was successively started, their number has been gradually increasing. In addition, the fermentation charge can also be expired food and expired food products from trade and gastronomy. It is also possible to manage liquid waste from the agri-food industry and agriculture. The amount of delivered bio-waste is gradually increasing. In 2016, there were 4,122 Mg, in 2017–5,372 Mg, in 2018 already 6,332 Mg, in 2019–7,836 Mg. In 2020, the amount of biowaste supplied increased significantly to 14,442 Mg, a year later to 17,548, and in 2022 to 18,528 Mg. This phenomenon is shown in Figure 1. FIGURE 1 FIGURE 1. Delivery of selectively collected municipal bio-waste to ZUOK (Orli Staw) in 2016-2022 Source: own study based on data from ZUOK (Orli Staw). In the period from 1 March 2023 to 31 May 2023, during the start-up of the fermentation installation, the average biogas productivity was 98.96 m (Fiksel, 2006)\/Mg of feedstock. At that time, after the injection of the inoculum and the start of the process, the amount of fed waste gradually increased, reaching the target value of approx. 41 Mg\/day. This amount was corrected based on the analysis of parameters and the course of the fermentation process. The produced biogas has an average methane content of 60.17%. This content ranges from 59% to 62.2%. The produced biogas has an H 2 S content of approx. 200 ppm. Before being directed to the cogeneration engine, the biogas is purified in a biological column and\/or in columns filled with activated carbon. Biogas is also dried in refrigeration dryers. The cogeneration unit with a peak power of 550 kW operates with variable power depending on the current energy needs of the plant. The heat energy recovered from the cooling of the cogeneration engine and the cooling of exhaust gases is directed to the in-house network. It is used for the technological needs of the fermentation installation, mainly for heating the fermenter, heating the premises of the plant and producing hot water. The role of energy storage in the form of biogas is performed by a double-layer biogas tank with a capacity of approx. 2,500 m (Fiksel, 2006). After the fermentation process, the digestate goes to the dewatering section consisting of two screw presses and one decanter centrifuge. The solid fraction goes to the aerobic process and then is a substrate to produce a natural organic fertilizer. The liquid fraction is directed to a buffer tank and then used in agricultural fields as an organic fertilizer. The fermentation installation at the ZUOK, after extension with a second fermenter with a capacity of approx. 15,000 Mg\/year, is planned to operate as a biomethane production installation in the form of bioCNG or bioLNG. It will be the fuel used to propel own means of transport and possibly also used as fuel for the needs of companies cooperating with the ZUOK collecting waste from residents. Another possibility of energy use of waste are wastewater treatment plants where biogas is also obtained. An example is the treatment plant in Tychy in Silesia, where biodegradable industrial waste is added to municipal sewage, which improves the amount of biogas obtained. From this biogas, electricity and heat are obtained in such quantities that, apart from the wastewater treatment plant’s own consumption, electricity and heat are used to operate the municipal aqua park, and surplus electricity is sold to the power grid. The uniqueness of this solution lies in the fact that in the vast majority of sewage treatment plants energy and heat are used only for their own purposes. Possibilities of improving the efficiency of the CE The motivation of this paper stems from the use of CE in practice in the context of waste management. This concept is becoming more and more popular. Waste is no longer treated as unnecessary garbage, but as raw materials from which new goods can be produced or transformed, for example, into heat or electricity. Biogas can be obtained from other waste, which in turn can be used to power engines or produce electricity and heat. The transformation of many economies, including European ones, towards CE also seems to be a necessity due to the ongoing Ukrainian-Russian conflict, which has disrupted the established economic order consisting in, among other things, purchasing cheap energy carriers from Russia. This conflict thus highlighted the risk of energy carriers supplied from one or a few places. This also includes the potential risk of interrupting the supply of plutonium or uranium ore to nuclear power plants from their current mining sites. Using the potential of waste and popularizing the opportunities offered by broadly understood CE seems to be invaluable. In addition, experience in implementing CE solutions may be useful for planned space travel. The example from Orle Staw shows dynamic changes in the approach to waste in Poland. From a financial point of view, the installation from Orly Staw generates profit, which is then transferred to the development of this company towards CE. More and more cities in Poland are starting to transform their installations in a similar way. It is a slow but steady process. Based on the example from Orle Staw and other examples described in the literature review, the following actions are recommended. 1. The design of incineration plants should assume the shortest possible payback period for investment outlays. In Sweden, for example, the payback period for the construction of a waste incineration plant is approximately 4–5 years, in Poland it is 20–30 years. This proves a more rational approach to the CE in this country from an economic point of view. 2. Such incineration plants should be built not only to dispose of waste while generating electricity and heat, but also as cement plants. The combustion temperature in a cement plant is higher than in an incinerator, which provides greater opportunities for environmentally safe disposal of hazardous waste, which may even be present in municipal waste. Moreover, the current Ukrainian-Russian war will end 1 day and the demand for cement will certainly increase, which rationally justifies the construction of such combined plants. In this way, flammable waste fractions can be used more effectively. 3. It is postulated to reconstruct each wastewater treatment plant so that it produces a larger amount of biogas than its own needs, also using industrial bio-waste. 4. Fermentation plants for the production of biogas from solid bio-waste should be built at each waste collection facility. This biogas would be used to produce heat and electricity for own needs and for sale, including as biofuel for engines. 5. Packaging should consist of materials that can be easily sorted. The effort here is also on the side of packaging manufacturers. In societies less convinced of such segregation at source, economic incentives to donate such packaging should be introduced. It would be worth applying an additional waste management hierarchy, i.e., separating cost-effective waste fractions such as aluminum, other metals, glass, waste paper, biodegradable and other economically viable fractions, and those that should only be treated as combustible material. 6. Collection points for such packaging should be located in places frequented by residents, e.g., shops, so that the resident does not feel the inconvenience of such a delivery of used packaging. 7. The logistics of collecting used packaging from such points should be improved. For example, each of the 14 distribution centers of one of the largest retail chains in Poland sends around 200 vehicles daily to deliver supplies to its retail outlets. These vehicles return to the city center lightly loaded or empty, covering around 20,000 km on the way back. Annually, this gives one center (assuming only 300 days of operation per year) 6,000,000 km, and for the entire network: 90,000,000 km. Fuel used when running empty: 20,700,000 L 22If those delivering products to stores collected used packaging at the same time, i.e., they would also provide collection services for such selected waste fractions, the number of so-called waste collections could be reduced. empty runs. 8. Disseminate the so-called sorting at source using efficient logistics. The solution proposed, among others, by A. Bartoszkiewicz assumes the employment of people in the so-called houses—sorting rooms located in multi-family buildings. These people would perform additional sorting of mixed waste on site. Separated materials would be collected, for example, by vehicles delivering products to nearby stores, in order to avoid empty journeys and reduce transport costs. You can also consider running a deposit system by the operators of such a sorting house. The presented recommendations and examples, including the example of the Orle Staw installation, may constitute a model or anchor for improving the efficiency of the economy thanks to the CE concept. It is not a problem to transform the linear economy into a circular one by spending huge sums of money. The challenge and logical path is to do this while improving the economic efficiency of given industries or enterprises. One such example, apart from others mentioned in the article, is the constant transformation of the Orli Staw installation, which is slowly becoming an enterprise stimulating the effective management of solid waste. In the future, new activities in the CE area may appear at this installation based on economic calculations, involving even various social and business groups in conducting these activities, which will also allow for the expansion of the CE idea in Polish society. Data availability statement The original contributions presented in the study are included in the article\/supplementary material, further inquiries can be directed to the corresponding author. Author contributions HE: Conceptualization, Investigation, Methodology, Project administration, Supervision, Writing–review and editing. GZ: Conceptualization, Data curation, Formal Analysis, Methodology, Writing–original draft. W-CA: Project administration, Writing–review and editing. SP: Data curation, Investigation, Resources, Writing–original draft. Funding The author(s) declare that no financial support was received for the research, authorship, and\/or publication of this article. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Footnotes 1Circular Economy: Definition, Meaning and Benefits (Video) | News | European Parliament (europa.eu). 2https:\/\/www.gov.pl\/web\/Rozwoju-technologia\/Gospodarka-o-ogu-zamknietym 3https:\/\/www.ellenmacarthurfoundation.org\/circular-economy\/concept 4What is a circular economy? | Ellen MacArthur Foundation 5The Butterfly Diagram: Visualizing the Circular Economy (ellenmacarthurfoundation.org) 6The biological cycle of the butterfly diagram (ellenmacarthurfoundation.org) 7The technical cycle of the butterfly diagram (ellenmacarthurfoundation.org) 8One Earth is not enough for us. We would use up five planets in a year - Forsal.pl 9Karol Adamiecki – Management Encyclopedia (mfiles.pl) 10https:\/\/smoglab.pl\/miasteczka-zero-waste-first-dziala-w-japonii-kolejne-powzanie-w-turcji\/ References Adamczak, J. (2022). Restructuring a municipal enterprise towards a circular economy on the example of the waste management industry. Warsaw: Oficyna Wydawnicza SGH. Google Scholar Apostu, S. A., Gigauri, I., Panait, M., and Martín-Cervantes, P. A. (2023). Is Europe on the way to sustainable development? Compatibility of green environment, economic growth, and circular economy issues. Int. J. Environ. Res. Public Health 20 (2), 1078. doi:10.3390\/ijerph20021078 PubMed Abstract | CrossRef Full Text | Google Scholar Deloitte (2018). Closed loop – open opportunities, prospects for the development of the circular economy in Poland. Report: Closed loop - open opportunities | Deloitte Polska, entry date September 26, 2023). Google Scholar Gabor, M. R., López–Malest, A., and Panait, M. C. (2023). The transition journey of EU vs. NON-EU countries for waste management. Environ. Sci. Pollut. Res. 30 (21), 60326–60342. doi:10.1007\/s11356-023-26686-y CrossRef Full Text | Google Scholar Haglung, G. (2011). Ecologically efficient economy in Sweden, conference materials. Google Scholar Kamiński, A. (2020). The impact of the circular economy on refinery operations. Pol. J. Sustain. Dev. 24 (2). Google Scholar Khan, S. A. R., Zia-Ul-Haq, H. M., Ponce, P., and Janjua, L. (2023). Re-investigating the impact of non-renewable and renewable energy on environmental quality: a roadmap towards sustainable development. Resour. Policy 81, 103411. doi:10.1016\/j.resourpol.2023.103411 CrossRef Full Text | Google Scholar J. Kulczycka (Editor) (2019). “Circular economy in policy and scientific research,” Institute of mineral resources and energy management of the polish academy of sciences (Kraków). 978-83-955544-5-2. 978-83-956380-0-8. Google Scholar T. Lasecki, T. Tamecki, M. Biernat-Kopczyńska, and R. Maruszkin (Editors) (2021). Circular Economy. Guide for small and medium-sized entrepreneurs (Warsaw: Polish Agency for Enterprise Development). Google Scholar Luttenberger, L. R. (2020). Waste management challenges in transition to circular economy–case of Croatia. J. Clean. Prod. 256, 120495. doi:10.1016\/j.jclepro.2020.120495 CrossRef Full Text | Google Scholar Meadows, D. H., Meadows, D. L., Randers, , and Behrens, W. W. (1973). The Limits of growth. Warsaw: National Economic Publishing House. Google Scholar Niutanen, V., and Korhonen, J. (2003). Industrial ecology flows of agriculture and food industry in Finland: utilizing by-products and wastes. Int. J. Sustain. Dev. World Ecol. 10 (2), 133–147. doi:10.1080\/13504500309469792 CrossRef Full Text | Google Scholar Oberle, B., Bringezu, S., Hatfield-Dodds, S., Hellweg, S., Schandl, H., and Clement, J. (2019). Global resources outlook 2019. Natural resources for the future we want. United Nations Environment Programme. International Resource Panel. 978-92-807-3741- 7 DTI\/2226\/NA UNEP 252. Google Scholar Pagotto, M., and Halog, A. (2015). Towards a circular economy in Australian agri-food industry an application of input-output oriented approaches for analyzing resource efficiency and competitiveness potential. J. Industrial Ecol. 20, 1176–1184. Number 5, Yale University. doi:10.1111\/jiec.12373 CrossRef Full Text | Google Scholar Popescu, C., Hysa, E., Kruja, A., and Mansi, E. (2022). Social innovation, circularity and energy transition for environmental, social and governance (ESG) practices—a comprehensive review. Energies 15 (23), 9028. doi:10.3390\/en15239028 CrossRef Full Text | Google Scholar Szewczyk, P. (2023). Waste treatment system in the light of the implementation of legal requirements and their energy use case study - Orli Staw - conference materials: challenges and opportunities for the national municipal waste management system. Webinar Organ. by Finance Inst. Warsaw Sch. Econ. on June 6. Google Scholar The business of a circular future (2021). How business models can accelerate the transition to a circular economy. WHITE PAPERS FOR A GREEN TRANSITION. Version 1.0. Google Scholar","filter_flag":1}
{"title":"Recent NSF Awards in Design for Environmental Sustainability in Computing Are Advancing US National Priorities - National Science Foundation","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5zZi5nb3YvbmV3cy9uZXdzX3N1bW0uanNwP2NudG5faWQ9MzA4NDg1JmZyb209bmV3cyZvcmc9Q0lTRdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5zZi5nb3YvbmV3cy9uZXdzX3N1bW0uanNwP2NudG5faWQ9MzA4NDg1JmZyb209bmV3cyZvcmc9Q0lTRdIBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3Lm5zZi5nb3YvbmV3cy9uZXdzX3N1bW0uanNwP2NudG5faWQ9MzA4NDg1JmZyb209bmV3cyZvcmc9Q0lTRdIBAA","guidislink":false,"published":"Tue, 24 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=297, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5zZi5nb3YvbmV3cy9uZXdzX3N1bW0uanNwP2NudG5faWQ9MzA4NDg1JmZyb209bmV3cyZvcmc9Q0lTRdIBAA?oc=5\" target=\"_blank\">Recent NSF Awards in Design for Environmental Sustainability in Computing Are Advancing US National Priorities<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Science Foundation<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recent NSF Awards in Design for Environmental Sustainability in Computing Are Advancing US National Priorities - National Science Foundation","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5zZi5nb3YvbmV3cy9uZXdzX3N1bW0uanNwP2NudG5faWQ9MzA4NDg1JmZyb209bmV3cyZvcmc9Q0lTRdIBAA?oc=5\" target=\"_blank\">Recent NSF Awards in Design for Environmental Sustainability in Computing Are Advancing US National Priorities<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Science Foundation<\/font>","source.href":"https:\/\/www.nsf.gov","source.title":"National Science Foundation","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Recent NSF Awards in Design for Environmental Sustainability in Computing Are Advancing US National Priorities DESC award announcement October 24, 2023 The U.S. National Science Foundation (NSF) has awarded $13M through its Design for Environmental Sustainability in Computing (DESC) program to 25 research teams seeking to contribute to technological innovation and environmental sustainability in computer systems. These grants encompass a wide range of projects including reducing greenhouse gas emissions and optimizing water consumption in data centers, creating novel methods to extend the useful lifetime of computing systems amortizing their carbon costs over longer periods of time, developing eco-friendly computing materials and optimizing algorithms for better use of energy from renewable sources. “The DESC program demonstrates our clear commitment to advancing US national priorities,” said Margaret Martonosi, assistant director for the Computer and Information Science and Engineering directorate at NSF. “By promoting research and development that integrates environmental considerations into computing we are addressing critical environmental challenges and contributing to a sustainable future. As we continue to navigate an era of rapid technological advancement and environmental concerns, programs like DESC play a pivotal role in shaping the future of our nation and our planet.” Headlining these awards are three Type I projects classified as large investments with budgets reaching up to $2M. The following institutions have been selected to receive the most recent Type I DESC awards: The George Washington University and The Ohio University. Multi-Function Cross-Layer Electro-Optic Fabrics for Reliable and Sustainable Computing Systems Researchers in this project aim to reduce the environmental pollution caused by the manufacturing of electronic devices and computers. Researchers will work on designing computer parts that can be reused to extend their lifespan. In addition, they will mix electronics and light-based technology to create a more efficient and reliable system for future computers. University of Pittsburgh and University of Notre Dame. Revisiting Expanding FPGA Real-estate for Environmentally Sustainable Heterogeneous-Systems The focus of this research project is to reduce carbon emissions from chip manufacturing by reusing recently retired computer chips and making them last longer. By connecting these chips together in new ways, the researchers will create devices that will compete with newly fabricated chips. This will help dramatically reduce pollution for developing new products while minimizing hazardous computer waste in landfills, which can cause serious health problems for humans, while still advancing computing capabilities. Cornell University, Georgia Tech and Harvard University. Life-time aware design frameworks for sustainable edge devices. This research project aims to make environmentally friendly electronic devices like wearable watches, phones, and sensors. These devices are a big part of our daily lives and are responsible for a lot of data we use, yet they can also harm the environment with the impact from their manufacture and are often treated as disposable. The researchers will create a toolkit called Delphi to help design these devices in a way that last longer and create less electronic waste. The DESC program also funded more than a dozen Type II projects with investments of up to $600,000. The following institutions have been selected to receive the most recent Type II DESC awards: The University of Texas at Arlington and University of California, Riverside. A User-Interactive Approach to Water Management for Sustainable Data Centers: From Water Efficiency. to Self-Sufficiency. This research project focuses on reducing the water usage of data centers, which are huge users of water, by creating a system that tracks water use and helps users make sustainable choices. The project also plans to use alternative water sources like rainwater. The Pennsylvania State University and Stony Brook University. Extending lifetimes of partially broken machines to repurpose e-waste. The goal of this project is to improve sustainability of computing hardware by extending the lifetime of computing equipment even when they start to partially break down. Therefore, the research team will investigate a new approach in which, instead of repairing or throwing away computers, the remaining working components are utilized as-is. Oregon State University and University of Florida. Software-Hardware Recycling and Repair Dataset Infrastructure (SHReDI) for Sustainable Computing. This project aims to tackle the growing problem of electronic waste (e-waste)—the fastest-growing type of trash globally— by developing wireless tags that will provide recyclers with information about what materials are in electronic devices and how to recycle them properly. The information from the tags will help track recycled e-waste back to the manufacturers, which can help create better recycling policies. Texas Tech University. Dynamic Optimization for Leaps in Sustainability-Centric Computing System Design. This project focuses on the environmental impact of computing systems, which can contribute to issues like greenhouse gas emissions and electronic waste. Researchers aim to make computing systems more sustainable by using dynamic optimization techniques that can improve the way they work in real time to reduce their negative effects on the environment. University of Missouri and The University of Texas at Dallas. Sustainability-aware Reliable and Reusable AI Hardware Design. The research team on this project aims to make energy efficient Deep Neural Network (DNN) accelerators, which are designed for compute-intensive applications like artificial intelligence and machine learning. Currently, DNN accelerators use a lot of power, making their use limited for energy-constrained devices. Therefore, researchers will work on efficient methods that enable DNN reuse and self-repair while also optimizing performance and sustainability metrics. University of California, Riverside. Enabling Carbon-Zero Colocation Data Centers via Agile and Coordinated Resource Management. This research project focuses on making large data centers, like those used by tech companies and the AI industry, more eco-friendly. These data centers use a lot of energy, and the goal is to reduce their impact on the environment by developing new ways to coordinate renewable energy use, optimize server operations, and adjust server power usage in a smart way. University of California, Riverside. Minimizing Carbon Footprint by Co-designing Data Centers with Sustainable Power Grids. Data centers contribute to global greenhouse gas emissions in part because of the difficulty of matching energy demands of systems with renewable energy production in the grid. Researchers in this project seek to improve the carbon emissions produced by data centers by developing a fine grain micro-grid electricity models of renewable energy availability and propose a novel carbon metric that helps them better measure and reduce their impact on the environment. Arizona State University and University of Minnesota, Twin Cities. Towards Reduce- and Reuse-based Design of VLSI Systems with Heterogeneous Integration. Researchers in this project aim to reduce carbon emissions through minimized computation required for designing computing components from scratch. The team will develop a method for reusing parts of the computer chips and making them more efficient so that they use less energy and produce fewer harmful emissions. University of Pittsburgh. Data-driven system-design for sustainable long-lasting distributed infrastructures. This research project aims to reduce carbon emissions by transforming the current carbon-based, electricity-dependent distributed computing infrastructure. While previous efforts have focused on making computer systems more energy-efficient, this project takes a broader approach. It recognizes that merely reducing energy consumption may not cut carbon emissions. Instead, it seeks to develop innovative strategies for computing systems that consider their entire lifespan and emissions. Southern Illinois University. Towards Greener AI Computing: Designing and Managing Sustainable Heterogeneous Edge Data Centers This project aims to substantially improve the sustainability of modern edge data centers by mitigating the environmental impact of artificial intelligence. Researchers will focus on promoting the adoption of sustainable practices in the computing industry, boosting the efficiency of data processing, and driving the transition of digital infrastructure towards a greener and more sustainable future. Northwestern University and University of Pittsburgh. Building Future-proof Learning-Enabled Cyber-Physical Systems with Cross-Layer Extensible and Adaptive Design. Researchers in this project aim to extend the lifespan of electronic devices to reduce the need to manufacture new ones as well as the e-waste that is produced when users discard them. The project will focus on smart devices like self-driving cars, medical equipment, and robots, which often need to adapt to constantly changing physical environment and have limited resources and stringent timing requirements. Colorado State University. Sustainable Serverless Computing. Cloud datacenters are a major contributor to global carbon emissions, and serverless computing will exacerbate these pressures on the global environment. This project will explore how serverless computing—the abstraction of compute, memory, data storage, networking resources, etc. from physical hardware—performs in datacenters with a goal to minimize overall environmental impact. Researchers will work on improving the way serverless computers start up, store data, and adapt to their environment. Funding for these recent DESC awards came from NSF’s Computer and Information Science and Engineering directorate. The National Discovery Cloud for Climate (NDC-C) program and NSF’s Office of Advanced Cyberinfrastructure provided matching funds and support for minority serving institutions. ## The DESC program promotes research and development that integrates environmental considerations into the design and utilization of computing and information systems. The program recognizes the critical role that computing technologies play in addressing environmental challenges while also seeking to address the environmental footprint of computing itself. The DESC program focuses on projects that meaningfully address sustainability beyond energy efficiency such as reducing greenhouse gas emissions, saving water consumption, and avoiding e-waste. By promoting research and development that embeds environmental considerations into computing technologies, DESC is helping the nation address pressing challenges, foster innovation, and create a sustainable and competitive future. Learn more at: https:\/\/new.nsf.gov\/funding\/opportunities\/design-environmental-sustainability-computing-desc The U.S. National Science Foundation propels the nation forward by advancing fundamental research in all fields of science and engineering. NSF supports research and people by providing facilities, instruments and funding to support their ingenuity and sustain the U.S. as a global leader in research and innovation. With a fiscal year 2023 budget of $9.5 billion, NSF funds reach all 50 states through grants to nearly 2,000 colleges, universities and institutions. Each year, NSF receives more than 40,000 competitive proposals and makes about 11,000 new awards. Those awards include support for cooperative research with industry, Arctic and Antarctic research and operations, and U.S. participation in international scientific efforts. Get News Updates by Email Connect with us online NSF website: nsf.gov NSF News: nsf.gov\/news For News Media: nsf.gov\/news\/newsroom Statistics: nsf.gov\/statistics\/ Awards database: nsf.gov\/awardsearch\/ Follow us on social Twitter: twitter.com\/NSF Facebook: facebook.com\/US.NSF Instagram: instagram.com\/nsfgov","filter_flag":1}
{"title":"Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap - Star Tribune","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA","guidislink":false,"published":"Thu, 12 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=285, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5\" target=\"_blank\">Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Star Tribune<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap - Star Tribune","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnN0YXJ0cmlidW5lLmNvbS9ib2F0LXNocmluay13cmFwLXdpbnRlci1taW5uZXNvdGEtbGVnaXNsYXR1cmUvNjAwMzExNjAzL9IBAA?oc=5\" target=\"_blank\">Minnesota lawmaker proposes a recycling fix for a sea of leftover boat shrink wrap<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Star Tribune<\/font>","source.href":"https:\/\/www.startribune.com","source.title":"Star Tribune","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Minnesota lake cabin owner Jim Nicholson knows the drill. When loons in the Brainerd lakes area start flocking together for their fall migration, it's time to pull his boat ashore near Outing and shrink-wrap it for winter. But as comforting as it is to seal his pontoon against the inevitable onslaught of snow and ice, it galls him every spring to remove the sky-blue film and jam it in the trash. \"How many football fields of this stuff get chucked into landfills every year?'' he asked. \"It must be some giant number.'' State Rep. Larry Kraft, DFL-St. Louis Park, puts the estimate at millions of pounds. He quietly introduced a boat wrap recycling bill near the end of the 2023 legislative session that will be watched in 2024 by manufacturers, marina operators, recycling advocates and boat owners. The bill (House File 3320) would require the producers to provide for the collection and recycling of the material, which has value for making new products out of its resin. Kraft said the proposed regulation is similar to Minnesota's successful \"producer responsibility\" stewardship program for the handling of leftover paint. \"It's hard for me to imagine there would be a lot of opposition to it,'' Kraft said of his bill, which he introduced May 13. \"It's a heckuva lot of plastic that right now is going to landfills across Minnesota.'' According to industry statistics cited by Kraft, Minnesota leads the nation in boats per capita with an estimated 14,500 vessels per 100,000 population. In 2022, boat registrations in the state totaled 822,450, second only to Florida. Of course, not all boats are shrink-wrapped for the winter; some are too small, and others are stored indoors. But Kraft estimates that 90% are big enough to be shrink-wrapped and that 25% to 40% of those get sealed, each with 15 to 40 pounds of plastic film. If 250,000 boats received 25 pounds of wrap — a moderate estimate — the waste would total 6.25 million pounds. Cindy Miller is the owner of Boat Doctor Up North, in Cass County. She runs a mobile shrink-wrapping service every fall, saving her clients indoor storage fees. Over the years, recycling options for the material have come and gone. There was a time when companies would pay for the discarded plastic. From there, the recycling market fell apart. For a time, companies would take the plastic free of charge, Miller said. Then, there was a nominal charge. Now, she said, boat owners dispose of the plastic at their own expense by throwing it in the garbage. \"I think it should be up to the manufacturers to put something in place,'' Miller said. \"Where we live, this plastic is not recyclable.'' Potential seen Gigi Jabbour of Minnetonka Marina gave a similar account of the decline in recycling options for boat wrap. Since about 2016, she said, there hasn't been a practical way in Minnesota to keep it out of the garbage stream. But Jabbour said her hopes were lifted at the Minneapolis Boat Show this year when she was introduced to a pilot project that has the potential for large-scale recycling of the blue and white sheets. Myplas, a $24 million plant in Rogers built by a South African company with the help of a coalition of Minnesota companies and the University of Minnesota, intends to recycle 90 million pounds of polyethylene packaging and film. Whether boat wrap will work as a raw material remains to be seen, but it would seem to work as an option for manufacturers if Kraft's bill is adopted by the Legislature. The bill would require each producer to operate a product stewardship program approved by the commissioner of the Minnesota Pollution Control Agency \"or enter into an agreement with a stewardship organization to operate on the producer's behalf.'' Paul Gardner, board chair of the Recycling Association of Minnesota, said Myplas has started to collect boat wrap. One of the challenges the plant faces is overcoming the used material's filth. \"Boat wrap is dirty,'' Gardner said. \"Whatever winter gives you is on there.'' In addition, the used material is often removed from boats and gathered from uncovered ground, adding to the mess. Still, too, he said, the collection would be seasonal — just once a year each spring. \"You want to have plentiful, even supplies of reasonable quality,'' he said. Regardless whether the Myplas facility will be the answer or how long it might take for boat wrap manufacturers to find a recycling solution, the proposed legislation will get people talking, Gardner said. \"People end up sitting down and saying, 'This material has [recycling] value,''' he said. \"Working through the supply chain mess is the key.'' Nicholson, the cabin owner, said he wouldn't mind paying a little extra for his annual supply of boat wrap if manufacturers passed on some of the cost to establish a lasting recycling solution. His tab for this year's wrap was $275. \"I would expect them to pass it along and not eat the cost,'' he said.","filter_flag":1}
{"title":"Intelligent OTN Solution: Enabling Fast and Simplified Deployment of Self-Healing Networks - ZTE","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy56dGUuY29tLmNuL2NvbnRlbnQvenRlLXNpdGUvd3d3LXp0ZS1jb20tY24vZ2xvYmFsL2Fib3V0L21hZ2F6aW5lL3p0ZS10ZWNobm9sb2dpZXMvMjAyMy81LWVuL3NwZWNpYWwtdG9waWMtLWRpZ2l0YWwtLS1pbnRlbGxpZ2VudC1uZXR3b3JrLXNlcnZpY2VzLzQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy56dGUuY29tLmNuL2NvbnRlbnQvenRlLXNpdGUvd3d3LXp0ZS1jb20tY24vZ2xvYmFsL2Fib3V0L21hZ2F6aW5lL3p0ZS10ZWNobm9sb2dpZXMvMjAyMy81LWVuL3NwZWNpYWwtdG9waWMtLWRpZ2l0YWwtLS1pbnRlbGxpZ2VudC1uZXR3b3JrLXNlcnZpY2VzLzQuaHRtbNIBAA?oc=5","id":"CBMipAFodHRwczovL3d3dy56dGUuY29tLmNuL2NvbnRlbnQvenRlLXNpdGUvd3d3LXp0ZS1jb20tY24vZ2xvYmFsL2Fib3V0L21hZ2F6aW5lL3p0ZS10ZWNobm9sb2dpZXMvMjAyMy81LWVuL3NwZWNpYWwtdG9waWMtLWRpZ2l0YWwtLS1pbnRlbGxpZ2VudC1uZXR3b3JrLXNlcnZpY2VzLzQuaHRtbNIBAA","guidislink":false,"published":"Sat, 07 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=280, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy56dGUuY29tLmNuL2NvbnRlbnQvenRlLXNpdGUvd3d3LXp0ZS1jb20tY24vZ2xvYmFsL2Fib3V0L21hZ2F6aW5lL3p0ZS10ZWNobm9sb2dpZXMvMjAyMy81LWVuL3NwZWNpYWwtdG9waWMtLWRpZ2l0YWwtLS1pbnRlbGxpZ2VudC1uZXR3b3JrLXNlcnZpY2VzLzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Intelligent OTN Solution: Enabling Fast and Simplified Deployment of Self-Healing Networks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZTE<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Intelligent OTN Solution: Enabling Fast and Simplified Deployment of Self-Healing Networks - ZTE","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy56dGUuY29tLmNuL2NvbnRlbnQvenRlLXNpdGUvd3d3LXp0ZS1jb20tY24vZ2xvYmFsL2Fib3V0L21hZ2F6aW5lL3p0ZS10ZWNobm9sb2dpZXMvMjAyMy81LWVuL3NwZWNpYWwtdG9waWMtLWRpZ2l0YWwtLS1pbnRlbGxpZ2VudC1uZXR3b3JrLXNlcnZpY2VzLzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Intelligent OTN Solution: Enabling Fast and Simplified Deployment of Self-Healing Networks<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZTE<\/font>","source.href":"https:\/\/www.zte.com.cn","source.title":"ZTE","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Recent years have witnessed a booming development within the global ICT sector. The deployment of 5G networks on a large scale is in progress, leading to an explosive surge in network traffic from various applications. Additionally, new technologies like intelligent driving, AI, and ChatGPT continue to emerge, imposing higher requirements on the rate and bandwidth of infrastructure networks. Enhancing digital intelligence of OTN foundational network has become a pressing need for network operators. ZTE has been exploring the realm of OTN intelligence and has introduced its collaborative solution integrating network management and control with WDM\/OTN automatically switched optical network (WASON). Additionally, new intelligent technologies such as power balancing and flexible grids have also been unveiled. These efforts are aimed at building highly intelligent transmission networks for customers. Management and Control Integrated Solution for End-to-End Management and Distributed Control The traditional OTN management and control approach implements dynamic network restoration and control through a centralized mode. This method, when compared to WASON’s operation on the device side, results in a longer interaction process. This, in turn, leads to increased uncertainty factors, including disrupted signaling channels between OTN management and control and the devices. As a result, stability issues emerge, thereby presenting significant risks in engineering applications. Though the WASON function is stable and supports dynamic restoration, it lacks the global route computation capability, which becomes a bottleneck for supporting large networks with more than 300 network elements (NEs). To leverage the advantages of both, ZTE has rolled out a collaborative solution that combines intelligent OTN management and control with WASON, enabling the management and control to have the route computation capability. As shown in Fig. 1, the management and control integrated solution utilizes the global perspective of the management and control server for end-to-end service allocation. It hands over the services with restoration attribute to the WASON distributed control, and the services with non-restoration attribute to the management and control server. This approach enables end-to-end management and control, promoting coordinated development of the control plane. Additionally, the WASON distributed control function is used to restore services and improve the operational stability of the control plane. The controller provides centralized route computation to improve the success rate of service restoration. The management and control integrated solution abstracts the bandwidth supported by each board through the network management system, eliminating the need for manual resource allocation for optical-layer boards. The solution also deploys collaborative services, enabling direct end-to-end cross-layer deployment of OAC services. After deployment, it can generate optical channels (OCHs) while also allowing a one-click removal of services. This simplifies the steps involved in service deployment and removal. Automated Power Optimization for Cost Reduction and Efficiency Improvement The optimization of optical power within the optical power system for traditional OTNs is carried out manually during joint debugging and maintenance phases. This is especially challenging in WASON service restoration scenarios, where the number of routes to be restored can be extensive. Manual operation methods are unable to debug all available paths, demanding a significant amount of human effort. The traditional method of prefabricated paths, due to its inability to cover all possible routes, results in certain risks to network robustness. Furthermore, it is unable to promptly adjust optical power in the event of optical cable degradation, consequently affecting services. To tackle this challenge, ZTE has implemented an automatic power optimization (APO) solution. Through intelligent algorithms, this solution enables automatic control and optimization of optical power throughout the entire network. Compared with manual calculations and interventions, this approach is closer to optimal values. This not only enhances transmission performance but also reduces the need for extra transmission performance margins, thereby lowering network construction costs. The APO solution includes a range of functions such as collection and reporting of power detector data, target power preset for the power detector, power parameter setting for the power controller, local automatic optimization of controller power parameters, global optimization of controller power parameters, automatic power optimization of the detector, and automatic channel power equalization. The APO solution implements network-wide power equalization by overlaying the power adjustments at both the optical multiplexing section (OMS) layer and the OCH layer. At the OMS layer, when the actual engineering parameters (such as fiber length) do not match the power budget design during network commissioning, or when fiber link attenuation changes during network maintenance, APO enables the system to automatically adjust the attenuation of optical attenuators or the gain of amplifiers. This allows the system to maintain the intended target power budget as designed. At the OCH layer, when individual wavelength channels experience power fluctuations due to factors like fiber connector losses, APO automatically adjusts the attenuation of boards equipped with channel attenuation adjustment capabilities (such as VMUX). This restores wavelength channels with abnormal power levels to their optimal operating points. During network commissioning, APO’s network-wide power setting and adjustment capabilities can improve the efficiency of new network deployment. Throughout network operation, APO’s real-time intelligent monitoring and network-wide power optimization capabilities can reduce the manpower costs of routine operation and maintenance. In addition, APO can rapidly respond to network power changes, reducing network adjustment time, network degradation duration, and even service failure time. This significantly strengthens network reliability and stability, leading to a substantial improvement in the intelligence of network self-healing capabilities. In the scenario of WASON service restoration, APO can automatically adjust the optical power of service paths, enabling the WASON network to possess a genuine automatic global exhaustive route computation capability. This greatly enhances network robustness. Flexible Grids for Self-Intelligence Management A key concept of a flexible grid is frequency slot, which refers to a spectrum section that meets the definition of a flexible grid as specified in G.694.1. At any given moment, this spectrum segment can be used for only one optical channel and is uniquely defined by its central frequency and slot width. Compared with the traditional fixed grid network, a flexible grid network has the flexibility to select a range of slot widths as required. In comparison to the traditional fixed-grid network, where all NEs are fixed-grid components, and the spectrum resource management granularity is based on fixed wavelengths, a flexible-grid network offers a different approach. In a flexible-grid network, there's no need for manual grid division in the network management. The network is composed entirely of fully automated flexible-grid NEs. The control plane can dynamically create and remove optical-layer wave channels as required, without human intervention. Resource allocation in a fully automated flexible-grid network is based on fundamental frequency slots, allowing the control plane to efficiently allocate optical-layer resources within its designated spectral range. In the 100G+ OTN service scenario, signals with different transmission rates or signals with the same transmission rate but using different modulation modes and coding schemes have different baud rates. This necessitates the use of different channel spacing. The concept of a flexible grid is exceptionally well-suited for accommodating this mix of various channel spacing requirements in transmission. It can dynamically allocate spectrum as needed, leading to efficient spectrum utilization and conservation of spectral resources. In the WASON service restoration scenario, fixed grids need to manually configure all ports of WSS and OPM spectrum analysis boards on the working and restoration routes. When a large number of alarms occur on idle network ports, the typical practice is to suppress these alarms. However, in cases where WASON services need to recover due to factors like optical cable interruptions, the previously idle ports become active for the restoration path. In such situations, it’s challenging to manually and promptly remove the alarm suppression from these parts, which can lead to a problem of real network alarms being overlooked. In contrast, flexible grids can automatically enable the ports on the route taken by the service through WSS and OPM spectrum analysis boards. When the service route changes, the system automatically removes these ports, ensuring that network alarms are always visible throughout the process. This feature makes network maintenance more convenient. In a fully automated flexible grid scenario, during the optical-layer end-to-end service provisioning phase, the system can automatically identify and adjust parameters related to service boards and the optical channel’s spectral width. This eliminates the manual configuration steps for individual network WSS bandwidth and OPM spectral analysis board ports, simplifying network deployment. In the network maintenance phase, WASON services can automatically enable WSS and OPM ports on new recovery routes, and idle ports are automatically removed when the services are restored. This advanced capability facilitates autonomous network management. Intelligent Applications ZTE and a Turkish mobile operator collaborate for the first time to implement a simplified deployment of OTN networks using a combination of intelligent solutions. This deployment encompasses the management and control integrated services, enabling OMS APO and OCH APO functionalities, with all scenarios based on flexible grids. In the network deployment phase, there’s no need for WSS channel setting, EOPM channel setting, or OA board resource allocation, resulting in a workload reduction of over 40% for single-point network configurations. The system automates optical power adjustments, boosting end-to-end service activation efficiency by over 70%. In the network maintenance phase, APO can automatically adjust the power of the optical system in real time, achieving intelligent network self-healing and greatly reducing the network management and maintenance costs. In terms of network evolution, the use of flexible grids enables the system to automatically allocate resources when transitioning to different service bandwidths, such as 400G in the future. This facilitates significant network scalability and growth. ZTE’s OTN intelligent applications come with distinct advantages in saving manpower and time costs, improving network maintenance and management efficiency, and promoting network scalability. The intelligent OTN solution is expected to be widely used in future network construction and optimization, helping customers achieve rapid and simplified network deployment, along with intelligent self-healing capabilities.","filter_flag":1}
{"title":"From gadget to garbage - newagebd.net","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5","id":"CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA","guidislink":false,"published":"Sat, 14 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=287, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5\" target=\"_blank\">From gadget to garbage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">newagebd.net<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"From gadget to garbage - newagebd.net","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vd3d3Lm5ld2FnZWJkLm5ldC9hcnRpY2xlLzIxNDg5OS9mcm9tLWdhZGdldC10by1nYXJiYWdl0gEA?oc=5\" target=\"_blank\">From gadget to garbage<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">newagebd.net<\/font>","source.href":"https:\/\/www.newagebd.net","source.title":"newagebd.net","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"— TechWorldBD24 Bangladesh generates about 2.7 million tonnes of e-waste annually, which is expected to double by 2030. The rapid urbanisation and growing population, coupled with a high demand for e-products, make the country more susceptible to the adverse impacts of e-waste, writes Md Zahurul Al Mamun IN OUR technology-driven world, electronic devices have become ubiquitous, driven by technological advancements, rising incomes and global accessibility. Innovation and trade have made electronics affordable and accessible in every corner of the planet. However, this convenience comes at a cost — electronic waste or e-waste. The exponential growth of e-waste generation globally is driven by rapid technological advancements, planned obsolescence, lack of repairability and reusability options and the insatiable demand for the latest gadgets. According to the Global E-waste Monitor 2020, the world produced 53.6 million tonnes of e-waste in 2019, equivalent to the weight of 7,300 Eiffel Towers. It also predicts that the global e-waste generation will reach 74.7 million tonnes by 2030 and about 120 million tonnes by 2050, making it the fastest-growing waste stream globally. Bangladesh is not immune to the problem of e-waste. According to a study by the Department of Environment, Centre for Environmental and Resource Management and Bangladesh University of Engineering and Technology, Bangladesh generates about 2.7 million tonnes of e-waste annually, which is expected to double by 2030. The rapid urbanisation and growing population, coupled with a high demand for e-products, make the country more susceptible to the adverse impacts of e-waste. On International E-Waste Day today, let’s delve into this issue, explore its multifaceted impacts and discuss potential solutions. What is e-waste? ELECTRONIC waste or e-waste is the term that refers to any electrical or electronic devices that have been discarded as waste without any intention of reusing them, are unwanted by their owner or have reached the end of their useful life or become obsolete. E-waste covers a wide range of discarded electronic devices and gadgets, such as computers, mobile phones, TVs, refrigerators, air conditioners, fluorescent lamps, batteries and more. These devices contain valuable materials, including rare earth materials, gold, silver, copper, platinum, palladium, lithium, ceramic, metals, plastics and glass. However, the current linear model for production and consumption contributes to the growing e-waste problem. Most e-products are not designed to last long or to be repaired easily, and they are becoming more complex and challenging to repair. At the same time, products have also become cheaper, making it attractive for consumers to buy new and discard used ones. All these factors combined lead to more e-waste. The Global E-waste Monitor 2020 report shows that only 17.4 per cent of the e-waste generated in 2019 was collected and recycled properly, while the rest was either dumped in landfills or burned in informal settings. Hidden threat of e-waste On environment: E-waste poses a severe threat to environmental and human health due to the presence of toxic and hazardous materials and improper disposal practices. E-waste contains not only valuable materials but also hazardous substances such as lead, mercury, cadmium, zinc, yttrium, chromium, beryllium, nickel, arsenic, antimony trioxide, tin, polyvinyl chloride, Halogenated and brominated flame retardants. Toxic chemicals can leach into the soil and affect its quality and fertility when e-waste is dumped in landfills to decay. This can make the soil less suitable for growing plants and crops, polluting the entire value chain and reducing the biodiversity of soil organisms, like bacteria, fungi and worms, crucial for nutrient cycling and decomposition. According to a report by UNEP, e-waste is responsible for 70 per cent of the toxic chemicals found in landfills, which can contaminate the soil and groundwater and threaten food security and livelihoods. Water pollution is another major issue caused by e-waste. When e-waste is exposed to rain or floods, it can release toxic substances such as heavy metals, organic pollutants and pathogens into surface and groundwater sources, reducing water quality and availability for drinking, irrigation, and supporting aquatic life. This pollution can also increase freshwater scarcity and the risk of waterborne diseases. Lastly, air pollution is another significant concern from e-waste. Burning or incinerating e-waste releases toxic and harmful gases and particulate matter into the atmosphere, which can cause respiratory and cardiovascular diseases. Burning e-waste can produce ground-level ozone. This occurs when volatile organic compounds, polycyclic aromatic hydrocarbons, dioxins and furans react with sunlight, causing acid rain and smog. Handling and inhaling toxic substances from e-waste can pose significant health risks and increase mortality. On humans: E-waste is a serious health problem affecting millions worldwide due to its toxic substances. The World Health Organisation has estimated that exposure to e-waste can result in a multitude of health problems, including respiratory infections, skin diseases, eye irritation, headaches, nausea, fatigue, an increased risk of cancer and neurological disorders. These health risks are particularly pronounced for informal workers who handle e-waste without proper equipment, training and protection and use primitive methods like breaking or burning to extract valuable materials. These workers often work in dangerous conditions and are exposed to dangerous chemicals, heavy metals and toxic air to retrieve precious metals to support their families. Children and pregnant women working in this sector are especially more vulnerable to the effects of e-waste exposure, which can impair their growth development cognitive abilities. On climate change: Electronic waste is a significant environmental issue that has far-reaching implications for climate change. E-waste releases greenhouse gases such as carbon dioxide, methane, nitrous oxide, and hydrofluorocarbons when burned or dumped in landfills. These emissions contribute to the increasing frequency of natural disasters and heat waves. E-waste plays a vital role in GHG emissions during production, use and disposal. E-products require considerable energy and resources to extract and process raw materials. This generates CO2 and other GHG emissions during production. For instance, one laptop emits over 220 kilogram of carbon dioxide during manufacturing. Additionally, e-products consume electricity to run, which also generates emissions depending on the energy source. According to a report by the International Energy Agency, the global electricity consumption of information and communication technologies was 1,100 terawatt-hours in 2018, accounting for about 3.7 per cent of global CO2 emissions. Finally, the disposal of e-waste can release GHG when burned or dumped in landfills. In 2019, e-waste contributed to a global carbon footprint of 98 million tonnes of CO2-equivalents, similar to Belgium’s annual emissions, according to the Global E-waste Monitor 2020 report. Resource depletion: E-waste is a goldmine of secondary raw materials, including precious metals like gold, copper, nickel and rare materials like indium and palladium, which have strategic value. These materials can be repurposed and recycled to create new products, reducing the need for mining, saving energy and water, and generating income and employment. A 2016 study by the United Nations University estimated that e-waste contained 7.7 per cent of the global gold supply, equivalent to 112.3 tonnes of gold. However, improper e-waste disposal leads to the loss of valuable materials and increased environmental and social problems. Wasting these resources also increases the demand for raw material extraction and production, which can negatively impact deforestation, land degradation, biodiversity loss, water scarcity and human rights violations. Challenges in e-waste landscape BANGLADESH is grappling with a surge in e-waste generation due to population growth, urbanisation, consumer behaviour, freelancing and internet access. Despite various policies and regulatory frameworks introduced to manage this issue, a comprehensive and integrated approach to the e-waste situation is lacking. Inadequate infrastructure, lack of effective multi-stakeholder engagement and insufficient investment make it even more difficult. Regulatory shortcomings: The current law on e-waste management, the Hazardous Waste (e-waste) Management Rules 2021 under the Bangladesh Environmental Protection Act, 1995, is inadequate and poorly enforced. It does not cover all aspects of e-waste management. They lack specific methods and standards for e-waste collection, transportation, storage, recycling and disposal. It also does not define the roles and responsibilities of different stakeholders, such as government agencies, producers, importers, retailers, collectors, recyclers and consumers. There is also a lack of coordination among different stakeholders and a lack of transparency and accountability in the system, which could lead to inconsistency, inefficiency and non-compliance among stakeholders involved in e-waste management. Lack of producer responsibility: The producers, assemblers, importers or exporters of e-products have no incentives or mechanisms to adopt eco-design principles or extended producer responsibility schemes in Bangladesh. Extended producer responsibility is a policy approach that requires producers to take responsibility for their products at end-of-life by paying for the collection or treatment of their products or providing information or guidance to consumers on how to dispose of them. Extended producer responsibility also encourages producers to design more durable, repairable, reusable and recyclable products. However, producer responsibility is virtually non-existent in Bangladesh. Producers, assemblers, importers or exporters face no consequences or rewards for their products at end-of-life. They have no obligation to pay for the collection or treatment of their products, provide information or guidance to consumers on how to dispose of them or design durable, repairable, reusable and recyclable products. Inadequate recycling facilities: Bangladesh also faces a significant challenge in managing e-waste due to the lack of adequate facilities for collecting, transporting, storing, treating and recycling it. There are no set standards or criteria for e-waste recycling or disposal facilities. Most of the existing facilities are informal and unregulated. Furthermore, there are no specific requirements or guidelines on how these facilities should operate, what technologies they should use, what outputs they should produce or what emissions they should control. This lack of proper safety measures or waste management practices increases the risk of pollution and accidents, further compounding the problem. Informal e-waste sector: The informal e-waste management sector in Bangladesh is a significant challenge for environmental and social sustainability. This sector handles about 80 per cent of the e-waste generated in the country but operates without legal recognition or regulation. The informal workers, mostly poor and uneducated, collect, dismantle, repair, refurbish or trade e-waste using primitive methods and tools. They are unaware of the health and environmental risks posed by the toxic and hazardous materials present in e-waste. They also lack proper equipment, training or protection to handle e-waste safely and efficiently. As a result, they expose themselves and their communities to various diseases and injuries and pollute the soil, water, and air with e-waste contaminants. Consumer engagement: Consumers or end-users of e-products play a vital role in e-waste management, but they are often neglected or uninformed. According to current rules and regulations, consumers should return their discarded or unused products to authorised traders, sellers or collection centres, but they are not given any guidance, education or motivation. Consumers also have no economic incentive to recycle their e-waste, as they do not receive any compensation or reward for their participation. Many consumers are unaware of the environmental and health impacts of e-waste and the benefits of recycling. They also lack information on how and where to dispose of their e-waste properly. They often throw away their e-waste with other household waste or sell it to informal collectors without realising they are contributing to environmental pollution and health hazards. What can be done? A data-driven roadmap: Bangladesh must adopt a data-driven approach to tackle the growing e-waste problem and avoid future catastrophes. This approach should be based on a comprehensive assessment of the country’s current and projected e-waste generation and management, aligning with international standards and best practices. A national inventory and database should be established to track e-waste generation, collection, transportation, recycling and disposal. A comprehensive legal framework should also be developed to regulate all aspects of e-waste management. The framework should clearly define the roles and responsibilities of stakeholders, such as government agencies, producers, importers, retailers, collectors, recyclers and consumers, to ensure transparency and accountability. As part of this, producers, importers, retailers, collectors and recyclers should register with authorities and report their activities. Clear and measurable targets for e-waste collection and recycling are essential for tracking e-waste movement and disposal, ensuring compliance with environmental standards and best practices. Additionally, they can provide valuable data and information on e-waste generation and management that can be used for planning and decision-making. Investing in infrastructure and technology for safe and efficient e-waste collection, transportation, recycling and disposal is crucial to address this issue effectively. Extended producer responsibility: Extended Producer Responsibility is a practical solution to reduce the environmental impact of production and consumption. It requires producers and importers to collect and recycle their products at the end of their life cycle, incentivising companies to design durable, repairable and recyclable products. Producer responsibility can take many forms, such as mandatory take-back schemes, deposit-refund systems, advance disposal fees or eco-labels. The decision by the EU to switch from a proprietary port to a USB C is a great example of extended producer responsibility. As a result, Apple introduced USB C ports in their iPhone 15 model, which reduces the burden on consumers and the government in managing e-waste. Another solution that could be implemented is a green tax or fee system that charges producers based on the environmental performance of their products. The green tax or fee system could use a rating system that evaluates the products according to various criteria, like energy consumption, hazardous substance content, recyclability, repairability, etc. The higher the rating, the lower the tax or fee. The revenue from the green tax or fee system could be used to fund e-waste management activities or support green innovation. A common platform for producers, importers, retailers and consumers could enable seamless collection, recycling and safe disposal of electronic devices. This could help create a market for recycled materials and stimulate innovation in product design and recycling technology. Circular economy: To tackle the growing e-waste problem, we must adopt a circular economy approach that prioritises resource efficiency and minimisation. E-waste recycling can be a sustainable way to create green jobs, promote a circular economy and reduce waste. This approach involves using products, parts and materials for as long as possible and viewing waste as a valuable resource. The circular economy model for electronics offers numerous benefits, including resource conservation, environmental impact reduction, value recovery and climate change mitigation. Implementing a circular economy for e-waste could lower GHG emissions, conserve natural resources, create new jobs, enhance competitiveness, generate income, promote social equity, and reduce health risks. A World Bank study estimated that implementing a circular economy for e-waste could generate an annual net benefit of $62 billion for Bangladesh by 2050 compared to the current development path. Recycling facilities: A potential solution to address the issue of e-waste in Bangladesh is to establish a certification system for e-waste recycling or disposal facilities. This system would require facilities to meet minimum standards and criteria for operation, technology, output and emission. The government should establish clear procedures for granting environmental clearance certificates based on compliance with environmental and occupational health and safety standards. According to a report by the Bangladesh Environmental Lawyers Association, only 10 per cent of the e-waste facilities in Bangladesh have environmental clearance certificates from the Department of Environment, while the rest operate without legal authorisation or monitoring. The system should ensure adequate equipment and technology to handle hazardous substances safely and separate or recover different materials. The government should also conduct regular inspections and audits to ensure proper operation and performance and impose penalties or sanctions for non-compliance or violations. This system can ensure the quality and safety of e-waste facilities, prevent pollution or accidents, and protect workers’ rights. The certification system could follow international best practices and standards, such as the e-Stewards or R2 standards for e-waste recyclers. Informal sector: Recognising and integrating the informal sector workers into the formal e-waste management system is crucial. They should receive incentives, training, certification and support. Enhancing the capacity and safety of both formal and informal e-waste recyclers by providing them with technical assistance, financial incentives and protective equipment is also important. This can help them improve their practices, reduce health and environmental risks and increase income and social status. Developing formal sector facilities for safe and efficient collection, transportation, dismantling and recycling of e-waste, complying with environmental standards and providing decent employment opportunities can reduce the reliance on informal sector workers and increase the recovery rate of valuable materials from e-waste. Consumers: A nationwide campaign on e-waste awareness and action targeting consumers or end-users could be launched to address the gap in e-waste management. Through awareness campaigns, incentive schemes, convenient collection systems and feedback mechanisms, consumers should be empowered. The campaign could use various media channels to educate consumers about the environmental and health impacts of improper e-waste disposal and the benefits of reducing, reusing and recycling electronic devices. This can encourage consumers to adopt eco-friendly practices like buying energy-efficient products, extending device lifespan, donating or selling old devices and disposing of e-waste at authorised collection points. Consumers should also be given economic incentives or rewards for returning their discarded or unused products to authorised traders, sellers, or collection centres. A survey by the Bangladesh Institute of ICT in Development found that 74 per cent of the consumers in Bangladesh were unaware of the proper disposal methods of e-waste, and 64 per cent were willing to participate in e-waste awareness campaigns. Public-private partnership: Promoting public-private partnerships and multi-stakeholder collaboration among government agencies, producers, importers, retailers, collectors, recyclers, NGOs and consumers to establish a sustainable and inclusive system of e-waste management is another solution. This can help to create a shared vision and responsibility, mobilise resources and expertise and ensure transparency and accountability. Strengthening regional and international cooperation on e-waste management to share knowledge, experiences, resources and solutions is also beneficial. Research and innovation: To improve data collection, develop technology and add value to e-waste, we must encourage research and innovation in e-waste management. This will help us better understand the e-waste situation in Bangladesh, find the best practices and solutions for managing e-waste and create new economic and social development opportunities. We can also work towards a zero-carbon economy focusing on climate change education, research and innovation by encouraging innovation and research on new products, processes and business models that reduce e-waste generation and enhance resource recovery. Conclusion E-WASTE management is not just an environmental concern; it’s an economic opportunity and a matter of social justice. E-waste is a global problem that requires local solutions. A comprehensive approach founded on data, technology, regulation, research and innovation is essential for a sustainable and prosperous zero-carbon future where e-waste is managed responsibly. In doing so, Bangladesh can contribute to several Sustainable Development Goals, primarily SDG 12 (Responsible Consumption and Production) and SDG 13 (Climate Action), while creating a world where climate action is evidence-based and tailored to local needs. Together, we can build a future where the adverse impacts of e-waste are minimised, benefiting both people and the planet. Md Zahurul Al Mamun is an independent climate researcher.","filter_flag":1}
{"title":"Cenviro's Contribution To Circular Economy in Advancing Malaysia - The Edge Malaysia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vdGhlZWRnZW1hbGF5c2lhLmNvbS9jb250ZW50L2FkdmVydGlzZS9jZW52aXJvcy1jb250cmlidXRpb24tdG8tY2lyY3VsYXItZWNvbm9teS1pbi1hZHZhbmNpbmctbWFsYXlzaWHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vdGhlZWRnZW1hbGF5c2lhLmNvbS9jb250ZW50L2FkdmVydGlzZS9jZW52aXJvcy1jb250cmlidXRpb24tdG8tY2lyY3VsYXItZWNvbm9teS1pbi1hZHZhbmNpbmctbWFsYXlzaWHSAQA?oc=5","id":"CBMibWh0dHBzOi8vdGhlZWRnZW1hbGF5c2lhLmNvbS9jb250ZW50L2FkdmVydGlzZS9jZW52aXJvcy1jb250cmlidXRpb24tdG8tY2lyY3VsYXItZWNvbm9teS1pbi1hZHZhbmNpbmctbWFsYXlzaWHSAQA","guidislink":false,"published":"Mon, 30 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=303, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vdGhlZWRnZW1hbGF5c2lhLmNvbS9jb250ZW50L2FkdmVydGlzZS9jZW52aXJvcy1jb250cmlidXRpb24tdG8tY2lyY3VsYXItZWNvbm9teS1pbi1hZHZhbmNpbmctbWFsYXlzaWHSAQA?oc=5\" target=\"_blank\">Cenviro's Contribution To Circular Economy in Advancing Malaysia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Edge Malaysia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cenviro's Contribution To Circular Economy in Advancing Malaysia - The Edge Malaysia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vdGhlZWRnZW1hbGF5c2lhLmNvbS9jb250ZW50L2FkdmVydGlzZS9jZW52aXJvcy1jb250cmlidXRpb24tdG8tY2lyY3VsYXItZWNvbm9teS1pbi1hZHZhbmNpbmctbWFsYXlzaWHSAQA?oc=5\" target=\"_blank\">Cenviro's Contribution To Circular Economy in Advancing Malaysia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Edge Malaysia<\/font>","source.href":"https:\/\/theedgemalaysia.com","source.title":"The Edge Malaysia","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The Scheduled Waste to Energy plant transforms scheduled waste into electricity through incineration and a steam turbine CENVIRO SDN BHD, Malaysia’s leading integrated waste management company, 70%-owned by Khazanah Nasional Bhd, aims to facilitate a major shift in embracing the circular economy model by accelerating its focus on waste recycling and recovery. This is in support of the global and our nation’s sustainability agenda. Conventionally, the world today operates in a linear economic model, the take-make-dispose approach, where raw materials are extracted, then transformed into products that are used by consumers, until the materials are finally discarded as waste. In contrast, the circular economy model follows the reduce, reuse, recycle and recover (4R) approach, whereby the use of new and mined resources is minimised, while the reuse of products is maximised and materials are recycled back into the value chain. Waste is truly the resource of the future. Cenviro, which stands for “clean environment”, with 30 years of experience is the first company to successfully operate a scheduled waste-to-energy (SWtE) plant since 2018. Through its subsidiary Kualiti Alam Sdn Bhd, Cenviro owns and operates Malaysia’s first and Southeast Asia’s largest integrated waste management centre (WMC), which has been in operation since 1998 in Negeri Sembilan. The WMC is licensed to treat and dispose 76 of the 77 scheduled waste codes, which includes hazardous waste, e-waste and medical waste. Cenviro has another SWtE plant in Johor that will start operating in January 2024. Apart from its existing recycling arm (Cenviro Recycling Recovery Sdn Bhd), Cenviro extends its involvement in recycling and recovery via its associate company Shan Poornam Sdn Bhd, which is the largest e-waste and metal recycling and recovery service provider in Malaysia. It is also involved in municipal solid waste management with its joint-venture company, E-Idaman Sdn Bhd, in the northern part of Malaysia. Reducing, Reusing, Recycling and recovering Dr Johari Jalil, Group Managing Director Group managing director Dr Johari Jalil said Cenviro is focused on intensifying its capability of recycling and recovering valuable materials from scheduled waste that can be reused as resources or raw materials in industrial processes and to manufacture new products. The company already collects an average of 230,000 tonnes of scheduled waste annually. “The shift of the customer’s focus right now is towards how we minimise waste because this is what the market expects. Therefore, aligned with our vision to become a modern resource company, our portfolio of incineration and landfills under treatment and disposal, which is currently about 80% of our group revenue, will shift to a more balanced 50:50 ratio with recycling and recovery,” he said. “However, you can’t eliminate treatment and disposal entirely yet because not all materials can be fully recovered or recycled. If someone claims they can deliver zero waste, that’s far-fetched,” says Johari. In future, with the advancement of technology, recycling capability can be further enhanced along with the manufacturer’s drive to intensify using recyclable raw materials in its production. Cenviro has adopted the waste hierarchy model by reducing its own resource consumption, recovering and reusing existing materials and waste in its operations, and subsequently producing energy before diverting the residual waste to landfills. For example, recycling waste oil to fuel its incinerators including reusing wooden pallets and combustible waste, powering its plants using solar panels on the roof of the buildings, reusing treated wastewater for plant quenching, harvesting rain for grey water and generating electricity from its SWtE for the national grid. This is in line with the company’s sustainability tagline of “SHIELDing the Environment for Future Generations”. Innovative solution to create landfill space The Vertical Secured Landfill is engineered on top of an existing landfill, effectively extending the lifespan of the landfill for many more years Cenviro manages the first Vertical Secured Landfill (VSL), which refers to an innovative and safe environmental solution that creates more landfill space and capacity vertically, without the clearing of more land. “The easiest way to operate a landfill is to build a new landfill from new land, but at the moment, we curb our need to sacrifice new land by deploying the VSL method instead. In simple terms, it is a landfill engineered on an existing landfill to prolong the lifespan of our landfill by many more years,” said Johari. “If we want to position ourselves as a modern resource company, the agenda of sustainability and modern resourcing need to converge. These cannot be diverging when you talk about sustainability but at the same time you are opening more landfills and incinerating a lot more waste,” he pointed out. To further enhance its recycling and recovery capability and capacity, the Cenviro board has approved an investment of RM200 million to undertake several projects in Cenviro Eco Park, its recycling hub, due to be completed in the next three years. This includes a plant that will recover and recycle food-grade PET plastic and turn it into recycled PET nurdles, as well as the recycling of used oil and sludge from the automotive and shipping industries to be repurposed as recycled base oil, and waste chemicals from the rubber industry to produce reprocessed rubber. Cenviro’s ambitions are also in line with Khazanah’s long-term strategy of Advancing Malaysia and to drive impactful outcomes for the country. The company’s greater focus on recycling and recovery is also in line with Khazanah’s strategy of creating a sustainable future where it hopes to play a leading role in shaping an equitable and responsible environmental, social and governance (ESG) transition for Corporate Malaysia. Regional expansion & IPO plans Johari said the strategic partnership with South Korea’s SK Ecoplant, which owns 30% of the company, will further propel Cenviro’s expansion and branding beyond Malaysia. The partnership with SK Ecoplant, a renowned global leader, especially in research and development enhancements, allows the company to gain access to a wide range of sustainability and R&D projects that are aligned with its goals. “SK Ecoplant’s expertise in technical and technological advancements is invaluable in our mission to promote the circular economy model for greener waste management. It also enables us to grow regionally. As the biggest player in the country, our growth catalyst would be through acquisitions and many of them will be outside of Malaysia, likely in Indonesia, the Philippines, Vietnam and so on. These are the countries that will grow in their industrial expansion,” he said. In March 2022, Cenviro issued its first sustainability-linked sukuk of RM54.6 million in two tranches from its unrated Islamic medium-term note programme of up to RM500 million in nominal value. The issuance was in line with its commitment to reduce its greenhouse gas (GHG) emissions intensity by 5% by 2025 from its base year of 2020. This is despite a substantial project pipeline of new facilities in the next three years. Cenviro recently received the Best Sustainability-Linked Sukuk award at the Asset Triple A’s Islamic Finance Awards 2023. On the company’s plan for an initial public offering (IPO), Johari said Cenviro has already mapped out its capital requirements for the future, which will encompass the need for capital injection to fund acquisitions, major sustainability projects, R&D as well as expansion to areas where it is not a dominant player, such as Sabah and Sarawak and Southeast Asia.","filter_flag":1}
{"title":"Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA","guidislink":false,"published":"Fri, 06 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=279, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5\" target=\"_blank\">Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsLXRyZW5kcy9lbWJyYWNpbmctZGlnaXRhbC1yZXZvbHV0aW9uLXBhcmFkaWdtLXNoaWZ0LWZtY2ctc3VwcGx5LWNoYWlu0gEA?oc=5\" target=\"_blank\">Embracing the Digital Revolution: A Paradigm Shift in FMCG Supply Chain Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Management\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Top 10 Luxury Watch Brands in India: How to Make the Right Choice Did you know that Sylvester Stallone, the legendary Hollywood action star, is actually auctioning off the 11th feature of his famous movie \"Rocky\"? And guess what's included in this exciting sale? The Patek Philippe Grandmaster Chime, valued at a staggering Rs 62 crore! This collection is a showcase of rare timepieces that have been carefully curated over the course of several decades. Luxury watches have come a long way from being mere timekeeping machines. They have evolved into symbols of artistry, social status, and incredible history. These killer accessories are not just about looking stylish; they represent a legacy of precision, innovation, and sheer elegance. In India, where culture is a vibrant fusion of all things amazing, luxury watches are wholeheartedly embraced as icons of style and heritage. Among the top watch brands in India, these timepieces epitomize elegance and sophistication. When you delve into the world of luxury watch brands in India, you'll discover a perfect blend of tradition and modernity that truly resonates with watch enthusiasts. The aim of this combination of system and user prompts is to enhance the assistant's ability to refine the text into a more natural, human-like version while remaining true to the original content's intent and factual accuracy. Top 10 Watch Brands in India Here are the 10 most-rated luxury watch brands in India: 1. Rolex : Top Watch Brands in India When it comes to luxury watch brands in India, there's no match for Rolex. It's the epitome of style, success, and timeless elegance. Rolex has gone beyond being just a timekeeper and has become a symbol of status and sophistication. The Rolex Oyster Perpetual and Datejust models are more than just watches; they're heritage pieces that tell stories of achievement and refinement. Known for their impeccable quality and enduring designs, Rolex watches are the definition of luxury that lasts for generations. Here are some key details about Rolex: Established Year: 1905 Founders: Hans Wilsdorf and Alfred Davis Headquarters: Geneva, Switzerland Products: They offer a range of luxury watches, including popular models like the Submariner, Daytona, and Explorer. Store Outlets in India: You can find authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: Rolex has been a pioneer in the industry, introducing the first waterproof wristwatch (Oyster), the first watch with an automatically changing date on the dial (Datejust), and the first wristwatch to show two time zones at once (GMT-Master). Awards and Recognition: Rolex is renowned for its precision, with many of their models certified as Superlative Chronometers. Each Rolex timepiece is crafted with utmost care, ensuring precision and durability. Whether you prefer the sporty Submariner or the elegant Day-Date, Rolex has a wide range of models to suit every taste. The brand's commitment to excellence is evident in their rigorous testing and use of top-notch materials. When you invest in a Rolex, you're not just getting a watch; you're acquiring a piece of history that will be cherished for years to come. 2. Franck Muller : Best Watch Brands in India When it comes to luxury watch brands in India, Franck Muller is a name that really stands out for aficionados of exquisite timepieces. They're known for their innovative designs and intricate complications, which have earned them a special place in the world of high-end watches. Here are some key details about Franck Muller: Established Year: 1991 Founder: Franck Muller and Vartan Sirmakes Headquarters: Genthod, Switzerland Products: They offer a range of top-tier luxury watches, including the iconic Crazy Hours, Vanguard, and Long Island collections. Store Outlets in India: You can find their watches at select luxury watch retailers in major cities like Mumbai, Delhi, and Bangalore. Innovations: Franck Muller is renowned for introducing unique complications like the Crazy Hours, which features a non-linear arrangement of the hour markers, and the Master Banker, designed specifically for international business travelers. Awards and Recognition: Their timepieces have gained widespread acclaim for their distinctive designs and mechanical sophistication. Franck Muller watches are more than just accessories; they're true masterpieces that seamlessly blend artistry with mechanical precision. The brand's unwavering commitment to excellence is evident in every meticulous detail and the use of only the finest materials. Not only are Franck Muller watches visually striking, but they also offer exceptional performance, making them the go-to choice for discerning watch enthusiasts in India. Whether you prefer the bold and striking Vanguard collection or the whimsical and unconventional Crazy Hours, Franck Muller watches are guaranteed to leave a lasting impression on both enthusiasts and collectors alike. 3. Omega Omega stands out in the world of luxury watches with its rich heritage and association with precision timekeeping. Known for its role in space exploration and sports timing, Omega watches are a blend of innovation and timeless elegance. Established Year: 1848 Founder: Louis Brandt Headquarters: Biel\/Bienne, Switzerland Products: Luxury watches, including the iconic Speedmaster, Seamaster, and Constellation collections Store Outlets in India: Multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: First watch worn on the moon (Speedmaster), co-axial escapement technology, and official timekeeper of the Olympic Games Awards and Recognition: Known for precision, many models are certified as Master Chronometers, meeting rigorous standards set by the Swiss Federal Institute of Metrology (METAS) Omega watches are celebrated for their robust performance and elegant designs. The Speedmaster, famously known as the \"Moonwatch,\" has been a part of all six lunar missions, while the Seamaster is renowned for its association with James Bond. Omega’s dedication to precision is evident in their stringent testing processes and use of innovative materials. For those seeking the top watch brands in India, Omega offers a perfect blend of history, technology, and style. Whether you're exploring the depths of the ocean with a Seamaster or timing a race with a Speedmaster, Omega watches are among the top 10 watch brands in India built to perform and impress. 4. Breguet Breguet is a distinguished name in the world of horology, known for its rich history and remarkable precision. As one of the oldest and most prestigious watchmakers, Breguet has been a symbol of innovation and excellence since its founding. Established Year: 1775 Founder: Abraham-Louis Breguet Headquarters: L'Abbaye, Switzerland Products: Luxury watches, including the Classique, Marine, Tradition, and Reine de Naples collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Inventor of the tourbillon, Breguet hands, and the first wristwatch Awards and Recognition: Known for its technical advancements and elegant designs Breguet watches are more than just timepieces; they are masterpieces that reflect over two centuries of expertise. Each watch is made with meticulous attention to detail, featuring detailed dials, fine engravings, and complex mechanisms that showcase the brand's dedication to quality. For those seeking the best watch brands in India, Breguet stands out with its blend of tradition and technology. Whether you prefer classic designs or contemporary innovations, Breguet offers a diverse range of models to suit various tastes. From the refined Classique collection to the maritime-inspired Marine series, Breguet's watches are a testament to the brand's enduring legacy. Among watch brands in India, Breguet holds a distinguished place, offering pieces that are both sophisticated and historically significant. 5. Tag Heuer TAG Heuer is a prominent name among the best watch brands in India, known for its sporty designs and precision engineering. Renowned for its association with motorsports and high-performance timekeeping, TAG Heuer has made a significant mark in the world of horology. When it comes to luxury watch brands in India, TAG Heuer stands out with its blend of innovation and style, making it a favorite among enthusiasts. Among the various watch brands in India, TAG Heuer offers a diverse range of models that cater to different tastes and preferences. Established Year: 1860 Founder: Edouard Heuer Headquarters: La Chaux-de-Fonds, Switzerland Products: Luxury watches, including the Carrera, Monaco, and Aquaracer collections Store Outlets in India: Available at multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Introduced the first oscillating pinion for chronographs, the Monaco, which was the first square water-resistant watch, and the Mikrograph, capable of measuring 1\/100th of a second Awards and Recognition: Celebrated for its contributions to sports timing and precision engineering TAG Heuer watches are known for their robust performance and contemporary designs. The Carrera collection, inspired by the world of racing, offers a blend of style and functionality, making it a favorite among enthusiasts. The Monaco, with its distinctive square case, has become an icon of modern watch design. The Aquaracer series is tailored for those who seek adventure, offering water resistance and durability. For those seeking the best watch brands in India, TAG Heuer provides a perfect blend of innovation and elegance. Each timepiece reflects the brand’s commitment to precision and quality. TAG Heuer's watches are not just accessories but reliable companions that enhance both style and performance. Among watch brands in India, TAG Heuer is a preferred choice for those who value heritage and cutting-edge technology. 6. Hublot : Best Watch Brands in India Hublot is definitely one of the coolest watch brands in India. They're known for their badass designs and innovative use of materials. As a top luxury watch brand in India, Hublot has built a reputation for fusing traditional Swiss watchmaking with a modern twist. When it comes to watch brands in India, Hublot offers a killer combo of craftsmanship and cutting-edge technology that really appeals to all the watch enthusiasts out there. Let's get down to the facts: Established Year: 1980 Founder: Carlo Crocco Headquarters: Nyon, Switzerland Products: They've got a whole range of luxury watches, including the iconic Big Bang, the classy Classic Fusion, and the bold Spirit of Big Bang collections. Where to Find Them: You can get your hands on Hublot watches at authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: These guys have pioneered the \"Art of Fusion\" concept, which means they mix materials like gold and rubber to create some seriously cool watches. They even came up with the first scratch-resistant 18K gold, known as Magic Gold! Awards and Recognition: Hublot has been praised for their innovative designs and their use of fancy materials. Now let's talk about the watches themselves. Hublot timepieces are all about style and cutting-edge technology. The Big Bang collection is a total showstopper, with its bold and dynamic design that really captures the brand's innovative spirit. On the other hand, the Classic Fusion line is all about understated elegance. They take traditional watchmaking techniques and give them a modern twist with some seriously cool materials. And let's not forget about the Spirit of Big Bang series, which stands out with its unique barrel-shaped case and intricate details. If you're on the hunt for the best watch brands in India, Hublot is definitely a name to remember. They bring together innovation, luxury, and style in the most perfect way. Each Hublot watch is a true testament to their commitment to quality and creativity. Whether you're into the bold and badass vibes of the Big Bang or the refined elegance of the Classic Fusion, Hublot watches are made to make a statement. When it comes to watch brands in India, Hublot is the top choice for those who appreciate a blend of heritage and contemporary flair. So go ahead, rock that wrist bling with confidence! 7. Breitling : Top Watch Brands in India Breitling is all about adventure and precision, which is why it's a favorite among aviators and explorers. As one of the top watch brands in India, Breitling is known for its tough and functional designs that cater to professionals and enthusiasts alike. When it comes to watch brands in India, Breitling really stands out because they're all about creating timepieces that are both stylish and super practical. Here are some key details about Breitling: Established Year: 1884 Founder: Léon Breitling Headquarters: Grenchen, Switzerland Products: They make luxury watches, including the awesome Navitimer, Chronomat, and Superocean collections Store Outlets in India: You can find them at lots of authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Breitling is the genius behind the first chronograph pushers, they even made a watch with a distress beacon, and they pioneered the slide rule bezel Awards and Recognition: People love Breitling for being super precise and durable, especially professionals in aviation and diving Let's talk about the Navitimer series for a sec. These watches are a nod to Breitling's aviation roots and have that cool slide rule bezel. They're not just watches, they're like precision instruments that can track time as accurately as an experienced pilot. It really shows how committed Breitling is to being excellent and reliable. The Chronomat series is a great mix of toughness and sophistication, while the Superocean line is perfect for deep-sea adventurers. So basically, no matter what you're into, Breitling has got you covered. If you're on the lookout for the best watch brands in India, you can't go wrong with Breitling. They've got innovation, durability, and style all rolled into one. Each Breitling watch is made to the highest quality standards, so you know it's gonna perform flawlessly in any situation. Whether you're a pilot, a diver, or just someone who appreciates a finely crafted timepiece, Breitling definitely stands out among watch brands in India as the top choice. They've got a rich heritage and their performance is second to none. 8. Chopard Chopard stands out not only for its exquisite watches but also for its commitment to ethical craftsmanship. As one of the best watch brands in India, Chopard is renowned for its luxurious designs and sustainable practices. Among watch brands in India, Chopard offers a unique blend of elegance and responsibility, making it a top choice for discerning buyers. Established Year: 1860 Founder: Louis-Ulysse Chopard Headquarters: Geneva, Switzerland Products: Luxury watches, including the L.U.C., Happy Diamonds, and Mille Miglia collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Use of fair-mined gold in the L.U.C. line, introduction of the Happy Diamonds collection with free-moving diamonds, and advanced in-house movements Awards and Recognition: Celebrated for its contributions to ethical luxury and its innovative designs The Chopard L.U.C. line, crafted from fair-mined gold, represents the brand’s dedication to sustainability without compromising on elegance. This collection embodies Chopard's commitment to responsible luxury, appealing to those who seek to balance sophistication with ethical values. The Happy Diamonds series is another iconic collection, featuring free-moving diamonds that create a playful and luxurious aesthetic. A Chopard watch is a statement of moral sophistication, appealing to those who seek to balance luxury with responsibility. For those looking for luxury watch brands in India, Chopard offers timepieces that are not only beautifully designed but also crafted with a conscience. Each watch reflects the brand's dedication to quality, innovation, and ethical practices. Among watch brands in India, Chopard stands out for its unique combination of style, history, and sustainability, making it a preferred choice for those who value both elegance and ethical production. 9. Longines With a heritage dating back to the 19th century, Longines continues to captivate watch enthusiasts with its timeless designs. From the athletic sophistication of the HydroConquest to the classic elegance of the Master Collection, Longines offers a range of styles to suit different preferences. A Longines watch is a graceful blend of tradition and modernity, making it a timeless accessory that transcends trends. 10. Bell & Ross Founded by a team of designers and aviation experts, Bell & Ross creates watches that are both functional instruments and works of art. The brand’s iconic square-cased models are inspired by aviation control panels, making them popular among those who appreciate precision and style. A Bell & Ross watch is for the adventurous and the discerning, embodying a dedication to accuracy and a flair for design. Ways to Choose Right Watch Brand? Choosing the right luxury watch brand in India involves considering various factors such as personal style, functionality, and the brand’s heritage. Here are some tips to help you make the right choice: Understand Your Style Luxury watches come in various styles, from classic and elegant to sporty and modern. Determine your personal style and choose a brand that complements it. For instance, if you prefer timeless elegance, brands like Rolex and Breguet might be ideal. If you lean towards a modern and bold aesthetic, Hublot and Bell & Ross could be more suitable. Consider the Functionality Different watch brands offer various functionalities tailored to specific needs. If you are an adventurer or sports enthusiast, brands like Tag Heuer and Breitling, known for their precision and durability, would be excellent choices. For those who prioritize ethical craftsmanship, Chopard offers luxurious timepieces with a commitment to sustainability. Brand Heritage and Reputation A watch is not just a timekeeping device; it is a statement of identity and prestige. Consider the heritage and reputation of the brand. Rolex, for instance, is renowned for its legacy of excellence and is often associated with success and sophistication. Omega’s association with space exploration adds a layer of historical significance to its timepieces. Budget Considerations Luxury watches come with varying price tags. Establish your budget and explore brands that offer the best value within your range. While some brands like Rolex and Omega are known for their high-end luxury, others like Longines provide a balance of elegance and affordability. Visit Authorized Retailers To ensure the authenticity and quality of your purchase, always buy from authorized retailers. Visiting a showroom allows you to experience the watch firsthand, understand its features, and make an informed decision. In Mumbai, Time Avenue is a premier destination for luxury watches, offering an extensive collection of top-tier brands like Rolex, Omega, and Hublot. Longevity Properly cared for, a luxury watch will last for several decades (or longer). Check out any of the major watch auctions (Phillips, Christie’s, etc.) and you will find ready evidence of this. Worn regularly over years or decades, a watch becomes intimately associated with its owner. A luxury watch’s ability to stand the test of time means it can be passed down to future generations. It can serve as a meaningful heirloom, rite of passage or long-lasting memento. FAQ’s on Luxury Watch Brands in India What are the best luxury watch brands available in India? Many luxury watch brands are available in India, including Rolex, Omega, TAG Heuer, Patek Philippe, Audemars Piguet, and more. The choice often depends on personal taste, budget, and desired features. Where can I buy authentic luxury watches in India? Authorized dealers and boutiques of luxury watch brands are the best places to buy authentic watches. Some well-known retailers in India include Ethos Watches, Kapoor Watch Co., and The Prime - Luxury Watch Boutique. What is the price range for luxury watches in India? Luxury watches in India can range widely in price depending on the brand, model, and materials used. Entry-level luxury watches might start around Rs 1 lakh, while high-end models can go up to several crore. Do luxury watches come with international warranties in India? Yes, most luxury watch brands provide international warranties that are valid in India. It's essential to purchase from authorized dealers to ensure your warranty is honoured. Are luxury watches a good investment in India? Luxury watches can be a good investment as they often retain or appreciate in value over time, particularly limited-edition models or those from prestigious brands. However, it's essential to research and buy wisely to ensure a return on investment. Conclusion Best watch brands in India are more than just timepieces; they are symbols of craftsmanship, heritage, and personal style. The market offers a diverse range of brands and models to suit different tastes and budgets, from classic designs to avant-garde complications. Purchasing a luxury watch is not just a transaction but an investment in a piece of artistry and history. It's a decision that reflects an appreciation for quality and an understanding of the value of time. As the luxury watch market in India continues to evolve, consumers can expect to see more innovation, exclusivity, and personalized service from brands and retailers. Whether as a personal indulgence or an investment opportunity, luxury watches remain a timeless choice for discerning individuals in India who appreciate the finer things in life.","filter_flag":1}
