{"title":"ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5","id":"CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA","guidislink":false,"published":"Fri, 01 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5\" target=\"_blank\">ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZW5lcnRlYy1hc2lhLTIwMjQtZHJpdmluZy1zdXN0YWluYWJsZS11cmJhbi1hbmQtaW5kdXN0cmlhbC1lbmVyZ3ktdHJhbnNpdGlvbi1pbi1zb3V0aGVhc3QtYXNpYS0zMDIwMDMxMzQuaHRtbNIBAA?oc=5\" target=\"_blank\">ENERtec Asia 2024: Driving Sustainable Urban and Industrial Energy Transition in Southeast Asia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Informa Markets Unveils ENERtec Asia, Transforming the ASEAN M&E Trade Show KUALA LUMPUR, Malaysia, Dec. 1, 2023 \/PRNewswire\/ -- The global energy landscape is undergoing a rapid transformation, driven by the urgent need to transition to sustainable energy sources and enhance energy efficiency. In response to this critical need, Informa Markets, the world's leading exhibitions organiser, proudly announces the rebranding of the highly successful ASEAN M&E trade show to ENERtec Asia, ushering in a new era of innovation and transformation. ENERtec Asia 2024 - Official Launch The energy landscape has undergone a profound transformation in the face of climate change challenges, geopolitical conflicts, and mounting pressure for businesses to adopt sustainable practices. Escalating energy costs and the demand for Environmental, Social, and Governance (ESG) compliance have intensified the need for clean energy solutions. Against this backdrop, ENERtec Asia emerges as a catalyst for change, offering sustainable solutions to alleviate financial strain and reduce carbon footprints for businesses worldwide. Scheduled to take place from 26th to 28th June 2024, at the prestigious Kuala Lumpur Convention Centre (KLCC), Malaysia, ENERtec Asia 2024 is set to revolutionise the industry. This transformative event will bring together a diverse array of global solution providers, mechanical and electrical industry professionals, and energy experts, providing them with a unique platform to collaborate and innovate under one roof. ENERtec Asia will feature three distinctive segments - TENAGA (Renewable Energy & Cleantech), REVAC (Energy Efficiency & Decarbonisation), and an exciting new addition - BATTERY & EV Tech (Energy Storage & EV Technology and Solutions). This innovative trade show will lead the way in the energy transition journey within the Southeast Asia region, showcasing revolutionary technologies ranging from renewable power generation and smart energy management to battery and energy storage solutions, as well as HVACR products focused on decarbonization and energy efficiency. Furthermore, it will spotlight innovations related to electric vehicles, creating a comprehensive platform for exploring the future of sustainable energy and transportation. Expressing his enthusiasm for the forthcoming event, Gerard Leeuwenburgh, Country General Manager of Informa Markets, said \"ENERtec Asia 2024 signifies a pivotal moment in the energy landscape of ASEAN. We are proud to be at the forefront of this transformation, bringing together key stakeholders, innovative solutions, and groundbreaking initiatives shaping the future of energy. This event will foster collaborations and drive meaningful discussions, accelerating our collective journey towards a sustainable and energy-efficient ASEAN.\" This rebranding is a testament to Malaysia's growing leadership in the energy transition within ASEAN. Malaysia, ranked 35th in the World Energy Transition Index (ETI) and No.1 in ASEAN, is spearheading the energy transition within the region. The nation's commitment to the Net Zero Carbon Neutral target drives the economy towards becoming a High-Income Nation. Malaysia's energy transition goals are outlined in the National Energy Transition Roadmap (NETR) and the New Industrial Master Plan (NIMP2030). These initiatives underscore the significance of ESG and the Green Industry, pivotal elements propelling Malaysia towards a sustainable future. Malaysia's energy transition strategy encompasses ten flagship projects under NETR, focusing on Renewable Energy, Energy Efficiency, and Green Industrial Development. The Industrial Environmental Sustainability Guidelines (iESG) introduced by the Ministry of International Trade and Industry (MITI) extend the goals of NIMP2030, emphasizing green transitions in industrial sectors. Furthermore, Malaysia's energy transition strategy emphasizes Renewable Energy and Energy Efficiency, targeting urban areas, industrial parks, technology parks, and agriculture. The forthcoming Energy Efficiency and Conservation Act (EECA), currently in its parliamentary process, will serve as the cornerstone of Malaysia's journey towards energy efficiency, shaping the nation's sustainable future. In a significant stride towards sustainability, all Bursa Malaysia-listed companies are mandated to obtain their ESG certificates by 2024. This initiative underscores the country's commitment to environmental, social, and governance standards, ensuring sustainable practices across industries. Malaysia is driving electric vehicle (EV) adoption by aiming to establish 10,000 EV charging stations by 2025, aligning with the Low Carbon Mobility Blueprint 2021-2030. This initiative promotes eco-friendly transportation solutions and supports the growing demand for electric vehicles. As a major electrical and electronics manufacturing hub in Southeast Asia, Malaysia offers a strategic advantage to automakers and investors. The components sub-sector, including semiconductors, sensors, batteries, and vehicle assembly, provides a robust supply chain for Next-Generation Vehicles (NxGVs). \"Malaysia's commitment to the Energy Transition is unwavering. ENERtec Asia provides a platform to showcase our achievements, share knowledge, and collaborate with international partners. Together, we will drive innovation and champion the adoption of Renewable Energy and Energy Efficiency for a greener, more sustainable future for our nation and the ASEAN region,\" Ir. Chang Yew Cheong, President of The Electrical & Electronics Association of Malaysia (TEEAM). ENERtec Asia is proud to announce strategic collaborations with prominent industry stakeholders, including TEEAM (The Electrical and Electronics Association of Malaysia), EIC (Energy Industries Council), APUEA (Asia Pacific Urban Energy Association), Megajana, MDCA (Malaysian District Cooling Association), ASHRAE Malaysia Chapter, FMM (Federation of Malaysian Manufacturers), Malaysia Green Building Council, and SME Association of Malaysia. Their expertise and support will enhance the event's impact and relevance. \"As a leading player in the energy sector, we are excited to participate in ENERtec Asia. This event aligns perfectly with our mission to drive innovation and sustainability in our industry. We look forward to engaging with fellow experts, exploring new technologies, and contributing to the dialogue on energy transition and environmental stewardship,\" said Mr Azman Nasir, Regional Director of Energy Industries Council (EIC). The participation of several industry giants as exhibitors underscores the event's significance in the energy sector, reaffirming ENERtec Asia as the epicenter of innovation and transformation. \"ENERtec Asia signifies a transformative moment in the region's energy landscape. This event serves as a catalyst, driving the transition towards a sustainable, low-carbon future. We are excited to witness and take part in the innovations and collaborations that will shape the future of energy in ASEAN.\" said Mr. Peter Lundberg, Executive Director of Asia Pacific Urban Energy Association (APUEA). ENERtec Asia 2024 promises to be a transformative event, uniting industry leaders, policymakers, and innovators to drive the energy transition agenda forward. With an impressive lineup of 400 exhibitors, encompassing renowned industry giants and esteemed representatives from 5 international pavilions, ENERtec Asia 2024 is set to reign as the focal point of ingenious solutions and sustainable practices across the region. ENERtec Asia 2024 is set to attract over 10,000 participants, including industry professionals, consultants, engineers, contractors, and policymakers. The event will serve as a hub for networking, knowledge exchange, and collaboration, bringing together thought leaders and decision-makers to explore the latest advancements in ESG initiatives and energy transition technologies. For more information, please visit www.enertecasia.com. About ENERtec Asia ENERtec Asia (www.enertecasia.com) is Southeast Asia's premier event dedicated to ESG and energy transition. Formerly known as ASEAN M&E, ENERtec Asia has been rebranded with a renewed and dynamic identity to reflect its expanded focus across three key segments namely, TENAGA (Renewable Energy & Cleantech), REVAC (Energy Efficiency & Decarbonisation) and an exciting NEW segment - BATTERY & EV Tech (Energy Storage & EV Technology and Solutions). Organised by Informa Markets, ENERtec Asia serves as the region's leading platform, uniting industry leaders, innovators, and policymakers to explore sustainable practices, cutting-edge technologies, and collaborative initiatives driving the region's energy transition towards a low-carbon future. By fostering a dynamic environment where businesses can showcase their latest products and services, forge strategic partnerships, and spearhead the development of sustainable energy landscapes, ENERtec Asia emerges as a catalyst for shaping a greener future for the region's energy sector. The event also features a comprehensive conference program with insights from industry experts on a wide range of topics related to ESG and energy transition. For more information, please visit www.enertecasia.com. About Informa Markets Informa Markets (www.informamarkets.com) creates platforms for industries and specialist markets to trade, innovate and grow. Our portfolio is comprised of more than 550 international B2B events and brands in markets including Healthcare & Pharmaceuticals, Infrastructure, Construction & Real Estate, Fashion & Apparel, Hospitality, Food & Beverage, and Health & Nutrition, among others. We provide customers and partners around the globe with opportunities to engage, experience and do business through face-to-face exhibitions, specialist digital content and actionable data solutions. As the world's leading exhibition organiser, we bring a diverse range of specialist markets to life, unlocking opportunities and helping them to thrive 365 days of the year. SOURCE ENERtec Asia","filter_flag":1}
{"title":"2024 oil and gas industry outlook - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA","guidislink":false,"published":"Fri, 01 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5\" target=\"_blank\">2024 oil and gas industry outlook<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2024 oil and gas industry outlook - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3Mi5kZWxvaXR0ZS5jb20vdXMvZW4vaW5zaWdodHMvaW5kdXN0cnkvb2lsLWFuZC1nYXMvb2lsLWFuZC1nYXMtaW5kdXN0cnktb3V0bG9vay5odG1s0gEA?oc=5\" target=\"_blank\">2024 oil and gas industry outlook<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www2.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"5. Downstream industry: Revamping the refining industry in alignment with evolving demand patterns The four disruptors shaping the energy landscape (geopolitics, economics, regulatory, and technology) have also impacted the global downstream petroleum sector. This situation is likely further exacerbated by the decline in global refinery capacity, which shrunk by 4.5 mbpd since 2019, with the United States’ refining capacity falling by 1 mbpd since the COVID-19 pandemic due to numerous factors, including the pandemic’s impacts, hurricane damages, weaker future demand forecasts, high operations costs, the inability to complete sales, or conversions to produce more renewable fuels.42 The refining industry now faces a pivotal moment, as the industry is producing and bringing to market new products to offset expected longer-term decline in transport demand for fossil fuels and, thus, adopting even more of a customer-centric or end market–oriented approach. Therefore, a blend of low-carbon fuel alternatives, from biofuels and hydrogen to chemicals, alongside a redesigned forecourt experience catering to evolving fuel mix and customer base is becoming important to the success of the downstream industry. Global oil demand is projected to slow down in the long term, rising annually by only 0.4 mbpd until 2027, compared to 1.6 mbpd until 2023. Meanwhile global biofuels demand is projected to rise by 44% between 2022 and 2027 as it increasingly substitutes for petroleum-based products.43 In addition, the share of EVs in global car sales is expected to range between 62% and 86% by 2030.44 In response, many global automakers are reorienting to electrify large portions of their product portfolios. Crafting niche capabilities The gap between rising low-carbon fuel alternatives and slowing but still positive oil demand expansion can offer a window for refiners to plan their transition without risking the disruption of financial stability. Therefore, refiners could play a transformative role by crafting strategic pathways and cultivating new capabilities within the following distinctive realms: Biofuels : O&G refiners already operate nearly 80% of the current global renewable diesel capacity. 45 However, they may grapple with the task of effectively leveraging subsidies and grants for strengthening the biofuel supply chain. Therefore, considering strategic steps such as securing a consistent feedstock supply, handling grade fluctuations, and optimizing transportation expenses and emissions can facilitate the efficient expansion of biofuels and set refiner performance apart. A case in point is Marathon Petroleum Corporation’s joint venture with ADM, which involves a specialized soybean processing facility to yield refined vegetable oil feedstock for renewable diesel production. 46 : O&G refiners already operate nearly 80% of the current global renewable diesel capacity. However, they may grapple with the task of effectively leveraging subsidies and grants for strengthening the biofuel supply chain. Therefore, considering strategic steps such as securing a consistent feedstock supply, handling grade fluctuations, and optimizing transportation expenses and emissions can facilitate the efficient expansion of biofuels and set refiner performance apart. A case in point is Marathon Petroleum Corporation’s joint venture with ADM, which involves a specialized soybean processing facility to yield refined vegetable oil feedstock for renewable diesel production. Hydrogen and ammonia : Green hydrogen and ammonia could present refiners with a compelling opportunity to not only curtail emissions but also decrease heating expenses, while broadening their product portfolio for industrial clientele. In fact, BP is reportedly mulling green hydrogen production at its Cherry Point facility, which could help reduce emissions by around 460,000 tons carbon dioxide equivalent per year. 47 : Green hydrogen and ammonia could present refiners with a compelling opportunity to not only curtail emissions but also decrease heating expenses, while broadening their product portfolio for industrial clientele. In fact, BP is reportedly mulling green hydrogen production at its Cherry Point facility, which could help reduce emissions by around 460,000 tons carbon dioxide equivalent per year. Electric vehicles : In addition to deploying EV charging stations and offering new mobility services at their retail outlets, leading refiners have a unique opportunity to explore various applications within the EV sector. For example, Phillips 66 is leveraging specialty coke to craft high-performance anode materials for the production of lithium-ion batteries. 48 : In addition to deploying EV charging stations and offering new mobility services at their retail outlets, leading refiners have a unique opportunity to explore various applications within the EV sector. For example, Phillips 66 is leveraging specialty coke to craft high-performance anode materials for the production of lithium-ion batteries. Chemicals : Amid increasing electrification, leading refiners could reconfigure their product portfolios, prioritizing items such as chemicals that have fewer readily available low-carbon alternatives. For instance, ExxonMobil plans to boost distillate and chemicals production at its Singapore and UK refineries, while reducing fuel oil and high-sulfur petroleum production. 49 : Amid increasing electrification, leading refiners could reconfigure their product portfolios, prioritizing items such as chemicals that have fewer readily available low-carbon alternatives. For instance, ExxonMobil plans to boost distillate and chemicals production at its Singapore and UK refineries, while reducing fuel oil and high-sulfur petroleum production. Carbon capture, usage, and storage (CCUS): Refinery and chemical organizations can leverage carbon capture for mitigating emissions from units such as steam methane reformers, catalytic crackers, and combined heat and power systems. For instance, Air Liquide, Air Products, ExxonMobil, and Shell are targeting to capture 2.5 million tonnes\/year at Porthos CCUS in Rotterdam.50 In conclusion, downstream players that adapt their strategies in alignment with evolving demand trends and prioritize the security of the supply chain could achieve success in the energy transition.","filter_flag":1}
{"title":"The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ... - Bloomberg Adria","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5","id":"CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA","guidislink":false,"published":"Sat, 23 Dec 2023 16:59:22 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=23, tm_hour=16, tm_min=59, tm_sec=22, tm_wday=5, tm_yday=357, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5\" target=\"_blank\">The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg Adria<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ... - Bloomberg Adria","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMizAFodHRwczovL3JzLmJsb29tYmVyZ2FkcmlhLmNvbS95ZWFyLWFoZWFkLTIwMjQvdmVzdGkvNDY1NjcvdGhlLXVuaXFhLWdyb3VwLWhhcy1pbnZlc3RlZC1vdmVyLTMwMC1taWxpb24tZXVyLXdvcnRoLW9mLWZpbmFuY2luZy1mb3Itc3VzdGFpbmFibGUtaW5mcmFzdHJ1Y3R1cmUtcHJvamVjdHMtYW5kLXJlbmV3YWJsZS1lbmVyZ3ktdGVjaG5vbG9naWVzL25ld3PSAQA?oc=5\" target=\"_blank\">The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg Adria<\/font>","source.href":"https:\/\/rs.bloombergadria.com","source.title":"Bloomberg Adria","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"What are UNIQA Insurance's plans for 2024 concerning new products or services you plan to launch in the market? 2024 will be an exciting year for UNIQA in the SEE region as we take the next step in our business and technology transformation. In the past year, we all worked hard to lay strong foundations for our new digital tools, which will help our colleagues to be faster and more efficient, but at the same time provide our clients an individual approach for their insurance needs. Our goal is to bring insurance to a new level in the next couple of years and become trendsetters in the insurance sector in the region. We are also working on the development of new standardized regional products, focusing on SME, Motor, Life, and Health. Our clients are our biggest inspiration, so we took their suggestions to heart and included them in our product development process to provide them exactly what they need. We are all looking forward to the next year. It truly will be full of innovation. How do you foresee the business opportunities in the insurance market in the coming year, particularly regarding emerging trends and changes in client needs? The insurance sector proved to be very resilient in the past, growing constantly even during a global pandemic and other economic challenges. The circumstances in which we operate are changing constantly, which also means that the needs of our clients change. Besides classical Motor and property insurance lines we see two segments that offer the most significant opportunity for development and growth, one of them being SME insurance. Small and medium enterprises are the most vulnerable business model in this high paced economy. Many SME owners have dedicated their personal assets to their businesses, thereby amplifying the financial risk to their overall well-being. With the right insurance, those risks can be minimised and allow more space for growth and development. The second opportunity we have to seize is the health insurance segment. People are paying increasing attention to a healthier lifestyle and seeking medical advice and second opinions more frequently. Offering clients the possibility to create their individual insurance coverage will provide them and us with a significant advantage in the future. Besides an individual approach, one of the biggest opportunities is to be flexible, fast, and innovative using technology. Using a omnichannel strategy allowed us to be more present, which means that our clients can reach us whenever they need. How does UNIQA Insurance plan to invest in ESG (Environmental, Social, and Governance) strategies in the upcoming fiscal year? Our ESG strategy is something we are already extremely proud of. In each field, we are trying to be as active as possible. For the upcoming year, we have already plans to surpass this year's goals when it comes to sustainability, biodiversity, and energy efficiency. The UNIQA Group is already a member of the Net-Zero Asset Owner Alliance and is a founding member of the Green Finance Alliance, and we are also dedicated to making a big impact in the region regarding those topics. Our overall goal is to achieve climate neutrality by the end of 2050. To achieve this, we have focused our ESG strategy on four areas – asset management, products, operations and reporting. The UNIQA Group has invested over 300 milion € worth of financing for sustainable infrastructure projects and renewable energy technologies, such as wind and solar energy and waste-to-energy processing. We will continue with sustainable investments in the region as well, helping our communites and local economies at the same time. Our products play also a crucial part in our strategy. We want to offer our clients the right support which will encourage them to switch to more sustaibable solutions as well (e.g. insurance of solar panels). UNIQA is also very engaged when it comes to various initiatives in this field. Our offices in the whole region are using recycled paper and we use sustainable energy sources wherever it is possible. We planted over 4.500 trees, supported local beekeepers, and our procurement team is working hard to provide us with sustainable sources to lower our carbon footprint as much as possible. To stay on track to achieve our climate neutrality goal we are conducting regular detailed analysis and reporting measures, making sure our governance politics are clear and transparent. Do you see priorities in innovation or technological advancements that will be pivotal for UNIQA's development in 2024? UNIQA in the SEE region is currently going through a significant digital transformation. The decision to go along this path did not come overnight. We have all done a lot of research and all results pointed to this move. The technological advancements we are acquiring from this strategy will form our future and make a big impact on the insurance market in our region. Since the insurance industry is based on people and their needs, our goal with this digital transformation is not to replace human interaction but to create tools that will help us to offer our clients an easier and faster solution to their needs. A large regional team of our IT experts is working tirelessly on developing new features that will be implemented very shortly into our unique and unified regional IT system. Most of the features aim to help our clients be more independent and efficient when it comes to insurance. We are creating a user-friendly and efficient self service oriented interface that will not only speed up all our processes but also simplify them while offering a wider range of options for our clients. How does UNIQA Insurance plan to support social initiatives and the communities where you operate during the next year? UNIQA is strongly committed to all communities in which we operate. Our overall goal is to be a strong and dependable partner to all people and businesses, and that means not only our clients. We have partnered with a lot of local and regional organizations in various fields with the main goal to give back to the community. Our first regional activity is our exclusive sponsorship of the Sarajevo Film Festival, which helped us explore our options when it comes to cultural investments in the region. We are also very proud of our cooperation with Goran Ivanisević, our first regional brand ambassador. We will work closely with both of our partners to create new opportunities for young talents and support them in their first career steps. Our guiding principle is based on strengthening our community, and young people are our top priority. What is very special for UNIQA is our unique approach to social initiatives. Our UNIQA SEE community is very eager to truly be part of every initiative, offering a helping hand and volunteering in many activities in addition to our donations and sponsorships. Our focus for the next year will be aimed towards culture, green initiatives, and sports, as we try to build a future in which we all live better together.","filter_flag":1}
{"title":"Powering Progress: SolaX's Annual Recap - A Global Odyssey of Solar Excellence - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzI4L3Bvd2VyaW5nLXByb2dyZXNzLXNvbGF4cy1hbm51YWwtcmVjYXAtYS1nbG9iYWwtb2R5c3NleS1vZi1zb2xhci1leGNlbGxlbmNlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzI4L3Bvd2VyaW5nLXByb2dyZXNzLXNvbGF4cy1hbm51YWwtcmVjYXAtYS1nbG9iYWwtb2R5c3NleS1vZi1zb2xhci1leGNlbGxlbmNlL9IBAA?oc=5","id":"CBMib2h0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzI4L3Bvd2VyaW5nLXByb2dyZXNzLXNvbGF4cy1hbm51YWwtcmVjYXAtYS1nbG9iYWwtb2R5c3NleS1vZi1zb2xhci1leGNlbGxlbmNlL9IBAA","guidislink":false,"published":"Thu, 28 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=362, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzI4L3Bvd2VyaW5nLXByb2dyZXNzLXNvbGF4cy1hbm51YWwtcmVjYXAtYS1nbG9iYWwtb2R5c3NleS1vZi1zb2xhci1leGNlbGxlbmNlL9IBAA?oc=5\" target=\"_blank\">Powering Progress: SolaX's Annual Recap - A Global Odyssey of Solar Excellence<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Powering Progress: SolaX's Annual Recap - A Global Odyssey of Solar Excellence - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzI4L3Bvd2VyaW5nLXByb2dyZXNzLXNvbGF4cy1hbm51YWwtcmVjYXAtYS1nbG9iYWwtb2R5c3NleS1vZi1zb2xhci1leGNlbGxlbmNlL9IBAA?oc=5\" target=\"_blank\">Powering Progress: SolaX's Annual Recap - A Global Odyssey of Solar Excellence<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"In a transformative year marked by exponential growth and technological prowess, SolaX has firmly established itself as the preeminent global leader in the solar sector. Strategic expansions into pivotal markets spanning Europe, the Americas, Asia, and Africa have fortified SolaX’s position as the foremost provider of cutting-edge solar technologies on the world stage. At the core of SolaX’s resounding success lies the introduction of a remarkable array of cutting-edge inverters meticulously designed to meet diverse energy demands. Noteworthy additions to our portfolio include the groundbreaking X1-HYB LV and X3-ULTRA hybrid inverters, alongside the X1-BOOST G4, X1-MINI G4, and X1-SMART G2 grid-tied inverters. These introductions underscore SolaX’s unwavering commitment to innovation and versatility. Furthermore, the incorporation of the T-BAT-SYS-HV-S2.5\/3.6 battery has enhanced our product lineup, providing robust energy storage solutions tailored to both hybrid and grid-tied systems. SolaX’s strides in innovation have been duly acknowledged through numerous accolades, including the prestigious “Top Brand PV Inverter” and “Top Brand PV Storage” awards across multiple countries, reaffirming our excellence in inverter technology and energy storage solutions. The Solar Prosumer Award© 2023\/2024 in the Inverters category, bestowed upon us by EUPD Research for empowering consumers in the energy transition, further attests to our commitment to sustainable energy solutions. Additionally, international media recognition has solidified our impactful presence and distinguished reputation in the solar industry. In the dynamic Indian market, SolaX has deepened its footprint through strategic collaborations with local stakeholders. Our tailored solutions resonate seamlessly with the unique energy landscape and consumer preferences of the nation. Active participation in numerous media events has not only expanded our visibility but also fostered greater awareness among diverse audiences. As we look forward to 2024, SolaX remains steadfast in its commitment to pioneering solar innovation. Our unwavering dedication to research and development ensures that SolaX products continue to lead in efficiency and reliability. The vision for the upcoming year involves unveiling eco-friendly solutions and advancing sustainability initiatives in alignment with the evolving global consciousness. In conclusion, SolaX’s year-end narrative encapsulates a journey marked by triumphs, recognition, and a relentless pursuit of excellence in shaping the future of solar technology. Like this: Like Loading...","filter_flag":1}
{"title":"OR launches new PTT Station Flagship as a gateway to embrace more diversification and pursue its objectives of ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvb3ItbGF1bmNoZXMtbmV3LXB0dC1zdGF0aW9uLWZsYWdzaGlwLWFzLWEtZ2F0ZXdheS10by1lbWJyYWNlLW1vcmUtZGl2ZXJzaWZpY2F0aW9uLWFuZC1wdXJzdWUtaXRzLW9iamVjdGl2ZXMtb2YtYmVjb21pbmctc3VzdGFpbmFibGUtZ3Jvd3RoLXBsYXRmb3JtLTMwMjAyMTY2MC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvb3ItbGF1bmNoZXMtbmV3LXB0dC1zdGF0aW9uLWZsYWdzaGlwLWFzLWEtZ2F0ZXdheS10by1lbWJyYWNlLW1vcmUtZGl2ZXJzaWZpY2F0aW9uLWFuZC1wdXJzdWUtaXRzLW9iamVjdGl2ZXMtb2YtYmVjb21pbmctc3VzdGFpbmFibGUtZ3Jvd3RoLXBsYXRmb3JtLTMwMjAyMTY2MC5odG1s0gEA?oc=5","id":"CBMi0AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvb3ItbGF1bmNoZXMtbmV3LXB0dC1zdGF0aW9uLWZsYWdzaGlwLWFzLWEtZ2F0ZXdheS10by1lbWJyYWNlLW1vcmUtZGl2ZXJzaWZpY2F0aW9uLWFuZC1wdXJzdWUtaXRzLW9iamVjdGl2ZXMtb2YtYmVjb21pbmctc3VzdGFpbmFibGUtZ3Jvd3RoLXBsYXRmb3JtLTMwMjAyMTY2MC5odG1s0gEA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvb3ItbGF1bmNoZXMtbmV3LXB0dC1zdGF0aW9uLWZsYWdzaGlwLWFzLWEtZ2F0ZXdheS10by1lbWJyYWNlLW1vcmUtZGl2ZXJzaWZpY2F0aW9uLWFuZC1wdXJzdWUtaXRzLW9iamVjdGl2ZXMtb2YtYmVjb21pbmctc3VzdGFpbmFibGUtZ3Jvd3RoLXBsYXRmb3JtLTMwMjAyMTY2MC5odG1s0gEA?oc=5\" target=\"_blank\">OR launches new PTT Station Flagship as a gateway to embrace more diversification and pursue its objectives of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"OR launches new PTT Station Flagship as a gateway to embrace more diversification and pursue its objectives of ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi0AFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvb3ItbGF1bmNoZXMtbmV3LXB0dC1zdGF0aW9uLWZsYWdzaGlwLWFzLWEtZ2F0ZXdheS10by1lbWJyYWNlLW1vcmUtZGl2ZXJzaWZpY2F0aW9uLWFuZC1wdXJzdWUtaXRzLW9iamVjdGl2ZXMtb2YtYmVjb21pbmctc3VzdGFpbmFibGUtZ3Jvd3RoLXBsYXRmb3JtLTMwMjAyMTY2MC5odG1s0gEA?oc=5\" target=\"_blank\">OR launches new PTT Station Flagship as a gateway to embrace more diversification and pursue its objectives of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"BANGKOK, Dec. 22, 2023 \/PRNewswire\/ -- For years, PTT Oil and Retail Business Plc. (OR)'s fuel station known as \"PTT Station\" has become a favorite one-stop lifestyle destination for customers, serving far beyond its original purpose as a gas station, with a wide range of modern amenities, convenient stores, coffee shops, restaurants and many more. OR launches new PTT Station Flagship as a gateway to embrace more diversification and pursue its objectives of becoming sustainable growth platform Touted to be a community center or \"Living Community\", PTT Station is a value-creating area that leverages the quality of life in communities, while also creating favorable opportunities and generating more income for communities in every region of Thailand. The extensive service station network, now with 2,100 locations across Thailand and Asia, is not merely a convenient stop for commuters, but an integral part of the neighborhood that grows together with local people and the community. After years of improving its own spaces, PTT Station is now looking outward and working more with people, communities, partners with full environmental consciousness in mind - whether it be using space to create participation with the community, creating a good quality of life for people and communities, as well as using technology to manage service stations that are environmentally friendly. The newly launched PTT Station Flagship at Vibhavadi 62 in Bangkok midtown area takes the concept of the 'Living Community' even further as a new service station model that truly reflects OR's business concept to become a growth platform that creates opportunities for people and communities and the environment. The service station is designed and developed in compliance with the Sustainability Development Goals (SDG) in OR's way to build a stable and sustainable growth within its comprehensive mobility and lifestyle ecosystem as well as serves as prototype of PTT Station development and expansion in the future. The \"S\" or \"SMALL\" aspect focuses on providing opportunities for small people. There is a prototype of Thaidet store which sells selected iconic local, community-made, eco-friendly products from all over Thailand, Pat Pat Shop, which sells products from The Royal Development Project of the Chaipattana Foundation, as well as \"Common Space\" to support community activities for sustainable income. Meanwhile, in the \"D\" or \"DIVERSIFIED\" aspect, intended to creating opportunities for growth for businesses of all types through OR's platforms, this service station features stores from OR's flagship coffee chain Café Amazon Concept Store, Texas Chicken, as well as other famous F&B and lifestyle brands. The \"G\" or \"GREEN\" aspect, aiming at creating a greener, healthier environment, is implemented at the service station as seen from initiatives to engage people into the action of environmental care to reinforce OR's commitment to achieving Carbon Neutrality goals. Examples are design of buildings that blend in seamlessly with natural surroundings, the use of sustainable energy from solar rooftop, and an energy storage system through batteries (G-Box) to achieve optimal energy efficiency. Café Amazon branch at the station uses biodegradable hot cups and upcycling products such as shirts and aprons for employees, and shop decoration materials. OR is also currently developing AI-CCTV for Customer Carbon, which can detect vehicle distance traveled and brands to calculate CO2 emitted within the service station. With retail space spanning over an area of 5,000 square meters, the new PTT Station Flagship is filled with a wide range of product and service offerings that meet all lifestyle needs of modern consumers, including various famous restaurant chains, specialty stores and service outlets. The new Cafe Amazon Concept Store here also features \"Coffee X People\" concept designed to suit different purposes of visiting customers, with a specialty bar for coffee lovers as well as family and co-working spaces, as well as special menus exclusively on offer at the branch. There is also a new restaurant concept that encompasses dine-in, drive thru, takeaway and delivery services on one place. The refueling and energy services at the new PTT Station Flagship address rapidly changing customer habits in the rise of advanced mobility modes, emerging EV and other alternative fuels, with a full range of products for all types of energy use for all types of vehicles, including high quality fuel in both premium and standard grades, and EV Centralized Chargers at EV Station PluZ, which can supply 6 outlets at a time, supporting up to 180 kW charging. Moreover, there is an EV showroom for consumers and car buyers who are eager to join ever-growing community of eco-conscious drivers. The new PTT Station Flagship stands as the next level of OR's achievement in fulfilling ever-changing customer needs and energy transition, while fostering engagement between its key mobility and lifestyle platform, business partners, and local communities for inclusive growth and sustainable future. SOURCE PTT Oil and Retail Business Public Company Limited","filter_flag":1}
{"title":"We are committed to championing environmentally sustainable practices: Hitachi Energy India - Your Gateway to ... - T&D India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS93ZS1hcmUtY29tbWl0dGVkLXRvLWNoYW1waW9uaW5nLWVudmlyb25tZW50YWxseS1zdXN0YWluYWJsZS1wcmFjdGljZXMtaGl0YWNoaS1lbmVyZ3ktaW5kaWEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS93ZS1hcmUtY29tbWl0dGVkLXRvLWNoYW1waW9uaW5nLWVudmlyb25tZW50YWxseS1zdXN0YWluYWJsZS1wcmFjdGljZXMtaGl0YWNoaS1lbmVyZ3ktaW5kaWEv0gEA?oc=5","id":"CBMidGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS93ZS1hcmUtY29tbWl0dGVkLXRvLWNoYW1waW9uaW5nLWVudmlyb25tZW50YWxseS1zdXN0YWluYWJsZS1wcmFjdGljZXMtaGl0YWNoaS1lbmVyZ3ktaW5kaWEv0gEA","guidislink":false,"published":"Mon, 04 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=4, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=338, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS93ZS1hcmUtY29tbWl0dGVkLXRvLWNoYW1waW9uaW5nLWVudmlyb25tZW50YWxseS1zdXN0YWluYWJsZS1wcmFjdGljZXMtaGl0YWNoaS1lbmVyZ3ktaW5kaWEv0gEA?oc=5\" target=\"_blank\">We are committed to championing environmentally sustainable practices: Hitachi Energy India - Your Gateway to ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"We are committed to championing environmentally sustainable practices: Hitachi Energy India - Your Gateway to ... - T&D India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS93ZS1hcmUtY29tbWl0dGVkLXRvLWNoYW1waW9uaW5nLWVudmlyb25tZW50YWxseS1zdXN0YWluYWJsZS1wcmFjdGljZXMtaGl0YWNoaS1lbmVyZ3ktaW5kaWEv0gEA?oc=5\" target=\"_blank\">We are committed to championing environmentally sustainable practices: Hitachi Energy India - Your Gateway to ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","source.href":"https:\/\/www.tndindia.com","source.title":"T&D India","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Interview We are committed to championing environmentally sustainable practices: Hitachi Energy India Venugopal Pillai Venugopal Pillai December 4, 2023 Share Hitachi Energy is a global technology leader that is advancing a sustainable energy future for all. In this exclusive interaction, we have Atul Pandit, Senior Vice President, Transformer, Hitachi Energy India, discussing the company’s transformer business. He asserts that Hitachi Energy India is making significant technological advancements that are in fact setting new benchmarks for the transformer industry. Pandit explains that for Hitachi Energy India, sustainability and localization are two important philosophies where the company is taking major strides. An interview by Venugopal Pillai. We learn that in May last year, Hitachi Energy inaugurated its transformer components factory in Gujarat, primarily to produce RIP bushings up to 400kV rating. Has regular production started from this unit? What is the indicative capacity? Hitachi Energy’s new transformer components factory in Gujarat commenced regular production soon after its inauguration. It marks a significant stride in meeting the escalating demand for Resin Impregnated Paper (RIP) bushings with a voltage rating of up to 400kV. We received overwhelming support from our discerning customers. BHEL (Bharat Heavy Electricals Ltd), Bhopal, gave us a major contract in October 2022 of six 400kV RIP bushings. Our team delivered the order in a record time of five weeks as against a much longer lead time of 20-24 weeks when imported from overseas suppliers. Currently we are producing 500 bushings in a year and have plans to increase the production capacity by another 20-30 per cent in future. Please discuss the relative advantage of RIP bushings over conventional OIP bushings. Also, does Hitachi Energy supply RIP bushings to other transformer manufacturers also, or are they for captive consumption alone? Resin Impregnated Paper (RIP) bushings stand out as a technologically advanced alternative to traditional oil-impregnated paper (OIP) bushings, offering a spectrum of advantages, starting from reduced risk of fire, lower weight, no oil supervision\/oil conditioning, environment friendliness, etc. More importantly, RIP bushings can be energised immediately after installation. Furthermore, RIP bushings demand lower maintenance efforts and costs, contributing to overall operational efficiency and cost-effectiveness. Hitachi Energy, as a trailblazer, not only incorporates RIP bushings into its own transformers, underscoring a commitment to cutting-edge technology, but also extends its influence by supplying these advanced components to other transformer manufacturers. This collaborative approach not only benefits Hitachi Energy but also contributes to industry-wide advancements in technology and performance, fostering a collective drive towards higher standards in transformer manufacturing. This dual strategy positions Hitachi Energy as a pivotal player not just in enhancing its own products but also in elevating industry benchmarks through the widespread adoption of RIP bushings. What is Hitachi Energy’s view on producing “green” transformers — those equipped with natural\/synthetic ester oil as opposed to conventional mineral oil? The use of biodegradable insulation fluids with higher flash and fire points such as esters (natural and synthetic) helps to safeguard surrounding ecosystems from the risk of pollution and increase safety for people. Ester offers higher absorption capacity of free moisture in oil compared to mineral oil which helps increasing the life expectancy of the transformer insulation. Also, it helps in reducing the carbon footprint, as it leaves minimal carbon footprint of 0.07 kg CO2 equivalent\/kg produced, about ten times less than that of mineral oil. At Hitachi Energy we are committed to championing environmentally sustainable practices in all spheres of our work. On the same line we have our eco-efficient transformer called EconiQ™ transformers. The EconiQ™ optimized transformer provides a reduction of over 21 per cent in the total carbon emissions across the lifecycle. The major contribution comes from lower emissions during operation associated with losses but also from the use of fossil-free electricity in manufacturing and the use of natural esters. Hitachi Energy last year won a major order to supply 400kV transformers for renewable energy evacuation in Gujarat. What is the current status of this mega order? How do you see the prospects for EHV transformers, including 765kV, especially for RE evacuation? The winning of the major order of 400kV transformers for the evacuation of solar energy in Gujarat stands as a notable achievement, marking the company’s pivotal role in advancing renewable energy (RE) infrastructure. The order is in its advance stage of execution as per project timelines. Looking forward, the prospects for extra high voltage (EHV) transformers, especially in the context of renewable energy evacuation, appear promising. The shift towards cleaner and sustainable energy sources is driving an escalating demand for EHV transformers to efficiently transmit power over long distances. The Indian Ministry of Power has made clear roadmap to implement RE generation and to establish transmission system for integration of 500 GW RE generation by 2030. Considering this there would be major demand for transformers for evacuation of RE power, especially now at 400kV level, looking at size and scale of RE Parks. 765kV transformers are presently used for transmission of bulk power for long distance, which is a next step to the power evacuation from RE generation parks. Apart from power transformers, Hitachi Energy, as we perceive, has been doing very well with other transformers, particularly traction transformers and dry transformers. Please discuss the prospects of dry transformers, and the growth drivers for the same. Hitachi Energy has demonstrated remarkable success in diversifying its transformer portfolio, notably excelling in the domain of dry transformers, with a specific focus on traction transformers. The burgeoning popularity of dry transformers can be ascribed to their distinct eco-friendly attributes and low-maintenance characteristics. These transformers have become increasingly sought after due to their capacity to minimize environmental impact and operational costs. Traction transformers, a standout segment within this portfolio, assume a crucial role in advancing electrified transportation systems, aligning seamlessly with the global paradigm shift toward sustainable mobility. The prospects for dry transformers, in general, are buoyed by the expanding adoption of electric vehicles (EVs) and a broader industry-wide trend favoring environmentally-conscious solutions. The dual benefit of reducing carbon footprints and meeting heightened sustainability standards positions dry transformers, including traction transformers, as pivotal components in driving the future of eco-friendly and efficient energy solutions. Hitachi Energy’s success in this arena not only underscores its technological prowess but also reflects its adeptness at aligning with and driving the transformative trends in the evolving landscape of energy infrastructure. What is the current extent of Hitachi Energy India’s localization with respect to transformers, especially for highly specialized transformers like HVDC converter transformers, etc.? Hitachi Energy’s commitment to localizing its operations in India, particularly in transformer manufacturing, reflects a strategic alignment with the ‘Make in India’ for India and the world. The company has achieved significant localization, notably for highly specialized transformers like HVDC converter transformers. Hitachi Energy India has over the years developed capability to design, manufacture, test and supply wide variety of transformers and shunt reactors locally at Vadodara and Savli facilities. Having built a solid foundation through its presence in India by supplying high-end products that meet today’s complex grid requirements. The company has gained significant experience to add niche application products such as HVDC converter transformers which are highly complex to design, manufacture, process, and test. We have done a commendable job in this segment by producing and commissioning a number of HVDC converter transformers like- first of its kind “multi-terminal 800kV HVDC projects — Northeast–Agra and Raigarh–Pugalur —for Power Grid Corporation of India Ltd.","filter_flag":1}
{"title":"ASEAN+3 Macroeconomic Research Office - ASEAN+3 Macroeconomic Research Office","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vYW1yby1hc2lhLm9yZy9icnVuZWktZGFydXNzYWxhbS1lY29ub21pYy1yZWNvdmVyeS1pcy11bmRlcndheS1idXQtcmVtYWlucy11bmV2ZW4v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vYW1yby1hc2lhLm9yZy9icnVuZWktZGFydXNzYWxhbS1lY29ub21pYy1yZWNvdmVyeS1pcy11bmRlcndheS1idXQtcmVtYWlucy11bmV2ZW4v0gEA?oc=5","id":"CBMiWWh0dHBzOi8vYW1yby1hc2lhLm9yZy9icnVuZWktZGFydXNzYWxhbS1lY29ub21pYy1yZWNvdmVyeS1pcy11bmRlcndheS1idXQtcmVtYWlucy11bmV2ZW4v0gEA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vYW1yby1hc2lhLm9yZy9icnVuZWktZGFydXNzYWxhbS1lY29ub21pYy1yZWNvdmVyeS1pcy11bmRlcndheS1idXQtcmVtYWlucy11bmV2ZW4v0gEA?oc=5\" target=\"_blank\">ASEAN+3 Macroeconomic Research Office<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ASEAN+3 Macroeconomic Research Office<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ASEAN+3 Macroeconomic Research Office - ASEAN+3 Macroeconomic Research Office","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vYW1yby1hc2lhLm9yZy9icnVuZWktZGFydXNzYWxhbS1lY29ub21pYy1yZWNvdmVyeS1pcy11bmRlcndheS1idXQtcmVtYWlucy11bmV2ZW4v0gEA?oc=5\" target=\"_blank\">ASEAN+3 Macroeconomic Research Office<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ASEAN+3 Macroeconomic Research Office<\/font>","source.href":"https:\/\/amro-asia.org","source.title":"ASEAN+3 Macroeconomic Research Office","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Image: Rostasedlacek \/ Shutterstock.com SINGAPORE, December 13, 2023 – Brunei’s economic recovery is underway with the non-oil & gas sector continuing to show positive performance driven by the services sector, reflecting robust activities in the finance and transport subsectors, as post-pandemic recovery gains traction. In contrast, rejuvenation effort in the oil and gas (O&G) sector has proven to be more challenging thus far but is expected to contribute to an improved production in the near future. In the downstream industry, prospects remain positive, with planned diversification into other new products, lending support to growth in the near term. In the longer term, the government remains committed to diversifying the economy toward a sustainable and low-carbon economy. This preliminary assessment was made by the ASEAN+3 Macroeconomic Research Office (AMRO) after its Annual Consultation Visit to Brunei Darussalam from November 21 to 28, 2023. The mission was led by AMRO Deputy Group Head and Senior Economist, Anthony Tan. AMRO Director, Kouqing Li, and Chief Economist Hoe Ee Khor also participated in the policy meetings. The discussions mainly focused on recent developments and outlook in the post-pandemic new normal, spillover risks from higher-for-longer global interest rate environment, longer-term development challenges, as well as policy priorities. Economic developments and outlook “Growth is expected to come in at 0.2 percent in 2023, before strengthening to 2.4 percent in 2024, led by the non-O&G sector. The robust activities in the agri-food, finance, transportation, and tourism subsectors are expected to offset the slow activities in the upstream O&G production. said Mr. Tan. “The expansion of activities in the downstream oil refining sector will also support growth.” Headline inflation has decelerated to 0.6 percent in the first seven months of 2023, reflecting lower commodity prices and post-pandemic supply chain normalization. Inflation is estimated at around 1.0 percent, on average, in 2023 and 2024, declining from 3.7 percent in 2022. The balance of risk is tilted to the upside, considering the effects of El Niño, which could lead to higher food prices in the region. The external position remains strong, with sustained balance of payment (BOP) surplus in 2022. The positive BOP reflects the widening of the current account surplus to 19.6 percent of GDP, driven mainly by the surge in energy prices which offset the lower volume of exports. In 2023, the current account surplus is expected to be sustained, albeit narrowing to 15.3 percent of GDP, given the softer export outlook in both upstream and downstream O&G sectors. Higher oil revenue has helped restore buffers, with a better-than-expected fiscal surplus of 1.3 percent of GDP in fiscal year 2022. Looking ahead, the overall fiscal position in fiscal year 2023 is estimated to weaken to a deficit of around 9.3 percent of GDP, mainly from lower oil prices compared to last year. Risks, vulnerabilities and challenges The risks and challenges confronting Brunei are largely unchanged. A sharp decline in global energy prices and a recession in Brunei’s major trading partners are deemed as tail risks that would derail its growth prospects, strain the external balance and worsen the fiscal position. In the longer term, challenges stem from a potential setback to economic diversification as some domestic growth engines, including the tourism sector, could take longer to recover from the pandemic, as well as risks from climate change transition. Policy recommendations Beyond the immediate terms of trade gains, the authorities are encouraged to strengthen sustainability of Brunei’s fiscal position. This would require the development of a strong public financial management system, which would then pave the way for the adoption of credible medium-term fiscal frameworks to provide forward guidance on fiscal policy. The authorities are also encouraged to undertake necessary preparations, including strengthening of capacity, in order to carry out the planned revenue and expenditure reforms. In the financial sector, it would be prudent to strengthen financial surveillance and risk monitoring, particularly on financial institutions’ cross-border lending and exposures to market risks. Proactive steps to enhance banking sector risk management through the introduction of liquidity risk management guidelines and the liquidity coverage ratio framework are welcomed. The currency board arrangement with Singapore continues to play a key role in anchoring macroeconomic and financial stability in Brunei. While notable progress has been made to strengthen the diversification into non-O&G sector, there is room to expedite the growth of other priority sectors, including food, tourism, and information and communication technology. In parallel, the authorities are also encouraged to address structural challenges in the labor market, as well as to strengthen the capacity of MSMEs (such as in the area of digital adoption), in order to respond to the changing industry demand. While comprehensive strategies and performance indicators have been identified to achieve the national climate objectives by 2035, more efforts are warranted to achieve the ambitious net zero target. In the energy sector—the largest source of carbon emissions—can leverage on mitigation technologies (such as carbon capture) in order to reduce the environmental impact, while fostering a more sustainable energy future. AMRO would like to express its gratitude to the Bruneian authorities and other participating organizations for their cooperation and candid exchange of views. The strong support from the authorities and the excellent arrangement have allowed the successful completion of this mission. About AMRO The ASEAN+3 Macroeconomic Research Office (AMRO) is an international organization established to contribute toward securing macroeconomic and financial resilience and stability of the ASEAN+3 region, comprising 10 members of the Association of Southeast Asian Nations (ASEAN) and China; Hong Kong, China; Japan; and Korea. AMRO’s mandate is to conduct macroeconomic surveillance, support regional financial arrangements, and provide technical assistance to the members. In addition, AMRO also serves as a regional knowledge hub and provides support to ASEAN+3 financial cooperation. AMRO Director, Kouqing Li and Chief Economist, Hoe Ee Khor met with Ministry of Finance and Economy Acting Directors, Aidil Yusrie bin Shari (far left) and Sharifah Amalina Murad (second from left), and Acting Accountant General, YM Pengiran Hajah Noorasiah Binti Pengiran Mohd Hassan (third from left). AMRO Director, Kouqing Li and Chief Economist, Hoe Ee Khor met with Brunei Darussalam Central Bank Assistant Managing Director, Hajah Mahani binti Haji Mohsin (far left) and Deputy Managing Director, Rashidah Sabtu (second from left).","filter_flag":1}
{"title":"National vision for engineering biology - GOV.UK","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L3B1YmxpY2F0aW9ucy9uYXRpb25hbC12aXNpb24tZm9yLWVuZ2luZWVyaW5nLWJpb2xvZ3kvbmF0aW9uYWwtdmlzaW9uLWZvci1lbmdpbmVlcmluZy1iaW9sb2d50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L3B1YmxpY2F0aW9ucy9uYXRpb25hbC12aXNpb24tZm9yLWVuZ2luZWVyaW5nLWJpb2xvZ3kvbmF0aW9uYWwtdmlzaW9uLWZvci1lbmdpbmVlcmluZy1iaW9sb2d50gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L3B1YmxpY2F0aW9ucy9uYXRpb25hbC12aXNpb24tZm9yLWVuZ2luZWVyaW5nLWJpb2xvZ3kvbmF0aW9uYWwtdmlzaW9uLWZvci1lbmdpbmVlcmluZy1iaW9sb2d50gEA","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L3B1YmxpY2F0aW9ucy9uYXRpb25hbC12aXNpb24tZm9yLWVuZ2luZWVyaW5nLWJpb2xvZ3kvbmF0aW9uYWwtdmlzaW9uLWZvci1lbmdpbmVlcmluZy1iaW9sb2d50gEA?oc=5\" target=\"_blank\">National vision for engineering biology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GOV.UK<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"National vision for engineering biology - GOV.UK","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3Lmdvdi51ay9nb3Zlcm5tZW50L3B1YmxpY2F0aW9ucy9uYXRpb25hbC12aXNpb24tZm9yLWVuZ2luZWVyaW5nLWJpb2xvZ3kvbmF0aW9uYWwtdmlzaW9uLWZvci1lbmdpbmVlcmluZy1iaW9sb2d50gEA?oc=5\" target=\"_blank\">National vision for engineering biology<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GOV.UK<\/font>","source.href":"https:\/\/www.gov.uk","source.title":"GOV.UK","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Ministerial foreword Engineering biology is a truly transformative technology. In every corner of the country, our best and brightest innovators are pioneering new solutions across industries that will make future generations healthier, more prosperous and live more sustainably. Biological sciences have always been a UK strength. It was this country that produced the minds who discerned the theory of evolution, discovered the structure of DNA , and invented how to read its sequence. Recent progress is similarly exciting. Our scientists have made leading contributions to the Human Genome Project, developing mRNA vaccines to fight COVID, and designed the smallest, highest-accuracy devices capable of long reads of DNA . Today, engineering biology is powering the next revolution in biological sciences. Applications of engineering biology are highly diverse and will change our world. In healthcare we have seen incredible advances, from gene therapies to new vaccines to organs grown from scratch, with the potential that one day we may not need donors. Advances in agritech include new pesticides that reduce environmental harm and foods that are more nutritious and easier to grow. They can improve our food security, helping tackle one of our great global challenges . Engineering biology can also deliver a more sustainable chemical industry, drastically reducing the use of petrochemicals for the manufacture of products such as textile dyes and low carbon fuels. The potential is enormous, and the UK has a leading role to play. In 2023, the Prime Minister formed the Department for Science, Innovation and Technology ( DSIT ) with a simple mission: making the UK a science superpower by creating the most innovative economy in the world. At the centre of this mission are 5 critical technologies for which the UK is perfectly positioned to lead the world: engineering biology, quantum technologies, AI , semiconductors and future telecommunications. We expect these technologies to grow ever more intertwined, with each bolstering the other. As engineering biologists make use of a wider range of tools, they will supercharge innovation and growth across our science and tech sectors. Thanks to our research institutions the UK is already one of the leading countries in the world in engineering biology. As the sector matures, we can see an increasing pipeline of fundamental research being translated into real-world applications. Government support, a progressive regulatory framework and an openness to private investment has also been an important part of this story. The UK is not alone in recognising the importance of engineering biology. Research is accelerating in many countries. The US has announced a $2 billion package and nations including China, France, Germany, Japan, Singapore, Israel and Denmark are also making engineering biology a strategic priority. This global momentum creates new opportunities for collaboration as well as healthy competition, increasing the need for the UK to act with pace. In this Vision, we set out how government, under DSIT ’s leadership, will continue to build-up engineering biology to cement the UK’s place as a world leader in the field. I look forward to collaborating with partners across government to help realise our ambitions because we can only unlock the promise of engineering biology if we do so together. At the heart of this Vision are the people who make our sector great, whether they are university post-graduates at the lab bench, process engineers perfecting industrial techniques, or apprentices learning the fundamentals of bioprocessing. Our shared endeavour will give us innovative new products, more resilient and secure supply chains and more sustainable manufacturing – all while growing the economy and creating well-paid, high-skilled jobs here in the United Kingdom. We have engaged widely with the UK’s engineering biology community and their input has been instrumental to this Vision. I would like to thank all who contributed. This is only the beginning; the UK’s engineering biologists have much more to give, and we will be with you every step of the way. Andrew Griffith MP Minister of State for Science, Research and Innovation Executive summary The accelerating pace of science and technology breakthroughs is creating huge opportunities for the UK as a global hub of R&D , innovative start-ups, pro-growth regulation and industrial adoption. The world urgently needs transformational innovations to tackle the global challenge of sustainable economic development. With growing pressure on global resources, and increasingly competitive geopolitics and supply chains, the UK’s science and technology strengths are increasingly key to our economic security and resilience. This Vision responds to our call for evidence on engineering biology[footnote 1]. It reflects what we heard about the UK’s strengths, challenges and opportunities. It defines government’s collective ambition for engineering biology and sets the direction in which government investment, policy and regulatory reform will deliver through the strands of the Science and Technology Framework. Following this Vision, we will work across government to develop a clear plan of action. The UK Science and Technology Framework sets out our goals for science and technology through to 2030. It commits to harnessing systemic levers to ensure that we deliver: signalling UK strengths, investing in R&D , increasing UK talent and skills, improving investment in UK Science and Technology companies, using government procurement to pull through new technology, maximising our international opportunities, improving access to digital and physical infrastructure, taking opportunities through regulation and standards, and building an innovative public sector. The Framework also outlines how the whole of government is accountable for pursuing and achieving strategic advantage across 5 critical technologies: artificial intelligence, future telecommunications, semiconductors, quantum technologies and engineering biology. Engineering biology is the application of bioscience. It harnesses our understanding of the mechanisms of biological systems in cells, organisms even populations for industrial and economic benefit. It combines techniques developed in the biological sciences with technologies such as AI and robotics and as a result science has increasing abilities to both ‘read’ and ‘write’ DNA cost-effectively. The fundamental challenge engineering biologists face is predicting and controlling biology with the precision needed for industrial-scale production. When that challenge can be met, engineering biologists will be able to create organisms which yield therapies, food, chemicals and fuels. The technology can drive economic growth while contributing to national security, resilience and preparedness. Government defines engineering biology as the design, scaling and commercialisation of biology-derived products and services that can transform sectors or produce existing products more sustainably. It draws on the tools of synthetic biology to create the next wave of innovation in the bioeconomy. This broad definition allows government to consider not just the underpinning technology of engineering biology but its application across sectors. This is critical to ensure that engineering biology is ‘pulled’ through to application as much as it is ‘pushed’ by lab-based discovery. Engineering biology supports key government policy objectives. The Department of Health and Social Care, for example, are using it to improve patient outcomes with personalised therapies for cancer and new mRNA -based vaccines. The Department for Environment, Food and Rural Affairs see potential for improving food security and protecting the environment with pest-resistant crops (reducing pesticide use) and alternative proteins (reducing pressure on land use for pasture). The Department for Business and Trade, the Department for Energy and Net Zero, the Department for Transport and the Ministry of Defence are considering how goods can be manufactured more sustainably: chemicals, fuels and materials can be biomanufactured from waste, increasing supply chain resilience by reducing petrochemical use and expanding the circular economy. The Home Office and Cabinet Office understand that engineering biologists can prepare us for biosecurity risks by helping us to understand, detect, prevent and respond to biological threats which are linked both to natural and human activity. The Foreign, Commonwealth and Development Office have international priorities across many of these areas. This is a pivotal moment for engineering biology. Global leaders are ramping up efforts to grow their sovereign bioeconomy capabilities and capture the economic benefits. The US and China have made ambitious statements of intent, and our international peers are investing significant sums to carve out strategic positions in the emerging global bioeconomy. At the same time, there is increasing recognition that countries need to apply engineering biology predicably, safely and responsibly to capture its full economic and societal potential for their populations. Engineering biology is a dual-use technology, and all governments will need to adopt sensible, proportionate precautions. Our vision for engineering biology Government’s vision is for the UK to have a broad, rich engineering biology ecosystem that can safely develop and commercialise the many opportunities to come from the technology and the underlying science. We aim to capture as much economic value, security, resilience and preparedness as possible from our hard-won strengths and ensure these create real benefits for the public. Government will focus on 6 priorities to achieve this: world-leading R&D , infrastructure, talent and skills, regulations and standards, take up by the broader economy, and responsible and trustworthy innovation. For each of these areas, DSIT has already started convening partners across government and our arms-length bodies to understand the challenges and opportunities and to identify the support government should provide. The UK’s global offer will be an engineering biology ecosystem open to ideas, private investment, talent and trade. It will be underpinned by public investment, supportive infrastructure, enabling regulation and standards, open markets, and a culture of responsible and trustworthy innovation. Building on strong foundations The UK has a unique legacy of discovery and expertise in biological sciences, from the structure of DNA to the first cloned animals to more recent advances in fields such as mRNA vaccines. UK researchers are developing engineered organisms for application in healthcare, agriculture and food, low carbon fuel production, chemicals, materials and the environment. Our research institutions are producing advances which are driving the development of the discipline. Looking ahead, convergence with technologies such as AI will accelerate the ‘design-build-test-learn’ cycle through which advances in engineering biology are achieved. These research outcomes are the product of the talent and skills of our scientists and the universities and research institutions in which they work. Students can study at 44 universities providing biotechnology bachelor’s and post-graduate degrees. Early-career engineering biologists are further supported, through training and mentoring initiatives and networking opportunities, to establish scientific careers or to become entrepreneurs. Education and research in our universities is one part of a much bigger ecosystem of engineering biology innovation. Collectively, engineering biology firms have fundraised over £5.2 billion between 2017 to 2022, third in the world after the US and China. The UK’s R&D infrastructure has been critical in moving engineering biology innovation out of the lab into industry. Government has supported the Centre for Process Innovation, the national biofoundries, and SynbiCITE over the last decade. Our globally recognised regulators and standards institutions also play a critical role. Together with the National Quality Infrastructures institutions, they can give confidence to businesses, consumers, and investors. A final critical underpinning of the UK’s engineering biology ecosystem is a culture of responsible research and innovation. The sector’s development was shaped by the 2010 Synthetic Biology Dialogue, which identified the concerns and aspirations of the field[footnote 2]. Our innovators use UKRI ’s Anticipate, Reflect, Engage, Act framework to consider the impact of their work on the public[footnote 3]. This year, the UK Biological Security Strategy committed us to becoming a world leader in responsible innovation in engineering biology. All these components are critical to the health the UK’s engineering biology ecosystem. Taken together, they support one of the world’s strongest bioeconomies. A 2021 McKinsey on ‘biotechnology’ said the UK boasts companies and venture capital in greater quantity than any other European nation[footnote 4]. Our objectives A new Engineering Biology Steering Group will bring together both the current and the next generation of academic, start-up and industry leaders in engineering biology working in the UK. World-leading R&D : We will target public investment towards world-class R&D on the critical challenges and foundational research that will enable innovation breakthroughs and the creation of new products. We will invest £2 billion over the next 10 years in engineering biology. Infrastructure: We will invest in UK infrastructure to reduce the costs of both the early stages of engineering biology innovation, and its scale-up. We will develop a plan for UK facilities supporting start-ups and scale-ups. Talent and skills: We will grow and retain a diverse talent pool within the UK to match demand from academia and industry, covering scientific, technical and entrepreneurial skills. We will invest in fellowships and doctoral training including the new Discovery Fellowships. Regulation and standards: We will work across government and with all relevant regulatory bodies to ensure that the UK’s regulatory landscape will help engineering biology-derived products to reach the market. Using the new Engineering Biology Regulators’ Network, government will implement a set of regulatory sandboxes to create pathways for this to happen. Adoption in the wider economy: We will foster a cohort of investors and customers who are well-informed about engineering biology’s potential, and a pipeline of firms who understand potential customers’ priorities. We will hold a showcase of the most exciting engineering biology firms. Government sector teams will raise awareness of engineering biology across their sectors to ensure the pull through of products and services. Responsible and trustworthy innovation: We will make the UK a world leader in responsible innovation by 2030. Government will lead an open dialogue on the benefits, challenges and risks of the technology, encouraging a renewed commitment to responsible research and innovation. We will work with allies and partners to shape international norms and standards, including through multilateral forums. We will work across government to develop a clear plan of action for delivering this Vision and objectives. Introduction The Science and Technology Framework In March 2023 the government published the Science and Technology Framework which sets out our approach to making the UK a science and technology superpower by 2030. The framework focuses on 10 strands: identifying critical technologies signalling the UK’s strengths and ambitions investment in R&D talent and skills financing innovative science and technology companies procurement international opportunities access to physical and digital infrastructure regulation and standards an innovative public sector Within the framework government identified 5 critical technologies for the UK that will deliver prosperity and security for the UK and deliver benefits to global society: Artificial Intelligence ( AI ) – machines that perform tasks normally performed by human intelligence, especially when the machines learn from data how to do those tasks. – machines that perform tasks normally performed by human intelligence, especially when the machines learn from data how to do those tasks. Engineering biology – the application of rigorous engineering principles to the design of biological systems. – the application of rigorous engineering principles to the design of biological systems. Future telecommunications - evolutions of the infrastructure for digitised data and communications. - evolutions of the infrastructure for digitised data and communications. Semiconductors – a class of electronic materials with unique properties that sit at the heart of the devices and technology we use every day. – a class of electronic materials with unique properties that sit at the heart of the devices and technology we use every day. Quantum technologies – devices and systems which rely on quantum mechanics, to provide capabilities that ‘classical’ machines cannot. Government committed to use the levers set out in the framework to support these technologies and allow them to flourish. We need to understand how these levers need to be applied to tackle the unique challenges facing each individual technology. This document sets out the government’s understanding of these challenges, informed by a call for evidence held in summer 2023. It then sets out our vision and ambition for tackling these challenges, and our priorities for delivering through the strands of the framework. Our view of engineering biology Engineering biology comes from understanding the building blocks of life better than ever before. Our ability to ‘read’ and ‘write’ DNA , and to predict and control its function within organisms, is progressing at an extraordinary pace while becoming increasingly accessible. In its application, engineering biology is driving progress across the bioeconomy. It can transform existing sectors and supply chains, such as replacing petrochemical feedstocks to products. It can create entirely new sectors, such as personalised biotherapies or carbon capture and usage. In doing so, it can solve global issues such as sustainability and global health challenges, as well as help secure the UK’s safety, resilience and supply chains. Government defines engineering biology as the design, scaling and commercialisation of biology-derived products and services that can transform sectors or produce existing products more sustainably. It draws on the tools of synthetic biology to create the next wave of innovation in the bioeconomy. Engineering biology supports objectives across government A huge range of applications have been identified for engineering biology. From these the government sees the significant economic opportunities for the UK in health, agriculture and food, chemicals and materials and low carbon fuels (see Figure 1 below). Altogether, they could achieve $2-4 trillion globally of economic impact per year within the next 2 decades. Health alone could reach $1.2 trillion per annum. But beyond this, applications across agriculture, food, chemicals and energy could reach $1.5 trillion in global economic impact per annum[footnote 5]. Health alone could reach $1.2 trillion per annum. But beyond this, applications across agriculture, food, chemicals and energy could reach $1.5 trillion in global economic impact per annum. Engineering biology can also increase our national security, resilience and preparedness. All these applications share similar underpinning technologies. Engineering biology is powered by the convergence of several technology trends. Firstly , the rapidly falling cost and access to DNA sequencing has allowed for the assembly of large bioinformatic data sets. The UK’s Oxford Nanopore has pioneered handheld nucleotide sequencing devices of superior sequence accuracy and length. Secondly, the deployment of computational power, AI and machine learning on these datasets has allowed researchers to predict the relationship between DNA sequence, protein folding and, ultimately, protein functions. Tools such as DeepMind’s AlphaFold were developed in the UK for this purpose. Thirdly, an ability to write custom DNA sequences cost-effectively. UK firms like Evonetix and Touchlight are making major advances in synthesising DNA at greater lengths and larger volumes. Finally, powerful gene editing techniques such as CRISPR-Cas9 will empower new innovations. UK innovators were early adopters of these techniques, particularly in plant and mammalian cells. Health In health, engineering biology has been central to driving innovation especially in the last 25 years. It carries the potential for improved patient outcomes through more precise, personalised therapies such as CAR-T cancer therapy, and in cutting edge developments such as artificial organs and smart drugs. Government, through the Department of Health and Social Care and DSIT , is collaborating on mRNA vaccines and therapies with Moderna and BioNTech as well as investing in earlier diagnostics in Precision Medicine and targeted immunotherapies through the Cancer Mission. Centres of excellence, such as the CPI Medicines Manufacturing Innovation Centre, are also providing key opportunities for government to partner with industry, academia, regulators and the healthcare sector to accelerate the development and adoption of this innovation. Internationally, the UK government are funding a number of life sciences projects across drug discovery, genomic surveillance and vaccine development. This includes the FCDO -Wellcome funded Joint Initiative on Research in Epidemic Preparedness and Response ( JIREP ). Agriculture and Food In agriculture and food, Defra’s Genetic Technology (Precision Breeding) Act 2023 has unlocked opportunities to apply engineering biology for farmed plants and animals with greater resistance to pests, disease, and environmental challenges. This will strengthen the resilience of our food supply and improve health of our natural environment. New veterinary vaccines and diagnostics are also in development that will provide tools against high priority animal pathogens, such as avian flu, enabled by engineering biology. Furthermore, the tools of engineering biology are being used for the development and manufacturing of alternative proteins, including cell-cultivated protein (also known as ‘cultivated meat’). The Food Standards Agency recently completed a review of its Novel Foods Regulatory Framework and is considering how reform of legislation, frameworks and processes could remove barriers to innovation, including for cell-cultivated protein, while maintaining the UK’s excellent regulatory integrity. Internationally, the UK has co-funded the Consultive Group for International Agricultural Research ( CGIAR ) Programme: Accelerating Crop Improvement Through Genome Editing. Chemicals and materials Engineering biology can create existing chemicals and materials more sustainably, as well as entirely new chemicals that are difficult to create through chemistry alone. The Department for Energy and Net Zero, the Department for Business and Trade and the Department for Environment Food and Rural Affairs are considering how sustainable biomass can be used to reduce the carbon emissions of the chemicals sector. This includes how the economy can use waste streams in a more economical way, creating a circular carbon bioeconomy. The Ministry of Defence is also investigating the potential of engineering biology derived materials to overcome current physical limitations of equipment and supply chain shortages. Low carbon fuels Engineering biology can create new supplies of low carbon fuels that can be used for aviation as well as in cars. The Department for Transport have invested £25 million into LanzaTech UK’s new facility in Port Talbot which will convert steel mill off-gases into ethanol and then uses alcohol-to-jet technology to produce sustainable aviation fuel. The Ministry of Defence has also invested into Manchester-based C3 Biotech, whose aviation fuel was used to fly an RAF drone. National security, resilience and preparedness Engineering biology will be increasingly critical in achieving national resilience and preparedness for biological risks. It can help us prepare for, detect and mitigate both natural and human threats. When accidentally or deliberately misused, engineering biology can present significant global social and economic risk. The 2023 Biological Security Strategy sets out the actions that the UK must take to mitigate the risks of biological threats, including setting policy for responsible innovation in engineering biology that manages risk without stifling growth. Biosecurity policy is the responsibility of multiple government departments and is coordinated by the Cabinet Office. The Home Office is responsible for preventing biological risks from emerging (where possible) or from threatening the UK and UK interests. Figure 1: illustration of engineering biology’s areas of application, with some key UK firms highlighted The UK has significant strengths in engineering biology The UK is a leader in engineering biology; thanks in part to early, forward-thinking investment by government over the last decade, and the strengths of our biopharmaceutical sector[footnote 6]. This significant public investment in R&D in engineering biology is continuing with our recent announcement of a further £73.6 million for Engineering Biology Missions and Hubs. The UK excels in foundational research for engineering biology, as shown in our quantity, quality and breadth of capabilities (Figure 2). The UK ranks fifth for the number of engineering biology research publications: behind China, the US and India, and very narrowly behind Germany[footnote 7]. Among the top 10 nations producing engineering biology scholarly outputs across 2018-22, the UK ranks fourth for the impact of its engineering biology research[footnote 8]. Figure 2: Scholarly outputs and research impact for the top 10 countries producing engineering biology publications (2018 to 2022) Source: Government Office for Science developed keyword search adapted by DSIT for the SciVal database. Country Scholarly output China 24,521 United States 19,682 India 10,370 Germany 5,886 United Kingdom 5,505 Japan 4,072 South Korea 3,556 Italy 3,004 Spain 2,821 Iran 2,779 Country Field Weighted Citation Impact Italy 1.64 Iran 1.62 South Korea 1.56 United Kingdom 1.54 India 1.51 United States 1.50 Germany 1.42 China 1.41 Spain 1.39 Japan 1.09 The UK also has an impressive cohort of engineering biology firms, particularly in health and life sciences, as demonstrated in Figure 3. Figure 3: UK’s engineering biology firms by category (October 2023 Snapshot) Blue bars represent subsectors within the application areas of engineering biology, red bars represent subsectors that are a core part of the supply chain, and the yellow bar represents subsectors in both. These are mapped spatially in Figure 5 later. There are 1,162 engineering biology firms that we have identified and classified. Source: DSIT developed Real Time Industrial Classification using The Data City[footnote 9]. The UK’s strengths can be seen in clusters across the country, from Norwich to Bristol to Edinburgh (see Figure 5 later). These strengths are built around academic and industrial hubs, often enabled by local infrastructure like biofoundries. Collectively, engineering biology firms have fundraised over £5.2 billion between 2017 to 2022[footnote 10]. The United Kingdom leads other European countries in the number of new biotech start-ups and funding for those companies over 2017 to 2022[footnote 11]. The UK ranks third globally in total private investment in engineering biology between 2017 to 2022, behind the US and China[footnote 12]. However, there is an indication that UK firms may struggle to turn these strengths into intellectual property (Figure 4). Figure 4: Number of engineering biology international patent families (IPFs) by inventor country (2010 to 2021) International patent families (IPFs) are families with an application filed in at least 2 authorities. IPFs are a good proxy for inventive activity because they only represent inventions deemed important enough by the applicant to seek protection internationally. Source: UKIPO analysis of PatentSight data. USA 42,544 Japan 11,374 China 9,286 Germany 7,619 South Korea 6,223 United Kingdom 5,541 Switzerland 4,995 France 4,748 Netherlands 3,997 Canada 1,858 The UK research community has an excellent culture of responsible innovation. In 2010, UKRI developed the Synthetic Biology Dialogue that has guided our responsible development and use of synthetic biology. The Biological Security Strategy commits the UK to be a leader in responsible innovation for engineering biology. This involves acknowledging, monitoring and addressing the risks engineering biology can pose, either accidentally or deliberately. Laying the right foundations for responsible innovation will subsequently foster public confidence in the technology and empower citizens to realise the benefits of engineering biology-derived products. The UK is not the only advanced economy to prioritise support for this technology. The US has committed $2 billion for biotechnology and biomanufacturing[footnote 13]. Japan aims to realise “the world’s most advanced bioeconomy” by 2030[footnote 14]. France is spending €800 million to develop and produce biomedicines. China’s most recent 5-Year Plan pledges to “accelerate the development” and “increase the size and strength” of its bioeconomy. And the EU states “biotechnologies and biomanufacturing are key to the competitiveness and modernisation of EU industry”[footnote 15]. This moment of global ambition creates exciting opportunities for cooperation and collaboration, and sometimes also a need to compete to protect the UK’s strategic advantages. Engineering biology cooperation is written into multiple bilateral agreements, including the UK-US Atlantic Declaration, UK-Canada Biomanufacturing Agreement and the UK-Singapore Strategic Partnership. We will build out these agreements and develop new ones with partners around the world. Cooperating in this way creates mutual opportunities to attract investment, mobilise R&D partnerships and secure supply chains. Our vision for engineering biology in the UK In July, we launched a call for evidence and the UK’s engineering biology community has provided us rich insights into the UK ecosystem’s strengths, weaknesses and opportunities. We received 81 responses across the academic and business community (see annex for detail of respondents). For this document we have complemented these responses with insights from the Engineering Biology Leadership Council and the Industrial Biotech Leadership Forum, and from reports by the Prime Minister’s Council for Science and Technology[footnote 16] and the Government Chief Scientific Advisor on regulation[footnote 17]. Government’s vision is for the UK to have a broad, rich engineering biology ecosystem that can safely develop and commercialise the many opportunities to come from the technology and the underlying science. We aim to capture as much economic value, security, resilience and preparedness as possible from our hard-won strengths and ensure these create real benefits for the public. We will invest £2 billion over the next 10 years to deliver this vision. The UK’s global offer will be an engineering biology ecosystem open to ideas, private investment, talent and trade. It will be underpinned by public investment, supportive infrastructure, enabling regulation and standards, open markets, and a culture of responsible and trustworthy innovation. Government’s role is to help innovators in this ecosystem navigate the risks they deal with developing, scaling and commercialising their products. We invest in foundational research to gain the next generation of technologies that will unlock the full economic and societal opportunities of engineering biology. We also support collaborative research and innovation for turning this research into products and viable companies, co-investing with private investors. We oversee, cohere and regulate the markets for the final products, in dialogue with the public. With this Vision, government is looking across all these levers. For DSIT , this means both supporting the underpinning technology and ensuring enabling capabilities for firms developing engineering biology derived products are both in place and accessible in the UK for innovators. For our partnering departments, this means focusing on pulling through to market the applications of engineering biology that will unlock growth in their sectors. This collaboration across government is made possible through the Science & Technology Framework, our approach to making the UK a science and technology superpower by 2030[footnote 18]. Over the coming months government will identify the key actions that we need to take across key departments to deliver on the ambitions of this Vision, addressing the most critical opportunities and challenges for the technology to maintain the UK’s position as a world leader in engineering biology. As a key first step to getting this right, government need to make sure that we are getting the very best expert advice. Over the past decade, the UK government has been expertly supported by the Engineering Biology Leadership Council and the Industrial Biology Leadership Forum. Their advice has been invaluable in supporting policy development. However, as this technology evolves and we develop and deliver our actions, we recognise the need to bring academic and industrial advice into a single forum. As a priority action under this Vision, we will consolidate our sources of advice into a single Engineering Biology Steering Group. The Steering Group will bring together the current leaders of the academic, start-up and industry community, as well as the next generation of innovators. Its membership will reflect the geographic spread of UK strengths and opportunities in engineering biology, and the diverse mix of the UK sector’s participants. It will sit alongside the Biosecurity Leadership Council. Figure 5: Map of companies developing engineering biology applications, or that are part of the supply chain, overlaid with key UK clusters’ capabilities (October 2023 Snapshot) Sources: DSIT companies list developed The Data City Engineering Biology ‘Real Time Industrial Classification’ with subsidiaries; map and annotated clusters adapted from Cambridge Industrial Innovation Policy (2023) Figure 6: Total investment fundraising by private Engineering Biology Firms (2017 to 2022), with notable companies highlighted Source: Go Science-developed keyword search using PitchBook data. World-leading R&D UK engineering biology leadership is built on decades of bold discoveries and scientific expertise. The structure of DNA was discovered at Cambridge and King’s College London. The first mammal was cloned from an adult cell at the Roslin Institute, and pivotal contributions were made to the Human Genome Project by the Wellcome Sanger Institute. Today we are building on that legacy. The Medical Research Council ( MRC ) Laboratory of Molecular Biology has reprogrammed the genetic code to incorporate novel amino acids, increasing the potential of engineering biology to include structures not found in nature. Gene synthesis company Evonetix has achieved gene-length DNA synthesis at benchtop scale, making this revolutionary technology more accessible. Touchlight has developed a DNA -enabled biobattery, a cleaner, greener technology which could significantly outperform lithium batteries. In 2012 the government’s Synthetic Biology for Growth programme committed £70 million to 6 Synthetic Biology Research Centres, alongside other initiatives such as the Centre for Chemical and Synthetic Biology in the MRC ’s Laboratory for Molecular Biology. We have since made further investments through UKRI , including the Defence Science and Technology Laboratory, Defra’s Future of Farming Innovation Programme and the Office for Life Sciences’ novel vaccines programmes. Bristol has a thriving ecosystem for engineering biology, driven largely by a convergence in the strategies of the University of Bristol, UKRI and Bristol’s booming innovation infrastructure. Bristol’s engineering biology community has been supported by UKRI since the late 2000s, including high-value investments in BrisSynBio , one of the UK’s 6 Synthetic Biology Research Centres, and an Oxford-Warwick-Bristol Synthetic Biology Centre for Doctoral Training. These successes led to inward investment by the University of Bristol that helped to establish the Bristol BioDesign Institute and the Max Planck-Bristol Centre for Minimal Biology. The cutting-edge facilities provided via Bristol Centre for Synthetic Biology ( BrisSynBio ) supported 50 academics and 60 post-doctoral researchers and led to the publication of more than 400 papers[footnote 19]. Bristol’s engineering biology community has entrepreneurial spirit, and some of the university’s world class science and technology has been spun out into companies solving global challenges in healthcare, food security and industrial biotechnology. Eight University of Bristol spin-outs have collectively raised over £18 million and employ 55 people[footnote 20]. Bristol’s local bioeconomy is booming. Its Science Creates ecosystem comprises: 2 state-of-the-art deep-tech incubators that 41 start-ups call home; a venture capital fund, SCVC, investing in game-changing companies; and a STEM outreach charity inspiring the scientists and entrepreneurs of the future. In 2023 the Science Creates ecosystem surpassed a Gross Value Added ( GVA ) of £125 million per year and employs 370 people across the UK; while hosting the first UK-wide Engineering Biology Accelerator run in partnership with UKRI [footnote 21]. Support to foundational research and development is a critical part of our engineering biology policy. It ensures that UK scientists stay at the forefront of creating and adopting new technologies, including through convergence with other technologies such as AI . Entirely new engineering biology tools will come from building our understanding of how to rapidly, accurately and cost-effectively build DNA sequences and to predict the function of the proteins they encode. As these tools get more sophisticated, so will the applications they inspire. Government is supporting research with a £73 million investment in engineering biology missions and hubs to pull through new applications to tackle global challenges. To inform our next steps, we asked you about the technical opportunities and challenges of the field and sector, the UK’s institutional landscape, and the UK’s strengths and weaknesses in engineering biology and its applications. What you told us The successful convergence of engineering biology, AI , bioinformatics and automation was overwhelmingly seen as the most important area of scientific and technical advancement. These technologies are being applied in molecular prediction and design, for in silico design, and to understand cell behaviours. They will reduce the time from ‘invention to commercialisation’ for engineering biology-derived products, possibly to under 5 years. Data harmonisation will be a critical enabler of this change. Standardisation of protein structures enabled DeepMind to develop AlphaFold, an AI system that predicts protein structures. Respondents suggested leaps of progress would be possible if data was standardised for protein function, transcription, biochemistry, metabolomics, fermentation, and life-cycle and techno-economic analyses. Respondents were clear about the need to validate and verify AI models used in engineering biology and noted the need to consider the ethics of AI . The underpinning tools of engineering biology will continue to evolve, including our understanding of new and complicated biological systems. New tools will be more flexible and have greater applicability in the lab and will increasingly be able to target more complex traits and specific tissues. The evidence showed that the UK has significant strengths across fundamental research and is highly interdisciplinary. A quarter of respondents cited our leading research institutes and a talented pool of academics with some of the world’s brightest and most imaginative minds. Our sector was also seen as unusually well networked – as it grows, this co-ordination must be maintained and even enhanced. We are also internationally influential, with UK academics among the leading voices in groups such as the Global Biofoundry Alliance and the US’s Engineering Biology Research Consortium. The Edinburgh Genome Foundry ( EGF ) is a world class, one-of-a-kind facility. It was created through funding from the Synthetic Biology for Growth programme to provide end-to-end design, construction and validation of genetic constructs for academia and industry. The EGF is one of the most highly automated DNA assembly platforms in the world and as a result is reliable, high-throughput, and cost-effective for repetitive tasks. It is 1 of 5 UK members of the 35-strong Global Biofoundries Alliance, and a member of the International Gene Synthesis Consortium. The core staff and running costs are supported by the University of Edinburgh. They offer services in several fundamental areas for engineering biology, such as the modular assembly of DNA constructs. These constructs equip organisms with novel functionality. This can mean programming stem cells for use in personalised medicine, vaccine development, gene therapies (including viral vector based) and living biosensors and metabolic engineering of microbes to produce high value molecules. The EGF is one of the few facilities on the planet, and the only academic institute in Europe, to operate a Bruker Cellular Analysis Beacon system, acquired through a BBSRC grant. This high-throughput automated cell selection platform allows single cell cloning, analysis, and outgrowth, with FDA-approved verified clonal origins. The EGF offers open access to this powerful platform for both academics and industry. Workflows include Cell Line Development Antibody Discovery and single cell transcriptomics. The EGF offers training to researchers on how to use this equipment to accelerate their work. The EGF also develops its own software for DNA design, laboratory automation, and synthetic biology which are used worldwide and are either open access, open source, or both. Respondents identified investment in R&D as a critical focus area within the Science & Technology ( S&T ) Framework, and said government needs to continue supporting foundational research, even as we increase support to research at higher levels of technology readiness. Critically, respondents identified a need for longer-term funding to enable research to evolve and develop. What we’re going to do about it We will target public investment towards world-class R&D on the critical challenges and foundational research that will enable innovation breakthroughs and the creation of new products. We will continue to support fundamental research alongside downstream innovation. Supporting research which improves our ability to write DNA sequences and predict their function will ultimately inspire new applications and innovations. We will invest £2 billion in engineering biology over the next 10 years. We will use this funding to address the challenges identified in the call for evidence, striking a careful balance between supporting fundamental research while supporting its translation into applications with economic value. Given the increasing interaction between engineering biology and other fields we will also drive multidisciplinary research that will benefit from the convergence of fields including AI \/machine learning and automation. This year the government announced the AI Life Sciences Accelerator Mission, a £100 million fund to bring academia, business and the NHS together to drive AI uptake in life sciences. We will continue to cohere R&D investment under the National Engineering Biology Programme. As with other disciplines, international collaboration in engineering biology tends to yield better research. The UK already excels at this. From 2018 to 2022, 65% of all UK engineering biology publications featured a collaboration with at least one non-UK author (Figure 7). BBSRC recently spent £1.05 million to support 7 collaborative research projects in synthetic biology between the UK and Japan, and since 2015 has spent £11.5 million to support collaborative research projects with the USA in the same area. BBSRC has an ongoing partnership with the National Science Foundation. We will continue to build links around the world, including through our association with Horizon Europe, to create a truly global network of partnerships. Figure 7: International collaboration share for the top 10 countries producing engineering biology publications (2018 to 2022) Source: DSIT analysis of SciVal data using Go Science-developed keyword search. Country Percentage of papers (%) United Kingdom 65.3 Spain 58.7 Germany 54.0 Italy 53.8 South Korea 46.2 United States 41.2 Japan 41.0 India 29.7 Iran 29.7 China 28.6 Infrastructure Growing modified organisms and manufacturing engineering biology-derived products at scale requires specialist infrastructure. This includes laboratory space and tools, fermentation and cultivation facilities, and equipment for downstream processing. The growth of the UK’s engineering biology ecosystem has created greater demand for these facilities, a trend which will continue. Scientists, technicians or engineers whose aim is to apply innovation and bring it to the market need different capabilities to those engaged in fundamental research. For early development, this means accessing specialist facilities to test whether a new tool or product works at the smallest scales. These facilities need to keep pace with the latest innovations to maintain efficient product development cycles. Once innovators have demonstrated proof-of-concept, companies need scale-up facilities to prove their products can be mass manufactured. This is critical if they are to attract investment. In many cases they will need to access bioprocessing (produce products from living organisms) and biorefining (separate and purify organic products from biomass) facilities. Much of this infrastructure is beyond the means of small or medium-size enterprises. This leads them to a ‘valley of death’ where, although they have proven that their product can be manufactured at pilot-scale, they cannot access the investment they need to take it to large-scale manufacture. Firms frequently turn to open access facilities to avoid the cost of building their own pilot infrastructure. These facilities are not widely available and are also often expensive. The Synthetic Biology for Growth programme was successful in establishing lab-scale engineering biology infrastructure in the UK. But our engineering biology ecosystem has evolved, creating gaps which will need to be filled by further capital investment. Critically, solutions that fill these gaps must operate at costs which are affordable to SMEs . These sorts of challenges are not unique to the UK, and infrastructure for engineering biology is a recognised challenge among the leading players. The US Department of Defence will invest $1 billion in domestic biomanufacturing infrastructure over 5 years “to catalyze the establishment of the domestic bioindustrial manufacturing base [for] U.S. innovators”[footnote 22]. South Korea has announced its intention to build a national biofoundry[footnote 23]. We asked for your insights about the full set of capabilities that enable engineering biology in the UK, including small-scale, pilot-scale and mass manufacturing assets. What you told us Two-fifths of respondents highlighted a lack of bioprocessing facilities in the UK below the pharmaceutical grade. They told us that this drives companies to use ‘over-engineered’ equipment which is more expensive than the more basic equipment needed, and in turn leads to unnecessary competition for facilities. Existing institutions provide valuable facilities and infrastructure, but our respondents told us they often lack some required equipment and\/or are too expensive. Food-grade facilities are especially hard to find, particularly fermenters and bioreactors with capacity over 20,000 litres, or in the case of plants, large areas of suitable land. Respondents also wanted more detailed and accessible information about the full range of facilities and equipment which exist. They indicated a need for well-signposted directories detailing suppliers, capabilities and prices. Such a directory should include feedstock data, which some respondents report difficulty accessing. Respondents stated they sometimes deal with UK infrastructure gaps by accessing facilities overseas, with SMEs going abroad to demonstrate proof-of-concept at pilot scale. To grow our engineering biology ecosystem and support the next generation of businesses to achieve longevity, we need to fill the gaps in UK infrastructure. Respondents typically agreed that a single large facility would struggle to cater to the sector’s needs. The range of processes and products to be accommodated at the pilot scale will be hard for one facility to provide. Many respondents would prefer a model in which facilities and infrastructure are distributed across the UK and serve specific technical requirements. Every type of respondent called for localised hubs, which some suggested should be linked to existing biofoundries and clusters. Alongside the range of infrastructure needed to deliver an engineering biology-derived products, companies need access to computational and robotics platforms to enable high-throughput production and automation. Data infrastructure is also critical: access to high quality, standardised data will enable the development of tools and products with higher efficiencies and effectiveness. Respondents also highlighted the need for an increase in the number of skilled individuals who can run and maintain equipment at every scale, and sustainable, long-term funding for this sort of support. What we’re going to do about it We will use UK infrastructure to reduce the costs of both the early stages of engineering biology innovation, and its scale-up. There must be sufficient expertise and capability available to keep firms rooted in the UK even as they expand into global markets. We will develop a plan for UK facilities that supports lab-scale and pilot-scale innovation. We will explore the range of public and private funding models that could increase accessibility. We will consider how to create resilient supply chains to reduce costs, time and complexity in the ecosystem. We will consider the benefits and drawbacks of both distributed and centralised models for open-access facilities. A distributed network could align future infrastructure capabilities with specialisms within the UK’s academic and industrial clusters, as advised by the Council for Science and Technology; it could also exploit the distribution of domestic feedstocks that will be under growing demand, as highlighted by the government’s Biomass Strategy. A more centralised model would concentrate expertise and achieve a scale that might attract regulators and investors. We will learn from examples found overseas, including BioBase Europe (Belgium) and BioMADE (US). Government will also understand how to make existing facilities more relevant, accessible and discoverable, such as through the merger of 3 Agri-Tech Centres where Defra will work with the new Agri-Tech Catapult to identify new opportunities and drive innovation. We will ensure that the forthcoming National Plan for Research Infrastructure responds to the needs of the engineering biology ecosystem. We will track developments in global engineering biology infrastructure through the government’s science, trade and technology network, partnering with UKRI , the Foreign, Commonwealth and Development Office ( FCDO ) and the Department for Business and Trade ( DBT ). Where appropriate, we will support UK stakeholders to develop relationships through which they can access capability, capacity and expertise held overseas. For instance, our Science and Innovation Network, which exists to provide local insights from around the world, has experience in organising fact-finding missions, networking events, site tours and government-to-government engagement. The UK’s flagship facility for scaling bioprocesses is the Centre for Process Innovation ( CPI ), which this year opened a ground-breaking novel foods facility in Wilton. The CPI operates in a range of industries, but for engineering biology they support strain and bioprocess development, modelling and simulation, process engineering design, and downstream processing. Their pilot and demo scale facilities range from 1 millilitre to 10,000 litres and includes some gas fermentation capacity. HydRegen, a spin-out from the University of Oxford developing biotechnologies to improve sustainability in chemical manufacturing, used the CPI during an academic translation project funded via the Industrial Biotechnology Catalyst. The project aimed to transition biotechnologies from academic demonstration to commercial viability by tackling technical and commercial risks. Developing strategies for scalable and cost-efficient enzyme manufacture represented one of the most significant challenges at that time. The productive collaboration with CPI was critical in validating aspects of HydRegen enzyme production, and fundamental to forming the spin-out company and securing private investment. HydRegen has continued to work closely with CPI via Innovate UK-funded projects to provide material for internal R&D , as well as to continue to improve and scale its enzyme production. Talent and skills Talent and Skills is a priority under the UK Science & Technology Framework[footnote 24]. In the Framework, talent refers to influential individuals the UK needs to be able to attract and retain. Skills refers to the scientific, technical or entrepreneurial capabilities needed by the work force. The UK’s bioeconomy requires a workforce with scientific, technical and entrepreneurial skills to support research, product development and commercialisation. Translating research into commercially viable products requires skilled individuals such as process engineers and fermentation scientists who can design, maintain and operate production facilities. A successful firm will need individuals who can confidently handle funding, investment and marketing. Unleashing the full potential of the UK’s engineering biology ecosystem means stocking it with talent at all levels and experience, from early-career apprentices to distinguished scientists. Leading nations are investing in their engineering biology workforces. The US National Institutes of Health is expanding its I-Corps programme, a biotech entrepreneurship programme, and its Department of Agriculture has announced a $68 million investment in training the next generation of research and education professionals[footnote 25]. A $92 million investment by the Canadian government in its life sciences sector (which includes many companies using the tools and techniques of engineering biology) supports company creation, scale up and training activities[footnote 26]. Like our international partners, the UK government recognises the need to build an agile and responsive engineering biology skills system. The UK has a wealth of scientific talent and a budding culture of entrepreneurialism in its engineering biology sector. To understand how to build on these strengths, we asked about technical and non-technical skills for developing, scaling and commercialising engineering biology-derived products, and how well various support mechanisms and skills programmes are working. What you told us We asked which of the priorities set by the Science & Technology Framework mattered most to the engineering biology community. Respondents said ‘Talent and Skills’ was their second-highest priority. This was especially true for academics. We asked respondents to name the key technical and non-technical skills for developing, scaling and commercialising engineering biology-derived products. This question did not ask about the current availability of these skills in the workforce. As seen in Figure 8, 41% of respondents said fundamental biology knowledge and practical expertise were key to engineering biology. 92% also named at least one interdisciplinary skill such as analysis, business, computation, AI \/machine learning and automation. 32% raised the importance of communication and collaboration across disciplines. Commonly cited skills specific to scale-up and manufacturing included fermentation science and bioprocessing expertise. Figure 8: frequency of skills mentioned by respondents to the call for evidence, grouped by skill type Scientific Scientific - frequency of skills mentioned Drug development\/discovery 1% Assay development 2% Food science 4% Biophysics\/physics 6% Mathematics 6% Engineering 11% Chemistry 19% AI \/ ML 19% Fermentation 19% Analytical skills 20% Computational skills 25% Fundamental biology\/molecular biology 41% Entrepreneurial Entrepreneurial - frequency of skills mentioned Decision making 1% Product development 4% Finance 9% Management 12% Legal 14% Regulatory 15% Business 20% Technical Technical - frequency of skills mentioned Downstream processing expertise 9% Robotics and automation 10% Life cycle analysis and sustainability expertise 10% Process\/Plant engineers 10% Bioprocessing expertise 17% Other Other - frequency of skills mentioned Ethical\/social responsibility 7% Communication and collaboration skills 32% Respondents highlighted the UK’s strength in academia, citing our world class universities and PhD programmes. They noted that excellent support is available for early career researchers through initiatives like the Networks in Industrial Biotechnology and Bioenergy and SynbiCITE (a Knowledge and Innovation Centre). Respondents felt career support for mid- to late-career researchers is insufficient (figure A5). The main issues discussed were low salaries (particularly in academia), difficulty accessing funding and short-term research contracts which can leave researchers with poor job security. Most respondents felt more support should be available for entrepreneurial skills although some respondents praised training programmes available in the UK for entrepreneurial skills, such as Innovation-to-Commercialisation of University Research ( ICURe ) and Knowledge Transfer Partnerships. Some said there should be more focus on entrepreneurship in degrees and PhDs, as early-career researchers are often the ones to spin-out innovation. Most respondents thought there was insufficient support for laboratory technicians’ careers and noted there was a shortage of lab technicians in both academia and industry. Reasons given included lack of career support, low pay and this career being a little-known option. Several respondents praised the Technicians Commitment, an initiative to increase visibility, recognition and career support for technicians. Respondents from all sectors said apprenticeships were a good way of addressing technical skills gaps not filled by the university graduate population. Respondents noted availability of skilled bioprocessing experts was lower than the sector’s requirements across the design, operation and maintenance of bioprocessing facilities and equipment. Demand outstrips supply for these technical skills at all levels, from workshop apprentices to engineers able to design and build biomanufacturing plants. Respondents felt that regulatory skills have the least support, but few respondents discussed this. What we’re going to do about it We will grow and retain a diverse talent pool within the UK to match demand from academia and industry, covering scientific, technical and entrepreneurial skills at all levels. This will provide the UK engineering biology ecosystem with the capabilities it needs to research, design, scale and commercialise engineering biology-derived products. We have already invested in initiatives to support the talent pipeline. This includes a total of £6.7 million since 2018 to establish the Cell and Gene Therapy Catapult’s Advanced Therapies Apprenticeship Community ( ATAC ) and Advanced Therapies Skills Training Network ( ATSTN ). In May 2023, a further £6.5 million was announced to strengthen the medicines manufacturing skills ecosystem. Engineering biology is inherently multidisciplinary and therefore creates a complicated training and skills challenge. To provide stability and certainty for our top talent the government recently announced the Discovery Fellowship backed by a £200 million endowment, which will fund and support emerging top talent in priority science and technology areas to conduct groundbreaking research in the UK. This could include engineering biology research. We will also learn from the successful Synthetic Biology for Growth programme which resulted in over 150 PhD students. UKRI has highlighted its aspiration to support engineering biology in the current Centre for Doctoral Training funding opportunity. The Industrial Biotechnology Innovation Centre ( IBioIC ) is a networking and support organisation based in Scotland that connects industry, academia and government to bring biotechnology processes and products to the global market. IBioIC offer talent development among other services. IBioIC supports a higher national diploma ( HND ) and delivers an MSc in industrial biotechnology providing students with the knowledge and skills in the theoretical and practical aspects of industrial biotechnology. The HND prepares students for employment in careers such as Science Laboratory Technician, Research Scientist, Process Operator and Production Scientist. The collaborative MSc awarded by the University of Strathclyde provides graduates with the skills and expertise needed for a career in industrial biotechnology, covering topics such as bioprocessing, synthetic biology and bioinformatics. IBioIC also supports PhD students through direct funding and training in industry-ready skills. This training is also offered to industrial scientists. IBioIC is recognised as a European centre of excellence for industry-led research through its support for collaborative industry\/academic projects. This is made possible through its strong ties with industry and excellent research pilot facilities. We will work with the Department for Education ( DfE ), and partners in academia and industry, to model the skills and talent pipeline and the factors affecting talent flows. We will create an agile and responsive skills system where providers and employers work together to meet local and national technical workforce needs, focusing on talent for scale-up and commercialisation where there is currently an acute need. We will draw on all relevant levers provided by the Department for Education’s S&T Framework plan for talent and skills. This includes: Support for the Institutes of Technology ( IoTs ) programme, backed by up to £300 million of government capital investment, to bring together further education providers, universities and employers to offer higher level technical skills in STEM sectors. ) programme, backed by up to £300 million of government capital investment, to bring together further education providers, universities and employers to offer higher level technical skills in sectors. Continuing to prioritise programme improvements to support employers of all sizes, and particularly SMEs , in taking on as many high-quality apprentices as their business needs. We will also ensure relevant apprenticeships standards, higher technical qualifications, and T Levels continue to evolve to meet future requirements. , in taking on as many high-quality apprentices as their business needs. We will also ensure relevant apprenticeships standards, higher technical qualifications, and Levels continue to evolve to meet future requirements. Championing existing initiatives like the Office for Students’ degree apprenticeships funding competition[footnote 27]. We will inspire and support a new generation of entrepreneurs by celebrating and championing successes in the engineering biology business community, and we will highlight the opportunities available to the sector like the ICURe accelerator programme. We will identify opportunities to connect successful entrepreneurs, business executives and investors to emerging businesses to share expertise and mentor aspiring entrepreneurs. Innovation-to-Commercialisation of University Research ( ICURe ) is an Innovative UK funded programme for researchers who have a potentially commercially viable product and want to develop their entrepreneurial skills, funded by Innovate UK. ICURe aims to address system failures that prevent the commercialisation of academic research. The programme gives a team of academic researchers funding, commercialisation training and advice to explore the commercial potential of their research. ICURe has supported the creation of more than 200 spin-outs and more than 650 jobs. Successes include NanoSyrinx, which is creating next-generation intracellular delivery of biological medicines and which won the AbbVie UK Golden Ticket accelerator programme, and Erebagen, which is exploring the use of microbes for drug discovery and which secured a Royal Society of Edinburgh\/ BBSRC Enterprise Fellowship and Innovate UK grants and joined the Start Codon Accelerator, a venture capital investor. Alongside our efforts to improve training we will continue to attract global engineering biology talent to the UK and retain it. Through government-to-government engagement, and wider science, trade and technology diplomacy, we will also build our understanding of the global skills market and the complementary skills and knowledge bases we share with our international partners. This year we set up the Engineering Biology Regulators Network, and we will work through it to identify a training offer for industry to address the regulatory skills gap our respondents identified. This will build on existing training offered by organisations like the National Physical Laboratory and the British Standards Institute. Regulations and standards It is vital that the UK’s system of regulations and standards keep pace with the extraordinary speed at which engineering biology is developing. Regulations and standards are key to creating an environment in which engineering biology can safely reach its full potential, and provide confidence to the public and markets that products are high-quality and safe. The UK is at risk of falling behind other nations that have been quicker to adopt pro-innovation regulations for engineering biology applications. For instance, Singapore and the US were the first and second nations respectively to approve the sale of cultivated meat. In doing so, they sent a powerful signal to companies and investors in this rapidly growing sector. Failure to keep pace could see firms go abroad to more accessible markets. Our international partners recognise this imperative: for instance, in 2022 Denmark and Germany agreed to cooperate to promote reform of EU rules to lower barriers facing ‘biosolutions’[footnote 28]. We must strike a balance between promoting the growth of the engineering biology sector and maintaining a high standard of safety and public confidence in the technology and its applications. The many ways in which engineering biology can be applied means its use is governed by numerous regulators. We asked about your experience of regulation, and your views about government’s role in international regulation and standard setting. What you told us The UK’s regulatory system is well placed to be a leader in regulation for engineering biology. The UK demonstrates innovation in regulations and standards, including through the passage of the Genetic Technologies (Precision Breeding) Act 2023. Across all sectors, the most common message was that regulatory pathways for new products are complicated, difficult to understand or yet to be established. Businesses need support from regulators to understand and meet their requirements, but regulators advice can be slow to arrive or inadequate. Respondents would like to see scientists, innovators and businesses supporting regulators to assess risk posed by new technologies and to design regulations. A quarter of comments expressed either criticism and frustration that the UK was still working under the EU’s ‘precautionary mindset’ instead of focusing on innovation and growth and they urged government to use post-Brexit regulatory freedoms to adopt pro-innovation regulations. Some respondents welcomed the new Genetic Technology (Precision Breeding) Act 2023 and recognised the UK’s global leadership in this area. Some called for the UK to harmonise regulations with countries such as the USA and Singapore. Respondents highlighted the UK’s National Quality Infrastructure ( NQI ) which is delivered by 4 long-established and internationally respected institutions and provides businesses and consumers with confidence that standards are written and implemented rigorously and consistently. Some respondents said that standards for engineering biology were important for supporting scale-up and commercialisation. What we’re going to do about it The UK’s regulatory landscape should help engineering biology-derived products to reach the market. Regulations should be clear, appropriate and support innovation while maintaining high consumer safety standards. This year we established the Engineering Biology Regulators’ Network ( EBRN ) to find opportunities for collaboration between regulators, knowledge and best practice sharing, and horizon scanning. It convenes 10 regulators from 7 sponsoring departments. Through the EBRN , we will build connections between UK regulators and the engineering biology community to support the development of appropriate regulatory reforms. Its first task is to map how products derived from engineering biology are currently being regulated. We are providing the EBRN with £5 million to launch engineering biology regulatory sandboxes. These will help us tackle the most pressing regulatory challenges and opportunities. Through the EBRN we will establish 3 to 5 sandboxes that allow evidence-based analysis of products’ quality and safety, essential for crafting suitable regulations that maintain the public’s trust. We will work across government to identify opportunities to improve existing regulatory frameworks and capitalise on post-Brexit regulatory freedoms. Following the Government Chief Scientific Advisor’s review of pro-innovation regulation for life sciences, we have commissioned the Regulatory Horizons Council to build on existing work by detailing regulatory issues specific to engineering biology. This activity will complement the government’s Smarter Regulations Programme, which is removing regulatory barriers and future-proofing our regulatory frameworks. The Food Standards Agency has already launched a public consultation on proposals for a new framework in England for the regulation of precision bred organisms used for food and animal feed[footnote 29]. Spotlight on Cultivated Cell Proteins Many respondents, particularly from the food and agriculture sector, highlighted the UK’s opportunity to become a global leader in cultivated cell proteins ( CCP ). The UK is home to a budding industry with innovation happening across the supply chain from producers of end products like Ivy Farm, Enough and Hoxton Farm to platforms like Extracellular and MarraBio. However, respondents feel this industry is at risk of being stifled as products cannot reach the market, partly due to regulatory barriers in the Novel Foods Framework, which is retained from EU regulation. Government recognises this risk and is exploring options with regulatory bodies to unblock barriers for the industry. The Food Standards Agency ( FSA ) is considering strategic regulatory reform of the Regulated Products frameworks, which includes novel foods. The FSA are committed to establishing a modern, streamlined and effective regulated products service that brings benefits to both businesses and consumers, making it simpler and quicker for new products to come to market. The FSA intends to explore opportunities presented by the REUL Act to bring about impactful change. The FSA has already begun to lay the foundation for potential fundamental reform in the future, including the recently completed review of the Novel Foods Regulatory Framework. Further support will come from our network of science and technology diplomats, who will follow the global regulatory environment and, where appropriate, build links between UK regulators and their international equivalents. This will ensure our regulators are informed about developments elsewhere and are able to implement global best practice. The UK is party to international agreements relevant to our regulatory framework. Synthetic biology is a standing agenda item at meetings of the Convention on Biological Diversity, and government is actively involved in international discussions which could affect engineering biology products, for instance around a new multilateral benefit sharing mechanism for the use of digital sequence information ( DSI ) on genetic resources. The Convention’s subsidiary agreements to the Convention include the Cartagena Protocol on Biosafety and Nagoya Protocol on access and benefit sharing. Government works with stakeholders, including the private sector, through a long-established Access and Benefit Sharing Stakeholder Forum, a Business Advisory Group on DSI , and in future through regular contact with the new Engineering Biology Steering Group. Standards will also be key to speeding up innovation by increasing the reproducibility and comparability challenges experienced when working with biological systems. The UK is committed to leading the development of responsible and fair standards. The National Physical Laboratory and the National Measurement Laboratory are spearheading UK efforts to improve engineering biology metrology. We will also work with our international partners to support adoption of standards globally. The National Physical Laboratory (NPL) is leading the development of engineering biology metrology and standards alongside the UK’s other measurement institutes which make up the National Measurement System. NPL has established the Centre for Engineering Biology, Metrology and Standards – funded by the government’s Industrial Strategy Challenge Fund –with SynbiCITE at Imperial College. The Centre has supported UK synthetic biology by providing reference measurements and standards to improve confidence in the manufacturing and adoption of products and technologies. For example, the Centre has: validated the performance attributes of synthetic DNA or vaccines; determined the efficacy of intracellular delivery or processing in biocomputers; and evaluated the performance of screening platforms for novel antibiotics. Through industry engagement the Centre has come to recognise the need for a national capability for engineering biology metrology serving as the highest point of reference for existing and emerging technologies. Engineering biology in the economy Engineering biology often requires intensive capital investment. Such investment is needed to build and operate the pilot manufacturing capabilities for demonstrating proof of concept, and then for large-scale manufacturing facilities. Stakeholders cited lack of access to business finance as a frequent barrier to growth, preventing them from building their own biomanufacturing plants or using open-access facilities. In addition, firms’ ability to find major customers often depends on their ability to attract investment, while their ability to secure investment affects their likelihood of attracting big customers. A credible path to profitability is a key element that investors consider when deciding to back a firm, and having relationships with large customers is an important way to demonstrate that credibility. At the same time, potential customers need assurance SMEs can deliver product to the agreed quality and volumes, necessitating major capital investments. This all creates a difficult negative feedback loop. Government must support UK firms using engineering biology to attract both financial investors and customers. This will involve building on technology-agnostic business finance schemes such as those offered through the British Business Bank, and Innovate UK, while also ensuring that our firms can access safe sources of foreign investment. We asked for your views of mechanisms for building closer links and better understanding between SMEs and large firms, your experiences of the business finance system, and the role of international investors and markets. What you told us Respondents were clear that larger deal sizes are the most challenging for UK engineering biology firms to achieve. Almost half of businesses ranked finance as their highest priority from the S&T Framework. In our call for evidence, we provided a yardstick for deal sizes and asked respondents to use it as a reference point. Not all respondents found the yardstick helpful, but nevertheless the mid-series A\/series B rounds (roughly from £5 million and above) were judged ‘very challenging’ by more than half (figure A6). This context makes clear that international investment is an important enabler of UK engineering biology firms’ growth by expanding the pool of capital available for scaling. Six firms mentioned receiving or seeking overseas investors from the US or East Asia. Messages about earlier funding rounds were less consistent. Respondents generally described seed funding as accessible in the UK when the underpinning innovation had been proven, and respondents cited several funds and angel investor networks that could deploy “a few million pounds”. But a quarter of respondents described deal sizes below £2 million as ‘very challenging’ and some voices pointed to a lack of investors with specialised expertise in engineering biology and its applications. Respondents would welcome ways of bringing SMEs together with larger firms. They said SMEs and academics need to understand industry’s main challenges and tailor their innovations and products accordingly. They need deeper insights into 3 areas: market and customer needs, changes to consumer behaviours required to use their products, and supply chain and operational issues. Barriers to SMEs working with larger firms include use of different technical language, differences in time frame expectations, differences in values and working practices, and a sense that SMEs were being asked to work as consultants for industry rather than being able to develop their own product offerings. Current efforts to bring together SMEs and larger firms are hampered by a reluctance to share insights, and “industrial chemicals, energy and agriculture would benefit from increased transparency and better communication.” SMEs found it difficult, though critical, to find interested individuals or ‘champions’ within large organisations, particularly given low awareness of the opportunities of engineering biology. Moreover, larger organisations have embedded ways of working and sunk costs that can prevent adoption of new approaches. UK firms are turning overseas for both investment and customers and some early implications of this are clear. There were reports of firms moving business development, R&D , infrastructure investment and ultimately public market listings overseas, particularly to the US. This trend is also driven by regulatory reform elsewhere creating new markets for novel foods, and explicit incentives to attract UK firms overseas. What we’re going to do about it We will foster a cohort of investors and customers who are well-informed about engineering biology’s economic potential and the emerging pipeline of UK firms and entrepreneurial talent, particularly beyond health applications. We will also help those firms to understand potential customers’ priorities and requirements so they can design products and processes appropriately from the start, in turn helping them to attract business finance. To bring together the most exciting UK engineering biology firms with major customers and investors, in 2024 the Department for Business and Trade ( DBT ) will look to hold a showcase that puts a spotlight on the UK’s leadership in engineering biology and highlights innovation within the sector. This will include industrial customers and international investors and help enhance dialogue within the engineering biology value chain about challenges and opportunities to pull through these technologies. To promote the UK sector to internationally mobile foreign direct investors, businesses, and pools of capital, DBT will co-ordinate an internationally facing UK investment offer. It will highlight a UK engineering biology ecosystem open to global ideas, investment, talent and trade underpinned by a culture of responsible and trustworthy innovation and open markets. DBT will achieve this through leveraging its in house expertise and understanding of investment drivers, which includes sector teams and investor services, the Office for Investment and the Venture Capital Unit, as well as by consulting across government and with external stakeholders. Our efforts will be supported by wider measures introduced by government to make the UK investment community more competitive. The Mansion House reforms announced this year committed the largest UK defined contribution pension funds to ambitious goals for their investments in unlisted equities. If their ambition was replicated across the pensions sector, it could unlock £50 billion of capital for the UKs most innovative companies. In addition, the Long-Term Investment for Technology and Science ( LIFTS ) aims to mobilise institutional investment into the UK’s science and technology companies, while a new fellowship scheme will build on the pool of talented UK VCs to create a pipeline of world-leading investors in science and technology. These policies are strong statements of intent to achieve the objectives set out in the Science and Technology Framework to improve funding for innovative companies. We will also consider how we can achieve greater understanding and confidence among investors about engineering biology and its near-term commercial potential. As well as making sure the UK has a regulatory landscape that allows products derived from engineering biology to reach markets, this could involve clearer technology and commercial milestones, developed and adopted to support investors’ judgements about the maturity of firms developing engineering biology-derived products. To help pull firms’ innovations through to adoption by customers, DSIT will continue to work closely with teams across government to improve their understanding of the transformational potential of engineering biology in their sectors. Our key relationships here are with Defra (for food, agriculture and environmental applications), with DBT (for chemicals and materials), the Department for Transport and Ministry of Defence (for low carbon fuels). We work closely with the Office for Life Sciences, a joint team between DSIT and the Department of Health and Social Care, and DBT to promote the application of engineering biology in healthcare as part of the Life Sciences Vision. Where UK firms are ambitious to expand operations overseas, or to attract transformative foreign investment, we will work with our network of trade, technology and science diplomats to spot opportunities. In addition, government will be able to support firms in their export ambitions through leveraging DBT ’s network of International Trade Advisors and teams in global markets, its Export Academy, and UK Export Finance. Innovation chapters in our Free Trade Agreements with strategic partners will allow us to achieve the early identification and mutually beneficial resolution of unintended barriers to trade. Furthermore, government recognises that IP is the life blood of SMEs . Academic entrepreneurs typically need to secure access to university IP if they spin out a company based on research. The independent review of university spin-outs concluded that best practice in licensing IP to spin-outs is still not universally adopted, and sets out recommendations for where practice should be. The government is encouraging universities to adopt these recommendations and monitoring uptake. Furthermore, the UK’s Intellectual Property regime is recognised as one of the best in the world, and the UK’s approach to IP in all trade negotiations is to reward research and innovation, whilst ensuring access to new innovations. The National Security and Investment Act specifically protects synthetic biology and provides government with a means to screen investment which might raise national security concerns, while our export control regime protects listed items. We are reviewing the impact of these measures, and a call for evidence on the NSI Act is open at time of writing[footnote 30]. We also commit to providing further guidance to the sector on the specific risks presented by investment in the engineering biology sector. SynBioVen ( SBV ) was launched in mid-2022 with a £20 million investment from Winton Capital. It launched as a new investment vehicle focused on supporting the next generation of UK synthetic biology scientists, founders and start-ups with proof of concept, pre-seed and seed funding. SBV is investing in UK synthetic biology and recycling the profits into the company’s future activities. Key to SBV ’s investments strategy is working closely with the scientists and bioengineers developing specific applications of synthetic biology and utilising technical viability assessments from scientists working in the field. There is particular focus on investing in UK companies with a clear mission to use synthetic biology for the public good. SBV is in strategic partnership with SynbiCITE, the UK’s National Industrial Translation Centre for Synthetic Biology based at Imperial College. SBV are investing over £1 million a year for 5 years (starting in 2022) in SynbiCITE to fund its research facilities including the London Biofoundry, as well as its business education programmes, in order to sustain its network of promising UK synthetic biology start-ups and SMEs . So far SBV has supported 8 UK synthetic biology SMEs at different stages of investment. In 2022 SBV contributed to seed funding for Colorifix, a company developing environmentally friendly dyes for textiles. SVB also invested in Multus Biotechnology’s series A funding round, a startup creating key ingredients for the affordable growth media for cellular agriculture and pharmaceutical applications. Multus are using this funding to build a world-first production plant in the UK to accelerate the cultivated meat industry. This year SVB led seed funding for Resurrect Bio, a biotechnology startup on a mission to revolutionise the agricultural industry by giving crops the genetic tools to reactivate their natural defence mechanisms against diseases. Responsible and trustworthy innovation In the coming years, more and more products created through engineering biology will be commercialised and reach markets. The British public has already encountered and welcomed some applications of engineering biology, such as vaccinations and personalised health therapies. An engineering biology ecosystem and culture of responsible innovation will help to earn the trust of the public and consumers as we address the social and ethical questions that may be raised by certain applications. Widespread confidence in engineering biology-derived products will in turn attract more firms, talent and investment. Responsible and trustworthy innovation aims to ensure that unintended negative impacts of engineering biology are avoided, that barriers to dissemination, adoption and diffusion of research and innovation are reduced, and that the positive societal and economic benefits of research and innovation are fully realised. To achieve this, we must reduce biosecurity risks, create a safe and secure ecosystem and harness a culture of responsibility. We must also encourage a conversation that engages with peoples’ concerns about the technology, and where applications are safe, we must provide explanation and reassurance to facilitate their adoption. A world leader in responsible innovation Advances in engineering biology promise better and faster cures, more sustainable energy sources and more secure food systems. But as with other emerging technologies, it also creates new risks that must be understood and managed. The engineering biology risk picture is changing, fuelled by developments in converging tools and technologies, an increase in knowledge and expertise and lowering barriers to market entry. We therefore need to cultivate an engineering biology ecosystem in which stakeholders are aware of these risks and the government interventions to mitigate them and are encouraged to act responsibly. Government is working to learn lessons from other emerging technologies such as AI where we have seen how emerging knowledge and tools can lead to new risks, but also new opportunities. The 2023 AI Safety Summit, held in the UK, demonstrated that to enjoy the benefits of an emerging technology the risks must be understood and managed. In alignment with the UK Biological Security Strategy, we will make the UK a world leader in responsible innovation by 2030, ensuring the UK secures the economic, health and societal value from advances in biosciences and biotechnologies while guarding against potential misuse. Building a safe and responsible innovation ecosystem will help the public to trust this technology. Spotlight on the Biological Security Strategy In 2023, the UK published a Biological Security Strategy that sets out how the country will become resilient to a range of biological threats. It commits the UK to becoming a world leader in responsible innovation in engineering biology. The Strategy, led by the Deputy Prime Minister and Cabinet Office, outlines the 4 pillars of our response to biological risks: Understand the biological risks we face today and could face in the future. Prevent biological risks from emerging (where possible) or from threatening the UK and UK interests. Detect, characterise and report biological risks when they do emerge as early and reliably as possible. Respond to biological risks that have reached the UK or UK interests to lessen their impact and to enable a rapid return to business as usual. To become resilient to a spectrum of biological threats and a world leader in innovation, the Biological Security Strategy contains a number of new commitments, including: Launching a real-time Biothreats Radar to monitor threats and risks as and when they appear Establishing a dedicated minister for the Biological Security Strategy, who will report regularly to Parliament Carrying out regular domestic and international exercises Creating a UK Biosecurity Leadership Council, to work with businesses and organisations on the ground To achieve this ambition, government is working closely with UK industry, academia and international partners to create a safe, secure and resilient environment in which the biotechnology and life sciences sectors can flourish. In the UK there is legislation in place to protect the public from accidental or deliberate misuse of engineering biology. This includes: Control of Substances Hazardous to Health Regulations 2002 ( COSHH ), for the regulation of Biological Agents that are human pathogens· ), for the regulation of Biological Agents that are human pathogens· Genetically Modified Organisms (Contained Use) Regulations 2014, for the regulation of genetically modified microorganisms Specified Animal Pathogens Orders ( SAPO ), for the regulation of animal pathogens that are not endemic to the UK. ), for the regulation of animal pathogens that are not endemic to the UK. The Importation of Animal Pathogens Order ( IAPO ), for the regulation of the import of animal pathogens to the UK. ), for the regulation of the import of animal pathogens to the UK. Part 7 of the Anti-terrorism, Crime and Security Act 2001 ( ATCSA 2001 ) regulates the ability of sites such as universities and science research laboratories to obtain, store and work with certain pathogens and toxins. Creating an innovative and responsive regulatory environment will also help generate public trust. This is an underlying principle of the regulation and standards workstream of this Vision. In addition to legislation, there are guidelines and standards in place to promote and strengthen responsible innovation: EPSRC ’s AREA Framework defines principles through which UK academics can adopt and implement principles of RRI [footnote 31] . ’s Framework defines principles through which UK academics can adopt and implement principles of . Innovate UK’s PAS 440 Standard guides industry to develop new products, processes, or services in a responsible manner [footnote 32] . . The National Protective Security Authority’s ( NPSA ) Trusted Research guidance helps UK academics and businesses make informed decisions around potential security risks [footnote 33] ) Trusted Research guidance helps UK academics and businesses make informed decisions around potential security risks NPSA ’s Secure Innovation guidance, launched in October 2023, provides advice that can help startups and spin-outs protect their innovation, establish strong security practices and maintain competitive advantage[footnote 34]. This year we established the Ministerially-chaired UK Biosecurity Leadership Council ( BLC ) to bring leading academics and industry figures from across the life science and biotech sectors together with government officials. The BLC provides advice on emerging biosecurity risks and how to encourage responsible behaviour. Through the Council, we have identified the following responsible innovation policy priorities: gene synthesis screening; convergence of engineering biology and emerging technologies (e.g. AI , automation and cyberbiosecurity); the culture of safe innovation; biodata security; and horizon scanning. We are prioritising looking at the case for domestic gene synthesis and customer screening as a first step. The benefits and consequences of engineering biology are not confined by borders. International collaboration is vital to promoting and embedding a culture of responsible innovation in addition to learning from and demonstrating best practice, and minimising divergence amongst partners where appropriate. We must protect national security without compromising free trade and open markets. We are working with partners to shape international norms and standards, utilising our reach and influence in the multilateral system. We are members of the G7 , G20 , OECD , NATO and Council of Europe among other groupings, and signatories to UN conventions such as the Biological and Toxic Weapons Convention and the Convention for Biological Diversity. The UK plays an active role in these fora. For example, this year the UK funded the OECD to launch a Global Forum on Technology, which incubates an international expert group on synthetic biology. This expert group will provide a technical evidence base to advise global policy. To be a world leader in responsible innovation we must lead by example, demonstrate our intent to responsibly grow the bioeconomy without compromising national security or ethical standards, and encourage our international partners to follow suit. We will move further and faster to put the UK right at the very forefront of global efforts to drive responsible and trustworthy innovation across the world. Nurturing technology the public trusts As with any emerging technology, the public will seek to understand what engineering biology will be used for, how it will be used in their interest, how they will access the benefits, and how its potential harms will be mitigated. We asked how you stimulate interest in and uptake of engineering biology-derived products, the factors you think government should consider as it leads the public conversation, the respective roles of government, industry and academia, and what we can learn from other countries. What you told us There was some sense that the anticipated consumer acceptance of engineering biology varies by application area and use. Consumer acceptance will come from familiarity with products derived from engineering biology that meet (or beat) the quality or price of existing products without sacrificing consumer safety. The early 2000s debate around genetically modified organisms was a prominent theme. A quarter of respondents mentioned it, including those from sectors outside agriculture and food. To avoid similar issues with engineering biology, respondents recommended proactively understanding and addressing potential concerns, combating misunderstanding and misinformation, communicating the benefits and being clear about safety. Our respondents said they prioritise communicating the benefits of their work and demystifying the technology, and have appetite to do more. They warned that hyperbole around speculative applications could be unhelpful and recommended a focus on real-life case studies. Experts in responsible research and innovation ( RRI ) warned not to assume that “a lack of technical expertise and safety information is the primary source of resistance to technology, and conversely that high levels of technical expertise produce interest\/acceptance”. RRI approaches are key, involving engagement with the heterogeneous communities that will be impacted by a technology from the outset of research and empowering public groups to influence how it proceeds. Respondents with expertise in RRI also emphasised that it improves innovation through knowledge co-creation with end-users. The UK’s strengths in RRI are clear, in particular EPSRC ’s Anticipate, Reflect, Engage, Act ( AREA ) Framework and the role of BBSRC ’s 2010 Synthetic Biology Dialogue in influencing UK engineering biology innovation over the subsequent decade. Our regulators, research organisations and charities are trusted by the public. Respondents identified distinct roles for government, industry and academia. Government can build trust in engineering biology through effective regulation and clear communication about how decisions to deploy engineering biology are made. Industry can build familiarity with engineering biology-derived products and can also engage in RRI . Academia can be a trusted partner for assessing engineering biology safety and impacts. What we’re going to do about it We will maintain a positive, transparent and constructive dialogue between government, industry, academia and the public about engineering biology and its applications. Through this conversation, government will build public awareness of the potential of the technology, be open about its limitations and risks within national security boundaries and demonstrate how they will be mitigated. This will help society make informed decisions about their engagement with engineering biology-derived products. A key part of this must be a renewed commitment by stakeholders to responsible research and innovation practices, through the AREA Framework and PAS 440. We will develop robust insight into public attitudes towards engineering biology, noting that acceptance varies according to its application. This will build on the knowledge gathered by consultations and research conducted by Defra and the FSA during the development of the Genetic Technology (Precision Breeding) Act 2023, including on public perceptions and understanding of precision bred food, feed, animals and crops. Case study on mitochondrial donation. Mitochondria reside outside of the cell’s nucleus and carry their own DNA ( mtDNA ), which is inherited maternally. Mitochondria provide cells with energy the cells need to function properly, and errors in mtDNA can lead to serious, life-shortening disorders. Pioneering IVF techniques, developed in the UK can facilitate the replacement of faulty mtDNA with healthy mtDNA by isolating the nucleus of a patient’s egg or embryo and transferring it into an enucleated donor egg, which contains healthy mitochondria. In 2011, there was increasing interest in using these techniques in the UK as a treatment for inherited mitochondrial disorders. Cognisant that ethical considerations needed to be at the heart of this decision, the Nuffield Council on Bioethics ( NCOB ) launched a review into the techniques. The NCOB ’s ethical review, combined with the multifaceted public engagement process that the Human Fertilisation and Embryology Authority undertook, built trust by clearly outlining the ethical considerations alongside giving British citizens an opportunity to have their views heard. It is this combination of ethical review and public engagement that helped to inform the subsequent regulatory and legal decisions taken with regards to mitochondria donation. In October 2015, UK parliament passed the Human Fertilisation and Embryology (Mitochondrial Donation) Regulations, making human mitochondrial donation treatment legal in the UK. It was the open process that preceded the legislation that helped find a way through issues and produce outcomes that the public can trust. Conclusion Government’s vision is for the UK to have a broad, rich engineering biology ecosystem that can safely develop and commercialise the many opportunities to come from the technology and the underlying science. We aim to capture as much economic value, security, resilience and preparedness as possible from our hard-won strengths and ensure these create real benefits for the public. The UK’s global offer will be an engineering biology ecosystem open to ideas, private investment, talent and trade. It will be underpinned by public investment, supportive infrastructure, enabling regulation and standards, open markets, and a culture of responsible and trustworthy innovation. This Vision has set out a clear ambition to support and grow engineering biology, allowing the UK to capture its transformational benefits while responsibly managing its risks. It is the starting point for developing the detailed policies and interventions that will allow us to consolidate and grow our current strengths. As we do so, we will continue to consult with the community, including through the new Engineering Biology Steering Group. We will keep the community thoroughly up to date on the resulting decisions and implantation. We will work across government to develop a clear plan of action for delivering this Vision. Our thanks In developing this Vision we have consulted widely and would like to thank all 81 contributors to our call for evidence. We are also particularly grateful to advice from the Engineering Biology Leadership Council and the Industrial Biotech Leadership Forum, as well as the Council for Science and Technology and the Government Chief Scientific Advisor. Annex A: Call for evidence responses Overview of respondents The call for evidence was open for 10 weeks from 19 July to 29 September 2023. We received 81 responses, 73 of which (90%) were through the online form. All responses, apart from one, were from stakeholders engaged in the engineering biology sector. Respondents could answer the survey in the format of the online survey form or submit a response outside of this format. In the charts below that break down the categories and sectors of respondents, we have included both types of respondents. However, for the graphs for all other questions, as the content in the written responses did not specifically answer against the categories given in the question, these have been omitted from the graphs presented. Stakeholders responded as both individuals, collectives and organisations. As such, and due to the nature of the sector, it was possible to select multiple options for type of respondent. The 8 categories of respondent and their quantities are shown in figure A1 below. Figure A1 – Responses to ‘what type of respondent are you?’ Based on 81 responses, 73 from survey forms and 8 outside survey form. Respondents could select multiple options. Type of respondent Survey form Outside survey form An academic working on, or with, engineering biology 29 1 Other 26 3 A business in the sector with less than 250 employees 21 1 A trade organisation 3 3 A large business 3 1 A contract research or contract manufacturing organisation 3 0 A member of the public 3 0 An investor 0 0 Of the 29 (36%) respondents who said they were ‘other’, we further analysed these to determine the type of individual or organisation represented. This is shown in figure A2 below. Figure A2 – For ‘Other’, ‘what type of respondent are you?’ Based on 29 responses, 3 of which were outside the survey form. Responses sorted according to nearest organisation type. Type of respondent Survey form Outside survey form Professional body 6 0 Innovation centre\/catapult 6 0 Non-profit organisations 5 0 Ethics, standards and governance 4 0 Academic 3 0 Forum\/Council 0 2 PSRE 2 0 University group 2 0 Genomics 1 0 Policy advisor 1 0 Charity 1 0 Consumer products 1 0 Standards and regulation 1 0 Consultant 1 0 Biosecurity 1 0 Charity association 0 1 Trade organisation 1 0 Database lab 1 0 Public body 0 1 Figure A3 shows the nation or region in which the respondent was headquartered. The vast majority of responses (55%) came from the Greater South East, comprising London, East of England and the South East. Figure A3 – ‘Please select the nation or region you are headquartered.’ Based on 81 responses, 73 survey responses and 8 responses outside the survey form. Respondents can select multiple options. Blanks are categorised as ‘None selected’. Nation or region you are headquartered Survey form Outside survey form London 24 0 East of England 12 0 Scotland 7 0 South East 6 0 Yorkshire and the Humber 4 1 North West 5 0 Responding on behalf of UK-wide 0 5 Not headquartered in the UK 3 1 None selected 4 0 West Midlands 2 1 South West 2 0 North East and Cumbria 2 0 East Midlands 2 0 Cymru\/Wales 1 0 Northern Ireland 0 0 Figure A4 breaks responses down by the engineering biology applications they are working in. Because respondents often ticked several application areas, this question was not generally helpful in helping us identify application-specific themes within the qualitative feedback provided. Other application areas provided include, consumer products, genomics, ethics standards and governance, biosecurity and academia. Figure A4 – ‘Which application areas do you consider yourselves involved with?’ Based on 73 responses, respondents can select multiple options. ‘Other’ responses include ethics, consumer products, biosecurity and professional bodies. Application areas do you consider you are involved with Survey form Outside survey form Underpinning technologies 49 2 Human health 46 2 Agriculture and food 45 2 Chemicals and materials 41 3 The environment 38 1 Renewable fuels 19 1 Other 13 3 Responses on issues Further charts were generated to analyse the call for evidence responses. Figure A5 shows that respondents highlighted programmes to support regulatory skills and to support technicians were areas that were not working well. Respondents also highlighted the lack of scale in support for late and mid-career researchers. Figure A5 – ‘Indicate what is working, not working or not to a sufficient scale.’ Based on 56 survey form responses, respondents able to select multiple responses. Does not include the 8 non-survey form responses. Figure A6 - ‘What stage and investment size have your company (or those you represent) found it challenging to raise finance?’ Based on 30 qualtrics based responses, respondents can select multiple options. Does not include the 8 non-qualtrics responses.","filter_flag":1}
{"title":"Thaioil and Chulalongkorn University Forge Collaborative Research Agreements - Bangkok Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS90aGFpbGFuZC9wci8yNzEzOTY5L3RoYWlvaWwtYW5kLWNodWxhbG9uZ2tvcm4tdW5pdmVyc2l0eS1mb3JnZS1jb2xsYWJvcmF0aXZlLXJlc2VhcmNoLWFncmVlbWVudHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS90aGFpbGFuZC9wci8yNzEzOTY5L3RoYWlvaWwtYW5kLWNodWxhbG9uZ2tvcm4tdW5pdmVyc2l0eS1mb3JnZS1jb2xsYWJvcmF0aXZlLXJlc2VhcmNoLWFncmVlbWVudHPSAQA?oc=5","id":"CBMifGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS90aGFpbGFuZC9wci8yNzEzOTY5L3RoYWlvaWwtYW5kLWNodWxhbG9uZ2tvcm4tdW5pdmVyc2l0eS1mb3JnZS1jb2xsYWJvcmF0aXZlLXJlc2VhcmNoLWFncmVlbWVudHPSAQA","guidislink":false,"published":"Wed, 27 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=361, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS90aGFpbGFuZC9wci8yNzEzOTY5L3RoYWlvaWwtYW5kLWNodWxhbG9uZ2tvcm4tdW5pdmVyc2l0eS1mb3JnZS1jb2xsYWJvcmF0aXZlLXJlc2VhcmNoLWFncmVlbWVudHPSAQA?oc=5\" target=\"_blank\">Thaioil and Chulalongkorn University Forge Collaborative Research Agreements<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bangkok Post<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Thaioil and Chulalongkorn University Forge Collaborative Research Agreements - Bangkok Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmJhbmdrb2twb3N0LmNvbS90aGFpbGFuZC9wci8yNzEzOTY5L3RoYWlvaWwtYW5kLWNodWxhbG9uZ2tvcm4tdW5pdmVyc2l0eS1mb3JnZS1jb2xsYWJvcmF0aXZlLXJlc2VhcmNoLWFncmVlbWVudHPSAQA?oc=5\" target=\"_blank\">Thaioil and Chulalongkorn University Forge Collaborative Research Agreements<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bangkok Post<\/font>","source.href":"https:\/\/www.bangkokpost.com","source.title":"Bangkok Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Thaioil has signed a memorandum of understanding (MOU) for research and development (R&D) cooperation with the Petroleum and Petrochemical College and the Faculty of Pharmaceutical Sciences at Chulalongkorn University. Mr. Bandhit Thamprajamchit, Chief Executive Officer and President of Thai Oil Public Company Limited, signed the cooperation agreement with representatives from the Petroleum and Petrochemical College and the Faculty of Pharmaceutical Sciences at Chulalongkorn University, led by Professor Bundhit Eua-arporn, Ph.D., the President. The signing ceremony took place at the Board Meeting Room, Thai Oil Public Company Limited, on the 12th floor of Building A in the Energy Complex Building in Bangkok. Mr. Bandhit (Thaioil CEO) stated, \"This research and development collaboration with the Petroleum and Petrochemical College at Chulalongkorn University marks the sixth edition of our agreement. It aims to enhance research and development for better business opportunities and establish a concrete foundation for collaboration between industry and educational institutions. This collaboration will foster the development of cutting-edge technology, the creation of new products in line with our new business direction, and the enhancement of production processes' efficiency. The results of this collaboration will contribute to advancing long-term business competitiveness as well as academic capability.\" He added, \"Additionally, Thaioil has also signed a research and development cooperation agreement with the Faculty of Pharmaceutical Sciences at Chulalongkorn University to jointly develop disinfectant products. This initiative aligns with one of the company’s strategies (Value Diversification) to create a vital business platform. It aims to realise our vision of Empowering Human Life through Sustainable Energy and Chemicals.\"","filter_flag":1}
