{"title":"Net zero and insurance underwriting - PwC","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB3Yy5jb20vdXMvZW4vaW5kdXN0cmllcy9maW5hbmNpYWwtc2VydmljZXMvbGlicmFyeS9uZXQtemVyby1pbnN1cmFuY2UtdW5kZXJ3cml0aW5nLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB3Yy5jb20vdXMvZW4vaW5kdXN0cmllcy9maW5hbmNpYWwtc2VydmljZXMvbGlicmFyeS9uZXQtemVyby1pbnN1cmFuY2UtdW5kZXJ3cml0aW5nLmh0bWzSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnB3Yy5jb20vdXMvZW4vaW5kdXN0cmllcy9maW5hbmNpYWwtc2VydmljZXMvbGlicmFyeS9uZXQtemVyby1pbnN1cmFuY2UtdW5kZXJ3cml0aW5nLmh0bWzSAQA","guidislink":false,"published":"Tue, 11 Jul 2023 01:52:35 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=11, tm_hour=1, tm_min=52, tm_sec=35, tm_wday=1, tm_yday=192, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB3Yy5jb20vdXMvZW4vaW5kdXN0cmllcy9maW5hbmNpYWwtc2VydmljZXMvbGlicmFyeS9uZXQtemVyby1pbnN1cmFuY2UtdW5kZXJ3cml0aW5nLmh0bWzSAQA?oc=5\" target=\"_blank\">Net zero and insurance underwriting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PwC<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Net zero and insurance underwriting - PwC","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnB3Yy5jb20vdXMvZW4vaW5kdXN0cmllcy9maW5hbmNpYWwtc2VydmljZXMvbGlicmFyeS9uZXQtemVyby1pbnN1cmFuY2UtdW5kZXJ3cml0aW5nLmh0bWzSAQA?oc=5\" target=\"_blank\">Net zero and insurance underwriting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PwC<\/font>","source.href":"https:\/\/www.pwc.com","source.title":"PwC","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Reaching net zero by 2050 seems like a far-off goal. It’s not. In fact, due to the time value of carbon, 75% of emission cuts required to achieve net zero must take place in the next ten years. If this does not happen, then a 1.5℃ future will be highly unlikely. In other words, there’s no time to waste. Given the urgent need to drastically reduce greenhouse gas (GHG) emissions in the next decade, public and private investments need to go toward solutions with the highest near-term abatement potential. An estimated total net investment of $24 trillion has the potential to achieve the approximately 1,050 gigatons of CO2 reduction needed to achieve net zero. Solutions such as alternative energy (utility scale solar, wind energy), heating and cooling solutions (refrigerant management), alternative building materials (cement) and transportation (electric vehicle infrastructure) can be deployed rapidly, but all present different transition risks and opportunities for property & casualty (P&C) insurers.","filter_flag":1}
{"title":"5 Key Elements of Locus AG's CarbonNOW Program - No-Till Farmer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5vLXRpbGxmYXJtZXIuY29tL2FydGljbGVzLzEyNjUwLTUta2V5LWVsZW1lbnRzLW9mLWxvY3VzLWFncy1jYXJib25ub3ctcHJvZ3JhbdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5vLXRpbGxmYXJtZXIuY29tL2FydGljbGVzLzEyNjUwLTUta2V5LWVsZW1lbnRzLW9mLWxvY3VzLWFncy1jYXJib25ub3ctcHJvZ3JhbdIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3Lm5vLXRpbGxmYXJtZXIuY29tL2FydGljbGVzLzEyNjUwLTUta2V5LWVsZW1lbnRzLW9mLWxvY3VzLWFncy1jYXJib25ub3ctcHJvZ3JhbdIBAA","guidislink":false,"published":"Fri, 28 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=209, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5vLXRpbGxmYXJtZXIuY29tL2FydGljbGVzLzEyNjUwLTUta2V5LWVsZW1lbnRzLW9mLWxvY3VzLWFncy1jYXJib25ub3ctcHJvZ3JhbdIBAA?oc=5\" target=\"_blank\">5 Key Elements of Locus AG's CarbonNOW Program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">No-Till Farmer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 Key Elements of Locus AG's CarbonNOW Program - No-Till Farmer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3Lm5vLXRpbGxmYXJtZXIuY29tL2FydGljbGVzLzEyNjUwLTUta2V5LWVsZW1lbnRzLW9mLWxvY3VzLWFncy1jYXJib25ub3ctcHJvZ3JhbdIBAA?oc=5\" target=\"_blank\">5 Key Elements of Locus AG's CarbonNOW Program<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">No-Till Farmer<\/font>","source.href":"https:\/\/www.no-tillfarmer.com","source.title":"No-Till Farmer","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Lots of carbon programs exist for farmers and offer incentives for carbon sequestration. Oftentimes, these programs exclude no-tillers and cover croppers because they are already practicing regenerative agriculture. Locus AG recently hosted a digital demonstration, Get Confident in Carbon, with No-Till Farmer. Shane Head, director of customer success at Locus AG, and Mark Hill and Chris Lidgett, both directors of sales at the company, outlined details of the CarbonNOW program that pays farmers for sequestering carbon. Here are 5 key takeaways from their presentation. 1. Adding Locus AG Products Will Qualify Long-Term No-Tillers While many farmers who have been no-tilling and using cover crops for years don’t qualify for most carbon credit programs, using Locus AG soil probiotics qualifies as an official practice change and makes longtime no-tillers eligible to enroll. “The product itself is the practice change or the qualifying additionality in the program,” Lidgett says. “For many of you guys who have been long-term no tillers or long-term cover crop users, you get pushed aside in most programs, whereas we have an option for you to take advantage of our program and get some carbon sequestration payments as well.” 2. Program Offers High ROI Despite being counted as a practice change, most no-tillers who enroll in the CarbonNOW program won’t have to change much about their farming methods. In most cases, it’s not necessary to buy new equipment or make drastic adjustments. Instead, the program involves adding new products to an already existing program. This leads to a high return on investment because the initial investment cost is minimal in the first place. The company also estimated that it has distributed more than $1 million in carbon payments to a total group of less than 50 farmers. 3. Guaranteed Payments The CarbonNOW program is set up to ensure $12 per acre with accruing performance bonuses based on annual free soil testing. “You get a guaranteed payment so you do not have to be as worried about how much carbon you’re going to sequester year to year,” Lidgett says. “You are going to get a guaranteed payment no matter what.” While the guaranteed amount is a nice cushion to fall back on, Head says if the soil samples show that carbon was sequestered, the no-tiller will receive a performance bonus. 4. Third-Party Soil Sampling The program includes third-party soil sampling to ensure everything is accurate. Lidgett says that soil samples are one of the most essential aspects of carbon programs in general — being accurate in reporting data. “We want to strive to be at the highest level of that, so we have a program that not only helps you right away, it also has staying power in the industry for years to come,” Lidgett says. Head says after the soil sampling is done, $9 of the total $12 gets paid out right away. The remaining $3 comes after harvest data collection. “Third-party soil sampling is really a critical part of this,” Head says. “We're using scientific methods to understand how much carbon is actually sequestered in your fields. We do this year over year in the same location control areas, meaning those areas would not have product put on them. We're continually checking our product against your soil to make sure it's working and validating those carbon credits.” 5. Grower Data Portal Locus AG also implemented a grower data portal and specifically tailored it with farmers in mind. The portal is meant to be easy to use in an effort to not waste any of no-tillers’ time. “With our newer addition to the data portal and platform, you're going to be able to go in there, see all your fields, all your maps and know what's going on within the program for you at pretty much any given time,” Lidgett says. “It's a very simple program for growers to use in order to see what stage you are at in the carbon program and get the latest update.” To learn more about the program or check your eligibility for enrollment visit the CarbonNOW website portal. Related Content: Seize More Carbon with the Carbon Reduction Potential Evaluation (CaRPE) Tool,","filter_flag":1}
{"title":"HYCO1 and Kansas Ethanol Collaborate on World's Largest Biogenic CO2 Utilization Facility - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2h5Y28xLWFuZC1rYW5zYXMtZXRoYW5vbC1jb2xsYWJvcmF0ZS1vbi13b3JsZHMtbGFyZ2VzdC1iaW9nZW5pYy1jbzItdXRpbGl6YXRpb24tZmFjaWxpdHktMzAxODc5OTE0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2h5Y28xLWFuZC1rYW5zYXMtZXRoYW5vbC1jb2xsYWJvcmF0ZS1vbi13b3JsZHMtbGFyZ2VzdC1iaW9nZW5pYy1jbzItdXRpbGl6YXRpb24tZmFjaWxpdHktMzAxODc5OTE0Lmh0bWzSAQA?oc=5","id":"CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2h5Y28xLWFuZC1rYW5zYXMtZXRoYW5vbC1jb2xsYWJvcmF0ZS1vbi13b3JsZHMtbGFyZ2VzdC1iaW9nZW5pYy1jbzItdXRpbGl6YXRpb24tZmFjaWxpdHktMzAxODc5OTE0Lmh0bWzSAQA","guidislink":false,"published":"Tue, 18 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=199, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2h5Y28xLWFuZC1rYW5zYXMtZXRoYW5vbC1jb2xsYWJvcmF0ZS1vbi13b3JsZHMtbGFyZ2VzdC1iaW9nZW5pYy1jbzItdXRpbGl6YXRpb24tZmFjaWxpdHktMzAxODc5OTE0Lmh0bWzSAQA?oc=5\" target=\"_blank\">HYCO1 and Kansas Ethanol Collaborate on World's Largest Biogenic CO2 Utilization Facility<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"HYCO1 and Kansas Ethanol Collaborate on World's Largest Biogenic CO2 Utilization Facility - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2h5Y28xLWFuZC1rYW5zYXMtZXRoYW5vbC1jb2xsYWJvcmF0ZS1vbi13b3JsZHMtbGFyZ2VzdC1iaW9nZW5pYy1jbzItdXRpbGl6YXRpb24tZmFjaWxpdHktMzAxODc5OTE0Lmh0bWzSAQA?oc=5\" target=\"_blank\">HYCO1 and Kansas Ethanol Collaborate on World's Largest Biogenic CO2 Utilization Facility<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"HOUSTON, July 18, 2023 \/PRNewswire\/ -- HYCO1, Inc. announces that it has entered into a 20-year carbon dioxide supply agreement with Kansas Ethanol, located in Lyons, Kansas for the planned construction of the world's largest biogenic carbon dioxide utilization facility, Green Carbon Synthetics Kansas, LLC. HYCO1 is a Houston, Texas (USA) based technology company that has created a disruptive CO 2 conversion catalyst and related low-cost CO 2 process technology. HYCO1 CUBE™ Technology (Carbon Utilization, Best Efficiency) cost-effectively utilizes carbon dioxide and various methane source feedstocks to create low-cost, low-carbon chemical grade syngas in a single pass. The syngas produced is used to produce low carbon intensity (CI) downstream products. HYCO1 technology not only lowers the resultant carbon score of the downstream products by 50% to 100% but does so at a competitive cost compared to fossil feedstock derived products and without the requirement of incentives like many other technologies. HYCO1 technology enables green syngas to be used for making products such as Hydrogen, Synthetic Base Oils, Low-Carbon Jet Fuels, Green Methanol, and many others. The new HYCO1 project to be co-located with Kansas Ethanol will utilize all of their 800 tons per day of CO 2 to produce approximately 60 million gallons per year of low-carbon and zero-carbon products. Kurt Dieker, Chief Development Officer, and Co-founder of HYCO1, stated \"HYCO1 is excited to announce this innovative, next generation project and to collaborate with the Kansas Ethanol team, which runs one of the most advanced ethanol production facilities in the country. I have worked with the Kansas Ethanol team for the last fifteen years, including my tenure as Director of Technology Strategy at ICM, Inc., the world's largest ethanol technology provider.\" Dieker continued \"While there are many paths that an ethanol facility can take to improve sustainability and margins, ranging from additional energy efficiencies to protein separation, in my opinion CO 2 utilization represents the leading value-added step for an ethanol production facility.\" Lastly, \"As a native Kansan, I am especially proud to be able to build the first of many HYCO1 Carbon Negative, Planet Positive™ facilities starting with this flagship project in Kansas.\" The Lyons HYCO1 project is in the engineering stage with plans to complete the pre-construction engineering in 2024. The facility will produce approximately 4,000 barrels per day of first-of-a-kind synthetic Base Lubricating Oils and Low-Carbon Jet Fuel made from CO 2 . High-performance products include four centistoke base oil for use in the highest grade synthetic motor oils; and a two centistoke base oil currently being tested by EV manufacturers for its ideal battery and drive-train heat transfer and lubrication properties. The projects' products are produced with more than 80% reductions in carbon footprints versus traditional fossil-derived products. Approximately half of the weight of these new sustainable products will consist of biogenic CO2 that would have previously been emitted into the atmosphere. Mike Chisam, CEO of Kansas Ethanol, said of the project, \"Although most ethanol producers are considering or pursuing underground carbon sequestration in our industry to decarbonize, we believe that carbon utilization, which supports a circular carbon economy, represents the best use of our CO 2, and positions us more competitively in the market. Value added products made from CO 2 that displace fossil derived products represents a win for us at Kansas Ethanol, a win for the U.S. Ethanol Sector, and a win for the global environment. We are looking forward to the construction of the HYCO1-based Green Carbon Synthetics Kansas, LLC facility next to ours. The co-location benefits: carbon dioxide utilization, natural gas offset through waste heat steam production, and additional electricity offsets will position our facility as a world leader of low-carbon ethanol resulting in significant shared savings.\" Chisam also noted \"HYCO1's carbon utilization technology enables us to sustainably produce all products, even if, or when, government support incentives are no longer available. That is incredibly important to us.\" HYCO1 is currently evaluating additional project sites and partners to mirror the Green Carbon Synthetics Kansas, LLC project, while also collaborating with downstream technology providers to produce other low-carbon products. About HYCO1: Founded by industrial gas, green chemical, and bio-fuels production experts in 2020, HYCO1 is a new carbon technology company based in Houston, Texas. HYCO1 CUBE™ Technology is developed, tested, and ready to deploy commercially at full-scale. HYCO1 collaborates with industrial companies worldwide to help them become more sustainable. The technology utilizes a revolutionary catalyst and process design to convert industrial scale CO 2 emissions into low carbon intensity syngas and green chemicals. HYCO1's technology enables the use of third-party CO 2 as a feedstock to simultaneously lower the operational cost of industrial gas production while creating zero to negative emissions from the process. The innovative technology creates low-cost, low-carbon hydrogen and carbon monoxide, which are used as chemical building blocks to create various downstream products, including Synthetic Base Oils used in lubricants, Low-Carbon Jet Fuel, Green Methanol, Ammonia, Urea, and others. About Kansas Ethanol: Located in Lyons, KS, Kansas Ethanol is an industry-leading, best-of-class 80 million gallon per year fuel and USP grade ethanol facility. The company began producing ethanol from its ICM-designed and constructed facility in 2008. Since then, Kansas Ethanol has been at the forefront of innovation and sustainability, diversifying its bio-feedstocks, revenue streams, and continuously reducing its carbon footprint. Media Inquiries Sarah Williams W: Digital Dream Team E: [email protected] P: 919-995-5388 Company Inquiries Kurt Dieker W: HYCO1 E: [email protected] Mike Chisam W: Kansas Ethanol E: [email protected] SOURCE HYCO1","filter_flag":1}
{"title":"Exterior and Interior Surfaces Can Help Mitigate Air Pollution - ARCHITECT Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9EZXNpZ24vZXh0ZXJpb3ItYW5kLWludGVyaW9yLXN1cmZhY2VzLWNhbi1oZWxwLW1pdGlnYXRlLWFpci1wb2xsdXRpb25fb9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9EZXNpZ24vZXh0ZXJpb3ItYW5kLWludGVyaW9yLXN1cmZhY2VzLWNhbi1oZWxwLW1pdGlnYXRlLWFpci1wb2xsdXRpb25fb9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9EZXNpZ24vZXh0ZXJpb3ItYW5kLWludGVyaW9yLXN1cmZhY2VzLWNhbi1oZWxwLW1pdGlnYXRlLWFpci1wb2xsdXRpb25fb9IBAA","guidislink":false,"published":"Fri, 28 Jul 2023 15:10:20 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=28, tm_hour=15, tm_min=10, tm_sec=20, tm_wday=4, tm_yday=209, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9EZXNpZ24vZXh0ZXJpb3ItYW5kLWludGVyaW9yLXN1cmZhY2VzLWNhbi1oZWxwLW1pdGlnYXRlLWFpci1wb2xsdXRpb25fb9IBAA?oc=5\" target=\"_blank\">Exterior and Interior Surfaces Can Help Mitigate Air Pollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ARCHITECT Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Exterior and Interior Surfaces Can Help Mitigate Air Pollution - ARCHITECT Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmFyY2hpdGVjdG1hZ2F6aW5lLmNvbS9EZXNpZ24vZXh0ZXJpb3ItYW5kLWludGVyaW9yLXN1cmZhY2VzLWNhbi1oZWxwLW1pdGlnYXRlLWFpci1wb2xsdXRpb25fb9IBAA?oc=5\" target=\"_blank\">Exterior and Interior Surfaces Can Help Mitigate Air Pollution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ARCHITECT Magazine<\/font>","source.href":"https:\/\/www.architectmagazine.com","source.title":"ARCHITECT Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"courtesy ECE Summer was once a season for maximizing time spent outdoors, but the increasing frequency and severity of wildfires have made breathing outdoor air hazardous in many regions. The United Nations estimates that the number of wildfires worldwide will increase 50% by 2100 and warns that governments remain unprepared. Wildfire emissions contain small particles (PM2.5), ozone, carbon monoxide, nitrous oxide, and other pollutants that pose direct human health risks, such as asthma attacks and other respiratory ailments. Given the guidance to limit one’s time outdoors during such events, buildings are a critical shield against pollution’s adverse effects. Ensuring a well-sealed architectural envelope and using effective filters (like MERV 13 models) in HVAC equipment can help reduce wildfire smoke penetration in buildings. In addition to these strategies, advances in material technologies demonstrate how exterior and interior surfaces can play essential roles in mitigating air pollution. courtesy ECE For example, researchers at Germany’s Rhine-Westphalian Technical University of Applied Sciences Aachen have developed a textile-based façade system that improves air quality. Created in partnership with German real estate developer ECE, the air-purifying product is made of a fine mesh-polymer fabric derived from recycled PET bottles. The active ingredient is a photocatalytic coating that causes nitrogen oxides to bind to the surface in the presence of sunlight. The pollutants are then converted via oxidation into non-toxic salts, which wash off the self-cleaning surface during rain events. A test application of the anti-smog textile, which demonstrated a 55% reduction in airborne nitrogen oxides, was installed on an ECE office building in Hamburg in 2020. 3M offers another pollution-fighting surface in the form of a roofing application. The Minnesota company’s Smog-reducing Granules, created by its Industrial Mineral Products Division in 2018, are photocatalytic particles used to coat roofing products like residential asphalt shingles. A test by the Lawrence Berkeley National Laboratory in California revealed that 3M shingles composed of 5% Smog-reducing Granules and 95% conventional granules measurably reduced nitrogen oxide. According to 3M, one ton of these granules can mitigate the equivalent of a year’s worth of smog generated by one vehicle traversing 3,000 miles. Other technologies absorb atmospheric carbon. Seville, Spain-based Graphenstone manufactures air-purifying paints that absorb carbon as they cure. As the lime-based paint dries, it reacts with carbon dioxide and forms calcium carbonate. While this conversion process is most pronounced during the initial curing, it continues throughout the life of the material. A test conducted on a paint application at a hospital in Ecuador revealed impressive results. “Before painting, the CO 2 value was three and a half times higher than the value reported after the paint application, going from 16,830 to 4,809 parts per million,” the manufacturer explains. This significant reduction allowed the air quality to meet the pollution limit—5,000 parts per million—established by the Occupational Safety and Health Administration. Wallpaper is another product for the air-cleaning arsenal. Italy-based manufacturer Caos Creativo offers the Ecopur Air-Wall, a surface treatment that removes a variety of airborne pollutants, including smog particles as well as bacteria and other pathogens. The wallpaper utilizes ionizing resin that functions with or without ambient light, passively purifying the air and removing undesirable odors. The manufacturer explains that air should ideally have a concentration of 1,000 to 3,000 negative ions per cubic centimeter, the equivalent air quality of most exurban areas, and claims that the Ecopur Air-Wall results in a range of 2,000 to 4,000, comparable to “mountain and forest air,” according to its website. Living systems can also contribute to the pollution-mitigating cause. London-based ecoLogicStudio has developed a variety of bio-based installations that utilize living organisms such as microalgae to improve environmental quality. The firm’s recent Habitat One project in Seoul, South Korea incorporates 40 algae photobioreactors, a biomass-harvesting photosynthetic reactor wall, and a multistory carbon-capturing tree sculpture. As a holistic system, Habitat One demonstrates how air purification, carbon sequestration, and biomass generation may be employed as interrelated strategies. “Imagining a carbon-neutral city implies the complete redefinition of all our production, construction and waste recycling processes,” ecoLogicStudio co-founder Claudia Pasquero told Dezeen. Considering the increased occurrences of wildfires and other forms of atmospheric air pollution, buildings will serve as vital refuges. “Buildings are a critical element for climate resiliency,” claimed John Mandyck, CEO of New York–based nonprofit Urban Green Council, in a Bloomberg interview. Airtightness and mechanical filtration are proven methods for ensuring buildings’ effectiveness in this role, but material-based solutions also represent compelling enhancements for the air-purifying toolkit. Because most material solutions are passive in nature, they do not increase operational energy use and continue to function in the event of power outages. Given our future meteorological outlook, architects should consider combining mechanical and surface-based strategies to improve overall air quality. The views and conclusions from this author are not necessarily those of ARCHITECT magazine or of The American Institute of Architects. Read more: The latest from columnist Blaine Brownell, FAIA, includes looks at Junya Ishigami’s KAIT Plaza, a homewares line made from recycled footwear, and immersive art exhibitions.","filter_flag":1}
{"title":"REPLENISH NUTRIENTS ANNOUNCES $7 MILLION IN NON-DILUTIVE FUNDING - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmVwbGVuaXNoLW51dHJpZW50cy1hbm5vdW5jZXMtNy1taWxsaW9uLWluLW5vbi1kaWx1dGl2ZS1mdW5kaW5nLTg3OTYyMDg2Ny5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmVwbGVuaXNoLW51dHJpZW50cy1hbm5vdW5jZXMtNy1taWxsaW9uLWluLW5vbi1kaWx1dGl2ZS1mdW5kaW5nLTg3OTYyMDg2Ny5odG1s0gEA?oc=5","id":"CBMidGh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmVwbGVuaXNoLW51dHJpZW50cy1hbm5vdW5jZXMtNy1taWxsaW9uLWluLW5vbi1kaWx1dGl2ZS1mdW5kaW5nLTg3OTYyMDg2Ny5odG1s0gEA","guidislink":false,"published":"Wed, 12 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=193, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmVwbGVuaXNoLW51dHJpZW50cy1hbm5vdW5jZXMtNy1taWxsaW9uLWluLW5vbi1kaWx1dGl2ZS1mdW5kaW5nLTg3OTYyMDg2Ny5odG1s0gEA?oc=5\" target=\"_blank\">REPLENISH NUTRIENTS ANNOUNCES $7 MILLION IN NON-DILUTIVE FUNDING<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"REPLENISH NUTRIENTS ANNOUNCES $7 MILLION IN NON-DILUTIVE FUNDING - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcmVwbGVuaXNoLW51dHJpZW50cy1hbm5vdW5jZXMtNy1taWxsaW9uLWluLW5vbi1kaWx1dGl2ZS1mdW5kaW5nLTg3OTYyMDg2Ny5odG1s0gEA?oc=5\" target=\"_blank\">REPLENISH NUTRIENTS ANNOUNCES $7 MILLION IN NON-DILUTIVE FUNDING<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Sequestration\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"\/NOT FOR DISSEMINATION IN THE UNITED STATES OR FOR DISTRIBUTION TO UNITED STATES WIRE SERVICES\/ OKOTOKS, AB, July 12, 2023 \/CNW\/ - Replenish Nutrients Ltd. (\"Replenish\"), a wholly-owned subsidiary of EarthRenew Inc. (CSE: ERTH) (OTCQB: VVIVF) (\"EarthRenew\" or the \"Company\"), is pleased to announce it has been selected to receive a $7 million grant from Emissions Reductions Alberta (ERA) as part of Alberta's Industrial Transformation Challenge. The ERA grant will support the construction of a new regenerative fertilizer manufacturing facility near Debolt, Alberta, and will support local Alberta construction and manufacturing jobs as well as reduce green house gas (GHG) emissions compared to the traditional fertilizer manufacturing process and lead to increased carbon sequestration properties in the soil through the use of regenerative fertilizers. As part of the ERA application process, an independent study on GHG emissions was conducted showing that over 22,000 tons of CO 2 e per year would be avoided based on the facility's contemplated production of 50,000 metric tons of regenerative fertilizer per year. Also contemplated under the ERA application was the creation of 200 cumulative construction jobs and 50 permanent and direct and indirect jobs as a result of the construction and ongoing operation of the Debolt facility. The Debolt facility will produce up to 50,000 metric tons of regenerative fertilizer per year. Commissioning of the Debolt facility is expected in late 2024 or early 2025. The ERA grant is not required to be repaid. Over the coming weeks, the Company will be submitting the required follow-up project documentation and debt financing to the ERA to finalize the funding late in the second quarter or early in the third quarter of 2023. The finalization of the ERA grant is subject to typical financing conditions including due diligence and execution of formal agreements. Regenerative fertilizer is poised to be a game changer for agriculture producers across Canada and around the world by replacing traditional synthetic fertilizers, which are often high in harmful nitrous oxide and emissions-intensive to produce. Replenish's low-salt alternative, pioneered and patented by the company is manufactured with zero waste, using recycled organic matter such as mushroom waste and elemental mineral sources providing solutions to some of the most pressing challenges facing producers. The result is a fertilizer that increases microbial activity, restores the nutrient balance of the soil, fewer emissions, higher yields, and reduced input costs for farmers at a time when those costs have been skyrocketing. As stated by CEO Neil Wiens: \"We believe Replenish's unique and patented regenerative fertilizer products will put Alberta in a leadership position in the Agriculture sector with regards to reducing GHG emissions from fertilizer manufacturing while also contributing to improved carbon sequestration properties in the soil and allowing growers to maximize their soil and plant health and vitality. According to the Government of Canada1, agriculture activities accounted for approximately 7% of Canada's overall GHG emissions while the Environmental Protection Agency2 in the Unites States estimates agriculture, forestry and other land use accounts for approximately 24% of global GHG emissions. We believe our products will play a key role in the sustainability of the agriculture sector in Alberta and beyond and we'd like to thank the ERA for placing their trust and confidence in our Company's ability to deliver a win-win solution for the environment and farmer economics.\" 1 https:\/\/agriculture.canada.ca\/en\/agricultural-production\/agricultural-greenhouse-gas-indicator 2 https:\/\/www.epa.gov\/ghgemissions\/global-greenhouse-gas-emissions-data About Replenish Nutrients Replenish Nutrients is an Agricultural Biotechnology company and a leading intellectual property developer of regenerative fertilizer solutions and sustainable manufacturing processes to support a farm system that puts healthy soils and grower profitability back on the table. By combining Canadian-sourced nutrients with our proprietary delivery system, Replenish has developed a sustainable alternative to synthetic fertilizers that enhances overall soil function and biology while providing valuable plant-available nutrients farmers rely upon for healthy crops. To learn more about Replenish Nutrients products, visit our website at www.replenishnutrients.com. About EarthRenew Inc. Replenish Nutrients is a wholly-owned subsidiary of EarthRenew Inc. (CSE: ERTH) (OTCQB: VVIVF). Cautionary Note Regarding Forward-Looking Information This press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the following: the receipt of the ERA grant and the amount and timing thereof; the construction of the Debolt facility and the timing of the commissioning thereof; the operational capacity of the Debolt facility; the Company's ability to obtain debt financing for the Debolt facility and the timing and amount thereof; the environmental impacts of the Debolt facility; and other financial and operating results of the Company. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\", \"may\", \"would\", \"should\", \"could\", \"plans\", \"expects\", \"budget\", \"schedule\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", \"believes\", and similar expressions, including variations thereof and negative forms. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: access to capital; lack of demand for the Company's products; delays and cost overruns that may occur with construction projects; general business, economic, competitive, geopolitical and social uncertainties; regulatory risks; other risks of the fertilizer industries and other risk factors disclosed in our public disclosure which can be found under our profile on SEDAR at www.sedar.com. Readers are cautioned that these risk factors should not be construed as exhaustive. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws. This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the \"U.S. Securities Act\") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available. Neither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE Replenish Nutrients Ltd. Replenish Investor Relations, Email: [email protected]","filter_flag":1}
