{"title":"Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5","id":"CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3N1cnZleS1yZXZlYWxzLWNvbnN1bWVycy1wcmlvcml0aXplLXB1cmNoYXNpbmctc3VzdGFpbmFibGUtcHJvZHVjdHMtYW5kLWRlc2lyZS1ncmVhdGVyLXRyYW5zcGFyZW5jeS1mcm9tLWNvbXBhbmllcy1vbi1zdXN0YWluYWJpbGl0eS1wcm9ncmVzcy0zMDE5ODg4MzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Survey Reveals Consumers Prioritize Purchasing Sustainable Products and Desire Greater Transparency from ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Specright's research reveals consumer preferences for product and packaging sustainability; finds most believe companies today are not accurately reporting on sustainability goals and metrics TUSTIN, Calif., Nov. 15, 2023 \/PRNewswire\/ -- More than three-quarters (80%) of consumers surveyed said they are more likely to trust companies that back up their sustainability claims with publicly shared data, and 25% actively track government regulations around sustainability to better understand how it impacts their favorite brands and products. That's according to a new survey by Specright , the leader in Specification Management software, with findings indicating that consumers today have a heightened awareness when it comes to sustainability and transparency from companies on their products and progress around sustainability goals. However, 69% of consumers don't believe companies today are accurately and honestly reporting on sustainability goals and metrics, and 40% are not comfortable purchasing products from companies that are not actively tracking toward sustainability goals. Amid this increased awareness, consumers are switching up their purchasing behaviors, with primary purchasers often putting their money toward more sustainable products. More than half (58%) of consumers indicated they are willing to spend more money on products that are deemed sustainable or environmentally friendly. Further, 74% of consumers indicated they are more likely to purchase from a company that is transparent about its sustainability practices (i.e., claiming carbon-neutrality, phasing out single-use plastics, using terms such as 'eco' or 'biodegradable,' etc.) and shares updates on progress toward sustainability goals frequently. Outside of making more sustainable purchasing decisions, consumers also have a desire to recycle and properly dispose of the products they buy but are putting the onus on companies and brands to tell them how to do so correctly. In fact, 82% of consumers say they are more likely to recycle products if companies and brands include the appropriate steps for how to recycle correctly directly on the product or packaging. This sentiment around sustainability can be expected to translate into 2024 purchasing decisions, as 71% of consumers revealed they plan to make more sustainable purchasing decisions next year. \"These results show consumers care about the sustainability of the products and packaging they purchase and the companies and brands they purchase from, and clearly companies have more work to do on this front,\" said Matthew Wright, founder and CEO of Specright. \"The results emphasize the importance of data and how it can influence a consumer's decision to purchase products, and many organizations today lack the data to back up their claims or even correctly track and report on sustainability goals, which can negatively impact business. As we move into 2024, it's imperative that companies organize and digitize critical product and packaging data to make reporting on sustainability as accurate as possible and even spark more sustainable product innovation.\" Additional survey findings revealed: Approximately 71% of consumers are more likely to believe a company's sustainability claims if they are printed directly on the product or packaging (i.e. similar to a nutritional label). More than half (53%) of consumers are willing to pay more money for a product with sustainable packaging versus a product with cheaper, non sustainable materials. While consumers are backing up their sustainability beliefs with their wallets, this can depend on certain factors like product or packaging material with consumers confirming they would pay more for: recycled cardboard (50%), cornstarch foam \/ water soluble packaging (48%), reusable plastic totes (62%), products with the terms like 'eco,' 'biodegradable' or 'recyclable' on packaging (55%), to name a few. More than two-thirds of consumers (67%) claim they don't know what the term greenwashing means. When it comes to holiday shopping this year, nearly two-thirds (62%) of consumers prefer to bundle items purchased from online retailers together and receive them at a later date as they believe it's more sustainable. Survey methodology: Specright surveyed 1,000 consumers above the age of 21 in the U.S. who indicated they are a primary purchaser in their household using the online insights platform Pollfish. This survey was completed in November 2023. ‍About Specright Specright is the first purpose-built, patented platform for Specification Management. Whether it's packaging, raw materials, formulas, products, or machines, Specright helps companies digitize, map, and take action across their supply chain to reduce costs, increase profitability, and drive sustainability. Specright serves customers across industries, including packaging, food and beverage, consumer packaged goods, pharmaceutical, retail, industrials, and more. Recognized as a leader in Specification Management, Specright was named one of Fast Company's Most Innovative Companies for 2023, had three executives honored as Supply & Demand Chain Executive Pros to Know in 2023 and won Food Logistics' 2022 Top Software & Technology Provider award. For more information, visit: www.specright.com . For media inquiries, contact: SHIFT Communications [email protected] SOURCE Specright","filter_flag":1}
{"title":"Capture or reuse CO2 as a chemical source for the production of sustainable plastics - EurekAlert","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvMTAwNzc0M9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvMTAwNzc0M9IBAA?oc=5","id":"CBMiMGh0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvMTAwNzc0M9IBAA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvMTAwNzc0M9IBAA?oc=5\" target=\"_blank\">Capture or reuse CO2 as a chemical source for the production of sustainable plastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EurekAlert<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Capture or reuse CO2 as a chemical source for the production of sustainable plastics - EurekAlert","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LmV1cmVrYWxlcnQub3JnL25ld3MtcmVsZWFzZXMvMTAwNzc0M9IBAA?oc=5\" target=\"_blank\">Capture or reuse CO2 as a chemical source for the production of sustainable plastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EurekAlert<\/font>","source.href":"https:\/\/www.eurekalert.org","source.title":"EurekAlert","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A scientific team has developed a new polyurethane production technique using CO 2 to create new types of easily recyclable plastics. The study, published in the Journal of the American Chemistry Society (J.A.C.S.), could provide a solution for the development of truly sustainable plastics. Commodity plastics have transformed global industry. Whether in construction, clothing, vehicles or food packaging, these plastics are everywhere in our daily lives, so much so that their global use has been estimated at around 460 million tons in 2019. This number is staggering, but not surprising, because plastics, also known as synthetic polymers, have met a large success thanks to their irreplaceable characteristics: they are light, cheap and incredibly versatile,\" explains Christophe Detrembleur, a chemist at the University of Liège. However, the fact that they are difficult to recycle, or even impossible to recycle in the case of thermosets, has serious consequences\". This impossibility of recycling not only leads to the depletion of the fossil resources used to manufacture them, but also to their very long-term accumulation in nature and the oceans. It is therefore imperative for our society to quickly design and manufacture plastics that can be easily recycled at the end of their life. In this context, a study led by researchers at the University of Liège and carried out in collaboration with the University of Mons and the University of the Basque Country, reports on a new technique for producing easily recyclable polyurethane plastics. The special feature of this approach is the use of carbon dioxide (CO 2 ) - a major emblematic waste of our society - as a raw material for the production of the building blocks, or monomers, needed to manufacture these new products,\" explains Thomas Habets, PhD student at ULiège and first author of the article. The structure of the monomers can be easily modified, making it possible to produce plastics with a wide range of properties, from highly malleable elastomers such as silicones to more rigid materials such as polystyrene\". These plastics have a chemical structure that resembles a three-dimensional network rather than long linear chains. This structure, which is generally associated with thermosets that are very difficult to recycle, makes them more resistant than plastics made from long molecular chains. The polyurethanes created here have new 'dynamic' chemical bonds, which means that despite their thermoset structure, they can be reshaped by exchanges of chemical bonds under relatively mild reaction conditions. The greatest advantage of this new technology lies in its ability to vary the range of properties accessible while offering multiple ways of recycling materials at their end-of-life. \" These new plastics can be recycled in multiple ways, either by simply reshaping them by heating them, or by mixing different types of plastic to create hybrid materials with new properties, or by breaking them down into their constituent monomers, which is ideal for eliminating additives such as dyes or recycling composites,\" continues Thomas Habets. With a view to the future industrialization of CO 2 valorization, this study demonstrates that waste CO 2 can be directly used as a chemical resource. \"This is the first initial study using our new building blocks and plastics,\" enthuses Christophe Detrembleur, \"but it is quite remarkable to see that our materials can already reach properties similar to those of some conventional petro-sourced plastics.” This new technology is emerging as a potential solution for the development of sustainable plastics with a wide range of properties that can easily meet the needs of most of our everyday applications.","filter_flag":1}
{"title":"Designing for sustainability: Soisa studies pecan shells for interiors - Runway Girl Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vcnVud2F5Z2lybG5ldHdvcmsuY29tLzIwMjMvMTEvZGVzaWduaW5nLWZvci1zdXN0YWluYWJpbGl0eS1zb2lzYS1zdHVkaWVzLXBlY2FuLXNoZWxscy1mb3ItaW50ZXJpb3JzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vcnVud2F5Z2lybG5ldHdvcmsuY29tLzIwMjMvMTEvZGVzaWduaW5nLWZvci1zdXN0YWluYWJpbGl0eS1zb2lzYS1zdHVkaWVzLXBlY2FuLXNoZWxscy1mb3ItaW50ZXJpb3JzL9IBAA?oc=5","id":"CBMibGh0dHBzOi8vcnVud2F5Z2lybG5ldHdvcmsuY29tLzIwMjMvMTEvZGVzaWduaW5nLWZvci1zdXN0YWluYWJpbGl0eS1zb2lzYS1zdHVkaWVzLXBlY2FuLXNoZWxscy1mb3ItaW50ZXJpb3JzL9IBAA","guidislink":false,"published":"Tue, 21 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=325, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vcnVud2F5Z2lybG5ldHdvcmsuY29tLzIwMjMvMTEvZGVzaWduaW5nLWZvci1zdXN0YWluYWJpbGl0eS1zb2lzYS1zdHVkaWVzLXBlY2FuLXNoZWxscy1mb3ItaW50ZXJpb3JzL9IBAA?oc=5\" target=\"_blank\">Designing for sustainability: Soisa studies pecan shells for interiors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Runway Girl Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Designing for sustainability: Soisa studies pecan shells for interiors - Runway Girl Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vcnVud2F5Z2lybG5ldHdvcmsuY29tLzIwMjMvMTEvZGVzaWduaW5nLWZvci1zdXN0YWluYWJpbGl0eS1zb2lzYS1zdHVkaWVzLXBlY2FuLXNoZWxscy1mb3ItaW50ZXJpb3JzL9IBAA?oc=5\" target=\"_blank\">Designing for sustainability: Soisa studies pecan shells for interiors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Runway Girl Network<\/font>","source.href":"https:\/\/runwaygirlnetwork.com","source.title":"Runway Girl Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"From cork and wood to fishing nets and cactus, a variety of intriguing eco-friendly materials are under study by aviation stakeholders for their potential use in commercial aircraft cabins. Soisa Aircraft Interiors, for instance, confides that it is actively exploring innovative ways to use sustainable materials such as those derived from pecan and corn shells or peel. “These natural materials are abundant and exhibit remarkable strength when combined with other substances. They have the potential to be transformed into various key components such as shrouds and tray tables,” says Jacobo Mesta, CEO of Soisa, a fast-growing company that specialises in seat covers, cushions, composite panels, upholstery, and seat assembly services. Indeed biodegradable pecan shells, which can give a woody look to the finished product and is used elsewhere for resins “can be effectively transformed into a plastic-like material”, notes Mesta. “This innovation holds the potential to be utilized in the aerospace industry, particularly in interior products.” “The challenge,” he adds, “lies in obtaining approval for these products for use, which presents clear difficulties due to stringent regulations, but we are committed to persevering in our efforts.” Indeed, obtaining FAA and EASA certification for new products continues to remain a major challenge due in part to industry’s understandably exacting flammability certification requirements. Individuals with nut allergies might also bristle at the notion of using pecan shells in interiors. Ensuring that no pecan protein is found in the final result may be key. In addition to its investigation into the use of bio-based composite materials as part of industry’s decarbonisation efforts, Soisa continues to explore opportunities for recycling various aircraft interiors. “However, it’s essential to note that when it comes to existing materials already within the aircraft and our specific line of business, we have not yet identified a product that can be reintegrated into the aircraft,” reveals Mesta. “While our sustainability efforts are making strides in some areas, there are still challenges associated with repurposing certain materials within our industry.” Indeed, to his latter point, whilst some major thermoplastic providers, including SIMONA Boltaron, have cracked the code to achieve true recycling of aerospace-rated sheets for aircraft interiors — in instances where aesthetic perfection is not required — the material is from recycled scrap and not from thermoplastics that have already been used in aircraft interiors. Elsewhere, however, Soisa has been demonstrating its environmental, social and governance (ESG) credentials by embracing a creative ‘Waste to Wonder’ upcycling programme that sees the Chihuahua, Mexico-headquartered firm work with an artisans’ cooperative from the local Tarahumara people, providing seat covers, curtains and other material from aircraft. In turn, the artisans transform what would have been waste material into handmade handicrafts: wallets, bags, tablet cases, pouches, bottle carriers, and much more. “We’re proud of the significant success we’ve achieved across our Waste to Wonder project. Through the campaign, we reuse excess and waste materials that would otherwise end up in landfills and use this to teach the local Tarahumara tribe how to cut and sew for products they can use or sell. We are continuously looking at ways we can expand the project,” says Mesta. Outside of industry’s sustainability efforts, Soisa observes that airlines largely remain conservative in their interior design choices. “In terms of design, we haven’t seen a lot of ‘risk-taking’ in recent years,” says Mesta. “Popular themes primarily revolve around common shapes, colors, and materials. To demonstrate this point, we’ve invested in a CNC stitching machine that can accommodate intricate and unique designs, but we haven’t had many opportunities to fully utilise it. Despite this, we still manage to sew a wide range of designs manually with our skilled workforce. While there have been instances of unusual colors like yellow, orange, and red, differences from traditional colors aren’t very common.” Regarding the promise of 3D-printed interiors, progress has been relatively slow, particularly in the commercial sector, he admits. “This is often due to the high volumes needed to justify the significant investment required. “However, we’ve found a practical workaround by creating a 3D printing model and subsequently transitioning the same design into an injection moulding process. This approach maintains the design but can also offer a faster return on investment, making it an attractive option in certain cases.” Related Articles: Featured image credited to Soisa Aircraft Interiors","filter_flag":1}
{"title":"FEATURE: Sustainability Drive - interior design - Business Jet Interiors","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5","id":"CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5\" target=\"_blank\">FEATURE: Sustainability Drive - interior design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Jet Interiors<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"FEATURE: Sustainability Drive - interior design - Business Jet Interiors","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vd3d3LmJ1c2luZXNzamV0aW50ZXJpb3JzaW50ZXJuYXRpb25hbC5jb20vZmVhdHVyZXMvZmVhdHVyZS1zdXN0YWluYWJpbGl0eS1kcml2ZS1pbnRlcmlvci1kZXNpZ24uaHRtbNIBAA?oc=5\" target=\"_blank\">FEATURE: Sustainability Drive - interior design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Jet Interiors<\/font>","source.href":"https:\/\/www.businessjetinteriorsinternational.com","source.title":"Business Jet Interiors","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Representatives of aircraft OEM s and interior design firms discuss strategies for sustainability Anne Farken, associate director, sustainability and creative consulting, Designworks, a BMW Group Company Is sustainable design of growing interest to the market? GenZ can see through greenwashing quickly and expects companies to treat them as equals. Brands that really contribute to society and environment will make a deep connection to the next generation. What factors matter when trying to make sustainable choices? Designers need to think about environmental and social responsibility in terms of raw materials, production, transportation, product use, disposal and recycling. This will lead to the adoption of new business models that measure success in new ways. Should the industry improve how sustainability is talked about? A lot of the terminology has no standard definition – but I’m happy to share my understanding. ‘Eco-design’ considers environmental factors in design, while ‘sustainable design’ also includes social aspects. ‘Circular design’ aims to reduce waste and enhance resource efficiency, often utilising strategies like ‘product as a service’ and emphasising reparability and maintenance. ‘Regenerative design’ goes further, considering cultural and societal factors, actively contributing to the regeneration of eco-systems and communities. Words like ‘sustainability’ and ‘innovation’ have become vague buzzwords. At Designworks, we address sustainability in very specific terms at the start of every project. Together with our partners, we define the purpose of the project, formulate measurable goals and reflect on the questions we want to answer. We call this ‘design for intention’. How can companies best integrate sustainability into their culture? Firstly, by embracing that profitability and sustainability are not mutually exclusive. New key performance indicators (KPIs) are evolving to reflect this synergy. Secondly, it’s not enough to make sustainability an agenda item. Integrating external partners and nurturing cross-functional teams enhances the potential for fresh perspectives in future-proofed solutions. It’s equally vital to embed these changes in underlying structures. Thirdly, accept that change is positive! We’re transitioning from an industrial to a knowledge society, where creativity is pivotal for progress. Leveraging designers’ intuition and their expertise in utilising complexity, even within the realm of business strategy, is crucial for driving the transformation towards a future we all want to live in. Jay Beever, VP, Embraer Design Operations How have your design ideas progressed since the Praeterra concept? We’ve introduced sustainable recycled and upcycled materials into our new product development pipeline, so down the line we could have sustainability collections that people can pull from. For example, we’re looking at 3D-printing titanium for interior trim components, using leftover material from the production process in Brazil. I have sample parts in my office of our Phenom cupholder area, 3D-printed in titanium with a beautiful bead-blasted satin finish. It’s not plated, it’s made from scrap titanium dust. Praeterra had the Mokume-gane, made from folded-up metals, created into a billet. It didn’t need to be plated, because the grain work was the beauty. What new innovations have caught your eye? For instance, at EBACE I met with Paolo Foglizzo of Foglizzo Leather, which takes scrap leather, mixes it into a fibre mush, and creates a new leather sheet material, a composite with 15% polyester. I looked at it, smelled it; it’s leather. I’m absolutely thrilled with it. There’s limitations on colour right now, but that’ll expand. Suppliers are also sourcing hides from farms that raise cattle for food, which would otherwise be thrown away. And they can pick cattle that have been fed seaweed. Including seaweed in feed reduces a cow’s methane output dramatically. There’s a long chain of detail that goes into a material’s carbon footprint. Natalie Rodríguez, principal, Natalie Rodríguez Luxury Design Is sustainable design of growing interest to clients? There’s definitely been an increase in demand over the last few years. On a recent project the client took great interest in the undyed\/natural heather dye carpets Kalogridis unveiled at NBAA-BACE 2022. This customer also didn’t want to use materials with PFA substances – synthetic chemicals resistant to heat, grease, oil and water, and also resistant to degradation in the environment. We double checked with suppliers that PFAs weren’t used in the production of their materials or FR treatments. What factors matter when trying to make sustainable choices? My favourite factors to consider are positive environmental impact as well as anything that isn’t artificial, but rather, naturally sourced. Customers are also a driving factor – some requests might include all natural, plant-based materials, without any plastics or animal by-products, while some request to have seat leather, but to make sure everything is sustainably sourced and produced responsibly. What are the challenges to overcome to make more progress? There might be more hesitation to incorporate new ideas and products that are sustainable simply because they haven’t been used many times before. There might be questions regarding how long certain materials will hold up over time, and how colours from naturally sourced products really turn out in production since there is less control in colour variances or lack of a dye lot. What other solutions would you like to see developed by suppliers? I’m loving the direction suppliers are currently moving in – utilising resources found in our natural environment through new plant-based and recyclable materials, as well as natural dyes for colour. It would be wonderful to see more suppliers come out with their own sustainability lines to provide a variety of options. There are many beautiful sustainable materials that have been developed in other industries that would be great to use in aviation applications. It would be wonderful for suppliers to invest in having any new and innovative materials tested for applicable burn and\/or sliding friction and have the information readily available on the label and their website catalogue. This way aviation interior designers can select their materials with the utmost assurance. This would especially be applicable to suppliers looking to break into aviation, as those that are already in the industry are more likely to test\/certify anything new prior to offering these to designers. Tray Crow, director, interior design, Gulfstream Is sustainable design of growing interest to clients? Yes – certainly more so now than perhaps 10 years ago. It’s part of how we operate. The new galley on the G700 has a dual-zone trash compartment for example. That’s something we added so that flight attendants can separate recyclables to waste. Even in building aircraft, it’s always been about efficiency, and how we provide more for less. What are some of your sustainability efforts when it comes to materials? With our seat leather, all our patterns for the seats are digitised now. Everything’s cut on a Gerber cutter so we maximise the use of every hide. Specifying leather on high-wear surfaces is important because it’s a durable material – it lasts five times longer than most soft goods. Leather is a by-product of the meat industry and we’re diverting that from landfill. Any waste that we do have is donated either to charities or schools. Some of our waste leather has been turned into soccer balls for schools and communities in need. Everything that goes into our carpet is natural, down to the latex backing and the jute structure that provides the canvas. The tufting is either silk or wool, both rapidly renewable resources. One of our suppliers carries the Greenguard certification, so that’s available to our customers as well. About 40% of the veneer we specify is composite veneer that comes from rapidly renewable resources. Veneer maximises yield anyway, because it consists of thin sheets applied to a substrate. We also focus on lightweight elements such as honeycomb materials. How would you like to see the wider industry respond? Innovation is a shared responsibility for the whole industry. With our suppliers, how they’re bringing new products to market, and working on sustainability within their own processes – bringing that to the forefront is important. Judy Miller, allied ASID, Judy Miller Interior Design Is sustainable design of growing interest to clients? Wellness continues to be of interest to clients and the A&D industry, driving vendors to go green. Should the industry improve how sustainability information is presented? OEMs would benefit by being more transparent with their sustainable initiatives and practices in their advertising. They could promote how they benefit customer wellness and are lowering their environmental impact. Sustainable alternative fuel efforts are great, but there’s so much about interiors that could be shared as well. Are there any sustainability-focused ideas that have caught your eye recently? I’ve been very impressed with soft goods suppliers moving more and more into sustainable products. Tapis is a standout. How else might the industry make progress? I’d like to see OEMs and refurbishment centres using more sustainable\/green substrates, foams and adhesives, as well as water-based paints for interior and exterior paint applications. I’d also like to see materials recycled whenever possible when removed from aircraft interiors, especially in refurbishments, much like how clients are recycling kitchen appliances, and donating kitchen cabinets and furniture to places such as Habitat for Humanity ReStore. Sylvain Mariat, head of creative design and concepts, Airbus Corporate Jets Was sustainability a design factor for the first ACJ TwoTwenty completion? Yes certainly; at the beginning of the project, we agreed that most of the material suppliers would be located not far away from Comlux’s completion facility in Indianapolis, USA, to minimise carbon footprint. We have also focused on the origin of the wood veneer used for the interior fittings and we decided to use wood with the Forest Stewardship Council (FSC) label. In what other ways have you addressed sustainability? It’s not new for us to address sustainability with materials. For example, we work with a French partner on a solvent-free paint that we propose to our customers. We can also talk about leather. We recommend vegetable tanning to our customers instead of chemical tanning. For carpets we use wool and silk – natural materials rather than synthetic materials. Beyond the materials used, we encourage our suppliers to propose cabin designs with optimised weight, mainly through design conception or the use of innovative lightweight composite. How do you design a cabin to have a long life? A sustainable cabin means also designing to avoid having to replace large parts to perform small repairs. For example, we make partitions from a combination of parts so that if there is a scratch, we only need to remove and repair one small part. I also like using paint on cabinetry because it can contribute to saving weight; it is easier to maintain; and to extend the component’s life. How important is recyclability? Our approach to environmental responsibility doesn’t end at the design stage. During manufacturing, after delivery and even at the end of an aircraft’s service life, we continue to search for ways to reduce the environmental footprint of our aircraft. Airbus and Tarmac Aerosave have established a proven method for decommissioning, dismantling and recycling the entire Airbus aircraft product range in an environmentally responsible way. We are able to recycle more than 90% of an aircraft. Mindy Huang, sales engineering, Bombardier Is there a lot of interest in sustainability from clients? A lot. Sustainability is a huge movement. A lot of clients think it important to reduce their footprint, so we have a whole catalogue of options and take a scientific approach to studying CO 2 impact and water scarcity. An example is Eucalyptus veneer. Eucalyptus grows very fast and doesn’t need to be uprooted to harvest; you can cut it at the trunk and it’ll regrow. It’s a very sustainable material. What is the aim with your environmental product declarations (EPDs)? We have a sustainability team that produces the EPDs. That studies every single part that goes on an aircraft, so we’re very transparent about the impact of the product’s lifecycle on the environment. The scientific assessment that underpins the EPD helps Bombardier to optimise the design of its products according to sustainable criteria. Is there anything else you wanted to share? Bombardier’s ESG plan includes a commitment to invest over 50% of our R&D towards greener aircraft by 2025. This feature was first published in the September\/October 2023 edition of Business Jet Interiors International.","filter_flag":1}
{"title":"YKK's 2023 Report: Leading the Way in Sustainability With 46.9% Greenhouse Gas Reduction - CSRwire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3JlcG9ydHMvNzg4MzkxL3lra3MtMjAyMy1yZXBvcnQtbGVhZGluZy13YXktc3VzdGFpbmFiaWxpdHktNDY5LWdyZWVuaG91c2UtZ2FzLXJlZHVjdGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3JlcG9ydHMvNzg4MzkxL3lra3MtMjAyMy1yZXBvcnQtbGVhZGluZy13YXktc3VzdGFpbmFiaWxpdHktNDY5LWdyZWVuaG91c2UtZ2FzLXJlZHVjdGlvbtIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3JlcG9ydHMvNzg4MzkxL3lra3MtMjAyMy1yZXBvcnQtbGVhZGluZy13YXktc3VzdGFpbmFiaWxpdHktNDY5LWdyZWVuaG91c2UtZ2FzLXJlZHVjdGlvbtIBAA","guidislink":false,"published":"Tue, 14 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=318, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3JlcG9ydHMvNzg4MzkxL3lra3MtMjAyMy1yZXBvcnQtbGVhZGluZy13YXktc3VzdGFpbmFiaWxpdHktNDY5LWdyZWVuaG91c2UtZ2FzLXJlZHVjdGlvbtIBAA?oc=5\" target=\"_blank\">YKK's 2023 Report: Leading the Way in Sustainability With 46.9% Greenhouse Gas Reduction<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"YKK's 2023 Report: Leading the Way in Sustainability With 46.9% Greenhouse Gas Reduction - CSRwire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LmNzcndpcmUuY29tL3JlcG9ydHMvNzg4MzkxL3lra3MtMjAyMy1yZXBvcnQtbGVhZGluZy13YXktc3VzdGFpbmFiaWxpdHktNDY5LWdyZWVuaG91c2UtZ2FzLXJlZHVjdGlvbtIBAA?oc=5\" target=\"_blank\">YKK's 2023 Report: Leading the Way in Sustainability With 46.9% Greenhouse Gas Reduction<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CSRwire.com<\/font>","source.href":"https:\/\/www.csrwire.com","source.title":"CSRwire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Published 11-14-23 Issued by YKK Corporation of America View Full Report Summary YKK Corporation has released “This is YKK 2023,” an integrated report updating stakeholders on YKK’s progress toward the Sustainability Vision 2050, the company’s roadmap for achieving climate neutrality by 2050. In FY2022, YKK achieved a 46.9% reduction in Scope 1 and 2 GHG emissions and a 20.9% reduction in Scope 3 GHG emissions compared to the FY2018 baseline. The company expanded its use of renewable energy, with 31 locations worldwide operating on 100% renewable power, a year-on-year increase of 20 locations. YKK increased its use of sustainable materials to 26%, a 14-point year-on-year improvement. Additionally, 27.6% of packaging materials transitioned to sustainable alternatives, and landfill waste was reduced by 525 tons. The target year to reach a 90% waste resource conversion rate was moved up from 2030 to 2025. YKK also reduced water intake by 1.3 million tons compared to the FY2018 baseline. YKK enhanced its chemical management by adopting ZDHC MRSL for manufacturing processes, integrating restricted substance management into product development, and renewing its OEKO-TEX® STANDARD 100 certification. YKK also expanded products produced using AcroPlating® technology. Furthermore, the company implemented YKK Global Criteria of Compliance self-checks and audits at applicable locations and revised the YKK Group Human Rights Policy. Report Highlights YKK Corporation has released “This is YKK 2023,” a comprehensive report that combines financial and non-financial insights, offering a holistic view of YKK's management and business endeavors guided by the Cycle of Goodness® corporate philosophy as well as the company's sustainability initiatives. This year’s report, available on the company’s website at https:\/\/www.ykk.com\/english\/corporate\/csr\/eco\/report\/index.html, shares the company’s progress in addressing five sustainability themes: climate change, material resources, water resources, chemical management, and respect for people. These efforts are aimed at realizing ten Sustainability Development Goals (SDGs) in line with the targets set forth in the YKK Sustainability Vision 2050, which aims to achieve carbon neutrality by 2050. Additionally, YKK has compiled a separate Data Book that provides detailed data on the company’s environmental, social, and governance efforts, as well as its finances. In 2019, YKK declared its support for the Task Force on Climate-Related Financial Disclosures (TCFD) and has been disclosing information according to the core elements of governance, strategy, risk management, and targets and metrics elements advocated by the TCFD framework. “The Cycle of Goodness places sustainability at the center of our management approach, with the primary objective of meeting the needs of our customers and local communities,” said Hiroaki Otani, President of YKK Corporation. “Our company's purpose is to be a socially responsible organization that not only benefits the natural environment but also contributes to the well-being of society, fostering shared prosperity. We are committed to practicing the Cycle of Goodness in order to fulfill the needs of our customers and communities while playing a vital role in building a sustainable society.” ■ Results of FY2022 Progress Toward Achieving the Goals of the YKK Sustainability Vision 2050 Climate Change 46.9% reduction in Scope 1 and 2 GHG emissions and 20.9% reduction in Scope 3 GHG emissions (from a FY2018 baseline) 31 locations worldwide operating on purchased power derived from 100% renewable energy (increase of 20 locations, year-on-year) Material Resources 26% of textiles in fastening products use recycled, plant-derived, and other sustainable materials (up 14 points year-on-year) 27.6% of packaging materials transitioned to sustainable packaging alternatives Landfill waste reduced by 525-tons year-on-year Waste resource conversion rate increased to 87.3% (up 0.3 points year-on-year) Target year to reach a 90% waste resource conversion rate moved up from 2030 to 2025 Water Resources 1,338,000-ton water intake reduction compared to FY2018 baseline (10,086,000-ton water intake in FY2022) Cooperation with Zero Discharge of Hazardous Chemicals (ZDHC) certification and testing programs approved to form guidelines for ZDHC-compliant zippers and buttons Chemical Management Annual revision to the YKK standards (known as YKK RSL [1]) to include AFIRM [2] RSL based on customer requirements and to incorporate guidelines for compliance with Perfluoroalkyl and Polyfluoroalkyl Substances (PFAS) regulations The adoption of ZDHC MRSL [3] approved for chemical management in manufacturing processes Restricted substance management incorporated into the development flow when developing new products or changing materials Annual renewal of the OEKO-TEX ® STANDARD 100 certification for YKK fastening products STANDARD 100 certification for YKK fastening products Expansion of products produced using YKK’s new AcroPlating® technology [4] Respect for People Implemented YKK Global Criteria of Compliance self-checks and audits at all applicable locations Reviewed and revised the items and scope of YKK Global Criteria of Compliance Revised the YKK Group Human Rights Policy ■ Major topics covered in This is YKK 2023 The Cycle of Goodness and Sustainability \/ President’s Message \/ Executive Dialogues \/ Cycle of Goodness and Value Creation \/ Sixth Mid-term Business Policy and Business Strategy \/ Results of FY2022 Progress Toward Achieving the Goals of the YKK Sustainability Vision 2050, FY2023 Planned Initiatives \/ Management Principles Promotion \/ Governance \/ Financial and Non-Financial Highlights About YKK YKK solves the most complex fastening and attaching challenges. Since the company’s founding in Tokyo in 1934, YKK has continuously set industry standards for quality, innovation, and sustainability in the production of zippers, plastic hardware, hook and loop fasteners, webbing tapes, and snap and buttons. YKK’s “solutions-first” approach leverages its extensive product and machinery portfolio, engineering expertise, and integrated production, service, and supply chain solutions in 70+ countries\/regions, leaving it well-positioned to support the growth of customers of all sizes and adapt to their evolving business needs. Guided by the CYCLE OF GOODNESS® philosophy – no one prospers without rendering benefit to others – YKK aims to contribute to a sustainable society. \"YKK\", \"YKK Little Parts. Big Difference.\", \"CYCLE OF GOODNESS\" and \"AcroPlating\" are registered trademarks or trademarks of YKK CORPORATION in Japan and other countries\/regions. \"OEKOTEX\" is trademark of ÖTI – Institut Für Ökologie, Technik und Innovation GmbH. ### Media contact: Jessica Cork, YKK Corporation of America (+1) 770-261-6123 1. Restricted Substances List 2. Apparel and Footwear International RSL Management Group 3. Manufacturing Restricted Substances List 4. A new plating technology for brass that eliminates 100% of hazardous substances such as cyanide, chromium, and selenium. View Full Report","filter_flag":1}
{"title":"19 Zero Waste Online Stores For A Plastic-Free Lifestyle - Pebble Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vcGViYmxlbWFnLmNvbS96ZXJvLXdhc3RlLW9ubGluZS1zdG9yZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vcGViYmxlbWFnLmNvbS96ZXJvLXdhc3RlLW9ubGluZS1zdG9yZXMv0gEA?oc=5","id":"CBMiL2h0dHBzOi8vcGViYmxlbWFnLmNvbS96ZXJvLXdhc3RlLW9ubGluZS1zdG9yZXMv0gEA","guidislink":false,"published":"Sat, 04 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=308, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vcGViYmxlbWFnLmNvbS96ZXJvLXdhc3RlLW9ubGluZS1zdG9yZXMv0gEA?oc=5\" target=\"_blank\">19 Zero Waste Online Stores For A Plastic-Free Lifestyle<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pebble Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"19 Zero Waste Online Stores For A Plastic-Free Lifestyle - Pebble Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiL2h0dHBzOi8vcGViYmxlbWFnLmNvbS96ZXJvLXdhc3RlLW9ubGluZS1zdG9yZXMv0gEA?oc=5\" target=\"_blank\">19 Zero Waste Online Stores For A Plastic-Free Lifestyle<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pebble Magazine<\/font>","source.href":"https:\/\/pebblemag.com","source.title":"Pebble Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The zero waste movement has exploded over the last few years, and more of us are saying good riddance to plastic-covered essentials and embracing eco-friendly, reusable packaging. However, with barely any plastic-free switches in grocery stores and fully package-free shops still few and far between, ditching the single-use can seem daunting. These zero waste online stores mean an utterly package-free pantry, bathroom, and bedroom needn’t remain a fantasy. Bypass the plastic and order the bread and butter from the comfort of your own home. Here’s our pick of the best package-free stores online. Our Curated List Of Online Plastic-Free Shops In the last five years, package-free shops online (and physical, for that matter) have popped up all around the world. While all have an admirable mission, some are simply better than others. We’ve looked across the US and UK to come up with a precise list of the best online bulk stores, eco-friendly grocery stores, and low-waste living resources currently available. Online Plastic-Free Stores USA 1. EarthHero Image by EarthHero About EarthHero’s Store ‘Sustainable shopping made simple’ is the tagline of our first zero waste store online—music to our ears. EarthHero debunks the rhetoric that living without plastic is difficult by providing thousands of sustainable items in one easy-to-navigate, zero waste outlet. Frequent buyers even get early access to exciting new sustainable or zero waste businesses. Just keep in mind that not every brand sold on EarthHero uses totally plastic-free packaging, but their sustainability specs on each product page make it super transparent which do or don’t. EarthHero’s Online Zero Waste Product Range Price Range | $–$$$$ | Shop EarthHero In terms of sheer volume and variety, EarthHero’s vast range of eco-friendly items is by far the best around, including things like: Biodegradable cotton swabs Bamboo toothbrushes Refillable glass spray bottles Zero waste deodorant sticks With new products added to the eco-friendly online shop regularly and an attractive rewards scheme, EarthHero is one of the best online zero waste shops in the US. Shop EarthHero 2. EcoRoots Image by EcoRoots About EcoRoots’ Zero Waste Online Store Browse the best plastic-free alternatives to your favorite everyday products at EcoRoots. This no plastic shop online helps reduce waste in your daily routine, focusing on bath, beauty, home, and kitchen items. EcoRoots’ Affordable Zero Waste Products Price Range | $–$$ | Shop EcoRoots The company’s bundles and zero waste kits—like the Complete Skincare Mini Kit—are a fantastic way to quickly restock your bathroom and zero waste kitchen cabinets with sustainable, non-plastic items. Other products from EcoRoots’ zero waste store include: Hydrating lip balms Handy shaving kits Skin-loving deodorant creams Planet-friendly dryer balls All body and skincare are handmade in small batches in the US with vegan, organic, and cruelty-free ingredients, meaning no nasty surprises (inside or out) from one of the best zero waste stores online. Shop EcoRoots 3. ZeroWasteStore.com Image by ZeroWasteStore About ZeroWasteStore.com’s Plastic-Free Store Going waste-free for the first time can be overwhelming. Luckily, ZeroWasteStore.com has created a handy quiz to help consumers create a sustainable cleaning routine from their affordable zero waste products. Not only is everything shipped in plastic-free packaging, but comes courtesy of carbon-neutral shipping. The 1% For the Planet member also uses its resources to protect our environment, donating over $15K to various non-profits, including WWF and Feeding America. ZeroWasteStore.com’s Plastic-Free Product Range Price Range | $–$$$ | Shop ZeroWasteStore.com Some products are part of their own in-house ZWS Essentials line, while others are sourced from partnerships with the best plastic-free companies around. After you’ve taken the quiz, you can browse the company’s eco-friendly online store and start building your low-waste lifestyle with item, such as: Vegan dish blocks Bamboo charcoal floss Reusable paper towels Plastic-free toilet brushes Revamp your daily routine in one go with their all-in-one Zero Waste Starter Kit. Or choose one of their more targeted kits, for everything from dental hygiene to shaving to dishwashing. Shop ZeroWasteStore.com 4. Package Free Shop Image by Package Free Shop About Package Free Shop This next zero packaging store online goes above the usual market offerings with its own in-house package-free versions of many everyday items. The site also ships everything 100% plastic-free and offers carbon-neutral shipping. Package Free Shop’s Zero Waste Shop Range Price Range | $–$$$ | Shop Package Free Shop Package Free Shop’s stylish alternatives to our favorite daily products include: Reusable bamboo cutlery sets No packaging stain stick for clothes Natural refillable shampoo Organic multipurpose cleaning sprays We appreciate the waste-free versions of more tricky-to-swap items, such as zero waste lube, and even a sustainable cocktail bundle. Shop Package Free Shop 5. Ecoternatives Image by Ecoternatives About Ecoternatives’ Store Bringing sustainable island living to the masses, Ecoternatives offers 1400+ ultra-affordable zero waste products online, from pet products for your furry friends to personal care and pampering items for you. With many items to choose from, this low-waste shop online proves it’s easy to dip your toes into the welcoming sand of sustainable living. For each purchase, they donate to other zero waste-minded organizations, like those tackling cleanup of the the monstrous Great Pacific Garbage Patch. Plus, they partner with many brands that are members of 1% for the Planet or have their own charitable initiatives. For instance, if you buy Eco Living’s fluoride-free Toothpaste Tablets in their infitiely recyclable bag, you’re also helping support Eden Reforestation Project. Ecoternatives’ Zero Waste Store Range Price Range | $–$$ | Shop Ecoternatives Inspired by the plastic polluted beaches of his Hawaiian hometown and a desire to create a business with a positive impact, Aidan Riehl founded Ecoternatives to tackle both goals. Consumers can choose from kitchen, bathroom, and shower items like: Dissolvable multi-surface cleaning tablets Refillable mouthwash Plastic-free hairties Reusable period products All products are sustainably and ethically sourced from like-minded brands and companies. Shop Ecoternatives 6. SuperBee Image by SuperBee About SuperBee SuperBee is most famous for its high-quality, reusable beeswax wraps that are a fantastic replacement for planet-harming plastic coverings. The company has expanded since its initial launch to include various plastic-free alternatives, so you can now do your zero waste shopping online all in one place. And because they’re a social enterprise that creates all their own products by providing fair, gainful employment in Thailand, there’s no better way to get that sustainable buzz. SuperBee’s Zero Waste Store Range Price Range | $–$$$ | Shop SuperBee Reusable wraps and food storage bags are far from the only thing this Certified B Corp and plastic-free brand makes. The SuperBee movement has avoided over 2.5 million plastics parts, thanks to other products including: Reusable paper towels Reusable laundry detergent substitutes Toothpaste tablets Reusable facial rounds Shop SuperBee 7. Life Without Plastic Image by Life Without Plastic About Life Without Plastic Life Without Plastic is a Certified B Corp zero waste online store that provides plastic-free essentials for daily living. Life Without Plastic also prides itself in being a pioneering, expert voice in the zero waste industry—the founders have even written a book by the same name to provide an accessible source guide to easy plastic-free living. Life Without Plastic’s Zero Waste Products Online Price Range | $–$$ | Shop Life Without Plastic Indulge in self-love without the waste, choose food storage containers free from plastic, and keep your home spic and span with zero waste cleaning products. Some of our favorite items include: Unbleached natural sea sponges Double cotton flour bags Stainless steel ice pop molds Plastic-free sandwich flip bags The self-branded products are made from high-quality, sustainable materials, including bamboo, organic cotton, stainless steel, and ethical wool. Shop Life Without Plastic 8. The Refill Shoppe Image by The Refill Shoppe About The The Refill Shoppe Save on packaging waste at The Refill Shoppe, a picture-perfect waste-free shop online that sells beautifully packaged refillable home and body products. The Refill Shoppe’s Online Zero Waste Product Range Price Range | $–$$ | Shop The Refill Shoppe The Refill Shoppe makes eco-living look chic without compromising on quality. Dive into indulgent self-care items, such as: Bath oils Bath tea Rosewater toner Hair serum The brand’s ‘Sudscription’ service works by shipping refillable pouches to customers so they can decant the product into their chosen container. When they need more, they simply post the pouch in the return envelope after selecting their new products or scents. With all liquids and powders sold by the fluid ounce, The Refill Shoppe boasts affordable zero waste products ideal for all budgets. Shop The Refill Shoppe 9. A Drop In The Ocean Image by A Drop In The Ocean About A Drop In The Ocean’s ZW Store Washington-based A Drop In The Ocean is a zero waste online shop that offers boutique-style plastic-free home products for all areas of your life. Customers can access A Drop In The Ocean’s refillable scheme no matter where they live, from hand soap to laundry detergent. Customers can also leave empty containers on their porches for pickup on delivery day to make bulk shopping online even more effortless—a hassle-free and planet-friendly way to receive your daily essentials. PS: Take their EcoWarrior Ocean Archetype quiz for curated recommendations and eco living tips to best suit your lifestyle. A Drop In The Ocean’s Plastic-Free Products Price Range | $–$$ | Shop A Drop In The Ocean It specializes in bulk refills of everyday home and personal care items, and sustainable alternatives to everyday disposable items like: Mouthwash crystals PVA-free dishwasher pods Dish soap bars Period underwear Shop A Drop In The Ocean Online Plastic-Free Stores UK 10. Jungle Culture Image by Jungle Culture About Jungle Culture’s UK Store Browse functional, eco-friendly, zero waste products from Jungle Culture, a UK online plastic-free shop with an ethical supply chain. The site sources items directly from independent artisans and makers worldwide, promoting a fair and honest approach to manufacturing. By building relationships with the local communities it works with, Jungle Culture is a zero waste online store that cares deeply about its impact. Jungle Culture’s Plastic-Free Products Price Range | $–$$ | Shop Jungle Culture Jungle Culture focuses on low-impact, sustainable living, encouraging customers to switch to environmentally-friendly alternatives, including: Safety razors Coconut candles Natural dish brushes Wooden cutlery Shop Jungle Culture 11. Battle Green Image by Battle Green About Battle Green‘ Plastic Free Online store Battle Green is a zero waste brand with several impressive accolades, including Best Buy at the Natural Beauty Awards for its vegan cosmetics. Customers can choose between paper and aluminum zero waste packaging options, making them perfect for refilling and minimizing waste. Battle Green is passionate about everyone beginning their zero waste journey, whatever their budget. It is another online zero waste shop that puts its money where its values lie—the company proudly supports many environmental and animal-focused charities. Because they sell on Etsy, you get not only plastic-free shipping., but carbon-neutral shipping as well. Battle Green’s Zero Waste Products Online Price Range | £–££ | Shop Battle Green Create a zero waste home, bathroom, and beauty regime with Battle Green’s selection of: Reusable period pads Natural dry shampoo powder Handmade soap Compostable dish cloths The beauty, skin, and body care items are all handmade in Wales with plant-based, cruelty-free ingredients. Shop Battle Green 12. Life Before Plastic Image by Life Before Plastic About Life Before Plastic The game is in the name. This online plastic-free shop is all about shopping without single-use plastic. The company is big on supporting small and local creators that align with its ethical ethos—perfect for those looking for zero waste brands that are also guilt and cruelty-free. Life Before Plastic’s Zero Waste Store Range Price Range | £–££££ | Shop Life Before Plastic Life Before Plastic works with over 100 independent UK-based zero waste companies, stocking collections ranging from bathroom products to baby care. Highlights include: Ethical teas and coffee Eco-friendly laundry detergents Vegan beauty, haircare, and skincare Sustainable essentials for making your first steps into zero waste living. Get your hands on gorgeous natural soy wax candles, sink into an eco-friendly bean bag chair, and treat your loved ones with unique, plastic-free gifts. Shop Life Before Plastic 13. Zero Waste Bulk Foods Image by Zero Waste Bulk Foods About Zero Waste Bulk Foods’ Grocery Store Discover delicious foods and cupboard essentials on your next virtual zero waste grocery shopping trip at Zero Waste Bulk Foods. It’s bulk shopping online without the premium cost or hassle of hunting down a packaging-free store. Zero Waste Bulk Foods’ Range Price Range | £ | Shop Zero Waste Bulk Foods Delivering groceries to homes across the UK in washable and reusable bags, this online bulk store is excellent for convenient refilling and produce in non-plastic packaging, such as: Nuts Pasta Cereals, muesli and granola Beans and pulses Seeds and grains Herbs and spices These guilt-free zero waste groceries come at reasonable prices, especially considering their organic, natural, and eco-friendly qualities. Shop Zero Waste Bulk Foods 14. Plastic Free Zone Image by Plastic Free Zone About Plastic Free Zone Plastic Free Zone was started with a passion to reduce the amount of plastic ending up in our oceans. The online zero waste shop believes small yet mighty sustainable swaps can make a difference and even offers a selection of custom and personalized products that make excellent gifts. Plastic Free Zone’s Zero Waste Online Range Price Range | £–£££ | Shop Plastic Free Zone Everything is plastic-free and uses only zero waste packaging for shipping, with products like: Paper tape Soap nuts laundry detergent Bamboo shampoo bar trays Stationery Shop Plastic Free Zone 15. Eco Replenishers Image by Eco Replenishers About Eco Replenishers Searching for affordable zero waste products can be challenging. Luckily, Eco Replenishers is a budget-friendly, package-free grocery store that provides sustainable alternatives straight to its customers’ doors. Although the company has a physical store in Loughborough, UK, online shoppers can still take advantage of their zero waste grocery delivery. Eco Replenishers send out food orders in environmentally friendly, plastic-free packaging, usually at a fraction of the price you’d pay in a supermarket. Eco Replenishers’ Plastic-Free Products Price Range | £–££ | Shop Eco Replenishers Replace staple items in your pantry, home, and bathroom, with planet-loving products and household cleaning solutions, like: Herbs and spices Baking ingredients Toilet paper Teas and coffees Eco Replenishers stock plastic-free versions of hair and body care such as shampoo, soap, and Organic Lavender Eye & Face Cream, alongside everyday food essentials like rice, beans and pulses, and even salt. Shop Eco Replenishers 16. Acala Online Image by Acala Online About Acala Online’s Zero Waste Store Your plastic-free pursuit doesn’t need to end at your beauty regime. Acala Online ensures your brows, lashes, lips, and skin look luscious and don’t harm the planet—one of the most complex parts to master on the plastic-free path. The company was founded by passionate environmentalist Hanna, who quickly turned Acala into one of the leading names in affordable zero waste products for your skin, body, and hair. Acala Online’s Zero Waste Product Range Price Range | £ | Shop Acala Online Give up your go-to product and switch to Acala’s zero waste supplies, including: Bright blushers that won’t cost the earth Eco-friendly bronzer for a sun-kissed look Thirst-quenching face masks Luxurious hand creams made with sustainable ingredients Acala also has a DIY beauty section for those of us with sensitive skin, where you can purchase the DIY kits and concoctions needed to craft your own personalized products. Parents are covered, too, thanks to Acala’s range of low-waste baby products, featuring plastic-free breast pads, paper towels, pacifiers, baby bottles, and everything diaper-related. Shop Acala Online 17. EarthBits Image by EarthBits About EarthBits EarthBits is a family-run business with a difference. Born out of a desire to help reduce waste, pollution, and plastic, this zero waste online store fully vets all its suppliers and items to ensure their sustainability. All EarthBits’ packaging is plastic-free and made from recyclable materials, and the company makes sure all products are durable and high-quality—meaning you’ll avoid further waste by not needing to replace items as often. The company also never sells products it wouldn’t be proud to use. Most of the stock is eco-friendly alternatives the EarthBits team uses and loves daily. EarthBits’ Zero Waste Product Range Price Range | £–££ | Shop EarthBits Browse plastic-free products such as: Zero waste makeup Non-plastic bags for shopping zero waste Cute plastic-free gift sets for perfect presents Shop EarthBits 18. Eco Sal Image by Eco Sal About Eco Sal This no plastic store online aims to make plastic-free and zero waste living affordable and achievable for all. The website has created a welcoming community where questions (no matter how big or small) are encouraged, so anyone can adopt this lifestyle and continue learning. The Eco Sal blog is chock-full of tips and guides perfect for those who need inspiration on their zero waste journey. Eco Sal’s Zero Waste Shop Range Price Range | £ | Shop Eco Sal At the beginning of your plastic-free pursuit? Eco Sal is a zero waste online shop ideal for those starting their eco-friendly lifestyle with items like: Tea Tree Neem Oil Dog Shampoo Toothpaste tablets Feminine hygiene products Laundry detergent sheets Sunscreen They’re palm oil, plastic, and cruelty-free, ticking several sustainable boxes. Shop Eco Sal 19. Plastic Freedom Image by Plastic Freedom About Plastic Freedom’s Zero Waste Store Plastic Freedom is your one-stop eco shop for zero waste and plastic-free. A hobby that turned into a sustainable phenomenon, the company was started on the bedside table by a woman with a dream. With regular sales and competitions, Plastic Freedom proves that no matter what you’re looking for, a plastic-free or zero waste option is within your budget. Each visit to this online zero waste store like opening an Aladdin’s cave of sustainable treasures. Beware—you’ll spend hours gawking at the rare and unusual eco-friendly delights. Plastic Freedom’s Plastic-Free Product Range Price Range | £0.60 – £1,799.98 | Shop Plastic Freedom Now, the ever-growing site regularly sources surprising environmentally-friendly versions of every day and specialist products, such as: Sustainable sex toys Beard shampoos Planet friendly BBQs Pregnancy tests Ethical alcohol Shop Plastic Freedom Why Switch To Package-Free Online Stores? Why shop at zero waste shops anyway? Yes, litter looks unsightly, but is buying your essentials sealed in a protective layer of plastic so bad? The short answer is (unsurprisingly) yes. Roughly eight million pieces of plastic enter our oceans daily, and we currently have between 82–358 trillion microplastics on the planet. These tiny plastic waste pieces were estimated to weigh 1.1–4.9 million tonnes in 2019. The even worse news is that this plastic isn’t going anywhere. A plastic bottle can last up to 500 years in the marine environment and gradually fragment into smaller pieces over time. Almost all plastic produced since 1950 is still sitting in our planet’s landfills. Wildlife, including fish, dolphins, and seabirds, mistake the plastic for food and ingest it with deadly consequences. Plastic packaging can also get entangled around the creatures, trapping them and preventing them from breathing or moving. It’s not only animal welfare we should be concerned about, either. Roughly one in three fish caught for human consumption now contain plastic, meaning we’re eating it too. Plastic in seawater absorbs chemicals such as PCBs and DDTs, substances linked to endocrine disruption and even some cancers. These chemicals become more powerful as they go up the food chain. With all those mind-blowing and frightening statistics, going low or zero waste is a no-brainer. Switching to reusable packaging helps conserve resources and minimize waste and pollution. With around 42% of GHG emissions caused by the production and use of goods, reducing packaging and choosing sustainable products is crucial. By transporting our essentials in paper sacks, glass mason jars and bottles, jute bags, and biodegradable materials, we avoid the unnecessary extraction of raw materials for packaging. The zero waste lifestyle goes far beyond saying ‘bye’ to plastic. It’s a vital component of the circular economy, encouraging people to reuse, repair and repurpose things rather than buy new ones. Many zero waste goods are designed to last much longer than their plastic-ridden, unsustainable counterparts. Though they might sometimes come with a higher price point initially, you’ll save money by replacing items less often in the long run. Zero waste grocery shopping is also great for tackling food waste. Roughly 22% of all municipal solid waste in the US is food, making it the most significant contributor to US landfills. By buying only what you’ll need and use, you avoid throwing away unwanted or spoiled produce. Community-based zero waste strategies benefit everyone and everything. No-packaging stores (online or in person) create jobs, improve the economy, encourage people to work together, and reduce our impacts. Less plastic trash in the ground, more usable space, and reduced chance of toxins in the atmosphere make for a healthy and happier planet.","filter_flag":1}
{"title":"18 Vegan Shoes Your Wardrobe Is Begging For - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc2hvZXMtd2FyZHJvYmUtYW55LW9jY2FzaW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc2hvZXMtd2FyZHJvYmUtYW55LW9jY2FzaW9u0gEA?oc=5","id":"CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc2hvZXMtd2FyZHJvYmUtYW55LW9jY2FzaW9u0gEA","guidislink":false,"published":"Sat, 25 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=25, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=329, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc2hvZXMtd2FyZHJvYmUtYW55LW9jY2FzaW9u0gEA?oc=5\" target=\"_blank\">18 Vegan Shoes Your Wardrobe Is Begging For<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"18 Vegan Shoes Your Wardrobe Is Begging For - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vdmVnbmV3cy5jb20vdmVnYW4tc2hvZXMtd2FyZHJvYmUtYW55LW9jY2FzaW9u0gEA?oc=5\" target=\"_blank\">18 Vegan Shoes Your Wardrobe Is Begging For<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The days of clunky pleather boots and hemp sandals are long gone. Now, conscientious fashion shoppers have a bounty of choices when it comes to animal-free footwear. When seeking vegan-friendly materials in your shoes, you’ll need to keep an eye out for wasteful and cruel materials like leather, suede, and animal-based glue. Luckily, as the fashion world slowly turns to a more sustainable, animal-friendly approach, there are more options than ever to fuel your (vegan) shopping habits. Even French luxury brand Louis Vuitton launched its first sustainable and gender neutral shoe, the Charlie, made with vegan corn leather in recent years. Along with Adidas’ mushroom leather shoes and Billie Eilish’s vegan Nike collection, one thing is certain … the future of shoes is vegan. Whether you’re looking for ultra-glam heels, handcrafted vegan leather clogs, or a pair of “man-made” shoes from your favorite mainstream shoe company, these 18 cruelty-free kicks will fit the bill. Vegan shoes for every occasion Whether you’re dressing up for a night on the town or are simply running weekend errands, these vegan shoes are must-haves. Boots NAE Vegan Shoes 1 NAE Vegan Shoes Sisi Black Chelsea Boots NAE, which stands for No Animal Exploitation, ensures all of its products are cruelty-free. From using natural materials such as apple leather to manufacturing only in certified factories in Portugal, your conscience can rest easy when you wear these kicks. SHOP NOW @imagenazul\/Instagram 2 Good Guys Don’t Wear Leather Lucky High Top Western Boots Boasting features in high-profile magazines such as Vogue, Elle, Nylon, and more, this women-owned company has been breaking fashion boundaries one fashionable shoe at a time. And it’s really no surprise the brand has taken home numerous awards from both Fashion.net and PETA. These bright white boots are just one of its timeless and durable offerings. Shop NOW Collection & Co 3 Collection & Co CARINA Boots This UK-based vegan shoe store has been outfitting vegan Londoners for years and has quickly garnered a loyal fan base for its use of innovative textiles and fashion-forward styles. Rock these upcycled faux leather knee-high boots on your next date night. Shop NOW Matt & Nat 4 Matt & Nat ALAIA Boots A favorite among many cruelty-free shoppers, this high-fashion brand has spread internationally. Worn by A-list celebs including Olivia Wilde, Emily Deschanel, and Tobey Maguire, this brand’s clean and minimalist designs are on everyone’s must-have lists. SHOP NOW ALOHAS 5 ALOHAS South Corn Black and Beige Boots Corn is magically transformed into these modern, two-toned and fashion-forward boots. This head-turning, one-of-kind footwear is guaranteed to garner compliments wherever you go. SHOP NOW Voes & Co. 6 Voes & Co. Harlow Chelsea Boots Beautiful cactus leather makes for one ultra-sustainable pair of boots. The cactus leather used by Voes & Co. requires no irrigation, no pesticides or herbicides, and the cacti are actually a carbon sink. You can’t get much greener than that. SHOP NOW Native Shoes 7 Native Shoes Fitzsimmons Citylite This environmentally minded company is aiming to revolutionize the manufacturing process. Customers can send in their worn out shoes to be ground down and given new life in community projects. This sustainable approach to fashion is just as endearing as this brand’s stylish kids’ boots. Shop NOW Sneakers LØCI 8LØCI Sneakers Created with the Earth in mind, LØCI breaks away from the traditional fast fashion model, creating sustainable sneakers. Handcrafted in eco-conscious factories in Portugal, each pair is vegan and crafted from responsibly sourced, natural materials such as recycled ocean plastic, bamboo, and rubber. SHOP NOW Vessi 9 Vessi Stormburst High Tops Made from 100-percent waterproof material, these vegan sneakers are perfect for the rainier months. The high rebound cushioning makes it feel like we’re walking on air and the breathable knit upper allows our feet to breathe while keeping water out. SHOP NOW SAYE 10 SAYE This entirely vegan brand makes sneakers that are chic enough to rock with any outfit. Plus, they’re made with bio-based, organic, and recycled materials, so you can feel good about your purchase. SHOP HERE Veja 11 Veja Nova High Top These classic unisex high tops are made from sustainable materials such as organic cotton and wild rubber from the Amazonian forest. Their effortlessly cool appeal easily pairs with any outfit, making them a closet essential for every season. SHOP NOW Koio 12 Koio Pale Blue Dot Crafted in Portugal by artisans that earn a fair wage for their work, these 100-percent vegan sneakers are made from plant-based leather, recycled rubber, natural latex, and cork. Even the laces and footbeds are certified organic cotton. Shop NOW @sleepydz\/Instagram 13 Keep Company The Homer These California-made sneakers are water-resistant and have a natural, grippy gum sole, making them essential for skaters and mall shoppers alike. You can feel good when you strap on these kicks because each pair is ethically made in sweatshop-free factories. Shop NOW Dress shoes Solari 14 Solari Milano Loafers This classic pair of beautifully crafted loafers is made from Italian corn leather and a recycled rubber sole. Using Italian artisanal shoe making traditions and ethical production from beginning to end, each set of shoes from this small brand proves that vegan footwear can be luxe. SHOP NOW Insecta Shoes 15Insecta Shoes Oxford Scarabeus Planets Nerdy chic has never looked so cool. This Brazilian-based shoe brand is entirely vegan. We’re head over heels for these galaxy-inspired Oxfords made from recycled materials. SHOP NOW Heels and pumps ALOHAS 16 ALOHAS Hanna Slingback Pump These slingback pumps are crafted from vegan leather with a black patent finish. Slightly pointed, these leg-lengthening shoes feature adjustable straps, adding support whether you walk or dance the night away. Shop NOW Matisse 17Matisse Footwear Zola Pointed-Toe Heels These slip-on style pointed heels can easily be dressed up or down to match your fall fashion look. The vegan leather patent white hue pairs beautifully with classic blue jeans or with a fall, fit-and-flare miniskirt and sheer tights. Shop here @veerahofficial\/Instagram 18 Veerah Mulan Platform Pump Shoes made from plastic bottles? Yes, we’re serious. We can’t think of a dreamier statement piece than these sky high, floral-printed stilettos. SHOP NOW","filter_flag":1}
{"title":"Antolin develops eco-friendly material using mycelium - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3MtIBb2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3Mj9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3MtIBb2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3Mj9hbXA9MQ?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3MtIBb2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3Mj9hbXA9MQ","guidislink":false,"published":"Tue, 07 Nov 2023 00:34:56 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=0, tm_min=34, tm_sec=56, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3MtIBb2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3Mj9hbXA9MQ?oc=5\" target=\"_blank\">Antolin develops eco-friendly material using mycelium<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Antolin develops eco-friendly material using mycelium - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3MtIBb2h0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FudG9saW4tZGV2ZWxvcHMtZWNvLWZyaWVuZGx5LW1hdGVyaWFsLXVzaW5nLW15Y2VsaXVtLTExNzY3Mj9hbXA9MQ?oc=5\" target=\"_blank\">Antolin develops eco-friendly material using mycelium<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The project contributes to decarbonisation and leverages the infinite resources nature provides, setting a precedent for the automotive industry. Antolin, the global provider of technological solutions for car interiors, has developed a pioneering project that employs mycelium-based natural materials to help reduce the environmental impact of vehicle components. Mycelium is the vegetative part of fungi, so it is found naturally in terrestrial ecosystems. Thanks to an innovative process, mycelium binds with vegetable residues to develop a structural material with which to produce automotive components. In addition, this form of sustainable production is carbon neutral, as the material development occurs organically directly in the mould, compared to the traditional plastic injection process. The project increases the efficiency of the circular economy and is the natural response to reduce the use of plastic in automotive parts. With this innovation, Antolin contributes to decarbonisation and leverages the infinite resources nature provides, setting a precedent for the automotive industry and helping it be implemented in other sectors. This project also shows how to advance the research of materials and new processes for the automotive industry, with minimal impact on carbon footprints, through the use of 100% biodegradable products at the end of their life cycle, compared to non-biodegradable products that can end up in oceans and rivers. In addition, it gives a second life to waste of natural origin that can be implemented in an industrial setting. By researching these types of solutions, Antolin wants to offer its customers innovative, high-impact proposals, helping them introduce fully sustainable materials, structures and processes into their future vehicle programmes to meet decarbonisation goals across the automotive value chain.","filter_flag":1}
{"title":"Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces - Cyprus Mail","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5","id":"CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA","guidislink":false,"published":"Wed, 22 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=326, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5\" target=\"_blank\">Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cyprus Mail<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces - Cyprus Mail","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vY3lwcnVzLW1haWwuY29tLzIwMjMvMTEvMjIvc3VzdGFpbmFiaWxpdHktaW4tY28td29ya2luZy1lbnZpcm9ubWVudGFsbHktZnJpZW5kbHktaW5pdGlhdGl2ZXMtaW4tc2hhcmVkLXdvcmtzcGFjZXMv0gEA?oc=5\" target=\"_blank\">Sustainability in co-working: Environmentally-friendly initiatives in shared workspaces<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cyprus Mail<\/font>","source.href":"https:\/\/cyprus-mail.com","source.title":"Cyprus Mail","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Are you interested in working in a sustainable and environmentally-friendly environment? Look no further than co-working spaces! With energy-efficient lighting, green building certifications, and waste reduction programs, these shared workspaces are leading the way in sustainability. They also incorporate sustainable materials and furniture, renewable energy sources, and even community gardens. By using eco-friendly cleaning products and partnering with local environmental organizations, co-working spaces are creating a positive impact on the planet. Join the movement towards sustainability and enjoy a greener work environment. Energy-efficient lighting and appliances You can save energy and reduce costs by using energy-efficient lighting and appliances in your shared workspace. Switching to LED lights is a simple yet effective way to make your workspace more energy-efficient. LED lights use up to 75% less energy than traditional incandescent bulbs and can last up to 25 times longer. This means not only will you be saving money on your energy bills, but you will also be reducing the amount of waste generated from constantly replacing bulbs. Additionally, consider investing in energy-efficient appliances such as refrigerators, microwaves, and printers. Look for appliances with an ENERGY STAR rating, as they are designed to use less energy without sacrificing performance. By making these small changes in your shared workspace, you can make a big impact on your energy consumption and carbon footprint. Plus, you will be setting a positive example for others and encouraging them to follow suit. So, go ahead and make the switch to energy-efficient lighting and appliances to create a more sustainable and cost-effective workspace. Green building certifications and standards To ensure that shared workspaces meet environmentally-friendly standards, it is important to regularly seek green building certifications and adhere to sustainable building standards. Green building certifications, such as LEED (Leadership in Energy and Environmental Design) and BREEAM (Building Research Establishment Environmental Assessment Method), provide a framework for evaluating and recognizing buildings that are designed, constructed, and operated with sustainability in mind. These certifications assess various aspects of a building’s sustainability, including energy efficiency, water conservation, waste management, and indoor environmental quality. By pursuing and achieving these certifications, co-working spaces can demonstrate their commitment to reducing their environmental impact and providing a healthier and more sustainable work environment for their occupants. In addition to certifications, shared workspaces should also adhere to sustainable building standards. These standards, such as the International Green Construction Code (IgCC) and the Living Building Challenge, provide guidelines and requirements for sustainable building practices. By following these standards, co-working spaces can ensure that their building design, construction, and operation align with the highest levels of sustainability. Waste reduction and recycling programs By implementing waste reduction and recycling programs, shared workspaces can significantly reduce their environmental impact and promote a more sustainable work environment. One of the most effective ways to achieve this is by setting up a comprehensive waste management system. This involves providing clearly labeled recycling bins for different types of waste, such as paper, plastic, and glass. Additionally, shared workspaces can encourage employees and members to minimize waste by using digital documents instead of printing, bringing reusable water bottles and coffee cups, and using refillable ink cartridges for printers. Furthermore, shared workspaces can establish partnerships with local recycling facilities to ensure that waste is properly sorted and processed. This can help divert a significant amount of waste from landfills and contribute to the circular economy by turning waste materials into new products. Additionally, shared workspaces can organize educational workshops and training sessions to raise awareness about the importance of waste reduction and recycling among their members. To further reduce waste, shared workspaces can implement measures such as switching to digital billing and communication, using eco-friendly cleaning products, and providing composting facilities for food waste. By taking these steps, shared workspaces can play a crucial role in reducing waste generation and promoting a more sustainable work culture. Sustainable materials and furniture Using sustainable materials and furniture is essential for creating an environmentally-friendly workspace that minimizes its ecological footprint. When designing a co-working space, it is important to consider the materials and furniture used in order to promote sustainability and reduce environmental impact. Opting for sustainable materials means choosing materials that are sourced responsibly, have a low carbon footprint, and can be recycled or reused at the end of their lifecycle. For example, using reclaimed wood for desks and tables not only adds a unique aesthetic to the space, but also reduces the demand for new timber and helps prevent deforestation. Additionally, using furniture made from recycled or upcycled materials can significantly reduce the environmental impact. For instance, chairs made from recycled plastic or fabric made from upcycled materials are great options. These materials not only divert waste from landfills, but also require less energy to produce compared to virgin materials. Furthermore, it is important to choose furniture that is durable and long-lasting. This reduces the need for frequent replacements, ultimately reducing waste. Investing in high-quality, well-designed furniture made from sustainable materials ensures that it will withstand the test of time. Renewable energy sources Consider implementing renewable energy sources in your co-working space to reduce its carbon footprint and promote sustainability. By harnessing the power of renewable energy, you can make a significant positive impact on the environment. Here are three reasons why embracing renewable energy sources is a great choice for your co-working space: Environmental Stewardship : By using renewable energy sources such as solar panels or wind turbines, you can significantly decrease your co-working space’s reliance on fossil fuels. This reduces greenhouse gas emissions, helping combat climate change and preserving our planet for future generations. : By using renewable energy sources such as solar panels or wind turbines, you can significantly decrease your co-working space’s reliance on fossil fuels. This reduces greenhouse gas emissions, helping combat climate change and preserving our planet for future generations. Cost Savings : Renewable energy sources may require an initial investment, but in the long run, they can lead to substantial cost savings. By generating your own energy, you can reduce your reliance on expensive utility bills, ultimately saving money for both you and your co-working members. : Renewable energy sources may require an initial investment, but in the long run, they can lead to substantial cost savings. By generating your own energy, you can reduce your reliance on expensive utility bills, ultimately saving money for both you and your co-working members. Community Engagement: Embracing renewable energy sources can inspire and engage your community. By showcasing your commitment to sustainability, you can attract like-minded individuals and businesses who value eco-friendly practices. This fosters a sense of belonging and creates a positive environment for collaboration and networking. Incorporating renewable energy sources in your co-working space not only benefits the environment but also provides financial savings and community engagement opportunities. Take the leap towards sustainability and make a difference today. Water conservation measures To ensure responsible water usage in your co-working space, regularly assess and implement water conservation measures, such as installing low-flow faucets and toilets. These measures can significantly reduce the amount of water consumed within your workspace, ultimately contributing to a more sustainable environment. Low-flow faucets are designed to limit the flow rate of water without compromising functionality. By reducing the amount of water coming out of the faucet, you can save a significant amount of water over time. Similarly, installing low-flow toilets can drastically reduce the amount of water used for flushing, as they use less water per flush compared to conventional toilets. Another effective water conservation measure is the installation of sensor-activated faucets and toilets. These devices only release water when they detect motion, ensuring that water is not wasted when not in use. Additionally, promoting awareness among employees about responsible water usage can further contribute to water conservation efforts. Encouraging simple actions like turning off faucets tightly and reporting any leaks promptly can make a significant difference. Regularly monitoring water usage and conducting audits can help identify areas where water conservation measures can be implemented. By taking these steps, you can not only reduce your environmental footprint but also inspire others in the co-working community to adopt water conservation practices. Together, we can make a positive impact on the sustainability of our shared workspaces. Indoor air quality and ventilation systems Improve the indoor air quality of your co-working space by implementing proper ventilation systems. Good ventilation is essential for creating a healthy and comfortable working environment. Here are three reasons why investing in ventilation systems is a smart move: Enhanced Productivity : Fresh air promotes better cognitive function and productivity. Proper ventilation can help reduce the concentration of pollutants and prevent the build-up of stale air, ensuring that you and your co-workers can stay focused and energized throughout the day. : Fresh air promotes better cognitive function and productivity. Proper ventilation can help reduce the concentration of pollutants and prevent the build-up of stale air, ensuring that you and your co-workers can stay focused and energized throughout the day. Health Benefits : Indoor air can be filled with pollutants like dust, allergens, and volatile organic compounds (VOCs) from cleaning products, furniture, and office equipment. These pollutants can lead to various health problems, including allergies, respiratory issues, and headaches. Installing ventilation systems can help remove these pollutants and improve the overall health and well-being of everyone in the workspace. : Indoor air can be filled with pollutants like dust, allergens, and volatile organic compounds (VOCs) from cleaning products, furniture, and office equipment. These pollutants can lead to various health problems, including allergies, respiratory issues, and headaches. Installing ventilation systems can help remove these pollutants and improve the overall health and well-being of everyone in the workspace. Comfort and Satisfaction: Adequate ventilation ensures a comfortable temperature and humidity level, preventing the space from becoming stuffy and unpleasant. When the air quality is good and the temperature is just right, people are generally happier and more satisfied with their working environment. Investing in proper ventilation systems not only helps create a healthier and more comfortable co-working space but also contributes to the overall sustainability and well-being of the environment. So, prioritize the air quality in your shared workspace and reap the benefits of a healthier and happier co-working community. Bike-friendly amenities and facilities For a more sustainable and convenient co-working experience, embrace bike-friendly amenities and facilities available in your workspace. Many co-working spaces are recognizing the importance of promoting cycling as a means of transportation and are implementing various initiatives to cater to bike commuters. One such initiative is the provision of secure bike storage facilities. These facilities not only ensure the safety of your bike but also encourage more people to choose cycling as a mode of transportation. Additionally, some co-working spaces offer bike repair stations equipped with tools and pumps, allowing you to perform basic maintenance on your bike. This eliminates the need for you to travel to a separate bike shop, saving both time and money. Furthermore, bike-friendly workspaces may also provide shower and changing facilities, allowing you to freshen up after your ride. This is especially beneficial if you have a long commute or if the weather conditions are unfavorable. By embracing bike-friendly amenities and facilities in your workspace, you not only contribute to the sustainability of the environment but also promote a healthier and more active lifestyle. Promoting sustainable transportation options Consider incorporating sustainable transportation options into your daily commute and help reduce your carbon footprint. By making simple changes to how you travel to work, you can contribute to a more sustainable future. Here are three ways you can promote sustainable transportation options: Carpooling: Share your ride with colleagues or neighbors who live nearby. Carpooling not only helps reduce traffic congestion but also lowers carbon emissions by maximizing the use of vehicles. Share your ride with colleagues or neighbors who live nearby. Carpooling not only helps reduce traffic congestion but also lowers carbon emissions by maximizing the use of vehicles. Public Transportation: Opt for buses, trains, or trams to get to your co-working space. Public transportation systems are designed to accommodate large numbers of people, resulting in fewer cars on the road and less pollution. Opt for buses, trains, or trams to get to your co-working space. Public transportation systems are designed to accommodate large numbers of people, resulting in fewer cars on the road and less pollution. Active Commuting: Consider walking or cycling to work if your co-working space is within a reasonable distance. Not only will this help you stay active and improve your health, but it will also significantly reduce your carbon footprint. Community gardens and urban agriculture initiatives Grow your own fresh produce and foster a sense of community by participating in community gardens and urban agriculture initiatives. By creating community gardens within shared workspaces, individuals have the opportunity to grow their own fruits, vegetables, and herbs, reducing their carbon footprint and supporting a more sustainable lifestyle. Fact: These initiatives are gaining popularity in shared spaces in Miami as a way to promote sustainability and provide healthy, locally grown food for members. Community gardens not only provide an opportunity for individuals to grow their own food, but they also create a sense of community and connection among co-workers. Working together to maintain the garden, sharing tips and knowledge, and enjoying the fruits of their labor can strengthen relationships and create a positive work environment. Urban agriculture initiatives take community gardening a step further by utilizing underutilized spaces within urban areas, such as rooftops or vacant lots, to grow food. These initiatives can have a significant impact on the environment by reducing the need for transportation of food from distant locations and minimizing the use of pesticides and herbicides. In addition to the environmental benefits, community gardens and urban agriculture initiatives can also contribute to the well-being of individuals. Gardening has been shown to reduce stress, improve mental health, and provide a sense of accomplishment. By participating in these initiatives, co-workers can take a break from their work and engage in a rewarding and productive activity. Eco-friendly cleaning products and practices You can easily maintain a clean and sustainable workspace by using eco-friendly cleaning products and practices. Making the switch to these environmentally-friendly alternatives not only benefits the planet but also promotes a healthier and more productive work environment for you and your co-workers. Here are three reasons why you should consider using eco-friendly cleaning products and practices: Protecting your health : Traditional cleaning products often contain harmful chemicals that can cause respiratory problems, skin irritations, and other health issues. By using eco-friendly alternatives, you can reduce your exposure to these toxins and create a safer space for everyone. : Traditional cleaning products often contain harmful chemicals that can cause respiratory problems, skin irritations, and other health issues. By using eco-friendly alternatives, you can reduce your exposure to these toxins and create a safer space for everyone. Reducing environmental impact : Conventional cleaning products often contain ingredients that are harmful to the environment. By choosing eco-friendly options, you can minimize water pollution, reduce waste, and support sustainable manufacturing practices. : Conventional cleaning products often contain ingredients that are harmful to the environment. By choosing eco-friendly options, you can minimize water pollution, reduce waste, and support sustainable manufacturing practices. Creating a positive work environment: Using eco-friendly cleaning products and practices shows that you care about the well-being of your co-workers and the planet. It fosters a sense of community and encourages others to adopt sustainable habits. Education and awareness campaigns on sustainability One effective way to promote sustainability in co-working spaces is by implementing educational workshops and awareness campaigns. These initiatives are crucial in fostering a culture of sustainability among co-workers and encouraging them to adopt eco-friendly practices. Educational workshops provide an opportunity for co-workers to learn about the importance of sustainability and how their actions can make a positive impact on the environment. These workshops can cover a wide range of topics, such as energy conservation, waste management, and sustainable transportation options. By equipping co-workers with knowledge and practical tips, they can make informed choices and contribute towards a greener workspace. In addition to workshops, awareness campaigns are another powerful tool to promote sustainability. These campaigns can include posters, newsletters, and social media posts that highlight the importance of eco-friendly practices. They can also showcase success stories of co-workers who have implemented sustainable initiatives, inspiring others to follow suit. By creating a buzz around sustainability, these campaigns generate interest and encourage co-workers to actively participate in green initiatives. Moreover, education and awareness campaigns can help co-workers understand the environmental benefits of sustainable practices, such as reducing carbon emissions, conserving resources, and preserving natural habitats. By highlighting the connection between individual actions and global sustainability goals, these initiatives motivate co-workers to make conscious choices and contribute towards a more sustainable future. Collaboration with local environmental organizations By partnering with local environmental organizations, you can enhance the sustainability efforts of your co-working space. Collaborating with these organizations not only shows your commitment to the environment but also allows you to tap into their expertise and resources. Here are three ways in which this collaboration can benefit your co-working space: Access to knowledge and guidance : Local environmental organizations have a wealth of knowledge and expertise when it comes to sustainable practices. By partnering with them, you can gain access to valuable information and guidance on how to make your workspace more environmentally friendly. They can provide insights on energy efficiency, waste management, and other sustainability initiatives that can help you reduce your carbon footprint. : Local environmental organizations have a wealth of knowledge and expertise when it comes to sustainable practices. By partnering with them, you can gain access to valuable information and guidance on how to make your workspace more environmentally friendly. They can provide insights on energy efficiency, waste management, and other sustainability initiatives that can help you reduce your carbon footprint. Networking opportunities : Collaborating with local environmental organizations can open doors to valuable networking opportunities. Through these partnerships, you can connect with like-minded individuals and businesses who share your commitment to sustainability. This can lead to potential collaborations, partnerships, and even new business opportunities. : Collaborating with local environmental organizations can open doors to valuable networking opportunities. Through these partnerships, you can connect with like-minded individuals and businesses who share your commitment to sustainability. This can lead to potential collaborations, partnerships, and even new business opportunities. Community engagement: By working with local environmental organizations, you can actively engage with your community and make a positive impact. This collaboration allows you to participate in local environmental initiatives, such as clean-up events or educational campaigns. By involving your co-working space in these activities, you not only contribute to a cleaner and greener environment but also build a stronger sense of community among your members. Partnering with local environmental organizations is a win-win situation. It not only enhances the sustainability efforts of your co-working space but also allows you to make a meaningful difference in your community. Frequently asked questions How can co-working spaces promote sustainable transportation options? You can promote sustainable transportation options in co-working spaces by offering incentives for using public transportation or biking, providing bike racks and showers, and implementing carpooling or ride-sharing programs. What are some examples of eco-friendly cleaning products and practices used in shared workspaces? Some examples of eco-friendly cleaning products and practices used in shared workspaces include using non-toxic cleaners, implementing recycling programs, and using microfiber cloths. These initiatives help reduce environmental impact and promote sustainability. How do co-working spaces collaborate with local environmental organizations to promote sustainability? Co-working spaces collaborate with local environmental organizations to promote sustainability by organizing events, workshops, and campaigns. You can join these initiatives to learn about eco-friendly practices and contribute to making the workspace more environmentally friendly. What are some indoor air quality and ventilation systems implemented in co-working spaces? Some co-working spaces use advanced indoor air quality and ventilation systems to provide you with clean and fresh air. These systems help remove pollutants and maintain a comfortable working environment for you. How do co-working spaces educate and raise awareness about sustainability among their members? Co-working spaces educate and raise awareness about sustainability among their members through various initiatives. They organize workshops and events, provide educational materials, and promote eco-friendly practices to encourage a greener and more environmentally-conscious work environment. Conclusion Overall, co-working spaces are embracing sustainability through various environmentally-friendly initiatives. From energy-efficient lighting and appliances to waste reduction and recycling programs, these spaces are making conscious choices to reduce their environmental impact. Incorporating sustainable materials and furniture, utilizing renewable energy sources, and promoting community gardens and urban agriculture initiatives are further steps towards a greener future. By collaborating with local environmental organizations and raising awareness through education campaigns, co-working spaces are creating a more sustainable and eco-friend","filter_flag":1}
{"title":"Beyond blue jeans; KG Fabriks’ sustainable denim journey - The Textile Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9iZXlvbmQtYmx1ZS1qZWFucy1rZy1mYWJyaWtzLXN1c3RhaW5hYmxlLWRlbmltLWpvdXJuZXkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9iZXlvbmQtYmx1ZS1qZWFucy1rZy1mYWJyaWtzLXN1c3RhaW5hYmxlLWRlbmltLWpvdXJuZXkv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9iZXlvbmQtYmx1ZS1qZWFucy1rZy1mYWJyaWtzLXN1c3RhaW5hYmxlLWRlbmltLWpvdXJuZXkv0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9iZXlvbmQtYmx1ZS1qZWFucy1rZy1mYWJyaWtzLXN1c3RhaW5hYmxlLWRlbmltLWpvdXJuZXkv0gEA?oc=5\" target=\"_blank\">Beyond blue jeans; KG Fabriks’ sustainable denim journey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Beyond blue jeans; KG Fabriks’ sustainable denim journey - The Textile Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9iZXlvbmQtYmx1ZS1qZWFucy1rZy1mYWJyaWtzLXN1c3RhaW5hYmxlLWRlbmltLWpvdXJuZXkv0gEA?oc=5\" target=\"_blank\">Beyond blue jeans; KG Fabriks’ sustainable denim journey<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","source.href":"https:\/\/www.indiantextilemagazine.in","source.title":"The Textile Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Coimbatore-based Sri Kannapiran Mills Limited is a leading producer of cotton yarn and blended yarn, producing 80 tons of yarn per day. KG Fabriks, set up in 2005, is a division of Sri Kannapiran Mills which produces 20 million meters of denim fabrics per annum. Srihari Balakrishnan, Managing Director KG Fabriks is a Zero Liquid Discharge (ZLD) and Zero Solid Discharge plant using less than 15 litres of water per kilogram of denim fabric manufactured. The company uses proprietary iTop and iWash technologies which result in dye uptake of 85% as against the industry average of 65%. KG Fabriks markets denim fabrics in three registered brand names- ‘Green Dnm’ (true sustainable denim), ‘Product Zero’ (Super sustainable denim) and ‘Nature’s Blue’ (most sustainable denim). Product Zero uses recycled cotton and recycled polyester as raw materials while Nature’s Blue is produced with natural plant based indigo. “The yarns and denim fabrics that are produced at our factories are Green Products certified by GreenPro. The denim division, KG Fabriks, is the first company in the textile weaving and processing sector to get certified as GreenCo Gold. These certifications which talk about our wholesome sustainability efforts, help us to get into the international brands in a better way,” said Srihari Balakrishnan, Managing Director of the company. “We are ZDHC level 1 certified and ensure all chemicals used are sustainable materials. We provide relevant international certifications like GOTS, OCS, GRS, RCS, BCI, Oekotex for brands requiring the same”, he added. Sustainability focus Speaking about the sustainability philosophy of the company he mentioned, “We have been certified by Sustainable Apparel Coalition’s Higg rating which is at 94% in Higg FEM and 93.9% in Higg FSLM. We are Great Place to Work certified and recognised by various brands in their environmental and social audits. We use more than 51% of sustainable fibers and 60% of renewable energy.” “This only proves that sustainability for us, is like meditation and we make every effort to contribute to make our mother earth a safe place to live in.” “Our inclination to try new products resulted in a tripartite collaboration between the Ministry of Textiles and South India Textile Research Association (SITRA) to produce, for the first time in the world, natural plant based machine dyed indigo denim fabrics, using green alkali and biodegradable reducing agent,” he remarked, before adding, “We extensively work with designers across various brands and do research and development to ensure that we continually develop new products as per current market’s trends, be in yarn or denim fabrics,” Srihari Balakrishnan said. Smart apparel According to Srihari Balakrishnan, ‘Smart’ apparel produced with the integration of technology in clothing for healthcare is one technological advancement that will go in leaps and bounds in near future. Elaborating further on the topic he said,” Post Covid, athleisure has seen a tremendous increase in popularity. Digitisation of payments and Artificial Intelligence (AI) used in fashion industry to enhance the consumer experience in the stores have resulted in a comfortable buying behaviour, thus enhancing the shopping experience. Use of block chain mechanism for supply chain transparency has ensured complete traceability in the supply chain.” Digital denim website “At KG Fabriks, we have a digital denim website which is revolutionizing the way of fulfilling merchandisers’ and designers’ fabric requirement. Our website is one of the kind in this world which shows each style in a sample folder view, garment view and digital draping view in different washes on real life style models, enabling designers to take a conscious choice of what styles suit them best, ensuring sustainability of sampling,” he added. Hangtag The company also gives hangtags of its three brands to the garment manufacturers, which are supplied according to the number of garments produced per despatch. “These hangtags have a scan code at the back and when the consumers scan this code, they are taken to the website of KG Fabriks, certifying that the garments are made from True Sustainable Denim Fabric of KG Fabriks,” Srihari Balakrishnan stated in conclusion.","filter_flag":1}
