{"title":"Carrier's New Abound Net Zero Management Solution Helps Building Portfolio Customers Reach Energy and ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NhcnJpZXJzLW5ldy1hYm91bmQtbmV0LXplcm8tbWFuYWdlbWVudC1zb2x1dGlvbi1oZWxwcy1idWlsZGluZy1wb3J0Zm9saW8tY3VzdG9tZXJzLXJlYWNoLWVuZXJneS1hbmQtc3VzdGFpbmFiaWxpdHktZ29hbHMtMzAxNzM2MTQ0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NhcnJpZXJzLW5ldy1hYm91bmQtbmV0LXplcm8tbWFuYWdlbWVudC1zb2x1dGlvbi1oZWxwcy1idWlsZGluZy1wb3J0Zm9saW8tY3VzdG9tZXJzLXJlYWNoLWVuZXJneS1hbmQtc3VzdGFpbmFiaWxpdHktZ29hbHMtMzAxNzM2MTQ0Lmh0bWzSAQA?oc=5","id":"CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NhcnJpZXJzLW5ldy1hYm91bmQtbmV0LXplcm8tbWFuYWdlbWVudC1zb2x1dGlvbi1oZWxwcy1idWlsZGluZy1wb3J0Zm9saW8tY3VzdG9tZXJzLXJlYWNoLWVuZXJneS1hbmQtc3VzdGFpbmFiaWxpdHktZ29hbHMtMzAxNzM2MTQ0Lmh0bWzSAQA","guidislink":false,"published":"Wed, 01 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=32, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NhcnJpZXJzLW5ldy1hYm91bmQtbmV0LXplcm8tbWFuYWdlbWVudC1zb2x1dGlvbi1oZWxwcy1idWlsZGluZy1wb3J0Zm9saW8tY3VzdG9tZXJzLXJlYWNoLWVuZXJneS1hbmQtc3VzdGFpbmFiaWxpdHktZ29hbHMtMzAxNzM2MTQ0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Carrier's New Abound Net Zero Management Solution Helps Building Portfolio Customers Reach Energy and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Carrier's New Abound Net Zero Management Solution Helps Building Portfolio Customers Reach Energy and ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NhcnJpZXJzLW5ldy1hYm91bmQtbmV0LXplcm8tbWFuYWdlbWVudC1zb2x1dGlvbi1oZWxwcy1idWlsZGluZy1wb3J0Zm9saW8tY3VzdG9tZXJzLXJlYWNoLWVuZXJneS1hbmQtc3VzdGFpbmFiaWxpdHktZ29hbHMtMzAxNzM2MTQ0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Carrier's New Abound Net Zero Management Solution Helps Building Portfolio Customers Reach Energy and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Reduction Initiatives\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"CHARLOTTE, N.C., Feb. 1, 2023 \/PRNewswire\/ -- Carrier has launched Abound™ Net Zero Management, a new, digitally-enabled lifecycle sustainability solution that provides building owners and managers a way to measure, track, view and report energy and carbon performance across their entire property portfolio to help meet environmental, social and governance (ESG) goals. Carrier is a part of Carrier Global Corporation (NYSE: CARR), the leading global provider of healthy, safe, sustainable and intelligent building and cold chain solutions. Abound™ Net Zero Management calculates and evaluates energy and carbon use across an entire building portfolio. The new, digitally-enabled lifecycle sustainability solution provides a way to view a building portfolio’s performance and drill down into individual building metrics. At a time when buildings account for 40% of greenhouse gas (GHG) emissions and countries are adopting regulations limiting building carbon emissions, organizations have made ESG goals a priority. Abound Net Zero Management provides consistent tracking and reporting of information in a single application, making energy and emissions data readily accessible to key stakeholders including health and safety professionals, and energy and facility managers. Net Zero Management is part of Carrier's Abound suite of connected solutions that use advanced technologies to enable real-time, intelligent outcome-based results that can make buildings more efficient and responsive. \"With Net Zero Management, building ownership, management teams and their tenants can easily share normalized and standardized energy usage data,\" said Yasir Qureshi, General Manager of Digital Products and Abound, Carrier. \"Organizations can plan and take actions to reduce costs, mitigate risks and align with emerging regulations and corporate ESG goals.\" Abound Net Zero Management provides all building stakeholders with the ability to automatically collect and evaluate energy use data from utility providers and submeters installed at properties. Users can generate different reports on energy consumption, spend and GHG emissions and proactively identify conservation actions for buildings. The rich features of Net Zero Management allow an organization to track and analyze energy performance in an individual building, across multiple sites or benchmark against a set of buildings. Customers can then identify underperforming equipment or buildings, prioritize specific energy and carbon reduction measures, fix operational issues such as inefficient scheduling and institute new energy and carbon reduction initiatives. Net Zero Management is the latest offering in Carrier's portfolio of efficient, innovative products that supports its ambitious 2030 ESG goal to help customers reduce their carbon footprint by more than 1 gigaton. To learn more about Net Zero Management and the complete benefits of the Abound platform – including real-time indoor air quality, thermal comfort and energy usage insights – visit abound.carrier.com\/en\/worldwide\/net-zero-management\/. About Carrier Founded by the inventor of modern air conditioning, Carrier is a world leader in high-technology heating, air-conditioning and refrigeration solutions. Carrier experts provide sustainable solutions, integrating energy-efficient products, building controls and energy services for residential, commercial, retail, transport and food service customers. Carrier is a part of Carrier Global Corporation, the leading global provider of healthy, safe, sustainable and intelligent building and cold chain solutions. For more information, visit carrier.com or follow @Carrier on Twitter. SOURCE Carrier","filter_flag":1}
{"title":"Sinopec Launches the World's Largest Green Hydrogen-Coal Chemical Project in Inner Mongolia - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Npbm9wZWMtbGF1bmNoZXMtdGhlLXdvcmxkcy1sYXJnZXN0LWdyZWVuLWh5ZHJvZ2VuLWNvYWwtY2hlbWljYWwtcHJvamVjdC1pbi1pbm5lci1tb25nb2xpYS0zMDE3NTI1ODUuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Npbm9wZWMtbGF1bmNoZXMtdGhlLXdvcmxkcy1sYXJnZXN0LWdyZWVuLWh5ZHJvZ2VuLWNvYWwtY2hlbWljYWwtcHJvamVjdC1pbi1pbm5lci1tb25nb2xpYS0zMDE3NTI1ODUuaHRtbNIBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Npbm9wZWMtbGF1bmNoZXMtdGhlLXdvcmxkcy1sYXJnZXN0LWdyZWVuLWh5ZHJvZ2VuLWNvYWwtY2hlbWljYWwtcHJvamVjdC1pbi1pbm5lci1tb25nb2xpYS0zMDE3NTI1ODUuaHRtbNIBAA","guidislink":false,"published":"Tue, 21 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Npbm9wZWMtbGF1bmNoZXMtdGhlLXdvcmxkcy1sYXJnZXN0LWdyZWVuLWh5ZHJvZ2VuLWNvYWwtY2hlbWljYWwtcHJvamVjdC1pbi1pbm5lci1tb25nb2xpYS0zMDE3NTI1ODUuaHRtbNIBAA?oc=5\" target=\"_blank\">Sinopec Launches the World's Largest Green Hydrogen-Coal Chemical Project in Inner Mongolia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sinopec Launches the World's Largest Green Hydrogen-Coal Chemical Project in Inner Mongolia - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3Npbm9wZWMtbGF1bmNoZXMtdGhlLXdvcmxkcy1sYXJnZXN0LWdyZWVuLWh5ZHJvZ2VuLWNvYWwtY2hlbWljYWwtcHJvamVjdC1pbi1pbm5lci1tb25nb2xpYS0zMDE3NTI1ODUuaHRtbNIBAA?oc=5\" target=\"_blank\">Sinopec Launches the World's Largest Green Hydrogen-Coal Chemical Project in Inner Mongolia<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Reduction Initiatives\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"BEIJING, HOHHOT and ORDOS, China, Feb. 21, 2023 \/PRNewswire\/ -- China Petroleum & Chemical Corporation (HKG: 0386, \"Sinopec\") held launching ceremonies of its first hydrogen demonstration project in the Inner Mongolia Autonomous Region, the Inner Mongolia Erdos Wind-Solar Green Hydrogen Project (the \"Project\"), on February 16 in Beijing, Hohhot and Erdos. Sinopec Launches the World’s Largest Green Hydrogen-Coal Chemical Project in Inner Mongolia. The Project will utilize the rich solar and wind energy resources in the Erdos region to produce green hydrogen directly, projecting to reach an annual production capacity of 30,000 tons of green hydrogen and 240,000 tons of green oxygen, which will be used for the carbon reduction initiatives of the adjacent ZTHC Energy intensive coal processing pilot project in Erdos. A milestone in Sinopec's hydrogen development roadmap following its green hydrogen pilot project in Kuqa Xinjiang in 2021, the Project, the world's largest in the green hydrogen coal-chemical field, will further expand China's and global green hydrogen production capacity, promote the development of the green hydrogen industry chain and advance China's green energy goals. The Project's scope covers wind and photovoltaic power generation, power transmission and transformation, hydrogen production by water electrolysis, hydrogen storage and transport. The installed power-generating capacity of wind and PV power will reach 450 megawatts and 270 megawatts respectively; the hydrogen production by water electrolysis will achieve a capacity of 30,000 tons annually, and the hydrogen storage capacity will reach 288,000 standard cubic meters. With a 5.7-billion-yuan (USD 828.04 million) investment, the project is estimated to reduce carbon emission by 1.43 million tons annually, contributing 600 million yuan (USD 87.17 million) in GDP and 30 million yuan (USD 4.36 million) of tax. \"The Project is of great significance to guaranteeing China's energy security, building new energy systems and advancing green energy and low-carbon development in Inner Mongolia, leading towards a new, high-quality development roadmap that prioritizes ecological conservation and green development,\" said Ma Yongsheng, Chairman of Sinopec. The Project has achieved numerous technological breakthroughs including hydrogen production under renewable fluctuating power conditions. Leveraging advanced clean energy production technologies (wind, power, and hydrogen production by water electrolysis), Sinopec has lowered hydrogen production costs and improved system efficiency while guaranteeing safety and reliability. Looking ahead, Sinopec, as China's largest hydrogen production enterprise, will continue advancing hydrogen energy industry chain development in China with the R&D of innovative technologies, a forward-looking roadmap and comprehensive industry layout. SOURCE SINOPEC","filter_flag":1}
