{"title":"ProLight + Sound 2023: Day Four - The Light Sound Journal","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmxpZ2h0c291bmRqb3VybmFsLmNvbS8yMDIzLzA0LzMwL3Byb2xpZ2h0LXNvdW5kLTIwMjMtZGF5LWZvdXIv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmxpZ2h0c291bmRqb3VybmFsLmNvbS8yMDIzLzA0LzMwL3Byb2xpZ2h0LXNvdW5kLTIwMjMtZGF5LWZvdXIv0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmxpZ2h0c291bmRqb3VybmFsLmNvbS8yMDIzLzA0LzMwL3Byb2xpZ2h0LXNvdW5kLTIwMjMtZGF5LWZvdXIv0gEA","guidislink":false,"published":"Sun, 30 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=120, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmxpZ2h0c291bmRqb3VybmFsLmNvbS8yMDIzLzA0LzMwL3Byb2xpZ2h0LXNvdW5kLTIwMjMtZGF5LWZvdXIv0gEA?oc=5\" target=\"_blank\">ProLight + Sound 2023: Day Four<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Light Sound Journal<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ProLight + Sound 2023: Day Four - The Light Sound Journal","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmxpZ2h0c291bmRqb3VybmFsLmNvbS8yMDIzLzA0LzMwL3Byb2xpZ2h0LXNvdW5kLTIwMjMtZGF5LWZvdXIv0gEA?oc=5\" target=\"_blank\">ProLight + Sound 2023: Day Four<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Light Sound Journal<\/font>","source.href":"https:\/\/www.lightsoundjournal.com","source.title":"The Light Sound Journal","query":"https:\/\/news.google.com\/rss\/search?q=\"Robust design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Share Fourth and final date with the best from ProLight+Sound 2023 with Visual Productions, Luminex, Lumen Radio, Martin and Hollyland. VISUAL PRODUCTIONS The well-known company specialising in solutions for the over IP control of DMX and DALI signals presents its new products CueCore3, Purple Cloud and RdmRelay in Frankfurt. CueCore3 is a completely solid-state and therefore more reliable device with four DMX ports, each bi-directional and optically isolated, improved CPU and an increased number of playbacks to 16. The DMX recording memory is now 6 GB, some 200 times larger than that of the CueCore2, as are the maximum number of sources, actions and activities, which have in fact been significantly increased. The CueCore3 is also a full RDM controller, capable of detecting, changing addresses and reading status information from the various fixtures connected to it. The CueCore3 handles numerous protocols such as DMX-512, Art-Net, sACN and KiNet, as well as signals that allow interaction with all kinds of non-lighting equipment such as GPI, MIDI, UDP, TCP and OSC. It also supports timecode signals such as SMPTE and MTC. The scalable design of CueCore3 allows implementation in small and large projects. The stand-alone operation of a single CueCore3 is often sufficient for a small installation. Whereas a grid of several CueCores, all networked together, meets the capacity required by large lighting installations. The CueCore3 features a fluent master-slave protocol for synchronising multiple units. Also new is RdmRelay, a DIN-rail mounted device with four relays and controllable via DMX and RDM. The device can be set up via RDM and is equipped with four heavy-duty relays with the ability to switch 110 V\/230 V equipment at up to 16 amps per relay. They are ideal for controlling non-DMX equipment or for switching off a lighting system. Finally, Purple Cloud allows remote monitoring and control of your setup through a simple and intuitive web interface. Info: www.visualproductions.nl LUMINEX Luminex presents three new GigaCore 20t, 18t and 16t models in Frankfurt. These devices are specifically designed for professional touring applications for audio, video and lighting, or any other application where robust connectivity is required. These new switches come with all the features for which the GigaCore family is well known in the professional AV market, and join the GigaCore 30i, which has been welcomed by users worldwide since its launch last year. The GigaCore 20t, 18t and 16t are an ideal choice for professionals working in the event production and entertainment industry, who need reliable network equipment with port speeds of up to 10 Gigabits. Luminex‘s new 10Gb Ethernet switches are dedicated to converged networking. With 10Gb connectivity options, the GigaCore range enables full network convergence of audio, lighting, intercom, (compressed) video and more. Pre-configured Quality of Service (QoS), IGMP multicast and PTPv2 settings ensure a responsive and extremely stable network environment for the most demanding protocols such as Dante™, AES67, Q-SYS and many others. Info: www.luminex.be LUMEN RADIO LumenRadio presents the latest Wireless DMX to meet the needs of fixed installation projects. In response to the growing demand for dynamic lighting control in fixed installations, LumenRadio is showcasing the new Galileo TX and RX, two products specifically designed to make fixed installation projects simpler and more cost-effective. Powered by LumenRadio’s trusted and reliable CRMX technology, Galileo is built on the same technology that LumenRadio has been providing to the entertainment lighting industry for over a decade. Working closely with industry professionals, Galileo has been developed to make every installation project easier than ever, providing reliable wireless DMX in an easy-to-install form factor. Using DIN rail or IP-rated housings, Galileo is suitable for all indoor and outdoor installation projects. Like all LumenRadio products, Galileo offers advanced features such as cognitive coexistence, Wireless RDM, fixed 5 ms latency, 128-bit encryption, error correction, and more. Multiple Galileo units can be used to transmit different DMX universes, allowing for easy system expansion and in-app repeater upgrades to extend signal coverage. Thanks to Bluetooth connectivity, commissioning and configuration have never been easier and, with support for CRMX and W-DMX, it is compatible with almost all wireless DMX devices on the market. Info: lumenradio.com MARTIN Martin also focuses on the weather protection concept with the new MAC Aura XIP, a high quality moving head washlight with an aura effect and full pixel control with video mapping functionality on the beam, the aura or both. It is the latest addition to the MAC Aura family of washlights, offering excellent optical quality with a uniform wash field with soft edges, minimal scattered light and high intensity mid-air beams with improved light engine control. While the MAC Aura XIP offers lighting designers a host of possibilities with its filament aura effect, narrower beam and improved wash quality with improved light engine control, rental companies will appreciate a lighter and more versatile product due to its optical enhancements and sealed design, which allows the product to be used virtually anywhere with very little maintenance. In addition, we were able to take a closer look at the MAC Ultra Performance‘s, with its coherent beam across the entire zoom range, a new generation framing system, higher definition optics and surprisingly low noise levels. Inside is the proprietary 1150 W, 5800 K LED source capable of delivering up to 46,500 lumens and with high-resolution dimming, strobe and Martin’s unique Animotion effect. The refined optical system offers a 1:7 zoom and precise focus control. The extensive feature package includes smooth colour mixing, variable CTO, additional colour and spectrum correction filters, Martin’s innovative Extended Framing system, two rotating gobo wheels, a full function animation wheel, iris, frost and prismatic effects and a truly responsive and precise pan and tilt. All these features are packed into a compact and robust design. Info: www.martin.com HOLLYLAND Among the new products presented by Hollyland at ProLight+Sound is the Solidcom C1 Pro full-duplex wireless intercom system, the company’s first product with dual-microphone ENC (Environmental Noise Cancellation) technology. It is an incredibly lightweight and easy-to-use product, ideal for production teams working in noisy environments where extreme clarity of communication is essential. This next-generation headset system features advanced DECT 6.0 technology, a wideband audio range from 150Hz to 7kHz and a reliable LOS communication range of up to 350m. Dual microphone ENC technology delivers clear sound in noisy and difficult environments. The main directional microphone focuses precisely on the speaker’s vocal range, while the secondary omnidirectional microphone picks up ambient noise from different directions as noise samples. The audio signal is processed with the advanced ENC algorithm, which effectively cancels out ambient noise and offers crystal-clear sound quality. In addition, the Solidcom C1 Pro offers a versatile solution that prevents airflow from directly hitting the microphone. Thanks to the special wind filter used for the main microphone, you can enjoy total peace of mind in production environments where wind noise is a major challenge. Info: www.hollyland.com","filter_flag":1}
{"title":"Global Raman Spectroscopy Market Report 2023: Increased Focus on Drug Development in the Healthcare Sector ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNy8yNjU2Nzc5LzI4MTI0L2VuL0dsb2JhbC1SYW1hbi1TcGVjdHJvc2NvcHktTWFya2V0LVJlcG9ydC0yMDIzLUluY3JlYXNlZC1Gb2N1cy1vbi1EcnVnLURldmVsb3BtZW50LWluLXRoZS1IZWFsdGhjYXJlLVNlY3Rvci1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNy8yNjU2Nzc5LzI4MTI0L2VuL0dsb2JhbC1SYW1hbi1TcGVjdHJvc2NvcHktTWFya2V0LVJlcG9ydC0yMDIzLUluY3JlYXNlZC1Gb2N1cy1vbi1EcnVnLURldmVsb3BtZW50LWluLXRoZS1IZWFsdGhjYXJlLVNlY3Rvci1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5","id":"CBMixgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNy8yNjU2Nzc5LzI4MTI0L2VuL0dsb2JhbC1SYW1hbi1TcGVjdHJvc2NvcHktTWFya2V0LVJlcG9ydC0yMDIzLUluY3JlYXNlZC1Gb2N1cy1vbi1EcnVnLURldmVsb3BtZW50LWluLXRoZS1IZWFsdGhjYXJlLVNlY3Rvci1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNy8yNjU2Nzc5LzI4MTI0L2VuL0dsb2JhbC1SYW1hbi1TcGVjdHJvc2NvcHktTWFya2V0LVJlcG9ydC0yMDIzLUluY3JlYXNlZC1Gb2N1cy1vbi1EcnVnLURldmVsb3BtZW50LWluLXRoZS1IZWFsdGhjYXJlLVNlY3Rvci1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5\" target=\"_blank\">Global Raman Spectroscopy Market Report 2023: Increased Focus on Drug Development in the Healthcare Sector ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Raman Spectroscopy Market Report 2023: Increased Focus on Drug Development in the Healthcare Sector ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMixgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNy8yNjU2Nzc5LzI4MTI0L2VuL0dsb2JhbC1SYW1hbi1TcGVjdHJvc2NvcHktTWFya2V0LVJlcG9ydC0yMDIzLUluY3JlYXNlZC1Gb2N1cy1vbi1EcnVnLURldmVsb3BtZW50LWluLXRoZS1IZWFsdGhjYXJlLVNlY3Rvci1Ecml2ZXMtR3Jvd3RoLmh0bWzSAQA?oc=5\" target=\"_blank\">Global Raman Spectroscopy Market Report 2023: Increased Focus on Drug Development in the Healthcare Sector ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Robust design\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Dublin, April 27, 2023 (GLOBE NEWSWIRE) -- The \"Global Raman Spectroscopy Market by Type (Benchtop, Portable), Instrument (Microscopy, FT, Handheld & Portable), Sampling Technique (Surface-enhanced Raman Scattering, Tip-enhanced Raman Scattering), Application and Region- Forecast to 2028\" report has been added to ResearchAndMarkets.com's offering. The Raman spectroscopy market is projected to reach USD 1.1 billion by 2028 from USD 0.8 billion in 2023, at a CAGR of 7.0% from 2023 to 2028. In 2022, the surface-enhanced Raman scattering (SERS) segment held the largest share of the Raman spectroscopy market, and a similar trend is likely to be observed during the forecast period. Continuous technological development of nanotechnology and extensive theoretical and experimental research has significantly broadened the scope of surface-enhanced Raman scattering and increased its demand in pharmaceutical, life science, and materials science research. Also, the SERS sampling technique can be used to amplify weak Raman signals, especially when signals using visible light excitation and a low number of scattered photons are available for detection. Hence, surface-enhanced Raman scattering finds its application in drug delivery, detection of trace amounts of chemical and biological threat agents, Point-of-care (POC) medical diagnostic devices, and forensic field testing. Handheld & Portable Raman instrument is expected to account for the largest market share in Raman spectroscopy hardware market during the forecast period The handheld & portable Raman segment is projected to record the largest share of the market during the forecast period. Handheld & portable Raman spectroscopy has the ability to offer a simple point-and-shoot format and fully portable testing with an ergonomic design. So, it enables rapid responses for unknown characterization against integrated digital libraries and pre-existing method data. In addition, low-skilled personnel can easily carry out these spectroscopies to acquire the molecular fingerprint of raw materials for pharmaceutical, life science, and materials science applications. The major advantages of handheld and portable Raman instruments include the ability to perform in-field measurements of robust design as well as usual sample handling. However, the spectra of handheld and portable Raman devices are sometimes less reproducible, less accurate, and are affected by noise, which can be considered as a significant drawback, especially in pharmaceutical applications. Handheld and portable Raman instruments are used for the analysis of pharmaceutical, life science, agriculture, drugs, explosives, and mineral samples. North America accounted for the second-highest market share in 2022 The region is an early adopter of new and advanced technologies. The market growth in this region can be attributed to the presence of many Raman spectroscopy manufacturers in the US. Thermo Fisher Scientific Inc., Agilent Technologies, Inc., Bruker, and Mettler Toledo are among the few leading manufacturers offering Raman spectroscopy in the US. These players spend extensively on research and development (R&D) activities to provide innovative offerings in this market. For instance, in 2021, Thermo Fisher Scientific, Inc. invested nearly USD 1.4 billion in R&D, whereas in the same year, Agilent Technologies, Inc. introduced the new Agilent Vaya Raman raw material identity verification system. This handheld instrument accelerates quality control testing in the pharmaceuticals and biopharmaceutical industries. Key Attributes: Report Attribute Details No. of Pages 251 Forecast Period 2023 - 2028 Estimated Market Value (USD) in 2023 $0.8 Billion Forecasted Market Value (USD) by 2028 $1.1 Billion Compound Annual Growth Rate 7.0% Regions Covered Global Market Dynamics Drivers Increased Focus on Drug Development in Healthcare Sector Rising Adoption of Raman Spectroscopy in Clinical Applications Advancements in Raman Spectroscopic Techniques Used in Catalysts and Catalytic Reactions Growing Awareness Regarding Food Safety Growing Requirement for Mineral Analysis Restraints High Ownership Cost Requirement for Highly Skilled Workforce to Keep Up with Advancements in Raman Spectroscopy Lack of Awareness Regarding Potential Applications of Raman Spectroscopy Among End-users Unsuitability of Raman Spectroscopy with Metals and Alloys Opportunities Rising Demand for Cloud-Based Spectroscopy Rising Demand for Process Analytical Technology (Pat) in Pharmaceutical Industry Increasing Demand for Raman Spectroscopy in Carbon Materials Application Rising Demand for Raman Spectroscopy in Semiconductor Industry Increasing Research and Development (R&D) Expenditure on Raman Spectroscopy Challenges Lack of Improvements in Raman Spectrometer Design Lack of Development of Low-Cost, Highly Efficient Raman Spectrometers Case Study Analysis Development of New Raman Micro-Spectroscopy Technique That Can Image Polymer Phase Distributions Research and Development of Ground-Breaking Biosensor Platform for Early-Stage Cancer Diagnosis Implementation of Transmission Raman Spectroscopy for Fast Content Uniformity Testing Enhancements in Raman Measurements Using High-Throughput Virtual Slit Spectrometers Use of Raman Spectroscopy in Archaeological Sites Companies Mentioned Agilent Technologies, Inc. Anton Paar B&W Tek Bruker Endress+Hauser Group Services Ag Enhanced Spectrometry, Inc. Hamamatsu Photonics Horiba, Ltd. Jasco Laser Detect System Metrohm Ag Mettler Toledo Ocean Insight Ostec Oxford Instruments Perkinelmer Inc. Photon Systems, Inc. Real Time Analyzers Renishaw plc Rigaku Corporation Smiths Detection Thermo Fisher Scientific Inc. Tornado Spectral Systems TSI Zolix For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/wmkw18 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
