{"title":"BUILDINGLINK ANNOUNCES SCIENCE-BASED TARGET COMMITMENT FOR CARBON REDUCTION - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2J1aWxkaW5nbGluay1hbm5vdW5jZXMtc2NpZW5jZS1iYXNlZC10YXJnZXQtY29tbWl0bWVudC1mb3ItY2FyYm9uLXJlZHVjdGlvbi0zMDE4ODY1NjQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2J1aWxkaW5nbGluay1hbm5vdW5jZXMtc2NpZW5jZS1iYXNlZC10YXJnZXQtY29tbWl0bWVudC1mb3ItY2FyYm9uLXJlZHVjdGlvbi0zMDE4ODY1NjQuaHRtbNIBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2J1aWxkaW5nbGluay1hbm5vdW5jZXMtc2NpZW5jZS1iYXNlZC10YXJnZXQtY29tbWl0bWVudC1mb3ItY2FyYm9uLXJlZHVjdGlvbi0zMDE4ODY1NjQuaHRtbNIBAA","guidislink":false,"published":"Wed, 26 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=207, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2J1aWxkaW5nbGluay1hbm5vdW5jZXMtc2NpZW5jZS1iYXNlZC10YXJnZXQtY29tbWl0bWVudC1mb3ItY2FyYm9uLXJlZHVjdGlvbi0zMDE4ODY1NjQuaHRtbNIBAA?oc=5\" target=\"_blank\">BUILDINGLINK ANNOUNCES SCIENCE-BASED TARGET COMMITMENT FOR CARBON REDUCTION<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BUILDINGLINK ANNOUNCES SCIENCE-BASED TARGET COMMITMENT FOR CARBON REDUCTION - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2J1aWxkaW5nbGluay1hbm5vdW5jZXMtc2NpZW5jZS1iYXNlZC10YXJnZXQtY29tbWl0bWVudC1mb3ItY2FyYm9uLXJlZHVjdGlvbi0zMDE4ODY1NjQuaHRtbNIBAA?oc=5\" target=\"_blank\">BUILDINGLINK ANNOUNCES SCIENCE-BASED TARGET COMMITMENT FOR CARBON REDUCTION<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Reduction Initiatives\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"NEW YORK, July 26, 2023 \/PRNewswire\/ -- BuildingLink is proud to announce our company has received validation and approval on its science-based target in alignment with the Science-Based Targets initiative (SBTi) to reduce overall emissions as part of an ongoing pledge to climate action. As a part of the commitment, BuildingLink has committed to reducing its Scope 1 and 2 emissions by 42% by 2030 from a 2020 baseline year, and will measure and reduce its Scope 3 emissions. Zachary Kestenbaum, BuildingLink CEO said, \"We are thrilled to make this announcement aligning with our environmental, social and governance standards, which reaffirms our dedication to sustainability and business resiliency. We believe that collaboration is key to driving change, and we will continue to work closely with our employees, customers, suppliers, and stakeholders to drive meaningful impact.\" BuildingLink's science-based target will serve as a guiding framework for the company's carbon reduction initiatives. Post this The Science Based Targets initiative is a global entity that drives ambitious climate action in the private sector by enabling companies to set science-based emissions reduction targets. It defines and promotes best practices in emissions reductions and net-zero targets in line with climate science and provides technical assistance and expert resources to companies. It includes the guidance, criteria and recommendations companies need to set science-based targets accelerating companies across the world to halve emissions before 2030 and achieve net-zero emissions before 2050. BuildingLink's science-based target will serve as a guiding framework for the company's carbon reduction initiatives, outlining and ensuring a systematic and measured approach leading up to 2030. To achieve these targets, BuildingLink plans to implement key initiatives including mitigating emissions associated with purchased electricity via renewable energy certificates, exploring opportunities to directly procure renewable electricity for our offices, and collaborating with suppliers to reduce risk and decrease value chain emissions. \"We will prioritize transparency and accountability, continuously monitoring progress to ensure we meet our commitment\", said Kestenbaum. \"As the industry's pioneering property management software solution, we actively drive progress in our space, and we are proud to be doing so again as part of the global efforts to decarbonize.\" About BuildingLink: Trusted worldwide by over 6,500 condominium associations, multifamily properties, housing associations, and housing cooperatives, BuildingLink's powerful platform empowers property managers globally to deliver a superior resident experience while streamlining communications, maintenance and community operations. BuildingLink's mission is to simplify and elevate the modern management of residential communities and buildings through inspired software solutions, pioneering technology and dedicated customer service. For more information, visit the BuildingLink website www.buildinglink.io or follow us on LinkedIn. Media Contact: Courtney Phillips BuildingLink [email protected] SOURCE BuildingLink.com, LLC","filter_flag":1}
