{"title":"Circular economy - Economist Impact","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vcHJvamVjdHMvY2lzY28tY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vcHJvamVjdHMvY2lzY28tY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vcHJvamVjdHMvY2lzY28tY2lyY3VsYXItZWNvbm9teS_SAQA","guidislink":false,"published":"Tue, 21 Feb 2023 01:21:08 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=1, tm_min=21, tm_sec=8, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vcHJvamVjdHMvY2lzY28tY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5\" target=\"_blank\">Circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Impact<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circular economy - Economist Impact","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vaW1wYWN0LmVjb25vbWlzdC5jb20vcHJvamVjdHMvY2lzY28tY2lyY3VsYXItZWNvbm9teS_SAQA?oc=5\" target=\"_blank\">Circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Impact<\/font>","source.href":"https:\/\/impact.economist.com","source.title":"Economist Impact","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"This is especially arduous for organisations in the global IT sector— businesses that produce hardware and other complex systems, which tend to get shipped in plastic packaging. These products can be difficult to recycle because they are made of several materials, including glass, plastics and metals. But many in the IT sector are rising to the challenge. For instance, circular design is now top of mind at IT giant Cisco as the organisation scrutinises everything from sourcing materials and shipping methods to the use of plastic and extended life cycles. The company is not only asking its employees to think more sustainably, but is also asking customers to join its efforts. “Frankly, a circular economy is important not just to Cisco, but to our customers,” says Scott Herren, Cisco’s chief financial officer. “So even though we’re dealing with a number of crises, as corporate citizens, we think it’s also really important to focus a lot of effort on being a circular economy leader.” ","filter_flag":1}
{"title":"Back to basics: A systems thinker's view on circularity - GreenBiz","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2JhY2stYmFzaWNzLXN5c3RlbXMtdGhpbmtlcnMtdmlldy1jaXJjdWxhcml0edIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2JhY2stYmFzaWNzLXN5c3RlbXMtdGhpbmtlcnMtdmlldy1jaXJjdWxhcml0edIBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2JhY2stYmFzaWNzLXN5c3RlbXMtdGhpbmtlcnMtdmlldy1jaXJjdWxhcml0edIBAA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2JhY2stYmFzaWNzLXN5c3RlbXMtdGhpbmtlcnMtdmlldy1jaXJjdWxhcml0edIBAA?oc=5\" target=\"_blank\">Back to basics: A systems thinker's view on circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Back to basics: A systems thinker's view on circularity - GreenBiz","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmdyZWVuYml6LmNvbS9hcnRpY2xlL2JhY2stYmFzaWNzLXN5c3RlbXMtdGhpbmtlcnMtdmlldy1jaXJjdWxhcml0edIBAA?oc=5\" target=\"_blank\">Back to basics: A systems thinker's view on circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GreenBiz<\/font>","source.href":"https:\/\/www.greenbiz.com","source.title":"GreenBiz","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"We know GreenBiz readers have an impressive understanding of the circular economy; the opportunity, the hurdles and what it will take for us to collectively shift the system. But as a systems thinker, I like to return frequently to the bigger picture. Since joining the GreenBiz Circularity team late last year, I’ve been asked some version of the following three questions by colleagues, friends and family members many times. I hope the replay of that dialogue resonates with you and provides new nuance or food for thought. Question 1: How is circularity different from sustainability? If you’ve ever taken a sustainability course, you likely have come across the following definition, from the 1987 United Nations Brundtland Commission: Sustainability is \"meeting the needs of the present without compromising the ability of future generations to meet their own needs.\" Sustainability generally strives to reduce impacts on people and the planet as compared to the status quo — say a baseline of previous operations or the industry standard. The ambition for sustainability has grown since 1987, but in too many cases, sustainability is still seen as \"doing less bad.\" As Joel Makower puts it, \"There's little honor in ravaging the planet incrementally less.\" The circular economy is a systems approach that answers one \"how\" in our quest for sustainability. For simplicity, the circular economy is often described through a juxtaposition with the traditional \"take-make-waste\" system we are all familiar with, the linear economy. Unlike a linear system in which raw materials are extracted, transformed into products and then turned into waste with little regard to environmental, social and even economic externalities, a circular model aims to keep materials in the system at their highest value for as long as possible. The success of the circular economy at a systemic level depends on other global shifts: namely, the transition to renewable energy and a steady supply of responsibly sourced renewable material. Sustainability is often considered an addition to an entity’s collective practices to improve the whole. Circularity, in contrast, must sit at the core of operations, aiming for profitability while simultaneously addressing global issues such as pollution, nature and biodiversity loss and climate change. Given the pervasiveness of linear economic models, circularity often requires a rebuilding of systems, business models and operations from the ground up. As a prominent thought leader in circularity, the Ellen MacArthur Foundation organizes the circular economy under three design-driven principles: Eliminate waste and pollution Circulate products and materials (at their highest value) Regenerate nature The success of the circular economy at a systemic level depends on other global shifts: namely, the transition to renewable energy and a steady supply of responsibly sourced renewable material. In summary: Circularity has a specific focus on the cycling of resources, lessening both our material use and waste to support a healthy planet. Sustainability deals in broader and more general efforts to reduce social, environmental and economic impact across an entity’s operations. Question 2: Is circularity just recycling? Given that circularity is all about keeping materials in use, at their highest value, for as long as possible, it's natural to wonder if this just means recycling. And while this isn’t necessarily the wrong way to think about it, there’s some nuance here to be parsed out. Circularity is, in fact, all about cycling materials repeatedly — so in this sense, recycling. This is in contrast to the way in which this term is more often used: to describe the industrial process of turning waste into new products. The latter type of recycling — for example, collecting plastic packaging and mechanically sorting, shredding, washing and reprocessing this plastic into new packaging — is actually one of the lower-priority strategies in the circular economy model. Let’s back up a bit. Integral to the circular economy are feedback loops, whereby products and materials are recirculated through the system. In nature, feedback loops nourish and add value to ecosystems. Take a tree that drops its leaves in the fall. These leaves decompose, feeding microbes and returning nutrients to the soil where they’ll be reabsorbed by another plant in search of nutrients. In the biological cycle, renewable materials such as agricultural waste are recycled through the system through processes such as composting or anaerobic digestion. In the technical cycle, reuse, repair and recycling allow non-biodegradable materials to recirculate through the economy. This is demonstrated through the so-called \"Butterfly Diagram,\" seen below. Photo Credit: The Butterfly Diagram. Image from The Ellen MacArthur Foundation Designing our economic system with robust feedback loops to mimic nature is revolutionary; since the industrial revolution, we have built a system that forces nature to fit our economy rather than fitting our economy into nature. Strategies such as increasing the durability of products, new business models that offer sharing, reusing, refurbishing and remanufacturing should be higher-priority strategies than recycling for many industries — from fashion to packaging to electronics. There is a misconception that the circular economy is just a form of waste management or materials recovery. In reality, it is a model for a flourishing economy that minimizes waste as a natural byproduct of its inherent design of feedback loops that restore technical materials and regenerate biological materials. Question 3: Degrowth and reduced consumption are tenets of the circular economy. How do we measure success? As this is the hardest question to answer, I’ll respond with yet more questions. Is growth always good? Is growth the best thing to measure? The success of global and regional economies have historically been measured by one single indicator, gross domestic product (GDP). But if current and future generations are to thrive within planetary boundaries, we must reimagine how we define progress and opportunity. This is the underlying rationale for the development of \"doughnut economics,\" a visual model for sustainable growth. By DoughnutEconomics - Own work, CC BY-SA 4.0, https:\/\/commons.wikimedia.org\/w\/index.php?curid=75695171 By DoughnutEconomics - Own work, CC BY-SA 4.0, https:\/\/commons.wikimedia.org\/w\/index.php?curid=75695171 The model resembles a doughnut where the doughnut ring itself represents a safe and just space for humans to exist within. Inside the ring (the doughnut hole) represents a situation in which people lack essential social necessities such as healthcare, education and political voice. Meanwhile, the outside of the doughnut (the crust) represents ecological boundaries beyond which earth’s natural systems are under threat. This model provides a revolutionary way to understand prosperity and set goals for humanity. According to this model, prosperity can be achieved when we are situated in the middle ring, neither overshooting planetary boundaries nor lacking the necessary social foundations for all people. As Kate Raworth, founder of Doughnut Economics, has said, \"A healthy economy should be designed to thrive, not grow.\" I hope this essay helps you pause and remember the bigger picture. As you orient yourself in your role towards the larger, systemic goals we are collectively trying to achieve, take heart that you’re part of an exciting, growing community working to do the same. Over the coming months and years, I look forward to learning more about each of you and your contributions to the circular economy.","filter_flag":1}
{"title":"Pathways towards circular plastics in Europe — good practice examples from countries, business and citizens - European Environment Agency","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3BhdGh3YXlzLXRvd2FyZHMtY2lyY3VsYXItcGxhc3RpY3MtaW7SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3BhdGh3YXlzLXRvd2FyZHMtY2lyY3VsYXItcGxhc3RpY3MtaW7SAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3BhdGh3YXlzLXRvd2FyZHMtY2lyY3VsYXItcGxhc3RpY3MtaW7SAQA","guidislink":false,"published":"Mon, 20 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=51, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3BhdGh3YXlzLXRvd2FyZHMtY2lyY3VsYXItcGxhc3RpY3MtaW7SAQA?oc=5\" target=\"_blank\">Pathways towards circular plastics in Europe — good practice examples from countries, business and citizens<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pathways towards circular plastics in Europe — good practice examples from countries, business and citizens - European Environment Agency","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3BhdGh3YXlzLXRvd2FyZHMtY2lyY3VsYXItcGxhc3RpY3MtaW7SAQA?oc=5\" target=\"_blank\">Pathways towards circular plastics in Europe — good practice examples from countries, business and citizens<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","source.href":"https:\/\/www.eea.europa.eu","source.title":"European Environment Agency","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Plastics pollution is found everywhere in the environment, even in remote places, as has been known for years. Recently, knowledge has increased about the negative impact of plastics on climate change, air pollution and human health. New pathways for plastics production and consumption are needed to increase circularity and sustainability in Europe and beyond. The three pathways discussed in this briefing are smarter use, increased circularity and renewable materials, for which good practice examples are found across Europe (EEA, 2020). This briefing provides an overview of good practice examples of these pathways, including from policymakers, business and citizens. There is no ‘one solution fits all’ for circular and sustainable plastics. The examples provide inspiration, are scalable and can therefore help to build the foundations of an increasingly circular and sustainable plastics economy. This briefing is underpinned by a more detailed report prepared by the European Topic Centre on Circular Economy and Resource Use (ETC\/CE). Figure 1 shows how the good practice examples found for the three pathways address various life cycle steps and contribute to reduced environmental impacts. Figure 1. Pathways towards sustainable and circular plastics Source: Developed by the EEA and the ETC\/CE — illustration by the Collaborating Centre on Sustainable Consumption and Production (CSCP) and the EEA. The smarter use of plastics pathway An important step towards increasing the sustainability and circularity of plastics is to consider and rethink when and why plastics are used. In Europe and worldwide, there is a need to reduce the use of unnecessary plastics, redesign plastic-containing products and extend the lifetime of plastic products already in use. This includes repairing plastic-containing products more often. The relatively low price of plastics, as well as the current design of most plastic-containing products, does not naturally encourage longer use, repair, reuse or sharing. Therefore, it is important to increase motivation to take action and scale up existing good practice examples, including those reducing the need for plastics or improving reuse systems (OECD, 2022). The approaches used in these good practice examples may not always be more convenient, but they will be necessary in the transition to a more circular and sustainable use of plastics. Figure 2 illustrates the smarter use of plastics pathway and the good practice examples found, which involve production and use. As shown, business, policymakers and citizens are key to implementing and scaling up the approaches taken in the good practice examples to achieve the goals of the pathway. Figure 2. The smarter use of plastics pathway Note: The life cycle steps highlighted in blue are the ones most relevant for the smarter use pathway, but are not necessarily the only ones that can be found. Source: Developed by the EEA and the European Topic Centre on Circular Economy and Resource Use (ETC\/CE) — illustration by the Collaborating Centre on Sustainable Consumption and Production (CSCP) and the EEA. Good practice examples of the smarter use of plastics most often relate to new business models enabling moving from owning products to accessing services, sharing between citizens, and using less plastic packaging. These are discussed below. New, sustainable and circular business models Access-based circular business models enable consumers to access goods and services that meet their needs without requiring them to own the product itself. These business models have the potential to reduce the production of new products, while increasing the intensity and efficiency of existing products through shared use and reuse. One good example of an access-based business model is renting out reusable cups, cans, cutlery, etc., for different events and using these items in restaurants, instead of providing single-use products. This is seen in France, where all disposable packaging in fast-food restaurants has recently been banned (Chrisafis, 2022). The EU Single-Use Plastics (SUP) Directive aims to ban or reduce the use of 10 types of plastics products that are used only once and often for a short time before they are thrown away and to promote the use of more sustainable alternatives (EU, 2019). Another example is renting out good-quality festival gear, including sleeping mats, tents and pavilions, thereby limiting the purchasing of cheap, poor-quality gear, which is often left behind. A third example is leasing personal electronic products containing plastics, including headphones, printers and washing machines, to reduce the number of new products purchased. All of the above are good practice examples of approaches that, if implemented on a large scale, can reduce the production of new products and increase the intensity and efficiency of use of products containing plastics, decreasing their overall environmental and climate impacts. Sharing between citizens Sharing between citizens is another increasing trend within plastics; instead of purchasing products containing plastics, citizens can share or rent these directly or through common platforms such as libraries. Good practice examples here encourage more circular habits by ensuring that many citizens use the same products again and again. Key to the success and scaling of this scheme is efficient redistribution and accessibility, while at the same time ensuring that sharing services enable consumers to save money (Kimberley, 2020). An example of sharing plastic-containing products is citizens renting their cars (often electric cars) to others when they do not need them (as an alternative to more traditional car rental services). Another example is sharing tools and equipment, for example in Finland, where public libraries offer a wide range of products, such as sewing machines, musical instruments and energy meters. A third example is baby equipment, including toys, strollers, highchairs, car seats and similar, which often are used for a short time, compared to the lifetime of the products. Renting and leasing services for these products are becoming more popular, as is reselling between private consumers through apps, webpages and other platforms. Reusing plastic packaging Using plastics in a smarter way also means avoiding unnecessary use of plastics, including by reusing plastic packaging. In 2021, the EU Plastics Own Resource initiative was implemented, which encourages Member States to reduce packaging waste by putting a uniform call rate on non-recycled plastic packaging waste. One example of smarter plastic packaging use is the business-to-business (B2B) reuse of packaging in the food sector. By standardising plastic crates and pallets and making them good quality, it is possible to create a closed loop, whereby a deposit scheme enables the packaging to be returned. Another example is consumers bringing their own reusable containers to shops and refilling them with various products from bulk (such as nuts, cereals and shampoo). Well-designed refill\/reuse systems can successfully save materials, but more radical approaches such as packaging-free shops have not been very successful on a large scale. The increased circularity of plastics pathway Increasing the circularity of plastics and closing the materials loop, including through higher resource efficiency and lower material (and value) losses, are important for maintaining the value and utility of plastics. A major issue is the (quantity and) quality of recycled materials on the market at present, as only a fraction of these recyclates can be used in high-value products. Therefore, most of the recycled materials are part of downcycling processes. Many plastics contain additives that might hinder the recycling process by contaminating the resulting recyclates. Uncertainty about the composition of waste material often leads to disposal by incineration, contributing to greenhouse gas emissions. Figure 3 illustrates good practice examples for the increased circularity of plastics across the life cycle. Business, policymakers and citizens are key to implementing the approaches taken in these good practice examples to achieve the goals of the pathway. Figure 3. The increased circularity of plastics pathway Note: The life cycle steps highlighted in green are the ones most relevant for the increased circularity of plastics pathway, but are not necessarily the only ones that can be found. Source: Developed by the EEA and the European Topic Centre on Circular Economy and Resource Use (ETC\/CE) — illustration by the Collaborating Centre on Sustainable Consumption and Production (CSCP) and the EEA. Good practice examples for the increased circularity pathway are often related to the increased collection, sorting and recycling of plastics achieved through business, policymaker and citizen initiatives. These are discussed below. Increased collection and sorting of plastic Increasing the collection, sorting and recycling of plastics after use is essential for meeting the goals for better plastic waste management. Collecting and sorting plastics both reduces the amount of plastic littering and microplastics in terrestrial and marine environments and helps to secure the infrastructure needed to increase plastic recycling. In recent years, business has taken many initiatives in response to the growing focus on recycling. One example is businesses offering take-back services for their own products at the end of a product’s life, thereby enabling the qualitative recycling and sometimes reuse of these products. This ensures that companies have full traceability of materials and components. In other cases, businesses collaborate with stakeholders to develop separate collection and recycling schemes for a given product category, making it easier for consumers to hand back their used products. For all consumer products, the role of citizens is key to closing the material loops, be it through contributing to proper collection and separation of waste or choosing products with high recycled content during purchasing, thereby encouraging manufacturers to use more recycled content in their products. Connecting recycling and recycled materials markets Policymakers have a very important role to play in the continued development of policy initiatives that contribute to designing better products for reuse and recycling, increasing the collection rate of plastic waste, and further developing sorting and recycling technology, as well as providing well-developed markets for secondary materials. An important tool that policymakers have to support the circular use of plastics is setting quotas for recycled content in suitable applications, such as packaging, automotive, construction and electronics. Examples include the EU plastics strategy, the newly proposed revision of the EU Packaging and Packaging Waste Directive and the EU Plastics Own Resource initiative as presented above. The EU plastics strategy aims to make recycling profitable for businesses, curb plastic waste, drive innovation and investment and spur global change (EC, 2018). The revision of the Packaging and Packaging Waste Directive covers both packaging design and waste management and establishes EU-level packaging waste prevention measures and targets (EU, 1994). Concrete initiatives include national and regional knowledge hubs that are currently being formed. Another initiative is the Circular Plastics Alliance (CPA), which the European Commission established as part of the EU plastics strategy to boost the EU market for recycled plastics to 10 million tonnes each year by 2025. The alliance covers the whole plastics value chain and comprises 311 signatories representing industry, academia, non-governmental organisations and public authorities. Yet another initiative is the Ellen MacArthur Foundation’s initiative on a circular economy for plastics, which proposes to eliminate waste and innovate circularity of plastics (Ellen MacArthur Foundation, 2023). A further example is the various extended producer responsibility (EPR) schemes, which can promote product design for circularity, the collection of end-of-life products and circular recycling to high-value materials that promotes the use of eco-modulated fees that favour recyclable (and sustainable) products. The renewable material pathway The renewable material pathway for plastics focuses on promoting renewable feedstock-based solutions, such as biobased plastics, which support the decoupling from fossil-based feedstocks. This pathway focuses on the beginning of the value chain, on feedstock choices and on feedstock supply. Possible benefits of using renewable feedstocks include breaking the dependence of plastic production on fossil fuels, reducing greenhouse gas emissions and, if the feedstocks are locally and sustainably sourced, increasing rural development and also possibly reducing dependence on imported feedstocks. Biobased plastics are made from renewable materials, in contrast to conventional plastic, which is usually made from fossil-based resources (oil and gas). It is important to ensure that resource use is reduced in the first place, and that the materials of all feedstocks, including biobased feedstocks, are kept in the circular economy loop for as long as possible. This means that secondary raw materials, e.g. biowaste and by-products like used cooking oil, are preferred to primary raw materials, e.g. sugarcane and wood. Box 1. Biobased plastic is not always biodegradable In general, ‘biobased’ refers to the origin of materials and ‘biodegradable’ refers to the potential behaviour of those materials under controlled circumstances at product end of life. Thus, whether a type of plastic is biodegradable or not depends in large part on its composition and not on the source of the materials used in its production. This means that biobased plastics are not necessarily biodegradable. Non-degradable biobased plastics are conventional plastic types produced with renewable biobased materials. This type of plastic can be recycled in the same way as and mixed with plastics from fossil fuel sources. Biodegradable plastics are designed to degrade in specific mediums under specific conditions, meaning that they do not necessarily degrade in the open environment. Often, biodegradable plastics cannot be recycled together with non-biodegradable plastics. More information can be found in the EEA’s briefing ‘Biodegradable and compostable plastics — challenges and opportunities’ and in the European Commission’s communication on biobased, biodegradable and compostable plastics. Biodegradable plastics are recommended for only very specific uses in the European Commission’s communication on biobased, biodegradable and compostable plastics and should not be seen as a solution to inappropriate waste management and littering (EC, 2022). Figure 4 illustrates good practice examples for the renewable material pathway, which involves plastics production, use and waste. Businesses and policymakers are key to implementing the approaches taken in these good practice examples to achieve the goals of the pathway. Figure 4. The renewable material for plastics pathway Note: The life cycle steps highlighted in blue are the ones most relevant for the renewable material pathway, but are not necessarily the only ones that can be found. Source: Developed by the EEA and the European Topic Centre on Circular Economy and Resource Use (ETC\/CE) — illustration by the Collaborating Centre on Sustainable Consumption and Production (CSCP) and the EEA. Good practice examples for the renewable material pathway are often seen to be related to the emerging production methods, including the development and uptake of biobased feedstocks, and new initiatives from policymakers against greenwashing, including to improve product specifications of biobased plastics. The examples are presented below. Emerging production methods Biobased plastics have the potential to reduce CO 2 emissions if they are produced responsibly and recycled rather than incinerated (ETC WMGE, 2021). The feedstocks for biobased plastics are often divided into first, second and sometimes third generation (EC, 2012). First-generation feedstocks are suitable for food and feed applications and include corn and sugarcane. Second- and third-generation feedstocks are not suitable for food or feed and include non-food crops such as cellulose and algae, by-products of food and feed production such as corn stover and waste streams such as biowaste (ETC\/CE, 2023). Second- and third-generation feedstocks are preferable, as they do not compete with food and feed production. The commercial availability of biobased plastic products is still limited, but such products include packaging, textiles and films. New initiatives against greenwashing Greenwashing is a growing problem in the transition to a circular economy. Generic claims that products include ‘bioplastics’ or ‘biobased plastics’ are often made without any specifications of amounts or sources. These claims can mislead consumers and create confusion in the market. One example of an initiative to counter this trend is a forthcoming proposal from the European Commission to limit unsubstantiated green claims and for companies to refer to only exact and measurable shares of biobased plastic content in products (EC, 2022). How to scale up good practice examples for the pathways towards a to sustainable and circular plastics system Businesses have an opportunity to influence and contribute to the development and implementation of the smarter use pathway, the increased circularity pathway and the renewable material pathway. There is high potential for investing in and scaling up circular business models. To upscale the circular ways of doing business, technical and social innovations and collaboration are needed (EEA, 2021). Businesses play a crucial role in the whole life cycle of plastics and in making this life cycle more sustainable and circular. Policymakers can affect the speed of development of the smarter use pathway, the increased circularity pathway and the renewable material pathway by providing timely and proper policy frameworks and clarity. EU policy makers can continuously develop and ensure the implementation of policies that increase the circularity and sustainability of plastics production and consumption. The UN global treaty on plastics currently being developed will hopefully contribute to making plastics more sustainable and circular globally. Citizens can play a role in the smarter use pathway and the increased circularity pathway. They can contribute by demanding more sustainable and circular products and by being willing to engage with new, circular business models. Citizens can also contribute by changing the way they use plastics by reducing unnecessary consumption and dispose of plastics including sorting and returning products and by using longer-lasting plastic products. The examples presented in this briefing are intended to inspire business, policymakers and citizens to participate and collaborate in making plastics more circular and sustainable, thereby better protecting the environment and climate from the detrimental effects of plastics production, consumption and waste management.","filter_flag":1}
{"title":"What is zero waste? - World Economic Forum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyL3plcm8td2FzdGUtZ3VpZGUtcmV1c2UtaXRlbXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyL3plcm8td2FzdGUtZ3VpZGUtcmV1c2UtaXRlbXMv0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyL3plcm8td2FzdGUtZ3VpZGUtcmV1c2UtaXRlbXMv0gEA","guidislink":false,"published":"Mon, 13 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=44, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyL3plcm8td2FzdGUtZ3VpZGUtcmV1c2UtaXRlbXMv0gEA?oc=5\" target=\"_blank\">What is zero waste?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What is zero waste? - World Economic Forum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyL3plcm8td2FzdGUtZ3VpZGUtcmV1c2UtaXRlbXMv0gEA?oc=5\" target=\"_blank\">What is zero waste?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","source.href":"https:\/\/www.weforum.org","source.title":"World Economic Forum","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Zero waste is the principle of minimizing waste production as much as possible, then composting, reusing, or recycling any other waste generated. Repairing and reusing your items can help save money, generate more jobs, and save the Earth's resources by minimizing greenhouse gas emissions. Zero waste practices can create many positive benefits - like improving community relations, boosting local economies, and saving energy and water. Quick Key Facts Zero waste dates back to the 1970s when the term was coined by chemist Paul Palmer. Today, zero waste includes the 5 Rs: refuse, reduce, reuse, recycle and rot. A zero-waste approach can reduce waste management emissions by 84%. About 146 million tons of waste end up in landfills in the U.S. alone each year. Food is the largest component of landfilled waste, about 24%. The U.S. food system requires 10.11 quadrillion British thermal units (Btu) of energy. Clothing production requires 79 billion cubic meters of water per year. Global e-waste reached 53.6 million metric tons from 2010 to 2019. Recycling produces about nine times more jobs than landfill disposal. Composting produces about double the amount of jobs that landfill disposal requires. What is Zero Waste? You’ve likely heard the old adage, “reduce, reuse, recycle.” While this has been a cornerstone of sustainability, with many kids hearing this golden rule over the years and repeating these steps well into adulthood, there’s a more updated framework that can help consumers strive for zero-waste lifestyles. Zero-waste refers to principles of minimizing waste production as much as possible. Béa Johnson of Zero Waste Home calls the framework for zero-waste the 5 Rs: refuse, reduce, reuse, recycle, and rot. In reality, before the rise of plastic production in the mid-20th century, many people naturally followed a zero-waste approach to waste management. But human dependence on plastic, a material that doesn’t easily or quickly break down, has left us with landfills and oceans full of trash. The idea of zero-waste is to produce as little waste as possible, to begin with. Then, with any waste that is generated, compost, reuse, or recycle whatever is left. How the Zero Waste Movement Started Throughout history, zero-waste living was the norm. Rewearing your clothing, preserving food or eating all of the food you purchased, hunted, gathered, or grew, repairing tools and furniture, and reusing items as much as possible were typical for many people. But as plastic use increased in the 1960s, humans began quickly generating massive amounts of trash. A rise of “throwaway” culture took hold, where people found convenience in tossing out plastic dining ware or food packaging. This approach has extended to many types of products. Phone breaks? Toss it and buy the latest model. Favorite T-shirt rips down the side? Toss it out and buy a replica. Food waste on your plate? Dump it in the trash, rather than fussing with a smelly compost pile. But all of this waste and consumption has major impacts on the environment and climate change. Waste ends up in landfills, polluting cities, and ecosystems, or floating in garbage patches in the oceans. More resources are required and more emissions are emitted as humans source materials and make more and more goods for people to buy. The concept of zero-waste was first coined in the 1970s by Paul Palmer, a chemist and Yale graduate and founder of the Zero Waste Institute. Palmer had noticed that chemicals discarded by emerging tech companies in Silicon Valley were reusable, and he founded a company to find new uses for these waste chemicals. Similarly, in 1995, Daniel Knapp, a sociologist and founder of Urban Ore in Berkeley, California, toured Australia giving talks on minimizing waste. This was after he had spent several years in the U.S. discussing a concept called Total Recycling, which was later used to define zero-waste planning approaches for cities around the country. This idea from Knapp led the Australian Capital Territory (ACT) government to create a “No Waste by 2010” campaign. In 2000, the larger zero-waste movement began to take place, as evidenced by a conference on the subject: Zero Waste Conference, which was held at the Kaitaia Community Centre in Kaitaia, New Zealand. From there, more environmental organizations took up the concept of zero waste, and an international Zero Waste International Alliance (ZWIA) was formed in Beaumaris, Wales in 2003. Reasons to Go Zero Waste In 2000, the larger zero-waste movement began to take place. Image: Unsplash\/Ello Repairing and reusing your items, recycling, composting and refusing excess items you don’t need, all have many benefits. These actions can save individuals money and even generate more jobs for local economies compared to conventional disposal, while also saving Earth’s resources, minimizing greenhouse gas emissions, and improving relationships within communities. Reduce Climate Impact Focusing on a zero-waste approach can reduce total emissions of the waste management sector by about 84%, according to a report by the Global Alliance for Incinerator Alternatives (GAIA). This is a reduction of about 1.4 billion metric tons of emissions, equivalent to the impact of taking all motor vehicles in the U.S. off of roads for one year. The same report also found that composting specifically can make a big impact on methane, which is significantly more potent than carbon dioxide. Source-separated collection and treatment of organic waste along with mechanical recovery and biological treatments of residual waste and biologically active landfill cover can reduce methane emissions by 95% on average, the report found. Improve Community Relations From connecting to the farmers that grow your food to redistributing excess goods throughout a community, zero-waste living can strengthen relations and social equity within communities. For instance, the growing number of people joining localized groups like Buy Nothing can borrow and swap items, rather than going out to buy new. Organizations can accept donated items like furniture and clothing and provide these items to people in need. Groups can take in surplus food to redistribute to those who need it, and communities can work together to build gardens and compost extra food to fertilize those gardens, growing food to share with one another. People can support local economies by spending their money at local refill shops, where they can purchase food and household items by filling their own containers, rather than buying more products in plastic packaging at conventional grocery stores. Encourage Sustainable Businesses In addition to supporting local refill shops, people who are spending less money on single-use items or conventional consumer goods to focus on reducing, reusing, and repairing instead can help encourage even large corporations to work toward more sustainable operations. For example, some brands like Cascade, Pantene, Clorox and Gillette have partnered with Loop, a reuse platform, that manufactures products in reusable and refillable packaging. While these companies still make products in single-use packaging, offering more refillable options in select markets is a step in the right direction. Reduce Landfill Trash As of 2018, the EPA reported that municipal solid waste totaled 292.4 million tons in the U.S. alone, nearly 5 pounds of waste per person. While some of that waste was composted or recycled, about half of it (146 million tons) was sent to landfills. Yet much of what goes to landfill could be diverted. Food makes up the largest portion of landfilled waste, followed by plastic, then paper, and finally textiles, rubber and leather. The EPA noted that landfill disposal should be the lowest priority, and it is with a zero-waste approach. Instead of sending food to landfills, where it can’t decompose organically and will emit methane, food waste could be composted. Textiles could be repaired or reused rather than sent to landfills. Reduce Food Waste Because food waste generates harmful methane emissions in landfills, consumers who focus on zero waste can reduce their food waste at the source by meal planning and buying only what they need. Extra food can be donated, while food scraps like lemon peels or onion skins can be repurposed (like for homemade cleaners or vegetable broth), or composted. Save Energy and Water Producing more food or manufacturing more tech or clothing to meet demand in a throwaway culture requires extensive amounts of energy and water. In the U.S., the food system — from agriculture to transit to handling — requires 10.11 quadrillion British thermal units (Btu) of energy. Agriculture alone makes up 80% of all water use in the U.S., and animal products require the most amount of water. Wasting food means the energy and water that goes into growing, producing, transporting, stocking and selling that food is wasted. It takes about 3,000 gallons of water to produce just one cotton T-shirt, and the fashion industry uses about 79 billion cubic meters of water to make clothing per year. Making repairs to old shirts or reusing fabric from clothing can reduce demand for new clothing and ultimately save the water needed to produce more clothing items. Then, there’s tech, which requires extensive amounts of energy to mine for materials and manufacture the devices. Despite all of the resources and energy that go into tech, many devices are simply disposed of when the latest version of a device is unveiled to consumers. As of 2019, e-waste generated globally reached 53.6 million metric tons. But consumers can save energy, water, and other precious resources by using tech for longer and reusing or recycling electronics properly when they are no longer useful. Boost the Economy Palmer’s concept of zero-waste in the 1970s didn’t come about as a way to save the environment. Instead, it was more economically motivated, a way to make money on useful chemicals that were being wasted. Recycling can produce about nine times more jobs than disposal does, according to Tellus Institute with Sound Resource Management. The Institute for Self-Reliance reported that composting requires about double the amount of jobs as disposing to landfills and about four times more jobs than incinerating. Pros and Cons of Zero Waste Recycling and composting create more jobs for local economies. Image: Unsplash\/Globelet Reusable With so many benefits to going zero-waste, it can seem like an easy decision. So why aren’t more people, businesses, and governments focused on zero-waste approaches to waste management? While there are many pros, there are some drawbacks that have limited widespread adaptability. Pros There are several pros to zero waste for individuals and larger communities: Long-term financial savings: Once you have an arsenal of containers and other reusable items, you’ll save money over buying items in single-use packaging. Job creation: Recycling and composting create more jobs for local economies than disposal or incineration. Minimal pollution: A major benefit to zero-waste living is that less pollution flows into landfills and the environment, keeping our planet clean and safe for other organisms. Climate: By reducing waste in many sectors, like food, clothing, and tech, we can reduce the emissions required to make these items as well as the emissions from waste in landfills or incinerators. Reducing emissions can help curb climate change over time. Cons Zero waste isn’t as convenient as tossing out items once you’re done with them, and it also isn’t an attainable lifestyle in communities where food, money and other resources may already be scarce. Some of the drawbacks of zero-waste living are: Short-term financial costs: If you don’t already, you’ll need to create your own zero-waste kit of reusable bags, straws, utensils, containers and other items to cut back your consumption of packaging. On a larger scale, businesses and governments may need to invest in new methods and infrastructure to reduce their own waste and switch to reusable or refillable alternatives. Less convenience: The dependence on single-use items is all about convenience. It’s not always convenient to keep reusable utensils on hand or repair a worn-out pair of pants. Accessibility: Many communities do not have access to a refill shop or even fresh produce, and zero-waste living isn’t easy, affordable or even available for many people. With the short-term, higher upfront costs of zero-waste lifestyles, it can be challenging or simply improbably to get started. Zero Waste Inspiration Zero waste is becoming more mainstream. Image: REUTERS\/Nyancho NwaNri Zero waste is becoming more mainstream, with influential figures, companies and even governments taking more initiative to reduce waste and change the way we consume and dispose of items. For example, Queens in New York City recently started the first borough-wide curbside composting program, making composting more convenient and accessible even for residents of a big city. Other cities, like San Francisco and Portland, Oregon, also have composting programs, and California and Vermont even have statewide composting requirements. Hawaii’s first zero-waste to-go container program has helped local restaurants provide reusable food containers. Image: Unsplash\/Sandra Harris In Maui, Hawaii’s first zero-waste to-go container program has helped local restaurants provide reusable food containers rather than single-use trays and containers that are often sent to landfills or end up in the ocean. Many U.S. states and countries around the world, including Canada, India, Chile and China, are enacting bans on single-use plastics, notably plastic bags, straws, and polystyrene (often known by the brand name Styrofoam) to reduce the amount of this waste sent to landfills. People trying to reduce waste sent to landfill. Image: Unsplash\/ Globelet Reusable As for electronic waste, the European Union has taken action to help individuals repair their own tech devices while also fighting against planned obsolescence, in which electronics are planned to only work for a limited amount of time to encourage purchasing newer models and therefore promoting a throwaway culture. How to Go Zero Waste There are many ways to start down the path of a zero-waste lifestyle. While recycling old papers or composting food scraps are a good start, there are many actions you can take collectively to reduce your impact and inspire governments and businesses to create policies around and invest in a circular, more sustainable economy. Reduce and Refuse Rather than trying to correct overconsumption through recycling and composting, we should start by focusing on consuming less. Reducing the amounts of goods we consume, and waste, is a critical step in zero waste. When it comes to refusing, you can practice saying “no” to any unnecessary items, like plastic utensils with your take-out food or free plastic pens from the bank. Avoid Buying Single-Use Items Single-use items are designed for convenience, but they also amount to a lot of waste. Unless you need single-use items, avoid buying or using them as much as possible. That might look like bringing a reusable travel mug to your favorite coffee shop or packing reusable utensils in your bag. Repair Items Instead of throwing out your favorite sweater when it snags or tossing out a broken necklace, show your possessions a little TLC by taking the time to repair them. Many repairs may be simple and less time-consuming than you think. Of course, if you aren’t sure how to repair your items or don’t have the time to do so, you can support local repair shops or ask skilled friends and family for help. Borrow and Thrift In alignment with reusing, reducing, and refusing, borrowing and thrifting items you want or need is a smart and often fun way to work toward zero waste. Looking for a kitchen gadget, some home improvement tools, wall art, or books? You can ask friends, family, and neighbors for things you need, whether to keep or to borrow. If you can’t find what you’re looking for, you can also thrift second-hand items rather than purchasing new ones. Compost Organic Waste Because of the methane food releases when compacted with other waste in a landfill, composting your organic waste, like food scraps or grass clippings, is a helpful way to reduce emissions and landfill waste. You can compost in your own backyard, either keeping the compost for your own gardens, sharing it with neighbors, or giving back to your community. If you don’t have a garden or outdoor space, you can also check with your city to find a composting center or places that accept compost. Recycle Many people are familiar with recycling, and if you don’t already, you should start. Set up a small bin or multiple bins in your home to organize and hold recycling, then drop it off in your property’s blue bin or to a place in your community that collects recycling. While recycling is an important component to zero-waste living, the focus should first be on reducing consumption, reusing items you already own, and repairing broken items first. Recycling is a second-to-last resort before sending anything to a landfill. Shop Less While shopping less is often easier said than done, it’s a goal that is worth at least working toward. According to a Slickdeals survey, the average person spends $314 per month on impulse purchases as of 2022, an increase of 14% from the previous year. Not only is that a lot of money lost, but it also means a lot of purchases for unnecessary items. One way to avoid impulse purchases is to shop less. Feeling bored? Try going for a walk, calling up a friend, or practicing your hobbies, rather than heading to the mall. When you do need to shop, make a list and stick to it, while also adhering to other zero-waste principles, like reducing your consumption and skipping single-use items. You can also try borrowing or thrifting items you need rather than going to buy something brand new. Takeaway While companies and governments need to take more substantial efforts to curb waste and ultimately minimize the impacts of climate change, individuals can help minimize their own emissions and waste and encourage change by embracing a zero-waste lifestyle. The focus should be on progress, not perfection since many individuals making small changes can add up to larger impacts. By reducing excess, reusing and repairing items, and participating in a circular economy, individuals can also reduce demand for new products and single-use items, instead showing companies that reusables are a better investment. Zero waste can seem daunting, but simply being more mindful about purchases and taking care of the things you already own is a great start, and the impacts will only grow the more you practice. Some companies and governments are already taking individual actions and demands into account, changing their products, packaging and policies to be more sustainable moving forward. By adopting more zero-waste-friendly practices, the positive changes are sure to continue and grow in the future. Loading... Discover What is the World Economic Forum doing about plastic pollution? Show more More than 90% of plastic is never recycled, and a whopping 8 million metric tons of plastic waste are dumped into the oceans annually. At this rate, there will be more plastic than fish in the world’s oceans by 2050. The Global Plastic Action Partnership (GPAP) is a collaboration between businesses, international donors, national and local governments, community groups and world-class experts seeking meaningful actions to beat plastic pollution. Loading... In Ghana, for example, GPAP is working with technology giant SAP to create a group of more than 2,000 waste pickers and measuring the quantities and types of plastic that they collect. This data is then analysed alongside the prices that are paid throughout the value chain by buyers in Ghana and internationally. It aims to show how businesses, communities and governments can redesign the global “take-make-dispose” economy as a circular one in which products and materials are redesigned, recovered and reused to reduce environmental impacts. Read more about our impact. ","filter_flag":1}
{"title":"How startups can usher in the circular economy - Sifted","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N0YXJ0dXBzLXNjYWxldXBzLWNpcmN1bGFyLWVjb25vbXktYnJuZNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N0YXJ0dXBzLXNjYWxldXBzLWNpcmN1bGFyLWVjb25vbXktYnJuZNIBAA?oc=5","id":"CBMiQmh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N0YXJ0dXBzLXNjYWxldXBzLWNpcmN1bGFyLWVjb25vbXktYnJuZNIBAA","guidislink":false,"published":"Tue, 21 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N0YXJ0dXBzLXNjYWxldXBzLWNpcmN1bGFyLWVjb25vbXktYnJuZNIBAA?oc=5\" target=\"_blank\">How startups can usher in the circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sifted<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How startups can usher in the circular economy - Sifted","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N0YXJ0dXBzLXNjYWxldXBzLWNpcmN1bGFyLWVjb25vbXktYnJuZNIBAA?oc=5\" target=\"_blank\">How startups can usher in the circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sifted<\/font>","source.href":"https:\/\/sifted.eu","source.title":"Sifted","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The circular economy — a model of production and consumption that prioritises reusing, recycling and sharing products rather than disposing them — could provide a meaningful intervention in the climate crisis. A report by the think tank Circle Economy estimates wider adoption of the principle could reduce greenhouse gas emissions by 39%. However, knowledge of the circular economy is lacking — a survey by YoungPlanet found that nine in ten adults in the UK haven’t heard of the concept. “It’s hard to pinpoint what it is,” says Rachel McCausland, CEO of Lowe Rental, a refrigeration unit rental business based in Northern Ireland. “But the circular economy has the potential to revolutionise how we think and why we buy and I think that it's going to become more and more prevalent in day-to-day life, personally and professionally.” Advertisement What does this have to do with startups? Here’s what you need to know — and how startups could catalyse much needed change. Circular from the start Startups have the opportunity to build businesses based around the circular economy from the start of their lifecycle. Startups have the ability to build their businesses from scratch, truly disrupt the status quo and educate both consumers and businesses, in the process “Startups play a crucial role in helping the economy transition to the circular economy, because they don’t have the red tape or consumer expectations big tech does,” says Thibaud Hug De Larauze, cofounder and CEO of scaleup Back Market. “They have the ability to build their businesses from scratch, truly disrupt the status quo, and educate both consumers and businesses in the process.” Back Market, founded in 2014, says it’s now the globe’s biggest online marketplace for refurbished devices and appliances, with over 6m users and over €1bn raised. According to figures cited by De Larauze, as much as 70% of existing toxic waste is due to disposed electronics, while only 12.5% is recycled. De Larauze says big tech is always looking for the new — offering expensive products that they want consumers to purchase on a yearly, or biennial basis. That creates two problems for customers: affordability and impact on the environment. “Refurbished technology can solve both of these problems. Not only are renewed devices much more affordable, they are key to creating a circular economy and drastically reducing the impact of technology on the environment,” says De Laurauze. This impact of technology and electronic devices can also be mitigated by renting equipment rather than purchasing it. This is particularly useful for smaller businesses and startups that may not know what equipment they need as they begin their journey. Try before you buy Lowe has been leasing large refrigeration units to clients for the past forty years. Primarily helping food and drink businesses display their products at trade events and exhibitions, they also provide longer term contract solutions for clients. If a customer comes to us with a budget and they want a certain specification, we feel it's our responsibility to put options on the table that use less energy McCausland says their role within the circular economy is a “natural byproduct” of their offering to customers, but that businesses now have a role in educating their clients and customers about its role in building a sustainable future. Advertisement “We always provide options,” she says. “If a customer comes to us with a budget and they want a certain specification, we feel it's our responsibility to put options on the table that use less energy.” Lowe works with a number of early-stage businesses. They offer a scheme called “Try It, Buy It” — which McCausland says is popular with startups — where customers can lease equipment on a one or two-year basis, before purchasing the equipment should they need it. “It gives startups that flexibility to understand whether that product is going to add value to their organisation,” says McCausland. “It fits in with the circular economy as well. By acquiring equipment that has a proven track record and has been used before, they can be more sustainable.” What about waste? Even with these initiatives, there will always be some waste generated by personal and business consumption. Lowe has a stringent wastage policy in place, supporting clients in ensuring that any product that has to be replaced will be recycled if possible, and that any polluting chemicals such as refrigerants will be disposed of properly. Two billion people around the world are not connected to an effective waste management system However, there is also an opportunity here for startups to offer an alternative waste management system. “Waste management is broken,” says Nicola Stones, vice president of marketing at Cleanhub, a Berlin based startup which helps clients dispose of their plastic waste. “2bn people around the world are not connected to an effective waste management system,” she adds. “And the legacy waste management systems in most developed countries lack the data capture and transparency needed to support acceleration to a more circular economy.” Cleanhub’s goal is to create a “circular economy for plastics”. Their credit-based system calculates how much plastic waste a brand may create, and then helps them invest into disposal schemes of non-recyclable plastic waste in high polluting areas. Stones says it has already saved 2k tonnes of waste from being improperly disposed of since 2020. But, according to Stones, “there isn’t a silver bullet”, when it comes to plastic packaging. Brands want to do more, but can’t simply quit plastic overnight. “We need packaging alternatives, but we also need effective waste management. Funding waste management in areas of high plastic leakage is an immediate action that brands can take to start having a positive impact on the problem,” says Stones. “Startups can play a huge role,” she continues. “It is much easier to implement the circular economy model from scratch than to transition existing systems. All new products should be designed and sold with a clear plan for how the materials would later be collected, recycled, and used for something else.”","filter_flag":1}
{"title":"Product Returns, Reverse Logistics, and a Circular Economy - Esri","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA","guidislink":false,"published":"Tue, 07 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=38, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5\" target=\"_blank\">Product Returns, Reverse Logistics, and a Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Esri<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Product Returns, Reverse Logistics, and a Circular Economy - Esri","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmVzcmkuY29tL2Fib3V0L25ld3Nyb29tL3B1YmxpY2F0aW9ucy93aGVyZW5leHQvcHJvZHVjdC1yZXR1cm5zLXByb2xpZmVyYXRlL9IBAA?oc=5\" target=\"_blank\">Product Returns, Reverse Logistics, and a Circular Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Esri<\/font>","source.href":"https:\/\/www.esri.com","source.title":"Esri","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The path from raw material to finished good to a customer’s home is carefully choreographed. Less so? What happens when that ill-fitting pair of pants or unwanted gadget ends up in the return pile. What some companies are discovering, however, is that the location intelligence they rely on to deliver products to customers efficiently can be equally helpful when goods move in reverse—an increasingly common occurrence. Article snapshot: The “buy now, return later” mantra of today’s consumer is causing a glut of product returns—and a lot of opportunities for a more circular economy. As consumer spending has grown, so too have product returns, more than doubling between 2019 and 2022 to an estimated $816 billion annually, according to the National Retail Federation and Appriss Retail. While returns can be a convenience for consumers, they’re less convenient for company balance sheets and the planet. Some returns can be resold in stores, off-loaded to discount resellers, or donated to charity, but the rest often end up in incinerators or landfills, according to a recent Wall Street Journal op-ed by a pair of University of Tennessee logistics experts. That creates about 6 billion pounds of landfill waste and 16 million metric tons of carbon dioxide, the authors said, citing a study by returns-management company Optoro. Frustrated by the financial losses and environmental degradation created by returns, some companies are eyeing a circular economy approach—one that connects them with interested buyers or manufacturers that can create something new from what’s been returned. Connecting Product Returns with Sources of Demand One challenge of reverse logistics is that there’s far less predictability about where returns will go than there is in a typical supply chain. What can make the process clearer is a smart map that reveals the location of products and their potential destinations. For goods that will end up back on store shelves, GIS technology can capture real-time location information from inventory management systems, indicating which stores in the retail network need certain products. For returned goods that can’t be sold in store, a smart map can show facilities that take donations or resell returns. Then there’s the opportunity to convert returns into new products through upcycling. At a time when supply chain disruptions have left companies scrambling for key components, materials can be harvested and used to make repurposed furniture, apparel, and other goods. That circular economy practice aims to lengthen a product’s useful life, reduce waste, and preserve—even revive—natural systems. As noted in a recent WhereNext article: From an environmental perspective, the consequences [of disposal] are increasingly significant, impacting air, water, and soil resources that underpin the economy. For business executives, trashing products that could be repurposed and resold violates a basic tenet of profitability: never leave value on the table—or in this case, at the dump. One company is using GIS technology to manage the circular economy for plastics. By assigning plastic products a unique digital identifier, the company can use a smart map to trace each batch from the point of collection to the recycling facility and beyond. Such transparency helps manufacturers validate net-zero achievements while giving consumers confidence that their purchases are supporting the circular economy. Pinpointing Supply Chain Links in Proximity Once a company identifies organizations interested in buying returns, planners can use location intelligence to better route the products. GIS software identifies logistics routes that minimize miles traveled and carbon emissions, whether by ship, train, truck, or plane. GIS specializes in complex analysis and coordination, helping companies like FedEx orchestrate the movement of spare parts to keep its planes airworthy and minimize waste in the system. Establishing the links that turn product returns into circular opportunities is inherently a geographic pursuit. Ultimately, this geography of reverse logistics can help build a circular economy, increasing both sustainability and profitability. Photo by Sigmund","filter_flag":1}
{"title":"Automakers move to adopt a circular economy - Economist Intelligence Unit","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA","guidislink":false,"published":"Fri, 17 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=48, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5\" target=\"_blank\">Automakers move to adopt a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Intelligence Unit<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Automakers move to adopt a circular economy - Economist Intelligence Unit","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5\" target=\"_blank\">Automakers move to adopt a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Intelligence Unit<\/font>","source.href":"https:\/\/www.eiu.com","source.title":"Economist Intelligence Unit","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Automakers move to adopt a circular economy Fri, 17th Feb 2023 Several automakers, including Renault (France), Stellantis (Netherlands) and Volkswagen (Germany), are trying to develop circularity in vehicle production, allowing them to reuse materials and resources to reduce waste. Despite these moves, circularity in the automotive industry remains low at present as most automakers lack a defined process to recycle materials. The European Commission is currently reviewing its targets for end-of-life vehicles (ELVs) and is aiming to submit its proposal in 2023. However, a successful move to circularity will depend not only on regulations but also on automakers’ ability to make recycling profitable. The circular economy was one of the agenda items of the recent United Nations Climate Change Conference (COP27), which took place in November. However, aside from some small-scale funding for circular economy-related projects in Spain, nothing constructive was concluded at the climate conference. For an automotive industry burdened by high costs, this represents a wasted opportunity. While reducing waste is the central aim of a circular economy, it would also allow companies to cut costs, reduce the uncertainty associated with securing raw materials and comply with emissions regulations. Eventually, recycling should become profit-making. Shifting to a circular value chain This is not yet happening, with most recycling efforts driven largely by regulation. European automakers are already required to adhere to the European Commission’s directive on ELVs, which sets targets for the recyclability, reusability and recoverability of motor vehicles and their components. The current directive requires a minimum of 85% reuse and recycling and a minimum of 95% reuse and recoverability for light vehicles. The Commission is reviewing the directive and is expected to present a proposal on it in 2023. Japan and South Korea have had similar vehicle recycling laws for more than 15 years now. Meanwhile, India also launched a similar framework for scrapping ELVs in August 2021. In the US, there is no federal law for ELVs, but several state governments have legislation and requirements for vehicle recycling. Pressure groups want this legislation to go further, pushing the automotive industry away from an “open-loop” recycling policy (which allows materials to be turned into other products) towards a “closed-loop” policy (whereby materials are turned into a new version of the original product). They argue that closed-loop recycling processes and life cycle optimisation will be required to attain full circularity in automotive production. It would also reduce uncertainties related to procuring raw materials and help to control costs. Renault spins off its circular economy business Automakers are taking voluntary steps in this direction. In November, Renault announced that it will split its business into five units focused on electric vehicles (EVs) and software, low-emission fossil-fuel vehicles, motor racing, financial services and the circular economy. The last of these, called “The Future is NEUTRAL”, aims to achieve closed-loop circularity across the vehicle life-cycle, starting from procuring raw materials, production, and use to scrapping. It aims to become carbon negative in automotive production by 2030. Currently, only about 30% of vehicle materials are recycled for new vehicles – mainly through metal scrapping and battery repairs for ELV, but Renault claims that about 85% could be. Renault has three subsidiaries – Gaia, Indra and Boone Comenor – which form part of its circular economy factory, Refactory, located in Flins, France. The new addition to this factory will be a closed-loop battery recycling plant. In November 2021, the company launched another circular economy factory in Spain with a targeted roll-out between 2022 and 2024. It is also planning to launch similar projects in Turkey, South America and Portugal. Automakers set material recycling targets Stellantis (Netherlands) has also announced plans for the launch of its circular economy business unit to become carbon neutral by 2038. The company is aiming to generate about €2bn in revenue from the unit and will launch a “Circular Economy Hub” in Italy in 2023. In September, the company unveiled its concept electric vehicle, Citroën oli, made from recycled material and with end-of-life recyclability. Meanwhile, Volkswagen is aiming to set clear targets and indicators as part of its circular economy strategy, according to its 2021 sustainability report. Ford has set an interim target of using 20% recycled and renewable plastics in new vehicle designs by 2025 at its factories in North America and Europe and a 10% target for its factories in China and Turkey. Ford also uses a closed-loop system to manufacture its F-series trucks and is the largest closed-loop aluminium recycling automaker in the world, according to its 2022 sustainability report. The government push will play a key role Despite these initiatives, companies are far from attaining a closed-loop recycling system for their vehicle production. Most of their initiatives are limited to Europe, where both national and regional governments have strict targets. However, to achieve a full shift to circularity carmakers need to be driven not only by regulation but also by the potential to develop more efficient – possibly even profit-making – business models for recycling. The analysis and forecasts featured in this piece can be found in EIU’s Country Analysis service. This integrated solution provides unmatched global insights covering the political and economic outlook for nearly 200 countries, helping organisations identify prospective opportunities and potential risks.","filter_flag":1}
{"title":"Innovating for a circular world - Huhtamaki","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lmh1aHRhbWFraS5jb20vZW4vaGlnaGxpZ2h0cy9zdXN0YWluYWJpbGl0eS9pbm5vdmF0aW5nLWZvci1hLWNpcmN1bGFyLXdvcmxkL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lmh1aHRhbWFraS5jb20vZW4vaGlnaGxpZ2h0cy9zdXN0YWluYWJpbGl0eS9pbm5vdmF0aW5nLWZvci1hLWNpcmN1bGFyLXdvcmxkL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3Lmh1aHRhbWFraS5jb20vZW4vaGlnaGxpZ2h0cy9zdXN0YWluYWJpbGl0eS9pbm5vdmF0aW5nLWZvci1hLWNpcmN1bGFyLXdvcmxkL9IBAA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lmh1aHRhbWFraS5jb20vZW4vaGlnaGxpZ2h0cy9zdXN0YWluYWJpbGl0eS9pbm5vdmF0aW5nLWZvci1hLWNpcmN1bGFyLXdvcmxkL9IBAA?oc=5\" target=\"_blank\">Innovating for a circular world<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huhtamaki<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Innovating for a circular world - Huhtamaki","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lmh1aHRhbWFraS5jb20vZW4vaGlnaGxpZ2h0cy9zdXN0YWluYWJpbGl0eS9pbm5vdmF0aW5nLWZvci1hLWNpcmN1bGFyLXdvcmxkL9IBAA?oc=5\" target=\"_blank\">Innovating for a circular world<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Huhtamaki<\/font>","source.href":"https:\/\/www.huhtamaki.com","source.title":"Huhtamaki","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"“2022 witnessed many successful Huhtamaki game changing innovations. In addition to developing new products that are fit for recycling we also stepped up our support for circular economy infrastructures through key initiatives. We believe innovation is the key to unlocking sustainability and that the circular economy calls for collaboration between all stakeholders. We must engage with industry, consumers, governments and other stakeholders to deliver on circularity ”, says Thomasine Kamerling, EVP Sustainability and Communications. At Huhtamaki we are focused on redesigning the future of sustainable packaging solutions. Find out how we are making a difference where it matters with some of our circular innovation highlights from the past year. Nespresso home compostable paper-based coffee capsule In November 2022, we launched the home compostable paper-based coffee capsule in collaboration with Nespresso. This transformative innovation will serve millions of coffee enthusiasts looking for a sustainable alternative to be composted at home. Our proprietary high-precision technology, which enables wood fibers to be molded into intricate shapes is a paradigm shift in how we can use renewable fiber in complex food packaging in the future. Read more about our fiber solutions here. Push Tab® blister lid - 100% mono-PET blister packaging solution In flexible packaging, we continued our journey towards recyclable, mono-material solutions. The launch of our 100% mono-PET blister packaging solution was another game-changing innovation, allowing us to offer the same healthcare grade capability with zero aluminum. The innovation was made together with Klöckner Pentaplast. The Push Tab® blister lid solution was awarded first place in the German Packaging Award 2022 and in the prestigious WorldStar Awards 2023 for its suitability to be run on existing packaging lines, and of course, for its PVC- and aluminum-free material composition. Read more about our innovation here. Nespresso home compostable paper-based coffee capsule (Official photo by Nespresso), Push Tab® blister lid The Cup Collective – An at-scale solution for recycling paper cups The Cup Collective, an industrial scale initiative founded by Huhtamaki and Stora Enso to capture the value of used paper cups through recycling was launched with its first partners in early December 2022. These include McDonald’s, SSP - The Food Travel Experts, C2 Centre, and the National Railway Company of Belgium (SNCB). The Cup Collective initiative, a first of its kind in Europe, aims to recycle half a billion paper cups in Europe within the first two years. The first paper cup collection bins are now available in public venues throughout Brussels including restaurants and transit hubs. Find out more about the Cup Collective here. The Huhtamaki Foundation Khopoli recycling plant – building recycling infrastructures In 2022, we also saw the inauguration of our first flexible plastic packaging recycling plant in Khopoli, Maharashtra. The plant set up by the Huhtamaki Foundation helps drive circularity across the value chain. The Huhtamaki Foundation worked with the local community and authority in Maharashtra, NGOs, social enterprises, and educational institutes – including Swachh, Stri Mukti Sanghtana, CIPET and ICT – to develop this sustainable waste management system. The plant became operational in May 2022. The Huhtamaki Foundation aims to foster a sustainable culture and close the loop to bring circularity in the packaging value chain. The Cup Collective, Khopoli recycling plant Huhtamaki’s 2022 Annual Report, to be published on March 1, 2023, contains more information on the innovation we have delivered during the past year.","filter_flag":1}
{"title":"Vestas unveils circularity solution to end landfill for turbine blades - Vestas","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA","guidislink":false,"published":"Wed, 08 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=39, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5\" target=\"_blank\">Vestas unveils circularity solution to end landfill for turbine blades<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vestas<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vestas unveils circularity solution to end landfill for turbine blades - Vestas","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnZlc3Rhcy5jb20vZW4vbWVkaWEvY29tcGFueS1uZXdzLzIwMjMvdmVzdGFzLXVudmVpbHMtY2lyY3VsYXJpdHktc29sdXRpb24tdG8tZW5kLWxhbmRmaWxsLWZvci1jMzcxMDgxONIBAA?oc=5\" target=\"_blank\">Vestas unveils circularity solution to end landfill for turbine blades<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vestas<\/font>","source.href":"https:\/\/www.vestas.com","source.title":"Vestas","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Back to news Press Release: 07:33 CET • 08 Feb 2023 Vestas unveils circularity solution to end landfill for turbine blades News release from Vestas Wind Systems A\/S Aarhus, 8 February 2023 Vestas is presenting a new solution that renders epoxy-based turbine blades as circular, without the need for changing the design or composition of blade material. Combining newly discovered chemical technology developed within the CETEC initiative, and partnerships with Olin and Stena Recycling, the solution can be applied to blades currently in operation. Once matured, this will eliminate the need for blade redesign, or landfill disposal of epoxy-based blades when they are decommissioned. “Until now, the wind industry has believed that turbine blade material calls for a new approach to design and manufacture to be either recyclable, or beyond this, circular, at end of life. Going forward, we can now view old epoxy-based blades as a source of raw material. Once this new technology is implemented at scale, legacy blade material currently sitting in landfill, as well as blade material in active windfarms, can be disassembled, and re-used. This signals a new era for the wind industry, and accelerates our journey towards achieving circularity,” says Lisa Ekstrand, Vice President and Head of Sustainability at Vestas. Turbine blades have previously been challenging to recycle due to the chemical properties of epoxy resin, a resilient substance that was believed to be impossible to break down into re-usable components. This has led to many technology leaders attempting to replace or modify epoxy resin with alternatives that can be more easily treated. Vestas’ solution is enabled by a novel chemical process that can chemically break down epoxy resin into virgin-grade materials. The chemical process was developed in collaboration with Aarhus University, Danish Technological Institute, and Olin the partners of the CETEC project, a coalition of industry and academia established to investigate circular technology for turbine blades. “The newly discovered chemical process shows that epoxy-based turbine blades, whether in operation or sitting in landfill, can be turned into a source of raw material to potentially build new turbine blades. As the chemical process relies on widely available chemicals, it is highly compatible for industrialisation, and can therefore be scaled up quickly. This innovation would not have been possible without the ground-breaking CETEC collaboration between industry and academia enabling our progress until this point,” says Mie Elholm Birkbak, Specialist, Innovation & Concepts at Vestas. Through a newly established value chain, supported by Nordic recycling leader Stena Recycling and global epoxy manufacturer Olin, Vestas will now focus on scaling up the novel chemical disassembly process into a commercial solution. Once mature, the solution will signal the beginning of a circular economy for all existing, and future epoxy-based turbine blades. “As the leading customer solution provider of innovative epoxy systems, Olin is proud to support the anticipated massive expansion in wind energy worldwide. By utilising unique technologies, together with our partners, we are ready to recover molecules and convert them into new epoxies that can be re-used in wind turbine blades. We are excited to bring our expertise and unique asset footprint to this partnership, and realize breakthrough sustainable material solutions for existing wind blades and those of the future”, says Verghese Thomas, Vice President, Epoxy Systems and Growth Platforms at Olin. “In the coming years, thousands of turbines will be decommissioned or repowered, representing a major sustainability challenge but also a valuable source of composite materials. As one of Europe’s leading recycling groups with a wide footprint in Europe, we have a central role in the transition to a circular economy. We see this solution as a huge opportunity to take part in making a sustainable solution even more sustainable and circular and are ready to apply our chemical recycling expertise and knowledge to this process”, says Henrik Grand Petersen, MD Stena Recycling Denmark. For several decades, producing wind turbine blades manufactured with epoxy-based resin has been standard practice in the wind industry. In the most mature markets for wind energy, the first turbines are reaching the end of their operational life and this will increase over the coming years. WindEurope expects around 25,000 tonnes of blades to reach the end of their operational life annually by 2025. Once mature, the new solution will provide Vestas with the opportunity to produce new turbine blades made from re-used blade material. In the future, the new solution also signals the possibility to make all epoxy-based composite material a source of raw material for a broader circular economy, potentially encompassing industries beyond wind energy. For more information, please contact: Kristian Holmelund Jakobsen Lead Specialist, Communication and Press Tel: +45 5221 1467 Mail: KRHJA@vestas.com About Vestas Vestas is the energy industry’s global partner on sustainable energy solutions. We design, manufacture, install, and service onshore and offshore wind turbines across the globe, and with more than 160 GW of wind turbines in 88 countries, we have installed more wind power than anyone else. Through our industry-leading smart data capabilities and unparalleled more than 140 GW of wind turbines under service, we use data to interpret, forecast, and exploit wind resources and deliver best-in-class wind power solutions. Together with our customers, Vestas’ more than 28,000 employees are bringing the world sustainable energy solutions to power a bright future. For updated Vestas photographs and videos, please visit our media images page on: https:\/\/www.vestas.com\/en\/media\/images. We invite you to learn more about Vestas by visiting our website at www.vestas.com and following us on our social media channels: About Olin Olin Corporation is a leading vertically-integrated global manufacturer and distributor of chemical products and a leading U.S. manufacturer of ammunition. The chemical products produced include chlorine and caustic soda, vinyls, epoxies, chlorinated organics, bleach, hydrogen, and hydrochloric acid. Winchester's principal manufacturing facilities produce and distribute sporting ammunition, law enforcement ammunition, reloading components, small caliber military ammunition and components, and industrial cartridges. For more information, visit www.olin.com About Stena Recycling Stena Recycling plays an important and central role in the transition to a circular economy by offering services and comprehensive solutions within recycling and efficient resource management. With more than 3000 committed employees and 178 facilities across eight markets, Stena Recycling annually recycles nearly six million tons of waste and end-of-life products from more than 100,000 customers across a range of industries. The recycled raw materials, including ferrous and non-ferrous metals, plastic, and paper, are resold as feedstock for the manufacture of new products. Stena Recycling operates in Sweden, Denmark, Norway, Finland, Poland, Italy, and Germany and the USA. Stena Recycling is part of the Stena Metall Group For more information, visit www.stenarecycling.com About Danish Technological Institute Danish Technological Institute (DTI) is an independent research and development institute. At DTI, we deliver sustainable and exceptional competitiveness through decisive technological knowledge translated into action. With more than 12,000 customers in 65 countries, we develop new knowledge through research and development activities in close corporation with Danish and international companies and research institutes. For more info, visit www.dti.dk or contact project manager Søren Haack at sorh@dti.dk. About Aarhus University Aarhus University is a globally oriented, academically diverse, and research-intensive university. Aarhus University ranks among the top 100 universities in the world on several of the most important international ranking lists, out of over 17,000 universities worldwide. Around 12 per cent of AU’s 40.000 students are international, representing over 120 nationalities. Aarhus University offers state-of-the-art facilities and laboratories having a strong tradition of multidisciplinary research for instance in one of our 42 major research centres. The university’s goal is to contribute towards solving the complex global challenges facing the world. The university therefore strives to combine the high level of academic standards of its researchers with collaboration across disciplinary boundaries to combine research in new ways and solve challenges in close contact with the world around us. For more information please visit: https:\/\/www.au.dk\/ About the CETEC project The CETEC (Circular Economy for Thermosets Epoxy Composites) initiative established in May 2021 by Aarhus University, Danish Technological Institute, Olin, and Vestas, and partly funded by the Innovation Fund Denmark focuses on advancing the adoption of a circular economy across the wind industry. The CETEC initiative is a three-year project that builds on the DreamWind initiative and addresses the lack of available recycling technology for epoxy resins. The project not only aims to increase the blade recyclability but also strives for full circularity by enabling to feed recycled materials of old blades back into the production of new blades.","filter_flag":1}
{"title":"How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using - SupplyChainBrain","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5","id":"CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA","guidislink":false,"published":"Mon, 06 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=37, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5\" target=\"_blank\">How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SupplyChainBrain<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using - SupplyChainBrain","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5zdXBwbHljaGFpbmJyYWluLmNvbS9ibG9ncy8xLXRoaW5rLXRhbmsvcG9zdC8zNjUzNi1ob3ctbWFudWZhY3R1cmluZy1jb21wYW5pZXMtYXJlLXVzaW5nLXJlY3ljbGVkLW1hdGVyaWFscy1pbi10aGVpci1wcm9jZXNzZXMtYW5kLXdoYXQtdGhleXJlLXVzaW5n0gEA?oc=5\" target=\"_blank\">How Manufacturing Companies are Using Recycled Materials In Their Processes and What They're Using<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SupplyChainBrain<\/font>","source.href":"https:\/\/www.supplychainbrain.com","source.title":"SupplyChainBrain","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"An increasing number of manufacturers want to employ recycled materials and make production processes more eco-friendly, which is encouraging. Only a united commitment to source-recycled materials in place of virgin raw materials during production processes will create a stable demand for greener products, and build the planet-saving circular economy we so desperately need. How Manufacturers are Uniting to Build a Circular Economy Since the dawn of the industrial revolution, we have been locked into a linear economy that manufactures, creates waste, discards, and manufactures again. Our goal is to build a circular economy that does not produce waste. Repurposing previously used materials in new products is a key step forward to a circular economy. To build a global circular economy, manufacturers are considering recycled materials as they explore and produce products, instead of simply repurposing their own production waste. When we, as manufacturers, include recycling in both our production and our waste management, we design new products to reflect new methods of recovering components and materials from worn-out products. We close the loop by producing sustainable products, bolstering green markets, and raising awareness among consumers about the benefit of sustainable choices in purchases as well as disposal. How Manufacturing Companies are Introducing Recycled Steel into Their Processes My area of expertise is recycled steel produced with electric arc furnace technology. It happens to be an ideal material for sustainable development and a perfect example of the circular economy we call recycling. This is because steel is infinitely recyclable. Instead of dumping old appliances or automobiles into a landfill, steel products that have reached the end of their lives can go right back into the supply chain to become steel, again and again. Because of its recyclable properties, steel is a material of choice for increasing numbers of end-users, who are turning to recycled steel to help them meet their environmental design goals. Steel made with recycled ferrous scrap as its primary raw material can be used interchangeably with steel made from virgin materials for virtually all applications, such as iron ore and coking coal, for virtually all applications. To help us harvest this scrap steel, our customers recycle a wide variety of products such as end-of-life automobiles, appliances, decommissioned steel bridges and buildings, machinery, electrical and electronic equipment, and packaging. We receive and process scrap steel at numerous metal recycling locations, melt it in electric arc furnaces, and form it into new steel products. This recycled steel is showing up everywhere, serving needs in industries such as agriculture, automotive manufacturing, civil construction, distribution, energy production, and mining. In addition, steel is a crucial element in emission-reduction infrastructure projects such as solar and wind power solutions. We have honed our manufacturing process to incorporate recycled steel at a rate of 98%. Our use of recycled steel also reduces carbon emissions in several ways. Steel production using electric arc furnace technology generates a fraction of the carbon emissions per ton compared to production from virgin materials. During the process, 97% of water is reused, and 99.9% of dust is captured and recycled. In addition, we limit our CO2 emissions by sourcing and shipping scrap metal within a 500-mile radius. Globally, the steel industry must reduce current greenhouse gas emissions by over 50%. With this goal in mind, we are prioritizing greater energy and operational efficiency, increasing our use of scrap, expanding our use of sustainable forestry, employing renewable energy, and investing in new technologies and open innovation. Our mission is to be carbon neutral by 2050. Manufacturers are Moving Toward a Circular Economy As the sustainable development movement continues to grow, the trend toward manufacturers using recycled materials is gaining traction. Mounting pressure from community stakeholders, government officials, shareholders, customers, and employees to source materials responsibly is compelling manufacturers to examine their processes and make eco-friendly changes. In our linear economy, industrial processes are designed around virgin materials. Because of this, using recycled materials often leads to snags in a manufacturer's value chain. However, when we take time to adjust our production processes, we find the value in using recovered materials. Finding this value boosts the widespread drive to recover materials and reduces costs. This is why we must promote up-cycling during the early design process. As manufacturers, adopting recycled materials forces us to face new challenges in maintaining our supply of materials, modifying production processes, maintaining production efficiency, and gauging consumer demand for green products. These barriers are daunting, but they all have solutions. To build a circular economy, we must transform the supply chain, redesign products, and create consumer demand for sustainable products. Though a fully circular economy may be decades in the future, each time a manufacturer introduces waste-derived, recovered, or recycled materials into their products, we take a crucial step forward. Adam Parr is Director of Communications and Public Affairs at Gerdau.","filter_flag":1}
{"title":"Ecobat: Sustainability Is a Growth Opportunity - SAP News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmV3cy5zYXAuY29tLzIwMjMvMDIvZWNvYmF0LXR1cm5zLXN1c3RhaW5hYmlsaXR5LWludG8tZ3Jvd3RoLW9wcG9ydHVuaXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmV3cy5zYXAuY29tLzIwMjMvMDIvZWNvYmF0LXR1cm5zLXN1c3RhaW5hYmlsaXR5LWludG8tZ3Jvd3RoLW9wcG9ydHVuaXR5L9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vbmV3cy5zYXAuY29tLzIwMjMvMDIvZWNvYmF0LXR1cm5zLXN1c3RhaW5hYmlsaXR5LWludG8tZ3Jvd3RoLW9wcG9ydHVuaXR5L9IBAA","guidislink":false,"published":"Thu, 16 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=47, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmV3cy5zYXAuY29tLzIwMjMvMDIvZWNvYmF0LXR1cm5zLXN1c3RhaW5hYmlsaXR5LWludG8tZ3Jvd3RoLW9wcG9ydHVuaXR5L9IBAA?oc=5\" target=\"_blank\">Ecobat: Sustainability Is a Growth Opportunity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SAP News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ecobat: Sustainability Is a Growth Opportunity - SAP News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vbmV3cy5zYXAuY29tLzIwMjMvMDIvZWNvYmF0LXR1cm5zLXN1c3RhaW5hYmlsaXR5LWludG8tZ3Jvd3RoLW9wcG9ydHVuaXR5L9IBAA?oc=5\" target=\"_blank\">Ecobat: Sustainability Is a Growth Opportunity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SAP News<\/font>","source.href":"https:\/\/news.sap.com","source.title":"SAP News","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Between steady population growth, increasing urbanization, and rising standards of living, the momentum of change is challenging every aspect of our world. Just looking at today’s consumption levels is enough to make organizations wonder if they can ever keep up. The World Business Council for Sustainable Development estimates the ecological resources of 2.3 planets, on average, are needed to sustain present-day growth by 2050. Despite the pressures, this moment can become the most significant growth opportunity of our time. Replacing traditional take-make-waste business models with a circular approach can bring industries in line with our planet’s boundaries. But more importantly, it tackles environmental and social injustices that often impact underserved communities and creates more jobs that are better paying. For Ecobat, the world’s leader in battery recycling and lead production, the circular economy is an inseparable part of its business. By recovering and repurposing more than 99% of the metal of 120 million batteries consumed by companies and consumers annually, the company can minimize its contribution to landfills and satisfy consumer demand for sustainable energy. Defining Leadership in the Circular Economy Given the gravity of its sustainability initiative, Ecobat needed to modernize its mission-critical systems without risk. Functional and geographical silos led to little cross-team collaboration and fragmented electronic and paper-based processes, documentation, and legacy record-keeping systems – resulting in unnecessary risk exposure, fractured data, and a bloated overhead structure. Ecobat’s leadership team knew that digitalization and intelligent technologies are critical to lead in the responsible collection, recycling, production, and distribution of resources essential to modern life. So, the company decided to implement SAP S\/4HANA Cloud, a cloud enterprise resource planning (ERP) solution for every business need. By taking this path, the company gained the reliability, agility, and predictability necessary to navigate the risks and opportunities of moving into a new business model centered around the circular economy. SAP S\/4HANA Cloud presented an opportunity to consolidate the unique legacy ERP systems and data of its 25 partner locations worldwide. Using the RISE with SAP solution, Ecobat carefully mapped and moved all individual systems into the cloud ERP while navigating differences between the old and new ERP systems and adopting new standardized processes. The company also discontinued its on-premise data center, decreasing its energy consumption footprint across a global reach. Moving an on-premise landscape of multiple ERP systems to a single instance of SAP S\/4HANA Cloud opened the door to a new digital era for Ecobat. Every area of the business and its partners can access extensive and timely information and collaborate and communicate effectively. In return, the entire company can achieve goals key to their long-term survival and expansion, including: Drive top-line growth by enabling innovative business models on a global scale by enabling innovative business models on a global scale Achieve bottom-line growth with industry-proven processes with industry-proven processes Deliver green-line growth by building sustainability directly into the business by building sustainability directly into the business Grow with the confidence needed to help the business move to wherever it needs to go For example, Ecobat is innovating new products, services, and processes with a laser focus on the circular economy – from costs and facilities to the responsible collection, recycling, production, and distribution of resources. Its R&D and engineering teams have the sustainability data and visibility to look holistically across the organization, drill into the finer details of a challenge or opportunity, and streamline and accelerate the processing of used batteries into raw materials. In addition, empowering each partner location to collect and recycle batteries within its region helps decrease reliance on mining new ore, reduce transportation, and streamline the supply chain. Thinking, Looking, and Acting More Sustainably – Globally With battery recycling at the heart of its business model, Ecobat takes pride in its leadership in the circular economy. And that sense of accountability and responsibility is clearly reflected in how the company invests in its people and business operations. This observation certainly applies to Ecobat’s decision to implement SAP S\/4HANA Cloud as part of RISE with SAP. While keeping millions of lead-acid batteries from going to local landfills, the company is confidently scaling and growing its operations worldwide to continue contributing to a more sustainable planet for years to come. Learn more about the competitive edge Ecobat gained from its implementation of SAP S\/4HANA Cloud as part of RISE with SAP. Read the IDC case study, “Ecobat Expands into the Digital Era with Cloud ERP.” Benno Eberle is solution marketing lead for SAP S\/4HANA Cloud, private edition, at SAP.","filter_flag":1}
{"title":"Alberta invests $58 million in Canadian circular economy projects - Recycling Product News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA","guidislink":false,"published":"Tue, 21 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5\" target=\"_blank\">Alberta invests $58 million in Canadian circular economy projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Alberta invests $58 million in Canadian circular economy projects - Recycling Product News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnJlY3ljbGluZ3Byb2R1Y3RuZXdzLmNvbS9hcnRpY2xlLzM5ODczL2FsYmVydGEtaW52ZXN0cy1kb2xsYXI1OC1taWxsaW9uLWluLWNhbmFkaWFuLWNpcmN1bGFyLWVjb25vbXktcHJvamVjdHPSAQA?oc=5\" target=\"_blank\">Alberta invests $58 million in Canadian circular economy projects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","source.href":"https:\/\/www.recyclingproductnews.com","source.title":"Recycling Product News","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The Government of Alberta is advancing the province's circular economy by committing $58 million through Emissions Reduction Alberta (ERA) to projects across the province worth $528 million in public and private investment. All funding is sourced from the province's Technology Innovation and Emissions Reduction (TIER) fund. Producing high-quality fertilizer for farmers, recycling asphalt from roof shingles, sequestering carbon in concrete, and novel plastics recycling are some examples of the technology solutions receiving funding through ERA's circular economy challenge. If successful, these projects will result in cumulative greenhouse gas (GHG) reductions of up to 4 million tonnes by 2050 – equal to offsetting the GHG footprint of 1 million homes. The funding is expected to create 1835 person-year jobs in Alberta and have a $350 million GDP impact in the province by 2025. The investment aligns with provincial initiatives including the proposed extended producer responsibility (EPR) approach, the agricultural plastics recycling initiative, and the natural gas vision and strategy's goal to establish Alberta as a centre of excellence for plastics diversion and recycling. \"Advancing technology solutions that support a circular economy makes good environmental and economic sense. Circular economy challenge projects supported by the TIER fund will help keep valuable materials in the economy and out of landfills, which drives investment, bolsters economic activity, cuts emissions, and creates jobs. It's a win across the board,\" says Sonya Savage, minister of environment and protected areas. \"A more sustainable, diversified provincial economy requires using our resources more wisely, we need to think about waste as a resource rather than a cost. This investment in converting waste into other uses is going to make a real difference,\" adds Justin Riemer, CEO of Emissions Reduction Alberta Circular Economy Challenge projects support waste reduction, material, and feedstock substitution, value recovery, and reduction of the lifecycle environmental footprint of materials and products. These technology solutions can reduce the impacts of material production, processing, and disposal. The invested innovations will support industry competitiveness, new venture creation, and economic diversification. Projects that will receive funding Northstar Clean Technologies Inc. The project will design, build, and commence operations of a new asphalt roof shingles recycling facility. ERA funding: $7.1 million | Project cost: $20.6 million Sparks Eggs Dehydrate inedible eggs from an existing grading and packing facility into a powder to be used for pet food and animal feed. ERA funding: $500,000 | Project cost: $1 million Rimrock Renewables LP. Treat the byproduct of the anaerobic digestion process to produce fertilizer, peat, cattle bedding, and clean water on-site. ERA funding: $8.4 million | Project cost: $19 million Hydrovac Waste Solutions Ltd. Divert slurry from the landfill and recover valuable products from the hydro-vacuum process. ERA funding: $1.7 million | Project cost: $8 million Carbon Upcycling Technologies Demonstrate a commercial-scale carbon sequestration and utilization technology for the cement and concrete sector. ERA funding: $4.4 million |Project cost: $11 million Phyto Organix Foods Inc. Construction of a large-scale, commercial, net zero yellow pea fractionation facility. ERA funding: $10 million | Project cost: $231 million Suncor Energy Inc. Recover Vanadium, a valuable critical metal\/element, from the fly ash by-product from coke-fired boilers and use it in the growing energy storage market. ERA funding: $7 million | Project cost: $36 million INCA Renewtech Construct and operate a first-of-kind commercial facility to create a sustainable, advanced bio-composite material made from hemp stalk. ERA funding: $10 million | Project cost: $174.5 million Circular Rubber Technologies Inc. Reclaim rubber from end-of-life, high-grade tires from industrial activities and sell the end product back to manufacturers for use in new tires. ERA funding: $3.2 million | Project cost: $16 million RBW Waste Management Ltd. Install and commission a recycling system for high-density polyethylene containers used to transport liquid and solid wastes and process them into new products. ERA funding: $700,000 | Project cost: $1.4 million","filter_flag":1}
{"title":"Complimentary Recycling Strengthens Circular Plastics Economy - PlasticsToday","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA","guidislink":false,"published":"Thu, 23 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=23, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=54, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5\" target=\"_blank\">Complimentary Recycling Strengthens Circular Plastics Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Complimentary Recycling Strengthens Circular Plastics Economy - PlasticsToday","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnBsYXN0aWNzdG9kYXkuY29tL2FkdmFuY2VkLXJlY3ljbGluZy9jb21wbGltZW50YXJ5LXJlY3ljbGluZy1zdHJlbmd0aGVucy1jaXJjdWxhci1wbGFzdGljcy1lY29ub2150gEA?oc=5\" target=\"_blank\">Complimentary Recycling Strengthens Circular Plastics Economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PlasticsToday<\/font>","source.href":"https:\/\/www.plasticstoday.com","source.title":"PlasticsToday","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Governments are getting serious about tackling the environmental risks posed by plastics that enter the waste stream, spurring exploration into achieving true plastics circularity. However, developments in advanced recycling technology are just one part of the equation. We must close the loop between recycling infrastructure owners and operators, plastics manufacturers, and consumer goods manufacturers to further improve the recycling rate. According to the Organisation for Economic Co-operation and Development, globally, only 9% of plastic waste is recycled. Of all the plastic manufactured between 1950 and 2017, 7 billion tonnes have become waste and that amount continues to grow. Today, the world produces twice as much plastic as two decades ago, and 8 million tons a year end up in oceans. By 2050, there could be more plastic in the sea than fish, according to the World Wildlife Fund. While reducing plastic use can help, the need for plastics is unlikely to disappear anytime soon. Plastic materials play an important role in preserving the shelf life of foods, protecting medical products from contamination, and the list goes on. Overall, our global society still needs plastics to maintain and expand a healthy, modern and safe standards of living. However, this doesn’t negate the plastics pollution problem. It just challenges critical decision-makers to avoid over-simplifying the issue and implement realistic and effective solutions to reduce plastic waste. Governments take action to reduce plastic waste. Around the world, national, state, and local government agencies are trying to reduce plastic waste. These measures can take the form of restrictions or bans on common single-use conveniences, like plastic bags at groceries stores. In another example, the US has seen growing interest in extended producer responsibility (EPR) legislation, which would require companies that put packaging into the marketplace to pay for its collection, sorting, and recycling after use. Maine and Oregon have already implemented EPR regulations, and another nine states are expected to follow suit in the near future. Meanwhile, 24 national governments have now adopted the New Plastics Economy Global Commitment launched in 2018 by the Ellen MacArthur Foundation and the United Nations Environment Programme, and hundreds of businesses - representing 20% of all plastic packaging produced worldwide – have also signed on to the initiative. Signatories of the Global Commitment endorse a shared vision for a “circular economy” for plastic in which it never becomes waste, and they commit to taking concrete actions by 2025 to realize that vision. Each signatory is expected to report annually on its progress. For example, France’s “3R” decree for packaging obligates all single-use plastic packaging marketers to work towards 100% recycling by 2025. The United Kingdom, meanwhile, has introduced taxes on packaging containing less than 30% recycled content to achieve that level for all plastic packaging by the same date. The Ellen MacArthur Foundation is also spearheading an initiative to create a new United Nations treaty on plastic pollution. Legislation alone will not solve the problem, however. Society also needs a holistic approach to achieving increased plastics recycling, and that means embracing a full range of technologies. New technology to address complex recycling challenges include pyrolysis. Today, mechanical recycling technologies process most of the plastic that is diverted from the waste stream. In this process, plastic is washed, chipped, melted, and reformed into pellets used to create new products. This method is widely adopted for its accessibility, energy efficiency, and cost effectiveness. New developments have even expanded the range of plastics that can be mechanically recycled beyond polyethylene terephthalate (PET) to include trickier materials like flexible packaging. However, mechanical recycling has its limitations. The physical properties of the material degrade in the process, and the plastics recycled using these methods are suitable for fewer applications and often “downgraded” to applications like the manufacture of park benches, certain fabrics for apparel, etc. Certain plastics are difficult to process through mechanical recycling altogether. Many films, mixed materials, and heavily pigmented plastics are generally unsuitable for mechanical recycling. At the same time, regulation restricts the recycled plastic content that can be used for certain applications, such as food-contact packaging, which may require further sterilization or decontamination before it can be used. Advanced recycling via pyrolysis turns flexible packaging and other mixed materials into oil (inset) that can be converted into new polymers. By contrast, chemical recycling breaks plastics down at the molecular level. The pyrolysis oils that are produced are routed to steam crackers and displace fossil-based feed streams. Steam crackers produce the monomers which are subsequently polymerized to create new plastics that replace fossil fuel-based plastic sources. According to Ghent University and Honeywell internal data, the yield of monomers produced in the steam cracker from recycled plastic pyrolysis oils is akin to fossil-based feedstocks. Recent developments in chemical recycling’s pyrolysis technology enable more effective processing of sorted mixed waste into high-quality, food-grade recycled plastics that offer the same levels of safety and performance as plastics made from conventional (fossil-fuel) sources. By combining pyrolysis with contaminants management and molecular conversion, Honeywell UOP has a commercially viable pyrolysis process that upgrades low-quality waste plastics into recycled polymer feedstock that can be used to produce new, virgin-quality plastics. The Honeywell UOP UpCycle Process Technology expands the universe of plastics that can be recycled and diverts them from landfill or incineration. Critical collaboration between mechanical and advanced recycling. Crucially, the two processes — mechanical and advanced recycling — are complementary rather than competitive. Where waste is suitable, mechanical recycling offers a simple, low-emissions method to return plastics to use. Where the plastic is contaminated, complex, or quality, advanced recycling prevents it from ending in landfill or incinerated and can radically reduce the need for virgin plastics. By advancing chemical recycling to process more of the plastics that cannot be recycled through established channels, we can build on an existing foundation of recycling infrastructure rather than wasting time and emissions reinventing the wheel. Just as the two technologies can work together to bring us closer to the plastics circular economy, collaboration amongst all parts of the waste management system is also needed — across converters, recyclers, processors, retailers, and consumer goods manufacturers. A key obstacle in tackling plastics recycling has been disconnects and inconsistencies between these key players and their approaches to recycling. The capabilities of private and municipal recyclers vary wildly by geography and consumer confusion over what plastics can be recycled and what their towns, cities, or countries can recycle has fuelled disenchantment. Honeywell has aimed to connect these various players by working with waste management companies to license their UpCycle Process Technology, providing an easier path to adopting the mechanisms of advanced recycling. Brands play a key role in communicating packaging and recycling processes to consumers. Once the capability exists, though, it is vital for all parties involved to educate consumer audiences on how these changes should impact recycling habits and advocate for the necessary changes in collection efforts. Brands can play a particularly important role in the conversation to work collectively and persistently to communicate changes to packaging materials and recycling practices to consumers. That collaboration is already increasing among businesses, working together to increase collections from stores, retailers, and manufacturers. There is more work to do, of course, but the focus must also turn to consumers — encouraging them to recycle and, crucially, making it as easy as possible to do so by reducing barriers such as the need to sort different materials. To make that work and ultimately achieve the circular economy that industry, governments and the public want will require using the full range of tools and technology offered. Kevin Quast, Global Head of Honeywell Plastics Circularity Business, is responsible for developing and executing the business and commercialization strategy to grow the Plastics Circularity business leveraging product technology, industry partnerships, and alternate business models. Prior to joining Honeywell, Quast served as a principal consultant for some of the largest consulting firms, such as Deloitte, Accenture, and PwC, where he led the global strategy and digital transformation practices. He is a published author on multiple topics ranging from M&A strategy to corporate transformation and workforces of the future. In addition to his consulting background, Quast spent over a decade in industry, and he has lived and worked in multiple countries assisting many of the major energy and pharmaceutical companies in market expansion and strategy efforts. Kevin started his career at Chevron as a Process Capital Projects Engineer, where he received the Chevron EH&S Design Excellence Award for greatly improving environment quality.","filter_flag":1}
{"title":"CHEVRON PHILLIPS CHEMICAL DEEPENS COLLABORATION WITH NEXUS CIRCULAR, SECURING ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi2gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NoZXZyb24tcGhpbGxpcHMtY2hlbWljYWwtZGVlcGVucy1jb2xsYWJvcmF0aW9uLXdpdGgtbmV4dXMtY2lyY3VsYXItc2VjdXJpbmctY29udHJhY3RlZC1sb25nLXRlcm0tc3VwcGx5LW9mLWFkdmFuY2VkLXJlY3ljbGVkLXBsYXN0aWMtZmVlZHN0b2Nrcy1mcm9tLW5ldy1mYWNpbGl0eS0zMDE3Mzc5MDEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi2gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NoZXZyb24tcGhpbGxpcHMtY2hlbWljYWwtZGVlcGVucy1jb2xsYWJvcmF0aW9uLXdpdGgtbmV4dXMtY2lyY3VsYXItc2VjdXJpbmctY29udHJhY3RlZC1sb25nLXRlcm0tc3VwcGx5LW9mLWFkdmFuY2VkLXJlY3ljbGVkLXBsYXN0aWMtZmVlZHN0b2Nrcy1mcm9tLW5ldy1mYWNpbGl0eS0zMDE3Mzc5MDEuaHRtbNIBAA?oc=5","id":"CBMi2gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NoZXZyb24tcGhpbGxpcHMtY2hlbWljYWwtZGVlcGVucy1jb2xsYWJvcmF0aW9uLXdpdGgtbmV4dXMtY2lyY3VsYXItc2VjdXJpbmctY29udHJhY3RlZC1sb25nLXRlcm0tc3VwcGx5LW9mLWFkdmFuY2VkLXJlY3ljbGVkLXBsYXN0aWMtZmVlZHN0b2Nrcy1mcm9tLW5ldy1mYWNpbGl0eS0zMDE3Mzc5MDEuaHRtbNIBAA","guidislink":false,"published":"Tue, 07 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=38, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NoZXZyb24tcGhpbGxpcHMtY2hlbWljYWwtZGVlcGVucy1jb2xsYWJvcmF0aW9uLXdpdGgtbmV4dXMtY2lyY3VsYXItc2VjdXJpbmctY29udHJhY3RlZC1sb25nLXRlcm0tc3VwcGx5LW9mLWFkdmFuY2VkLXJlY3ljbGVkLXBsYXN0aWMtZmVlZHN0b2Nrcy1mcm9tLW5ldy1mYWNpbGl0eS0zMDE3Mzc5MDEuaHRtbNIBAA?oc=5\" target=\"_blank\">CHEVRON PHILLIPS CHEMICAL DEEPENS COLLABORATION WITH NEXUS CIRCULAR, SECURING ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CHEVRON PHILLIPS CHEMICAL DEEPENS COLLABORATION WITH NEXUS CIRCULAR, SECURING ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi2gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2NoZXZyb24tcGhpbGxpcHMtY2hlbWljYWwtZGVlcGVucy1jb2xsYWJvcmF0aW9uLXdpdGgtbmV4dXMtY2lyY3VsYXItc2VjdXJpbmctY29udHJhY3RlZC1sb25nLXRlcm0tc3VwcGx5LW9mLWFkdmFuY2VkLXJlY3ljbGVkLXBsYXN0aWMtZmVlZHN0b2Nrcy1mcm9tLW5ldy1mYWNpbGl0eS0zMDE3Mzc5MDEuaHRtbNIBAA?oc=5\" target=\"_blank\">CHEVRON PHILLIPS CHEMICAL DEEPENS COLLABORATION WITH NEXUS CIRCULAR, SECURING ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Chevron Phillips Chemical helps accelerate the circular economy for plastics by aligning with Nexus Circular's proven, commercial-scale advanced recycling technology to convert landfill-bound plastics into high-quality materials for the production of virgin-quality circular plastics. ATLANTA, Feb. 7, 2023 \/PRNewswire\/ -- Nexus Circular today announced that the company has signed a long-term commercial agreement with Chevron Phillips Chemical (CPChem) for the supply of a significant volume annually of circular liquid feedstocks from a new advanced recycling facility. This long-term contractual commitment further strengthens CPChem's relationship with Nexus for advanced recycled plastic feedstocks to produce Marlex® Anew™ Circular Polyethylene. Nexus has been supplying CPChem for over two years with consistent bulk shipments of ISCC PLUS certified materials. In December 2021, Six Pines Investments LLC, a wholly-owned sustainable investment subsidiary of CPChem, made a meaningful investment in Nexus to expand production at the Atlanta, Georgia, facility. Both companies are continuing discussions for future new expansion commitments. Nexus Circular is a commercial leader in advanced recycling with a proven proprietary technology and a leading process design that converts landfill-bound films and other hard-to-recycle plastics into high-quality liquids which are then used to produce virgin-quality circular plastics. Since 2018, Nexus has been consistently supplying commercial volumes of circular liquid products, having diverted over 8 million pounds of used plastics from landfill. CPCHEM SECURES CONTRACTED LONG-TERM SUPPLY OF ADVANCED RECYCLED PLASTIC FEEDSTOCKS FROM NEW NEXUS CIRCULAR FACILITY Post this CPChem is targeting an annual production volume of 1 billion pounds of Marlex® Anew™ Circular Polyethylene by 2030. The proven, fully commercialized advanced recycling technology from Nexus repeatedly transforms difficult-to-recycle plastics into pristine new products to accelerate the transition to a circular economy for plastics. Justine Smith, senior vice president of Petrochemicals at CPChem said: \"This contract with Nexus supports the transformation of used plastic into a new, useful resource, helping position CPChem to further scale our circular polymers program and deliver products the world needs for years to come.\" Clint Thompson, chief commercial officer at Nexus, stated, \"Nexus is delivering real-world scalable solutions to meet the outsized demands for virgin-quality recycled plastics. We are thrilled to collaborate with CPChem as we rapidly expand our innovation footprint.\" ABOUT NEXUS Nexus Circular is an advanced recycling company at the center of the circular economy. Nexus accelerates plastic recycling with a market-leading, environmentally efficient, and scalable process so that people, economies, and the environment can thrive. Using its end-to-end solution, Nexus works with sustainability-minded companies and recycling organizations to secure used plastics, especially hard-to-recycle films, having diverted millions of pounds to date from landfill. Nexus then combines proprietary technology with a leading process design to convert used plastics into clean high-quality, ISCC Plus certified circular liquid products for global companies who use them to produce virgin-quality plastics, which displace fossil-based materials to achieve their recycled content goals. Nexus Circular. Advanced Recycling. Accelerated. For more information, visit www.nexuscircular.com SOURCE Nexus Circular","filter_flag":1}
{"title":"New method for converting marine plastic waste into aquaculture products - RECYCLING magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnJlY3ljbGluZy1tYWdhemluZS5jb20vMjAyMy8wMi8yMi9uZXctbWV0aG9kLWZvci1jb252ZXJ0aW5nLW1hcmluZS1wbGFzdGljLXdhc3RlLWludG8tYXF1YWN1bHR1cmUtcHJvZHVjdHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnJlY3ljbGluZy1tYWdhemluZS5jb20vMjAyMy8wMi8yMi9uZXctbWV0aG9kLWZvci1jb252ZXJ0aW5nLW1hcmluZS1wbGFzdGljLXdhc3RlLWludG8tYXF1YWN1bHR1cmUtcHJvZHVjdHMv0gEA?oc=5","id":"CBMid2h0dHBzOi8vd3d3LnJlY3ljbGluZy1tYWdhemluZS5jb20vMjAyMy8wMi8yMi9uZXctbWV0aG9kLWZvci1jb252ZXJ0aW5nLW1hcmluZS1wbGFzdGljLXdhc3RlLWludG8tYXF1YWN1bHR1cmUtcHJvZHVjdHMv0gEA","guidislink":false,"published":"Wed, 22 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=53, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnJlY3ljbGluZy1tYWdhemluZS5jb20vMjAyMy8wMi8yMi9uZXctbWV0aG9kLWZvci1jb252ZXJ0aW5nLW1hcmluZS1wbGFzdGljLXdhc3RlLWludG8tYXF1YWN1bHR1cmUtcHJvZHVjdHMv0gEA?oc=5\" target=\"_blank\">New method for converting marine plastic waste into aquaculture products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RECYCLING magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New method for converting marine plastic waste into aquaculture products - RECYCLING magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMid2h0dHBzOi8vd3d3LnJlY3ljbGluZy1tYWdhemluZS5jb20vMjAyMy8wMi8yMi9uZXctbWV0aG9kLWZvci1jb252ZXJ0aW5nLW1hcmluZS1wbGFzdGljLXdhc3RlLWludG8tYXF1YWN1bHR1cmUtcHJvZHVjdHMv0gEA?oc=5\" target=\"_blank\">New method for converting marine plastic waste into aquaculture products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RECYCLING magazine<\/font>","source.href":"https:\/\/www.recycling-magazine.com","source.title":"RECYCLING magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The ÑCostas Project will make it possible to reuse plastic material recovered from the sea and waste from the aquaculture industry to make walkways and platforms for fish farms, port protection products, flotation tubes, and nets and mesh for reinforcement, among other products. The project is technically coordinated by Aimplas and the Spanish Institute of Oceanography (IEO) to make use of plastic waste recovered from the sea to develop new products for the aquaculture industry. These products will be processed using conventional transformation technologies and will maintain and even improve the properties and useful life of current products. Specifically, this research project, which started in 2021 and will last for four years, studies the treatment and recycling of recovered plastic material for use in walkways and access platforms in fish farms to replace the wood currently used; port protection products, structural and floating tubes for platforms and buoys for signalling and anchoring; and reusing plastic waste products such as fishing gear, nets and meshes to create more lightweight reinforcement for concrete platforms and other products. The project is based on the best method for recovery, selection, and processing of marine plastic waste and aquaculture industry waste, considering its lack of uniformity and the different levels of degradation at different times in the sea. Aimplas contributes its experience in recycling, the circular economy and different technologies for transforming plastic. The project is sponsored by a consortium of companies made up by Acteco, Duraplastics, Ecoplas, Barbanza, Plastire, Rotogal and Solteco, all of which are benchmark companies at national level and cover all manufacturing sectors and technologies in recycling plastic products and the design and manufacture of products related to the aquaculture industry. RDC is also a collaborating member. Most of the plastic products found in the seas and coasts of Spain are polyolefins (e.g. HDPE and LDPE), the most common material for making bottles and bags. When combined with smaller amounts of other polymers, polyolefins are used to create all kinds of containers, such as styrene. These materials have a high chemical resistance, which makes them ideal for recycling products for the use in the marine environment. The ÑCostas Project: Sustainable agriculture. Development of recyclable and sustainable products based on plastic material recovered from the marine environment is being implemented primarily in the Valencian Community, Galicia and La Rioja. It falls within the framework of funding for Cooperative Research and Development Projects from the Centre for the Development of Industrial Technology (CDTI) with the support of the Ministry of Science and Innovation, and co-funded by the European Regional Development Fund (ERDF).","filter_flag":1}
{"title":"EU exports of used textiles in Europe's circular economy - European Environment Agency","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL2V1LWV4cG9ydHMtb2YtdXNlZC10ZXh0aWxlc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL2V1LWV4cG9ydHMtb2YtdXNlZC10ZXh0aWxlc9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL2V1LWV4cG9ydHMtb2YtdXNlZC10ZXh0aWxlc9IBAA","guidislink":false,"published":"Mon, 27 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=58, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL2V1LWV4cG9ydHMtb2YtdXNlZC10ZXh0aWxlc9IBAA?oc=5\" target=\"_blank\">EU exports of used textiles in Europe's circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EU exports of used textiles in Europe's circular economy - European Environment Agency","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL2V1LWV4cG9ydHMtb2YtdXNlZC10ZXh0aWxlc9IBAA?oc=5\" target=\"_blank\">EU exports of used textiles in Europe's circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","source.href":"https:\/\/www.eea.europa.eu","source.title":"European Environment Agency","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"In this briefing, we look at the patterns and trends in EU used textile exports from 2000 to 2019, based on data from the United Nations (Comtrade) (UN Comtrade, 2022a). We show how exports have increased year by year and shifted from mainly going to Africa to being almost equally exported to Africa and Asia. We touch on the challenges around what happens to used textiles in the importing countries. Furthermore, we show how some challenges related to these exports are being addressed in current and proposed EU policies. There are limitations to the data. Trade data are based on individual countries’ reporting and therefore come with some levels of uncertainty. This has been taken into account in the analysis, and all numbers should be understood as indicative. More information on the results presented in this briefing can be found in the underpinning report from the EEA’s European Topic Centre on Circular Economy and Resource Use. EU exports of used textiles: patterns and trends Between 2000 and 2019, the amount of used textiles exported from the EU increased from a little over 550,000 tonnes to almost 1.7 million tonnes. The latter is equal to 3.8 kg per person (Figure 1), which is about 25% of the 14.8 kg of clothing, footwear and household textiles consumed per person in 2020 (EEA, 2022). Figure 1. Exports of used textiles from the EU (EU-27 and the UK) to the rest of the world, 2000-2019, by weight (million tonnes) Note: Combined numbers for nomenclature categories 6309 and 6310; see Box 1 below for further detail. Source: (UN Comtrade, 2022d) Explore different chart formats and data here Over the last 20 years, the trade value of used textiles has lagged behind the increase in net weight, showing that importers are currently paying less per kilogram than some years ago. In 2019, the average price paid per kilogram had dropped to about EUR 0.57. These are in constant prices, so the drop in price is even higher considering inflation and general price increases over the period. Trade value might also have decreased due to a decrease in quality or the market becoming saturated, as suggested by the recent report from Fashion for Good (2022). Box 1. Combined nomenclature codes for used textiles The combined nomenclature (CN) is a product classification system used in export declarations and in statistical declarations for trade in the European community. Codes for used textiles exported from the EU are classified into two main product codes under the CN product code system: 6309 (worn textiles and clothing) and 6310 (sorted and unsorted used rags and textile scraps). In general, code 6309 should be given to textiles fit for reuse (second hand), while code 6310 should be used for textiles unfit for reuse that may or may not already have been processed; for example, recycled into other products such as industrial rags. There is no code for textile waste export. However, textiles are on the European List of Waste (EU, 2015), and national authorities are therefore required to assess whether the used textiles that are to be exported should be classified as waste or not. As a rule of thumb, textiles under code 6309 (i.e. worn textiles and clothing) are rarely considered waste, while textiles under code 6310 (i.e. sorted and unsorted used rags and textile scraps) might be considered waste (Watson et al., 2016). In the last two decades, the EU has mainly exported used textiles classified as 6309 (i.e. worn textiles and clothing) and only small amounts of textiles classified as 6310 (i.e. sorted and unsorted used rags and textile scraps). Charitable and private collectors in most countries typically want to receive only reusable textiles and do pre-sorting to extract high-value textiles, so-called ‘cream’, to sell in their own shops (Köhler et al., 2021). Yet a large amount of used textiles is exported unsorted as so-called ‘originals’ and is likely to contain both items fit and unfit for reuse. Wholesalers do not always have a clear idea of what finally happens to the textiles they export for reuse elsewhere in the world (Köhler et al., 2021; Trzepacz et al., 2023). Batches of ‘originals’ are likely to be classified under code 6309, even though they might contain rags and scraps (Watson et al., 2016). In other words, classification does not necessarily describe the true state of what is exported. Because of this uncertainty, and because code 6310 makes up a small part of the total exports, the remainder of this briefing mostly disregards the difference between the two commodity codes and instead looks at exports as a whole. Although used textile exports from the EU have been increasing, in 2019, the EU was no longer the most important exporting region in the world. In 2000, the EU was responsible for more than 45% of the total exports of used textiles worldwide; however, its share has declined since. In 2019, Asia (37%) exported more used clothing than the EU (33%) (Figure 2). Figure 2. Total exports of used textiles by region, 2000, 2010 and 2019, percentage by weight Notes: Groupings of countries are based on those of the United Nations Statistical Office (UN Statistics Division, 2022). Europe refers to EU27 and the UK. Europe (non-EU) refers to countries within the continent of Europe that are not part of the EU. This includes Albania, Andorra, Belarus, Bosnia and Herzegovina, Faroe Islands, Georgia, Gibraltar, Greenland, Iceland, Montenegro, North Macedonia, Norway, Moldova, Serbia, Serbia and Montenegro (until 2006), Switzerland, Russia and Ukraine. Source: (UN Comtrade, 2022e). Explore different chart formats and data here Some EU countries, such as Germany, Poland and the Netherlands, have exported more than others and seem to have acted as import-export hubs for used textiles from the EU, as explained in Box 2. There is no clear reason explaining why five out of 27 EU Member States and the United Kingdom account for around 75% of all EU used textile exports. It could be partly because these countries are discarding more used textiles because they have better collection systems than other countries, or because they have less internal reuse. On average, 38% of used textiles are collected separately in the EU, but there are large differences between countries. For instance, only 12% were collected in Spain, but 60% were collected in Germany (Fashion for Good, 2022). However, researchers have found that used textiles are subject to intricate trade between EU Member States before leaving the region. Therefore, it is likely that the largest exporters have been sending used textiles abroad, collected locally and from other EU countries (Fashion for Good, 2022; Watson et al., 2016). Thus, another reason for the concentration of exports in a few EU countries could be that these large exporting countries are acting as export hubs; in other words, they are importing used textiles from other EU Member States for re-export beyond the EU. Ports\/harbours for international shipment in some of these countries make them logical export hubs. Box 2. Understanding the used textile trade dynamics in the EU It is not within the scope of this briefing to explore the trade in used textiles in the EU and why certain countries appear to act as import-export hubs for used textiles. There are, however, indications that it might be related to the benefits of specialisation, economies of scale and the presence of harbours. Denmark, Finland and Sweden, for instance, do not have significant wholesale\/sorting capacity, whereas the Netherlands and Poland have a large wholesale and sorting sector (Köhler et al., 2021). Germany also does not have sufficient sorting capacity locally compared to what is collected, and in the Netherlands, most of the local sorting capacity is used to sort textiles from Germany (Fashion for Good, 2022). Furthermore, Belgium, Italy and the Netherlands have large export harbours. As sorting is a manual and labour-intensive process, it is more economical to do it in countries with lower labour costs, such as Poland (Fashion for Good, 2022). As the market is characterised by tight margins, saving on labour costs can make the difference between operating with or without a profit. More about intra-EU trade dynamics can be read in the recent report from Circle Economy and Fashion for Good. Countries receiving used textiles from the EU Throughout the past two decades, Africa has been the main continent receiving used textiles from the EU, importing more than 60% of EU exports. While in 2000, Asia received only 26% of EU exports, by 2019, it had significantly increased its share to 41% of EU imports. This is almost equal to Africa, which still imported 46% of EU exports. Non-EU European countries have imported a small proportion of EU used textiles, around 10%, which has remained relatively constant over the years (Figure 3). Figure 3. EU exports of used textiles to other regions, 2000, 2010 and 2019, percentage Note: Groupings of countries are based on those of the United Nations Statistical Office (UN Statistics Division, 2022). Source: (UN Comtrade, 2022b) Explore different chart formats and data here As seen in Figure 4, between 2000 and 2019, more Asian countries rose to the higher end of the top 10 countries receiving EU used textile exports. From 2000 to 2010, Pakistan rose from eighth to first place, and retained that position in 2019. The United Arab Emirates (UAE), which was not part of the list in 2000, was in seventh place in 2010 and in second place in 2019. In 2000, three African countries made up the top five countries receiving EU used textile exports. Yet in 2019, one African, one European and three Asian countries formed the top five. A shift is seen not only in which countries make up the top 10 receiving countries, but also in the size of their shares. In 2000, the top 10 receiving countries imported 54.6% of all EU used textiles, whereas in 2019, they imported 64%. This suggests that specialisation in importing textiles is taking place. Figure 4. EU exports of used textiles, by receiving country, 2000, 2010 and 2019, million kilograms Note: Groupings of countries are based on those of the United Nations Statistical Office (UN Statistics Division, 2022). Source: (UN Comtrade, 2022c) The fate of EU-exported used textiles in receiving countries is highly uncertain as limited and mostly anecdotal evidence is available. The findings summarised below are based on analysing different sources, and an overview and discussion of the available information is included in the underpinning report. In the African countries studied, the import of used textiles seems to be mainly meant for local reuse. This is because there is a demand for cheap, used clothes from Europe, which seem to be preferred to new items. What is not fit for reuse mostly ends up in open landfills and informal waste streams. Several African countries have been debating banning used textile imports as a way to protect and strengthen local textile production (Sustainable Amor, 2020). This indicates that imports also bring negative social and environmental impacts. In Asia, however, most of the used textiles are imported to so-called economic zones where they are sorted and processed. In the countries studied for this briefing, import for local reuse is restricted. Instead, used textiles seem to be recycled locally, mostly downcycled into industrial rags or filling, or re-exported either for recycling in other Asian countries or reuse in Africa. Textiles that cannot be recycled or re-exported are likely to end up in the general waste management system, most of which is landfilling. Reflections on EU exports of used textiles EU used textile exports have grown significantly over the two last decades. The exports are a mix of textiles that can, in principle, be reused in the receiving countries. However, in reality, they may be landfilled: textiles that cannot be reused typically end up being downcycled or disposed of in landfills or dumps. There is a lot of uncertainty around what share of textiles can be reused and what cannot as the combined nomenclature (CN) codes for export do not make this distinction clear. There is little research or information on the actual reuse rate in the receiving countries, the share of used textiles that ends up as waste, and the specific waste management systems and their abilities to handle the used textiles that cannot be reused in a sustainable way. Both the EU and the destination countries need to address the challenges around the growing amounts of exported used textiles and the overall uncertainty about their fate. Figure 5. Flow of used textiles collected in the EU Note: Groupings of countries are based on those of the United Nations Statistical Office (UN Statistics Division, 2022). Sources: (Köhler et al., 2021) (Fashion for Good, 2022) (Watson et al., 2016). In the EU strategy on sustainable and circular textiles, published in March 2022, the need for addressing the challenges from exports is specifically mentioned (see Box 3). The European Parliament is also expected to address this. Box 3. EU used textile exports in the EU textiles strategy The following text on EU used textile exports appears in the EU strategy on sustainable and circular textiles, published in March 2022 (EC, 2022): Addressing the challenges from the export of textile waste Exports of textile waste outside the EU have been steadily increasing to reach 1.4 million tonnes in 2020. Under the recent Commission proposal for new EU rules on the shipment of waste, the export of textile waste to non-OECD countries would be allowed only under the condition that such countries notify to the Commission their willingness to import specific types of waste and demonstrate their ability to manage it sustainably. To avoid that waste streams are falsely labelled as second-hand goods when exported from the EU and in this way escape the waste regime, on the basis of an empowerment foreseen in the proposal, the Commission will consider the development of specific EU level criteria to make a distinction between waste and certain second-hand textile products. A call under LIFE has been launched to improve the traceability of exports of used textiles and textile waste. The Commission will also work to increase transparency and sustainability in global trade in textile waste and used textiles. At bilateral level, the EU will be intensifying its cooperation on issues of common interest related to textile waste shipment through its dialogues on the environment with third countries and regions, as well as in the context of the sustainable development chapters of the EU bilateral and region-to-region trade agreements, where relevant, in line with the overall EU objectives to increase the sustainability dimension of its trade policy. This briefing and its underpinning report identify a range of issues for further investigation. EU used textile exports are characterised by a lot of uncertainty. First, there is uncertainty around the types of textiles exported as well as their quality. There is also a lack of consistent data on the quantities and fate of used textiles and textile waste in Europe. Different countries collect and classify textiles in various ways, and the UN Comtrade commodity codes for and statistics on used textiles do not necessarily reflect the quality and fate of exported textiles. Furthermore, there are signs that Asian importers re-export part of what they import; as a result, the picture becomes increasingly unclear. A better understanding of where the used textiles go after the first receiving country is crucial for identifying what ultimately happens to used textiles exported from the EU. The reuse and recycling of textiles come with considerable environmental benefits by offsetting new textile production (Sandin and Peters, 2018; Trzepacz et al., 2023). In the case of used textile exports, however, the supposed reuse is taking place outside Europe (Sandin and Peters, 2018; Trzepacz et al., 2023). Not only can this kind of ‘outsourced reuse’ be questioned, given the fact that there seems to be a lack of interest in reusing these garments in Europe: it also comes with a high degree of uncertainty about the actual level of reuse and recycling. The avoided environmental impacts related to reuse depend on whether this reuse actually replaces new textile or fibre production. In other words, if used textiles exported from the EU are of too low quality to be reused, are not reused for very long or do not replace new clothing purchases, they may not really replace new production or benefit the environment. Instead, the exports will only lead to more textiles ending up as waste. Given the limited waste management facilities in many receiving countries, the situation may be worse: these exported textiles may cause even more environmental damage than if they were sent to recycling or waste incineration in Europe in the first place. However, this needs further research. The quality of textiles exported from the EU, and how this impacts their fate, is important. Yet it is also complex and warrants further research, data and knowledge. It is particularly important to get a better understanding of the ‘market fit’ between what is exported and the needs of the receiving countries to reduce the risk of exported reusable or recyclable items going to waste. In addition, there needs to be better understanding around available sorting and recycling capacities and their ability to deal with clothing unfit for reuse. Ultimately, this would help avoid improper waste management and landfilling.","filter_flag":1}
{"title":"Mobil launches 50% post-consumer recycled plastic pails in India - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5\" target=\"_blank\">Mobil launches 50% post-consumer recycled plastic pails in India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mobil launches 50% post-consumer recycled plastic pails in India - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5\" target=\"_blank\">Mobil launches 50% post-consumer recycled plastic pails in India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Mobil is driving an initiative to transition to 50% Post-Consumer Recycled (PCR) plastic pails – helping customers reduce waste, convert waste to value and advance sustainability ambitions Mobil is taking steps to incorporate recycled plastics in finished lubricant product packaging The company's move towards PCR drives the use of recycled plastic, and helps reduce plastic waste, while enabling sustainable progress NEW DELHI, Feb. 3, 2023 \/PRNewswire\/ -- Mobil™, a global leader in lubrication technology innovation, has launched an initiative to encourage sustainable packaging with its 50% Post-Consumer Recycled (PCR) plastic pails. The PCR pails drive the use of recycled plastic, helping reduce plastic waste, and enabling sustainable progress. The company's 50% PCR pails, first in pails packing for lubricating oils in India, aim to help customers reduce waste, convert waste to value and advance sustainability ambitions. Mobil launches 50% post-consumer recycled plastic pails in India Vipin Rana, Chief Executive Officer, ExxonMobil Lubricants Pvt. Ltd., said, \"Mobil can help create value by advancing customers' mobility, productivity, and sustainability ambitions. Our initiative to transition to 50% post-consumer recycled plastic pails is just one example of how we are advancing our customers' sustainability ambitions. We understand the ever-changing needs of our customers and stakeholders and are committed to operating our business in an accountable and sustainable manner, supplying feature products by minimizing the environmental impacts, and supporting the communities in which we operate.\" ExxonMobil has emerged as a categorical leader in the diversion of waste in lubricant facilities. All Mobil products manufactured in the company's global network of lubricant facilities carry the Underwriters Laboratories Zero Waste to Landfill, Silver Validation, first earned in 2018. This validation recognizes ExxonMobil's commitment to reducing waste and advancing a circular economy. Additionally, ExxonMobil continues to be the first and only finished lubricants marketer to carry this credential, and each year diverts more than 90% (over 50,000 tons) of lubricant operations waste from landfills into new productive uses. ExxonMobil is also leveraging scale and integration to increase the production of certified circular plastics and meet growing demand. In December 2022, the company announced the successful startup of one of the largest advanced recycling facilities in North America. The facility at the integrated manufacturing complex in Baytown, Texas, uses proprietary technology to break down hard-to-recycle plastics and transforms them into raw materials for new products. The recycling facility in Baytown is capable of processing more than 80 million pounds of plastic waste per year, supporting a circular economy for post-use plastics and helping divert plastic waste currently sent to landfills. Mobil's range of products and solutions help support businesses, communities, and individuals to make more efficient and sustainable choices. Mobil branded offers help customers extend oil and equipment life, improve energy efficiency and fuel economy, deliver performance, and achieve more with less by making the most of valuable resources. About ExxonMobil in India ExxonMobil's downstream business engages in the distribution, sales and marketing of Mobil branded lubricants and specialties. The chemicals business provides market development support, analytical and reporting services. It also conducts chemical product application support services and product testing support at its technology center in Bengaluru. The upstream business provides consulting and LNG market development support services for other ExxonMobil upstream affiliates. The Global Business Center\/Technical Center provides a range of support services for ExxonMobil's operations around the globe. ExxonMobil contributes to a wide range of programs in India that support education, health and the community. For more news and information on Mobil lubricants in India, follow us on – FaceBook Instagram YouTube Linkedin ExxonMobil Exxon Mobil Corporation has numerous affiliates, many with names that include, but are not limited to, ExxonMobil. For convenience and simplicity, the term \"ExxonMobil\" is used as an abbreviated reference to specific affiliates or affiliate groups. Photo: https:\/\/mma.prnewswire.com\/media\/1995639\/Mobil_launch.jpg","filter_flag":1}
{"title":"Stop tossing your spent vapes and e-cigs: you're breeding a new waste pandemic - The Conversation Indonesia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9zdG9wLXRvc3NpbmcteW91ci1zcGVudC12YXBlcy1hbmQtZS1jaWdzLXlvdXJlLWJyZWVkaW5nLWEtbmV3LXdhc3RlLXBhbmRlbWljLTE5OTk1NtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9zdG9wLXRvc3NpbmcteW91ci1zcGVudC12YXBlcy1hbmQtZS1jaWdzLXlvdXJlLWJyZWVkaW5nLWEtbmV3LXdhc3RlLXBhbmRlbWljLTE5OTk1NtIBAA?oc=5","id":"CBMib2h0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9zdG9wLXRvc3NpbmcteW91ci1zcGVudC12YXBlcy1hbmQtZS1jaWdzLXlvdXJlLWJyZWVkaW5nLWEtbmV3LXdhc3RlLXBhbmRlbWljLTE5OTk1NtIBAA","guidislink":false,"published":"Thu, 16 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=47, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9zdG9wLXRvc3NpbmcteW91ci1zcGVudC12YXBlcy1hbmQtZS1jaWdzLXlvdXJlLWJyZWVkaW5nLWEtbmV3LXdhc3RlLXBhbmRlbWljLTE5OTk1NtIBAA?oc=5\" target=\"_blank\">Stop tossing your spent vapes and e-cigs: you're breeding a new waste pandemic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Conversation Indonesia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Stop tossing your spent vapes and e-cigs: you're breeding a new waste pandemic - The Conversation Indonesia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9zdG9wLXRvc3NpbmcteW91ci1zcGVudC12YXBlcy1hbmQtZS1jaWdzLXlvdXJlLWJyZWVkaW5nLWEtbmV3LXdhc3RlLXBhbmRlbWljLTE5OTk1NtIBAA?oc=5\" target=\"_blank\">Stop tossing your spent vapes and e-cigs: you're breeding a new waste pandemic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Conversation Indonesia<\/font>","source.href":"https:\/\/theconversation.com","source.title":"The Conversation Indonesia","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Vaping, or using electronic cigarettes, not only pollutes the surrounding air, it also creates a new contaminated e-waste stream. Australian waste management authorities are just beginning to tackle this problem, as schools’ stockpiles of confiscated vapes continue to grow. As researchers of issues to do with the so-called circular economy, we take a keen interest in how products can be safely and successfully reused and recycled, rather than being thrown away. After years of battling the scourge of cigarette butts, Clean Up Australia’s latest National Rubbish Report, released today, reveals cigarette butts are no longer number one on the list of most commonly littered items. Soft plastics have become public enemy number one instead. But the rate of growth in vaping suggests an even more challenging battle lies ahead. Clean Up Australia says e-cigarettes “appear to be even more damaging to the environment than cigarette butts” as they “present a triple threat to the environment: plastic waste, electronic waste and hazardous waste”. What is vaping? A vaping device, also called a vape, is an electronic device that releases an aerosol that users inhale. The vapour may contain nicotine (not always), flavourings, and other substances. Since their invention in 2003, vapes and e-cigarettes have been marketed as healthier alternatives to tobacco cigarettes, and as a possible stepping stone to quitting smoking. Vaping, however, has health risks and environmental consequences. A growing trend The number of people vaping worldwide was expected to reach a record high of 55 million in 2021, up from 7 million in 2011, according to Euromonitor International. Globally, the vaping market is expected to reach US$38.5 billion by 2026. The 2019 National Drug Strategy Household Survey found fewer Australians were smoking tobacco daily, while the use of e-cigarettes was increasing. From the survey results, the Australian Tobacco Harm Reduction Association calculated that 520,000 people vaped that year (2.5% of the population aged 14 or over). Australian vaping rates are catching up to those in other Western countries, despite attempts from health authorities and professional bodies to dissuade vaping. National product sales increased from $28.3 million in 2015 to $98.1 million in 2020. The growing number of users corresponds with a mounting pile of trash in our environment. Trash or treasure It is estimated that two disposable vapes are thrown away every second in the United Kingdom, according to a joint investigation by several British media outlets. Millions of disposable vapes that could be recycled are ending up in landfill across the world. Yet they contain lithium, a metal in high demand. Roughly 1,200 electric vehicle batteries could be made from the lithium in discarded vapes and e-cigarettes in one year. While some advocate banning these products, others call for better recycling - or the end of disposable vapes in favour of reusable products. That’s because recycling such a complex product makes reusable, rather than disposable devices preferable. Scott Butler, executive director of the UK-based electrics recycling company Material Focus told The Bureau of Investigative Journalism that when vapes go to landfill they effectively dump plastics, poisons, nicotine salts, heavy metals, lead, mercury, and flammable lithium-ion batteries into the environment. “The challenge is that people don’t really think about what a vape is made of, but what it does for them,” he says. In the absence of recycling, vapes and e-cigarettes pose a serious risk. Impacts may include the leaking or aerosol transport of toxic substances from e-liquids, fires caused by lithium-ion batteries, the leaking of corrosive electrolytes from batteries, and the leaching of heavy metals from batteries. Revving up recycling schemes In most parts of the world, vapes are classified as waste electrical and electronic equipment. Consumers are encouraged to dispose of these devices at a household recycling centre, the local pharmacy where they purchased the device, or the local community recycling centre. Recently the vaping industry has taken steps to help recycle its own waste devices. Gaiaca and Terracycle, for example, dismantle, clean, and convert vaping devices into raw materials for use in new products in New Zealand and Canada. The US vape industry has launched recycling schemes such as DotMod, Shanlaan, Dovpo and Vinn. A battery reuse program is one example of the work done by Innokin. The National Television and Computer Recycling Scheme (NCTRS) and similar e-waste programs are popular in Australia but there is no national disposable vape recycling program. However, several well-established companies and local councils have launched ground-level recycling programs for items not covered by the NTCRS, including vaping devices. Some of Australia’s community pharmacies are equipped with Return Unwanted Medicines (RUM) bins. Currently, nicotine-containing vaping products are only available through prescriptions in Australia, so RUM bins can be used as a safe disposal channel. Queensland, for example, allows nicotine vaping products to be taken to community pharmacies or public health units. This includes the vaping devices themselves, not just the unused e-vape liquid. The RUM bins are used to collect the devices, which are then picked up by recycling organisations that are mostly contracted by vapes manufacturers for sorting and disassembling. Raising awareness In the absence of proper management, single-use vapes and e-cigarettes are more hazardous than single-use plastics because of the chemicals they contain. Many vape users are unaware that disposable vapes can or should be recycled. In many instances, vapers are provided with basic information about vaping disposal and personal safety in relation to the hazardous materials contained in the devices, as observed by the NSW Environmental Protection Authority. Since many vaping devices are designed to be single use, they cannot be easily disassembled. It is important to provide users with information regarding the public and private pick-up services that can assist by collecting and disassembling vape and e-cigarette waste into separate components. This involves removing the battery, rinsing the liquid tank and its components, and recycling each of the materials. More recycling initiatives are required by leading companies in the vape industry. Designing vapes and e-cigarettes for the circular economy has the potential to reduce the environmental impact. Ideally, priority would be given to reusing vapes and e-cigarettes over recycling them. Vape waste should be considered a resource, for the lithium they contain. Users, policymakers, and the industry must work together to create sustainable disposal channels for vapes and e-cigarettes. Read more: My teen's vaping. What should I say? 3 expert tips on how to approach 'the talk'","filter_flag":1}
{"title":"Ambiente: Kitchen Products & Materials - ArchiExpo","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZW1hZy5hcmNoaWV4cG8uY29tL2FtYmllbnRlLTIwMjMtaW5ub3ZhdGl2ZS1raXRjaGVuLWFuZC1jaXJjdWxhci1tYXRlcmlhbHMtZm9yLWZ1dHVyZS1kaW5pbmcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZW1hZy5hcmNoaWV4cG8uY29tL2FtYmllbnRlLTIwMjMtaW5ub3ZhdGl2ZS1raXRjaGVuLWFuZC1jaXJjdWxhci1tYXRlcmlhbHMtZm9yLWZ1dHVyZS1kaW5pbmcv0gEA?oc=5","id":"CBMiZWh0dHBzOi8vZW1hZy5hcmNoaWV4cG8uY29tL2FtYmllbnRlLTIwMjMtaW5ub3ZhdGl2ZS1raXRjaGVuLWFuZC1jaXJjdWxhci1tYXRlcmlhbHMtZm9yLWZ1dHVyZS1kaW5pbmcv0gEA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZW1hZy5hcmNoaWV4cG8uY29tL2FtYmllbnRlLTIwMjMtaW5ub3ZhdGl2ZS1raXRjaGVuLWFuZC1jaXJjdWxhci1tYXRlcmlhbHMtZm9yLWZ1dHVyZS1kaW5pbmcv0gEA?oc=5\" target=\"_blank\">Ambiente: Kitchen Products & Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ArchiExpo<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ambiente: Kitchen Products & Materials - ArchiExpo","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZW1hZy5hcmNoaWV4cG8uY29tL2FtYmllbnRlLTIwMjMtaW5ub3ZhdGl2ZS1raXRjaGVuLWFuZC1jaXJjdWxhci1tYXRlcmlhbHMtZm9yLWZ1dHVyZS1kaW5pbmcv0gEA?oc=5\" target=\"_blank\">Ambiente: Kitchen Products & Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ArchiExpo<\/font>","source.href":"https:\/\/emag.archiexpo.com","source.title":"ArchiExpo","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"We compiled a collection of exemplary products and circular materials on display at the Ambiente 2023 fair in Frankfurt. February 3-7, Frankfurt—Responsibility and sustainability were clearly the focus of this year’s Ambiente international consumer goods trade fair. Many of the kitchen innovations presented were made of reusable materials or manufactured in a climate-neutral way. Without a doubt, the development of an environmentally oriented and socially sustainable circular economy is part of the new mindset of the majority of manufacturers. In this article, we highlight three new products for an innovative kitchen and three circular materials for future dining. The three products include Fika pots and pans by the South Korean brand Neoflam, kitchenware and glassware by the Netherlands label Original Home and a cutting board and rolling pin by Italian company Marcato. On the side of circular materials, we discuss coffee grounds, cork and food waste. 3 new products for an innovative kitchen 3 circular materials for future dining [PRODUCT] Ivory & Pastels, Ceramic Coating Cookware: “Fika” Pots & Pans Fika. Courtesy of Neoflam. In the Cooking halls, the new Ceramic Coating Cookware from the South Korean label Neoflam was particularly eye-catching due to its colorful and healthy features: With the new 2023 edition “Fika”, the manufacturer focuses on the trend color beige and simplified geometric shapes – from saucepans with lids to rectangular models such as brunch pans or egg pans, a real eye-catcher for foodies and passionate cooks. The delicate, toned-down colors, from pastel shades to muted natural tones, succeed in capturing the zeitgeist as well. Not surprisingly, Neoflam was awarded the Red Dot winner 2020 design award for it. What is so special about the material? With ceramic coating, ceramic and lacquer are combined to form a uniform coating that is resistant to abrasion. This gives pans and pots a special non-stick property, similar to Teflon utensils. Unlike these, however, they allow healthy, non-toxic cooking without fat: in addition to the non-stick coating and high heat tolerance, this is also due to the fact that they are manufactured without plastic, lead and cadmium. The manufacturer, launched in 1999, originally started off with cutting boards and storage jars and is now developing its product lines step by step towards circular production with a growing awareness of sustainable cookware. [PRODUCT] Kitchenware from Teak Roots to Glassware Upcycling Reclaimed teak wood from Indonesia and upcycled glassware from Tanzania are at the center of Original Home’s current kitchenware collection: While the teak wood originates from root waste and is used for exquisite, natural-looking tableware such as spoons, mugs and coasters, trays and cutting boards, the glass carving craft from Tanzania is not only contributing to the reduction of tourism waste but also empowering women locally. The Dutch label, located close by Amsterdam, resources materials that were traditionally thrown away to produce novel and stunning designs from kitchenware to lampshades and candles. Seventy-five percent of the materials used stem from these supply chain leftovers, e.g. wax from India or cotton from Bangladesh. Courtesy of Original Home Courtesy of Original Home [PRODUCT] “Heritage Line” for Noodle Makers and Passionate Cooks While Italian pasta machine manufacturer Marcato has already been a firm institution for more than 90 years, the label is reinventing itself once again in 2023 with its particularly refined “Heritage line” made of solid Canadian walnut wood. At Ambiente, the high-quality cutting board and rolling pin for professional chefs were on display for the very first time. As for the intelligent cutting board, there is a removable stainless steel tray as a container for processed waste. The black overlay board is made of Richlite. If you have not encountered the noodle machine manufacturer yet, the carefully designed colorful range of manual and electrical pasta devices plus accessories for the multitude of existing pasta types is not to be missed. [MATERIAL] Coffee Grounds Reused A timeless wristwatch or a contemporary coffee cup made from old coffee grounds? Examples of this were shown by the Berlin-based manufacturer Kaffeeform as part of the special exhibition Circular Materials in Future Dining. Renewable coffee material consists of recycled coffee grounds and plant-based biopolymers. The producers emphasize on the fact that melamine resins, formaldehyde and plasticizers are completely avoided, a clear advantage over the conventional bamboo cups. Courtesy of Kaffeeform Courtesy of Kaffeeform [MATERIAL] Cork, a Renewable Resource For a long time, cork was considered a dying resource. Not so in the Mediterranean countries like Portugal, which continue to be rich in cork oaks. Moreover, no trees have to be felled to harvest cork bark because once removed, the bark grows back. Portuguese manufacturer VIKING, for example, takes advantage of this since 1995 and uses it to produce not only yoga supplies and bags, but also kitchen and tableware such as coolers for wine bottles, ice buckets and bottle holders, coasters and small kitchen stools. “It takes about nine years for the bark to grow back,” CFO Renato Espírito Santo explained during the event. [MATERIAL] Food Waste Becomes Biodegradable Design Objects Quite astonishing as well: 3D-printed “zero waste” objects made by Milan-based company Krilldesign with leftover food peels. “Duna”, a lemon fruit bowl, was made of saved lemon peels through a 3D-printing process and shown at the exhibition. Another orange peel collection is already part of the circular, on-demand production. Other artists showcased sustainable and biodegradable kitchen products made of eggshells, birch bark and avocado seeds; this included edible cutlery and takeaway items such as Cupffee, NomNom and Spoontainable.","filter_flag":1}
{"title":"Recycled glass incorporated into concrete - Quarry - Quarry","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnF1YXJyeW1hZ2F6aW5lLmNvbS8yMDIzLzAyLzIwL3JlY3ljbGVkLWdsYXNzLWluY29ycG9yYXRlZC1pbnRvLWNvbmNyZXRlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnF1YXJyeW1hZ2F6aW5lLmNvbS8yMDIzLzAyLzIwL3JlY3ljbGVkLWdsYXNzLWluY29ycG9yYXRlZC1pbnRvLWNvbmNyZXRlL9IBAA?oc=5","id":"CBMiVGh0dHBzOi8vd3d3LnF1YXJyeW1hZ2F6aW5lLmNvbS8yMDIzLzAyLzIwL3JlY3ljbGVkLWdsYXNzLWluY29ycG9yYXRlZC1pbnRvLWNvbmNyZXRlL9IBAA","guidislink":false,"published":"Mon, 20 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=51, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnF1YXJyeW1hZ2F6aW5lLmNvbS8yMDIzLzAyLzIwL3JlY3ljbGVkLWdsYXNzLWluY29ycG9yYXRlZC1pbnRvLWNvbmNyZXRlL9IBAA?oc=5\" target=\"_blank\">Recycled glass incorporated into concrete - Quarry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Quarry<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recycled glass incorporated into concrete - Quarry - Quarry","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVGh0dHBzOi8vd3d3LnF1YXJyeW1hZ2F6aW5lLmNvbS8yMDIzLzAyLzIwL3JlY3ljbGVkLWdsYXNzLWluY29ycG9yYXRlZC1pbnRvLWNvbmNyZXRlL9IBAA?oc=5\" target=\"_blank\">Recycled glass incorporated into concrete - Quarry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Quarry<\/font>","source.href":"https:\/\/www.quarrymagazine.com","source.title":"Quarry","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Recovered glass sand is being manufactured from the re-processing of kerbside glass from Canberra residents. The Lismore City Council has partnered with the NSW Environment Protection Authority (EPA) to trial the use of recycled glass in concrete. Working additionally with Graham’s Concrete and Southern Cross University, the initial trial is set to use crushed glass blended concrete to lay a new floor in a shed at the Lismore Recycling & Recovery Centre, with the the facility then planned to be used by Southern Cross University as a dedicated location to pilot further waste treatment and resource recovery technologies. Finding alternate uses for traditionally recycled products is a direction the community wants to head in, as Lismore City Council general manager John Walker said. “We are hopeful that this trial will demonstrate another successful use of glass sand,” Walker said, “this is a product that we can produce locally and is our preferred option over the associated cost and challenges that comes with recycling glass in the traditional way.” “By reusing material locally, this trial demonstrates Council’s transition to circular economy principles, a focus of our Resource Recovery and Residual Waste Strategy.” The project is a NSW EPA, ‘Waste Less Recycle More’ initiative funded from the state waste levy, with the grant allocation intending to support innovation in infrastructure, as EPA Director Circular Economy Programs Kathy Giunta stated. “More than $240,000 has been awarded to Lismore City Council to use glass from kerbside recycling in concrete. This will create a clever circular solution for local infrastructure needs like footpaths, kerbs, drains and roadways,” Giunta said. “Glass is a great option for reuse as sand as it won’t degrade over time and this project will help reduce emissions contributing to a more sustainable Lismore.” The use of recycled sand in concrete provides an alternative for sand and other aggregates, with strong sustainability benefits for businesses and projects utilising recycled materials. The shed will be used by Southern Cross University for several pilot projects as part of the ReCirculator program, which is funded by the Federal Government’s Strategic University Reform Fund. The Lismore Council’s vision for the creation and facilitation of a regional circular economy that diverts valuable materials away from landfill and back into new products, is something which aligns strongly with the views of Southern Cross University as Professor Andrew Rose, Academic Director of Southern Cross University’s ReCirculator Program shared. “We’re grateful to Council for the opportunity to jointly establish a pilot facility at the Lismore Recycling & Recovery Centre,” Rose said, “this will allow us to showcase innovative solutions to waste issues, and we look forward to working together with Council, local industry and the wider community to help create a circular Northern Rivers economy.” Future trials are planned test the use of recycled crushed glass in precast concrete products, with the outcomes of the trials set to be published by the NSW EPA in 2024.","filter_flag":1}
{"title":"How Are Phone Manufacturers Improving Their Sustainability? - Mazuma Mobile","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA","guidislink":false,"published":"Thu, 02 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=33, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">How Are Phone Manufacturers Improving Their Sustainability?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mazuma Mobile<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Are Phone Manufacturers Improving Their Sustainability? - Mazuma Mobile","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3Lm1henVtYW1vYmlsZS5jb20vYmxvZy9nZW5lcmFsL3Bob25lLW1hbnVmYWN0dXJlcnMtaW1wcm92aW5nLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5\" target=\"_blank\">How Are Phone Manufacturers Improving Their Sustainability?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mazuma Mobile<\/font>","source.href":"https:\/\/www.mazumamobile.com","source.title":"Mazuma Mobile","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Sustainability is at the forefront of every business owner’s mind worldwide. It is even more so for the manufacturers of smartphones. As the demand for phones grows, so does the demand for environmentally responsible products and the need to address the growing concern of e-waste internationally. At Mazuma, sustainability and providing new life for old phones is at the heart of our business. However, how much effort is being taken by the industry giants responsible for making the phones? We look at what actions are being taken, particularly with the two biggest giants in tech, to reduce the impact of smartphones on the environment. Recycling and reusing materials There are many ways the big manufacturers are improving production; the most important is using recycled materials. For instance, Samsung, the leading android phone manufacturer, uses ocean-bound plastics such as discarded fishing nets to produce plastic components within their Galaxy range of phones. They also use it for the casings and details of their wearable tech, such as earbuds and smartwatches. Apple, another big player in the world of phones, also reuses recycled materials to create its range of iPhones. For example, in 2021, 59% of all the aluminium Apple used within its products came from recycled sources. In addition, all new iPhones, iPads, AirPods and Macs feature 100% recycled tin in their main logic motherboard solder. However, one of the biggest issues faced by every phone manufacturer was the use of plastic. The most significant way the tech industry solves this problem is by using PCM plastic (Post Consumer Material). This plastic has already lived its life in the form of something else, such as plastic bottles and carrier bags. By recycling these everyday items, the plastic is made into pellets that can be remoulded into new products. The use of PCM is part of many industries’ efforts to aim for a circular economy in which products are put back into the circle of production with the help of phone recycling facilities like ours. Reducing the carbon footprint of your phone A carbon footprint measures the total amount of greenhouse gases emitted into the atmosphere due to human activities, including burning fossil fuels, deforestation, and other land use changes. It is often expressed in terms of equivalent tons of CO2 and is used to understand and quantify the environmental impact of individual activities, organisations, and entire countries. Samsung is promising to reduce carbon emissions with its range of smart technology, allowing users to lower their own carbon footprints with their product. They also offer their action plan, which addresses the risks within their carbon footprint and their goals to lower these each year to improve their sustainability. Apple also products that reduce the user’s carbon footprint, with the likes of their Apple TV box, which reduces carbon footprint by up to 34%. Apple has also been carbon neutral since 2020 and aims to have all their products carbon neutral by 2030. Companies can improve their carbon footprint in various ways, including carbon offsetting, strict supply chain management and renewable energy sources supplying factories and offices. Most large phone manufacturers are being transparent in their aims to become more sustainable each year, with reports and plans visible on their websites. So if you are ever curious about the business behind your tech, check them out before buying their products for a more eco-conscious purchase. Developing longer-lasting products We all remember the scandal from 2018, when the Italian competition authority investigated the big two phone brands and their curious updates, making some smartphones within their older collections obsolete. Both companies were fined, and although they claimed they were unaware of the issues caused to older phones by the updates, it sparked a debate on the ethical practices of making smart devices poorly designed for future updates. The issue with smartphones is that they have come a long way from when they first came out, and naturally, phones will get left behind. For example, the iPhone 14 is a long way more advanced than the iPhone 6S, so developing updates that suit both iPhones and everything in between is not entirely practical. However, instead of making the phones obsolete, the newer updates will simply leave the phone vulnerable due to a lack of support. Any updates will no longer harm your devices, but you will be at risk for cyber-attacks. So, if you have an older device, why not consider getting a good price for it now with our sell my iPhone services? Environmentally friendly packaging One of the biggest issues when buying a new phone was all the unnecessary packaging it came with. Like most tech, there was an array of plastic wrap, polystyrene and plastic shells to keep everything in place. This is not only a waste of resources but also a nightmare when it comes to bin day after Christmas. To combat this waste, many phone companies are addressing their packaging and what is really required for a new phone. The plugs are one of the most noticeable recent removals from the box of new phones. Although these are essential for providing power for your phone to charge, most homes already have an abundance of them from previous phones and devices. Many homeowners are also changing their plug sockets to USB-compatible sockets removing the need for plugs altogether. This allowed many big brands of phones to take the plug out of the box, which helped to reduce unnecessary e-waste and even made the box much smaller, needing fewer materials. If you have bought a phone recently, you may have noticed very little printed on the box. In fact, if you were to buy a Samsung TV, you would see it is almost entirely brown with minimal information. Lack of printing helps reduce the ink needed to print onto the box, which also became an issue when the box needed to be recycled. This new basic design is much more environmentally friendly and can be done using pre-recycled materials. Next time you get a new phone, consider what is missing since the last time you bought one. Companies are working throughout the entire supply chain to reduce unnecessary packaging for products. Even the instruction booklet which comes with your shiny new phone is minimal, with everything else accessible online through the help of QR codes and links. The change is minimal but has greatly impacted the waste produced and the overall carbon footprint of a device. Trade-in services and phone recycling Obviously, achieving a circular economy, the aim of most tech industries, can only be made possible by selling your old phone back to the manufacturer. Most big names in phones will offer some form of a phone trade-in when you upgrade to help minimise the products heading to landfill and allow them to recycle the parts within their new phones. However, whilst we may not be able to manufacture the latest iPhone or Galaxy S24 (although you can buy many of the latest phones through our refurbished phones site), we do know a thing or two about recycling. Much like the industry’s tech giants, we at Mazuma are also looking to achieve a more sustainable planet. Our mission is to provide new old phones with new life due to programs such as our incredible Samsung trade-in services. Unlike the big names, recycling phones is our only mission, which means we are pretty much the experts. We offer some of the best prices online for many iPhones and android phones instead of a set figure. So, for example, when you sell an iPhone with us, we don’t provide you discounts or money off a new product; we offer you cash directly to your bank, often the same day we get your phone. By selling your broken phones with Mazuma, you are still contributing to the circular economy, but you are getting more money for your device and no pressure from us to buy a new one. Our services are straightforward, easy, and honest. So when it comes to trading in your phone to help promote a sustainable future, make sure you are doing so with someone who is an expert in recycling phones.","filter_flag":1}
{"title":"Uniqlo's Remake & Repair Service Engages Customer trust, Pushes to Extend Product Life | NIKKEI ESG Management ... - 日経BP","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvbmV3cy81NS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvbmV3cy81NS_SAQA?oc=5","id":"CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvbmV3cy81NS_SAQA","guidislink":false,"published":"Wed, 22 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=53, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvbmV3cy81NS_SAQA?oc=5\" target=\"_blank\">Uniqlo's Remake & Repair Service Engages Customer trust, Pushes to Extend Product Life | NIKKEI ESG Management ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Uniqlo's Remake & Repair Service Engages Customer trust, Pushes to Extend Product Life | NIKKEI ESG Management ... - 日経BP","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNGh0dHBzOi8vcHJvamVjdC5uaWtrZWlicC5jby5qcC9FU0cvYXRjbC9lbmcvbmV3cy81NS_SAQA?oc=5\" target=\"_blank\">Uniqlo's Remake & Repair Service Engages Customer trust, Pushes to Extend Product Life | NIKKEI ESG Management ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">日経BP<\/font>","source.href":"https:\/\/project.nikkeibp.co.jp","source.title":"日経BP","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Fast Retailing is offering repair and remake services aimed at realizing a circular economy through extending the life of its products. \"We want to make the circular economy a reality across our entire business model,\" asserted Koji Yanai, Director of the Board and Group Senior Executive Officer, at a Fast Retailing sustainability briefing held in November 2022. Targeting 50% Recycled Materials by 2030 As a part of its sustainability efforts, the owner of the clothing store Uniqlo, is expanding its lineup of products made from recycled materials. In 2022, the ratio of used materials with low greenhouse gas emissions, including recycled fabrics, accounted for roughly 5% of all textiles used. However, the goal is to raise the use of recycled resources to 50% by 2030. The fashion retailer has started repair and remake services that include mending rips and holes. In September, Uniqlo opened a space dedicated to Re.Uniqlo Studio at its Regent Street store in the U.K. In October, the service was also offered for a limited time in Japan at the Chitosedai store in Tokyo's Setagaya area. \"It has been very popular with our customers. We want to expand the service worldwide,\" Yanai shared enthusiastically. In the future, the company will also consider collecting clothes that are no longer worn by customers for distribution among those in need, or for resale. Re.Uniqlo Studio at the Regent Street store in London, U.K. Jun Kawahara, senior analyst at Equity Research Department, Daiwa Securities, said that, \"Uniqlo has increased its European market share thanks to its high quality and trend-defying designs, This also led to a record high for sales in Europe totalling about 130 billion yen (roughly $990 million) in the fiscal year ending August 2022. Increasing the life of products is an added strength for the brand.\". Extending the life of products might also affect sales of new products. \"I think it's important for consumers to remember the brand as being helpful when there is an issue with clothing. Business opportunities are created by customers feeling that they should head to Uniqlo when they need to buy clothes because of the services offered. I am not concerned about lost sales of new products,\" explained Yanai. Koji Yanai, Director of the Board and Group Senior Executive Officer of Fast Retailing, presents products made using recycled materials. An ‘eco' approach will likely bring rewards. Takahiro Kazahaya, Senior Analyst, Equity Research Department, Credit Suisse Securities (Japan) said, \"As Japan's population continues to decrease, a sustainability-oriented business strategy is essential to maintain and expand the company's 10% share of the domestic apparel market as the industry leader.\" So, can sustainability be a new axis for gaining the competitive edge while leading the firm to further growth? Now is a critical moment that will play a role in determining the outcome. PHOTOS: Fast Retailing","filter_flag":1}
{"title":"Polymer expert turns waste into biodegradable materials to create a circular economy | Chemical Engineering - University of Waterloo","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdXdhdGVybG9vLmNhL2NoZW1pY2FsLWVuZ2luZWVyaW5nL25ld3MvcG9seW1lci1leHBlcnQtdHVybnMtd2FzdGUtYmlvZGVncmFkYWJsZS1tYXRlcmlhbHMtY3JlYXRl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdXdhdGVybG9vLmNhL2NoZW1pY2FsLWVuZ2luZWVyaW5nL25ld3MvcG9seW1lci1leHBlcnQtdHVybnMtd2FzdGUtYmlvZGVncmFkYWJsZS1tYXRlcmlhbHMtY3JlYXRl0gEA?oc=5","id":"CBMiaGh0dHBzOi8vdXdhdGVybG9vLmNhL2NoZW1pY2FsLWVuZ2luZWVyaW5nL25ld3MvcG9seW1lci1leHBlcnQtdHVybnMtd2FzdGUtYmlvZGVncmFkYWJsZS1tYXRlcmlhbHMtY3JlYXRl0gEA","guidislink":false,"published":"Thu, 02 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=33, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdXdhdGVybG9vLmNhL2NoZW1pY2FsLWVuZ2luZWVyaW5nL25ld3MvcG9seW1lci1leHBlcnQtdHVybnMtd2FzdGUtYmlvZGVncmFkYWJsZS1tYXRlcmlhbHMtY3JlYXRl0gEA?oc=5\" target=\"_blank\">Polymer expert turns waste into biodegradable materials to create a circular economy | Chemical Engineering<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Waterloo<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Polymer expert turns waste into biodegradable materials to create a circular economy | Chemical Engineering - University of Waterloo","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vdXdhdGVybG9vLmNhL2NoZW1pY2FsLWVuZ2luZWVyaW5nL25ld3MvcG9seW1lci1leHBlcnQtdHVybnMtd2FzdGUtYmlvZGVncmFkYWJsZS1tYXRlcmlhbHMtY3JlYXRl0gEA?oc=5\" target=\"_blank\">Polymer expert turns waste into biodegradable materials to create a circular economy | Chemical Engineering<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Waterloo<\/font>","source.href":"https:\/\/uwaterloo.ca","source.title":"University of Waterloo","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Economy\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Professor Tizazu Mekonnen Professor Tizazu Mekonnen recently shared his expertise in creating biodegradable polymers in a CTV news report on CTK Bio Canada. CTK Bio Canada is a company whose mission is to create bioplastics with waste by-products to combat climate change. The partnership between Mekonnen and CTK Bio began three years ago when CTK Bio Canada’s Chief Operating Officer, Daniel Shum reached out after reading one of Mekonnen’s publications on polymer synthesis. “CTK Bio's partnership with Professor Mekonnen has been innovative and disruptive,” says Shum. “Professor Mekonnen has gone above and beyond to understand our business needs and bridge the gap between academia and industry. Professor Mekonnen has extensive knowledge around sustainability and a strong understanding of biopolymers that will benefit society.\" Mekonnen has contributed to CTK Bio Canada’s process design, molecular design, testing methods, and research and development approach. Two post-doctoral fellows working with Mekonnen helped to innovate these new products. Arvind Gupta, who was working with Mekonnen at the University of Waterloo is now a senior researcher at CTK Bio Canada. Parinaz Ateien who completed her PhD in chemical engineering under the supervision of Professor and University Research Chair Michael Tam is also working with CTK Bio Canada under Mekonnen’s direction. She designs molecules and creates materials engineered for specific applications. Initially, Mekonnen, a professor in the Department of Chemical Engineering, designed biodegradable cosmetic containers and packaging. Then expanded to create biodegradable plastic cutlery and lunch boxes. Plastic waste is a serious ecological issue. It litters the environment, contaminates water bodies, and contributes directly to greenhouse gas emissions. Plastic generates methane as it decays in landfills, contributing to global warming. “Utilizing waste for bioplastic production avoids the feedstock competition with food production while concurrently bringing plastic sustainability and is considered the holy grail of solving our environmental pollution problem,” says Mekonnen, who also serves as IBET Director. The raw materials Mekonnen uses to create bioplastics come from plant-derived materials and from plastic waste. Bioplastics can degrade the in the environment and the residue can be used as compost or biofertilizer thereby creating a circular economy. Chemical Engineering professor and Waterloo Endowed Chair in Nanotechnology Boxin Zhao is also engaged in polymer research. His work seeks to find a long-term strategic method to utilize microplastics from the environment to create biobased materials. He is investigating ways to treat microplastics that would allow microorganisms to ingest them and excrete a bioploymer. Mekonnen says, “Plastics are incredibly useful and beneficial to society. The complete eradication of plastics would lead to other challenges, which may also harm the environment. So, we must find ways to produce and process plastics sustainably for the betterment of society.”","filter_flag":1}
