{"title":"Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd. - Energetica India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA","guidislink":false,"published":"Thu, 03 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=215, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5\" target=\"_blank\">Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd. - Energetica India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS92YXJpbmRlci1iaGF0aWHSAQA?oc=5\" target=\"_blank\">Varinder Bhatia, Joint Vice President- Sales (Solar) at Havells India Ltd.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","source.href":"https:\/\/www.energetica-india.net","source.title":"Energetica India","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Adoption\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"August 03, 2023. By News Bureau Solar energy is the future. With the government's push towards renewable energy and the increasing awareness among consumers, the demand for solar products will continue to grow. Havells is closely working with the stakeholders and has started investing aggressively to offer the right solar solution to its customers. The company’s flagship solar grid tie inverter can be seen in more than 30000 homes and industries, shared Varinder Bhatia, Joint Vice President- Sales (Solar), Havells India Ltd. in an interview with Anurima Mondal, Associate Editor, Energetica India. Que: Please give us an overview of the Indian solar industry. Ans: India's solar industry has flourished over the years, thanks to the government's unwavering commitment to sustainable energy. The initiative to boost domestic production of solar equipment is a move to reduce dependence on imports and spur the adoption of solar technology. The Jawaharlal Nehru National Solar Mission (JNNSM) has played a crucial role in attracting foreign investment and facilitating the development of large-scale solar projects across the country. Renewable energy adoption boosted the economy and also created job opportunities. The 'Make in India' campaign has attracted additional investment and enhanced India's image as a global player in renewable energy. It's reassuring to see the positive impact of these efforts, as more and more companies are setting up production units, creating jobs and contributing to the country's growth story. The solar industry's progress is a testament to the power of innovation and collaboration, and we are excited to see what the future holds as we continue to push toward a greener, cleaner future. Que: Could you shed some light on Havells and its product range in the solar segment? Ans: At Havells, we keep striving to contribute to the growth of the Indian solar sector. We have been closely working with the stakeholders and have started investing aggressively to offer the right solar solution to our customers. Our flagship solar grid tie inverter can be seen in more than 30000 homes and industries. We offer both off-grid and on-grid solutions to our consumers. We have also partnered with SBI as funding support for our MSME customers to adopt solar. Our research & innovation team is committed to designing and offering world-class solar solutions. Soon, we are planning to launch an inverter that will be an edge in terms of technology. Que: What steps do you take to ensure quality products for the domestic and international markets? Ans: We have established state-of-the-art manufacturing facilities that are equipped with the latest technologies and equipment. Our manufacturing processes are strictly monitored to ensure that our products are of the highest quality and meet all relevant safety standards. We are seventh in Dow Jones Sustainability Index and have been rated as ‘Strong’ by Crisil. We also invest heavily in research and development to stay ahead of the curve and incorporate the latest technologies into our products. Our R&D teams work tirelessly to develop new products that are energy-efficient, eco-friendly, and meet the evolving needs of our customers. We offer some of the highly engineered off-grid solutions addressing customers’ pain points. Our state-of-the-art grid-tie inverters have the highest warranty in the industry, which is a testament to the robust product we offer to our customers. In addition, we have implemented rigorous quality control measures at every stage of the manufacturing process. Our products undergo multiple tests and inspections to ensure that they meet the highest standards of quality and safety. Que: What is your future roadmap? Ans: We believe that solar energy is the future, and we are committed to playing an active role in promoting its adoption. With the Government of India's push towards renewable energy and the increasing awareness among consumers, we are confident that the demand for solar products will continue to grow. In the near future, we plan to expand our solar product portfolio and offer innovative solutions that are both reliable and cost-effective. We are committed to offering the best services in the industry. With our strong channel network, we want to reach every category of customers across the country. Our aim is to provide value-based offerings solving customer needs. Que: How do you think have the government initiatives helped the Indian solar sector? Ans: The Indian government implemented several initiatives to promote the use of solar energy, including the 'Make in India' campaign, the National Solar Mission, and other policies. These efforts have attracted strong investment from large Indian houses & FDI. This has led to an increase in domestic solar panel production. India aims to achieve 110 GW in module manufacturing capacity by 2026 which is currently at 18 GW. India has already achieved 175 GW of renewable energy and it aims to achieve 450 GW by 2030. The govt. has taken a big initiative by introducing the PLI scheme to promote domestic manufacturing of solar components. Over INR 45000 crore has been allocated for solar PV manufacturing under the PLI scheme. Apart from this, solar direct subsidy transfer has been initiated by the government through the launch of the solar rooftop national portal. For residential consumers, the government is providing a 40 percent subsidy on less than 3 KW system and a 20 percent subsidy on more than 3 KW to 10 KW system. Today, India is one of the top five countries globally in terms of installed solar capacity. The steep climb in the installed solar capacity is a testament to the success of the government's efforts. Que: How can the PLI scheme establish Indian solar manufacturing companies to meet the global solar demand? Ans: The Production Linked Incentive (PLI) scheme is a game-changing initiative by the Indian government to boost the manufacturing industry and establish India as a major player in the global solar market. The scheme's primary aim is to promote domestic production by offering financial incentives to Indian enterprises that manufacture solar equipment. This would not only assist in minimizing import dependence but will also create job possibilities and national manufacturing champions. As a result, Indian companies will be better equipped to vie with their foreign counterparts in areas such as pricing and product excellence, all the while satisfying the rapidly escalating global requirement for solar energy. Additionally, the program will foster a robust ecosystem for procuring vital materials needed in the solar industry, ones that are of Indian origin. Que: As a joint report from the Institute for Energy Economics and Financial Analysis (IEEFA) and JMK Research and Analytics, India has the potential to become the world’s second-largest solar manufacturer by 2026. What are your views on it? Ans: We are proud to be a part of India's solar industry and are optimistic about its growth potential. It’s exhilarating to witness the potential for India to become the world's second-largest solar manufacturer by 2026, as outlined in the joint report from the Institute for Energy Economics and Financial Analysis and JMK Research and Analytics. This is a testimony to the tremendous growth potential of the Indian solar industry and the immense talent and potential of our workforce. We are dedicated to actively aiding this expansion and making significant contributions to India's path towards a more sustainable and eco-friendly future. Our engineers are relentlessly working on designs to offer the next generation off-grid & on-grid solar products. We aim to be the topmost solar company in the industry delivering some of the world-class solution to both contractors & end users in the days to come. Que: How do you see the Indian solar market expanding in the future? Ans: India has been taking big strides towards achieving a sustainable future with renewable energy. Our nation has made significant progress in the global RE scenario, but we believe that there is still more work to be done. What gives us an edge is our commitment to innovation and technology which has allowed us to harness the power of the sun and wind. However, we need to continue investing in R&D and infrastructure to keep up with the growing demand for clean energy. As a leading player in the Indian solar industry, we are proud to be contributing to this transition towards a greener future. Que: How do you see the Indian solar market expanding in the future? Ans: India has been taking big strides towards achieving a sustainable future with renewable energy. Our nation has made significant progress in the global RE scenario, but we believe that there is still more work to be done. What gives us an edge is our commitment to innovation and technology which has allowed us to harness the power of the sun and wind. However, we need to continue investing in R&D and infrastructure to keep up with the growing demand for clean energy. As a leading player in the Indian solar industry, we are proud to be contributing to this transition towards a greener future.","filter_flag":1}
