{"title":"Renaissance in Uncertainty: Luxury Builds on Its Rebound - Bain & Company","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL3JlbmFpc3NhbmNlLWluLXVuY2VydGFpbnR5LWx1eHVyeS1idWlsZHMtb24taXRzLXJlYm91bmQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL3JlbmFpc3NhbmNlLWluLXVuY2VydGFpbnR5LWx1eHVyeS1idWlsZHMtb24taXRzLXJlYm91bmQv0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL3JlbmFpc3NhbmNlLWluLXVuY2VydGFpbnR5LWx1eHVyeS1idWlsZHMtb24taXRzLXJlYm91bmQv0gEA","guidislink":false,"published":"Tue, 17 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=17, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL3JlbmFpc3NhbmNlLWluLXVuY2VydGFpbnR5LWx1eHVyeS1idWlsZHMtb24taXRzLXJlYm91bmQv0gEA?oc=5\" target=\"_blank\">Renaissance in Uncertainty: Luxury Builds on Its Rebound<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Renaissance in Uncertainty: Luxury Builds on Its Rebound - Bain & Company","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJhaW4uY29tL2luc2lnaHRzL3JlbmFpc3NhbmNlLWluLXVuY2VydGFpbnR5LWx1eHVyeS1idWlsZHMtb24taXRzLXJlYm91bmQv0gEA?oc=5\" target=\"_blank\">Renaissance in Uncertainty: Luxury Builds on Its Rebound<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bain & Company<\/font>","source.href":"https:\/\/www.bain.com","source.title":"Bain & Company","query":"https:\/\/news.google.com\/rss\/search?q=\"Secondhand Sales\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Executive summary The global luxury goods market took a leap forward in 2022, despite uncertain market conditions. The industry is poised to see further expansion next year and for the rest of the decade to 2030, even in the face of economic turbulence. These are key findings from the 21st edition of the Bain & Company-Altagamma Luxury Study, a collaboration between Bain & Company and Fondazione Altagamma, the trade association of Italian luxury goods manufacturers. The overall luxury industry tracked by Bain & Company encompasses both luxury goods and experiences. It comprises nine segments, led by luxury cars, luxury hospitality, and personal luxury goods, which together account for more than 80% of the total market. After a severe contraction in 2020 due to the Covid-19 pandemic, the market grew back to €1.15 trillion in 2021 and surprised everyone in 2022 by further growing 19%–21%, according to our estimates. Luxury spending continued to skew toward products, with steep growth in personal luxury goods and more moderate growth in experience-based goods. Spending on experiences will be the last luxury outlay to recover historical highs given its reliance on the resumption of international tourism and business travel. The market for personal luxury goods—the “core of the core” of luxury segments and the focus of this analysis—saw impressive growth in 2022, coming on the heels of the V-shaped Covid rebound enjoyed in 2021. Despite worsening macroeconomic indicators globally and specific challenges in China, the sector performed strongly across quarters, and it is likely to have reached €353 billion in retail sales value in 2022, marking an advance of 22% at current exchange rates (or 15% at constant exchange rates) vs. 2021. In 2022, we estimate that 95% of brands experienced positive growth, but most luxury players continued to invest for the future, which resulted in a slight erosion of average profitability following an unprecedented increase in 2021. Luxury in 2023: More resilient to recession than in 2009 Despite recessionary conditions expected across leading economies in 2023, personal luxury goods should see further expansion. The impact of a possible global recession on the industry in 2023 could differ from the impact of the 2008–09 global financial crisis. The luxury market now appears better equipped to cope with economic turbulence, thanks to a consumer base that is both larger and more concentrated on top customers who are less sensitive to downturns. The customer centricity honed in recent years is another source of resilience for the industry, as is the multi-touchpoint ecosystem that luxury has developed. As a result, two scenarios could play out in 2023, with sales growth in the personal luxury goods market ranging from 3% to 5% in the base case and up to 6% to 8% (at constant exchange rates) in a more positive case, depending on the strength of economic recovery in China and the ability of the US and Europe to withstand economic headwinds. Old markets lead, but newcomers surprise The US luxury market proved very strong in 2022. Europe managed to recover beyond pre-Covid 2019 levels thanks to solid domestic demand, alongside a boost from US and Middle Eastern tourist shoppers. Meanwhile, China, which remains crucial to the long-term future of the luxury market, was challenged due to Covid lockdowns, and sales are likely to be down vs. 2021. China’s luxury market is expected to recover by the second half of 2023. Southeast Asia and South Korea have been excelling in both growth and future potential. Although there will never be “another China” in terms of growth contribution to the industry, new markets (such as India and emerging Southeast Asian and African countries) have significant potential, assuming their luxury shopping infrastructure can evolve quickly enough. Among the rising stars, India stands out; its luxury market could expand to 3.5 times today’s size by 2030. Stores win back their role Retail continued to grow faster than wholesale and reached parity in terms of market share. Meanwhile, the online channel’s market share is normalizing. The coming years will see a further blurring of the boundaries between monobrand outlets and e-commerce, which will increasingly push brands to take an “omnichannel 3.0” approach, enabled and enhanced by new technologies. Outperformance of all categories All personal luxury goods categories have now recovered to 2019 levels or better, with hard luxury, leather, and apparel leading the resurgence following the pandemic. A deliberate (and effective) elevation strategy has driven a progressive price increase across the leather category—accounting for about 60% of 2019–22 growth—without damaging volume growth. Expanding, yet elevated, customer base The luxury market’s consumer base will expand from some 400 million people in 2022 to 500 million by 2030. The share of top customers has been expanding and accounted for some 40% of market value in 2022, compared with 35% last year. These consumers are hungry for unique products and experiences, putting brands’ VIC (very important client) strategies into overdrive. Strong generational and technology trends to reshape the market through 2030 The prospects for personal luxury goods out to 2030 are positive. Solid fundamentals are set to boost the market’s value to between €540 billion and €580 billion by the end of the present decade, from an estimated €353 billion in 2022—a rise of 50% or more. A powerful factor for sector growth this decade will be generational trends. Generation Y (millennials) and Generation Z accounted for all of the market’s growth in 2022. The spending of Gen Z and the even younger Generation Alpha is set to grow three times faster than other generations’ through 2030, making up a third of the market. This reflects a more precocious attitude toward luxury, with Gen Z consumers starting to buy luxury items some three to five years earlier than millennials did (at 15 vs. at 18–20); Gen Alpha is expected to behave in a similar way. New types of activities, often powered by technology, should also spark an additional €60 billion to €120 billion in sales by 2030, from sources such as the metaverse and brand-related media content. 1. Luxury spending trends in 2022 The overall luxury market tracked by Bain & Company comprises nine segments: luxury cars, personal luxury goods, luxury hospitality, fine wines and spirits, gourmet food and fine dining, high-end furniture and housewares, fine art, private jets and yachts, and luxury cruises. Luxury cars, luxury hospitality, and personal luxury goods together account for 80% of the total market. Overall, we estimate that in 2022 the luxury market’s overall retail sales value grew by 19%–21% to €1.38 trillion, or 8%–10% above 2019 levels. All segments gained momentum, but only luxury hospitality and cruises haven’t yet closed the gap with pre-Covid levels. Sales of luxury cars, the biggest portion of the overall market, hit a new record, reaching an estimated €566 billion, 6% more than 2021 at current exchange rates and 3% above 2019. Luxury cars are still subject to supply chain disruption, with component shortages further heightened by the Russia-Ukraine war. In Europe, high-end Asian automakers, particularly Chinese brands, have gained share from local rivals. As consumer interest in greener vehicles grows, along with government encouragement, premium car manufacturers have focused on larger models, to ease the higher cost of electric-car components. Demand for personalization and digital connectivity rose. Consumer expectations for service levels are rising too, with brands embracing direct-to-consumer models to create a more luxurious shopping experience at every stage. The luxury hospitality market surged to an estimated €191 billion, more than doubling in value in 2022. In spite of 110% year-over-year growth at current exchange rates, sales were still down 7% from their 2019 level. Growth was steady across regions as people finally realized travel ambitions previously blocked by Covid, using money they couldn’t spend on trips during the pandemic. However, Chinese lockdowns, a continued shortfall in international Asian tourism, and limited business travel constrained total market growth. Travelers were lured not just to leading cities but also to out-of-the-way destinations, in keeping with the pandemic trend to seek rural solitude. Intuitive service that goes beyond merely offering “the human touch” is becoming more crucial, and operators are increasingly looking to technology to automate predictable tasks and free employees to focus on the most important interactions. Sales of fine wines and spirits hit €96 billion, up 16% on 2021. Spirits grew faster than wine, with “status spirits” growing internationally and across categories, tapping into usage occasions once reserved for wines. Sparkling wine (and not just Champagne) gained share over still. Gourmet food and fine dining grew 12% at current exchange rates to €57 billion, completing its recovery to prepandemic levels, as social restrictions were lifted across major cities. The pandemic-fueled interest in consuming gourmet food at home continued, boosting select food retailers and fostering demand for culinary education. The high-end furniture and housewares market reached €53 billion, up 13% from 2021. The growth was fueled by the greater emphasis consumers have been placing on their home life—as both shelter and source of self-definition—since the pandemic. Lighting and living\/bedroom categories benefited the most, as consumers looked for more comfort, functionality, and beauty. Demand for high-end furniture and fixtures in commercial spaces was driven by an increasing appetite for refined aesthetics and higher quality. The fine art market grew 13% to €39 billion, as the ranks of potential buyers swelled and new Asian art hubs strengthened. Art benefited from being seen by the wealthy as an alternative asset to hedge against volatility in financial markets. In keeping with greater social interest in diversity, equity, and inclusion, galleries and collectors focused more on areas such as women artists and African art. The nonfungible token (NFT) market stabilized after a wave of speculative interest from investors. Art-based NFTs still represent a limited—albeit expanding—portion of the overall market; artists are looking for ways to meaningfully integrate NFTs into fine arts. Sales of private yachts and jets grew by 18% at current exchange rates relative to 2021, reaching €26 billion. Luxury yacht orders rose to a record level, amid solid growth in deliveries. Interest from high-net-worth individuals continued to rise, reflecting a desire for deeper connections with nature and comfort; designs increasingly reflect these preoccupations, through features such as enlarged stern areas or a preference for explorer yachts able to sail to the remotest areas. Sustainability remains a focus for both consumers and shipyards, from greener propulsion systems to design-for-disassembly solutions that make yacht materials more recyclable. Wealthy individuals turned to private jets more in 2022, due to their perceived safety and efficiency vs. commercial travel. However, rising sustainability concerns, coupled with increased operational costs, narrowed the potential customer base and restricted airplane utilization rates. When segmented into goods vs. experiences, spending continued to skew to tangible products in 2022. The steepest growth rate between 2019 and 2022 belonged to personal luxury goods, followed by experience-based goods, such as fine art and luxury cars. Demand for luxury experiences has been improving, but this segment will be the last of the three to regain its 2019 levels, probably in 2023. The market for personal luxury goods—the heart of the entire luxury industry—enjoyed another year of strong double-digit growth. Sales are set to hit a new record in 2022, with the market forecast to grow by 22% at current exchange rates to €353 billion. The most likely outcome in the fourth quarter of 2022 is a 19% year-over-year rise in sales, which would be a slight slowdown from 23% growth in the third quarter. Figure 1 The global luxury market has fully recovered from the Covid-19 crisis, having grown 8%–10% over 2019 Figure 2 Personal luxury goods and experience-based goods have driven the post-Covid recovery; luxury experiences are still lagging but on a positive trajectory Figure 3 After 2021’s V-shaped rebound, 2022 set a new record for personal luxury goods sales, despite broader turbulence and uncertainty Figure 4 The 2022 holiday season is hard to predict, due to a strong performance in 2021, possible macroeconomic headwinds, and China’s gradual recovery 2. Regional highlights The global ranking of luxury sales by region changed in 2022, as the Americas regained the top position for personal luxury goods sales. Asia (excluding Japan) switched to second position, followed by Europe. The personal luxury goods market reached an estimated €113 billion in the Americas, growing 25% over 2021. Performance was particularly robust in the first half of the year. In the United States, traditional luxury hubs gradually returned to growth while suburban areas retained their new prominence as a source of luxury sales. Latin America experienced solid growth, especially in Mexico and Brazil. Asia surged by 43% when mainland China and Japan were excluded, reflecting the booming performance of Thailand and other Southeast Asian countries, as well as a stellar year for South Korea, which narrowed the gap with Japan in terms of market size. Hong Kong and Macau were weaker spots, while Taiwan slowly recovered. In contrast, Mainland China lost a little ground, dropping 1% from 2021. The market was constrained by prolonged Covid lockdowns in the second quarter, which affected consumer confidence and resulted in lackluster performance across all categories and channels (including online). We observed a rebound when and where Covid restrictions were lifted, yet not enough to offset the performance of the second quarter. Consumption was very strong in Europe. All markets fared well throughout the year, aided by healthy domestic demand and the return of tourists from the US and Middle East. The spending of US tourists in Europe doubled between 2019 and 2022; about two-thirds of that gain reflected an increase in transactions while the other third came from an increase in average transaction size, according to Global Blue data. Italy and France were the 2022 growth champions, followed by Turkey, the UK, and Spain, while Germany softened. The Russian market was mostly inactive due to war-related suspension of operations. Japan grew by 18% at current exchange rates to €24 billion, finally catching up to its pre-Covid level. Local Japanese consumption was solid, and the market also benefited from the return of tourists after the country reopened to visitors. Although there will never be “another China” in terms of outsize growth contribution to the industry, India and emerging Southeast Asian and African countries have significant potential, if the luxury industry’s infrastructure (such as malls) and regulation can evolve quickly enough in those markets. India stands out; its luxury market could expand to 3.5 times today’s size by 2030, propelled by younger customers and an expanding upper and middle class. Figure 5 The Americas were back to being the biggest region for personal luxury goods sales; Europe grew the fastest Figure 6 European and American customers showed a renewed appetite for luxury in 2022, as did Asian markets outside of China and Japan Figure 7 The US remained the largest market, while sales in South Korea, France, and the UK were highly concentrated in a single city Figure 8 Europe surpassed its 2019 levels, thanks to strong domestic demand and an extra boost from tourists Figure 9 Emerging countries are poised to gain about 70 million mid- and high-income consumers (40% of China’s increase since 2014) 3. Distribution trends Brands continued to exert more control over their distribution, with directly operated channels increasing in importance again. The retail channel has now reached parity with the wholesale channel. Monobrand stores were boosted by the willingness of customers to return to in-person shopping. Online sales rose 20% from 2021 to 2022 to reach an estimated €75 billion. The online channel's market share remained in line with 2021. Monobrand websites gained further ground, raising their share to about 45% of the online segment, up from 43% in 2021. Department stores experienced faster growth than in previous years, gaining 20%. That reflected a renewed value proposition in the US and successful reengagement with tourists in Europe. The secondhand luxury goods market rose to €43 billion in 2022. Sales growth accelerated to 28%, equivalent to 1.3 times the growth rate for new luxury goods. That ratio has come down from 3.4 times in 2018. The US and Europe still command the lion’s share of the market, but Asia (especially China) accelerated as consumer acceptance increased. Internationally, secondhand growth was aided by sustained demand for watches, which account for 60%–70% of the total market. As sales of secondhand goods on online platforms soared, brands are moving to increase their direct control of the market. Figure 10 Owned retail gained further ground and is now on par with wholesale Figure 11 Monobrand stores saw strong growth in 2022 while the online channel's market share normalized; travel retail was revitalized but remains far below prepandemic levels Figure 12 The online luxury market grew at double-digit rates, in line with the overall market; monobrand online stores continued to gain share Figure 13 The secondhand luxury market continued to expand 4. Individual category performance All personal luxury goods categories performed well in 2022, with double-digit growth rates across the board. All categories have now recovered to 2019 levels or better, with hard luxury, leather goods, and apparel leading the resurgence following the pandemic. Accessories remained the largest personal luxury goods category and grew by 21%–23%. Within accessories, leather goods grew by 23%–25%, far surpassing its pre-Covid levels (up 39%–41% compared with 2019). Iconic models and new hero products were the most desirable items. Recognizable brand signifiers (whether a shape, a piece of metalware, a material, or a monogram) remained popular. Small leather goods gained further traction. The leather goods category has benefited from a generalized price increase (from the most expensive products to entry-level items) that didn’t hamper volume growth. Between 2021 and 2022, about 70% of leather category growth has been driven by price increases; by contrast, price increases accounted for only about 50% of category growth from 2019 to 2021. The apparel category grew by 22%–24% in 2022, aided by wardrobe restocking. Womenswear and menswear grew at about the same pace. “Post-streetwear” is emerging as the new look. It maintains some elements of streetwear (such as gender fluidity, a disregard for occasion, inclusiveness, and sports-driven inspiration), but goes beyond its style codes through new and enhanced techniques, materials, and functions. Beauty reached €69 billion, up a “mere” 14%–16% on 2021 (but still double its pre-Covid growth rate in 2019). The makeup and fragrances categories led growth. Travel retail is in recovery mode, at least in Western markets, but not yet back on its pre-Covid track. Watches have evolved from a challenged category to the new object of desire. Sales of new watches grew by 22%–24% and reached a record €52 billion, reflecting solid demand for top-of-the-range models and iconic pieces, but growth was capped by low product availability. Sales of secondhand watches, estimated at an additional €25–€30 billion, rapidly grew in 2022, fueled by the appetite of Generation Z and millennials for investment and resale opportunities, given the high resilience of the category during crises. Jewelry sales in 2022 are estimated to have risen to €28 billion, up 23%–25% from 2021. Brands invested heavily (and successfully) to fuel demand. “Uber-luxury” jewelry outperformed globally, as did iconic pieces and lines. Fashion jewelry showed solid growth. Shoes grew by 20%–22% compared with 2021 to reach €28 billion. Heels and formal shoes are now back to their 2019 levels. Casual categories, such as fussbett sandals and Wellington boots, are on the rise. Figure 14 Accessories remained the largest category while apparel and hard luxury grew the fastest Figure 15 All categories have well exceeded their 2019 levels Figure 16 Luxury watches have been rediscovered and moved from a challenged category to the new object of desire 5. Outlook for the future Luxury brands have faced three years of tremendous turbulence and uncertainty, but the industry shows more strength, resilience, and ability to innovate than before. Profit levels that had quickly recovered post-Covid to an average 21% in 2021 have slightly eroded in 2022, down to 19%–21%. While the industry has benefited from increased prices and a continued shift to higher-margin direct channels, the lower profit levels reflect luxury brands’ investment in future growth, particularly through increased marketing spending and ambitious transformation programs. However, the profit erosion also reflects higher energy prices and increased labor costs. None of this has stopped brands from investing in modernizing their operations, especially through more robust information technology infrastructure to support the ongoing digitalization of the industry, and through a reconfiguration of their store networks (primarily through renovation and relocation projects). The robust performance in 2022 suggests that growth should stay healthy for the personal luxury goods market in the medium term. We expect that solid market fundamentals will result in annual growth rates between 5% and 7% until 2030. We therefore forecast that the market value of personal luxury goods will rise to between €540 billion and €580 billion by the end of the present decade, from an estimated €353 billion in 2022—an increase of more than 50%. Four growth engines will profoundly reshape the luxury market by 2030: Chinese consumers should regain their pre-Covid status as the dominant nationality for luxury, growing to represent 38%–40% of global purchases. Mainland China should overcome the Americas and Europe to become the biggest luxury market globally (25%–27% of global purchases). Younger generations (Generations Y, Z, and Alpha) will become the biggest buyers of luxury by far, representing 80% of global purchases. Online should become the leading channel for luxury purchases with an estimated 32%–34% market share, followed by monobrand stores (30%–32% market share). By 2030, luxury should have expanded beyond its traditional business model, typically defined by sales of products, transcending an original form rooted in craftmanship and functional excellence. Broader meanings and business models will emerge. We expect that the growth of new types of activities, often powered by technology, will result in an additional €60 billion to €120 billion of luxury industry sales. This could include revenues generated by: the metaverse and NFTs (such as through collectibles and other new products and services); the monetization of communities (through virtual events and data monetization, for instance); brand-related media content (such as movies, music, and art); secondhand luxury goods (by bringing more secondhand sales in-house, for instance); and “3.0 experiences” (such as virtual stores, digital shopping assistants, and ultra-luxury travel and hospitality). Figure 17 Profitability slightly decreased in 2022 as players invest in growth (marketing, renovations, IT, transformation costs) while facing inflation Figure 18 Solid market fundamentals should lead to a positive medium-term trajectory for personal luxury goods (with potential bumps along the way) Figure 19a By 2030, Chinese consumers should become the top personal luxury goods customers again and China the biggest market Figure 19b By 2030, Gen Y should become the primary personal luxury goods buyers; online and monobrand stores will be the leading channels About the Bain Luxury Goods Worldwide Market Study Bain & Company analyzes for Fondazione Altagamma the market and financial performance of more than 280 leading luxury goods companies and brands. This database, known as the Luxury Goods Worldwide Market Observatory, has become a leading and much-studied source in the international luxury goods industry. Bain has published its annual findings in the Luxury Goods Worldwide Market Study since 2000. The study’s lead author is Claudia D’Arpizio, a Bain partner in Milan. Fondazione Altagamma is led by Matteo Lunelli, who was named chairman in 2020. Figure 20 Methodology of the study Bain’s insights are based on triangulating information and sources available as of November 10, 2022, including: data regarding the outbreak of Covid-19 and consequential lockdowns across countries; macroeconomic data (e.g., GDP, consumer confidence index) and latest forecasts; current trading performance from relevant luxury industry players; annual reports, quarterly results, and analyst reports; and consensus of 100-plus expert interviews. The scenarios do not consider disruptive changes to the Covid-19 status quo (e.g., potential future waves of Covid-19 related to variations of the virus) nor to the global sociopolitical situation.","filter_flag":1}
{"title":"Bain Study: Luxury Spending Has Become More Recession Resistant - SGB Media","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vc2dib25saW5lLmNvbS9iYWluLXN0dWR5LWx1eHVyeS1zcGVuZGluZy1oYXMtYmVjb21lLW1vcmUtcmVjZXNzaW9uLXJlc2lzdGFudC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vc2dib25saW5lLmNvbS9iYWluLXN0dWR5LWx1eHVyeS1zcGVuZGluZy1oYXMtYmVjb21lLW1vcmUtcmVjZXNzaW9uLXJlc2lzdGFudC_SAQA?oc=5","id":"CBMiVWh0dHBzOi8vc2dib25saW5lLmNvbS9iYWluLXN0dWR5LWx1eHVyeS1zcGVuZGluZy1oYXMtYmVjb21lLW1vcmUtcmVjZXNzaW9uLXJlc2lzdGFudC_SAQA","guidislink":false,"published":"Fri, 27 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=27, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vc2dib25saW5lLmNvbS9iYWluLXN0dWR5LWx1eHVyeS1zcGVuZGluZy1oYXMtYmVjb21lLW1vcmUtcmVjZXNzaW9uLXJlc2lzdGFudC_SAQA?oc=5\" target=\"_blank\">Bain Study: Luxury Spending Has Become More Recession Resistant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SGB Media<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bain Study: Luxury Spending Has Become More Recession Resistant - SGB Media","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vc2dib25saW5lLmNvbS9iYWluLXN0dWR5LWx1eHVyeS1zcGVuZGluZy1oYXMtYmVjb21lLW1vcmUtcmVjZXNzaW9uLXJlc2lzdGFudC_SAQA?oc=5\" target=\"_blank\">Bain Study: Luxury Spending Has Become More Recession Resistant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SGB Media<\/font>","source.href":"https:\/\/sgbonline.com","source.title":"SGB Media","query":"https:\/\/news.google.com\/rss\/search?q=\"Secondhand Sales\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"A Bain & Co. recent study concluded that while spending on luxury goods is forecasted to slow in 2023 following two strong recovery years, the overall sector is “more resilient to recession” versus the recession in 2009. Among the reasons, the share of top customers expanded and accounted for 40 percent of market value in 2022 compared with 35 percent in 2021. The report states, “These consumers are hungry for unique products and experiences, putting brands’ Very Important Clients (VIC) strategies into overdrive.” Luxury tends to fare better than other retail channels during downturns because of its exposure to high-income consumers. A heightened focus on customer-centricity in recent years was cited as “another source of resilience for the industry, as is the multi-touchpoint ecosystem that luxury has developed.” The study noted that many luxury players, both stores and brands, are investing in “modernizing their operations, especially through more robust information technology infrastructure to support the ongoing digitalization of the industry, and through a reconfiguration of their store networks, primarily through renovation and relocation projects. Finally, a third factor is expected to bolster luxury’s growth over the next decade is its appeal to an ever-younger consumer, tied to a surge in wealth creation over the past few years, along with social media. Luxury spending among Gen Z and Generation Alpha is expected to grow three times faster than other generations through 2030, making up a third of the market, according to the study. Bain observed, “This reflects a more precocious attitude toward luxury, with Gen Z consumers starting to buy luxury items three to five years earlier than millennials did (at 15 versus at 18-to-20); Gen Alpha is expected to behave in a similar way.” Luxury Goods Recover Strong In 2021\/22 The 21st edition of the study, conducted in collaboration with Fondazione Altagamma, the trade association of Italian luxury goods manufacturers, found that the market for personal luxury goods saw healthy growth in 2022, building on what was a “V-shaped” rebound in 2021. The luxury sector was hit hard during the first year of the pandemic by restrictions on social events, travel and a shift toward casual dressing. Bain estimated that global sales of personal luxury goods reached €353 billion in retail sales value in 2022, marking an advance of 22 percent at current exchange rates or 15 percent at constant exchange rates, year-over-year. Bain estimated that in 2022, 95 percent of luxury brands experienced positive growth. The gains were boosted by the continued return to socializing, travel and the office that ushered in the return to dressing up. Growth in goods also benefited as spending on services (i.e., hospitality, fine dining) continued to see more moderate growth due to a slow recovery in international tourism and business travel. Profit levels recovered post-COVID to an average growth of 21 percent in 2021 for personal luxury goods but is estimated to have declined in the range of 19 percent to 21 percent in 2022 due to investments focused in large part on digital transformations. Bain wrote, “While the industry has benefited from increased prices and a continued shift to higher-margin direct channels, the lower profit levels reflect luxury brands’ investment in future growth, particularly through increased marketing spending and ambitious transformation programs. However, the profit erosion also reflects higher energy prices and increased labor costs.” Regional Highlights Given China’s challenges, the Americas region regained the top position for personal luxury goods sales, with Asia, excluding Japan, dropping to the second position, followed by Europe. The personal luxury goods market reached an estimated €113 billion in the Americas, growing 25 percent over 2021. Bain wrote in the study, “Performance was particularly robust in the first half of the year. In the United States, traditional luxury hubs gradually returned to growth while suburban areas retained their new prominence as a source of luxury sales. Latin America experienced solid growth, especially in Mexico and Brazil.” In Asia, excluding Japan, spending on personal luxury goods grew 15 percent on a currency-neutral basis. Spending eased by 1 percent in Mainland China, with COVID lockdowns most prominent in the second quarter. A rebound was seen in the second half in China as restrictions were lifted, but not enough to offset the second-quarter performance. Excluding Mainland China and Japan, spending on personal luxury goods in Asia grew 43 percent, reflecting strength in Thailand and other Southeast Asian countries, as well South Korea. In Europe, spending on personal luxury goods advanced 27 percent on a currency-neutral basis, aided by healthy domestic demand and the return of tourists from the U.S. and the Middle East. Italy and France were the 2022 growth champions, followed by Turkey, the UK and Spain, while Germany softened. Japan grew by 18 percent at current exchange rates, catching up to its pre-COVID level. Category Performance All personal luxury goods categories performed well in 2022, with double-digit growth rates across the board. All categories are estimated to have recovered to 2019 levels or better, with hard luxury (i.e., jewelry and watches), leather and apparel leading the resurgence following the pandemic. Among key categories, apparel is estimated to have grown in the range of 22 percent to 24 percent in 2022, aided by wardrobe restocking after the casual-dressing phase in the early stages of the pandemic. Womenswear and menswear grew at about the same pace. Bain wrote in the study, “‘ Post-streetwear’ is emerging as the new look. It maintains some elements of streetwear (such as gender fluidity, a disregard for occasion, inclusiveness and sports-driven inspiration) but goes beyond its style codes through new and enhanced techniques, materials, and functions.” Footwear grew in the range of 20 percent to 22 percent year-over-year. Bain wrote, “Heels and formal shoes are now back to their 2019 levels. Casual categories, such as fussbett sandals and Wellington boots, are on the rise.” Accessories remained the largest personal luxury goods category and grew by 21 percent to 23 percent. Within accessories, leather goods grew by 23 percent to 25 percent, surpassing its pre-COVID levels, up 39 percent and 41 percent compared with 2019. Leather goods’ growth was boosted by a “deliberate and effective” elevation strategy that increased prices across the leather category without damaging volume growth. Among other luxury categories, beauty sales advanced 14 percent to 16 percent, still held back by the slow recovery in travel retail. High-end watch sales jumped 22 percent to 24 percent in 2022 despite low product availability. Jewelry sales are estimated to have expanded 23 percent to 25 percent in 2022. Luxury Outlook Bain said the “robust performance in 2022 suggests that growth should stay healthy for the personal luxury goods market in the medium term.” Also helping are infrastructure investments in recent years. In 2023, sales growth in personal luxury goods is seen embracing two scenarios, growth in the range of 3 percent to 5 percent in the base case and up to 6 percent to 8 percent, at constant exchange rates, in a more positive case. The outcome depends “on the strength of the economic recovery in China and the ability of the U.S. and Europe to withstand economic headwinds.” Over the longer term, the personal luxury goods market is expected to deliver annual growth rates between 5 percent and 7 percent until 2030, reaching between €540 billion and €580 billion by the end of the present decade, from an estimated €353 billion in 2022, a jump of more than 50 percent. Four growth engines were identified to “profoundly reshape” the luxury market by 2030: Chinese consumers should regain their pre-COVID status as the dominant nationality for luxury, growing to represent 38 percent to 40 percent of global purchases; Mainland China should overcome the Americas and Europe to become the largest luxury market globally (25 percent to 27 percent of global purchases); Younger generations (Generations Y, Z and Alpha) will become the biggest buyers of luxury, representing 80 percent of global purchases; and Online should become the leading channel for luxury purchases with an estimated 32 percent to 34 percent market share, followed by monobrand stores (30 percent to 32 percent market share). Bain also said that by 2030, luxury should have expanded beyond its traditional business model, typically defined by sales of products, as the growth of new types of activities, often powered by technology, will result in an additional €60 billion to €120 billion of luxury industry sales. These new revenue streams could be generated by: the metaverse and NFTs, such as collectibles and other new products and services; the monetization of communities through virtual events and data monetization, for example; brand-related media content, including movies, music and art) secondhand luxury goods, by bringing more secondhand sales in-house; and “3.0 experiences,” including virtual stores, digital shopping assistants, ultra-luxury travel, and hospitality. Photo courtesy Giorgio Armani","filter_flag":1}
{"title":"The fashion exec's guide to circularity - Vogue Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA","guidislink":false,"published":"Wed, 11 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=11, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5\" target=\"_blank\">The fashion exec's guide to circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The fashion exec's guide to circularity - Vogue Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5\" target=\"_blank\">The fashion exec's guide to circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","source.href":"https:\/\/www.voguebusiness.com","source.title":"Vogue Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Secondhand Sales\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"This article is part of our Advanced Membership package. To enjoy unlimited access to The Long View from Vogue Business and bi-monthly Market Insights Reports and webinars, sign up for Advanced Membership here. Key takeaway: Circular fashion is gaining traction as a necessary concept for the industry to avoid generating excessive waste, with investment flowing into rental, repair, resale and recycling. But sustainability experts say the industry is too focused on technological solutions and startups based in the Global North, and is neglecting its social impact, especially in the Global South.","filter_flag":1}
