{"title":"EcoFlow Debuts its Whole-home Backup Power Solution and Three New Smart Devices at CES 2023 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZGVidXRzLWl0cy13aG9sZS1ob21lLWJhY2t1cC1wb3dlci1zb2x1dGlvbi1hbmQtdGhyZWUtbmV3LXNtYXJ0LWRldmljZXMtYXQtY2VzLTIwMjMtMzAxNzExNDQzLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZGVidXRzLWl0cy13aG9sZS1ob21lLWJhY2t1cC1wb3dlci1zb2x1dGlvbi1hbmQtdGhyZWUtbmV3LXNtYXJ0LWRldmljZXMtYXQtY2VzLTIwMjMtMzAxNzExNDQzLmh0bWzSAQA?oc=5","id":"CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZGVidXRzLWl0cy13aG9sZS1ob21lLWJhY2t1cC1wb3dlci1zb2x1dGlvbi1hbmQtdGhyZWUtbmV3LXNtYXJ0LWRldmljZXMtYXQtY2VzLTIwMjMtMzAxNzExNDQzLmh0bWzSAQA","guidislink":false,"published":"Thu, 05 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=5, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZGVidXRzLWl0cy13aG9sZS1ob21lLWJhY2t1cC1wb3dlci1zb2x1dGlvbi1hbmQtdGhyZWUtbmV3LXNtYXJ0LWRldmljZXMtYXQtY2VzLTIwMjMtMzAxNzExNDQzLmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Debuts its Whole-home Backup Power Solution and Three New Smart Devices at CES 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EcoFlow Debuts its Whole-home Backup Power Solution and Three New Smart Devices at CES 2023 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Vjb2Zsb3ctZGVidXRzLWl0cy13aG9sZS1ob21lLWJhY2t1cC1wb3dlci1zb2x1dGlvbi1hbmQtdGhyZWUtbmV3LXNtYXJ0LWRldmljZXMtYXQtY2VzLTIwMjMtMzAxNzExNDQzLmh0bWzSAQA?oc=5\" target=\"_blank\">EcoFlow Debuts its Whole-home Backup Power Solution and Three New Smart Devices at CES 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly energy solutions\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Whole-home Backup Power Solution offers easy installation and power for up to a week EcoFlow Blade is the first robotic lawn-sweeping mower that also collects fallen leaves EcoFlow Wave 2 Portable Air Conditioner improves on the original and now offers heating EcoFlow Glacier is the first portable fridge with a built-in icemaker and battery LAS VEGAS, Jan. 5, 2023 \/PRNewswire\/ -- EcoFlow , a portable power and eco-friendly energy solutions company, is making access to emergency power easier than ever with its new Whole-home Backup Power Solution unveiled today at CES. Built around EcoFlow's powerful DELTA Pro portable power station, the Whole-home Backup Power Solution is a quiet and reliable portable home battery setup that replaces noisy, polluting generators. From left to right: EcoFlow Blade Robotic Lawn-sweeping Mower, EcoFlow Glacier Portable Refrigerator, EcoFlow Wave 2 Portable Air Conditioner. EcoFlow's Whole-home Backup Power Solution providing power for a household during a power outage. The setup is available in three different capacities and works across EcoFlow's broader ecosystem to deliver affordable, clean and reliable energy, providing peace of mind in these times of increasing energy insecurity. EcoFlow also launched three new outdoor smart devices at CES — the 2nd-gen Wave 2 Portable Air Conditioner, as well as CES 2023 Honorees, Blade, a robotic lawn-sweeping mower, and Glacier, a portable fridge with a built-in ice maker and battery. The new products reflect EcoFlow's commitment to powering people's lives on and off the grid. \"Rising power bills and extreme weather events have created an increasingly unstable energy situation for many people around the world. The pandemic also created a surge of interest in camping and other outdoor events,\" said Brian Essenmacher, EcoFlow's head of business development. \"EcoFlow is addressing these new demands and challenges by providing power that's easier than ever and helping people to make the most of life by saving them time and money. We're making life more enjoyable at home and outdoors.\" Whole-home Backup Power for Lasting Peace of Mind Many people rely on gas-powered generators as their emergency power solution during blackouts. These generators are noisy, smoky and produce high levels of dangerous carbon monoxide. EcoFlow's new Whole-home Backup Power Solution, on the other hand, provides backup power that is clean, quiet and safe. The Whole-home Backup Power Solution is built around DELTA Pro, a powerful portable power station that can be fully recharged with a wall socket in under 3 hours. The Advanced Kit, one of three different solution bundles to meet customers' individual needs, connects two DELTA Pro units via the Double Voltage Hub, resulting in a massive 7200W and 240V output. That's enough to power practically any home appliance while delivering enough energy to keep critical circuits running for up to a week. Alternatively, customers can get through even the worst blackouts with an even longer-lasting power supply by pairing the setup with EcoFlow's Smart Generator (Dual Fuel). The Whole-home Backup Solution can be used with EcoFlow's range of solar generators to provide free renewable energy and help users reduce their reliance on the grid. What's more, as part of the U.S. government's Inflation Reduction Act 2022, it is possible for users to apply for a 30% tax credit when installing the DELTA Pro as a home power solution.* With just a few modules, the Whole-home Backup Power Solution is easy for people to install in homes and RVs without the need for professional installers like other power backup products. The Whole-home Backup Power Solution will be available in the U.S. on EcoFlow's website beginning Jan. 5. An alternative home backup solution for users in the E.U., comprising EcoFlow's Power Kits and Smart Home Panel, will also be available soon. Three New Smart Devices for Next-Level Living As a hotbed of the latest innovation where ideas become reality, CES 2023 provided the ideal setting for EcoFlow to demonstrate how its growing ecosystem of smart devices improves life at home and outdoors. The three new products unveiled today include: EcoFlow Blade: The world's first robotic lawn-sweeping mower capable of collecting fallen leaves. EcoFlow Blade is cheaper than professional mowing services and requires less manual lawn maintenance compared to standard robotic mowers. The world's first robotic lawn-sweeping mower capable of collecting fallen leaves. EcoFlow Blade is cheaper than professional mowing services and requires less manual lawn maintenance compared to standard robotic mowers. EcoFlow Glacier: Glacier is the industry's first portable fridge to feature a built-in icemaker and battery, keeping food fresh and drinks topped up with ice for maximum enjoyment. Glacier is the industry's first portable fridge to feature a built-in icemaker and battery, keeping food fresh and drinks topped up with ice for maximum enjoyment. EcoFlow Wave 2: Following the success of the first Wave Portable Air Conditioner, the second generation is capable of both heating and cooling, making life even more comfortable outdoors and in off-grid spaces. EcoFlow Blade and EcoFlow Glacier were selected as CES 2023 Honorees, highlighting their exceptional, innovative designs and their potential for improving users' quality of life. Just like the Whole-home Backup Solution, all three of the new products allow users to lead more enjoyable, comfortable lives with power that has never been so easy. About EcoFlow EcoFlow is a leading eco-friendly energy solutions company with the vision to power a new world. Since its founding in 2017, EcoFlow aims to become a reliable and trusted energy companion for individuals and families across the world, providing accessible and renewable power solutions at home, outdoors, and in mobile spaces. Today, with operational headquarters located in the USA, Germany, and Japan, EcoFlow has empowered more than 2 million users in over 100 markets worldwide. Disclaimer *Qualifying battery storage technology of 3kWh or more must be installed by a connection to a dwelling in the United States, lived in by the taxpayer. You should always consult your tax professional to determine your eligibility for the Residential Clean Energy Credit under Section 25D of the Internal Revenue Code given your individual situation. EcoFlow does not guarantee any tax credit based on our products, and any information we provide is for educational purposes only and should not be considered legal advice. It does not constitute professional tax advice or financial guidance. It should not be used as the only source of information when making purchasing decisions, investment decisions, tax decisions, or execution. Consult a tax professional to evaluate your eligibility. Effective date: Jan 1, 2023 SOURCE EcoFlow","filter_flag":1}
