{"title":"Coesia Group to Showcase Sustainable Packaging, Automation Solutions at PACK EXPO - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwODctY29lc2lhLWdyb3VwLXRvLXNob3djYXNlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdXRvbWF0aW9uLXNvbHV0aW9ucy1hdC1wYWNrLWV4cG_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwODctY29lc2lhLWdyb3VwLXRvLXNob3djYXNlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdXRvbWF0aW9uLXNvbHV0aW9ucy1hdC1wYWNrLWV4cG_SAQA?oc=5","id":"CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwODctY29lc2lhLWdyb3VwLXRvLXNob3djYXNlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdXRvbWF0aW9uLXNvbHV0aW9ucy1hdC1wYWNrLWV4cG_SAQA","guidislink":false,"published":"Tue, 05 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=248, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwODctY29lc2lhLWdyb3VwLXRvLXNob3djYXNlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdXRvbWF0aW9uLXNvbHV0aW9ucy1hdC1wYWNrLWV4cG_SAQA?oc=5\" target=\"_blank\">Coesia Group to Showcase Sustainable Packaging, Automation Solutions at PACK EXPO<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Coesia Group to Showcase Sustainable Packaging, Automation Solutions at PACK EXPO - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwODctY29lc2lhLWdyb3VwLXRvLXNob3djYXNlLXN1c3RhaW5hYmxlLXBhY2thZ2luZy1hdXRvbWF0aW9uLXNvbHV0aW9ucy1hdC1wYWNrLWV4cG_SAQA?oc=5\" target=\"_blank\">Coesia Group to Showcase Sustainable Packaging, Automation Solutions at PACK EXPO<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Coesia is a group of innovation-based industrial and packaging solutions companies spanning several sectors. With such a broad reach, it is challenging to summarize all of the group’s offerings. So instead, Packaging Strategies asked Coesia about some of the packaging solutions the group will be showcasing at PACK EXPO in Las Vegas from September 11-13. What does Coesia want Pack Expo Las Vegas attendees to know about the solutions being showcased at their booth (C-4400)? The solutions being showcased reinforce Coesia’s dedication and passion to help manufacturers achieve their sustainability goals while enhancing their automation capabilities. When attendees approach booth C-4400, they will discover GREENMATION. GREENMATION is Coesia's response to the current trend prompted by consumer demands toward reusable and recyclable packaging solutions, while manufacturers face labor shortages and production cost increases. The Coesia booth will be structured into three areas (Food & Beverage, Pharma & Personal Care, and Cross Industry Automation) where technicians and experts will present the latest sustainability and automation solutions presented by the Group: ACMA, Atlantic Zeiser, CITUS KALIX, FlexLink, G.D, GF, HAPA, MGS, NORDEN, R.A Jones, and VOLPAK. What are some of the automation solutions that show attendees will be exposed to for the first time at this show? FlexLink, a Coesia company leader in the field of automated manufacturing and material flow solutions, will be launching a new solution called BRIXX® for the first time in North America. BRIXX is a click-and-play solution based on advanced, mobile conveyors and robots to automate manual repetitive packing and co-packing processes. It is controlled by intuitive software for line design and operations, as well as fleet management allowing management of seasonal peak productions. BRIXX is a solution to automate current manual packing operations through a flexible system adapting to the variability of products, packs, cartons, or trays. It is scalable according to production capacity needs, and affordable. FlexLink will be conducting formal presentations twice a day during the show. The presentation will take place during the following dates and times: Monday, September 11, at 11:30AM and 2:30PM Tuesday, September 12, at 11:30 AM and 2:30PM Wednesday, September 13, at 11:30AM and 1:30PM R.A Jones will debut the Intelligent Flexible Transfer System (iFTS) that is integrated with a Criterion CLI-100 intermittent motion cartoning machine that includes new state-of-the-art push button changeover technology called Acc-U-Change® PLUS. The iFTS combines the best of both flexible and\/or hard automation to optimize a solution to meet your production needs. The iFTS can utilize familiar or state-of-the-art technologies to solve typical or new product handling and collation challenges. Important features of the new iFTS include: Six-dimensional floating shuttle transfers Product can be collected, grouped, oriented, and layered for downstream packaging Increase range of product sizes with four axis robotic pick and place technology Fraction of the footprint compared to traditional transfer solutions Machinery is always a big draw at Pack Expo. However, manufacturers are also looking for how OEMs will support their operations. What type of support is Coesia Group able to provide customers? Coesia supports its customers in every step of the manufacturing process, thanks to a vast portfolio of innovative automation solutions that ensure production reliability and allows operators to be diverted towards added-value tasks. From intelligent object selection solutions for material loading and infeed, to inline transfer, down to industrial and collaborative robotic solutions for end-of-line management, Coesia is the go-to partner in the journey toward full-line automation. To learn more about all the equipment and solutions being showcased at the Coesia booth, visit the group’s show profile page by clicking here and downloading the official Coesia Pack Expo Las Vegas booth brochure. Coesia is a group of innovation-based industrial and packaging solutions companies operating globally, headquartered in Bologna, Italy, and owned by Isabella Seràgnoli. Coesia’s companies are leaders in the sectors of advanced automated machinery and packaging materials, industrial process solutions and precision gears. Coesia customers are leading players in a broad range of industries, including Aerospace, Ceramics, Consumer Goods, Electronics, Healthcare, Luxury Goods, Pharmaceutical, Racing & Automotive and Tobacco.","filter_flag":1}
{"title":"Ball Aerosol Packaging releases new report on innovative Eyeris® printing technology for sustainable aluminum ... - Ball","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmJhbGwuY29tL3BhY2thZ2luZy9hcnRpY2xlcy9iYWxsLWFlcm9zb2wtcGFja2FnaW5nLXJlbGVhc2VzLW5ldy1yZXBvcnQtZXllcmlz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmJhbGwuY29tL3BhY2thZ2luZy9hcnRpY2xlcy9iYWxsLWFlcm9zb2wtcGFja2FnaW5nLXJlbGVhc2VzLW5ldy1yZXBvcnQtZXllcmlz0gEA?oc=5","id":"CBMiWWh0dHBzOi8vd3d3LmJhbGwuY29tL3BhY2thZ2luZy9hcnRpY2xlcy9iYWxsLWFlcm9zb2wtcGFja2FnaW5nLXJlbGVhc2VzLW5ldy1yZXBvcnQtZXllcmlz0gEA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmJhbGwuY29tL3BhY2thZ2luZy9hcnRpY2xlcy9iYWxsLWFlcm9zb2wtcGFja2FnaW5nLXJlbGVhc2VzLW5ldy1yZXBvcnQtZXllcmlz0gEA?oc=5\" target=\"_blank\">Ball Aerosol Packaging releases new report on innovative Eyeris® printing technology for sustainable aluminum ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ball<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ball Aerosol Packaging releases new report on innovative Eyeris® printing technology for sustainable aluminum ... - Ball","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWWh0dHBzOi8vd3d3LmJhbGwuY29tL3BhY2thZ2luZy9hcnRpY2xlcy9iYWxsLWFlcm9zb2wtcGFja2FnaW5nLXJlbGVhc2VzLW5ldy1yZXBvcnQtZXllcmlz0gEA?oc=5\" target=\"_blank\">Ball Aerosol Packaging releases new report on innovative Eyeris® printing technology for sustainable aluminum ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ball<\/font>","source.href":"https:\/\/www.ball.com","source.title":"Ball","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"BROOMFIELD, Colo., September 27, 2023 — Ball Corporation (NYSE: BALL), the world leader in sustainable aluminum packaging, has released a new report on the transformative power of Eyeris®, its proprietary enhanced printing technology for aluminum cans and impact extruded bottles. Eyeris® offers unparalleled visual appeal in line with the growing consumer demand for sustainable packaging. With over 40,000 Fast-Moving Consumer Goods (FMCG) launches monthly across 273+ categories1, the competition for shelf placement and consumer attention has intensified. Notably, at the point of purchase,product packaging plays a pivotal role, with 76% of consumers saying it influences their final purchase decisions, while 66% of consumers try new products solely due to their packaging2. Unlike traditional printing methods, Eyeris® uses advanced printing and imaging processes to deliver high-resolution, photo-realistic images directly onto the aluminum packaging surface. This ground-breaking HD imagery spans 360 degrees around the can or bottle, offering not only unparalleled detail and color accuracy to visually showcase ingredients and fragrances within the product, but also offers brands a unique platform to tell their story while creating a strong emotional connection with consumers. Leveraging Ball’s unique expertise in creative artwork, Eyeris® has the potential to better replicate customer graphics and imagery when developing files for print, ensuring the final product achieves higher detail and quality. Available in up to nine colors, Eyeris® caters to all dimensions and forms within Ball’s portfolio of aluminum cans and impact extruded bottles for beverages, household items, and personal care products. This versatility unlocks visual possibilities that capture consumers’ attention by combining Eyeris® with aluminum packaging, one of the most sustainable packaging solutions available today. “Consumers are increasingly demanding sustainable packaging solutions for household and personal care products. Our new report explores how Eyeris® enables brands to stand out with vivid imagery, while also aligning with the sustainability attributes of aluminum – which is safe, lightweight and infinitely recyclable regardless of shape, color or format,” said Victoria Marletta, Commercial Vice President, Aerosol Packaging at Ball Corporation. “Eyeris® provides a significant step forward in packaging design technology. We’re excited to partner with our customers to provide this innovative and versatile solution for brands to communicate with their customers.” As a leader in sustainable aluminum packaging innovation, Ball launched the lightweight Aerosol aluminum cans using their proprietary alloy ReAl in 2014 to reduce emissions from transportation. These Aerosol cans are up to 30% lighter than standard ones and contribute to a reduction in transportation-related emissions. However, widespread adoption of lightweighting has led to standardized can shapes and sizes and less differentiation. Eyeris® is designed to address this issue by ensuring brands and on-pack promotions stand out on the shelf in a crowded market, where creativity may feel squeezed, and captivate consumer attention. Eyeris® reflects Ball’s commitment to innovation and sustainability, offering purpose-powered solutions that help brands elevate their packaging while contributing to a more sustainable world. When combined with Eyeris® technology, aluminum packaging not only fulfils but amplifies both sustainability and consumer engagement by allowing high-resolution printing directly on the package, thereby eliminating the need for additional labels. For more information, and to learn how Eyeris®-high-definition printing technology can enhance brand visibility, download the report at Eyeris-Ball. 1Mintel Report on 2023 Global Packaging Trends. 2 The Nielsen Global Survey of Corporate Social Responsibility and Sustainability.","filter_flag":1}
{"title":"Sustainability doesn't have to be boring - HCT'S newest innovations - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1kb2Vzbi10LWhhdmUtdG8tYmUsMjI1NjPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1kb2Vzbi10LWhhdmUtdG8tYmUsMjI1NjPSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1kb2Vzbi10LWhhdmUtdG8tYmUsMjI1NjPSAQA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1kb2Vzbi10LWhhdmUtdG8tYmUsMjI1NjPSAQA?oc=5\" target=\"_blank\">Sustainability doesn't have to be boring - HCT'S newest innovations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainability doesn't have to be boring - HCT'S newest innovations - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9zdXN0YWluYWJpbGl0eS1kb2Vzbi10LWhhdmUtdG8tYmUsMjI1NjPSAQA?oc=5\" target=\"_blank\">Sustainability doesn't have to be boring - HCT'S newest innovations<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"We have noticed a shift in demand for stock tools over custom tools, and with this trend, HCT is primed to help customers by offering a diverse stock tool library. There is a lot of brand competition right now, and for smaller brands that have disruptive ideas, we can help them launch right out of the gate with strong sustainability claims and uniqueness, versus established brands that are having a more challenging time shifting their current offering to becoming more sustainable. We think it is an exciting time for new products, and we want to help those brands launch with strong sustainability claims effectively and efficiently. HCT has a new collection of tools that they are very excited about, including a new refillable palette, a refillable monomaterial pump, and refillable jars. The Refillable PET Palette is a monomaterial PET design created to be a bit different from what is currently available on the market, featuring a new refillable pan system that is compatible with multiple palette designs. The pan holder will be available in multiple materials, starting with PET, which is recyclable, as well as in different sizes that will work for face powders (bronzer, highlighter, blush, foundation), and eye shadow. The idea is to reuse the same pan system with different palettes—larger or smaller sizes, mix-and-match product categories—offering consumers a custom-curated palette experience from a brand they love. The PET version is the first design to launch, with more designs planned in the pipeline. The Monument Pump was created as a more unique design solution to your typical refillable pump by allowing the consumer to reuse the actuator and base. The refill PP bottle comes with the monomaterial PP pump already assembled and can be recycled as one piece. The user only needs to drop the recyclable bottle (and pump) into the outer bottle and snap the actuator on. At the end of use, you separate the actuator from the bottle and pull out the inner pump for recycling. We are producing additional versions with glass, aluminum, and silicone outer bottles in order to offer more options for brands to play with different materials and aesthetics. The PP pump version will be available in 30 mL, with more sizes in the works. The Hush jars are monomaterial PP featuring a unique recessed design on the lid, allowing the jars to easily stack on top of each other. A typical refillable jar has a narrower neck, making it difficult to access all the product. The Hush Jars feature a wider opening with a hidden thread inside, allowing for easier access to the product until the last drop. The PP version is currently available in 30 mL and 50 mL. Larger volumes will be available soon for haircare and bodycare products. The larger opening also creates an easier experience for popping out the inner pod. Like the Refillable PET Palette and the Monument Pump, the Hush Jar will also be available in different materials for the cap and base, including aluminum, silicone, cement, glass, and various bio-based materials. HCT is pushing the limits of sustainable design by offering different materials and design options to meet customer needs and deliver a more playful experience to both brands and their consumers. HCT is encouraging brands to reach out to set up a meeting to explore new stock tools and find ways to help them make the shift to a more sustainable future. Sustainability isn’t easy, but it can be beautiful and fun. Send HCT an email at info@hctgroup.com.","filter_flag":1}
{"title":"Private label products growing in popularity due to price, quality and sustainability, research shows - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDkvMjgvUHJpdmF0ZS1sYWJlbC1wcm9kdWN0cy1ncm93aW5nLWluLXBvcHVsYXJpdHktZHVlLXRvLXByaWNlLXF1YWxpdHktYW5kLXN1c3RhaW5hYmlsaXR5LXJlc2VhcmNoLXNob3dz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDkvMjgvUHJpdmF0ZS1sYWJlbC1wcm9kdWN0cy1ncm93aW5nLWluLXBvcHVsYXJpdHktZHVlLXRvLXByaWNlLXF1YWxpdHktYW5kLXN1c3RhaW5hYmlsaXR5LXJlc2VhcmNoLXNob3dz0gEA?oc=5","id":"CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDkvMjgvUHJpdmF0ZS1sYWJlbC1wcm9kdWN0cy1ncm93aW5nLWluLXBvcHVsYXJpdHktZHVlLXRvLXByaWNlLXF1YWxpdHktYW5kLXN1c3RhaW5hYmlsaXR5LXJlc2VhcmNoLXNob3dz0gEA","guidislink":false,"published":"Thu, 28 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=271, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDkvMjgvUHJpdmF0ZS1sYWJlbC1wcm9kdWN0cy1ncm93aW5nLWluLXBvcHVsYXJpdHktZHVlLXRvLXByaWNlLXF1YWxpdHktYW5kLXN1c3RhaW5hYmlsaXR5LXJlc2VhcmNoLXNob3dz0gEA?oc=5\" target=\"_blank\">Private label products growing in popularity due to price, quality and sustainability, research shows<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Private label products growing in popularity due to price, quality and sustainability, research shows - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilAFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDkvMjgvUHJpdmF0ZS1sYWJlbC1wcm9kdWN0cy1ncm93aW5nLWluLXBvcHVsYXJpdHktZHVlLXRvLXByaWNlLXF1YWxpdHktYW5kLXN1c3RhaW5hYmlsaXR5LXJlc2VhcmNoLXNob3dz0gEA?oc=5\" target=\"_blank\">Private label products growing in popularity due to price, quality and sustainability, research shows<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Based on responses from 3000 shoppers from France, Germany, Italy, Poland, the Netherlands and the UK, the report shows the overwhelming popularity of private label products within Europe. In fact, 70% of consumers assessed regularly buy private label, with 50% of these planning to continue because of their satisfaction with the products’ quality. Striving to save​ The cost-of-living crisis plays a crucial role in these trends. In fact, 85% of those assessed who buy private label products do so because of price, with 48% stressing that ‘promotions’ were a factor in their choices. However, quality was also a significant part of private labels’ appeal. Many found that private label products had ‘better taste’ than branded products, with 51% saying they don’t see a difference in the quality of private label and branded products. Furthermore, 40% of respondents used ‘cleaner ingredients’ as a justification for a pivot towards private labels. “While the research confirms that the price of private-label items impacts grocery shoppers’ purchasing decisions in the current economic climate, quality is still a crucial factor influencing consumers’ buying journey​,” said Madalina Mitru, Strategic Marketing & Value Chain Manager at Amcor. “Taste, quality, and origin are all still important when consumers are making purchasing decisions.”​ Sustainability and locality​ Many consumers also expressed approval of private labels because of their ‘local production’. This was linked to concerns about sustainability, with 42% of consumers seeing products produced locally as made with greater concern around being sustainable. Furthermore, 34% of consumers said that they have seen progress in areas such as ‘food waste reduction’, ‘less excessive packaging’, and ‘more sustainable packaging’ when it comes to private label products. Packaging concerns also played a key role in consumer attitudes to private label products. Many of the consumers assessed said that ‘paper packaging’, ‘recyclable packaging’, ‘less packaging’ and ‘less plastic’ were among what drove them to buy more private label products. Overall, 28% of consumers stated that the sustainability of packaging drove them to buy private label products. “We see a growing shift towards eco-conscious grocery shopping for both private-label and branded products,” ​Mitru added. “Consumers increasingly expect their preferred products to demonstrate how they are improving sustainability. Retailers and brands can adopt more sustainable packaging to help retain customers and demonstrate their continued commitment to driving circularity and reducing their carbon footprint​.” However, 35% of consumers believe that manufacturers still need to make more effort to cut down on excessive packaging, with 33% stating that more effort must be made to incorporate sustainable packaging into products.","filter_flag":1}
{"title":"Honoring eco-friendly action: About the 2023 Sustainable Beauty Awards - CosmeticsDesign.com USA","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA5LzA3L2hvbm9yaW5nLWVjby1mcmllbmRseS1hY3Rpb24tYWJvdXQtdGhlLTIwMjMtc3VzdGFpbmFibGUtYmVhdXR5LWF3YXJkc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA5LzA3L2hvbm9yaW5nLWVjby1mcmllbmRseS1hY3Rpb24tYWJvdXQtdGhlLTIwMjMtc3VzdGFpbmFibGUtYmVhdXR5LWF3YXJkc9IBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA5LzA3L2hvbm9yaW5nLWVjby1mcmllbmRseS1hY3Rpb24tYWJvdXQtdGhlLTIwMjMtc3VzdGFpbmFibGUtYmVhdXR5LWF3YXJkc9IBAA","guidislink":false,"published":"Thu, 07 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=250, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA5LzA3L2hvbm9yaW5nLWVjby1mcmllbmRseS1hY3Rpb24tYWJvdXQtdGhlLTIwMjMtc3VzdGFpbmFibGUtYmVhdXR5LWF3YXJkc9IBAA?oc=5\" target=\"_blank\">Honoring eco-friendly action: About the 2023 Sustainable Beauty Awards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Honoring eco-friendly action: About the 2023 Sustainable Beauty Awards - CosmeticsDesign.com USA","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi5jb20vQXJ0aWNsZS8yMDIzLzA5LzA3L2hvbm9yaW5nLWVjby1mcmllbmRseS1hY3Rpb24tYWJvdXQtdGhlLTIwMjMtc3VzdGFpbmFibGUtYmVhdXR5LWF3YXJkc9IBAA?oc=5\" target=\"_blank\">Honoring eco-friendly action: About the 2023 Sustainable Beauty Awards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign.com USA<\/font>","source.href":"https:\/\/www.cosmeticsdesign.com","source.title":"CosmeticsDesign.com USA","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"On October 30, Ecovia Intelligence’s Sustainable Cosmetics Summit will kick off with its cohosted Sustainable Beauty Awards reception. The Sustainable Beauty Awards have been running for over a decade, since 2013, and acknowledge “operators who are pushing the boundaries of sustainability in the beauty industry​.” To learn more about the Awards event, including background information, the categories for consideration, and ways to enter, CosmeticsDesign spoke with Amarjit Sahota, Founder of Ecovia Intelligence, for his insights. About the Awards “The Sustainable Beauty Awards is the first international awards dedicated to sustainability in the cosmetics industry​,” shared Sahota, and the Awards were launched “to honor cosmetic brands, ingredient firms, packaging suppliers and other firms that are leading in some area of sustainability​.” Those recognized in this year’s cohort will join a group of previous winners who include “large companies like L’Oreal, Unilever and Boticario Group; sustainable\/organic brands such as Weleda, Lush, O’right, Aveda and Neal’s Yard Remedies; ingredient firms like AAK, IFF and Clariant, as well as others like Sulapac, Sol de Ibiza and Cruelty Free International​,” he added. Experts in various areas of the cosmetic and personal care product industries will judge this year’s Awards. These experts “will evaluate and rate entries for the award categories,” and “the judging panel are from a leading natural foods retailer (Whole Foods Market), raw material supplier (Evonik), natural cosmetics industry association (Natrue), cosmetics media (Cosmetics Design NA), and consulting firm (Ecovia Intelligence)​,” he explained. Categories for consideration There are five categories for consideration in this year’s Sustainable Beauty Awards. The first category is New Sustainable Products, which are new cosmetic or personal care products with significant sustainability credentials, and the second is Sustainable Packaging, which covers “new packaging formats that have a low environmental footprint in terms of materials, design and\/or application​,” as detailed in the organization’s promotional materials. The third category will examine Sustainable Ingredient, which are “cosmetic ingredient that [are considered to] make a significant difference in terms of environmental and\/or social impact​,” and the fourth category honors Sustainable Pioneers who are industry operators who have, in some respects, been a leader in their area in sustainability efforts. The fifth and final category is Sustainability Leadership, which honors organizations that have been exemplary in their sustainability efforts. Awards entry process For cosmetics and personal care product industry professionals, companies, and organizations interested in submitting entries for consideration by the Sustainable Beauty Awards judging panel, the process is currently open, and “cosmetic & personal care brands, ingredient firms, packaging suppliers, retailers & distributors, NGOs, agencies and related firms” ​are encouraged to apply, said Sahota. He added that the closing date to apply is September 30, with finalists announced on October 13 before winners will be announced at the Awards reception hosted at the Crowne Plaza Republique hotel in Paris on October 30. More information, including details of the entry process and previous winners, is available at www.sustainablebeautyawards.com​.","filter_flag":1}
{"title":"European Commission Adopts Measures Restricting Intentional Microplastics - Cosmetics & Toiletries","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5\" target=\"_blank\">European Commission Adopts Measures Restricting Intentional Microplastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics & Toiletries<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"European Commission Adopts Measures Restricting Intentional Microplastics - Cosmetics & Toiletries","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5jb3NtZXRpY3NhbmR0b2lsZXRyaWVzLmNvbS9yZWd1bGF0aW9ucy9lY28tc3VzdGFpbmFibGUvbmV3cy8yMjg3NDQ2OS9ldXJvcGVhbi1jb21taXNzaW9uLWFkb3B0cy1tZWFzdXJlcy1yZXN0cmljdGluZy1pbnRlbnRpb25hbC1taWNyb3BsYXN0aWNz0gEA?oc=5\" target=\"_blank\">European Commission Adopts Measures Restricting Intentional Microplastics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cosmetics & Toiletries<\/font>","source.href":"https:\/\/www.cosmeticsandtoiletries.com","source.title":"Cosmetics & Toiletries","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"For certain \"leave-on\" cosmetic products, per the new restriction, due to their low contribution to the overall emissions of microplastics, as well as the potentially large impact on the cosmetics industry, the agency's committee for socio-economic analysis considered two additional measures as appropriate alternatives to the ban. The European Commission (EC) announced it has taken another major step to protect the environment by adopting measures that restrict microplastics intentionally added to products under the EU chemical legislation REACH. Per the agency, the new rules will prevent the release to the environment of approximately half a million tonnes of microplastics. The measures will prohibit the sale of microplastics, products to which microplastics have been intentionally added, and products that release those microplastics when used. The EC notes that when duly justified, exceptions and transition periods for the affected parties to adjust to the new rules apply. See related: European Commission to Expedite Phasing Out of Animal Testing Definitions and Scope The adopted restriction uses a broad definition of microplastics, covering all synthetic polymer particles below 5 mm that are organic, insoluble and resist degradation. The purpose is to reduce emissions of intentional microplastics from as many products as possible. Some examples of common products in the scope of the restriction are: The granular infill material used on artificial sports surfaces – reportedly the largest source of intentional microplastics in the environment; Cosmetics where microplastics are used for multiple purposes, such as exfoliation (microbeads) or obtaining a specific texture, fragrance or color; and Detergents, fabric softeners, glitter, fertilizers, plant protection products, toys, medicines and medical devices. The EC adds that products used at industrial sites or not releasing microplastics during use are exempt from the sale ban but their manufacturers must provide instructions about how to use and dispose of the products to prevent microplastic emissions. The first measures, such as the ban on loose glitter and microbeads, will apply once the restriction enters into force — 20 days after the Sept. 25, 2023 announcement. In other cases, the sales ban will apply after a longer period to give affected stakeholders the time to develop and switch to alternatives. See related: La Pink Introduces Microplastic-free Skin Care Formulations in India Cosmetic Specifications The adopted measures specify that, concerning the ban on microbeads, i.e., synthetic polymer microparticles for use as an abrasive, namely to exfoliate, polish or clean, mainly used in rinse-off cosmetic products or detergents, no transitional period was proposed, as industry was expected to have voluntarily phased out their use by 2020. For certain \"leave-on\" cosmetic products, such as makeup, lip products and nail products, per the new restriction, due to their low contribution to the overall emissions of microplastics, as well as the potentially large impact on the cosmetics industry of a ban of synthetic polymer microparticles in those products, the agency's committee for socio-economic analysis (SEAC) considered two additional measures as appropriate alternatives to the ban on the placing on the market of those products after a six-year transitional period (as proposed by the Annex XV dossier). The additional measures included either: Appropriate instructions for use and disposal, or A transitional period longer than six years. However, the measures also cite that uncertainties related to the different impacts on industry and concerning releases did not allow the agency's committee for SEAC to conclude whether either option would be more appropriate than a ban and a six-year transitional period.","filter_flag":1}
{"title":"Giants lead green packaging future - Vietnam Investment Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5","id":"CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5\" target=\"_blank\">Giants lead green packaging future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vietnam Investment Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Giants lead green packaging future - Vietnam Investment Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vdmlyLmNvbS52bi9naWFudHMtbGVhZC1ncmVlbi1wYWNrYWdpbmctZnV0dXJlLTEwNTM0My5odG1s0gEA?oc=5\" target=\"_blank\">Giants lead green packaging future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vietnam Investment Review<\/font>","source.href":"https:\/\/vir.com.vn","source.title":"Vietnam Investment Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Giants lead green packaging future, illustration photo\/ Source: freepik.com About 450 businesses from more than 30 countries and territories will gather for the 16th edition of ProPak in Ho Chi Minh City in November to establish a panorama of equipment and new technology in future food processing and packaging. The exhibition will offer a dynamic business platform that is shaping the future of the processing and packaging industries, particularly in an industry closely impacting the environment like packaging. Food packaging currently accounts for 30-50 per cent of the total packaging industry space, according to statistics from the Ministry of Industry and Trade, leading to a strong symbiotic relationship between the two fields of food and packaging. According to German data provider Statista, the packaging sector has been growing on-year with an average rate of 15-20 per cent, in parallel with the average increase of about 10 per cent of the food and beverages market over the next four years. Statista predicts that the retail sales of packaged food is growing on-year in Vietnam, with it forecasted to grow to $18.4 billion in 2023 and become one of the fastest growing fields in Vietnam, attracting the participation of foreign business sector. After the investment and expansion of many foreign food packaging manufacturing enterprises in recent years, such as Tetra Pak, SCG Packaging, Wing Fat Printing, Meiwa Pax, and St. Johns Vietnam, the Vietnamese market continues to record the appearance of new faces. Packaging equipment multinational Sidel decided to move its headquarters from Thailand to Vietnam at the beginning of this year to take advantage of opportunities from a new market. According to East and West Asia sales director Parkpoom Praprom, Sidel had a representative office in Vietnam before 2023. “But now, all main departments have been brought to Vietnam, and Sidel also recruited more Vietnamese staff for this transformation,” he said. Last year, German waste management and recycling solutions provider ALBA Group Asia also signed a $50 million cooperation agreement with VietCycle partner in Vietnam to cooperate in developing a recycling plastic processing company with capacity of 48,000 tonnes a year. The result of this joint venture is the appearance of the first largest recycled plastic factory in the north, expected to come into operation in 2024. Changes in food packaging production receive active support from the production transformation process of food businesses for green and sustainable consumer needs from customers. According to consulting company Nielsen, 86 per cent of Vietnamese consumers said they are willing to pay more for products with biological or recycled packaging. Meanwhile, the Law on Environmental Protection that took effect last year and regulates the payment of emission treatment fees, also creates a push for manufacturers to invest more in the transition to green and sustainable packaging. The game continues to be led by foreign businesses with great potential and pioneering in environmental activities. Le Thi Hong Nhi, head of Communications and Corporate Affairs at Unilever Vietnam, said, “The green transformation journey plays a nuclear role in moving towards sustainable development. We are committed to building a green value chain and have pioneered achieving net-zero emissions across the entire operating system since 2021.” To date, Unilever has reduced by more than half the virgin plastic used in packaging. Nearly two-thirds of packaging is recyclable, while it has collected and processed more than 20,000 tonnes of plastic waste, improving social welfare conditions for more than 2,500 female workers in the informal collection workforce. Meanwhile, design improvements to eliminate unnecessary packaging, lower the use of virgin plastic, and replace with environmentally friendly materials helped Nestlé Vietnam reduce nearly 2,500 tonnes of plastic packaging over the last two years. Khuat Quang Hung, head of Corporate Affairs of Nestlé Vietnam, said that about 94 per cent of Nestlé’s product packaging is designed to be recyclable and reusable. This business is also aiming to use single-layer packaging to help operate recycling in an easier manner. “There is no sanction that forces the company to do so, but we recognise our responsibility and always want to be at the forefront of transformation activities,” Hung told VIR. The process of switching from paper straws to plastic straws for the Milo brand has tripled Nestlé’s production costs, but reduced up to 700 tonnes of disposable plastic each year. Improving the packaging of Maggi soy sauce and bottle caps also contributes to a 10 per cent improvement in the weight of plastic used for one product, equivalent to 130 tonnes of plastic per year. LaVie, a beverage brand belonging to Nestlé’s ecosystem, is also a pioneer in using PET recycled plastic. Currently, one bottle of LaVie uses 50 per cent recycled plastic. “Recycling is just one step of the circular economy, the necessary condition is to have a collection system, technology and solutions suitable for all types of product packaging,” Hung added. Nguyen Van Viet, chairman of the Vietnam Beer-Alcohol-Beverage Association, said that packaging technology is becoming an important challenge for the beverage industry because from 2024, manufacturers and importers will have to carry out extended producer responsibility according to the Law on Environmental Protection. “Businesses that produce and use cans and bottles all lose recycling costs. We are proposing solutions to overcome difficulties for businesses, including supporting recycling costs, especially for domestic enterprises that are behind foreign enterprises in both capital source and production scale,” Viet said. He admitted that while the country is doing a good job of recycling beverage cans, there are often issues when it comes to other types of packaging recycling. “The problem in Vietnam today is not what technology to apply, but how to recycle,” he said. According to Praprom from Sidel, this business wants to provide standard, sustainable packaging products, and reduce the amount of waste through simple recycling, “Glass packaging products take twice the time to be transported to the factory for washing and recycling. Canned products will not need to return to the factory but can be recycled directly at the collection point,” Praprom explained. Boon Teong Tee - General manager Informa Markets Vietnam Over the past few years, the food and beverage packaging industry has benefited from the development of e-commerce and the rapid spread of app-based delivery business locally, and the free trade agreements that Vietnam has participated in. The effects of social distancing in 2020-2021 have created consumer habits which rapidly spread due to the convenience it offers and has expanded the use of fast-moving consumer goods (FMCG) packaging. To date, we do not see this trend diminishing and in fact, it has accelerated due to its convenience element, and at the cost of more FMCG waste to be managed in the cities. This recent phenomenon has disrupted businesses and provided new opportunities for others. It has also introduced pressing needs of resource conservation through circularity practices, as Vietnam will be challenged to handle rapid FMCG waste volume increases. The urbanisation of Vietnam represents the key underlying reason, with both positive and negative effects for the environment and economy. Packaging remains one of the fastest growing sectors in the Vietnamese market, with a growth rate of 13.4 per cent per year in the 2015-2020 period. New products and technologies are expected to sustain this longer-term growth rate for the years to come. I think many market leaders are working aggressively towards creating products which generate less waste through circularity concepts that offer bigger recycling opportunities with lesser costs and simpler processes through the development of new materials and design. To acknowledge the growing importance of the drink and beverage industry, Informa Vietnam has also recently announced the launch of a dedicated exhibition focusing on new technologies and services to support the expanding drink and beverage industry. This exhibition cluster is co-located with Propak Vietnam and it is our intention to grow this sector aggressively for the expanding market. Hoang Duc Vuong - Chairman Vietnam Recycled Plastics Association The management of domestic waste in Vietnam in the past 40 years has not been properly cared for, with scrap taken to craft villages for recycling, causing pollution. For many years, waste has not been classified, leading to plastic scraps worth recycling being contaminated with unpleasant odors, and very difficult to clean. European deodorising technology will probably have to give up on waste in Vietnam if there is no waste classification. Most recyclers do not dare to use 100 per cent domestic scrap but mainly have to import scrap from abroad to ensure input. As for small recycling facilities in craft villages, the low quality of scrap is the very cause of poor quality recycled products, accompanied by secondary pollution. For businesses in this country, investment costs for recycling are very large, making competition with recycling craft villages more difficult. Classifying waste from beginning brings benefits that go beyond the development of the plastic recycling industry. Separating organic waste and recyclable waste from messy landfills is the first step to processing organic waste to make biofertiliser or animal feed and recycling less valuable waste such as nylon bags, cake shells, and candy shells. The benefits can be up to billions of dollars. I think that with the joint support of the community and international organisations, the recycling industry of Vietnam will also develop. It is because this is the path that must be taken if we want to build a circular economy, contribute to the circulation of waste, and save the cost of importing resources from abroad. Packaging provider SIG reinforces sustainability commitment in Asia Through its 25 years of sustainability journey in Asia, Switzerland-headquartered aseptic packaging solutions provider Schweizerische Industrie Gesellschaft (SIG) has been making ambitious sustainability commitments. Angela Lu, president and general manager Asia Pacific South at SIGdiscussed with VIR’s Luu Huong how SIG facilitates the consumer’s need for convenience, and how sustainable packaging is becoming a key focus for sustainability. ProPak Vietnam 2023 brings new solutions for the processing and packaging industry ProPak Vietnam 2023 is returning from November 8 to 10 at the Saigon Exhibition and Convention Center, promising to bring valuable trading opportunities for both domestic and foreign enterprises in the processing and packaging industries.","filter_flag":1}
{"title":"Neutrogena's Refillable Powder-To-Foam Waterless Cleanser Expands Mass Market Sustainable Skincare - Happi","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5oYXBwaS5jb20vZXhjbHVzaXZlcy9uZXV0cm9nZW5hcy1yZWZpbGxhYmxlLXBvd2Rlci10by1mb2FtLXdhdGVybGVzcy1jbGVhbnNlci1leHBhbmRzLW1hc3MtbWFya2V0LXN1c3RhaW5hYmxlLXNraW5jYXJlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5oYXBwaS5jb20vZXhjbHVzaXZlcy9uZXV0cm9nZW5hcy1yZWZpbGxhYmxlLXBvd2Rlci10by1mb2FtLXdhdGVybGVzcy1jbGVhbnNlci1leHBhbmRzLW1hc3MtbWFya2V0LXN1c3RhaW5hYmxlLXNraW5jYXJlL9IBAA?oc=5","id":"CBMigwFodHRwczovL3d3dy5oYXBwaS5jb20vZXhjbHVzaXZlcy9uZXV0cm9nZW5hcy1yZWZpbGxhYmxlLXBvd2Rlci10by1mb2FtLXdhdGVybGVzcy1jbGVhbnNlci1leHBhbmRzLW1hc3MtbWFya2V0LXN1c3RhaW5hYmxlLXNraW5jYXJlL9IBAA","guidislink":false,"published":"Mon, 11 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=254, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5oYXBwaS5jb20vZXhjbHVzaXZlcy9uZXV0cm9nZW5hcy1yZWZpbGxhYmxlLXBvd2Rlci10by1mb2FtLXdhdGVybGVzcy1jbGVhbnNlci1leHBhbmRzLW1hc3MtbWFya2V0LXN1c3RhaW5hYmxlLXNraW5jYXJlL9IBAA?oc=5\" target=\"_blank\">Neutrogena's Refillable Powder-To-Foam Waterless Cleanser Expands Mass Market Sustainable Skincare<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Neutrogena's Refillable Powder-To-Foam Waterless Cleanser Expands Mass Market Sustainable Skincare - Happi","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3d3dy5oYXBwaS5jb20vZXhjbHVzaXZlcy9uZXV0cm9nZW5hcy1yZWZpbGxhYmxlLXBvd2Rlci10by1mb2FtLXdhdGVybGVzcy1jbGVhbnNlci1leHBhbmRzLW1hc3MtbWFya2V0LXN1c3RhaW5hYmxlLXNraW5jYXJlL9IBAA?oc=5\" target=\"_blank\">Neutrogena's Refillable Powder-To-Foam Waterless Cleanser Expands Mass Market Sustainable Skincare<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","source.href":"https:\/\/www.happi.com","source.title":"Happi","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"A sustainable lifestyle shouldn’t come with a price tag that is out of reach for many. As more consumers look to live their lives more sustainably—including buying products that are kinder to the planet—there are opportunities for brands in the mass market to answer these needs by way of packaging, ingredient procurement and process. The refills are sold in single-use sachets. The refills are sold in single-use sachets. Kenvue's Leslie Rank Kenvue's Leslie Rank NPD at Neutrogena —the mass market skincare stalwart in Kenvue’s stable—is taking that tack. The company recently rolled out what it contends is the first powder-to-foam cleanser on the market. Neutrogena Gentle Foaming Cleanser + Concentrate marries must-have skincare performance and aesthetic needs with key sustainability attributes—it is waterless and refillable.“The waterless format idea stemmed from insights that consumers are becoming more interested in sustainable and waterless products that reduce plastic waste and energy consumption. This new form offers an opportunity for Neutrogena to deliver on consumers’ unmet sustainability demands without compromising the cleansing efficacy and gentleness of this product,” said Leslie Rank, principal scientist, skin health product and process innovation at Kenvue. (Kenvue is the standalone consumer health business spun off from Johnson & Johnson.)Users fill the Neutrogena reusable bottle with warm water and then add the concentrate.“The concentrate is a powder form that once added to water, turns into a foamy formula. When pumped out, consumers can expect a handful of cushiony foam,” said Rank, who noted that it is important to shake the bottle well before first use.When the cleanser is finished, consumers fill it with more water and another concentrate refill that comes in a small sachet “for a reusable daily face wash solution,” she said.Rank contends Neutrogena’s consumers are ready for a refillable product.“I think people are genuinely interested in investing in products that are not only gentle and respectful to the environment, but also their skin,” she said.The Neutrogena R&D team created a compact formula; it has just seven ingredients—Sodium Methyl Cocoyl Taurate, Sodium Cocoyl Isethionate, Sodium Benzoate, Magnesium Sulfate, Citric Acid, Disodium EDTA, Ascorbic Acid.“We worked diligently to create a formula with only seven ingredients to gently wash away dirt and impurities, while still leaving skin feeling refreshed and replenished,” said Rank. “We also ensured our formula was compatible with a sustainable packaging format that could deliver a soft, cushiony foam to give a comforting sensory experience.”In addition, it is 96% biodegradable, unscented, non-comedogenic and free of parabens, phthalates, sulfate-surfactants, alcohol, mineral oil and soap, noted Rank.According to Rank, Neutrogena continues to explore new packaging that reduces plastic usage.“In fact, we’re starting to begin work to investigate packaging increases the use of PCR plastic (post-consumer recycled) and sustainable pumps. These are in the early stages, but we always are looking for solutions that provide more eco-friendly packaging without compromising consumer’s skincare needs of gentle and effective solutions,” she told Happi.The new cleanser can be purchased at Target.com , Walmart.com and Rite Aid.com","filter_flag":1}
{"title":"Sustainable strides: Mengniu overcomes recyclability challenges of dairy packaging - FoodNavigator-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wOS8yMC9jaGluYS1kYWlyeS1naWFudC1tZW5nbml1LW92ZXJjb21lcy1yZWN5Y2xhYmlsaXR5LWNoYWxsZW5nZXMtb2YtZGFpcnktcGFja2FnaW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wOS8yMC9jaGluYS1kYWlyeS1naWFudC1tZW5nbml1LW92ZXJjb21lcy1yZWN5Y2xhYmlsaXR5LWNoYWxsZW5nZXMtb2YtZGFpcnktcGFja2FnaW5n0gEA?oc=5","id":"CBMihQFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wOS8yMC9jaGluYS1kYWlyeS1naWFudC1tZW5nbml1LW92ZXJjb21lcy1yZWN5Y2xhYmlsaXR5LWNoYWxsZW5nZXMtb2YtZGFpcnktcGFja2FnaW5n0gEA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wOS8yMC9jaGluYS1kYWlyeS1naWFudC1tZW5nbml1LW92ZXJjb21lcy1yZWN5Y2xhYmlsaXR5LWNoYWxsZW5nZXMtb2YtZGFpcnktcGFja2FnaW5n0gEA?oc=5\" target=\"_blank\">Sustainable strides: Mengniu overcomes recyclability challenges of dairy packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sustainable strides: Mengniu overcomes recyclability challenges of dairy packaging - FoodNavigator-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLWFzaWEuY29tL0FydGljbGUvMjAyMy8wOS8yMC9jaGluYS1kYWlyeS1naWFudC1tZW5nbml1LW92ZXJjb21lcy1yZWN5Y2xhYmlsaXR5LWNoYWxsZW5nZXMtb2YtZGFpcnktcGFja2FnaW5n0gEA?oc=5\" target=\"_blank\">Sustainable strides: Mengniu overcomes recyclability challenges of dairy packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator-Asia.com<\/font>","source.href":"https:\/\/www.foodnavigator-asia.com","source.title":"FoodNavigator-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"According to Daniel Lin, Sustainability Director of Mengniu, traditional dairy packaging faces significant challenges when it comes to being recyclable and its impact on the environment. “Many dairy products are using multi-layered packaging made of paper, plastic, or aluminium foil, making it complex and difficult to recycle,” ​he told FoodNavigator-Asia​. The new yoghurt pouch is created using Dow’s proprietary INNATE TF-BOPE resins, which enable the replacement of PET or BOPA in laminated film to achieve mono-material packaging. “The INNATE TF-BOPE resins deliver excellent toughness and printing performance, while still being aesthetically pleasing and functionally protective. Mono-material packaging, when recycled via appropriate mechanical recycling technologies, can be reused as high-quality PCR resins with increased value and versatility across different applications,” ​said Jayne Wong, Senior Group Marketing Director at Dow. Environmental-friendly manufacturing is an important pillar of Mengniu’s sustainability strategy, and adopting low-carbon packaging in all product lines is a significant part of it. The firm has set a goal to achieve 100% technically recyclable packaging by 2025. “Although sustainability is a relatively new concept for Chinese consumers, it has been gaining popularity due to the implementation of improvements in national standards, the support of corporations, and increasing eco-consciousness among the people. As a result, green consumption has become a rising trend in China.​ “We are always searching for ways to make dairy packaging more recyclable. Many of our products have obtained the ‘Double Easy’ certification recognised by TÜV Rheinland. The newly launched yogurt packaging empowered by Dow’s solution is another remarkable achievement,” ​Lin elaborated. On the same note, Wong shared that sustainable development is no longer a priority just for international brands, and that Chinese companies are increasingly taking action to promote the widespread use of sustainable packaging. “Mengniu serves as a prime example of this commitment to sustainability. From the consumer perspective, it calls for brand owners to close the loop on packaging waste, and for the industry at large to design for recyclability.” ​ Sustainability strategies​ In 2021, Mengniu introduced a sustainable development strategy called GREEN, which focuses on five pillars: sustainable corporate governance, prosperity for all in the dairy industry, environmentally friendly production, responsible industry ecosystems, and nutritionally excellent products. The firm follows The Consumer Goods Forum’s Golden Design Rules and has developed various “green products” that use sustainable packaging, including Future Star Milk and Youyi C drinks. “As a large dairy company operating in primary, secondary, and tertiary industries, we are committed to sustainable practices and aspire to champion green consumption.​ “Our industrial chain is extensive, ranging from pasture management and product processing to packaging and transportation. Each chain link presents sustainability challenges and opportunities for a green transformation,” ​said Lin. At the same time, Mengniu seeks to have more engagement with consumers, and to partner with “innovation experts” like Dow to apply advanced technologies in production processes. “Interacting with customers is vital for developing eco-conscious products and educating them about responsible consumption. Enhancing consumer eco-consciousness will significantly boost sustainable development in the dairy industry.​ “Furthermore, government policies and industry standards must work hand in hand. Besides collaborating on product R&D, brand owners and manufacturers must also step up, and advocate for the creation of relevant policies and standards. This will provide guidance for sustainable practices, allowing them to flourish and progress,” ​Lin added. Similarly, Dow believes that the packaging value chain should continue to collaborate with related government departments and organisations, such as Alliance to End Plastic Waste, to develop and commercialise more recyclable packaging. The company has also set new targets around advancing a circular economy and climate protection by focusing on reducing carbon emissions and eliminating plastic waste. Through its Pack Studios, where businesses in the materials science, machinery, and converting industries as well as brand owners can communicate and collaborate closely, Dow aims to facilitate the acceleration of sustainable packaging development.","filter_flag":1}
{"title":"New products by Brilliant Polymers at Elite Speciality Films & Flexible Packaging summit - Packaging South Asia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcGFja2FnaW5nc291dGhhc2lhLmNvbS9ldmVudHMvYnJpbGxpYW50LXBvbHltZXJzLWF0LWVsaXRlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcGFja2FnaW5nc291dGhhc2lhLmNvbS9ldmVudHMvYnJpbGxpYW50LXBvbHltZXJzLWF0LWVsaXRlL9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vcGFja2FnaW5nc291dGhhc2lhLmNvbS9ldmVudHMvYnJpbGxpYW50LXBvbHltZXJzLWF0LWVsaXRlL9IBAA","guidislink":false,"published":"Fri, 15 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=258, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcGFja2FnaW5nc291dGhhc2lhLmNvbS9ldmVudHMvYnJpbGxpYW50LXBvbHltZXJzLWF0LWVsaXRlL9IBAA?oc=5\" target=\"_blank\">New products by Brilliant Polymers at Elite Speciality Films & Flexible Packaging summit<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging South Asia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New products by Brilliant Polymers at Elite Speciality Films & Flexible Packaging summit - Packaging South Asia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vcGFja2FnaW5nc291dGhhc2lhLmNvbS9ldmVudHMvYnJpbGxpYW50LXBvbHltZXJzLWF0LWVsaXRlL9IBAA?oc=5\" target=\"_blank\">New products by Brilliant Polymers at Elite Speciality Films & Flexible Packaging summit<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging South Asia<\/font>","source.href":"https:\/\/packagingsouthasia.com","source.title":"Packaging South Asia","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Packaging South Asia — resilient, growing and impactful — daily, monthly — always responsive The multi-channel B2B in print and digital 17-year-old platform matches the industry’s growth trajectory. The Indian, South Asian, Southeast Asian, and Middle East packaging industries are looking beyond the resilience of the past three years. They are resuming capacity expansion and diversification, with high technology and automation in new plants and projects. As we present our 2024 publishing plan, India’s real GDP growth for the financial year ending 31 March 2024 will exceed 6%. The packaging industry growth will match the GDP growth in volume terms and surpass it by at least 3% in terms of nominal growth allowing for price inflation in energy, raw materials, consumables, and capital equipment. The capacity for flexible film manufacturing in India increased by 45% over the past four years. With orders in place, we expect another 20% capacity addition in 2024 and 2025. Capacities in monocartons, corrugation, aseptic liquid packaging, and labels are growing similarly. As the consumption story returns over the next six months, we expect demand to return and exceed the growth trajectory of previous years. The numbers are positive for most of the economies in the region – and as shown by our analytics, our platform increasingly reaches and influences these. For responsible and sustainable packaging, with its attendant regulations and compliances, there is significant headroom to grow in India and the region. Our coverage includes the entire packaging supply chain – from concept to shelf and to waste collection, sorting, and recycling. We target brand owners, product managers, raw material suppliers, packaging designers and converters, and recyclers. This is a large and complex canvas – the only thing that can work is your agile thinking and innovation together with our continuous learning and persistence. The coming year looks to be an up year in this region, and this is the right time to plan your participation and marketing communication – in our rich and highly targeted business platform with human resources on the ground. Share your thoughts and plans to inspire and mobilize our editorial and advertising teams! For editorial info@ippgroup.in — for advertisement ads1@ippgroup.in and for subscriptions subscription@ippgroup.in – Naresh Khanna (25 October 2023)","filter_flag":1}
{"title":"Subtle Energies rings in 30th anniversary with new Biotechnology Skincare range and packaging overhaul ... - Spa Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5zcGFidXNpbmVzcy5jb20vd2VsbG5lc3MtcHJvZHVjdHMtYW5kLXNlcnZpY2VzL1N1YnRsZS1FbmVyZ2llcy1yaW5ncy1pbi0zMHRoLWFubml2ZXJzYXJ5LXdpdGgtbmV3LUJpb3RlY2hub2xvZ3ktU2tpbmNhcmUtcmFuZ2UtYW5kLXBhY2thZ2luZy1vdmVyaGF1bC8zNTE4NjnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5zcGFidXNpbmVzcy5jb20vd2VsbG5lc3MtcHJvZHVjdHMtYW5kLXNlcnZpY2VzL1N1YnRsZS1FbmVyZ2llcy1yaW5ncy1pbi0zMHRoLWFubml2ZXJzYXJ5LXdpdGgtbmV3LUJpb3RlY2hub2xvZ3ktU2tpbmNhcmUtcmFuZ2UtYW5kLXBhY2thZ2luZy1vdmVyaGF1bC8zNTE4NjnSAQA?oc=5","id":"CBMiqAFodHRwczovL3d3dy5zcGFidXNpbmVzcy5jb20vd2VsbG5lc3MtcHJvZHVjdHMtYW5kLXNlcnZpY2VzL1N1YnRsZS1FbmVyZ2llcy1yaW5ncy1pbi0zMHRoLWFubml2ZXJzYXJ5LXdpdGgtbmV3LUJpb3RlY2hub2xvZ3ktU2tpbmNhcmUtcmFuZ2UtYW5kLXBhY2thZ2luZy1vdmVyaGF1bC8zNTE4NjnSAQA","guidislink":false,"published":"Mon, 18 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=261, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5zcGFidXNpbmVzcy5jb20vd2VsbG5lc3MtcHJvZHVjdHMtYW5kLXNlcnZpY2VzL1N1YnRsZS1FbmVyZ2llcy1yaW5ncy1pbi0zMHRoLWFubml2ZXJzYXJ5LXdpdGgtbmV3LUJpb3RlY2hub2xvZ3ktU2tpbmNhcmUtcmFuZ2UtYW5kLXBhY2thZ2luZy1vdmVyaGF1bC8zNTE4NjnSAQA?oc=5\" target=\"_blank\">Subtle Energies rings in 30th anniversary with new Biotechnology Skincare range and packaging overhaul ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Spa Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Subtle Energies rings in 30th anniversary with new Biotechnology Skincare range and packaging overhaul ... - Spa Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiqAFodHRwczovL3d3dy5zcGFidXNpbmVzcy5jb20vd2VsbG5lc3MtcHJvZHVjdHMtYW5kLXNlcnZpY2VzL1N1YnRsZS1FbmVyZ2llcy1yaW5ncy1pbi0zMHRoLWFubml2ZXJzYXJ5LXdpdGgtbmV3LUJpb3RlY2hub2xvZ3ktU2tpbmNhcmUtcmFuZ2UtYW5kLXBhY2thZ2luZy1vdmVyaGF1bC8zNTE4NjnSAQA?oc=5\" target=\"_blank\">Subtle Energies rings in 30th anniversary with new Biotechnology Skincare range and packaging overhaul ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Spa Business<\/font>","source.href":"https:\/\/www.spabusiness.com","source.title":"Spa Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"PRODUCT NEWS Subtle Energies rings in 30th anniversary with new Biotechnology Skincare range and packaging overhaul Subtle Energies has refreshed its packaging and branding with a chic new look to strengthen its shelf presence while elevating the consumer shopping experience \/ Subtle Energies We’ll celebrate this significant milestone globally with a full rebrand, elevating our packaging and taking the best from our past 30 years to shape the next – Farida Irani We’ll celebrate this significant milestone globally with a full rebrand, elevating our packaging and taking the best from our past 30 years to shape the next Australian skincare brand Subtle Energies has marked its 30th anniversary with new products, treatments and a sustainable packaging upgrade. Originating as a clinic focused on treating chronic ailments, Subtle Energies has evolved into a global Ayurveda wellness lifestyle solution and skincare brand. The company's products are available in 25 countries and used in spa treatments by established operators including Six Senses, Soneva, Mandarin Oriental and Raffles, as well as iconic spa and wellness destinations including Kamalaya and The Royal Mansour Marrakech. All-new skincare and branded treatments To celebrate this milestone, the family-run company is introducing its Biotechnology Skincare range after years in the making. The line – which includes new facials, therapeutic body treatments and advanced holistic massages – has launched this month with a Vegan Collagen Serum, Multi Molecular Hyaluronic Acid serum and Pomegranate Enzyme Mask. Subtle Energies' founder Farida Irani reflects on the company's journey. “As we commemorate our 30-year voyage, we extend our sincere gratitude to all our partners, clinic clientele, our customers, our team and our family who have shaped Subtle Energies into what it is today. “From our beginnings as a clinic, we’ve steadily grown into a wellness lifestyle solutions and skincare brand, proudly found in some of the world’s most iconic destinations. “We feel very humbled and proud to share our story. We’ll celebrate this significant milestone globally with a full rebrand, elevating our packaging and taking the best from our past 30 years to shape the next.” Packaging upgrades To mark the beginning of a new chapter, Subtle Energies has also updated its packaging. While always striving to improve its sustainable output, the new design and look of the original logo have been chosen to strengthen the brand's shelf presence while elevating the consumer shopping experience. Adding to the brand’s existing accreditations from Cruelty Free International, the packaging also displays COSMOS Natural and Vegan Society certifications. Nick Irani, director of operations and brand development, shares: “After some years of development, we’re proud to launch Subtle Energies into our 30th year with a renewed and inspired pathway forward with our most advanced and progressive natural skincare ranges across our partners globally. “Our newest innovations aim to provide a cosmetic look and feel, using only the best and purest natural ingredients, which in turn give you transformative results of the skin looking plump and youthful. “Our aim is to continue to redefine natural skincare with innovative and new ways to combine the science of nature.” The Biotechnology Skincare range features three products which will be showcased in a suite of new spa rituals \/ Credit: Subtle Energies Company profile Subtle Energies Subtle Energies was founded in 1993 as a clinic by Farida Irani in Sydney Australia. Read Subtle Energies's full profile here Subtle Energies was founded in 1993 as a clinic by Farida Irani in Sydney Australia. Supplier details Subtle Energies West Pennant Hills New South Wales Australia Subtle Energies creates results-based aromatherapy, natural skincare and wellness solutions founded on authentic ayurveda principles. The range addresses multiple skin and body concerns, while delivering high-performance results, empowering one’s physical, mental and emotional wellbeing. Subtle Energies’ spa concept provides treatment programmes that combine ancient sciences with holistic, modern techniques. All products are made in Australia following European standards of natural skincare, to create safe, ethical and effective products. The range has been certified by Cruelty Free International and does not contain parabens, mineral oils, silicones or artificial fragrances. www.subtleenergies.com.au More details West Pennant Hills New South Wales AustraliaSubtle Energies creates results-based aromatherapy, natural skincare and wellness solutions founded on authentic ayurveda principles. The range addresses multiple skin and body concerns, while delivering high-performance results, empowering one’s physical, mental and emotional wellbeing. Subtle Energies’ spa concept provides treatment programmes that combine ancient sciences with holistic, modern techniques. All products are made in Australia following European standards of natural skincare, to create safe, ethical and effective products. The range has been certified by Cruelty Free International and does not contain parabens, mineral oils, silicones or artificial fragrances.","filter_flag":1}
{"title":"Amcor research shows strong demand for own brand food - FoodManufacture.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMjcvQW1jb3ItcmVzZWFyY2gtc2hvd3Mtc3Ryb25nLWRlbWFuZC1mb3Itb3duLWJyYW5kLWZvb2TSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMjcvQW1jb3ItcmVzZWFyY2gtc2hvd3Mtc3Ryb25nLWRlbWFuZC1mb3Itb3duLWJyYW5kLWZvb2TSAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMjcvQW1jb3ItcmVzZWFyY2gtc2hvd3Mtc3Ryb25nLWRlbWFuZC1mb3Itb3duLWJyYW5kLWZvb2TSAQA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMjcvQW1jb3ItcmVzZWFyY2gtc2hvd3Mtc3Ryb25nLWRlbWFuZC1mb3Itb3duLWJyYW5kLWZvb2TSAQA?oc=5\" target=\"_blank\">Amcor research shows strong demand for own brand food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Amcor research shows strong demand for own brand food - FoodManufacture.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMjcvQW1jb3ItcmVzZWFyY2gtc2hvd3Mtc3Ryb25nLWRlbWFuZC1mb3Itb3duLWJyYW5kLWZvb2TSAQA?oc=5\" target=\"_blank\">Amcor research shows strong demand for own brand food<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","source.href":"https:\/\/www.foodmanufacture.co.uk","source.title":"FoodManufacture.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The study surveyed more than 3,000 shoppers in the UK, France, Germany, Italy, Poland and Netherlands, with 85% of respondents highlighting price as the primary reason for them choosing own brand products over branded alternatives. Promotions were highlighted as the second biggest factor in determining a consumer’s decision to purchase private label items, mentioned by 48% of respondents. Of those that have sought out own brand products due to their lower price point, 51% said they will continue to buy them due to their quality. When discussing what determines the quality of a product, the most common answers were ‘better taste’, ‘local production’ and ‘cleaner ingredients’. Sustainability and packaging concerns also influence consumer behaviour and the likelihood they will purchase private label products. More than 40% believe that efforts have been made to improve the sustainability of own brand products and 34% said they have seen progress in reducing food waste. A third felt that more sustainable packaging has become more common, while 28% stated that more sustainable packaging influenced their decision to buy private label products. However, 35% answered that less excessive packaging should be used. Quality still important to demand Strategic marketing and value chain manager at Amcor, Madalina Mitru, said that despite concerns around price and sustainability, the quality of own brand items was a “crucial factor​” in their success. Mitru explained: “Taste, quality, and origin are all still important when consumers are making purchasing decisions​. Furthermore, over half of [respondents] said they perceive no difference in the quality of private-label products versus branded ones, putting private-label brands in a strong position for the future​.” According to Mitru, the results also show that consumers increasingly expect both private label and brand products to be produced and packaged sustainably. “Retailers and brands can adopt more sustainable packaging to help retain customers and demonstrate their continued commitment to driving circularity and reducing their carbon footprint​,” she said. Elsewhere, potato supplier Branston has named the new manager of its protein extraction facility, which is due to launch next year​​.","filter_flag":1}
{"title":"Omnia Packaging brings sustainable packaging business to Guelph - University of Guelph News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZ3VlbHBoLmNhLzIwMjMvMDkvb21uaWEtcGFja2FnaW5nLWJyaW5ncy1zdXN0YWluYWJsZS1wYWNrYWdpbmctYnVzaW5lc3MtdG8tZ3VlbHBoL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZ3VlbHBoLmNhLzIwMjMvMDkvb21uaWEtcGFja2FnaW5nLWJyaW5ncy1zdXN0YWluYWJsZS1wYWNrYWdpbmctYnVzaW5lc3MtdG8tZ3VlbHBoL9IBAA?oc=5","id":"CBMiWmh0dHBzOi8vZ3VlbHBoLmNhLzIwMjMvMDkvb21uaWEtcGFja2FnaW5nLWJyaW5ncy1zdXN0YWluYWJsZS1wYWNrYWdpbmctYnVzaW5lc3MtdG8tZ3VlbHBoL9IBAA","guidislink":false,"published":"Thu, 21 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZ3VlbHBoLmNhLzIwMjMvMDkvb21uaWEtcGFja2FnaW5nLWJyaW5ncy1zdXN0YWluYWJsZS1wYWNrYWdpbmctYnVzaW5lc3MtdG8tZ3VlbHBoL9IBAA?oc=5\" target=\"_blank\">Omnia Packaging brings sustainable packaging business to Guelph<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Guelph News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Omnia Packaging brings sustainable packaging business to Guelph - University of Guelph News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZ3VlbHBoLmNhLzIwMjMvMDkvb21uaWEtcGFja2FnaW5nLWJyaW5ncy1zdXN0YWluYWJsZS1wYWNrYWdpbmctYnVzaW5lc3MtdG8tZ3VlbHBoL9IBAA?oc=5\" target=\"_blank\">Omnia Packaging brings sustainable packaging business to Guelph<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">University of Guelph News<\/font>","source.href":"https:\/\/guelph.ca","source.title":"University of Guelph News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Guelph, Ont., September 21, 2023 – Omnia Packaging, the Canadian subsidiary of Italian company Gruppo Sunino, has landed in Guelph, bringing half a century of expertise in injection moulded plastic containers – a production process that incorporates modern, sustainable solutions. Family owned, Omnia Packaging has two production divisions: paper and plastic. The paper division produces an innovative paper-based and glue-free packaging solution that can replace top-sealed polyethylene terephthalate (PET) trays without changing existing equipment. Mustang Paper Trays packages fresh produce from Canadian greenhouses and growers with expansions in the United States and Mexico. The plastic division provides sustainable plastic packaging to dairy and confectionary producers and co-packers. Omnia’s research and development aims to improve existing packaging and provide innovative packaging solutions for new products. “We commend Guelph for its well-structured recycling and sustainability programs and appreciate the support from the City and their partners, such as Innovation Guelph, who share our commitment to sustainability and a circular economy,” says Paolo Sunino, owner of Omnia Packaging. Part of Omnia’s expansion plans include hiring ten employees by next March. “The City’s commitment to economic growth and prosperity and active work to attract and retain businesses has helped create a vibrant business community,” adds Sunino. “With easy access to several international airports that facilitate global business connections and a steady supply of skilled graduates, particularly in the agri-food and biotechnology sectors, Guelph is the right place to expand our business.” “Omnia adds to Guelph’s already thriving agri-innovation cluster. We look forward to our continued work together to grow their company in our community and bring modern packaging solutions to the Canadian marketplace,” says Christine Chapman, the City’s manager of Economic Development. Omnia Packaging received $3.7 million in funding from the Government of Canada through a zero per cent loan granted through the Federal Economic Development Agency for Southern Ontario. About Invest in Guelph Invest in Guelph makes it easy to do business in Guelph. Our expert team is ready to help, whether making business connections, growing your business, choosing a site, or finding new markets. We provide a suite of programs and services to support business expansion and re-location and are your resource for property development, business promotions, and partnerships. In addition, we support people making Guelph their home, their place of business, their resilient community. Media Contact Christine Chapman, Manager Economic Development, Economic Development and Tourism City of Guelph 519-822-1260 extension 2823 [email protected]","filter_flag":1}
{"title":"CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5\" target=\"_blank\">CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5\" target=\"_blank\">CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Thousands of organizations in Europe and worldwide have embraced the CEFLEX ‘Designing for a Circular Economy’ (D4ACE) guidelines since they were launched in 2020. Their objective is to ensure all flexible packaging is optimized for collection, sorting and recycling – and producing higher quality recycled materials to be used again in the circular economy. To help facilitate their use, CEFLEX has teamed up with recyclability experts Recyda to deliver design-check.ceflex.eu. This free service has been extensively beta-tested by CEFLEX stakeholders and is now being made available for anyone wanting to make a quick and effective assessment on their design journey. The ‘Design Check’ tool was developed in response to users of the guidelines who requested a way to check if a packaging design or specification adheres to them when assessing their packaging portfolios and developing new products with partners, suppliers and customers. “The tool can be used either to assess an existing package, facilitate the R&D and design process, engage with other parts of the value chain, or prepare for recyclability testing,” explained CEFLEX design lead Liz Morrish. “A team of CEFLEX stakeholders developed and tested the tool – including confidentiality and data protection elements – and many stakeholder companies have already used it successfully.” “Assessment covers all parts of the guidelines, including their sortability and recyclability principles. It indicates if a specification or design is compatible, has limited compatibility or is not compatible in terms of the D4ACE categories. Users are also able to undertake assessments for multiple specifications or designs,” Morrish added. “The Design Check tool makes our guidelines easier to use, providing a record to track improvements over time and helping the value chain continue to accelerate progress on circular design,” noted Graham Houlder, CEFLEX project coordinator. “It specifically responds to the particular needs of our stakeholders and wider flexible packaging market.” The check against D4ACE guidelines assesses whether a specification or design is Compatible – Limited compatibility – Not compatible for polyethene (PE), Polypropylene (PP) or mixed polyolefin (PO) mechanical recycling processes. By entering information about the materials and elements used in a flexible packaging structure – such as the polymer type, amount of ink and adhesives, and barrier layers – users can quickly establish whether the design adheres to the CEFLEX guidelines. The confidential online tool is applicable to: Flexible packaging structures and flexible films Packaging at R&D stage or on the market And can be used to check packaging designs or specifications:","filter_flag":1}
{"title":"DTS Europe actively contributes to a more sustainable Beauty generation - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9kdHMtZXVyb3BlLWFjdGl2ZWx5LWNvbnRyaWJ1dGVzLXRvLDIyNjU3LGVu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9kdHMtZXVyb3BlLWFjdGl2ZWx5LWNvbnRyaWJ1dGVzLXRvLDIyNjU3LGVu0gEA?oc=5","id":"CBMiUGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9kdHMtZXVyb3BlLWFjdGl2ZWx5LWNvbnRyaWJ1dGVzLXRvLDIyNjU3LGVu0gEA","guidislink":false,"published":"Tue, 26 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=269, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9kdHMtZXVyb3BlLWFjdGl2ZWx5LWNvbnRyaWJ1dGVzLXRvLDIyNjU3LGVu0gEA?oc=5\" target=\"_blank\">DTS Europe actively contributes to a more sustainable Beauty generation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"DTS Europe actively contributes to a more sustainable Beauty generation - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9kdHMtZXVyb3BlLWFjdGl2ZWx5LWNvbnRyaWJ1dGVzLXRvLDIyNjU3LGVu0gEA?oc=5\" target=\"_blank\">DTS Europe actively contributes to a more sustainable Beauty generation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The theme of sustainability is not only present in the development and design process of each packaging created and produced by DTS Europe, but has also been the basic pillar of its origin and values. The environmental impact and recyclability of each project is assessed. As a result, DTS Europe offers the market a complete and varied range of mono-material and 100% recyclable products. Cosmetic products formulations and sustainability We associate sustainable formulations with organic or natural ingredients. Natural formulas are usually quite challenging as they contain active ingredients and no preservatives. In most cases, this type of formula requires an airless system that doesn’t oxidise the formula and protects it until it comes into contact with the skin. Is it easy to find airless packaging? Yes. Is it easy to find sustainable airless packaging? No! DTS Europe Mono-material Airless Systems and Packaging DTS Europe allows cosmetics brands to choose and develop natural formulations and to choose sustainable packaging for these formulations. The European company based in Portugal develops sustainable packaging (100% mono-material and 100% recyclable) that can transport these formulations to the consumer. Mono-material packaging plays a fundamental role in the entire sustainability chain and in the circular economy, enabling easy recycling by the end-consumer and recyclability in the recycling industries (reducing the amount of resin to just one), allowing for collection, sorting, separation and recycling within European levels. The packaging produced by DTS Europe has all the necessary characteristics that guarantee the quality of the material after recycling, generating a high quality PCR, fully integrated into the circular economy. A sustainable range DTS Europe’s niche portfolio includes a wide range of sustainable and elegant packaging capable of integrating any skincare and make-up product line. The range consists of flexible packaging available in more than 5 diameters and filling capacities ranging from 8ml to 90ml. Taking another step forward in the design of mono-material packaging, DTS Europe has just launched the innovative Pump Pacific - 100% recyclable and 100% made of PE - a solution that is easy to separate and easily integrated into any skincare or make-up line. Innovation and the Future The next few years will be marked by major innovations that will revolutionise sustainable packaging. They will also be years in which DTS Europe will launch the \"Local Communities\" project where it will work together with its communities to reduce their carbon footprint and encourage them to have a more sustainable footprint.","filter_flag":1}
{"title":"Molpack, HP Team Up to Revolutionize Molded Fiber Production in Latin America - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwOTAtbW9scGFjay1ocC10ZWFtLXVwLXRvLXJldm9sdXRpb25pemUtbW9sZGVkLWZpYmVyLXByb2R1Y3Rpb24taW4tbGF0aW4tYW1lcmljYdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwOTAtbW9scGFjay1ocC10ZWFtLXVwLXRvLXJldm9sdXRpb25pemUtbW9sZGVkLWZpYmVyLXByb2R1Y3Rpb24taW4tbGF0aW4tYW1lcmljYdIBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwOTAtbW9scGFjay1ocC10ZWFtLXVwLXRvLXJldm9sdXRpb25pemUtbW9sZGVkLWZpYmVyLXByb2R1Y3Rpb24taW4tbGF0aW4tYW1lcmljYdIBAA","guidislink":false,"published":"Wed, 06 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=249, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwOTAtbW9scGFjay1ocC10ZWFtLXVwLXRvLXJldm9sdXRpb25pemUtbW9sZGVkLWZpYmVyLXByb2R1Y3Rpb24taW4tbGF0aW4tYW1lcmljYdIBAA?oc=5\" target=\"_blank\">Molpack, HP Team Up to Revolutionize Molded Fiber Production in Latin America<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Molpack, HP Team Up to Revolutionize Molded Fiber Production in Latin America - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQwOTAtbW9scGFjay1ocC10ZWFtLXVwLXRvLXJldm9sdXRpb25pemUtbW9sZGVkLWZpYmVyLXByb2R1Y3Rpb24taW4tbGF0aW4tYW1lcmljYdIBAA?oc=5\" target=\"_blank\">Molpack, HP Team Up to Revolutionize Molded Fiber Production in Latin America<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable packaging\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Guamolsa, part of Molpack Corporation, a leading molded fiber packaging provider in Latin America, has partnered with HP to digitize and transform the industrial production of molded fiber products. Through this groundbreaking collaboration, Molpack is taking significant strides in reducing CO2 emissions and replacing single-use plastics with more sustainable packaging solutions. By combining their expertise, both companies are driving innovation and sustainability in the molded fiber industry. Juan Lozada, Regional Manager of Molpack Central America, stated that the company has successfully deployed HP's Molded Fiber Advanced Tooling Solution at its factory in Guatemala to manufacture fruit trays as well as other commodity products, made from recycled paper. With the commitment to expand this product offering across its entire lineup by the end of this year, Molpack is set to revolutionize the production of molded fiber packaging on an industrial scale. Lozada expressed his enthusiasm, saying, \"Our collaboration with HP allows us to leverage computer modeling and design, enabling us to overcome the challenges we faced in the past, particularly in hot Central American environments where humidity and high temperatures presented difficulties for biodegradable solutions. Apart from the products we are currently working on with HP, we have a few others in the pipeline as well and will be working with those as well shortly.\" HP's Molded Fiber Tooling Solution offers customized digital solutions tailored to companies like Molpack, enabling them to achieve unprecedented levels of efficiency and sustainability. The adoption of HP's technology empowers them to deliver innovative products that meet the evolving needs of consumers and businesses. The solution includes the new HP Molded Fiber Advanced Tooling technology, which optimizes manufacturing processes, delivering high-quality products with enhanced performance through Computational Fluid Dynamics (CFD) grammage control and customized features like logos and textures. Additionally, it significantly enhances Molded Fiber packaging sustainability by reducing the carbon footprint during tooling and part production, resulting in lighter parts with equal or better performance. Mariona Company, Global Head of Fiber-Based Sustainable Packaging at HP, emphasized the significance of the collaboration, saying, \"HP's Molded Fiber Tooling Solution technology is empowering companies like Molpack to deliver efficiencies, introduce new products, and reduce CO2 emissions. By working together, Molpack and HP are at the forefront of driving innovation and sustainability in the molded fiber industry in Latin America.\" HP’s ambition is to be a lighthouse brand for purpose. By 2030, the company intends to become the world’s most sustainable and just technology company. With a shared vision and common goals, Molpack and HP are united in their commitment to creating a better future. This collaboration serves as a testament to the power of innovation, driving the industry toward a more sustainable and environmentally conscious approach to packaging production. About Molpack Corporation Molpack Corporation is a leading group of companies that anticipates and meets global packaging needs by offering a wide range of high-quality products at competitive prices. With a presence in seven Latin American countries, the group specializes in molded fiber solutions, aiming to reduce plastic usage and become the foremost provider of profitable eco-friendly packaging in Latin America","filter_flag":1}
