{"title":"Clean energy is poised for growth in the new industrial age - Inhabitat","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5","id":"CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA","guidislink":false,"published":"Tue, 09 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=129, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5\" target=\"_blank\">Clean energy is poised for growth in the new industrial age<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Clean energy is poised for growth in the new industrial age - Inhabitat","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vaW5oYWJpdGF0LmNvbS9jbGVhbi1lbmVyZ3ktaXMtcG9pc2VkLWZvci1ncm93dGgtaW4tdGhlLW5ldy1pbmR1c3RyaWFsLWFnZS_SAQA?oc=5\" target=\"_blank\">Clean energy is poised for growth in the new industrial age<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","source.href":"https:\/\/inhabitat.com","source.title":"Inhabitat","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The International Energy Agency has just published its IEA’s Energy Technology Perspectives 2023 report, in which the IEA states that clean energy manufacturing is primed for substantial growth as world enters a “new industrial age.” The report published an estimate that clean technology manufacturing could soon be worth “hundreds of billions of dollars per year.” Across the globe, there has been a major (roughly 50%) increase in investment in clean energy. The IEA is reporting that today’s clean energy investment across the globe of 1.3 trillion U.S. dollars will rise to roughly 2 trillion dollars, in only a few years. Continue reading below Our Featured Videos This incredible growth in investment in sustainable technologies will boost growth in the energy sector and in auto manufacturing with the transition to EVs. Plus, it will contribute to growth in available products in solar, hydrogen, nuclear and wind power. Related: Largest US offshore wind farm approved in Virginia How quickly is sustainable energy growing in the U.S.? China is currently dominating the production and trade of most clean energies currently, but the U.S.’s recent Inflation Reduction Act and other energy bills are encouraging investment in U.S. energy infrastructure and clean energy manufacturing, so the U.S. is expected to become a major center of sustainable energy usage and manufacturing in the coming decade. Will current supply chain issues affect the growth of this budding sustainable industry? Here is the state of clean energy in the U.S., and where it is expected to go in the near future. The current state of clean energy in the U.S. The IEA’s report referred to “the dawn of a new industrial age,” and examined the state of manufacturing for wind turbines, heat pumps, batteries for electric vehicles, solar panels and electrolyzers for hydrogen power. The conclusion of the report was that “the global market for key mass-manufactured clean energy technologies” will be worth about $650 billion per year by 2030, a more than three-fold increase in size from today’s clean energy industry. And unlike previous reports from other outlets, this change is predicted to happen this decade, not half a century in the future. It is already happening now. “The related clean energy manufacturing jobs would more than double from 6 million today to nearly 14 million by 2030 and further rapid industrial and employment growth is expected in the following decades as transitions progress,” the IEA said. For comparison, eight million is the same number of jobs lost in 2 years at the beginning of the Great Recession. In March of 2021, by contrast, there were eight million job openings available as the COVID-19 pandemic shuffled the job market to remote and more flexible work arrangements, the peak of demand for talent. That’s a lot of jobs. Diversifying the supply chain for clean technologies would help bolster and protect the growth of the clean energy industry. But there are other challenges to this new industry’s rapid rise. Challenges to clean energy industry growth A notable recent challenge surely is still the supply chain instability. Disruptions to supply chains have been legendary in recent years due to COVID-19 disrupting manufacturing supply lines and facility operations. The IEA report warned of “potentially risky levels of concentration in clean energy supply chains — both for the manufacturing of technologies and the materials on which they rely.” The U.S. also will see China as a competitor for production of clean energy technologies and market control of global energy consumers, as it currently dominates 70% of both clean production and clean energy markets. World leaders have focused on their own country’s plans for energy independence, rather than working together globally to solve climate change. Competitive markets, while great for inspiring competitive product development, waste a lot of time and resources when countries need to compete over energy market control rather than collaborate. As climate change worsens, it is likely to cause more civil unrest, which further complicates the issue. Also problematic is the mining for rare minerals and metals critical to current battery technology to power clean energy devices. This mining is concentrated in a small number of countries, which leads to instability in the supply chain if mining runs dry or is interrupted by natural disasters or geopolitical conflict. The Democratic Republic of Congo produces over 70% of the world’s cobalt, and just three countries — Australia, Chile and China — account for more than 90% of global lithium production. What could help in this case is the development of technologies that don’t rely on rare materials, the science to synthesize needed materials, or the improvement of battery technologies to be more efficient, which is in progress. what could change in the new industrial age So where do we go in the new industrial age? Clean energy is predicted to change nearly everything about how we live, which isn’t a bad comparison with the last century’s rise of factories, the automobile, and unionized workers. Clean energy will change everything: the balance of global power, the way we move and cook and harvest electricity, how interdependent we are and our awareness of our impact on the planet. Here’s to hoping that the new industrial age will look like flying cars that make not one speck of pollution. It really could be coming this time. Maybe by 2030? Via CNBC Lead image via Pexels","filter_flag":1}
{"title":"How is Swancor Developing Toward the Future? - AZoM","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI2NjDSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI2NjDSAQA?oc=5","id":"CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI2NjDSAQA","guidislink":false,"published":"Mon, 15 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=135, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI2NjDSAQA?oc=5\" target=\"_blank\">How is Swancor Developing Toward the Future?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoM<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How is Swancor Developing Toward the Future? - AZoM","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMWh0dHBzOi8vd3d3LmF6b20uY29tL2FydGljbGUuYXNweD9BcnRpY2xlSUQ9MjI2NjDSAQA?oc=5\" target=\"_blank\">How is Swancor Developing Toward the Future?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoM<\/font>","source.href":"https:\/\/www.azom.com","source.title":"AZoM","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"insights from industry Robert Tsai Chairman and Founder Swancor At JEC World 2023, AZoM caught up with Robert Tsai, Founder and Chairman of Swancor, on the show floor. We discussed the company's history and what it hoped to achieve at the show this year. Please can you introduce yourself and your professional background? I have been involved in specialized chemical research for over 40 years. In 1992, I founded Swancor, which is dedicated to the R&D, manufacturing, and sales of environmentally friendly and green energy materials, leading the market in China and Taiwan. Subsequently, as a pioneer offshore wind power industry in Taiwan, we invested in Taiwanese offshore wind power development. In 2017, I was selected as one of the top 100 influencers in global wind power generation by the European wind power media, \"A WORD ABOUT WIND.\" In early 2022, we launched a revolutionary, innovative product, the recyclable thermoset resin \"EzCiclo,\" which we have been researching for years. The first \" Recyclable Thermoset CFRP Composite Bike\" made by the Swancor team in collaboration with our partner \"GIGANTEX\" was also awarded the \"2023 JEC COMPOSITES INNOVATION AWARDS\" by JEC World this year. Swancor is a chemical manufacturing company that is continually developing to meet the needs of its customers. Could you please tell me more about the products and services that you offer? Swancor’s products are divided into three categories. The first is environmentally friendly corrosion-resistant materials, which have excellent mechanical properties, chemical resistance, processability, high strength-to-weight ratio, and fatigue resistance. They are widely used in industries such as coal power plants, electronics, automotive, marine, pipelines, and sports industries. The second is environmentally friendly green energy materials, including resins and adhesives for wind turbine blades. These materials have excellent mechanical properties, suitable viscosity, good fiber wetting properties, and curing performance. The third is carbon fiber composites, including pultruded plates for wind turbine blade spar caps, thermoplastic epoxy sheets for the 3C and sports industries, and prepreg for industrial applications. Most importantly, Swancor has developed revolutionary, innovative products, the recyclable thermosetting materials \"EzCiclo\" and \"CleaVER,\" which provide a new and effective solution to the previously unsolvable recycling problem. How large is Swancor, and what does its research and development look like? Swancor has 30 years of resin development experience and production capacity in Taiwan, China, and Malaysia. Our products sell worldwide, and we achieved a revenue of €311 million in 2022. Swancor has 660 employees, with 10% focused on research and development. Two years ago, Swancor launched SWANCOR HYVER, a resin with cost advantages and performance characteristics suitable for wind power, yacht, pultrusion, SMC\/BMC, and large structural composite parts manufacture. In 2022, Swancor launched recyclable thermosetting materials, \"EzCiclo\" and \"CleaVER\", which can reclaim both fibers and resins without generating waste solvents, emissions, or pollution (acid, alkali). \"EzCiclo\" and \"CleaVER\" are reusable, safe (compliant with EHS regulations), and have a wide range of applications, including wind turbine blades, sports, and automotive industries, and Swancor is active to expand the application in PCB and other fields. What industries do you supply to the most? Swancor's products can be widely used in various industries, such as wind turbine blades, marine, sports, rail transportation, electronics, large storage tanks and pipelines, and industrial anti-corrosion application. You have expanded into a carbon fiber composite business as well. Could you tell me more about your composite manufacturing? In 2015, Swancor and Formosa Plastics Group jointly established Sunwell Carbon Fiber Composite Material (SWCFC). Sunwell combines Swancor's resin capabilities with Formosa Plastics' carbon fiber supply to provide carbon fiber composite material solutions. Editor Skyla Baily interviews Chairman Robert Tsai at JEC World 2023 Currently, Sunwell has factories and R&D centers in Nantou, Taiwan, and Jiangsu, China. We specialize in the development and production of prepreg, thermoplastic epoxy resin sheets, and carbon fiber\/glass fiber components. They are now supplying carbon pultrusion plates to global wind turbine manufacturers for the production of large wind turbine blades over 70 meters long. In 2022, we further acquired Cotech Inc., which has complete composite material structure design, analysis, and manufacturing capabilities. It has AS9100D aerospace certification and IATF 16949 automotive certification. Its core technology is using autocalve process to produce aviation parts and automotive parts. Why should people pay attention to composites, and carbon fiber composites in particular? Composite materials, including carbon fiber composites, have many advantages compared to traditional materials. They have advantages such as high strength-to-weight ratio (lightweight and strong), corrosion resistance, design flexibility, durability, reduced maintenance, and improved energy efficiency. They are widely used in various industries, such as aviation, wind power, defense, sports and leisure, and transportation. You exhibited this April at JEC World – The Leading International Composites Trade Show. Why do you think it is important for Swancor to engage with this show? JEC World is the largest composite materials exhibition in Europe and even in the world. It is a global professional event for academic and product displays of composite materials, reflecting the latest technologies and application achievements in the industry. Exhibiting companies come from all over the world, and this year, Swancor brings revolutionary products, EzCiclo and CleaVER, which can solve the recycling issues of thermoset composites worldwide, making their presence indispensable. Editor Skyla Baily and Digital Marketing Consultant Ifeyinwan Isibor from AZoNetwork meet Chairman Robert Tsai, Senior Marketing Manager Jessica Weng, and the rest of the Swancor team at JEC World 2023. Why do you believe in-person trade shows and conferences like this are significant? Swancor has been participating in the JEC WORLD for over 20 years, and we deeply appreciate its importance in the materials industry. Although Swancor has distributors in many countries around the world, we value our customers' needs, feedback, and after-sales service highly. In addition to online meetings with our customers and distributors, we believe that face-to-face discussions and sitting down with customers for exchanges can enhance mutual cooperation. This occasion is also an opportunity for us to share Swancor's latest products and services and to understand our customers' short, medium, and long-term plans, so that the services we provide are more in line with the needs of this industry. How does Swancor plan to grow in the coming years? Swancor continues to deepen and develop our presence in the fields of environmental protection and green energy. Furthermore, Swancor is undergoing a transformation towards a goal of being \"devoted to carbon neutrality and new materials innovation,\" which includes new products and businesses related to the circular economy, such as “EzCiclo” and “CleaVER” as well as upcoming low-carbon recycling technologies for carbon fiber, microwave heating recycling of carbon fiber and CCUS (carbon capture, utilization, and storage). In addition to the applications in wind turbine blades and the sports industry, “EzCiclo” is also being utilized in other industries such as PCB and aerospace for the circular economy application of composite materials. Do you have any exciting developments on the horizon you want to tell us about? \"EzCiclo\" has not only won numerous innovation awards but has also recently collaborated with wind turbine manufacturers to successfully produce recyclable wind turbine blades. The verification of degradation and recycling has also been achieved for bicycles. Swancor has already established a recycling demonstration line in Taiwan, which can process 40 tons of recycled composite materials per year. We plan to establish a recycling demonstration line in China in 2024, which can process 2,000 tons of recycled composite materials per year. Swancor wants to find partners in Europe for circular economy initiatives. About Robert Tsai Robert Tsai has been involved in specialized chemical research for over 40 years. In 1992, he founded Swancor, which manufactures and sells environmentally friendly and green energy materials, leading the market in China and Taiwan. As well as this, he was a pioneer of the offshore wind power industry in Taiwan.","filter_flag":1}
{"title":"Beyond Trees: Using Blue-Green Algae for Natural Carbon Capture and Sequestration - TriplePundit","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LnRyaXBsZXB1bmRpdC5jb20vc3RvcnkvMjAyMy9ibHVlLWdyZWVuLWFsZ2FlLWNhcmJvbi1jYXB0dXJlLzc3NDQyMdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LnRyaXBsZXB1bmRpdC5jb20vc3RvcnkvMjAyMy9ibHVlLWdyZWVuLWFsZ2FlLWNhcmJvbi1jYXB0dXJlLzc3NDQyMdIBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LnRyaXBsZXB1bmRpdC5jb20vc3RvcnkvMjAyMy9ibHVlLWdyZWVuLWFsZ2FlLWNhcmJvbi1jYXB0dXJlLzc3NDQyMdIBAA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LnRyaXBsZXB1bmRpdC5jb20vc3RvcnkvMjAyMy9ibHVlLWdyZWVuLWFsZ2FlLWNhcmJvbi1jYXB0dXJlLzc3NDQyMdIBAA?oc=5\" target=\"_blank\">Beyond Trees: Using Blue-Green Algae for Natural Carbon Capture and Sequestration<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TriplePundit<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Beyond Trees: Using Blue-Green Algae for Natural Carbon Capture and Sequestration - TriplePundit","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LnRyaXBsZXB1bmRpdC5jb20vc3RvcnkvMjAyMy9ibHVlLWdyZWVuLWFsZ2FlLWNhcmJvbi1jYXB0dXJlLzc3NDQyMdIBAA?oc=5\" target=\"_blank\">Beyond Trees: Using Blue-Green Algae for Natural Carbon Capture and Sequestration<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TriplePundit<\/font>","source.href":"https:\/\/www.triplepundit.com","source.title":"TriplePundit","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Fun fact: Several species of flamingo get their pink color from a diet rich in cyanobacteria, but blue-green algae blooms aren't so fun for other wildlife. (Image: Elizabeth Gottwald \/Unsplash) Forestation is an important climate action strategy, but more sophisticated — and potentially more efficient — nature-based alternatives are emerging. One of them involves an environmental two-for-one: capturing carbon by preventing destructive blue-green algae blooms. Cyanobacteria and algae blooms Blue-green algae is the common name for cyanobacteria, a type of water-dwelling bacteria that has plant-like photosynthetic abilities. An over-abundance or “bloom” of cyanobacteria can wreck ecosystems and harm other living things. “A combination of environmental factors such as the presence of nutrients, warm temperatures, and lots of light encourage the natural increase in the numbers of cyanobacteria,” according to the National Oceanic and Atmospheric Administration. In higher concentrations, the toxins produced by some cyanobacteria can damage the liver, nerves, and skin of humans and other creatures, including pets and livestock as well as wildlife. The U.S. Environmental Protection Agency notes that warmer temperatures and other climate impacts affect the frequency and severity of algae blooms. Blue-green algae blooms in particular are a frequent occurrence in all 50 U.S. states and elsewhere in the world. They mainly occur on inland waters, but they can also happen in the open ocean. Putting “bad” algae to good use On the plus side, cyanobacteria are emerging as a clean technology jack-of-all-trades, partly because they are fast-growing, voracious consumers of carbon dioxide. Researchers have tweaked cyanobacteria to produce renewable hydrogen and other biofuels, for example. Cyanobacteria are also attracting attention for their ability to convert airborne carbon to a solid substance. They have been linked to deposits of the mineral carbonate, a salt of carbonic acid. The “biomineralization” process carried out by cyanobacteria was formerly thought to occur as a result of outside factors. However, 2014 research concluded that some strains are capable of producing carbonate on their own. In 2020, researchers at the University of Colorado in Boulder put the biomineralization concept to work. They demonstrated that, under the right growing conditions, certain types of cyanobacteria can produce calcium carbonate, which happens to be the main ingredient in cement. The research team tested their method on a growing medium of sand and gelatin. As the cyanobacteria produced calcium carbonate, they mineralized the gelatin and bound the sand into a bio-manufactured brick. Blue-green algae blooms swirling around the Baltic Sea in 2019, as seen from space. (Image: European Space Agency\/Flickr) Algae remediation and carbon offsets Regardless of the potential use cases for cyanobacteria-produced carbonate, algae blooms must be treated and prevented in order to protect aquatic habitats and human health. BlueGreen Water Technologies is among those developing algaecides that specifically tackle cyanobacteria. Its patented, EPA-approved formula triggers a natural “suicide” response in cyanobacteria, clearing the way for beneficial algae and other aquatic species to take over. The treatment effectively converts a body of water into a carbon sink, with the dead cyanobacteria locked into sediment for potentially millions of years, according to BlueGreen. This carbon-sequestering feature could help offset the cost of remediating blue-green algae blooms, if stakeholders could claim carbon credits for the operation. The challenge is to develop a methodology that produces a science-based estimate of the captured carbon. Scientific verification for cyanobacteria remediation In March, BlueGreen received approval from the Social Carbon Foundation for its carbon quantification methodology, under the proprietary name Net Blue. Social Carbon manages the trademarked greenhouse gas standard by the same name. “Net Blue is the first deep water, nature-based climate solution for atmospheric carbon removal that is regulatory approved, scientifically validated and, now, verifiable by industry standards,” BlueGreen asserted in a March announcement. The company has been remediating cyanobacteria since 2019, for an estimated 3.3 million tons of carbon removal. With the Social Carbon standard in hand, BlueGreen can now market cyanobacteria remediation as a verifiable carbon offset. According to BlueGreen CEO Eval Harel, the worldwide potential for cyanobacteria remediation offsets adds up to about 115 gigatons of carbon. A blue-green algae bloom in Regent's Canal just north of London in 2019. (Image: Marc Barrot\/Flickr) Natural vs. unnatural carbon capture The emergence of verifiable cyanobacteria remediation credits should help meet the growing demand for carbon credits. The current demand for carbon credits already exceeds the supply, and BlueGreen projects a 15-fold increase in demand for carbon credits by 2030 and a 100-fold increase by 2050. Cyanobacteria remediation could also help further undercut the case for carbon capture and storage (CCS). CCS has been promoted as an effective pathway for preventing greenhouse gas emissions from coal power plants and other industrial sources. However, the idea of capturing carbon and storing it in underground formations is rapidly losing currency. BlueGreen offers a fast-acting, scalable carbon capture system that requires no infrastructure. The algaecide can be deployed swiftly to provide additional benefits for local businesses and recreational users, as well as restore biodiversity and protect public health. In contrast, carbon capture and storage systems offer no such local add-on benefits, and their ability to scale up globally has yet to be proven. In particular, it is difficult to see how CCS infrastructure fits into the rapid decarbonization picture, due to its relatively high costs and long timeline for construction. Typically, CCS systems also require new pipelines to ship captured carbon from the source to a distant storage facility. That raises the threat of environmental impacts related to construction of the pipeline, as well as delays due to public opposition. The U.S. already has one massive carbon capture failure under its belt, the FutureGen CCS project in Illinois. It kicked off in 2003 with support from the U.S. Department of Energy, intended to provide a showcase for technology to capture and store carbon from a coal power plant. The project was abandoned in 2015. Since then, new alternatives have emerged in the field of carbon capture, utilization and storage systems (CCUS), which can convert captured carbon into new products that recycle or sequester it, at least temporarily. Recycled-carbon products also help reduce the need to draw virgin petrochemicals from underground. Fuels, fabrics, perfumes and vodka are among the new recycled-carbon products coming to market, made from carbon collected at industrial sources or drawn from ambient air by CCUS facilities. The International Energy Agency (IEA) expects CCUS activity to pick up considerably in the coming years, from just 35 systems in operation globally today to an estimated 200 in the pipeline by 2030. What about the trees? Despite all the forthcoming activity, IEA does not foresee CCUS playing a leading role in the effort to achieve a net-zero economy. “Nevertheless… CCUS deployment would remain substantially below what is required\" for a net-zero scenario, IEA concluded in a 2022 report. The need remains for a broad expansion of swift, effective decarbonization pathways across the board. The Social Carbon Foundation is among those working to steer the decarbonization conversation into a more holistic framework that can achieve global progress on a larger scale. Through its Social Carbon standard, the organization advocates for nature-based decarbonization pathways that, like BlueGreen, provide local benefits. The localized nature of this approach requires the standard to be flexible and take political and social elements into account. “Projects using our standard go beyond carbon, embedding meaningful social, environmental and economic benefits to the projects and their local stakeholders,” Social Carbon's website reads. “The trademark communicates that emissions reductions result from efforts that benefit and improve living conditions for stakeholders involved in climate change projects, in ways that strengthen their welfare and civic consciousness without degrading their resources base,” it continues. That reference to resources appears to be a cautionary note against tree-planting programs that focus on commercial timber plantations as a carbon sequestration tool, to the detriment of local habitat. Scientists have also raised concerns about the pace and efficiency of carbon capture through forestation. Planting trees is likely to continue to hold a place in the carbon market, but companies seeking to burnish their reputation with forestation will need to ensure that their projects adopt a holistic approach that supports local communities.","filter_flag":1}
{"title":"Delta Electronics' Americas Headquarters Becomes First LEED Zero Energy-Certified Green Building in Fremont ... - Automation.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL2RlbHRhLWVsZWN0cm9uaWNzLWFtZXJpY2FzLWhlYWRxdWFydGVycy1sZWVkLXplcm_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL2RlbHRhLWVsZWN0cm9uaWNzLWFtZXJpY2FzLWhlYWRxdWFydGVycy1sZWVkLXplcm_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL2RlbHRhLWVsZWN0cm9uaWNzLWFtZXJpY2FzLWhlYWRxdWFydGVycy1sZWVkLXplcm_SAQA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL2RlbHRhLWVsZWN0cm9uaWNzLWFtZXJpY2FzLWhlYWRxdWFydGVycy1sZWVkLXplcm_SAQA?oc=5\" target=\"_blank\">Delta Electronics' Americas Headquarters Becomes First LEED Zero Energy-Certified Green Building in Fremont ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Automation.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Delta Electronics' Americas Headquarters Becomes First LEED Zero Energy-Certified Green Building in Fremont ... - Automation.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmF1dG9tYXRpb24uY29tL2VuLXVzL2FydGljbGVzL21heS0yMDIzL2RlbHRhLWVsZWN0cm9uaWNzLWFtZXJpY2FzLWhlYWRxdWFydGVycy1sZWVkLXplcm_SAQA?oc=5\" target=\"_blank\">Delta Electronics' Americas Headquarters Becomes First LEED Zero Energy-Certified Green Building in Fremont ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Automation.com<\/font>","source.href":"https:\/\/www.automation.com","source.title":"Automation.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Summary Delta has announced its Americas regional headquarters has become the first green building in Fremont, California, to achieve the LEED Zero Energy certification from the U.S. Green Building Council. Delta Electronics’ Americas Headquarters Becomes First LEED Zero Energy-Certified Green Building in Fremont, California Delta, a global provider of IoT-based smart green solutions, has announced its Americas regional headquarters (HQs) has become the first green building in Fremont, CA, and second in the Silicon Valley Bay Area, to achieve the LEED Zero Energy certification from the U.S. Green Building Council. The accolade, granted to green buildings that generate as much electricity as they consume, has been attained thanks to the further implementation of Delta’s own solutions on this originally LEED Platinum facility. A new solar PV carport, supported by a 330kWh Delta energy storage system, now helps to increase the building’s annual green electricity generation to over 1.4 million kWh. With 32 green buildings(1) enabled worldwide, Delta’s solutions are nurturing sustainable cities. “Just as Fremont leads the way in clean technology, Delta Electronics continues to set the industry standard for building performance. The company’s built-to-suit Americas HQ in Fremont previously laid claim to being one of the earliest private sector LEED Platinum facilities in California. Today, Delta Electronics sets another milestone as only the second facility in the entire Bay Area to achieve LEED Zero-Energy,\" said Lily Mei, mayor of Fremont. She added, “As one of the greenest cities in the nation, we're proud that Delta Electronics continues to showcase sustainability through thoughtful application of technology, including using its Fremont facility as a proving grounds for many of its own products while working through pandemic disruptions to invest even further in our community.” Kelvin Huang, president of Delta Electronics (Americas), said, “Fremont has been Delta’s home in the Americas for over 30 years, so it is an honor for us to contribute to our community with the environmental and social benefits of the city’s very first LEED Zero Energy green building. With its net-zero energy capabilities, our Americas HQs green building will contribute even further to Delta’s RE100 initiative, which is a promise to power our worldwide operations with renewable electricity by 2030. By developing smart energy-saving solutions capable of fostering green buildings and sustainable cities, Delta demonstrates that its ESG-embedded business model can bolster mankind’s environmental goals.” Aided with an energy-conscious design that utilizes geographical advantages unique to Fremont while considering the productivity and needs of its operations, the Delta Americas HQs building is an example of what a total integrated solution can look like. The most recent upgrades made possible with Delta’s own IoT-based Smart Green Solutions are: The facility generates over 1.4 million kWh of renewable electricity through a 616kW rooftop solar PV system and a recently constructed 504kW bi-facial PV carport system, both supported by Delta’s high-efficiency PV inverters. That green energy output covers 100% of its consumption needs over a full calendar year. The recent addition of a 330 kWh Delta energy storage system helps to optimize energy management in the facility. A recent enhancement of Delta’s data center cooling solution, featuring a dedicated economizer supported by our own DC brushless electronically commutated (EC) fans and variable frequency drives for HVAC applications, have contributed significantly in lowering the annual power usage effectiveness (PUE) of the building’s data center from 1.5 originally to as low as 1.25. Optimized energy management is also attained by the implementation of Delta’s next-generation SCADA system and building control platform. The former is VTScada, the industry’s most powerful SCADA system, developed by Canadian-based Trihedral, a Delta Group Company; the latter is the enteliWEB building control platform, developed by Canadian-based Delta Controls, also a Delta Group Company. These platforms integrate seamlessly with the existing building sub-systems, such as HVAC, LED lighting and other energy-intensive applications, to create set points, collect data and track trends, create reports, and manage alarms, remotely. With unlimited scalability, this solution grows with the facility as new solutions are integrated to ensure lower energy consumption. Here are some of the original integrated solutions that made Delta Americas’ HQs a LEED Platinum green building back in 2018, and that have certainly contributed to the new LEED Zero Energy certification: HVAC Host to one of the largest geothermal systems in Silicon Valley, Delta’s unique location in the Bay Area takes advantage of the natural underground warm springs. With over 20 miles of horizontal piping at 15 and 30 feet depths, a Delta VFD circulates water in a closed-loop system to exchange heat for an HVAC system estimated to be 70% more efficient than a cooling tower. 92 miles of piping is embedded in the facility’s floors and ceilings for radiant heating and cooling, providing stable and comfortable temperatures, efficiently. Working in collaboration with CBE Berkeley, this system has been a case study to determine optimal operations and controls for maximum energy efficiency. Lighting With LED lighting systems in the parking lot and around the office, Delta’s lighting controls integrates with its building management system to ensure smooth operations at all hours. Taking advantage of the floor-to-ceiling panoramic windows, the open floor plan, and low-e windows, zones are created to minimize waste from excessive lighting. Light meters placed around the office ensure sufficient light-levels for safety and productivity. Additional Green Features (19) Delta Level II EV Chargers, free for employee-use Delta elevator regenerative drives Bioswale for natural filtration of rainwater and pollutants to the Baylands 140,000 gallon rainwater harvesting tank for landscaping and agriculture Native, drought-tolerant plants and trees 100% fresh air unit, improving IAQ About Delta Electronics (Americas) Delta Electronics (Americas) was established 38 years ago and has grown to over one thousand employees in the entire Americas region. Delta has offices, R&D centers, manufacturing, distribution and repair centers in multiple locations in the United States, Mexico and South America. In the U.S., operations are located in Fremont, Los Angeles, San Diego, Seattle, Austin, Dallas, Houston, Raleigh, Boston and Detroit to better serve its diverse customer base. Outside the U.S., Delta continues to expand its Americas operations in Mexico, Argentina, Brazil and Canada. Delta Electronics (Americas) serves the IT, communications, industrial automation, renewable energy, lighting, power tool, automotive electric vehicle and other major industries. Products include power electronics, DC brushless fans, visual displays, industrial automation, networking products, electronic components, consumer products and energy efficient and renewable energy products. The company is always striving to define new ways to improve the energy efficiency of its products through advanced research and product development.","filter_flag":1}
{"title":"Top U.S. clean energy trends to watch in 2023 - Inhabitat","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5","id":"CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA","guidislink":false,"published":"Fri, 12 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=132, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top U.S. clean energy trends to watch in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top U.S. clean energy trends to watch in 2023 - Inhabitat","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vaW5oYWJpdGF0LmNvbS90b3AtdS1zLWNsZWFuLWVuZXJneS10cmVuZHMtdG8td2F0Y2gtaW4tMjAyMy_SAQA?oc=5\" target=\"_blank\">Top U.S. clean energy trends to watch in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","source.href":"https:\/\/inhabitat.com","source.title":"Inhabitat","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"We believe that 2023 will be looked on as a turning point in the clean energy revolution and the race to save the planet. This was the point in time when solar and wind energy became cheaper to produce than traditional energy. 2023 is the year that municipalities invested heavily in a clean energy future, setting the stage for a majority of U.S. energy to be from renewable sources in the next couple of decades. What are the clean energy trends driving this sea change to a sustainable future? Here are our top picks for clean energy trends to watch in 2023. Continue reading below Our Featured Videos EV sales skyrocket with one million sold Electric cars are finally taking off, with over one million sold in the U.S. for the first time in 2023. Even though only 40% of Americans say their next car will be an EV, the interest in electric vehicles is going mainstream for the first time. Related: Hydrogen made of biomass revolutionizes clean energy And there are finally plenty of options of EVs to purchase, though the price of cars has been a challenge due to recent near double-digit inflation. Bloomberg is predicting that more Americans will drive EVs than will drive ICE cars by 2030, which means the EV revolution is happening this decade. We are in it now. Offshore wind takes flight In 2023, the U.S.’s first large-scale offshore wind farms are coming online. The U.S. currently only has two operational offshore wind farms, in Rhode Island and Virginia, with a total of seven turbines and capacity of 42 megawatts. It’s not a very significant contribution to the grid. By the end of the year, the first of a new set of gigantic offshore wind farms should be close to operational in the U.S. Vineyard Wind 1 will be located off of Massachusetts, with 800 megawatt capacity, and South Fork Wind will be located off of New York with 132 megawatt capacity. BloombergNEF reports another 5,400 megawatts are on track to finalize financing or begin construction in 2023. As solar and wind power continue to become less expensive than traditional alternative fuels to produce, we expect this to be the turning point when wind power really took off. Legislation changes the world Well, that’s not a headline we thought we would write, to be honest, but the U.S. government and other world governments deserve their props for what climate-targeted legislation they can produce to save the world in time to avoid catastrophic climate change. State lawmakers in Maryland, Massachusetts, Michigan and Minnesota are preparing to pass climate and clean energy legislation. The Inflation Reduction Act is driving heavy investment in U.S. manufacturing for the first time in decades for the sake of EV tax credits and other incentives. It comes at a time when clean technologies can power plants and produce sustainable products for the first time in modern history. According to the International Monetary Fund, the IRA is the most significant piece of climate legislation ever created in U.S. history, funneling $400 billion into climate change mitigation projects over the next decade. Managed correctly, the recent climate bills could shift the course of history. The headwinds against wind power The Inflation Reduction Act barely passed in 2022. Political instability and rancor in the U.S. continues to threaten climate goals that affect the entire world. But there are good signs that this time wind power is really here to stay. The IRA contains about $370 billion in tax credits and incentives for renewable energy and EVs, including extra incentives for companies making clean energy technology in the U.S. Where recent years have been dominated by partisan politics, now state governments are racing to meet climate objectives and realizing it pays to work together to build the heart of the sustainable energy industry in the U.S. for the next generation. “Congress has an important role to play in guiding the swift and effective implementation of the IRA,” said Jose Zayas, executive vice president of policy and programs for the American Council on Renewable Energy, a trade group. “The Treasury Department is still issuing guidance related to key provisions, which will have crucial implications for developers and homeowners seeking to take advantage of a suite of new clean energy tax credits. Congress must use its oversight authority to ensure prompt completion of guidance from Treasury.” In other words, the final challenge is implementation. Can these programs live up to their promises? While battery technology develops the capacity to power the future and more clean energy plants are pushed through financing and permitting, how we roll out our climate-oriented programs over the next decade will in part direct the course of history as we struggle into a sustainable future. Via Inside Climate News Lead image via Pexels","filter_flag":1}
{"title":"Who's Who guide to 'green' Irish business - Irish Examiner","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2J1c2luZXNzL3RlY2hub2xvZ3kvYXJpZC00MTE0MjI2Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2J1c2luZXNzL3RlY2hub2xvZ3kvYXJpZC00MTE0MjI2Mi5odG1s0gEA?oc=5","id":"CBMiRGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2J1c2luZXNzL3RlY2hub2xvZ3kvYXJpZC00MTE0MjI2Mi5odG1s0gEA","guidislink":false,"published":"Fri, 19 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=139, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2J1c2luZXNzL3RlY2hub2xvZ3kvYXJpZC00MTE0MjI2Mi5odG1s0gEA?oc=5\" target=\"_blank\">Who's Who guide to 'green' Irish business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irish Examiner<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Who's Who guide to 'green' Irish business - Irish Examiner","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2J1c2luZXNzL3RlY2hub2xvZ3kvYXJpZC00MTE0MjI2Mi5odG1s0gEA?oc=5\" target=\"_blank\">Who's Who guide to 'green' Irish business<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irish Examiner<\/font>","source.href":"https:\/\/www.irishexaminer.com","source.title":"Irish Examiner","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"In 2022, greenhouse gas emissions from Irish power generation and industrial companies, covered by the EU Emissions Trading Scheme, decreased by 4%. Emissions decreased by 2% from the electricity generation sector. The decrease in industrial emissions is over 7%, with the cement industry emissions decreasing by almost 9%. The Environmental Protection Agency (EPA), as the Competent Authority in Ireland for the EU Emissions Trading System (EU ETS), released its preliminary analysis of greenhouse gas emissions in 2022 from the ETS sector. Emissions from Irish power generation and industrial companies decreased by 4% (more than 600.000 tonnes) in 2022. This compares with a decrease of approximately 1.2% across Europe, according to preliminary analysis by carbon analysts of the data released today by the EU Commission. Ireland’s ETS sector delivered a decrease in emissions in 2022 due to a combination of factors, including increased use of renewable electricity and renewable fuels as well as a decrease in cement production. In the electricity sector, there was less use of coal and peat-fired generation compared to the previous year, as conventional gas generation was available along with renewable energy. Fossil-fired power stations continued to play a strong role in meeting a high electricity demand. Laura Burke, Director General, Environmental Protection Agency. “While the decrease we are seeing for 2022 from the emissions trading sector is welcome, 2022 emissions are in fact slightly above the pre-pandemic levels in 2019,” said Laura Burke, EPA Director General. “Much more needs to be done if the sectoral targets under the 2023 Climate Action Plan are to be reached. The challenges faced in the power generation sector are in sharp focus at the moment. Decisions taken now must recognise the urgency of the climate change challenge and support the delivery of reductions in emissions through the development and roll out of a range of low carbon and renewable solutions.” Energy Industries show a decrease in emissions of 9.4% over the period 1990 to 2021. Over the time series, emissions from electricity generation have decreased by 10.5% whereas total electricity consumption has increased by 150.5%. Emissions from electricity generation increased from 1990 to 2001 by 54.3% and have decreased by 42.1% between 2001 and 2021. This decrease reflects the improvement in efficiency of modern gas-fired power plants replacing older peat and oil-fired plants and the increased share of renewables, primarily, wind power along with increased interconnectivity. This year was the lowest year in the 32-year time series for peat-fired electricity generation, 68% less than in 2020. These reductions reflect the gradual ending of peat-fired electricity generation for market and climate policy reasons. Emissions from electricity generation had decreased year-on-year from 2016 to 2020, but 2021 has seen an increase of 18.8% compared to 2020. In 2021, there was a tripling of coal and oil used for electricity generation due to the unavailability of enough gas-fired generation and lower renewables. Emerging business heroes of Irish Renewables As Ireland continues it ongoing objective to reduce emissions, a wide cross-section of companies are heeding the call with innovative ideas and initiatives designed to tackle the challenge of climate change head-on. Some are large corporations with a variety of divisions, while others are nimble and focused start-ups — and all are committed to investing in Ireland's huge renewable energy potential. The following companies represent a broad cross-section of this important and growing sector — some are already household names, others are the stars of tomorrow. NOVOGRID NovoGrid is a pioneer in Grid Edge Intelligence software with a suite of patented software products which benefit electricity generators and utilities. Prof Andrew Keane of UCD and co-founder and chief technology officer of Novogrid, with Paul Manning, co-founder and chief commerical officer. The company has developed a number of novel control technologies for distributed generators and system operators allowing them to maximise the efficiency of their energy delivery without the need for extensive communications infrastructure. GridBoost is a patented grid edge intelligence software technology that automates and removes inefficiencies in renewable generators and electrical grid operations and was developed by Professor Andrew Keane and his team at University College Dublin. NovoGrid, a UCD spin-out company supported by NovaUCD, was established to commercialise the technology. Using Already installed in a number of wind farms in the UK, GridBoost could save 33 million kWh of renewable energy wasted annually, reducing carbon emissions by 16,200 tonnes and saving the Irish consumer €2.2 million. NVP ENERGY NVP Energy delivers efficient and sustainable wastewater treatment solution, providing a professional, end-to-end service covering all aspects of the project, from calculating the feasibility of the installation, to ensuring a detailed handover and training as well as providing an aftercare service tailored to specific needs. Its technology treats wastewater and produces energy in one efficient package, helping slash wastewater charges by up to 60%, has negligible sludge management costs and qualifies for renewable energy incentives. The combined effect results in an average return on investment of three years. TERRA SOLAR Terra Solar is at the forefront of solar energy development in Ireland, helping lead the way in developing renewable energy sources and increasing energy independence. The business exclusively develops, finances, constructs and operates solar farms on the island of Ireland, partnering with commercial enterprises and private landowners to identify suitable sites for solar development and subsequently bring those sites from planning and grid approval stage through to fully operational solar farms. Ireland’s temperate climate is perfectly suited to the development of solar energy. While we do not benefit from the same level of sunshine as southern regions, our lower temperatures significantly improve the performance and lifetime of solar cells. Solar energy generation is as economically viable as wind energy generation in Ireland without suffering the same drawbacks from a construction and planning standpoint. NTR For two decades, NTR has invested in renewable energy and during that period has, through its associated companies, constructed and operated c.2GW of wind projects and 630MW of solar projects across Europe and the US. Since 2015, NTR has acquired and managed renewable energy investments on behalf of third party investors through its renewable energy funds. It recently announced the successful deployment of two Battery Storage Systems in Co Wexford. Gorey battery storage 9MW and Avonbeg battery storage 16 MW are contracted to provide DS3 services to EirGrid. The batteries are critical in enabling the transmission system operator to increase the levels of renewable energy on the Irish grid system. Both the Gorey and Avonbeg facilities have also achieved capacity market contracts, highlighting the increasing demand for energy storage solutions as renewable energy sources become more prevalent. SEABASED Seabased’s proprietary technology generates stable and predictable power that enables grid operators to increase the amount of renewables they can incorporate into the energy mix, either through stand-alone wave parks or in combination with other renewables such as offshore wind. The company has committed itself to solving the challenges standing between wave power’s tremendous potential and cost-effective implementation. Its scientists and engineers have amassed more than 300 patents and 20 PhD theses; developing and ocean testing full-scale generators in four countries, including two multi-generator grid-connected demonstration wave power park. It is currently planning a 10-MW wave power park in Tongatapu in the South Pacific island country of Tonga, designed to tackle high energy costs. An initial 2-MW phase is expected to save Tonga €1.87m, replace two million litres of fuel and provide enough power for 2,800 homes. The second phase will add a further 8 MW. It is projected to meet half Tonga’s energy needs and reduce emissions by 20%. GAZELLE WIND POWER Gazelle Wind Power Limited is unlocking the massive deep-water offshore wind market to achieve global decarbonisation. The company’s durable, disruptive hybrid floating platform with a high stability attenuated pitch surmounts the current barriers of buoyancy and geographic limitations while reducing costs and preserving fragile marine environments. Gazelle Wind Power’s innovative, stable, hybrid attenuated mooring platform allows for a 70% reduction in the weight of steel, while delivering significant cost savings. The company is based in Dublin and has a presence in Dubai, London, Madrid, Paris, and Texas. Offshore wind projects have traditionally lagged behind onshore and other renewable energy projects, with costs of construction, installation, and maintenance hindering their widespread adoption. Gazelle Wind Power’s innovative, stable, hybrid attenuated mooring platform is designed and engineered by leading naval engineers to enable floating offshore wind production in deeper waters farther out at sea. The patented design allows for a 70% reduction in the weight of steel, while delivering a highly stable platform together with a 30% cost reduction compared to other floating wind platforms. OBELISK Obelisk is an internationally competitive professional engineering services business providing infrastructure solutions for the telecoms and power sectors in Ireland, UK and Africa. Founded in 1996, it employs over 300 people across office locations in Dublin, Cavan and Cape Town. The company’s core activity is in providing solutions and resources to telecoms, power transmission and distribution, renewable energy and tower infrastructure industries. At present, Obelisk are testing out a fleet of electric vehicles, as part of the EV Commercial Fleet Trial — a pilot scheme run by SEAI on behalf of Zero Emission Vehicles Ireland - providing businesses with the opportunity to trial battery electric vehicles as part of their day-to-day jobs, to showcase the cost and emissions savings that an EV fleet can offer. Obelick plans the electrification of its commercial fleet, with the goal of eradicating 98% of Scope 1 emissions. BORD NA MONA Bord na Móna is a semi-state climate solutions company helping lead Ireland towards a climate-neutral future. It provides employment for approximately 1500 people and manages a land holding of over 80,000 hectares. Its ambition is to create the right conditions to store carbon and protect biodiversity, while helping to deliver ongoing sustainable energy security for Ireland. The company works across wind, solar, biomass and biogas to power the national grid with clean energy. Many of Ireland’s wind turbines are installed on cutaway bogs - lands that were once harvested for peat but are now being rehabilitated for renewable energy infrastructure, biodiversity and public enjoyment. Returning 8,000 hectares of raised bogs to their natural state will help absorb carbon from the atmosphere - this stops further release of carbon dioxide and, in time, enables the bog to absorb carbon dioxide from the atmosphere. SOLAR ELECTRIC Solar Electric, as one of the leading companies offering Solar panels in Ireland, recently joined Pinergy, giving access to a strategic partnership with the most innovative and sustainable electricity providers in Ireland. The market for solar photovoltaic systems is growing rapidly. A greater understanding of the need to invest in renewables is coupled with the energy crisis, which has heightened financial drivers for cheaper energy. The removal of barriers to installing solar PV systems will kick-start even more rapid growth, following the 2022 government removal of the need for planning permission to put solar panels on roofs. A second impactful change was the introduction of the option to sell excess power back to a provider — a revenue stream that means the cost of installing a system can be retrieved far more quickly. WIND ENERGY IRELAND Wind Energy Ireland (WEI) is the representative body for the Irish wind industry, working to promote wind energy as an essential, economical and environmentally friendly part of the country’s low-carbon energy future. As Ireland’s largest renewable energy organisation, it encompasses more than 150 members who have come together to plan, build, operate and support the development of the country’s chief renewable energy resource. It is an all-Ireland body, working in Northern Ireland through a partnership with RenewableUK. More than a third of Ireland’s power came from wind farms in March, with the country’s main renewable energy source meeting 40 per cent of electricity demand over the first three months of 2023. Prices on the wholesale electricity market continued their gradual fall, helped by Irish wind farms, for the third consecutive month. DUBLIN OFFSHORE TECHNOLOGY Dublin Offshore Technology was founded on the belief that sustainable development of the blue economy can change people’s lives for the better. Its mission is to engineer technology solutions for the world’s oceans, work which is particularly focused on the fixed and floating offshore wind sector. The ESB recently announced that it will invest in the company, allow it expand its business in the growing market for floating offshore wind energy. The company’s innovative technology solution for floating offshore wind mooring systems provides significant design improvements for the wind farm, with an optimised mooring system delivering these benefits using locally-sourced materials tried and tested in the offshore environment with no degradation over the full lifetime of the wind farm. The investment will allow Dublin Offshore Technology position itself as a global leader in this rapidly growing market. NINES PHOTOVOLTAICS Nines Photovoltaics was established in 2010, with a dedicated team that is focused on bringing new innovative process technology, machinery and equipment to the international Photovoltaic (PV) solar cell manufacturing industry. Nines Photovoltaics brings new innovative process technology, machinery and equipment to the international Photovoltaic (PV) solar cell manufacturing industry. The company is based in Dublin, with its areas of expertise including technical project management; production focused process engineering; and turnkey process equipment with integrated control systems. Nines Photovoltaic is a sister company of Nines Engineering, set up in 2007, and built up based on the founders experience, knowledge and contacts within the Semiconductor manufacturing industry. In 2009 the management team identified opportunities in the Photovoltaic (PV) space in which they could bring their extensive Semiconductor industry knowledge, and add value to the sector by developing novel processing technologies. ENERPOWER Enerpower are Ireland’s leading provider of renewable energy solutions for commercial and industrial sectors. The company was established in 2005 to meet the demands of the changing business landscape whereby businesses were looking towards the environmental and economic benefits of choosing renewable energy. Enerpower are committed to using biomass fuel, solar panel technology, heat pump technology and wind energy to ensure businesses will save money on heating and energy and reduce their impact on the environment. In 2021 Enerpower opened what it claims to be the single largest solar farm in the country. Developed in a joint venture with pharmaceutical company Eli Lilly, the 16-acre facility will help power a significant proportion of the Lilly plant at its Dunderrow site with sustainable energy. BNRG Headquartered in Dublin with operations in the US, the United Kingdom, Europe and Australia, BNRG is a pioneering developer and operator of solar projects. Since 2007 the company has worked alongside its development, technology and investment partners to finance, build, manage and own solar farms that today produce more than 150,000 MWh of clean electricity, with more than 1.5 GW of active projects in the development pipeline. In 2022, AIB has invested €8.5 million in BNRG, convertible into equity if the business goes about raising funding, which it is expected to do this year. The company currently has a solar development pipeline of 2.7 gigawatts across Ireland, the US, UK and Australia, equivalent to about half of peak electricity demand in the Republic, in addition to 23 megawatts of operating assets in the US. SOLAR AD TEK Providing solar powered LED lighting systems to illuminate outdoor advertising displays such as bus shelters and billboards. The system combines a proprietary Solar Control Unit and customized LED lighting modules with efficient solar panels and batteries to deliver autonomous, reliable and cost effective solar lighting solutions. Replacing existing fluorescent tubes with its bespoke LED lighting will provide an energy saving of up to 80%. Solar AdTek’s optional mobile communications module allows for Real Time Passenger Information signs, remote system diagnostics, advertisement viewers, traffic counters and environmental sensors. Solar AdTek were delighted to work with the sustainability and marketing teams at IKEA Ireland to develop a bespoke LED lighting solution for the advertising billboards at their Dublin store. The project involved evaluating the lighting on car park billboards and offering an improved, more cost-effective solution. ENVERIAN Enverian was established in 2011 to provide software solutions for the renewable-energy sector, and received seed capital funding from Enterprise Ireland and the AIB Seed Capital Fund, led by Enterprise Equity. The company recently announced a landmark partnership agreement with renewable energy developer, Mainstream Renewable Power, which will see all of Mainstream’s onshore wind and solar energy portfolio being tracked, ranked, and valued using Enverian’s cloud-based Renewable Portfolio Manager application. The system has already been deployed and will be developed further for Mainstream with the aim of bringing greater value and efficiencies to the organisation. Enverian provides the answer to many of the biggest management challenges facing renewable energy development companies, with a product that enables fully informed investment decisions to be made and demonstrates where the company is creating most value. WATTICS Wattics, an EnergyCAP solution, is a market-leading provider of enterprise energy management analytics software. Wattics is used by growing teams of energy service companies, green building professionals, energy consultants and analysts to manage bulk utility\/IoTs\/sub-meter data to spot business energy inefficiencies, increase sustainability, improve indoor air quality, and reduce CO2 emissions in industrial and commercial buildings. Through its customer network, Wattics has a global presence spread across more than 55 countries around the world. Its mission is to enable energy and sustainability professionals around the world to develop and maintain resource-efficient, cost-effective, net-zero buildings and facilities, based on actionable data-driven insights. In August 2022, EnergyCAP, a pioneer in energy and sustainability enterprise resource planning software, acquired Wattics. ENERGY SERV Rising electricity costs and good roof space provided by commercial properties make solar a sensible investment. Whether the business is looking to save money, reduce its carbon footprint or secure its future energy supply, Energy Serv provides expert commercial solar installations with proven high-yielding solar panels across Ireland. Energy Serv provides expert commercial solar installations with proven high-yielding solar panels across Ireland. An energy service providing design and installation of Solar PV systems, electric vehicle charging points, smart heating controls and real time energy monitoring. Working with a number of partners from the major energy providers in Ireland to single domestic dwellings supplying sales and services for a wide range of energy saving products and services. Energy Serv works with clients to keep their costs as low as possible with the maximum quality systems available, achieved by working with the client to avail of the SEAI grants available. GLOWPOWER An energy supplier that has recently entered the Irish market, Glowpower is led by energy industry experts with over 30 years of combined experience across the globe. Was formed to breathe new innovative thinking into the stale energy market, and is opposed to out-dated thinking, old practices and excessive charging. “Our promise is to be accountable for our actions. We are committed to listening and helping you understand and benefit from energy usage education.” Glowpower exists to deliver electricity in the most cost-effective, best electricity deals, seamless and transparent experience possible. “We want to empower you to manage your own and your community energy needs with smart technology plus the best-combined energy services, innovative designs and savings.” CIRCLE K Circle K is Ireland’s leading forecourt and convenience retailer with 410 sites across the island of Ireland. “We have revolutionised the forecourt and convenience retail space through our next-generation fuel, our gourmet coffee and a wide range of quality food options.” With 2,210 employees in Ireland, it also operate a large commercial fuels business with over 20 depots and two owned terminals across the country.\\Circle K recently announced that its fleet of delivery vehicles will be fuelled by Hydrotreated Vegetable Oil renewable diesel in its fleet of delivery vehicles, which is the equivalent of over 2,000 cars removed from the road once the rollout is complete. MAINSTREAM RENEWABLE POWER Mainstream Renewable Power is a leading pure-play renewable energy company, with wind and solar assets across global markets, including in Latin America, Africa and Asia-Pacific. Mainstream Renewable Power works with wind and solar assets across markets including in Latin America, Africa and Asia-Pacific. Mainstream is one of the most successful developers of gigawatt-scale renewables platforms, across onshore wind, offshore wind, and solar power generation. It has successfully delivered 6.5 GW of wind and solar generation assets to financial close-ready and has a global project portfolio of 27 GW. In May 2021, Aker Horizons acquired a majority stake in Mainstream, and in April 2022, Mitsui & Co., Ltd. joined Aker Horizons as a long-term strategic investor. In August 2022, a transaction to integrate Aker Offshore Wind into the Mainstream Group was completed. Mainstream has raised more than €3 billion in project finance to date. Since January 2021, Mainstream has grown its team from 335 to over 650 today across five continents. SIMPLY BLUE GROUP Simply Blue works with the ocean to develop deliver blue growth strategies globally and to fight climate change. It is part of a global movement focused on replacing fossil fuels with clean ocean energy, removing CO2 from the atmosphere and developing sustainable sources of protein, while developing coastal economies with new projects and investment bringing new projects and investment to coastal communities, working in happy co-existence. The 100 MW Salamander floating offshore wind project, located 35km off Peterhead, is a joint venture between Ørsted, Simply Blue Group and Subsea7 and is designed to provide Scotland and its supply chain with an early opportunity to deliver floating offshore wind ahead of the larger-scale ScotWind build-out. In addition, a leading local developer in Australia, Spark Renewables, together with Simply Blue Group and Subsea7, have formed a consortium to pursue floating offshore wind development off the coast of New South Wales, Australia, in the Hunter and Illawarra regions. SKYSPECS SkySpecs entered the market providing a solution for renewable energy companies struggling to understand the health of their assets. By providing wind farms with valuable data on the health of their wind turbine blades through autonomous drone inspections, customers were finally able to access high quality data on assets in near real-time, and then analyze and synthesize it so they can make smarter decisions about their fleets from first day-of-operation to end-of-life. But SkySpecs didn’t just stop at providing blade data; they continued to expand their solutions offerings when they realized that the simplest path to industry-leading efficiency and returns was access to high quality data on all of the components that make up the wind asset. SkySpecs builds its hardware and software in house, and already monitors the health of almost half of all turbine blades in North America. Since it launched in 2012, its drones have inspected more than 300,000 blades across dozens of countries. ENERGIA Energia provides 100% green electricity to over 250,000 homes and businesses across Ireland. Energia has been operating in Ireland since 1999 for business customers, and launched into the domestic market in 2014. Since then it has been continually expanding to become a leading Irish energy provider and infrastructure investor across Renewables, Flexible Generation and Customer Solutions. Energia supplies approximately 18% of the island of Ireland’s total electricity requirements and 23% of the island’s total wind power, meeting the energy needs of over 58,000 business customers and over 200,000 homes with competitive electricity and gas services. Energia operate 40 wind farms in locations across the country, and to date we have invested over €1 billion in the energy market across the island of Ireland. EIRECOMPOSITES ÉireComposites was established in 1998 and has over 60 employees. The company operates an accredited composites manufacturing and testing facility in Inverin, Galway. It is an innovative design, manufacturing and testing company involved in lightweight, high-performance, fibre-reinforced composite materials, with an international customer base in space, aerospace, renewable energy and industrial composites. The company’s goal is to create products and services that improve society by commercialising cutting-edge research on composite materials. It aims to achieve this objective by creating meaningful, stimulating jobs for the community and delivering high-quality, novel products and services for customers, at competitive prices. By achieving these aims, the company will enhance Ireland’s reputation as a prime location for modern manufacturing. We pride ourselves in meeting our customers’ delivery times. Its extensive experience combined with state-of-the-art facilities and advanced design capabilities make the firm a one stop shop for composites process and product development. With experience in both thermoset and thermoplastic parts, it has parts flying on commercial aircraft for over a decade. The company has also developed patented composite manufacturing technologies which take advantage of the quick cycle times possible with thermoplastic composites. GREENCOAT RENEWABLES Greencoat Renewable's portfolio generated 2,487GWh of electricity during the year, up from 1,522GWh the previous year. During the year the company bought nine wind farms, including its first offshore wind farm, and expanded into Germany, Finland and Spain. Earlier this year the Dublin-listed wind and solar energy group announced an agreement to acquire 22.5% of an offshore wind farm in Germany.\\The wind farm is located in Germany’s exclusive economic zone in the North Sea and consists of 80 Siemens Gamesa 3.6MW turbines that have been operational since 2015. The company now has a portfolio of 35 assets. It saw successful capital-raising activity in the 12-month period with gross proceeds of €281.5m raised in an oversubscribed placing. 2022 was another very successful year for the company, having built a portfolio of diversified technology across both onshore and offshore wind, solar, and battery, providing a robust platform from which to capitalise on the opportunities ahead. TRIFOL RESOURCES Trifol is a Clean Technology company that has developed proprietary technologies to convert plastic waste into wax. Plastic waste is a global environmental issue causing significant negative environmental impact. The Trifol technology processes low-grade plastic waste into waxes for multiple applications (industrial, packaging, cosmetics, candles) and into ingredients for high-specification synthetic automotive engine oils in an environmentally friendly manner. . Trifol Resources produces synthetic lubricants with superior mechanical and chemical properties, thus lesser engine wear and tear, superior fuel efficiency and environmental performance. Based in Ireland, Trifol's objective is to install production facilities in all major markets globally. Trifol is helping to tackle a major global environmental issue. Every year the world produces 350 million tonnes of plastic, but only 9% is ever recycled. Trifol wax is unique because with every tonne of Trifol wax, 1.5 tonnes of plastic waste is prevented from polluting the environment. EPISENSOR EpiSensor was founded in 2007 at the intersection of three new technology waves – wireless sensor networks, cloud computing, and mobile. The company, led by an experienced management team who have grown multiple high-tech companies in the past. set out to apply this new technology stack to the world’s energy and efficiency problems. All EpiSensor products are designed in Ireland, a result of having developed the ‘full chain’ of technology from sensor to server, so enabling a quick response to customer needs. EpiSensor provides a powerful Industrial Internet of Things (IIoT) platform that makes it easier than ever to collect data from the real world. The platform is suitable for a wide variety of applications and industries, from refrigeration monitoring to energy management, and can be deployed in the most harsh, secure and mission critical environments. DARE TECH Dare Tech are a team of engineers who specialise in renewable and hybrid solutions. \"We use our engineering expertise combined with cutting edge technology to create sustainable solutions to power everyday activities and to help create better outcomes for our environment. We believe that innovation is at the heart of a sustainable blue economy.\" Dare Tech design and build products that are robust and suitable for the environment in which they operate. All systems use state of the art certified components ensuring the highest of quality system that produces maximum performance for the long term. \"We utilise the best renewable resources available at a project location. Wind and \/ or solar energy generating devices can easily be integrated into the system allowing maximum renewable energy generation, further reducing the requirement for diesel generation.\" BRIGHTWIND BrightWind provides a boutique resource and energy assessment service led by leading analysts with over 90+ years experience working for developers in the wind and solar industries. Its extensive experience, fast turn-around times and high quality services ensure that clients make the most accurate, confident and informed development decisions. BrightWind has committed 1% of its annual revenue to nature based solutions for biodiversity loss, native tree deforestation and climate change. \"Climate change is now a reality. And its not just climate change that is a reality. We are acidifying the oceans, losing sea ice, losing arable land and deforesting the planet at an alarming rate. Not just that, we are going through the 6th biggest mass extinction event the planet has ever faced. Renewable Energy as vital and key to our future as it is, is not enough to solve these problems.\" OPTINERGY Optinergy is an Irish owned company, specialising in the provision of Operations & Maintenance services to the wind industry in Ireland, Northern Ireland and the UK. Optinergy offers a full suite of wind turbine operations and maintenance services ranging from regular preventative maintenance to total asset management services. Optinergy offers a full suite of Operations & Maintenance services ranging from regular preventative maintenance to total asset management services, to providing its customers with specific tailored solutions to once off or recurring problems. It provides a range of services to its customers from time and materials up to full- service contracts including site management and preventative maintenance, including major component management. The company services and maintains a large number of wind farms with a diversity of WTGs including Vestas, Gamesa, GE, Nordex, Zond and Enercon. Apart from the scheduled maintenance, Optinergy also offers a fault find and repair service on turbines when breakdowns occur, normally responding within 24hrs. It carries out all major component changeouts on the turbines within its fleet including Generator, Gearbox and Blade bearings. SCHWUNGRAD ENERGIE Schwungrad Energie Ltd specialises in the installation and operation of high energy battery\/flywheel storage plant which can support stable, reliable and efficient electricity grid operation. Schwungrad is a consortium of energy specialists and financial investors and is based in Offaly. Schwungrad develop the capability of providing system services in an effective and economical way by adapting proven flywheel and integrating battery technology to produce an innovative hybrid system. There is a growing need for electrical grid stabilisation solutions which will enable greater penetration of intermittent renewable energy generation. This need is global; the market for this service is being established in Ireland and across the EU and is expected to develop worldwide. ELECTROROUTE Irish energy trading and services giant Electroroute reports strong 2021 results with revenues up to €203.3m from €46.2m. Business expansion in Europe and Japan is the main reason for the favourable performance, but the recording of mark-to-market valuation gains related to future deliveries is also a background factor. With the acquisition of a majority stake by Mitsubishi Corporation in 2016 and a wholly-owned subsidiary in 2022, Electroroute has expanded its business into the Japanese market. Through this partnership, Electroroute receives a capital contribution of €300 million from Mitsubishi Corporation. ElectroRoute is providing trading solutions to the 200MW battery portfolio being developed by Korean firm Hanwha Energy and Lumcloon Energy at two energy storage sites at Lumcloon and Shannonbridge in Co Offaly; once operational, the units will represent the largest operating batteries on the island of Ireland and one of the largest portfolios in Europe. Founded in 2011, Electroroute has expanded rapidly and now employs over 90 energy professionals across Ireland, the UK, Europe and Japan. ElectroRoute's trading team leverages its trading platform, ElectroRoute CORE, to operate 24\/7, including wind farms, solar farms and battery storage facilities in 14 energy markets. We provide essential trading services for renewable energy assets. In 2021, Electroroute won its first major contract in the Japanese market - a milestone power purchase agreement signed between MC Retail Energy, an affiliate of Electroroute, and the corporate buyer. The capacity of the battery facility managed by Electroroute has also been increased to 275MW, the largest independent battery portfolio on the island of Ireland. Electroroute's portfolio accounts for over 40% of the market share on the island of Ireland. Electroroute announced that it will hire 50 new specialist staff by 2025. FUINNEAMH SCEIRDE TEORANTA The Sceirde Rocks Windfarm is being developed by leading offshore wind business Corio Generation through the Irish and Gaeltacht based company Fuinneamh Sceirde Teoranta (FST). FST is a joint venture owned by Corio Generation, a portfolio company of Macquarie’s Green Investment Group, and global infrastructure investor Ontario Teachers’ Pension Plan. The project development team is working to help Ireland achieve its climate goals for 2030, engaging with the local community by creating local economic development and job opportunities, and providing clean, renewable energy for all. The Sceirde Rocks Windfarm is a proposed offshore wind project, located off the Connemara coast, that aims to power communities using clean and renewable energy. Once completed, it will provide enough reliable and affordable electricity to more than 350,000 homes. The project will help Ireland to achieve its goal of generating 80% of energy through renewable sources by 2030. BALCAS Balcas is a business focused on the future. \"We believe that sustainably managed forests are our future. So we innovate with timber, taking care to use it as efficiently as possible, planting four trees for every one we harvest.\" Balcas has energy-efficient and self-sufficient sawmills in Enniskillen and combined CHP plants in Enniskillen and Invergordon. The company’s sawmills in Enniskillen and combined CHP plants in Enniskillen and Invergordon are energy-efficient and self-sufficient. Its 370-plus people are experts in timber products and wood pellet production, delivery and supply. \"Our focus is on growing for tomorrow and keeping our position as one of Britain and Ireland’s largest wood product suppliers. All of these things make Balcas the natural leader.\" EQTEC In the beginning, EQTEC Iberia started operations from Spain in 1997. The company has since developed a research and development program in biomass and waste thermochemical gasification based on a bubbling fluidized bed gasifier. In Ireland in 2008, under the name Kedco plc and later React Energy plc, a business started operating as a developer of renewable energy projects and listed on the Alternative Investment Market of the London Stock Exchange. A number of years later, React Energy plc saw the opportunity to marry its project development experience with the technology expertise of EQTEC Iberia. Earlier this month, EQTEC signed a collaboration agreement with Poseidon LNG Hub to develop and deploy waste-to-hydrogen and waste-to-RNG projects in northern Italy. Under the agreement, the companies, within a consortium, will jointly target and pursue market opportunities for the development and deployment of EQTEC’s waste-to-hydrogen and waste-to-RNG technology in four potential plants under development in Italy. POWER CAPITAL RENEWABLE ENERGY Power Capital Renewable Energy is the largest independent solar power producer in Ireland, with a solar PV pipeline of 1.2GW, growing rapidly with multimillion acquisitions of Irish solar farms. With a target pipeline of 5GW by 2030, the company is constantly looking to expand its portfolio both nationally and internationally. Earlier this year announced the closing of an up to €240,000,000 construction equity facility with a consortium of lenders managed by Eiffel Investment Group, including Belgian insurance company Ethias and the European Investment Bank. The facility will support the IPP’s plans to bring 1.2GW of solar projects to operation by 2025. The facility has an initial tranche of €100,000,000. Part of this initial tranche will be used to build assets benefitting from signed Power Purchase Agreements (PPAs) with Microsoft and another undisclosed technology company, with the remainder for assets having been awarded tariffs in the Irish RESS2 auction. MACRO WORKS Established in 1999, Macro Works provides a full suite of LVIA-related tools and skills for a broad spectrum of energy, infrastructure and commercial developments. Its clients emanate from both the public and private sectors, in Ireland and abroad. Macro Works’ expertise primarily covers the stages of development, from initial feasibility studies through to the completion of the planning process. Not content to simply follow best practice, Macro Works constantly endeavour to establish it through constant R&D and innovation that takes advantage of the latest technologies. This push for constant advancement has ensured that Macro Works has remained at the forefront of LVIA services in Ireland for the past 20 years and will continue to do so into the future. \"We excel at challenging projects where our combination of experience and innovation can be brought to bear to give any development its greatest chance of success.\" SUPERNODE SuperNode is a cutting-edge global technology company based in Dublin, that designs superconducting transmission systems to integrate renewable energy and connect electricity markets. SuperNode designs superconducting transmission systems to integrate renewable energy and connect electricity markets using fewer and more efficient and environmentally friendly materials and, importantly, at a lower cost than any other viable alternative. Superconducting technology requires less materials, is more efficient and environmentally friendly and, importantly, costs less than any other viable alternative. SuperNode is co-owned by its founder Dr. Eddie O’Connor and Aker Horizons, a Norway-based developer of green energy and green industry. SuperNode was founded in 2018 and was originally named after the network concept, the supernode, before shifting its focus to develop superconducting technology. Its superconducting transmission products will be the key enabling network technology for the huge growth in renewable energy over the next 30 years. EPS For over five decades, EPS has been providing innovative and progressive products and solutions to the water sector. Through two generations of leadership, EPS has remained a progressive, innovative, reliable and client-focused company. \"We have achieved many milestones over the last 50 years, growing in numbers, strength and diversity of markets. We are constantly evolving and changing and so it is imperative that we have a clear mission and vision to drive us, a set of inherent company values to adhere to and a defined structure.\" Heading into its 54th year of operations, Mallow-headquartered EPS has been named Family Business of the Year at the 2022 Deloitte Best Managed Company Awards. Rising from humble beginnings in Kanturk to become one of the biggest water and wastewater infrastructure businesses of its kind, today EPS employs more than 570 people across its Irish and international operations.\\The company still proudly has its original customer base and product focus, dealing with treatment and pumping of water and wastewater for private residential homes & farms, expanding to encompass commercial and industrial businesses and utility companies across Ireland and Europe. ISLAND RENEWABLE ENERGY Founded in 2009 by an experienced group of renewable energy executives, its aim was to focus on exploiting renewable energy opportunities in selected European markets. \"We believe that renewable energy generation makes a positive contribution to the environment and the local communities we operate in, while at the same time meeting the necessary energy demands of local and national economies.\" The company objective is to create value for shareholders and other stakeholders through the realisation of renewable energy projects from all stages of development, to construction and operation. \"Our focus is on utility scale wind and solar projects where we can leverage our skills and where we believe we can generate real returns for investors. We work very closely with the local community, landowners, and all the relevant statutory bodies to obtain a successful outcome for our renewable energy projects.\" The group operates in Northern Ireland, Wales, Canary Islands and Portugal - markets where there are strong fundamentals over the long term. Island understands what is required to bring a renewable energy project from initiation to operation and is comfortable with the nature of the challenges involved. This capability combined with our financing and commercial expertise mean we are the natural bridge for infrastructure funds and long term asset management. The business currently has a pipeline of over 400MW of renewable energy across its markets.","filter_flag":1}
{"title":"Energy Transition in Canada – Pathway to the 2050 Energy System - EY","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmV5LmNvbS9lbl9jYS9lbmVyZ3ktcmVzb3VyY2VzL2VuZXJneS10cmFuc2l0aW9uLWluLWNhbmFkYS1wYXRod2F5LXRvLXRoZS0yMDUwLWVuZXJneS1zeXN0ZW3SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmV5LmNvbS9lbl9jYS9lbmVyZ3ktcmVzb3VyY2VzL2VuZXJneS10cmFuc2l0aW9uLWluLWNhbmFkYS1wYXRod2F5LXRvLXRoZS0yMDUwLWVuZXJneS1zeXN0ZW3SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vd3d3LmV5LmNvbS9lbl9jYS9lbmVyZ3ktcmVzb3VyY2VzL2VuZXJneS10cmFuc2l0aW9uLWluLWNhbmFkYS1wYXRod2F5LXRvLXRoZS0yMDUwLWVuZXJneS1zeXN0ZW3SAQA","guidislink":false,"published":"Mon, 15 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=135, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmV5LmNvbS9lbl9jYS9lbmVyZ3ktcmVzb3VyY2VzL2VuZXJneS10cmFuc2l0aW9uLWluLWNhbmFkYS1wYXRod2F5LXRvLXRoZS0yMDUwLWVuZXJneS1zeXN0ZW3SAQA?oc=5\" target=\"_blank\">Energy Transition in Canada – Pathway to the 2050 Energy System<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EY<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Energy Transition in Canada – Pathway to the 2050 Energy System - EY","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vd3d3LmV5LmNvbS9lbl9jYS9lbmVyZ3ktcmVzb3VyY2VzL2VuZXJneS10cmFuc2l0aW9uLWluLWNhbmFkYS1wYXRod2F5LXRvLXRoZS0yMDUwLWVuZXJneS1zeXN0ZW3SAQA?oc=5\" target=\"_blank\">Energy Transition in Canada – Pathway to the 2050 Energy System<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EY<\/font>","source.href":"https:\/\/www.ey.com","source.title":"EY","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"1. Defining the future energy system – A hybrid of old and new, the energy system will need to capitalize and build on existing sources of energy, interwoven with innovative solutions including electrification, clean hydrogen and renewables. An optimized mix combined with a central, national vision and action plan will help ease the transition and position us as leaders in sustainability for the future. 2. Improving public policy and regulatory frameworks – Having a national plan, with clear accountabilities and policies to ensure traction and forward progress and strategies to support capital allocation will be critical. Carbon levies, emissions caps and carbon offsetting capabilities can go a long way towards ensuring compliance and incentivizing progress. 3. Developing a funding mechanism – Investors have a way of unlocking potential. Public and private, blended financing and innovative ESG investment frameworks for energy transition enterprises will provide much-needed access to the capital needed to feed decarbonization agendas. 4. Educating and guiding consumer behaviour – According to EY’s Future Consumer Index Survey, 61% of Canadians say they will pay more attention to the environmental impact of purchases, and 69% expect companies to solve sustainability issues. Making consumers aware of their impact can help them to make better choices and apply pressure with their spending dollars. 5. Activating corporate participation – Organizations should be invited to continue contributing to decarbonization efforts internally. Increased capital allocation and the introduction of disclosure and reporting standards may help encourage organizations to adopt new technologies and be more accountable for their own impact. Engaging diverse stakeholders and delivering on decarbonization targets will be near-impossible without three key enablers. Technology and innovation, while not solutions to the energy transition, will be critical tools and early and proactive investment in new and creative tools and processes will enable efficiencies and expedite industry’s path to net-zero. Having humans at the centre of change with transformative leadership and tangible value delivered to stakeholders each step along the way will help sustain progress. And partnering through collaboration and sponsorships like Pathways Alliance – Canada's oil sands producers working together to address climate change – will help build awareness, distribute knowledge, invite participation and perhaps most importantly, ensure resources are available to see change through. Decarbonizing to avert climate crisis is a massive undertaking. While there are certainly gaps to overcome, Canada’s role in energy transition holds significant promise. Our work with disclosures and clean technologies have us off to a good start. We’ll need decisive action and the dedicated attention of government, industry, investors and citizens if we are to realize our decarbonization goals and move forward together for a more sustainable future.","filter_flag":1}
{"title":"Shashi Amin, CEO - Cable Solutions at APAR Industries Limited - Energetica India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS9zaGFzaGktYW1pbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS9zaGFzaGktYW1pbtIBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS9zaGFzaGktYW1pbtIBAA","guidislink":false,"published":"Fri, 05 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=125, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS9zaGFzaGktYW1pbtIBAA?oc=5\" target=\"_blank\">Shashi Amin, CEO - Cable Solutions at APAR Industries Limited<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Shashi Amin, CEO - Cable Solutions at APAR Industries Limited - Energetica India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmVuZXJnZXRpY2EtaW5kaWEubmV0L3Bvd2VyZnVsLXRob3VnaHRzL29ubGluZS9zaGFzaGktYW1pbtIBAA?oc=5\" target=\"_blank\">Shashi Amin, CEO - Cable Solutions at APAR Industries Limited<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Energetica India <\/font>","source.href":"https:\/\/www.energetica-india.net","source.title":"Energetica India","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"May 05, 2023. By News Bureau APAR Industries Limited is gearing up to tackle the biggest challenges of the 21st century, catering to the needs of the global energy sector through sustainable means. The company believes that with an innovation-first mindset, solutions that make anything possible can be found, shared Mr. Shashi Amin, CEO - Cable Solutions, APAR Industries Limited in an interview with Anurima Mondal, Associate Editor, Energetica India. Mr. Amin added that APAR's mission is to design & manufacture building blocks for energy infrastructure, transportation & telecommunication sectors that contribute meaningfully to make this world a more energy-efficient, environmentally sustainable and safer place. Que: APAR is one of the prominent cable manufacturers for renewables and speciality cable. Please tell us about your product portfolio for the RE sector along with your market footprint and clientele. Ans: As India's economic growth is estimated to be 6.4 percent in the upcoming financial year as per RBI, we can expect a push towards more investments and a renewed focus on Atmanirbhar Bharat. For energy transmission, the focus lies on clean and sustainable energy. This is a significant development since catering to clean energy needs will be beneficial for industrial advancements as well as the overall growth of the country. APAR Industries Limited is India's leading manufacturer of renewable and speciality cables with a wide range of products. With a market potential of more than INR 2,500 crore for the cable market, renewable energy is the future of power in the entire world. Below are some of our major product diversity in the renewable sector. Solar Power • International certification of the highest standards as per BS EN 50618, TUV 2007 & 2012, IEC 62930:2017 & UL 4703; • High Di-electric strength, flame retardant; oil and chemical resistant, abrasion and crack resistant; Good cold flexibility, compatible to all popular connectors; ROHS compliant; • 2.5 to 300 sq.mm cables powered by electron beam cross-linking technology; • Electron beam irradiated LT XLPE cables are suitable up to 120°C operating temperature. These cables offer 15 percent extra current rating over conventional cables; • Annealed tinned flexible copper conductor, electron beam cross-linked polyolefin (XLPO) insulation and sheath having UV & ozone protection properties and a life span of more than 25 years; • Rated 1.8 kV DC operation. Cables are halogen free and can operate up to 120°C rated 1.5kV (Max 1.8 kV); • Flexible aluminium conductor for solar AC and DC cables; • Aluminium cables with steel tape\/flat strip\/round wire armouring for combiner box to Inverter; • Solar PV cables with Rodent resistant features; • Nylon jacketed cables, as per AS\/NZ specs are also available for rodent protection • A new CCV line for elastomeric cables up to 75KV is commissioned, which will help us supply smooth finish mining cable to the international market. Wind Power • Complete integral harness from nacelle to turbine; • PLC\/SCADA harness (presently being provided by the electrical contractor); • LV Power Cables; • LV Control and Supply cable kits; • Sensor Harnesses; • Patch Cord OFC; • Sub Station\/Transmission Cables; • Complete integral harness from nacelle to turbine Que: Shed some light on the unique strengths of the product range with a particular focus on your solutions for the EV segment. Ans: APAR is the first Indian cable manufacturer to enter the EV segment, geared up to meet the global standards of quality requirements and the continuously growing market demand. All production lines are high precision and automatic. Our plan over the next two years is to do harness for 0.3 lac passenger vehicles and 1 lac 3 wheeler. The Credentials of APAR EV Wiring and Wiring Solutions: • The manufacturing unit based at Khatalwada dist. Valsad, Gujarat is IATF certified; • The manufacturing facilities are the most modern including 4 nos of E-beam accelerators. Cot tube manufacturing is also in house; • All cables used in EV wiring solutions are electron beam cured, type D and rated for -40 °C to +150 °C, meeting international standards and ARAI approved; • The EV charger cables are approved\/certified by TUV & UK Cert for EN 50620 and EN 62893-4-1; • APAR has successfully developed and launched a complete EV charger of rating up to AC 63 amp- 415 V\/DC 1000V load 200 amp; • APAR has successfully designed, developed and supplied large quantities of complete HV cable harnesses to EV passenger vehicles and 3 wheelers; • As of date, the total number of EV passenger vehicles equipped with APAR wiring harness is over 1200. Manufacturing Range of APAR for EV Segment • Complete range of screened battery cables 0.5 sq. to 300 sq.mm – multi-strand copper conductor insulated with specially formulated e-beam cross-linked high-end polymers, screened using copper\/aluminium\/steel and sheathed with special XLPO polymers to withstand rugged conditions and temperature rating of -40 °C to +150 °C; • Complete range of specially screened battery cables insulated with silicon rubber and teflon for temperature requirements above 150 °C; • Complete range of cable protection system - special nylon cot tubes 12mm to 50 mm inner dia; • Complete HV cable harness – PDU to MCU, MCU to TM, HVSS to Lenze, PSM to inverter, ACM to inverter, PDU to BMS, PDU to DC-DC converter; • Complete range of EV charger composite cables; • Complete EV charger assembly – CCS2 type, suitable for both AC & DC. Que: Are there any plans to diversify your portfolio for the renewable energy sector in the immediate future? Ans: APAR Industries Limited believes in ‘Tomorrow's Solution Today’, and with this vision, we always look forward to exploring new opportunities, developing a new product and adapting the latest technology. We have undertaken a project for adding a new CCV line for elastomeric cables upto 75KV, which will help us supply smooth finish mining cable to the international market and also focus on the high-margin export business in the wind energy segment. We are constantly developing new products and new markets across the globe to serve our customers with the best-in-class technological solutions. Que: APAR has recently signed a JV with Clean Max Rudra Private Limited to establish and develop wind and solar hybrid power generation facilities in the state of Gujarat. Tell us more about this project. Ans: APAR signed aJV with Clean Max Rudra Private Limited for the purpose of establishing and developing wind and solar hybrid power generation facilities in the state of Gujarat, having wind turbine generators of 3.3 MVA capacity and a solar capacity of 2.805 MWp (DC). The power generated from the project will be supplied exclusively to APAR and SPV (APAR – 26 percent in the SPV Company, Clean Max Enviro Energy Solutions Private Limited - 74 percent in the SPV Company) will be the operator of the entire project as generator. This will help to operate our cable manufacturing plant entirely through renewable energy. This project is under execution, and we will share further details subsequently. Que: What are your views on India's ambitious plan to install 500 GW of renewable energy capacity by 2030? Where do you place yourself in this growth story? Ans: In the past decade, the demand for renewable energy alternatives within business practices has steadily increased, and consumers are beginning to care more about how products and services will affect the planet long term. The focus on cost-efficiency from a consumer's perspective has shifted dramatically, and companies are beginning to incorporate sustainable practices within their production and distribution due to this rapid change. In the current economic climate, a company's willingness to adapt to the demand of current market trends and adopt a green mentality may 'make or break' their overall success. India is 3rd largest producer of electricity worldwide, with a target of 500 GW of renewable energy by 2030; With new Renewable Purchase Obligations – DISCOMs mandatorily need to purchase renewable power resulting in huge development for transformation from fossil fuel-based energy to renewable energy; so the cable market will naturally grow in synchronisation with the power industry. Further to this, INR 19,500 crore for solar PLI Scheme and multiple ongoing projects are there which will significantly increase the demand for sustainable & eco-friendly cables. APAR Industries Limited (cable solution) has also grown significantly in the last few years with an average 17 percent CAGR. Also, our export revenue has increased significantly in the last few years, contributing 52-55 percent of the total revenue. Over the past few years, our cable vertical has developed and introduced specialised OFC cables, tether cables, tactical cables, submarine pressure tight cables, torpedo cables, for defence and shipyards. Also, our e-beam powered APAR ANUSHAKTI house wire is a unique product that creates new insight on the consumers buying mentality and captures market at a very fast pace. APAR ANUSHAKTI is melt-resistant, fire-retardant and have 50 years of life. Currently, our R&D team is developing high ampacity cables with high-temperature withstanding capability, improving the anti-rodent properties of cables and developing other specialised cables for specific applications in the field of defence, telecom, renewable energy and other industrial segments. We are also continuously working towards expanding our manufacturing capacity as well as our product range. Que: Sustainability is viewed as a key performance parameter for all industries; what is your perspective on the same and what initiatives have you taken on clean technology, energy efficiency and renewable energy? Ans: Although APAR started its sustainability journey in April 2021, over the past few years, we have made significant progress in the areas of environmental performance, energy conservation and improved safety considerations in our product design features. Our eminent ESG initiatives include: setting the foundation for water conservation and reducing the consumption of fossil fuel-based grid energy, augment the rainwater harvesting capacities for sustainable water security at our various plants. Additionally, we have entered a definitive agreement with a leading supplier to jointly develop a 3.3 MWp hybrid power project (wind solar hybrid) under the group captive model. This initiative will reduce our requirement for grid-based electricity significantly and reduce GHG emissions by approximately 10,000 tCO2e per annum for the Khatalwada plant. APAR Industries Limited has been rated among Top-3 in the ‘Industry Segment’ as per CRISIL ESG rating 2022 (report dated 19 May 2022) with a cumulative score of 59 (industry average 54).","filter_flag":1}
{"title":"B.C.'s largest coastline cleanup gets major funding boost | BC Gov News - BC Gov News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbmV3cy5nb3YuYmMuY2EvcmVsZWFzZXMvMjAyM0VOVjAwMzQtMDAwODM50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbmV3cy5nb3YuYmMuY2EvcmVsZWFzZXMvMjAyM0VOVjAwMzQtMDAwODM50gEA?oc=5","id":"CBMiMmh0dHBzOi8vbmV3cy5nb3YuYmMuY2EvcmVsZWFzZXMvMjAyM0VOVjAwMzQtMDAwODM50gEA","guidislink":false,"published":"Tue, 30 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=150, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbmV3cy5nb3YuYmMuY2EvcmVsZWFzZXMvMjAyM0VOVjAwMzQtMDAwODM50gEA?oc=5\" target=\"_blank\">B.C.'s largest coastline cleanup gets major funding boost | BC Gov News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BC Gov News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"B.C.'s largest coastline cleanup gets major funding boost | BC Gov News - BC Gov News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbmV3cy5nb3YuYmMuY2EvcmVsZWFzZXMvMjAyM0VOVjAwMzQtMDAwODM50gEA?oc=5\" target=\"_blank\">B.C.'s largest coastline cleanup gets major funding boost | BC Gov News<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BC Gov News<\/font>","source.href":"https:\/\/news.gov.bc.ca","source.title":"BC Gov News","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"The Province is helping protect and restore B.C.’s marine environment with a further investment in the Clean Coast, Clean Waters Initiative Fund. Projects funded through this program have removed derelict vessels and cleaned up marine debris from more than 4,600 kilometres of shoreline, while creating more than 1,700 well-paying jobs. “I am honoured to stand with First Nations and partner organizations who are taking a leadership role in cleaning up marine debris and plastic pollution. The Clean Coast, Clean Waters projects have and continue to help protect and restore the health of our marine ecosystems. All British Columbians deserve access to a healthy environment,” said George Heyman, Minister of Environment and Climate Change Strategy. “As part of our government’s broader CleanBC Plastics Action Plan to reduce plastic waste and pollution, these projects are protecting our coastlines for the benefit of our communities now and for the future.” An additional $25 million in one-time funding will more than double the B.C. government’s investment in the Clean Coast, Clean Waters Initiative Fund, for a total of approximately $50 million. The Coastal First Nations-Great Bear Initiative will receive $4 million, bringing its total funding to $7.5 million since 2020. The remaining $21 million will be awarded to successful funding applicants through a merit-based assessment process, administered by PwC Canada. “The Clean Coast, Clean Waters initiative has removed over 1,500 tonnes of marine debris to date, including 118 derelict vessels,” said Nathan Cullen, Minister of Water, Land and Resource Stewardship. “Preventing and cleaning up marine pollution is essential to a healthy and productive coast, and is one aspect of our vision for B.C.’s future as we develop a Coastal Marine Strategy in partnership with First Nations.” Eligible funding applicants for the merit-based process include coastal First Nations and local governments, as well as non-profits and others with expertise in shoreline debris cleanup or removal of derelict vessels. The funding will be distributed in two rounds, one this spring and another planned for early 2024. The first application period has ended. Successful recipients will be notified in June to allow projects to begin this summer. Projects from the first round must be completed, have their data collected and final reports submitted by Feb. 29, 2024. Marine debris is collected and managed appropriately, with the goal of recycling as much as possible to reduce the amount of material going to landfills. To date, 64% of shoreline materials have been recycled or upcycled. Recyclable items are sent to the Ocean Legacy Foundation facility in Steveston for processing into new products, such as pellets that can be used to create new plastic materials. The Coastal First Nations-Great Bear Initiative brings together nine First Nations living on B.C.’s North and Central Coasts, and Haida Gwaii. They aim to restore and protect ecosystems through sustainable resource management practices, which promote self-sufficiency and improve the quality of life for people in these communities. “These shoreline cleanup projects are not just important for keeping coastal territories clean, they also support the transfer of Indigenous knowledge and practices to a younger generation,” said Christine Smith-Martin, chief executive officer, Coastal First Nations-Great Bear Initiative. “By sharing their success stories, best practices and challenges in marine debris collection and monitoring, First Nations across the North and Central Coast and Haida Gwaii continue to work together as stewards of the land and sea.” Clean Coast, Clean Waters is part of the CleanBC Plastics Action Plan. Its goal is to reduce plastic waste and pollution. The government is developing B.C.’s first Coastal Marine Strategy to govern and plan for securing vast marine ecosystems and blue economy in the long term. The strategy guides improved stewardship of coastal marine environments, advances reconciliation with First Nations and fosters coastal community resilience. Quotes: Sheila Malcolmson, Minister of Social Development and Poverty Reduction − “We all want all B.C.’s shorelines cared for and pollution-free. The Clean Coast, Clean Waters Initiative Fund I helped start cleaned more beaches as First Nations and coastal community partnerships strengthened. I’m glad we can fund more of their hard work.” Aman Singh, Parliamentary Secretary for Environment − “Most of the cleanup efforts occur in remote locations, with weather and accessibility challenges. Despite these difficulties, this work on our coastlines highlights how passionate British Columbians are about protecting our environment and restoring our shorelines and coastal waters.” Adam Walker, MLA for Parksville-Qualicum − “We are fortunate to live in a community next to the beautiful shorelines and rich biodiversity of the Salish Sea. Thanks to the Clean Coast, Clean Waters initiative, these natural spaces can be sustainably maintained and support a healthy coastal ecotourism economy in B.C.” Capt. Josh Temple, executive director, Coastal Restoration Society − \"The Clean Coast, Clean Waters initiative has empowered First Nations and non-profit organizations like the Coastal Restoration Society to undertake large-scale environmental restoration projects. These projects support the health of our marine ecosystems, create meaningful jobs and highlight the importance of keeping our coastlines free of plastics.” Learn More: For more information about the Clean Coast, Clean Waters Initiative Fund, visit: www.bccleancoast.ca For information about B.C.’s Coastal Marine Strategy, visit: https:\/\/engage.gov.bc.ca\/coastalmarinestrategy\/ For more information about the Coastal First Nations-Great Bear Initiative, visit: https:\/\/coastalfirstnations.ca\/","filter_flag":1}
