{"title":"NEW PIRELLI LOGO TO IDENTIFY TYRES WITH AT LEAST 50% SUSTAINABLE MATERIALS - Newsroom Pirelli","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcHJlc3MucGlyZWxsaS5jb20vbmV3LXBpcmVsbGktbG9nby10by1pZGVudGlmeS10eXJlcy13aXRoLWF0LWxlYXN0LTUwLXN1c3RhaW5hYmxlLW1hdGVyaWFscy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcHJlc3MucGlyZWxsaS5jb20vbmV3LXBpcmVsbGktbG9nby10by1pZGVudGlmeS10eXJlcy13aXRoLWF0LWxlYXN0LTUwLXN1c3RhaW5hYmxlLW1hdGVyaWFscy_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vcHJlc3MucGlyZWxsaS5jb20vbmV3LXBpcmVsbGktbG9nby10by1pZGVudGlmeS10eXJlcy13aXRoLWF0LWxlYXN0LTUwLXN1c3RhaW5hYmxlLW1hdGVyaWFscy_SAQA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcHJlc3MucGlyZWxsaS5jb20vbmV3LXBpcmVsbGktbG9nby10by1pZGVudGlmeS10eXJlcy13aXRoLWF0LWxlYXN0LTUwLXN1c3RhaW5hYmxlLW1hdGVyaWFscy_SAQA?oc=5\" target=\"_blank\">NEW PIRELLI LOGO TO IDENTIFY TYRES WITH AT LEAST 50% SUSTAINABLE MATERIALS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Newsroom Pirelli<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NEW PIRELLI LOGO TO IDENTIFY TYRES WITH AT LEAST 50% SUSTAINABLE MATERIALS - Newsroom Pirelli","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vcHJlc3MucGlyZWxsaS5jb20vbmV3LXBpcmVsbGktbG9nby10by1pZGVudGlmeS10eXJlcy13aXRoLWF0LWxlYXN0LTUwLXN1c3RhaW5hYmxlLW1hdGVyaWFscy_SAQA?oc=5\" target=\"_blank\">NEW PIRELLI LOGO TO IDENTIFY TYRES WITH AT LEAST 50% SUSTAINABLE MATERIALS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Newsroom Pirelli<\/font>","source.href":"https:\/\/press.pirelli.com","source.title":"Newsroom Pirelli","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"WORLD DEBUT ON THE P ZERO E, CONTAINING MORE THAN 55% MATERIALS OF BIO-BASED AND RECYCLED ORIGIN NEW MARKING ENABLES CONSUMERS TO INSTANTLY RECOGNISE MORE SUSTAINABLE TYRES Milan, September 20, 2023. Pirelli has created a bespoke logo to identify tyres that contain at least 50% materials of bio-based and recycled origin. The new marking – which depicts two arrows in a circle and will be adopted on new products – underlines Pirelli's commitment to the environment, maintaining the high level of safety performance inherent in every single tyre produced by the Italian firm. This new logo is also designed as a clear indication for customers, allowing them to choose more sustainable tyres. The latest Pirelli marking was used for the first time on the P Zero E. This tyre contains more than 55% of materials of bio-based and recycled origin* throughout the entire range at launch, as certified by Bureau Veritas: a world leader in verifying conformity and certification in quality, environment, health, safety, and social responsibility standards (ISO14021). Third-party verification of eco-compatible materials will continue to be standard across all future products that adopt the new logo. Giovanni Tronchetti Provera, Head of Sustainability and Future Mobility at Pirelli, said: “For several years, Pirelli has consistently reduced its environmental impact: a policy confirmed by all the main sustainability indices, which have recognised our commitment and transparency both in terms of results and ethos. For this reason, for example, we indicate the percentage of sustainable materials by saying ‘at least’ rather than ‘up to’. We will now continue down this road, which our car manufacturer partners also recognise and appreciate.” Pirelli's path towards reduced environmental impact includes the ever-increasing use of sustainable materials. Pirelli’s initial objective, originally set for 2025, has already been achieved two years early thanks to P Zero E. The next step, set for selected product lines by 2030, envisages the use of at least 60% of materials of bio-based origin and 12% recycled, with less than 30% of fossil-derived ingredients. Pirelli aims to regularly improve these targets thanks to the technological innovation of all the different departments involved in tyre development. These innovations have set in motion a virtuous path both at quantitative level – thanks to increasingly higher percentages of sustainable materials – and qualitative level, through the certification of supply chains to internationally accredited standards. In 2021, for example, Pirelli was first to produce an FSC® (Forest Stewardship Council®) certified tyre that uses natural rubber and FSC® rayon. As a result, customers had the guarantee that all materials sourced from forests came from plantations that promote biological diversity, while bringing economic sustainability to the lives of local communities and workers. The main challenge in developing the new P Zero E was to combine the need for sustainability with the high performance required from a UHP tyre. This objective was reached thanks to these new materials, which include: LIGNIN Lignin comes from the scrap of the pulp and paper industry. Lignin contributes to tyre durability and foreseen rolling resistance reduction. RICE HUSK ASH SILICA Rice husk ash silica derives from the scrap of rice cultivation. Silica is widely used in tread compounds to obtain a high level of performance in wet conditions. Rice husk ash silica is a good replacement for fossil-based silica in such tread applications. CIRCULAR CARBON BLACK Circular carbon black derives from end-of-life tyres pyrolysis oil. Pyrolysis is a way to prevent landfill disposal of end-of-life tyres. Carbon black is used in rubber compounds to optimise stability, strength, and durability of tyres. BIO CIRCULAR POLYMERS Bio-circular polymers are made from monomers derived from used cooking oils or tyre pyrolysis oil. They are a replacement for fossil-sourced polymers. NATURAL RUBBER Natural rubber is obtained from the latex of Hevea Brasiliensis, the rubber tree. This is a material 100% derived from biomass. BIO-RESINS Bio resins are plasticisers deriving from vegetal biomass such as plant seeds (sunflower or canola) or forest-based resins. Bio resins are versatile ingredients, providing a better balance of dry and wet performance. RAYON Rayon is a textile reinforcement of a tyre, with fibres deriving from cellulose.","filter_flag":1}
{"title":"Pirelli's New Tire Logo Signals Sustainable Materials - Tire Review","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LnRpcmVyZXZpZXcuY29tL3BpcmVsbGktdGlyZS1sb2dvLXN1c3RhaW5hYmxlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LnRpcmVyZXZpZXcuY29tL3BpcmVsbGktdGlyZS1sb2dvLXN1c3RhaW5hYmxlL9IBAA?oc=5","id":"CBMiOWh0dHBzOi8vd3d3LnRpcmVyZXZpZXcuY29tL3BpcmVsbGktdGlyZS1sb2dvLXN1c3RhaW5hYmxlL9IBAA","guidislink":false,"published":"Wed, 27 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LnRpcmVyZXZpZXcuY29tL3BpcmVsbGktdGlyZS1sb2dvLXN1c3RhaW5hYmxlL9IBAA?oc=5\" target=\"_blank\">Pirelli's New Tire Logo Signals Sustainable Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tire Review<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pirelli's New Tire Logo Signals Sustainable Materials - Tire Review","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vd3d3LnRpcmVyZXZpZXcuY29tL3BpcmVsbGktdGlyZS1sb2dvLXN1c3RhaW5hYmxlL9IBAA?oc=5\" target=\"_blank\">Pirelli's New Tire Logo Signals Sustainable Materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tire Review<\/font>","source.href":"https:\/\/www.tirereview.com","source.title":"Tire Review","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Pirelli created a bespoke logo to identify tires that contain at least 50% materials of bio-based and recycled origin. The new marking – which depicts two arrows in a circle and will be adopted on new products – underlines Pirelli’s commitment to the environment, the company said. This new logo is also designed as a clear indication for customers, allowing them to choose more sustainable tires. The latest Pirelli marking was used for the first time on the P Zero E, which contains more than 55% of materials of bio-based and recycled origin. Pirelli’s path towards reduced environmental impact includes the increasing use of sustainable materials. Pirelli said its initial objective, originally set for 2025, has already been achieved two years early thanks to P Zero E. The next step, set for selected product lines by 2030, envisages the use of at least 60% of materials of bio-based origin and 12% recycled, with less than 30% of fossil-derived ingredients. Pirelli said it aims to regularly improve these targets thanks to the technological innovation of all the different departments involved in tire development. The main challenge in developing the new P Zero E was to combine the need for sustainability with the high performance required from a UHP tire. This objective was reached thanks to these new materials, Pirelli said, which include: Lignin: Lignin comes from the scrap of the pulp and paper industry. Lignin contributes to tire durability and foreseen rolling resistance reduction. Rice husk ash silica: Rice husk ash silica derives from the scrap of rice cultivation. Silica is widely used in tread compounds to obtain a high level of performance in wet conditions. Rice husk ash silica is a good replacement for fossil-based silica in such tread applications. Circular carbon black: Circular carbon black derives from end-of-life tires pyrolysis oil. Pyrolysis is a way to prevent landfill disposal of end-of-life tires. Carbon black is used in rubber compounds to optimize stability, strength, and durability of tires. Bio-circular polymers: Bio-circular polymers are made from monomers derived from used cooking oils or tire pyrolysis oil. They are a replacement for fossil-sourced polymers. Natural rubber: Natural rubber is obtained from the latex of Hevea Brasiliensis, the rubber tree. This is a material 100% derived from biomass. Bio resins: Bio resins are plasticizers deriving from vegetal biomass such as plant seeds (sunflower or canola) or forest-based resins. Bio resins are versatile ingredients, providing a better balance of dry and wet performance.","filter_flag":1}
{"title":"Honda East Liberty Auto Plant Earns E3 Platinum Achievement Award from Ohio EPA - Honda Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtY2MzOTE5NmU4NDc4N2EyMGVjM2NiMDg2ZmIxNGQ0NTktaG9uZGEtZWFzdC1saWJlcnR5LWF1dG8tcGxhbnQtZWFybnMtZTMtcGxhdGludW0tYWNoaWV2ZW1lbnQtYXdhcmQtZnJvbS1vaGlvLWVwYdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtY2MzOTE5NmU4NDc4N2EyMGVjM2NiMDg2ZmIxNGQ0NTktaG9uZGEtZWFzdC1saWJlcnR5LWF1dG8tcGxhbnQtZWFybnMtZTMtcGxhdGludW0tYWNoaWV2ZW1lbnQtYXdhcmQtZnJvbS1vaGlvLWVwYdIBAA?oc=5","id":"CBMirQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtY2MzOTE5NmU4NDc4N2EyMGVjM2NiMDg2ZmIxNGQ0NTktaG9uZGEtZWFzdC1saWJlcnR5LWF1dG8tcGxhbnQtZWFybnMtZTMtcGxhdGludW0tYWNoaWV2ZW1lbnQtYXdhcmQtZnJvbS1vaGlvLWVwYdIBAA","guidislink":false,"published":"Tue, 19 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=262, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtY2MzOTE5NmU4NDc4N2EyMGVjM2NiMDg2ZmIxNGQ0NTktaG9uZGEtZWFzdC1saWJlcnR5LWF1dG8tcGxhbnQtZWFybnMtZTMtcGxhdGludW0tYWNoaWV2ZW1lbnQtYXdhcmQtZnJvbS1vaGlvLWVwYdIBAA?oc=5\" target=\"_blank\">Honda East Liberty Auto Plant Earns E3 Platinum Achievement Award from Ohio EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Honda East Liberty Auto Plant Earns E3 Platinum Achievement Award from Ohio EPA - Honda Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMirQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvaG9uZGEtY29ycG9yYXRlL3JlbGVhc2VzL3JlbGVhc2UtY2MzOTE5NmU4NDc4N2EyMGVjM2NiMDg2ZmIxNGQ0NTktaG9uZGEtZWFzdC1saWJlcnR5LWF1dG8tcGxhbnQtZWFybnMtZTMtcGxhdGludW0tYWNoaWV2ZW1lbnQtYXdhcmQtZnJvbS1vaGlvLWVwYdIBAA?oc=5\" target=\"_blank\">Honda East Liberty Auto Plant Earns E3 Platinum Achievement Award from Ohio EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","source.href":"https:\/\/hondanews.com","source.title":"Honda Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Honda today announced that the environmental team at the company’s East Liberty Auto Plant (ELP) has been honored with the Ohio Environmental Protection Agency’s (EPA) prestigious Encouraging Environmental Excellence (E3) Platinum Achievement Award. This recognition highlights the unwavering commitment and dedication of the Honda team toward sustainability and its effort to work toward the company’s Triple Action to Zero approach. The Ohio EPA's E3 program recognizes organizations that demonstrate exceptional environmental leadership and sustainability practices. Achieving the platinum level is a testament to the commitment of the Honda team at ELP to minimizing its environmental footprint while contributing positively to the community and the planet. In its continuous effort to strive for excellence in environmental management, the Honda team at ELP has implemented innovative and sustainable practices, including recycling over 315,000 pounds of scrap bumper materials to use in producing new bumpers, and developing new technology to help remove algae from water pipes to prevent any impact to Honda or the local Marysville community. The plant also has hosted environmental fairs aimed at supporting improvements at Honda and within the local community. Tangible results include reducing greenhouse gas emissions, conserving water resources, minimizing waste, and promoting eco-friendly manufacturing processes. \"This recognition is a testament to the hard work and dedication of our environmental team at the East Liberty Auto Plant,\" said Kailynn Zook, Green Factory Team Lead at Honda’s East Liberty Auto Plant. \"We have always believed that responsible environmental practices are not just our duty but also a commitment to the well-being of future generations. Receiving the Ohio EPA's E3 Platinum Achievement Award reinforces our commitment to sustainability and motivates us to continue raising the bar in environmental excellence.\" Triple Action to Zero Honda is working toward its global goal of zero environmental impact by 2050 through its “Triple Action to Zero” approach, including achieving carbon neutrality for all products and corporate activities, 100% utilization of renewable energy, and resource circulation, utilizing 100% sustainable materials by reprocessing products back to raw materials and reusing those materials in the creation of new products. Honda Manufacturing in Ohio Honda has produced automobiles in Ohio for 40 years, beginning in November 1982 with the start of automobile production at the Marysville Auto Plant. Honda established U.S. manufacturing operations in Marysville in 1979 with the start of motorcycle production. Today, Honda employs more than 14,000 associates in Ohio across five plants with total capital investment of $14.2 billion and the capacity to produce 680,000 Honda and Acura automobiles, 1.18 million automobile engines, and over 1 million automobile transmissions and two-motor hybrid systems, using domestic and globally sourced parts. Honda’s five Ohio manufacturing facilities include three auto plants, the Marysville Auto Plant, East Liberty Auto Plant and Performance Manufacturing Center, as well as the Anna Engine Plant and Russells Point transmission plant. The company has invested $2.7 billion in these facilities over the past six years, continually modernizing equipment and adopting new technologies to advance quality and efficiency for Honda and Acura customers here and around the world. Learn more at https:\/\/ohio.honda.com\/ # # #","filter_flag":1}
{"title":"Target Brands - Target Corporate","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vY29ycG9yYXRlLnRhcmdldC5jb20vYWJvdXQvcHJvZHVjdHMtc2VydmljZXMvdGFyZ2V0LWJyYW5kc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vY29ycG9yYXRlLnRhcmdldC5jb20vYWJvdXQvcHJvZHVjdHMtc2VydmljZXMvdGFyZ2V0LWJyYW5kc9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vY29ycG9yYXRlLnRhcmdldC5jb20vYWJvdXQvcHJvZHVjdHMtc2VydmljZXMvdGFyZ2V0LWJyYW5kc9IBAA","guidislink":false,"published":"Wed, 27 Sep 2023 20:52:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=27, tm_hour=20, tm_min=52, tm_sec=0, tm_wday=2, tm_yday=270, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vY29ycG9yYXRlLnRhcmdldC5jb20vYWJvdXQvcHJvZHVjdHMtc2VydmljZXMvdGFyZ2V0LWJyYW5kc9IBAA?oc=5\" target=\"_blank\">Target Brands<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Target Corporate<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Target Brands - Target Corporate","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vY29ycG9yYXRlLnRhcmdldC5jb20vYWJvdXQvcHJvZHVjdHMtc2VydmljZXMvdGFyZ2V0LWJyYW5kc9IBAA?oc=5\" target=\"_blank\">Target Brands<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Target Corporate<\/font>","source.href":"https:\/\/corporate.target.com","source.title":"Target Corporate","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Launched in April 2019, Everspring is a household essentials owned brand comprised of items ranging from laundry detergent to candles — all of which are made with reusable, biobased or recycled materials, or natural fibers. Everspring incorporates thoughtful details, from beautifully designed packaging to carefully selected scent profiles such as citrus and basil, and all products are compliant with Target Clean. One of the newest additions: ultra-concentrated cleaners that can be used in reusable Everspring spray bottles, cutting down on emissions and packaging. Shop Everspring","filter_flag":1}
{"title":"Lintec Europe launches sustainable materials - Labels and Labeling","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL25ld3Mvc3Vic3RyYXRlcy1hZGhlc2l2ZXMvbGludGVjLWV1cm9wZSVDMiVBMGxhdW5jaGVzLXN1c3RhaW5hYmxlLW1hdGVyaWFsc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL25ld3Mvc3Vic3RyYXRlcy1hZGhlc2l2ZXMvbGludGVjLWV1cm9wZSVDMiVBMGxhdW5jaGVzLXN1c3RhaW5hYmxlLW1hdGVyaWFsc9IBAA?oc=5","id":"CBMibGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL25ld3Mvc3Vic3RyYXRlcy1hZGhlc2l2ZXMvbGludGVjLWV1cm9wZSVDMiVBMGxhdW5jaGVzLXN1c3RhaW5hYmxlLW1hdGVyaWFsc9IBAA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL25ld3Mvc3Vic3RyYXRlcy1hZGhlc2l2ZXMvbGludGVjLWV1cm9wZSVDMiVBMGxhdW5jaGVzLXN1c3RhaW5hYmxlLW1hdGVyaWFsc9IBAA?oc=5\" target=\"_blank\">Lintec Europe launches sustainable materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lintec Europe launches sustainable materials - Labels and Labeling","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHA6Ly93d3cubGFiZWxzYW5kbGFiZWxpbmcuY29tL25ld3Mvc3Vic3RyYXRlcy1hZGhlc2l2ZXMvbGludGVjLWV1cm9wZSVDMiVBMGxhdW5jaGVzLXN1c3RhaW5hYmxlLW1hdGVyaWFsc9IBAA?oc=5\" target=\"_blank\">Lintec Europe launches sustainable materials<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Labels and Labeling<\/font>","source.href":"http:\/\/www.labelsandlabeling.com","source.title":"Labels and Labeling","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Lintec Europe has launched a labelstock material to improve the recyclability of PET bottles and direct thermal paper as an alternative to synthetic paper products, at Labelexpo Europe 2023. Lintec won the Global Label Award Innovation Award for companies with more than 300 employees for its new labelstock. The award was given on the first night of Labelexpo Europe. It was award for the development of a specific innovation by a supplier or converter company in 2022. The Label Awards judging panel said: 'Lintec impressed the judges with its new polyester-based adhesive, which will greatly assist in the development of a circular materials economy by assisting in the clean separation of PET container waste.' Lintec's MMP Mono Material Polyester (PET) is designed for application to polyester packaging such as single-use water bottles. The clear film features a strong yet removable adhesive. The film and adhesive are manufactured from polyester so if any labels are not removed before the washing and grinding process the risk of contamination is reduced. A special top coating also enables the labels to be de-inked in an alkaline washing process. Lintec’s new direct thermal paper offers superior moisture and water immersion resistance, improved rub resistance and is microwave oven compatible. The material has successfully replaced plastic-based labelstocks in the food, beverage and logistics sectors.","filter_flag":1}
{"title":"The Surfactant Market - Happi","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmhhcHBpLmNvbS90aGUtc3VyZmFjdGFudC1tYXJrZXQtOTM5NzUv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmhhcHBpLmNvbS90aGUtc3VyZmFjdGFudC1tYXJrZXQtOTM5NzUv0gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3LmhhcHBpLmNvbS90aGUtc3VyZmFjdGFudC1tYXJrZXQtOTM5NzUv0gEA","guidislink":false,"published":"Fri, 01 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=244, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmhhcHBpLmNvbS90aGUtc3VyZmFjdGFudC1tYXJrZXQtOTM5NzUv0gEA?oc=5\" target=\"_blank\">The Surfactant Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Surfactant Market - Happi","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmhhcHBpLmNvbS90aGUtc3VyZmFjdGFudC1tYXJrZXQtOTM5NzUv0gEA?oc=5\" target=\"_blank\">The Surfactant Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","source.href":"https:\/\/www.happi.com","source.title":"Happi","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Demand for surfactants may have slowed this year after a robust 2022, but interest in sustainable materials continues apace. That’s no surprise to Tony Gough, technical director of Innospec and the chairman of the CESIO World Surfactant Congress held earlier this year. “Sustainability and regulations are obviously among the key topical subjects in the surfactants industry currently and will probably remain so for many years to come,” said Gough. Forecasters agree. Global demand for surfactants in all industries is growing 4.9% a year and will reach $57.8 billion by 2028, according to ResearchandMarkets, Dublin. Nonionics are expected to be the fastest-growing surfactant type and, once again, the Asia-Pacific region will be the fastest-growing region. According to Jarrod A. Kaltenbach, VP-surfactants, Coast Southwest, surfactants, like other categories of ingredients, consumer preferences for “green,” mild, sustainable and “free-from” are pushing the market to new standards. Siltech has focused, during the past few years, on improving the sustainability of its silicones, by replacing organo-functional components traditionally derived from petroleum sources, with feedstocks sourced from biobased materials. “These new PEG-dimethicone surfactants and alkyl dimethicone emulsifiers have high biobased carbon content, while maintaining the desired premium benefits of specialty silicones,” noted Brian Allen, global marketing and sales director, Siltech. A Slowdown? Inflation Ebbs Capital Improvements New Product Developments New Ingredients from Industry Suppliers Here are new ingredients from industry suppliers. For more information, contact the supplier directly using the number provided. BASF Corporation Florham Park, NJ [email protected] www.hcii.basf.us\/ Polyquart S Description: Amphoteric modified starch granules Applications: Automatic dishwashing Use levels: 0.25-0.5% Attributes: Polyquart S Granules is a biobased (80%) automatic dish additive that tackles stubborn spotting and filming by offering a statistically significant boost in shine. This readily biodegradable and Safer Choice listed ingredient offers a sustainability story while still helping formulators achieve the clean twinkle in dishes that consumers expect to see. Euperlan Eco Description: Starch, polymer with styrene and methacrylic acid. Dispersion Applications: Manual dish, laundry Use levels: 1-2% Attributes: Approved for use in Safer Choice products, Euperlan Eco is the first moderately biodegradable opacifier for home care. 43% biobased, this modified starch polymer can help opacify with a more sustainable ingredient and provide consumers with a premium cleaning experience. Siltech Toronto, Canada [email protected] www.siltech.com Silwax Sustain 5116 INCI: Cetyl Dimethicone (alkylated silicone) Applications: softener in textiles, tissue paper; spreadability, enhanced oil compatability, emolliency & reduced white-cast in skin and sun care Use levels: 1.0-3.0% Attributes: Silwax Sustain 5116 is a liquid alkylated silicone. Silwax Sustain 5116 functions as a more sustainable version of the standard Silwax B116. Relative to the standard, or “non-Sustain” version, the alkyl component of Silwax Sustain 5116 is derived from biobased plant sources, rather than petroleum-based feedstocks. The total biobased carbon content for the product has been measured at >82%, per ASTM D6866. Alkyl pendant groups increase oil solubility and compatibility with organic systems. The product provides excellent spreadability, pleasing sensorial, gloss and emollience. Silube Sustain 4316 INCI: Cetyl PEG\/PPG-10\/1 Dimethicone (silicone alkyl polyether) Applications: Lubricity and anti-wear in industrial applications, emulsifier and wetting agent in personal care applications including skin & sun care and makeup Use levels: 1.0-5.0% Attributes: Silube Sustain 4316 is a water-insoluble alkyl functional silicone polyether emulsifier. Silube Sustain 4316 functions as a more sustainable version of the standard Silube T308-16-CG. Relative to the standard, or “non-Sustain” version, the polyether and alkyl components of Silube Sustain 4316 are derived from biobased plant sources, rather than petroleum-based feedstocks. The total biobased carbon content for the product has been measured at >73%, per ASTM D6866. The product is a cost-effective emulsifier, wetting agent and surface tension depressant across multiple applications. According to BASF executives, it is undeniable that surfactant demand has decreased in comparison to last year, which is largely attributed to the lackluster performance of the home care cleaning and personal care markets. This has had a direct effect on retail sales, with inflationary pressures and consumer cost cutting further exacerbating the situation. While the current landscape is concerning, BASF remains optimistic that the market will recover and is prepared to tackle this challenge.At Siltech , demand is lower than 2022, which was an exceptionally busy year, but is still above 2021 levels, according to Allen.“Supply chains appeared to react to tight market conditions in 2022, with companies ordering at higher-than-normal demand levels, seemingly in an effort to ensure consistent supply,” he said. “By the end of 2022 many of these companies appeared to be working through excess inventory, which has carried into 2023.”Other surfactant suppliers told Happi that while the year got off to a slower-than-usual start, as the year’s progressed, the pace accelerated.“Consumers want to look good. They want to pamper themselves with mild and sustainable options. The indie brands have been an influence,” Kaltenbach told Happi. “Brands that are good at targeting and optimizing beauty niches are doing better than ever—brands that take a little more risk and have multiple avenues to the customer, including boutique stores, departments within national chains, and of course online sales and marking with Instagram and TikTok.”Being quick to market is more important than ever with these brands.“We are responding by expanding our geographic presence,” Kaltenbach explained. “Out stocking levels, innovative surfactant systems for a wide range of personal care applications, and especially our ability to work directly with our customers on formulating and problem solving allows us to help brands speed up-to-market processes.”Brenntag’s HI&I surfactant demand has been steadily increasing in 2023 where other industries have soft demand, explained Jeff Carey, VP-HI&I Americas, Brenntag.“Overall continuity of supply has stabilized; however, there are still force majeures in effect on certain chemistries,” he noted.Suppliers note that after inflation surged in 2022, prices for most chemistries have declined—but there are other economic issues on the horizon.“One of the biggest concerns would be the threat of imports to the US, and the threat of supply stability,” said Carey. “As a consumer, the concern could be continued inflation as a fear of a recession setting in. We value our relationships in making sure our customers are competitive in the markets they choose to serve. Additionally, inflation has impacted all raw materials and demand erosion has occurred, but overall consumer spending has been steady. Imports continue to be a factor in certain chemistries and have created some market price decreases.”Siltech always attempts to mitigate rising costs through production efficiencies and optimization, said Allen. But he noted this is not always possible and the company had to adjust the pricing for some offerings in 2023, in order to ensure supply consistency for its partners.“Inflation increases have appeared to subside in many raw material categories and supply has eased in 2023, while other categories remain tight,” he told Happi. “There are no overriding concerns regarding the global economy as we head into 2024, but we continue to listen to market wants and adjust our portfolio of goods to match customer needs.”And what do customers seek? Coast Southwest reports hair care and skin care are driving the market for high-end products. Consumers are willing to spend money on products where they feel and see a difference—anti-wrinkle, smoothing, and improved suppleness, or evening of skin tone, according to Kaltenbach.Every executive who spoke with Happi noted they are constantly looking at ways to optimize the business and improve the customer experience. Brenntag, for example, has implemented an SLES surfactant dilution unit located in Toronto, Ontario.“At this facility, we take 70% active SLES and dilute it to 30% making it easier for customers to formulate,” said Carey. “We also have a surfactant down pack facility located in Houston.”Coast Southwest’s new corporate headquarters in Irving, TX, is set to open. This 105,660-square-foot facility will be the center point of its business operationally and signifies the success of Coast Southwest’s 38-year evolution from a regional chemical distributor with West Coast roots to a national chemical distribution powerhouse. According to Kaltenbach, the expansion of Coast Southwest’s local distribution, warehousing and manufacturing capabilities in Texas triples previous commitments. Over the past several years, Coast Southwest established its Midwest infrastructure and operations in Chicago and South Bend, IN. Most recently, Coast Southwest built a full team on the East Coast—from New Jersey to Florida—to serve customers across the US.Siltech recently broke ground in Fort Erie, Ontario, for its new greenfield site, which will be the location for the company’s third manufacturing facility. The investment doubles existing nameplate capacity, according to Allen.“The new plant will house equipment and capabilities aimed at further expanding our improved sustainability product lines,” he said.At its site in Cincinnati, OH, BASF is expanding its global alkyl polyglucosides (APGs) production capacity. This investment will expand BASF’s production capabilities in the US, enabling the company to provide increased support to North American APG’s customers with local supply points and reduced cross-regional volume flows. The additional capacities are anticipated to become available in 2025.Meanwhile, in Switzerland, BASF increased production capacity for Tinopal CBS optical brighteners at the Monthey site. After the completion of phase one of the stepwise capacity increase in 2021, the investment program has resulted in a significant boost of capacity to meet the increasing global customer demand, according to BASF.Finally, BASF successfully started up a new methane sulfonic acid plant at the Ludwigshafen Verbund site. The investment allows for additional sales volumes to be available by the third quarter of 2022. This new plant enables BASF to meet the growing global customer demand for both, high-performance and environmentally optimized formulations, according to company officials.As inflation and recession fears ebb, suppliers are making key surfactant investments for the future.The move to oleo- and biobased solutions is well underway in the surfactant market. According to Kaltenbach, Coast Southwest’s focus on versatility and performance helps customers get to market faster with surfactant solutions that address new or existing regulatory requirements and market demands for more sustainable solutions.“We offer surfactant systems that are sulfate-free and extremely mild options for personal care formulations,” said Kaltenbach.One of them is Endinol Mild B-SF70A (Sodium Cocoyl Isethionate (and) Cocamidopropyl Hydroxysultaine (and) Disodium Cocoyl Glutamate (and) Lauryl Glucoside (and) Cocamidopropylamine Oxide (and) Caprylyl\/Capryl Glucoside).“Endinol Mild B-SF70A can be easily diluted into natural formulations to achieve exceptional foaming and feel,” said Kaltenbach. “We have pre-optimized this ingredient, so it is cold-processable and easy to handle.”The isethionate-based, sulfate-free surfactant package is based on vegetable-derived, mild and gentle surfactants. The inclusion of an amino acid surfactant gives it exceptional skin compatibility. This ingredient contains no Proposition 65 ingredients of concern, no cocamidopropyl betaine, no alkyl and alkyl ether sulfates, nor sulfonates or DEA.“Our customers use Endinol Mild B-SF70A to create gentle cleansing products—facial wash, body wash, sensitive skin cleansers, and foaming hand soaps,” explained Kaltenbach. “It is especially suitable for frequent-use hand soaps in medical environments where people wash their hands several times and hour.”Endinol Mild SCI-85 (sodium cocoyl isethionate) is a high active, vegetable-derived, sulfate-free anionic surfactant that is an ideal base for creating sulfate-free cleansing products. It creates a rich, creamy, stable lather and imparts a soft, clean skin feel. In application, it imparts a soap-like feel and lather but unlike soap is hard-water compatible and mild.Finally, Endicare SD is a high-active cationic conditioning agent and emulsifier which can be diluted with water and neutralized with citric or lactic acids to create rich, creamy conditioners. This ingredient comes in flakes, is easier to handle logistically and in formulations for conditioners and hair masques. It can simplify the formulation of conditioners and helps in both wet comb and dry comb hair care applications.Siltech has focused, during the past few years, on improving the sustainability of its silicones, through replacing organo-functional components traditionally derived from petroleum sources, with feedstocks sourced from biobased materials.These new PEG-dimethicone surfactants and alkyl dimethicone emulsifiers have high biobased carbon content, while maintaining the desired premium benefits of specialty silicones.BASF has two new materials for home care formulations. Polyquart S Granules is a biobased (80%) automatic dish additive that tackles stubborn spotting and filming by offering a statistically significant boost in shine. This readily biodegradable and EPA Safer Choice-listed ingredient offers a sustainability story while still helping achieve the “clean twinkle” in dishes consumers expect to see, according to BASF.Also approved for use in Safer Choice products, Euperlan Eco is the first moderately biodegradable opacifier for home care, according to BASF. This modified starch polymer is 43% biobased, and helps formulators opacify with a more sustainable ingredient, while providing consumers with a premium cleaning experience.As a chemical distributor, Brenntag’s partners are continuously introducing new products.“Trends we are seeing in our surfactant portfolio include bio-based, naturally-derived, and regulatory driven, such as low 1,4-dioxane,” explained Carey. “We have also noticed a shift from nonylphenol ethoxylates to more environmentally-friendly chemistries.”Sustainable solutions can be found in the strangest of places. At the CESIO World Surfactant Congress in June, Renke Rommerskirchen of Sasol Chemicals detailed the benefits of using organic waste digested by insects as new feedstocks for sustainable products. Specifically, the black soldier fly creates an oil that is rich in C12-14 lauric acid. According to Rommerskirchen, this insect doesn’t need much space and produces a high yield—30 times that of coconut.“Insects generate high-value feedstocks from low value waste streams,” he explained. “The oil is already used in livestock feed and biofuel.”Furthermore, the insect oil has a very negative carbon footprint; experts estimate it is lower than coconut oil. The profile is good, but will consumers accept bug-based household cleaners? Rommerskirchen cited 2019 consumer research that found 86% of Belgians were willing to test household cleaning products with insect-based materials.Maybe, but a CESIO attendee noted that in Henkel’s research, only 50% of consumers were willing to use insect-based formulas.“There may be issues with the vegan community,” he noted. “We must better communicate the benefits to consumers and publish findings in scientific literature.”Yes, there are obstacles to overcome; but bug-based surfactants could be viable, sustainable solutions. More than 2,100 species of insects are already consumed by people. If two billion consumers around the world are putting bugs on their plate, surely they’d be willing to wash their plates with insect-based formulas!","filter_flag":1}
{"title":"New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material - indianautosblog.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5","id":"CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA","guidislink":false,"published":"Thu, 21 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5\" target=\"_blank\">New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">indianautosblog.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material - indianautosblog.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibGh0dHBzOi8vaW5kaWFuYXV0b3NibG9nLmNvbS9uZXctcGlyZWxsaS1sb2dvLXRvLWlkZW50aWZ5LXR5cmVzLXdpdGgtYXQtbGVhc3QtNTAtc3VzdGFpbmFibGUtbWF0ZXJpYWwtcDMyNjIxNtIBcmh0dHBzOi8vbS5pbmRpYW5hdXRvc2Jsb2cuY29tL25ldy1waXJlbGxpLWxvZ28tdG8taWRlbnRpZnktdHlyZXMtd2l0aC1hdC1sZWFzdC01MC1zdXN0YWluYWJsZS1tYXRlcmlhbC1wMzI2MjE2L2FtcA?oc=5\" target=\"_blank\">New Pirelli Logo To Identify Tyres With At Least 50% Sustainable Material<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">indianautosblog.com<\/font>","source.href":"https:\/\/indianautosblog.com","source.title":"indianautosblog.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Pirelli has created a bespoke logo to identify tyres that contain at least 50% materials of bio-based and recycled origin. The new marking – which depicts two arrows in a circle and will be adopted on new products – underlines Pirelli’s commitment to the environment, maintaining the high level of safety performance inherent in every single tyre produced by the Italian firm. This new logo is also designed as a clear indication for customers, allowing them to choose more sustainable tyres. The latest Pirelli marking was used for the first time on the P Zero E. This tyre contains more than 55% of materials of bio-based and recycled origin* throughout the entire range at launch, as certified by Bureau Veritas: a world leader in verifying conformity and certification in quality, environment, health, safety, and social responsibility standards (ISO14021). Third-party verification of eco-compatible materials will continue to be standard across all future products that adopt the new logo. Pirelli’s path towards reduced environmental impact includes the ever-increasing use of sustainable materials. Pirelli’s initial objective, originally set for 2025, has already been achieved two years early thanks to P Zero E. The next step, set for selected product lines by 2030, envisages the use of at least 60% of materials of bio-based origin and 12% recycled, with less than 30% of fossil-derived ingredients. Pirelli aims to regularly improve these targets thanks to the technological innovation of all the different departments involved in tyre development. These innovations have set in motion a virtuous path both at quantitative level – thanks to increasingly higher percentages of sustainable materials – and qualitative level, through the certification of supply chains to internationally accredited standards. In 2021, for example, Pirelli was first to produce an FSC (Forest Stewardship Council) certified tyre that uses natural rubber and FSC rayon. As a result, customers had the guarantee that all materials sourced from forests came from plantations that promote biological diversity, while bringing economic sustainability to the lives of local communities and workers.","filter_flag":1}
{"title":"New Honda Motocompacto e-Scooter Redefines Personal Urban Mobility as Sleek, Simple and Uniquely Foldable - Honda Newsroom","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvZWxlY3RyaWZpY2F0aW9uL3JlbGVhc2VzL25ldy1ob25kYS1tb3RvY29tcGFjdG8tZS1zY29vdGVyLXJlZGVmaW5lcy1wZXJzb25hbC11cmJhbi1tb2JpbGl0eS1hcy1zbGVlay1zaW1wbGUtYW5kLXVuaXF1ZWx5LWZvbGRhYmxl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvZWxlY3RyaWZpY2F0aW9uL3JlbGVhc2VzL25ldy1ob25kYS1tb3RvY29tcGFjdG8tZS1zY29vdGVyLXJlZGVmaW5lcy1wZXJzb25hbC11cmJhbi1tb2JpbGl0eS1hcy1zbGVlay1zaW1wbGUtYW5kLXVuaXF1ZWx5LWZvbGRhYmxl0gEA?oc=5","id":"CBMinQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvZWxlY3RyaWZpY2F0aW9uL3JlbGVhc2VzL25ldy1ob25kYS1tb3RvY29tcGFjdG8tZS1zY29vdGVyLXJlZGVmaW5lcy1wZXJzb25hbC11cmJhbi1tb2JpbGl0eS1hcy1zbGVlay1zaW1wbGUtYW5kLXVuaXF1ZWx5LWZvbGRhYmxl0gEA","guidislink":false,"published":"Thu, 14 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=257, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvZWxlY3RyaWZpY2F0aW9uL3JlbGVhc2VzL25ldy1ob25kYS1tb3RvY29tcGFjdG8tZS1zY29vdGVyLXJlZGVmaW5lcy1wZXJzb25hbC11cmJhbi1tb2JpbGl0eS1hcy1zbGVlay1zaW1wbGUtYW5kLXVuaXF1ZWx5LWZvbGRhYmxl0gEA?oc=5\" target=\"_blank\">New Honda Motocompacto e-Scooter Redefines Personal Urban Mobility as Sleek, Simple and Uniquely Foldable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Honda Motocompacto e-Scooter Redefines Personal Urban Mobility as Sleek, Simple and Uniquely Foldable - Honda Newsroom","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinQFodHRwczovL2hvbmRhbmV3cy5jb20vZW4tVVMvZWxlY3RyaWZpY2F0aW9uL3JlbGVhc2VzL25ldy1ob25kYS1tb3RvY29tcGFjdG8tZS1zY29vdGVyLXJlZGVmaW5lcy1wZXJzb25hbC11cmJhbi1tb2JpbGl0eS1hcy1zbGVlay1zaW1wbGUtYW5kLXVuaXF1ZWx5LWZvbGRhYmxl0gEA?oc=5\" target=\"_blank\">New Honda Motocompacto e-Scooter Redefines Personal Urban Mobility as Sleek, Simple and Uniquely Foldable<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Honda Newsroom<\/font>","source.href":"https:\/\/hondanews.com","source.title":"Honda Newsroom","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Motocompacto is a modern, all-electric take on early '80s Honda Motocompo Fun-to-ride \"first and last mile\" solution designed for the new realities of urban mobility with zero-emissions range up to 12 miles Ultra-compact design becomes its own lightweight, compact and stackable carrying case Charges in just 3.5 hours with on-board charger Priced under $1,000, Motocompacto is available for purchase starting in November through Motocompacto.honda.com or Honda and Acura dealers A fresh take on e-scooters that was inspired by the Honda Motocompo of the early '80s, the all-new Honda Motocompacto redefines affordable all-electric personal transportation with sleek and simple styling and an innovative, ultra-compact foldable design. Sales will begin exclusively at Motocompacto.honda.com, and at Honda and Acura automobile dealers in November with an MSRP of just $995. The zero-emissions Motocompacto is designed for the modern realities of urban mobility, providing riders with an easy and fun-to-ride alternative transport that greatly reduces their carbon footprint while offering great convenience. With a maximum speed of 15 mph and zero-emissions range of up to 12 miles, Motocompacto can be fully charged in just 3.5 hours in both the folded and ready-to-ride configuration using a common 110 v outlet. \"Motocompacto is uniquely Honda – a fun, innovative and unexpected facet of our larger electrification strategy,\" said Jane Nakagawa, vice president of the R&D Business Unit at American Honda Motor Co., Inc. \"Sold in conjunction with our new all-electric SUVs, Motocompacto supports our goal of carbon neutrality by helping customers with end-to-end zero-emissions transport.\" Motocompacto was designed and developed by Honda engineers in Ohio and California as an innovative approach to personal electric transportation that has earned 32 patents. Uniquely foldable, Motocompacto quickly transforms into its own compact, light and stackable carrying case that's easy to take along in a vehicle, on public transportation or store in tight places. Motocompacto is perfect for getting around cityscapes and college campuses. It was designed with rider comfort and convenience in mind with a cushy seat, secure grip foot pegs, on-board storage, a digital speedometer, a charge gauge and a comfortable carry handle. A clever phone app enables riders to adjust their personal settings, including lighting and ride modes, via Bluetooth®. \"Motocompacto is easy to use and fun to ride, but was also designed with safety, durability, and security in mind,\" said Nick Ziraldo, project lead and design engineering unit leader at Honda Development and Manufacturing of America. \"It uses a robust heat-treated aluminum frame and wheels, bright LED headlight and taillight, side reflectors, and a welded steel lock loop on the kickstand that is compatible with most bike locks.\" Charging is quick and convenient with a standard compact charger that can be stowed on-board. Motocompacto is designed to be personalized with sleek and simple styling that's perfect for decals, stickers, skins and more. To enhance the joy of ownership, a fun and functional line of branded Motocompacto accessories will be available, including a helmet, backpack, apparel and more. More information about Motocompacto can be found at Motocompacto.honda.com. Key Specifications and Features ENGINEERING Motor Type Permanent magnet, direct drive Peak Output 490W Torque 11.8 lb.-ft.\/16 Nm Drive Front-wheel drive Max Speed 15 mph Battery Capacity 6.8Ah Charge Time 3.5 hours (110v) Range Up to 12 miles DIMENSIONS AND CAPACITIES Wheelbase 29.2 inches Length (ready-to-ride \/ folded) 38.1 inches \/ 29.2 inches Height (ready-to-ride \/ folded) 35.0 inches \/ 21.1 inches Width (ready-to-ride \/ folded) 17.2 inches \/ 3.7 inches Seat Height 24.5 inches Weight 41.3 lbs. About Honda's Commitment to the Environment Honda is working toward its global goal of zero environmental impact by 2050 through its \"Triple Action to Zero\" approach, including achieving carbon neutrality for all products and corporate activities, 100% utilization of renewable energy, and resource circulation, utilizing 100% sustainable materials by reprocessing products back to raw materials and reusing those materials in the creation of new products. Toward this goal, Honda will strive to make battery-electric and fuel cell electric vehicles represent 100% of auto sales in the U.S. and globally by 2040. To reduce the environmental impact of its business operations, Honda also is offsetting CO2 emissions from its North American manufacturing operations through long-term virtual power purchase agreements (VPPAs) for renewable wind and solar power that seek to cover more than 60% of the electricity Honda uses in North America. Honda also promotes environmentally responsible business practices with its suppliers and retail dealer partners across North America. More information about Honda is available in the Digital FactBook. # # #","filter_flag":1}
{"title":"Pernod Ricard GTR returns to TFWA Cannes as new chapter unfolds - Global Travel Retail Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lmd0cm1hZy5jb20vYnVzaW5lc3MtbmV3cy9pbmR1c3RyeS1uZXdzLzIwMjMvMDkvMjUvcGVybm9kLXJpY2FyZC1ndHItcmV0dXJucy10by10ZndhLWNhbm5lcy1hcy1uZXctY2hhcHRlci11bmZvbGRzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lmd0cm1hZy5jb20vYnVzaW5lc3MtbmV3cy9pbmR1c3RyeS1uZXdzLzIwMjMvMDkvMjUvcGVybm9kLXJpY2FyZC1ndHItcmV0dXJucy10by10ZndhLWNhbm5lcy1hcy1uZXctY2hhcHRlci11bmZvbGRzL9IBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3Lmd0cm1hZy5jb20vYnVzaW5lc3MtbmV3cy9pbmR1c3RyeS1uZXdzLzIwMjMvMDkvMjUvcGVybm9kLXJpY2FyZC1ndHItcmV0dXJucy10by10ZndhLWNhbm5lcy1hcy1uZXctY2hhcHRlci11bmZvbGRzL9IBAA","guidislink":false,"published":"Mon, 25 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=268, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lmd0cm1hZy5jb20vYnVzaW5lc3MtbmV3cy9pbmR1c3RyeS1uZXdzLzIwMjMvMDkvMjUvcGVybm9kLXJpY2FyZC1ndHItcmV0dXJucy10by10ZndhLWNhbm5lcy1hcy1uZXctY2hhcHRlci11bmZvbGRzL9IBAA?oc=5\" target=\"_blank\">Pernod Ricard GTR returns to TFWA Cannes as new chapter unfolds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Travel Retail Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pernod Ricard GTR returns to TFWA Cannes as new chapter unfolds - Global Travel Retail Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lmd0cm1hZy5jb20vYnVzaW5lc3MtbmV3cy9pbmR1c3RyeS1uZXdzLzIwMjMvMDkvMjUvcGVybm9kLXJpY2FyZC1ndHItcmV0dXJucy10by10ZndhLWNhbm5lcy1hcy1uZXctY2hhcHRlci11bmZvbGRzL9IBAA?oc=5\" target=\"_blank\">Pernod Ricard GTR returns to TFWA Cannes as new chapter unfolds<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Travel Retail Magazine<\/font>","source.href":"https:\/\/www.gtrmag.com","source.title":"Global Travel Retail Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Pernod Ricard GTR returns to TFWA Cannes as new chapter unfolds New products from Royal Salute, Ballantine’s, The Malts portfolio, Martell, Absolut and Chivas and other brands will be shared Pernod Ricard Global Travel Retail (GTR) is returning to the TFWA World Exhibition & Conference in Cannes this October, galvanized by a double-digit sales uplift of 40% in FY23. This uplift coincides with a new chapter for Pernod Ricard GTR, as outgoing Chairman & CEO Mohit Lal retires after over 23 years, handing the reins to new Chairman & CEO, Laurent Pillet. Innovation: critical to growth Connecting with key customers and partners, Lal and Pillet will both attend this year’s TFWA World Exhibition, where the company will showcase its latest innovation from global and emerging brands. New products from Royal Salute, Ballantine’s, The Malts portfolio, Martell, Absolut and Chivas and other brands will be shared, including an exciting new global travel retail exclusive limited edition to be revealed during the week. With 56 new products launching in the next 12 months, including 19 TR exclusives, PR GTR is confident of generating sustainable value growth in FY24. Coupled with strong ambitions to drive growth in the ultra-prestige category, the company will demonstrate how it is catering to evolving consumer demands through exclusive products, cutting-edge retail design and its sophisticated training tools. Fully Sustainable Booth makes reappearance for 2023 PR GTR continues to accelerate its ambitions in circular making and sustainable retail design, informed by its award-winning Lifecycle Analysis (LCA) tool first launched in 2021. In 2023, Pernod Ricard has continued to showcase best-practice examples of zero-waste exhibition booths and retail activations. The TFWA Cannes Exhibition Booth was designed with circularity in mind, built to adapt and last with zero waste to landfill or incineration and using innovative sustainable materials. It is a continuation of PRGTR’s S&R Circular Making strategy which is implemented across 100% of retail projects. Since the launch of this strategy in 2021, PRGTR has delivered a 48% CO2 reduction and tracked over 700 LCA reports across two fiscal years. Finding the right blend of science and creativity Finally, following the success of the ‘Good Spirits’ sustainability-focused event for media in 2022, the company is excited to host journalists again this year, for a thought-provoking panel discussion on the role of behavioral science vs creativity regarding consumer engagement in retail. “With passenger numbers at roughly 90% of pre-COVID levels and continued recovery in Asia, we were delighted with such a strong performance notably on Scotch, Martell and Absolut in FY23,\" said Lal. \"Continuing momentum into FY24, we’re thrilled to return to TFWA Cannes, as the event itself regains its strength in numbers of exhibitors and visitors. The TFWA World Exhibition & Conference remains an invaluable opportunity for us to connect with key customers and partners and for me, a chance to say farewell to business partners as well as personal friends with whom I cherish so many fond memories.” Pillet added, “I am greatly looking forward to attending the TFWA World Exhibition in Cannes for the first time. I believe that the event presents the perfect opportunity for the business to engage with all industry stakeholders and share key insights that support the consumer journey. I am keen to demonstrate how we put travelers at the heart of everything we do, in collaboration with our partners, which is crucial to our continued success.\"","filter_flag":1}
{"title":"Autoliv and Great Wall Motor collaborate on advanced safety technologies - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2F1dG9saXYtYW5kLWdyZWF0LXdhbGwtbW90b3ItY29sbGFib3JhdGUtb24tYWR2YW5jZWQtc2FmZXR5LXRlY2hub2xvZ2llcy0xMTY5MDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzLWludGVybmF0aW9uYWwvYXV0b2xpdi1hbmQtZ3JlYXQtd2FsbC1tb3Rvci1jb2xsYWJvcmF0ZS1vbi1hZHZhbmNlZC1zYWZldHktdGVjaG5vbG9naWVzLTExNjkwMD9hbXA9MQ?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2F1dG9saXYtYW5kLWdyZWF0LXdhbGwtbW90b3ItY29sbGFib3JhdGUtb24tYWR2YW5jZWQtc2FmZXR5LXRlY2hub2xvZ2llcy0xMTY5MDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzLWludGVybmF0aW9uYWwvYXV0b2xpdi1hbmQtZ3JlYXQtd2FsbC1tb3Rvci1jb2xsYWJvcmF0ZS1vbi1hZHZhbmNlZC1zYWZldHktdGVjaG5vbG9naWVzLTExNjkwMD9hbXA9MQ?oc=5","id":"CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2F1dG9saXYtYW5kLWdyZWF0LXdhbGwtbW90b3ItY29sbGFib3JhdGUtb24tYWR2YW5jZWQtc2FmZXR5LXRlY2hub2xvZ2llcy0xMTY5MDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzLWludGVybmF0aW9uYWwvYXV0b2xpdi1hbmQtZ3JlYXQtd2FsbC1tb3Rvci1jb2xsYWJvcmF0ZS1vbi1hZHZhbmNlZC1zYWZldHktdGVjaG5vbG9naWVzLTExNjkwMD9hbXA9MQ","guidislink":false,"published":"Fri, 22 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=265, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2F1dG9saXYtYW5kLWdyZWF0LXdhbGwtbW90b3ItY29sbGFib3JhdGUtb24tYWR2YW5jZWQtc2FmZXR5LXRlY2hub2xvZ2llcy0xMTY5MDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzLWludGVybmF0aW9uYWwvYXV0b2xpdi1hbmQtZ3JlYXQtd2FsbC1tb3Rvci1jb2xsYWJvcmF0ZS1vbi1hZHZhbmNlZC1zYWZldHktdGVjaG5vbG9naWVzLTExNjkwMD9hbXA9MQ?oc=5\" target=\"_blank\">Autoliv and Great Wall Motor collaborate on advanced safety technologies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Autoliv and Great Wall Motor collaborate on advanced safety technologies - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2F1dG9saXYtYW5kLWdyZWF0LXdhbGwtbW90b3ItY29sbGFib3JhdGUtb24tYWR2YW5jZWQtc2FmZXR5LXRlY2hub2xvZ2llcy0xMTY5MDDSAYIBaHR0cHM6Ly93d3cuYXV0b2NhcnByby5pbi9uZXdzLWludGVybmF0aW9uYWwvYXV0b2xpdi1hbmQtZ3JlYXQtd2FsbC1tb3Rvci1jb2xsYWJvcmF0ZS1vbi1hZHZhbmNlZC1zYWZldHktdGVjaG5vbG9naWVzLTExNjkwMD9hbXA9MQ?oc=5\" target=\"_blank\">Autoliv and Great Wall Motor collaborate on advanced safety technologies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Materials\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Safety systems major and leading Chinese automaker to collaborate on overhead passenger airbag, zero-gravity seat for autonomous vehicles and also low-carbon solutions. Autoliv China, a division of Autoliv Inc, the worldwide leader in automotive safety systems, and Great Wall Motor (GVM), a leading vehicle manufacturer based in China, intend to collaborate to address opportunities and challenges in the rapidly evolving global automotive landscape. GWM produces and sells vehicles under its own branding, such as Great Wall, Haval, WEY, TANK, and POER. It also produces dedicated electric vehicles under the brand name ORA. Autoliv has worked with GWM since 2003, when Autoliv developed and began supplying seat belts for Haval SUVs. The strategic cooperation aims to drive innovation through collaboration around advanced technologies with a focus on quality. The collaboration is expected to result in advancements that will redefine the driving experience, such as an overhead passenger airbag that deploys from the ceiling of the car, freeing up space in its interior. The collaboration also includes an integrated safety system solution – the zero-gravity seat – for autonomous vehicles. The Autoliv zero-gravity seat features airbags and an integrated seatbelt for optimal safety. As the seat reclines, the safety system adjusts to the needs of different drivers and passengers, adapting to their weight, height, and gender. Autoliv's integrated cockpit includes a foldable steering wheel that retracts into the dashboard as the car drives itself, a heated seatbelt for increased convenience and energy efficiency, and an illuminated seatbelt buckle that makes it easier to buckle up when dark. With a shared commitment to sustainability, Autoliv China and GWM are dedicated to creating low-carbon solutions. The collaboration includes the development of several new products with sustainable materials, such as using bio-PET as the basic fabric for airbag cushions, and bio-leather wrapping on steering wheels. \"This strategic collaboration marks an important milestone in Autoliv's and GWM's joint goal of redefining how people experience transportation. We also share a commitment to safety with an emphasis on quality, innovation, and sustainability. Autoliv China will work closely with the GWM team, pooling Autoliv's knowledge and strengths into our cooperation, enhancing both the safety and overall driving experience for global users,\" said Mikael Bratt, President, and CEO of Autoliv, Inc. \"GWM and Autoliv have cooperated for more than 20 years, and I believe that today is the beginning of a new journey. We will have in-depth cooperation in innovative technology, platformisation and commonisation that will provide more diversified solutions for future mobility,\" said Jack Wei, founder and chairman of GWM. ALSO READ: Autoliv and Geely to develop advanced safety tech for future vehicles Autoliv to set up airbag cushion plant in Vietnam","filter_flag":1}
