{"title":"5 Ways to Improve the Sustainability of Electronics - Electronic Design","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5lbGVjdHJvbmljZGVzaWduLmNvbS90ZWNobm9sb2dpZXMvZW1iZWRkZWQvYXJ0aWNsZS8yMTI3OTMxMC92dHQtdGVjaG5pY2FsLXJlc2VhcmNoLWNlbnRyZS1vZi1maW5sYW5kLTUtd2F5cy10by1pbXByb3ZlLXRoZS1zdXN0YWluYWJpbGl0eS1vZi1lbGVjdHJvbmljc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5lbGVjdHJvbmljZGVzaWduLmNvbS90ZWNobm9sb2dpZXMvZW1iZWRkZWQvYXJ0aWNsZS8yMTI3OTMxMC92dHQtdGVjaG5pY2FsLXJlc2VhcmNoLWNlbnRyZS1vZi1maW5sYW5kLTUtd2F5cy10by1pbXByb3ZlLXRoZS1zdXN0YWluYWJpbGl0eS1vZi1lbGVjdHJvbmljc9IBAA?oc=5","id":"CBMipAFodHRwczovL3d3dy5lbGVjdHJvbmljZGVzaWduLmNvbS90ZWNobm9sb2dpZXMvZW1iZWRkZWQvYXJ0aWNsZS8yMTI3OTMxMC92dHQtdGVjaG5pY2FsLXJlc2VhcmNoLWNlbnRyZS1vZi1maW5sYW5kLTUtd2F5cy10by1pbXByb3ZlLXRoZS1zdXN0YWluYWJpbGl0eS1vZi1lbGVjdHJvbmljc9IBAA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5lbGVjdHJvbmljZGVzaWduLmNvbS90ZWNobm9sb2dpZXMvZW1iZWRkZWQvYXJ0aWNsZS8yMTI3OTMxMC92dHQtdGVjaG5pY2FsLXJlc2VhcmNoLWNlbnRyZS1vZi1maW5sYW5kLTUtd2F5cy10by1pbXByb3ZlLXRoZS1zdXN0YWluYWJpbGl0eS1vZi1lbGVjdHJvbmljc9IBAA?oc=5\" target=\"_blank\">5 Ways to Improve the Sustainability of Electronics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Electronic Design <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"5 Ways to Improve the Sustainability of Electronics - Electronic Design","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipAFodHRwczovL3d3dy5lbGVjdHJvbmljZGVzaWduLmNvbS90ZWNobm9sb2dpZXMvZW1iZWRkZWQvYXJ0aWNsZS8yMTI3OTMxMC92dHQtdGVjaG5pY2FsLXJlc2VhcmNoLWNlbnRyZS1vZi1maW5sYW5kLTUtd2F5cy10by1pbXByb3ZlLXRoZS1zdXN0YWluYWJpbGl0eS1vZi1lbGVjdHJvbmljc9IBAA?oc=5\" target=\"_blank\">5 Ways to Improve the Sustainability of Electronics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Electronic Design <\/font>","source.href":"https:\/\/www.electronicdesign.com","source.title":"Electronic Design","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Members can download this article in PDF format. What you’ll learn: Why the electronics industry faces pressure to create more sustainable products. What steps can be taken to create more sustainable flexible electronics in the future. By 2030, global electronic waste will reach 74 million metric tons, with only 20% collected or recycled properly (Forti et al 2020). Today, the electronics industry faces major challenges with availability of critical materials and increasing pressure to cut its environmental footprint and move toward circularity. In March 2022, the European Commission published its Sustainable Products Initiative, which aims to ensure that all products placed on the EU market become more sustainable. The European Commission also adopted the new circular economy action plan (CEAP) in March 2020. It’s one of the main building blocks of the European Green Deal, Europe’s new agenda for sustainable growth. The EU’s transition to a circular economy aims to reduce pressure on natural resources and create sustainable growth and jobs. Because these initiatives ultimately cover and include the electronics industry, manufacturers are met with increasing pressure to meet new sustainability requirements in the years to come. That’s easier said than done—the major looming question is how to actualize these goals. Electronic waste is piling up, and numerous factors exacerbate the problem. Electronic waste is notoriously difficult to recycle because many tiny working parts and multitudes of different materials make it a challenge to separate. Product turnover and demand for new gadgets accelerates every year, so people replace their old phones and gadgets at unprecedented rates. In addition, mandatory device registration makes it difficult to pass used devices on to a second-hand life. As a result, many products wind up in landfills or office drawers well before their time. Due to rapid production rates and high demand, it’s also increasingly difficult to access the necessary raw materials to build new products, and the list goes on. The fact that these problems exist is widely discussed, but how can the industry realistically tackle a problem with so many nuanced angles? In January 2019, we established the ECOtronics project at VTT Technical Research Centre of Finland in collaboration with national universities and industry partners, and we set out to find concrete answers to the challenges at hand. Over the course of the next two years, we conducted experiments and trials to determine how electronics can have a more sustainable future. The work continues in the KDT JU Sustronics project, an EU-wide three-year initiative with 46 partners that started in June 2023. Known as the country that pioneered and popularized personal mobile phones in the 1990s, Finland is a considerable technology development hub that has made its mark on the world. Coupled with a strong nature connection, sustainability-minded thinking and innovation is widespread in Finland. It’s with this backdrop that VTT has set out to tackle the e-waste issue. We began with the goal of setting a new standard for sustainability in the electronics industry and answering one key question: How can we increase circularity and sustainability at every stage of the electronics lifecycle? The ECOtronics project ultimately found that the industry needs to improve upon five main areas to achieve more sustainability in flexible electronics. These include designing for circularity, using more sustainable raw materials, creating more efficient manufacturing techniques, and designing for sustainability for both the use and end-of-life phases. Our focus in the project was to study these aspects in connection with flexible electronic products. 1. Design with circularity in mind On average, the global consumption of electrical and electronics products increases by 2.5 million metric tons of total weight each year (Forti et al., 2020). Electronic products need to be designed so that the aforementioned EU environmental targets are incorporated at every phase of their lifecycle. This means designing with sustainability in mind from the ground up, and for each component. Holistic and streamlined sustainability assessment should support the design phase to achieve those goals. One major blockage to circular design is planned obsolescence, which has become a major obstacle in the circularity and lifespan of electronics (Elia et al., 2017; Guiltinan, 2009). Products are thrown away and replaced unnecessarily quickly because they’re designed to stop working early. That said, rethinking business models is increasingly important in the transition to a circular economy. Currently, many business models are product-based, but to shift into a more sustainable electronics industry, we need to see the focus change from products to service-based models (Bocken et al., 2019). One of the major challenges to recycling current electronics is that they’re often composed of various components and materials in small quantities. Components consisting of monomaterials are ideal for any recycling and recovery process. We found that new products could be designed in a modular way so that they can effectively be separated for reuse or for remanufacturing. This potentially lengthens the lifecycle of components and materials, but it can also help to alleviate raw material shortages by enabling access to secondary raw materials. However, process development for more efficient material recycling and recovery is needed as well. One example is the modular and biodegradable ECG patch, which we pioneered at VTT. Today, disposable single-use ECG sensor patches consist of skin-adhesive electrodes and embedded electronics, and they’re based in plastic materials. The new nanocellulose ECG patch that we developed is made of a recyclable and biodegradable nanocellulose plastic alternative while the electronics are detachable. Therefore, they can easily be peeled off for reuse. The objectives of ecodesign and circular design need to include energy efficiency, material efficiency, longer product lifecycles, upgradability, and the ease of recycling the materials. 2. Sustainable choices of raw materials With global consumption of material resources expected to roughly double between 2017 and 2060 according to the OECD, the electronics industry needs to start using more and more raw materials that are based on renewable natural resources, such as replacement of fossil-based composite and plastic substrates with cellulose or bio-polymer based materials. Assembling electronics inherently consumes energy, and if the raw materials are ultimately wasted, then the consumption goes up. One solution focuses on circular targets. This means using secondary raw materials instead of primary raw materials. Secondary materials have been used before and are recovered from waste and recycling. An ultimate goal for the industry is that almost all electronic materials come from secondary sources. Keeping electronics modular also means that the parts with limited lifespans are easy to replace or dispose of. As an example, in the ECOtronics project, VTT and collaborators investigated the replacement of commonly used plastics with bioplastics and successfully realized a smart label based on bioplastics and printed organic photovoltaic cells for energy harvesting and printed supercapacitors for energy storage. Use of new energy harvesting solutions improves energy efficiency of electronic products, and ultimately makes them energy autonomous. In addition to substrate materials, metals are used in electrical leads, soldering materials, and components. For example, silver is a great material for electrical leads and is commonly used for printed electronics, but it has a high environmental impact. Silver is also becoming a scarce material and is scattered throughout the earth, so it requires many resources to be located and mined. In some cases, silver can be replaced with more abundant and less valuable alternatives, such as copper or carbon-based materials. Silver dominates the environmental impact of any printed device, and the global warming potential decreases significantly, up to approximately 80%, by replacing it with copper—and even more so with carbon, as reported by LUT University and VTT (Nassajfar, 2023). However, their conductive properties aren’t as good as silver and must be compensated through design. Other examples of potential bio replacement materials could include cellulose and even silk. Cellulose can be used to make paper, which is superior to other deformable passive materials due to its low price, flexibility, and roll-to-roll (R2R) fabrication capability at a fast process speed of about 25 m·s-1 (Fuentes, 2021). In addition, silk-derived carbon materials have good conductivity and can be easily formed into different structures and shapes. This natural material has a long history that’s been applied in the dielectric layer and as an electronic device substrate (Barras, 2017). 3. Energy-efficient and material-efficient manufacturing techniques One of our most significant findings showed that environmental impact could be reduced by 86% when additive printing methods are used to create flexible electronic components, as reported in detail by the Finnish LUT University. Many traditional technologies used in the manufacture of electronics are based on subtractive processes. However, printing and other additive and roll-to-roll compatible technologies significantly reduce material waste and energy use during the manufacturing process. Changing the substrate utilized in printed electronics has a drastic effect on a product’s sustainability. Traditionally, metal electronics parts are etched out of copper sheets in a process called PCB etching. The process removes unwanted copper from a printed circuit board; therefore, only the required circuit remains while the rest of the sheet isn’t used. The team found that flexible metal electronics parts can instead be printed onto bio-based substrates, like paper or bio-plastic film. The process requires less energy and avoids the use of harmful chemicals while drastically reducing material waste and increasing the use of renewable materials. We found that this change in the manufacturing process is the single largest factor in potentially reducing the climate impact of flexible electronics. 4. Sustainability for the use phase We also found new solutions to make electronic products more sustainable during the use phase. For example, the energy consumption of products can be decreased by creating more low-cost and low-weight devices, as well as new technology enabled by thin and flexible bio-based materials combined with additive manufacturing. Extending product life expectancy and increasing durability also contributes to sustainability. Furthermore, energy-harvesting capabilities, such as using organic photovoltaics (OPV), offer new opportunities for energy autonomous devices. Efficiency benefits can be achieved by applying new manufacturing technologies, such as additive manufacturing and roll-to-roll printing, to produce affordable and intelligent devices. In one example, the weight of a car was reduced when using flat printed cables, thus contributing to lower emissions during the car’s lifetime (Hakola, 2022). Another example is a smart label that’s printed on bio-based plastic substrate and powered by a rechargeable supercapacitor with photovoltaics capable of harvesting even indoor light. This label can be added as a part of the product packaging and be used to monitor, for example, the transport conditions of food and medicines or other temperature-sensitive products. The environmental impact of this smart label is overcompensated with the sustainability improvements in logistics that it enables. As a third scenario, the global amount of food waste is estimated at 1.6 billion metric tons per year, of which the edible parts amount to 1.3 billion metric tons (FAO, 2022). RFID or other intelligent tags could potentially be used to monitor and prevent this loss and the associated environmental footprint. 5. End-of-life management for the circular economy In the EU, e-waste continues to be one of the fastest-growing waste streams (Circular Economy Action plan, 2022). End-of-life management for electronics still holds challenges in separating electronic material fractions, such as metals, for recycling and reuse without losing material value in landfilling and incineration. Every year, 1.5 billion new mobile phones enter circulation. Old handsets end up in desk drawers or in landfills, which means that their materials and components are lost. But these materials need to be returned to the industry for reuse. End-of-life solutions and strategies are something that we haven’t completely cracked yet. Questions like, “What are the most compatible waste streams?” and “How do we arrange efficient material recovery?” are issues that we’re still tackling. Single-use diagnostic tests and other single-use products, such as smart labels, are new emerging electronic devices that need to be designed for sustainable end-of-life management. Since the number of intelligent electronic features integrated into packages is expected to grow, the packaging waste of electronics recycling is a mounting concern. Thus, electronic material recovery should be considered. The concerns also relate to safety if the recycled content is circulated back into, say, food packaging or toys. Therefore, it would be important to separate the electronic materials before package recycling processes. Designing with biodegradability in mind is also important in some cases. Effective collection of electronic devices is a challenge, and some products will inevitably end up in waste streams or the environment. In addition, designing biodegradable components wherever possible contributes to less e-waste—this might apply to packaging, plastic waste, or substrate material. However, remember that these materials are then lost from circulation and will thus not contribute to material shortage issues. VTT’s new nanocellulose electrocardiogram (ECG or EKG) patch is a good example. Because the device is modular, electronic components can be easily removed from the disposable patch and used again. The patch itself is biodegradable, consisting of nanocellulose and printed with carbon conductors and sensing electrodes. Traditional ECG patches are made of plastic-based materials with electronic components that can’t be removed. Pushing Progress in the Right Direction The electronics industry has several possibilities to decrease its environmental impact. It all starts at the design phase with the selection of layouts, materials, and manufacturing processes. New materials and processes are currently being scaled up for the electronics industry to start using them. However, all three aspects of sustainability—environmental, social, and economic—are important to consider when finding an optimal balance between cost, performance, and environmental impact for future electronic products. References Barras, R.; Cunha, I.; Gaspar, D.; Fortunato, E.; Martins, R.; Pereira, L., “Printable cellulose‐based electroconductive composites for sensing elements in paper electronics,” Flexible and Printed Electronics, 2017, 2, pp. 1‐12. N.M.P. Bocken, I. de Pauw, C. Bakker, B. van der Grinten, “Product design and business model strategies for a circular economy,” J. Ind. Prod. Eng., 33 (2016), pp. 308-320. Curto Fuentes, M., “Strategic Research and Innovation Agenda 2021, Electronic components and systems,” Publisher: EPoSS, Germany, 2021. V. Elia, M.G. Gnoni, F. Tornese, “Measuring circular economy strategies through index methods: a critical analysis,” J. Clean. Prod., 142 (2017), pp. 2741-2751. Forti, V., Baldé, C.P., Kuehr, R., Bel, G. “The Global E-waste Monitor 2020.” J. Guiltinan, “Creative destruction and destructive creations: environmental ethics and planned obsolescence,” J. Bus. Ethics, 89 (2009), pp. 19-28. Hakola, L.; Immonen, K.; Välimäki, M.; Väisänen, K‐L.; Sokka, L.; Eiroma, K.; Suhonen, M.; Leppäniemi, J.; Mäntysalo, M.; Keskinen, J.; Jauho, A.; Li, M.; Leminen, V.; Tanninen, P.; Deviatkin, I.; Horttanainen, M.; Lyytikäinen, J.; Roine, S., “Final report on ECOtronics research project carried out in Finland 2019‐2022,” 2022, 90 pg., available online: www.ecotronics.fi (accessed on 14 12 2022). Mohammad Naji Nassajfar,, Marja Välimäki, Liisa Hakola2, Kim Eiroma, Kirsi Immonen, Mariam Abdulkareem1 and Mika Horttanainen,“The effect of conductive ink alternation on the sustainability and functioning of printed electronics.” Mohammad Naji Nassajfar,*ORCID, Ivan Deviatkin, Ville Leminen, and Mika Horttanainen, “Alternative Materials for Printed Circuit Board Production: An Environmental Perspective.” Food and Agriculture Organization of the United Nations (FAO), “Food wastage footprint. Impacts on natural resources,” Summary Report. ISBN 978‐92‐5‐107752‐8, 2013. Circular Economy Action Plan, available online (accessed 14 12 2022).","filter_flag":1}
{"title":"Sunshine Coast's new recycling plant now open - Council - Council Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS9zdW5zaGluZS1jb2FzdHMtbmV3LXJlY3ljbGluZy1wbGFudC1ub3ctb3Blbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS9zdW5zaGluZS1jb2FzdHMtbmV3LXJlY3ljbGluZy1wbGFudC1ub3ctb3Blbi_SAQA?oc=5","id":"CBMiTGh0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS9zdW5zaGluZS1jb2FzdHMtbmV3LXJlY3ljbGluZy1wbGFudC1ub3ctb3Blbi_SAQA","guidislink":false,"published":"Mon, 11 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=345, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS9zdW5zaGluZS1jb2FzdHMtbmV3LXJlY3ljbGluZy1wbGFudC1ub3ctb3Blbi_SAQA?oc=5\" target=\"_blank\">Sunshine Coast's new recycling plant now open - Council<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Council Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sunshine Coast's new recycling plant now open - Council - Council Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vY291bmNpbG1hZ2F6aW5lLmNvbS5hdS9zdW5zaGluZS1jb2FzdHMtbmV3LXJlY3ljbGluZy1wbGFudC1ub3ctb3Blbi_SAQA?oc=5\" target=\"_blank\">Sunshine Coast's new recycling plant now open - Council<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Council Magazine<\/font>","source.href":"https:\/\/councilmagazine.com.au","source.title":"Council Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Sunshine Coast Council has welcomed the recently opened, high-tech Nambour Material Recovery Facility, capable of sorting paper and cardboard at a purity rate of 98 per cent – the highest quality of any facility in Australia. Construction of the facility was funded through an agreement between all levels of government, with $22 million from the Queensland Government’s Recycling and Jobs Fund, $13.5 million from Council and a $5.1 million joint contribution from the Federal and Queensland Governments under the Queensland Recycling Modernisation Fund. This facility is where recyclable products such as empty cardboard cereal boxes, plastic ice cream containers, glass jars, aluminium cans and much more, will now come to be sorted. Once the material is sorted, it is tied together (or baled) and distributed to specialist manufacturers to be made into a range of new products like packaging and paper products, road base, and outdoor furniture. This new plant replaced the previous facility, which was over 20 years old and had reached the end of its lifespan. On top of its high purity sorting of paper and cardboard, the facility is capable of processing approximately 60,000t per year. Sunshine Coast Council said that having a facility that delivers the highest quality re-use product will fuel the circular economy and prevent more waste going to landfill. Featured image: Aerial view of the Nambour Material Recovery Facility. Image credit: Sunshine Coast Council.","filter_flag":1}
{"title":"Getting it sorted: meet MuRF, our recycling wonder - OurSC","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vb3Vyc2MuY29tLmF1L2Vudmlyb25tZW50L2dldHRpbmctaXQtc29ydGVkLW1lZXQtbXVyZi1vdXItcmVjeWNsaW5nLXdvbmRlctIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vb3Vyc2MuY29tLmF1L2Vudmlyb25tZW50L2dldHRpbmctaXQtc29ydGVkLW1lZXQtbXVyZi1vdXItcmVjeWNsaW5nLXdvbmRlctIBAA?oc=5","id":"CBMiUWh0dHBzOi8vb3Vyc2MuY29tLmF1L2Vudmlyb25tZW50L2dldHRpbmctaXQtc29ydGVkLW1lZXQtbXVyZi1vdXItcmVjeWNsaW5nLXdvbmRlctIBAA","guidislink":false,"published":"Mon, 11 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=345, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vb3Vyc2MuY29tLmF1L2Vudmlyb25tZW50L2dldHRpbmctaXQtc29ydGVkLW1lZXQtbXVyZi1vdXItcmVjeWNsaW5nLXdvbmRlctIBAA?oc=5\" target=\"_blank\">Getting it sorted: meet MuRF, our recycling wonder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">OurSC<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Getting it sorted: meet MuRF, our recycling wonder - OurSC","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vb3Vyc2MuY29tLmF1L2Vudmlyb25tZW50L2dldHRpbmctaXQtc29ydGVkLW1lZXQtbXVyZi1vdXItcmVjeWNsaW5nLXdvbmRlctIBAA?oc=5\" target=\"_blank\">Getting it sorted: meet MuRF, our recycling wonder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">OurSC<\/font>","source.href":"https:\/\/oursc.com.au","source.title":"OurSC","query":"https:\/\/news.google.com\/rss\/search?q=\"Material recovery\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"A “new breed’’ of recycling plant is up and sorting on the Sunshine Coast, leading the way in creating a cleaner, greener future for our region – and country. A “new breed’’ of recycling plant is up and sorting on the Sunshine Coast, leading the way in creating a cleaner, greener future for our region – and country. It’s called “MuRf’’, which rolls off the tongue much better than Material Recovery Facility (MRF). MuRF’s job is to find treasure in about 60,000 tonnes of annual household and business recyclable waste, collected from our yellow-lidded bins. It will recover glass bottles and jars, plastic containers and steel and aluminium cans for reprocessing into new items. The facility will also sort paper and cardboard at a staggering 98 per cent purity – the highest quality of any Australian facility. MuRF is the wonderful result of vision from Sunshine Coast Council, and collaboration between all three levels of government, which provided a combined $40.6m in funding. Previous Slide Next slide Previous Slide Next slide How does Murf work? The inside of this building may look like a giant complicated 3D puzzle, but it is actually a hi-tech solution for the Sunshine Coast’s recycling future. The recyclable waste moves through a network of more than 60 conveyor lines with screens, ballistic separators, magnets, optical sorters, eddy currents, robotic quality control and balers sorting it into three paper grades at quality levels that are in global demand, five grades of single-stream plastics, with the plastic and fibre products at market-leading 98% purity levels. The high-tech plant was custom engineered and designed by industry leaders Recycling Design and Technologies RDT) Engineering, with parent company Re.Group task with the ongoing operation of the plant. Re.Group managing director David Singh said the materials recovery facility represented the ‘new breed’ of high capacity, high quality recycling facilities for South East Queensland. “The facility will feature advanced screening and sorting equipment to maximise the quantity and quality of recovered paper, cardboard, metals, plastic and glass,” Mr Singh said. “Once sorted and baled, these materials are distributed to specialist manufacturers where they are made into a range of new products such as packaging and paper products right through to road base and outdoor furniture.” Smarter solution to recycling Construction of the facility was funded through an agreement between all levels of government, with $22 million from the Queensland Government’s Recycling and Jobs Fund, $13.5 million from Council and a $5.1 million joint contribution from Australian and Queensland governments under the Queensland Recycling Modernisation Fund. Sunshine Coast Council Mayor Mark Jamieson said the new MRF was set to deliver an even smarter solution to the region’s recycling. “The opening of this new facility is another step towards Council’s goal to become a zero-net emissions organisation by 2041,” Mayor Jamieson said. “Having a facility that delivers the highest quality of segregated materials fuels the circular economy and prevents more waste going to landfill. “I acknowledge and thank the Australian and Queensland governments for their contribution and support.” Waste to drive innovation Sunshine Coast Council Environment Portfolio Councillor Maria Suarez said the facility would help Council deliver the Sunshine Coast Resource Recovery Strategy and create opportunities for the economy. “More than 80 local jobs were created during construction with 18 new full-time positions established to run the facility,’’ Cr Suarez said. “The new facility’s ability to sort and separate the recyclable waste to a high standard and supply desirable materials for industry will spur innovation within the private sector. “This will in turn create more ways to use recycled materials, leading to new manufacturing processes and new jobs. “Ultimately, it will help our healthy, smart, and creative region continue transitioning to a circular economy for managing waste. “That’s a win:win for our environment and our economy, benefiting today’s and future generations. “It is yet another example of how we as a Council are driving our aspiration for the Sunshine Coast to be Australia’s most sustainable region – healthy, smart, creative.” Previous Slide Next slide Previous Slide Next slide Previous Slide Next slide Senator for Queensland and Assistant Minister for Regional Development, Anthony Chisholm said that many residents across the Sunshine Coast were passionate about recycling and they want to do their part to help protect the environment. “This material recovery facility is another great example of the kind of infrastructure we need to boost recycling in Australia, while also creating jobs in the process,” he said. “The Albanese Government’s investment means more local jobs on the Sunshine Coast, less rubbish in landfill and a healthier environment.” Queensland Environment Minister, Leanne Linard said the Palaszczuk Government was committed to working with councils in Queensland to enhance their waste and resource recovery services as we move to a zero-waste society by 2050. “One way we will achieve our goals is to support greater re-use, recycling and remanufacturing of recyclable materials and this new materials recycling facility will help us do that.” Member for Nicklin, Robert Skelton said the new facility would contribute to economic growth for the region, create jobs and reduce the amount of waste going to landfill.” “Resource recovery is of vital importance in our drive for environmental sustainability, embodying the principles of a circular economy by reusing, recycling, and repurposing materials and energy sources, thereby reducing waste generation and conserving valuable resources,” he said. “The Palaszczuk Government is pleased to support Sunshine Coast Council in the implementation of its waste management plans, to deliver significant change in waste management right through to the household level.” Quick summary","filter_flag":1}
