{"title":"Urban Mining by Syed Adil Abbas - Muscat Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm11c2NhdGRhaWx5LmNvbS8yMDIzLzA5LzA5L3VyYmFuLW1pbmluZy1ieS1zeWVkLWFkaWwtYWJiYXMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm11c2NhdGRhaWx5LmNvbS8yMDIzLzA5LzA5L3VyYmFuLW1pbmluZy1ieS1zeWVkLWFkaWwtYWJiYXMv0gEA?oc=5","id":"CBMiR2h0dHBzOi8vd3d3Lm11c2NhdGRhaWx5LmNvbS8yMDIzLzA5LzA5L3VyYmFuLW1pbmluZy1ieS1zeWVkLWFkaWwtYWJiYXMv0gEA","guidislink":false,"published":"Sat, 09 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=252, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm11c2NhdGRhaWx5LmNvbS8yMDIzLzA5LzA5L3VyYmFuLW1pbmluZy1ieS1zeWVkLWFkaWwtYWJiYXMv0gEA?oc=5\" target=\"_blank\">Urban Mining by Syed Adil Abbas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Muscat Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Urban Mining by Syed Adil Abbas - Muscat Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiR2h0dHBzOi8vd3d3Lm11c2NhdGRhaWx5LmNvbS8yMDIzLzA5LzA5L3VyYmFuLW1pbmluZy1ieS1zeWVkLWFkaWwtYWJiYXMv0gEA?oc=5\" target=\"_blank\">Urban Mining by Syed Adil Abbas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Muscat Daily<\/font>","source.href":"https:\/\/www.muscatdaily.com","source.title":"Muscat Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Product longevity\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"For more than a century, our energy reliance centred around resources that were consumed and released as smoke. Today, an opportunity emerges to transition away from fossil fuels and embrace energy alternatives derived from renewable sources like sunlight, wind and water. However, the shift to green energy also calls for essential raw materials such as lithium, cobalt and copper, crucial for constructing wind turbines, solar panels, electric vehicles and catalytic converters – comparable to how oil, gas and coal powered the fossil fuel era. The remarkable aspect is that the constituents of green energy can be repeatedly used, in theory, indefinitely. However, this perpetual value hinges on designing products for reusability. Transforming from metal consumers to users, we could turn the growing mountains of discarded electronics into repositories of green raw materials through a concept called ‘urban mining,’ which holds the potential to evolve into a significant industry. While curtailing electronic consumption remains the most environmentally friendly approach, the circular economy underscores the significance of extending product lifespans, promoting repairs and fostering recycling. The European Union’s proposal for extended repair entitlement, surpassing traditional warranties, sets a positive precedent. Manufacturers are obligated to provide spare parts long after sales, nurturing a repair market for items ranging from old washing machines to mobile phones. However, even with enhanced product longevity, eventual depletion is inevitable. To prevent squandering valuable metals, a paradigm shift is essential in their management. Last year, a staggering 50mn tonnes of electronics were discarded globally, equivalent to 5,000 Eiffel Towers. This annual heap continues to grow exponentially. Amidst the green transition, marked by proliferation of wind turbines, solar panels and electric vehicles, the demand for these metals escalates. Trade tensions aside, the mining industry would struggle to meet this demand even under optimal conditions. Consequently, the prices of raw materials required for the green transition are projected to surge, heralding improved prospects for maintenance, reuse and recycling. Recognising this trend, the mining industry is investing in urban mining facilities. As metal prices rise, their investment potential strengthens. As our recycling efforts improve, urban miners face a new challenge in the coming years as the first wave of electric vehicles, turbines and solar panels reach their end-of-life stage. Companies investing now stand to profit by extracting reusable raw materials, especially if regulations enforce a minimum percentage of recycled components in new products, and designs facilitate efficient material reuse. The process of extracting metals from urban scrap mines progresses slowly. The mobile market exemplifies how far we are from achieving circular goals. Globally, most phones still exit the lifecycle outside proper recycling channels. According to the European Environment Agency, only 10% of mobile devices in Europe are recycled, another 10% collected but not recycled, and 20% are passed down or sold. These untapped resources remain either in storage or outside the circular loop. With high electronic waste volumes, Oman’s situation isn’t very promising. According to the United Nations University, our electronic waste volumes in 2019 were among the top three countries in the Arab world (15.2 kg per inhabitant) and the proportion of electronic waste that is collected has been declining for many years. Swift action is vital, and if the industry falters, legislations akin to the UK’s initiative could be adopted. The UK aims to establish a fully circular metals system, setting a global precedent. The rationale for embracing this approach is compelling – it addresses looming supply issues, restores ecological balance, and serves as an exceptional business model within the green transition. The question is: what are we waiting for? The imperative to act has never been clearer. By Syed Adil Abbas (An MBA graduate from Cardiff Metropolitan University (UK), Abbas is currently based in Muscat, and has over 20 years of international experience working with the public and private sectors in the Middle East, Far East, Africa and India.)","filter_flag":1}
