{"title":"The future of menus includes upcycled ingredients - Food Business News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0OTg1LXRoZS1mdXR1cmUtb2YtbWVudXMtaW5jbHVkZXMtdXBjeWNsZWQtaW5ncmVkaWVudHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0OTg1LXRoZS1mdXR1cmUtb2YtbWVudXMtaW5jbHVkZXMtdXBjeWNsZWQtaW5ncmVkaWVudHPSAQA?oc=5","id":"CBMiYWh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0OTg1LXRoZS1mdXR1cmUtb2YtbWVudXMtaW5jbHVkZXMtdXBjeWNsZWQtaW5ncmVkaWVudHPSAQA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0OTg1LXRoZS1mdXR1cmUtb2YtbWVudXMtaW5jbHVkZXMtdXBjeWNsZWQtaW5ncmVkaWVudHPSAQA?oc=5\" target=\"_blank\">The future of menus includes upcycled ingredients<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The future of menus includes upcycled ingredients - Food Business News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYWh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0OTg1LXRoZS1mdXR1cmUtb2YtbWVudXMtaW5jbHVkZXMtdXBjeWNsZWQtaW5ncmVkaWVudHPSAQA?oc=5\" target=\"_blank\">The future of menus includes upcycled ingredients<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","source.href":"https:\/\/www.foodbusinessnews.net","source.title":"Food Business News","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"NEW YORK — Imagine if there was a way for chefs and foodservice operators to include more vegetables into prepared dishes. Not just any vegetables, but the plants that typically never leave the field. That’s what brothers Jeremy and Adam Kaye, co-founders of The Spare Food Co., New York, envision with the company’s new Spare Starter that made its debut at Fornino in Greenpoint, Brooklyn, NY, on Nov. 6, kicking off a two-week “Waste Not, Want More” culinary event. The initiative is not about sneaking vegetables into unlikely dishes. Instead, it’s about feeling good about reducing food waste by eating surplus farm produce. “Spare Starter offers a tangible solution toward a sustainable and equitable food system and a proactive way to help achieve the sustainability goals of foodservice operators, their corporate clients and their diners,” said Jeremy Kaye. The Kaye brothers are onto something, as sustainability will continue to grow increasingly popular when making food choices, according to Innova Market Insights, Arnhem, The Netherlands. Sustainability is at the center of Innova’s No. 2 trend for 2024: “nurturing nature.” Seventy percent of consumers said sustainability is more important when choosing a product than two years ago, according to new research from data and analytics solution provider NIQ (formerly NielsenIQ), Chicago. Restaurants that incorporate sustainable sourcing create a point of differentiation when vying for diners’ dollars. “From regenerative agriculture to farming conditions for livestock, brands that highlight a bond with nature and the environment are achieving cut-through with consumers,” said Lu Ann Williams, global insight director at Innova. Jeremy Kaye described Spare Starter as a versatile value-added culinary ingredient made with six vegetables and a proprietary spice blend. It includes parts of vegetables, such as leaves and stalks, which are nutritious but more typically trimmed and discarded. The Kaye brothers collaborated with Fornino chef and owner Michael Ayoub to use the item in everything from ravioli filling to burgers (30% vegetables and 70% grass-fed beef). Mr. Ayoub also is using Spare Starter on pizzas that have a crust made with ReGrained SuperGrain+ from Upcycled Foods Inc., Berkeley, Calif. This is an upcycled flour derived from brewer’s spent grain. Also on the special menu is sangria made with The Spare Food Co.’s Spare Tonic, a climate-friendly probiotic sparkling tonic made with upcycled whey. “It is well documented that around a third of all food that is produced is wasted, and that reducing food waste is shown to be the No. 1 way that we can reverse the effects of climate change,” Jeremy Kaye said. “Where others see waste, we see overlooked ingredients and untapped goodness. Our mission is to prevent food from being wasted by shifting the collective perspective to making the overlooked essential.” Concern for food waste resonates across all generations, said Amanda Hartt, senior manager, NEXT Data and Insights-New Hope Network, Boulder, Colo. “(Consumers) look to brands that mitigate reducing waste in their supply chain.” Spare Starter not only reduces food waste, but it also saves time in the back of house, especially during foodservice labor shortages. It is shelf-stable until opened, and then requires refrigeration. The vegan ingredient helps to promote a “plant-forward menu that doesn’t compromise on taste,” Jeremy Kaye said.","filter_flag":1}
{"title":"How Progressive Grocer's Impact Awards Winners Are Improving the World - Progressive Grocer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL2hvdy1wcm9ncmVzc2l2ZS1ncm9jZXJzLWltcGFjdC1hd2FyZHMtd2lubmVycy1hcmUtaW1wcm92aW5nLXdvcmxk0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL2hvdy1wcm9ncmVzc2l2ZS1ncm9jZXJzLWltcGFjdC1hd2FyZHMtd2lubmVycy1hcmUtaW1wcm92aW5nLXdvcmxk0gEA?oc=5","id":"CBMiX2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL2hvdy1wcm9ncmVzc2l2ZS1ncm9jZXJzLWltcGFjdC1hd2FyZHMtd2lubmVycy1hcmUtaW1wcm92aW5nLXdvcmxk0gEA","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL2hvdy1wcm9ncmVzc2l2ZS1ncm9jZXJzLWltcGFjdC1hd2FyZHMtd2lubmVycy1hcmUtaW1wcm92aW5nLXdvcmxk0gEA?oc=5\" target=\"_blank\">How Progressive Grocer's Impact Awards Winners Are Improving the World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Progressive Grocer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Progressive Grocer's Impact Awards Winners Are Improving the World - Progressive Grocer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vcHJvZ3Jlc3NpdmVncm9jZXIuY29tL2hvdy1wcm9ncmVzc2l2ZS1ncm9jZXJzLWltcGFjdC1hd2FyZHMtd2lubmVycy1hcmUtaW1wcm92aW5nLXdvcmxk0gEA?oc=5\" target=\"_blank\">How Progressive Grocer's Impact Awards Winners Are Improving the World<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Progressive Grocer<\/font>","source.href":"https:\/\/progressivegrocer.com","source.title":"Progressive Grocer","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"ALDI Every June, for the past five years, ALDI has teamed with Alex’s Lemonade Stand Foundation (ALSF), an organization dedicated to finding cures for childhood cancers, on an in-store and online campaign to raise funds and awareness in support of the cause. Unique ALDI Finds provide customers with everything needed to host their own lemonade stands, including a pop-up lemonade stand, various lemonades, a glass beverage dispenser, summer-themed treats and lemon-scented soaps. Also during the campaign, stores offer reusable bags featuring artwork by ALSF heroes and their “SuperSibs,” siblings of kids with cancer. This year, for the first time, ALDI donated 50 cents for each ALSF-branded bag of lemons purchased throughout the month of June, up to $1 million. The grocer intentionally set the price to honor Alexandra “Alex” Scott, the child who started selling lemonade for that amount to raise money to find cures for childhood cancers and inspired the founding of ALSF. Meanwhile, associates raise funds for the ALDI Heroes Fund to pay the expenses of ALSF families traveling for treatment. The retailer doubles the impact by matching all donations, up to $500 per employee. ALDI is on track to donate $10 million to ALSF by 2027.","filter_flag":1}
{"title":"PepsiCo Announces Agriculture Accelerator Projects to Support Farmer Livelihoods, Scale Sustainable Innovation and ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi3gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcHNpY28tYW5ub3VuY2VzLWFncmljdWx0dXJlLWFjY2VsZXJhdG9yLXByb2plY3RzLXRvLXN1cHBvcnQtZmFybWVyLWxpdmVsaWhvb2RzLXNjYWxlLXN1c3RhaW5hYmxlLWlubm92YXRpb24tYW5kLWFjY2VsZXJhdGUtcmVnZW5lcmF0aXZlLWFncmljdWx0dXJlLWFjcm9zcy10aGUtZ2xvYmUtMzAxOTk0OTU5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi3gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcHNpY28tYW5ub3VuY2VzLWFncmljdWx0dXJlLWFjY2VsZXJhdG9yLXByb2plY3RzLXRvLXN1cHBvcnQtZmFybWVyLWxpdmVsaWhvb2RzLXNjYWxlLXN1c3RhaW5hYmxlLWlubm92YXRpb24tYW5kLWFjY2VsZXJhdGUtcmVnZW5lcmF0aXZlLWFncmljdWx0dXJlLWFjcm9zcy10aGUtZ2xvYmUtMzAxOTk0OTU5Lmh0bWzSAQA?oc=5","id":"CBMi3gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcHNpY28tYW5ub3VuY2VzLWFncmljdWx0dXJlLWFjY2VsZXJhdG9yLXByb2plY3RzLXRvLXN1cHBvcnQtZmFybWVyLWxpdmVsaWhvb2RzLXNjYWxlLXN1c3RhaW5hYmxlLWlubm92YXRpb24tYW5kLWFjY2VsZXJhdGUtcmVnZW5lcmF0aXZlLWFncmljdWx0dXJlLWFjcm9zcy10aGUtZ2xvYmUtMzAxOTk0OTU5Lmh0bWzSAQA","guidislink":false,"published":"Tue, 21 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=325, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi3gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcHNpY28tYW5ub3VuY2VzLWFncmljdWx0dXJlLWFjY2VsZXJhdG9yLXByb2plY3RzLXRvLXN1cHBvcnQtZmFybWVyLWxpdmVsaWhvb2RzLXNjYWxlLXN1c3RhaW5hYmxlLWlubm92YXRpb24tYW5kLWFjY2VsZXJhdGUtcmVnZW5lcmF0aXZlLWFncmljdWx0dXJlLWFjcm9zcy10aGUtZ2xvYmUtMzAxOTk0OTU5Lmh0bWzSAQA?oc=5\" target=\"_blank\">PepsiCo Announces Agriculture Accelerator Projects to Support Farmer Livelihoods, Scale Sustainable Innovation and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"PepsiCo Announces Agriculture Accelerator Projects to Support Farmer Livelihoods, Scale Sustainable Innovation and ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi3gFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3BlcHNpY28tYW5ub3VuY2VzLWFncmljdWx0dXJlLWFjY2VsZXJhdG9yLXByb2plY3RzLXRvLXN1cHBvcnQtZmFybWVyLWxpdmVsaWhvb2RzLXNjYWxlLXN1c3RhaW5hYmxlLWlubm92YXRpb24tYW5kLWFjY2VsZXJhdGUtcmVnZW5lcmF0aXZlLWFncmljdWx0dXJlLWFjcm9zcy10aGUtZ2xvYmUtMzAxOTk0OTU5Lmh0bWzSAQA?oc=5\" target=\"_blank\">PepsiCo Announces Agriculture Accelerator Projects to Support Farmer Livelihoods, Scale Sustainable Innovation and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The Positive Agriculture Outcomes Accelerator will now catalyze more than $30 million in investments to support nearly 40 agricultural projects through 2028 PURCHASE, N.Y., Nov. 21, 2023 \/PRNewswire\/ -- PepsiCo (NASDAQ: PEP) today announced the third year of its global agriculture program, the Positive Agriculture Outcomes (PAO) Accelerator, by backing eight new innovation projects across nine countries. PepsiCo's continued investment aims to address some of the most urgent challenges facing agriculture today, while moving the company's pep+ (PepsiCo Positive) agenda forward. The PepsiCo Positive Agriculture Outcomes (PAO) Accelerator will now catalyze more than $30 million in investments to support nearly 40 agricultural projects through 2028. PepsiCo's PAO Accelerator offers local farming communities co-investment to accelerate diverse and results-driven Positive Agriculture projects, as well as funding for ag-tech start-ups that offer proven products or technology with the potential to scale. This year's innovations will build resiliency through climate related analysis, improve soil health, and strengthen farms' climate resilience – engaging farmers in Australia, Colombia, Egypt, India, Iraq, Pakistan, Poland, Romania, and the United Kingdom.[1] \"We can't motivate systemic change on our own, and our PAO Accelerator continues to provide a forum for farming communities to bring forth ideas and opportunities, and receive the funding needed to get promising innovation off the ground,\" said Margaret Henry, Vice President, Sustainable and Regenerative Agriculture at PepsiCo. \"With this latest round of projects, we're not only fostering this powerful network of innovators across global farmland, but growing closer to achieving a more regenerative future, with farmers' insight at the forefront.\" Among the roster of 2023 projects, will be a project with Australian grain growers to test and validate soil health management practices to help reduce greenhouse gas emissions on-farm. In Colombia, funding will support increasing potato crop quality and yield by installing sprinkler irrigation systems that will also reduce water use. And, in collaboration with 3Keel, a UK-based landscape innovation firm, funding will help connect Europe-based organizations interested in supporting regenerative solutions with local farmland managers who can deliver measurable, sustainable outcomes. \"Investing in pioneering agriculture projects is a key action in combatting the evolving climate crisis and setting farmers around the world, up for long-term success,\" shared Tom Curtis, Director, 3Keel Group Ltd. \"Support from PepsiCo's PAO Accelerator will powerfully enable our team to work with local farmers across Europe to further broker the partnerships needed to accelerate climate action on the ground to strengthen agricultural supply chains for the long-term.\" Since its launch in 2021, the PAO Accelerator has supported diverse projects – from adopting efficient irrigation systems in response to increased drought, developing kilns to turn agricultural waste into fertilizer, improving soil health, and more. \"Speaking from experience, prioritizing and investing in climate-smart innovation can uncover solutions for our entire global agricultural supply chain,\" said Chris Seymour, Seymour Farms, Canada, and 2022 PAO Accelerator funding recipient. \"With support from PepsiCo's PAO Accelerator, my team gained new insights that helped improved soil health and profitability for my business, even as weather conditions became more unpredictable over time.\" As part of its pep+ transformation, PepsiCo's Positive Agriculture agenda prioritizes investment, innovation, and robust collaboration with our farming partners to deliver impact around the world. The scalable outcomes and ongoing investments in agricultural innovation via PepsiCo's PAO Accelerator continue to support the company's goal to spread the adoption of regenerative farming practices across 7 million acres by 2030, improve the livelihoods of more than 250,000 people in its agricultural supply chain, and sustainably source 100% of its key ingredients. Learn more about PepsiCo's Positive Agriculture commitments here. About PepsiCo PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $86 billion in net revenue in 2022, driven by a complementary beverage and convenient foods portfolio that includes Lay's, Doritos, Cheetos, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, and SodaStream. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including many iconic brands that generate more than $1 billion each in estimated annual retail sales. Guiding PepsiCo is our vision to be the global leader in beverages and convenient foods by winning with pep+ (PepsiCo Positive). pep+ is our strategic end-to-end transformation that puts sustainability and human capital at the center of how we will create value and growth by operating within planetary boundaries and inspiring positive change for planet and people. For more information, visit www.pepsico.com, and follow on Twitter, Instagram, Facebook, and LinkedIn @PepsiCo. Media Contact: [email protected] Editor's Footnote: [1] 2023 projects as follows: PROJECT NAME COUNTRY PROJECT DESCRIPTION Cool Soil Initiative Australia Extending PepsiCo's Cool Soil Initiative to support West Australia's oat sourcing region – testing and validating sustainable practices aimed at reducing greenhouse gas emissions on-farm, improve sustainability, yield, and profitability. Improved soil health with new cover crops Colombia Identifying how cover crops can improve soil erosion, soil fertility and fixation of nitrogen, to help reduce emissions and improve biodiversity. Sprinkler irrigation system installation Colombia Improving farmers' yields by increasing the amount of viable planting areas on farms and water reduction efforts by introducing low-pressure, sprinkler irrigation systems. Precision fertilizer use India Driving adoption of precision fertilizers to improve soil health and support potential greenhouse gas emissions reduction within the market's potato supply chain. Water availability analysis Iraq Conducting a water availability study to map current risks and build an action plan for 2030 building resiliency to the potato supply chain Guidance for smallholder farms transitioning to sustainable sourcing Egypt Introducing new ways of working to benefit local smallholder farmers and enable 100% sustainable sourcing for direct potato and corn by 2030. \"Weather Station\" installation Pakistan Improving grower resilience and timely decisions by deploying \"weather station\" technology on-site to deliver more accurate data to strengthen farming operations. Accelerating regenerative agriculture practices by building our partners capabilities Romania, Poland, UK In collaboration with 3Keel, a UK-based landscape innovation firm, funding will help connect Europe based organizations interested in supporting regenerative solutions with local farmland managers who can deliver measurable, sustainable outcomes. SOURCE PepsiCo, Inc.","filter_flag":1}
{"title":"Developing markets will lead the next wave of chocolate and nut growth: ofi - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8wMy9kZXZlbG9waW5nLW1hcmtldHMtd2lsbC1sZWFkLXRoZS1uZXh0LXdhdmUtb2YtY2hvY29sYXRlLWFuZC1udXQtZ3Jvd3RoLW9madIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8wMy9kZXZlbG9waW5nLW1hcmtldHMtd2lsbC1sZWFkLXRoZS1uZXh0LXdhdmUtb2YtY2hvY29sYXRlLWFuZC1udXQtZ3Jvd3RoLW9madIBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8wMy9kZXZlbG9waW5nLW1hcmtldHMtd2lsbC1sZWFkLXRoZS1uZXh0LXdhdmUtb2YtY2hvY29sYXRlLWFuZC1udXQtZ3Jvd3RoLW9madIBAA","guidislink":false,"published":"Fri, 03 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=307, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8wMy9kZXZlbG9waW5nLW1hcmtldHMtd2lsbC1sZWFkLXRoZS1uZXh0LXdhdmUtb2YtY2hvY29sYXRlLWFuZC1udXQtZ3Jvd3RoLW9madIBAA?oc=5\" target=\"_blank\">Developing markets will lead the next wave of chocolate and nut growth: ofi<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Developing markets will lead the next wave of chocolate and nut growth: ofi - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8xMS8wMy9kZXZlbG9waW5nLW1hcmtldHMtd2lsbC1sZWFkLXRoZS1uZXh0LXdhdmUtb2YtY2hvY29sYXRlLWFuZC1udXQtZ3Jvd3RoLW9madIBAA?oc=5\" target=\"_blank\">Developing markets will lead the next wave of chocolate and nut growth: ofi<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"As well as supplying cocoa, coffee, dairy and spices, the company (the new operating group born out of Olam) is the number one supplier of all seven major nuts and the world's largest independent hazelnut supplier. Such is its scope, it claims to supply enough hazelnuts to make 673 million jars of hazelnut spread every year. From ofi’s sourcing and processing operations in Turkey (which accounts for nearly three-quarters of global production) its hazelnuts are exported all over the world as an ingredient in various sweet and savoury products from chocolate and pralines, to spreads and oils. Doing so requires an extensive range of nuts and flavours in customized formats (including natural, blanched, sliced, diced, slivered, roasted, organic, paste and oil) to accommodate modern consumer preferences. The Singapore-based company is therefore confident it is well positioned to capitalise on the ‘health halo’ enjoyed by nuts among end consumers thanks to high amounts of unsaturated fats, fibre, calcium, iron potassium and protein. Nuts can also support front of pack labelling too. Nutrition-based schemes such as Nutri-Score consider nuts as having a positive impact on the overall nutritional score. There is also an opportunity to use them in savoury snacks in the UK, due to their exemption from the country’s HFSS regulation. Heath and indulgence ​ Crucially, though, nuts can provide both health and indulgence, and the importance of the hazelnut is linked to chocolate and confectionery, where it dominates the category and is the top flavour for launches in Europe. Ofi is busy unleashing sensory and functional benefits to new or existing products. It sees classic combinations like chocolate and hazelnut evolving to include extra flavour notes, like salt or spice. Think of a bar with hot honey coated hazelnuts, for example. Exciting as this type of innovation is, three quarters of hazelnut production is for the chocolate category, said Swaroop Joshi, ofi Vice President, Sales and Marketing. Categories like ice cream, muesli, protein powder, nut milks are all 'slowly growing' he said \"but today the industry is still dependent on the chocolate confectionary consumption​”. Developing market growth key ​ The company has observed steady annual hazelnut consumption growth of around 4-5% growth in the last few years. The company is now keen to exploit the enormous growth potential it sees in the chocolate category in developing markets. \"I come from India myself and the first time I saw a hazelnut was when I was in mid 20s,” ​revealed Joshi. “I didn't know there was something called a hazelnut which is made into a paste and added to chocolate spread.”​ He expects growth in chocolate and hazelnut consumption to accelerate as consumers in developing markets discover a taste for it. Europeans typically eat 6-7 kilos of chocolate a year, he claimed. In China, that number is currently just 100 grammes. “In markets like China, India, Brazil, Pakistan – that is where the growth will come.”​ There also growth potential for hazelnuts in the snacking category, he said. In Turkey, for example, it is common to see salted or caramel hazelnut eaten as a snack. \"Across most of the globe you've not seen hazels on the snack shelf along with cashews and peanuts and almonds​,”​ he noted. “We believe that's an unexplored market and we are trying to make some inroads into that to see if that can be explored better.​”​","filter_flag":1}
{"title":"The Coca-Cola Company Comments on Tax Court Decision - Yahoo Finance Australia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vYXUuZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2NhLWNvbGEtY29tcGFueS1jb21tZW50cy10YXgtMTE1NTAwODYyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vYXUuZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2NhLWNvbGEtY29tcGFueS1jb21tZW50cy10YXgtMTE1NTAwODYyLmh0bWzSAQA?oc=5","id":"CBMiT2h0dHBzOi8vYXUuZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2NhLWNvbGEtY29tcGFueS1jb21tZW50cy10YXgtMTE1NTAwODYyLmh0bWzSAQA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vYXUuZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2NhLWNvbGEtY29tcGFueS1jb21tZW50cy10YXgtMTE1NTAwODYyLmh0bWzSAQA?oc=5\" target=\"_blank\">The Coca-Cola Company Comments on Tax Court Decision<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance Australia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Coca-Cola Company Comments on Tax Court Decision - Yahoo Finance Australia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vYXUuZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2NhLWNvbGEtY29tcGFueS1jb21tZW50cy10YXgtMTE1NTAwODYyLmh0bWzSAQA?oc=5\" target=\"_blank\">The Coca-Cola Company Comments on Tax Court Decision<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance Australia<\/font>","source.href":"https:\/\/au.finance.yahoo.com","source.title":"Yahoo Finance Australia","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"ATLANTA, November 09, 2023--(BUSINESS WIRE)--On Nov. 8, the U.S. Tax Court issued a supplemental opinion in The Coca-Cola Company & Subsidiaries v. Commissioner of Internal Revenue. The Coca-Cola Company disagrees with the actions of the IRS and the latest decision by the U.S. Tax Court. While we disagree with the court’s interpretation of the facts and law in this case, we are pleased to move closer to a final resolution of the Tax Court case so that we can pursue an appeal, where we can assert our claims and vigorously defend the company’s position. This includes our belief that it is unconstitutional to face retroactive tax liability based on the IRS’ use of a calculation methodology that was different from what was long agreed upon and approved in audits for more than a decade. We do not expect the results in this recent supplemental decision to change the methodologies we have used to calculate the tax reserve we have taken or the potential aggregate incremental tax and interest liability we have disclosed related to the dispute with the IRS or our effective tax rate. ADVERTISEMENT About The Coca-Cola Company The Coca-Cola Company (NYSE: KO) is a total beverage company with products sold in more than 200 countries and territories. Our company’s purpose is to refresh the world and make a difference. We sell multiple billion-dollar brands across several beverage categories worldwide. Our portfolio of sparkling soft drink brands includes Coca-Cola, Sprite and Fanta. Our water, sports, coffee and tea brands include Dasani, smartwater, vitaminwater, Topo Chico, BODYARMOR, Powerade, Costa, Georgia, Gold Peak and Ayataka. Our juice, value-added dairy and plant-based beverage brands include Minute Maid, Simply, innocent, Del Valle, fairlife and AdeS. We’re constantly transforming our portfolio, from reducing sugar in our drinks to bringing innovative new products to market. We seek to positively impact people’s lives, communities and the planet through water replenishment, packaging recycling, sustainable sourcing practices and carbon emissions reductions across our value chain. Together with our bottling partners, we employ more than 700,000 people, helping bring economic opportunity to local communities worldwide. Learn more at www.coca-colacompany.com and follow us on Instagram, Facebook and LinkedIn. Story continues Forward-Looking Statements This press release may contain statements, estimates or projections that constitute \"forward-looking statements\" as defined under U.S. federal securities laws. Generally, the words \"believe,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"project,\" \"will\" and similar expressions identify forward-looking statements, which generally are not historical in nature. Forward-looking statements are subject to certain risks and uncertainties that could cause The Coca-Cola Company’s actual results to differ materially from its historical experience and our present expectations or projections. These risks include, but are not limited to, increases in income tax rates, changes in income tax laws or the unfavorable resolution of tax matters, including the outcome of our ongoing tax dispute or any related disputes with the U.S. Internal Revenue Service (\"IRS\"); the possibility that the assumptions used to calculate our estimated aggregate incremental tax and interest liability related to the potential unfavorable outcome of the ongoing tax dispute with the IRS could significantly change; increased or new indirect taxes; and other risks discussed in our filings with the Securities and Exchange Commission (\"SEC\"), including our Annual Report on Form 10-K for the year ended December 31, 2022, and our subsequently filed Quarterly Reports on Form 10-Q, which filings are available from the SEC. You should not place undue reliance on forward-looking statements, which speak only as of the date they are made. We undertake no obligation to publicly update or revise any forward-looking statements. View source version on businesswire.com: https:\/\/www.businesswire.com\/news\/home\/20231109683076\/en\/ Contacts Investors and Analysts: Robin Halpern, koinvestorrelations@coca-cola.com Media: Scott Leith, sleith@coca-cola.com","filter_flag":1}
{"title":"ofi officially opens state-of-the-art dairy processing plant in New Zealand - Food and Drink Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzUwMTM2L3N0YXRlLW9mLXRoZS1hcnQtZGFpcnktcHJvY2Vzc2luZy1wbGFudC1sb2NhdGVkLWluLXRoZS1kYWlyeS1oZWFydGxhbmQtb2YtbmV3LXplYWxhbmQv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzUwMTM2L3N0YXRlLW9mLXRoZS1hcnQtZGFpcnktcHJvY2Vzc2luZy1wbGFudC1sb2NhdGVkLWluLXRoZS1kYWlyeS1oZWFydGxhbmQtb2YtbmV3LXplYWxhbmQv0gEA?oc=5","id":"CBMiiAFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzUwMTM2L3N0YXRlLW9mLXRoZS1hcnQtZGFpcnktcHJvY2Vzc2luZy1wbGFudC1sb2NhdGVkLWluLXRoZS1kYWlyeS1oZWFydGxhbmQtb2YtbmV3LXplYWxhbmQv0gEA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzUwMTM2L3N0YXRlLW9mLXRoZS1hcnQtZGFpcnktcHJvY2Vzc2luZy1wbGFudC1sb2NhdGVkLWluLXRoZS1kYWlyeS1oZWFydGxhbmQtb2YtbmV3LXplYWxhbmQv0gEA?oc=5\" target=\"_blank\">ofi officially opens state-of-the-art dairy processing plant in New Zealand<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ofi officially opens state-of-the-art dairy processing plant in New Zealand - Food and Drink Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiAFodHRwczovL3d3dy5mb29kYW5kZHJpbmt0ZWNobm9sb2d5LmNvbS9uZXdzLzUwMTM2L3N0YXRlLW9mLXRoZS1hcnQtZGFpcnktcHJvY2Vzc2luZy1wbGFudC1sb2NhdGVkLWluLXRoZS1kYWlyeS1oZWFydGxhbmQtb2YtbmV3LXplYWxhbmQv0gEA?oc=5\" target=\"_blank\">ofi officially opens state-of-the-art dairy processing plant in New Zealand<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food and Drink Technology<\/font>","source.href":"https:\/\/www.foodanddrinktechnology.com","source.title":"Food and Drink Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"ofi (olam food ingredients) is celebrating the official opening of the first phase of its new, state-of-the-art dairy processing plant located in the dairy heartland of New Zealand – the Waikato region in the north island of the country. The facility will produce dairy ingredients like whole milk powder to meet growing demand, targeting key customers in the dessert, bakery, beverage, and confectionery categories. Sandeep Jain, managing director and CEO, dairy, at ofi noted how continued expansion of dairy manufacturing capabilities and innovation infrastructure at the new Tokoroa plant will become part of a global network that spans major milk consumption markets, such as South-East Asia, China, the Middle East, and Africa. The new plant also complements a suite of enhancements made to ofi’s dairy production facility and Ingredient Excellence Centre (IEC) in Johor, Malaysia back in September – which combined with a Customer Solutions Center based in Singapore, enabling it to co-create bespoke food and beverage solutions. “Our dairy business is well positioned to serve increased demand from our global customer base and co-create innovative applications at scale – driving additional focus on the value-added capabilities within our portfolio,” Jain said. The Tokoroa dairy ingredients forms part of ofi’s much wider natural ingredients portfolio which includes cocoa, coffee, nuts and spices, ideal combinations with dairy for customised products such as yogurts, protein bars and ready-to-drink tea, coffee and cocoa beverages. The new facility also complements ofi’s existing global footprint, driving stronger partnerships with its customers and strengthening its co-creation capabilities across the region. The next stage of investment will see further capability added to the facility to develop high value dairy ingredients. It will also enable ofi to look at ways to grow the value of its milk, generating better returns for its farmer partners. Naval Sabri, senior vice president, dairy, at ofi said: “The enthusiastic response we’ve received from local farmers shows that our partnership approach, and ofi’s global reputation as a leading dairy ingredients provider and innovator, has struck a chord with them.” “The dairy ingredients we’re now producing are nutritious and highly versatile with a desirable texture and flavour. They can be used in many applications from ice cream and yogurts, bakery goods and confectionery items, through to coffee, tea and cocoa beverages,” he said. ofi’s new facility will also help address its customers’ innovation, traceability, and sustainable sourcing requirements, engaging those keen to secure ingredients from New Zealand’s high quality milk pool. With sustainability a core focus for ofi, it published its first sustainability strategy for its dairy business, Dairy Tracks, which outlines the detailed approach the company is taking with sustainability efforts. The report shares how the company will meet industry challenges head on, providing direct support to its farmer partners to help them meet their goals to become more socially and environmentally sustainable by 2030. Related content","filter_flag":1}
{"title":"Mavala's ultimate guide to beauty features skincare-infused make-up range - Global Travel Retail Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5ndHJtYWcuY29tL2JyYW5kLW5ld3MvZnJhZ3JhbmNlcy1jb3NtZXRpY3Mtc2tpbmNhcmUtYW5kLWhhaXJjYXJlLzIwMjMvMTEvMjQvbWF2YWxhcy11bHRpbWF0ZS1ndWlkZS10by1iZWF1dHktZmVhdHVyZXMtc2tpbmNhcmUtaW5mdXNlZC1tYWtlLXVwL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5ndHJtYWcuY29tL2JyYW5kLW5ld3MvZnJhZ3JhbmNlcy1jb3NtZXRpY3Mtc2tpbmNhcmUtYW5kLWhhaXJjYXJlLzIwMjMvMTEvMjQvbWF2YWxhcy11bHRpbWF0ZS1ndWlkZS10by1iZWF1dHktZmVhdHVyZXMtc2tpbmNhcmUtaW5mdXNlZC1tYWtlLXVwL9IBAA?oc=5","id":"CBMimwFodHRwczovL3d3dy5ndHJtYWcuY29tL2JyYW5kLW5ld3MvZnJhZ3JhbmNlcy1jb3NtZXRpY3Mtc2tpbmNhcmUtYW5kLWhhaXJjYXJlLzIwMjMvMTEvMjQvbWF2YWxhcy11bHRpbWF0ZS1ndWlkZS10by1iZWF1dHktZmVhdHVyZXMtc2tpbmNhcmUtaW5mdXNlZC1tYWtlLXVwL9IBAA","guidislink":false,"published":"Fri, 24 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=328, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5ndHJtYWcuY29tL2JyYW5kLW5ld3MvZnJhZ3JhbmNlcy1jb3NtZXRpY3Mtc2tpbmNhcmUtYW5kLWhhaXJjYXJlLzIwMjMvMTEvMjQvbWF2YWxhcy11bHRpbWF0ZS1ndWlkZS10by1iZWF1dHktZmVhdHVyZXMtc2tpbmNhcmUtaW5mdXNlZC1tYWtlLXVwL9IBAA?oc=5\" target=\"_blank\">Mavala's ultimate guide to beauty features skincare-infused make-up range<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Travel Retail Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mavala's ultimate guide to beauty features skincare-infused make-up range - Global Travel Retail Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5ndHJtYWcuY29tL2JyYW5kLW5ld3MvZnJhZ3JhbmNlcy1jb3NtZXRpY3Mtc2tpbmNhcmUtYW5kLWhhaXJjYXJlLzIwMjMvMTEvMjQvbWF2YWxhcy11bHRpbWF0ZS1ndWlkZS10by1iZWF1dHktZmVhdHVyZXMtc2tpbmNhcmUtaW5mdXNlZC1tYWtlLXVwL9IBAA?oc=5\" target=\"_blank\">Mavala's ultimate guide to beauty features skincare-infused make-up range<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Travel Retail Magazine<\/font>","source.href":"https:\/\/www.gtrmag.com","source.title":"Global Travel Retail Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Mavala's ultimate guide to beauty features skincare-infused make-up range Based on a formula full of active ingredients, Mavala’s Serum Foundation is available in eight shades Earlier this year, among a new slate of products to the market, Swiss beauty brand Mavala introduced the Mini Bio-Color collection, its first range of bio-sourced nail polishes which are made up of 85% natural-origin ingredients. Based on a more natural formula with raw materials of plant and mineral origin, the collection features 12 shades and provides long-lasting hold and shine. According to the company, the addition of fortifying silicone improves the quality of nails. The line is now available in global travel retail. With 60 years of expertise, Mavala follows a philosophy dedicated to care and beauty and sells more than 12 million products annually worldwide. Available in more than 100 countries on five continents, it offers 700 SKUs translated into 30 languages. Founded on the concept of problem-solution since its beginning, the brand’s portfolio delivers clean beauty solutions from head-to-hand-to-toe. Mavala’s Perfect Concealer stimulates blood microcirculation and comes in ergonomic and eco-designed packaging Skincare-infused make-up Newly launched, Mavala’s skincare-infused make-up range includes Serum Foundation, Perfect Concealer and Magic Powder. Said to beautify and unify complexion, Serum Foundation comes in eight shades and is based on a formula full of active ingredients including the Swiss Mallow flower to smooth skin. Targeting dark circles and imperfections, Perfect Concealer stimulates blood microcirculation, strengthens the skin barrier and is described as offering the power of two serums in one concealer. It comes in ergonomic and eco-designed packaging. Both new products have been clinically shown to improve the quality and appearance of skin within one month of application. Finally, suitable for all skin tones, Magic Powder features an anti-blue light benefit to protect skin against urban and digital pollution. According to Doris Maute Bobillier, CEO at Mavala, with beauty and wellness becoming more interconnected, there is a stronger focus on products’ ability not only to enhance natural appearance, but also promote mental and physical wellbeing. This often leads to a brand experience centered on trusted values. With consumers increasingly concerned about the environmental impact of beauty products, Maute Bobillier says Mavala is exploring eco-friendly packaging, sustainable sourcing of ingredients and green manufacturing practices to align with this trend, as well as AI tools. Mavala’s Magic Powder features an anti-blue light benefit Educational tools and lifestyle practices More than a beauty brand, Mavala serves as an educational source on exercise, hygiene and lifestyle practices. The company designs traveler-friendly product sets that feature multi-lingual explanations or QR codes that link to educational videos and information. These materials cover topics such as hand exercises, skincare routines, how-tos and habits for healthy nails and skin. Speaking about how the company promotes its educational side in travel retail Maute Bobillier comments, “The brand has always put emphasis on teaching users about how to identify their skin, nail or lash concerns, both online and offline, to inform and engage consumers, including travelers. This includes via brochures, in-store displays and digital media where advice related to its beauty and wellbeing products are shared, as well as exclusive live demonstrations that offer travelers a relaxing and educational experience at the same time.” Global Travel Retail Magazine spoke with Hélène de Chastenet, Area Sales Manager at Mavala, in Cannes last month about the launch of the brand’s skin-infused make-up range. In line with Maute Bobillier’s comments, de Chastenet said, “What is important at Mavala is that we want to use caring ingredients in every product. This includes our make-up line.” Speaking from experience, de Chastenet added that women who use Serum Foundation and Perfect Concealer find the products easy to apply and benefit from greater skin vitality.","filter_flag":1}
{"title":"Olam Food Ingredients opens New Zealand dairy processing plant - FoodManufacture.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTEvMTYvT2xhbS1Gb29kLUluZ3JlZGllbnRzLW9wZW5zLU5ldy1aZWFsYW5kLWRhaXJ5LXByb2Nlc3NpbmctcGxhbnTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTEvMTYvT2xhbS1Gb29kLUluZ3JlZGllbnRzLW9wZW5zLU5ldy1aZWFsYW5kLWRhaXJ5LXByb2Nlc3NpbmctcGxhbnTSAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTEvMTYvT2xhbS1Gb29kLUluZ3JlZGllbnRzLW9wZW5zLU5ldy1aZWFsYW5kLWRhaXJ5LXByb2Nlc3NpbmctcGxhbnTSAQA","guidislink":false,"published":"Thu, 16 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=320, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTEvMTYvT2xhbS1Gb29kLUluZ3JlZGllbnRzLW9wZW5zLU5ldy1aZWFsYW5kLWRhaXJ5LXByb2Nlc3NpbmctcGxhbnTSAQA?oc=5\" target=\"_blank\">Olam Food Ingredients opens New Zealand dairy processing plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Olam Food Ingredients opens New Zealand dairy processing plant - FoodManufacture.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMTEvMTYvT2xhbS1Gb29kLUluZ3JlZGllbnRzLW9wZW5zLU5ldy1aZWFsYW5kLWRhaXJ5LXByb2Nlc3NpbmctcGxhbnTSAQA?oc=5\" target=\"_blank\">Olam Food Ingredients opens New Zealand dairy processing plant<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","source.href":"https:\/\/www.foodmanufacture.co.uk","source.title":"FoodManufacture.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The facility was designed for the development of dairy ingredients such as whole milk powder for the dessert, bakery, beverage and confectionery categories. Work took two years to complete and was completed in August 2023, while it prompted the firm to expand its team in New Zealand from two employees to 60. Based Tokoroa, Waikato, ofi hopes that new plant will enable the firm to address the innovation, traceability and sustainable sourcing requirements of its customers. The business plans to continue investing in the plant so that it can expanding its offering and create new high value dairy ingredients. ofi said that is also looking at ways to grow the value of its milk and deliver better returns to its partner farmers, while producing ingredients in a socially responsible and environmentally sustainable manner. Operating on a global scale, ofi’s portfolio of ingredients includes cocoa, coffee, nuts and spices. It has three locations in the UK, including an office in London, a cocoa processing plant in Goole and a logistics hub in Ipswich. New Zealand plant ‘part of a global network’ Sandeep Jain, managing director and CEO for dairy at ofi, said that the Tokoroa plant will supply markets across South-East Asia, China, the Middle East and Africa. “The new plant also complements a suite of enhancements made to ofi’s dairy production facility and Ingredient Excellence Centre (IEC) in Johor, Malaysia back in September – which combined with our Customer Solutions Center based in Singapore, enables us to co-create bespoke food and beverage solutions for our customers​,” added Jain. “Our dairy business is well positioned to serve increased demand from our global customer base and co-create innovative applications at scale – driving additional focus on the value-added capabilities within our portfolio​.” Meanwhile, ofi senior vice president for dairy Naval Sabri described the local response as “enthusiastic​” and credited the reputation the brand has built as a “leading dairy ingredients provider and innovator​”. He continued: “The dairy ingredients we’re now producing are nutritious and highly versatile with a desirable texture and flavor. They can be used in many applications from ice cream and yogurts, bakery goods and confectionery items, through to coffee, tea and cocoa beverages​.”","filter_flag":1}
{"title":"Brand Studio Lifestyle Witnesses Record Sales in a Single Month, up a massive 132 pc YoY - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsL2JyYW5kLXN0dWRpby1saWZlc3R5bGUtd2l0bmVzc2VzLXJlY29yZC1zYWxlcy1zaW5nbGUtbW9udGgtbWFzc2l2ZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsL2JyYW5kLXN0dWRpby1saWZlc3R5bGUtd2l0bmVzc2VzLXJlY29yZC1zYWxlcy1zaW5nbGUtbW9udGgtbWFzc2l2ZdIBAA?oc=5","id":"CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsL2JyYW5kLXN0dWRpby1saWZlc3R5bGUtd2l0bmVzc2VzLXJlY29yZC1zYWxlcy1zaW5nbGUtbW9udGgtbWFzc2l2ZdIBAA","guidislink":false,"published":"Mon, 20 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=20, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=324, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsL2JyYW5kLXN0dWRpby1saWZlc3R5bGUtd2l0bmVzc2VzLXJlY29yZC1zYWxlcy1zaW5nbGUtbW9udGgtbWFzc2l2ZdIBAA?oc=5\" target=\"_blank\">Brand Studio Lifestyle Witnesses Record Sales in a Single Month, up a massive 132 pc YoY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Brand Studio Lifestyle Witnesses Record Sales in a Single Month, up a massive 132 pc YoY - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigAFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vYXJ0aWNsZS9yZXRhaWwtYnVzaW5lc3MvcmV0YWlsL2JyYW5kLXN0dWRpby1saWZlc3R5bGUtd2l0bmVzc2VzLXJlY29yZC1zYWxlcy1zaW5nbGUtbW9udGgtbWFzc2l2ZdIBAA?oc=5\" target=\"_blank\">Brand Studio Lifestyle Witnesses Record Sales in a Single Month, up a massive 132 pc YoY<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Top 10 Luxury Watch Brands in India: How to Make the Right Choice Did you know that Sylvester Stallone, the legendary Hollywood action star, is actually auctioning off the 11th feature of his famous movie \"Rocky\"? And guess what's included in this exciting sale? The Patek Philippe Grandmaster Chime, valued at a staggering Rs 62 crore! This collection is a showcase of rare timepieces that have been carefully curated over the course of several decades. Luxury watches have come a long way from being mere timekeeping machines. They have evolved into symbols of artistry, social status, and incredible history. These killer accessories are not just about looking stylish; they represent a legacy of precision, innovation, and sheer elegance. In India, where culture is a vibrant fusion of all things amazing, luxury watches are wholeheartedly embraced as icons of style and heritage. Among the top watch brands in India, these timepieces epitomize elegance and sophistication. When you delve into the world of luxury watch brands in India, you'll discover a perfect blend of tradition and modernity that truly resonates with watch enthusiasts. The aim of this combination of system and user prompts is to enhance the assistant's ability to refine the text into a more natural, human-like version while remaining true to the original content's intent and factual accuracy. Top 10 Watch Brands in India Here are the 10 most-rated luxury watch brands in India: 1. Rolex : Top Watch Brands in India When it comes to luxury watch brands in India, there's no match for Rolex. It's the epitome of style, success, and timeless elegance. Rolex has gone beyond being just a timekeeper and has become a symbol of status and sophistication. The Rolex Oyster Perpetual and Datejust models are more than just watches; they're heritage pieces that tell stories of achievement and refinement. Known for their impeccable quality and enduring designs, Rolex watches are the definition of luxury that lasts for generations. Here are some key details about Rolex: Established Year: 1905 Founders: Hans Wilsdorf and Alfred Davis Headquarters: Geneva, Switzerland Products: They offer a range of luxury watches, including popular models like the Submariner, Daytona, and Explorer. Store Outlets in India: You can find authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: Rolex has been a pioneer in the industry, introducing the first waterproof wristwatch (Oyster), the first watch with an automatically changing date on the dial (Datejust), and the first wristwatch to show two time zones at once (GMT-Master). Awards and Recognition: Rolex is renowned for its precision, with many of their models certified as Superlative Chronometers. Each Rolex timepiece is crafted with utmost care, ensuring precision and durability. Whether you prefer the sporty Submariner or the elegant Day-Date, Rolex has a wide range of models to suit every taste. The brand's commitment to excellence is evident in their rigorous testing and use of top-notch materials. When you invest in a Rolex, you're not just getting a watch; you're acquiring a piece of history that will be cherished for years to come. 2. Franck Muller : Best Watch Brands in India When it comes to luxury watch brands in India, Franck Muller is a name that really stands out for aficionados of exquisite timepieces. They're known for their innovative designs and intricate complications, which have earned them a special place in the world of high-end watches. Here are some key details about Franck Muller: Established Year: 1991 Founder: Franck Muller and Vartan Sirmakes Headquarters: Genthod, Switzerland Products: They offer a range of top-tier luxury watches, including the iconic Crazy Hours, Vanguard, and Long Island collections. Store Outlets in India: You can find their watches at select luxury watch retailers in major cities like Mumbai, Delhi, and Bangalore. Innovations: Franck Muller is renowned for introducing unique complications like the Crazy Hours, which features a non-linear arrangement of the hour markers, and the Master Banker, designed specifically for international business travelers. Awards and Recognition: Their timepieces have gained widespread acclaim for their distinctive designs and mechanical sophistication. Franck Muller watches are more than just accessories; they're true masterpieces that seamlessly blend artistry with mechanical precision. The brand's unwavering commitment to excellence is evident in every meticulous detail and the use of only the finest materials. Not only are Franck Muller watches visually striking, but they also offer exceptional performance, making them the go-to choice for discerning watch enthusiasts in India. Whether you prefer the bold and striking Vanguard collection or the whimsical and unconventional Crazy Hours, Franck Muller watches are guaranteed to leave a lasting impression on both enthusiasts and collectors alike. 3. Omega Omega stands out in the world of luxury watches with its rich heritage and association with precision timekeeping. Known for its role in space exploration and sports timing, Omega watches are a blend of innovation and timeless elegance. Established Year: 1848 Founder: Louis Brandt Headquarters: Biel\/Bienne, Switzerland Products: Luxury watches, including the iconic Speedmaster, Seamaster, and Constellation collections Store Outlets in India: Multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: First watch worn on the moon (Speedmaster), co-axial escapement technology, and official timekeeper of the Olympic Games Awards and Recognition: Known for precision, many models are certified as Master Chronometers, meeting rigorous standards set by the Swiss Federal Institute of Metrology (METAS) Omega watches are celebrated for their robust performance and elegant designs. The Speedmaster, famously known as the \"Moonwatch,\" has been a part of all six lunar missions, while the Seamaster is renowned for its association with James Bond. Omega’s dedication to precision is evident in their stringent testing processes and use of innovative materials. For those seeking the top watch brands in India, Omega offers a perfect blend of history, technology, and style. Whether you're exploring the depths of the ocean with a Seamaster or timing a race with a Speedmaster, Omega watches are among the top 10 watch brands in India built to perform and impress. 4. Breguet Breguet is a distinguished name in the world of horology, known for its rich history and remarkable precision. As one of the oldest and most prestigious watchmakers, Breguet has been a symbol of innovation and excellence since its founding. Established Year: 1775 Founder: Abraham-Louis Breguet Headquarters: L'Abbaye, Switzerland Products: Luxury watches, including the Classique, Marine, Tradition, and Reine de Naples collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Inventor of the tourbillon, Breguet hands, and the first wristwatch Awards and Recognition: Known for its technical advancements and elegant designs Breguet watches are more than just timepieces; they are masterpieces that reflect over two centuries of expertise. Each watch is made with meticulous attention to detail, featuring detailed dials, fine engravings, and complex mechanisms that showcase the brand's dedication to quality. For those seeking the best watch brands in India, Breguet stands out with its blend of tradition and technology. Whether you prefer classic designs or contemporary innovations, Breguet offers a diverse range of models to suit various tastes. From the refined Classique collection to the maritime-inspired Marine series, Breguet's watches are a testament to the brand's enduring legacy. Among watch brands in India, Breguet holds a distinguished place, offering pieces that are both sophisticated and historically significant. 5. Tag Heuer TAG Heuer is a prominent name among the best watch brands in India, known for its sporty designs and precision engineering. Renowned for its association with motorsports and high-performance timekeeping, TAG Heuer has made a significant mark in the world of horology. When it comes to luxury watch brands in India, TAG Heuer stands out with its blend of innovation and style, making it a favorite among enthusiasts. Among the various watch brands in India, TAG Heuer offers a diverse range of models that cater to different tastes and preferences. Established Year: 1860 Founder: Edouard Heuer Headquarters: La Chaux-de-Fonds, Switzerland Products: Luxury watches, including the Carrera, Monaco, and Aquaracer collections Store Outlets in India: Available at multiple authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Introduced the first oscillating pinion for chronographs, the Monaco, which was the first square water-resistant watch, and the Mikrograph, capable of measuring 1\/100th of a second Awards and Recognition: Celebrated for its contributions to sports timing and precision engineering TAG Heuer watches are known for their robust performance and contemporary designs. The Carrera collection, inspired by the world of racing, offers a blend of style and functionality, making it a favorite among enthusiasts. The Monaco, with its distinctive square case, has become an icon of modern watch design. The Aquaracer series is tailored for those who seek adventure, offering water resistance and durability. For those seeking the best watch brands in India, TAG Heuer provides a perfect blend of innovation and elegance. Each timepiece reflects the brand’s commitment to precision and quality. TAG Heuer's watches are not just accessories but reliable companions that enhance both style and performance. Among watch brands in India, TAG Heuer is a preferred choice for those who value heritage and cutting-edge technology. 6. Hublot : Best Watch Brands in India Hublot is definitely one of the coolest watch brands in India. They're known for their badass designs and innovative use of materials. As a top luxury watch brand in India, Hublot has built a reputation for fusing traditional Swiss watchmaking with a modern twist. When it comes to watch brands in India, Hublot offers a killer combo of craftsmanship and cutting-edge technology that really appeals to all the watch enthusiasts out there. Let's get down to the facts: Established Year: 1980 Founder: Carlo Crocco Headquarters: Nyon, Switzerland Products: They've got a whole range of luxury watches, including the iconic Big Bang, the classy Classic Fusion, and the bold Spirit of Big Bang collections. Where to Find Them: You can get your hands on Hublot watches at authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai. Innovations: These guys have pioneered the \"Art of Fusion\" concept, which means they mix materials like gold and rubber to create some seriously cool watches. They even came up with the first scratch-resistant 18K gold, known as Magic Gold! Awards and Recognition: Hublot has been praised for their innovative designs and their use of fancy materials. Now let's talk about the watches themselves. Hublot timepieces are all about style and cutting-edge technology. The Big Bang collection is a total showstopper, with its bold and dynamic design that really captures the brand's innovative spirit. On the other hand, the Classic Fusion line is all about understated elegance. They take traditional watchmaking techniques and give them a modern twist with some seriously cool materials. And let's not forget about the Spirit of Big Bang series, which stands out with its unique barrel-shaped case and intricate details. If you're on the hunt for the best watch brands in India, Hublot is definitely a name to remember. They bring together innovation, luxury, and style in the most perfect way. Each Hublot watch is a true testament to their commitment to quality and creativity. Whether you're into the bold and badass vibes of the Big Bang or the refined elegance of the Classic Fusion, Hublot watches are made to make a statement. When it comes to watch brands in India, Hublot is the top choice for those who appreciate a blend of heritage and contemporary flair. So go ahead, rock that wrist bling with confidence! 7. Breitling : Top Watch Brands in India Breitling is all about adventure and precision, which is why it's a favorite among aviators and explorers. As one of the top watch brands in India, Breitling is known for its tough and functional designs that cater to professionals and enthusiasts alike. When it comes to watch brands in India, Breitling really stands out because they're all about creating timepieces that are both stylish and super practical. Here are some key details about Breitling: Established Year: 1884 Founder: Léon Breitling Headquarters: Grenchen, Switzerland Products: They make luxury watches, including the awesome Navitimer, Chronomat, and Superocean collections Store Outlets in India: You can find them at lots of authorized retailers in major cities like Mumbai, Delhi, Bangalore, and Chennai Innovations: Breitling is the genius behind the first chronograph pushers, they even made a watch with a distress beacon, and they pioneered the slide rule bezel Awards and Recognition: People love Breitling for being super precise and durable, especially professionals in aviation and diving Let's talk about the Navitimer series for a sec. These watches are a nod to Breitling's aviation roots and have that cool slide rule bezel. They're not just watches, they're like precision instruments that can track time as accurately as an experienced pilot. It really shows how committed Breitling is to being excellent and reliable. The Chronomat series is a great mix of toughness and sophistication, while the Superocean line is perfect for deep-sea adventurers. So basically, no matter what you're into, Breitling has got you covered. If you're on the lookout for the best watch brands in India, you can't go wrong with Breitling. They've got innovation, durability, and style all rolled into one. Each Breitling watch is made to the highest quality standards, so you know it's gonna perform flawlessly in any situation. Whether you're a pilot, a diver, or just someone who appreciates a finely crafted timepiece, Breitling definitely stands out among watch brands in India as the top choice. They've got a rich heritage and their performance is second to none. 8. Chopard Chopard stands out not only for its exquisite watches but also for its commitment to ethical craftsmanship. As one of the best watch brands in India, Chopard is renowned for its luxurious designs and sustainable practices. Among watch brands in India, Chopard offers a unique blend of elegance and responsibility, making it a top choice for discerning buyers. Established Year: 1860 Founder: Louis-Ulysse Chopard Headquarters: Geneva, Switzerland Products: Luxury watches, including the L.U.C., Happy Diamonds, and Mille Miglia collections Store Outlets in India: Available at select high-end retailers in major cities like Mumbai, Delhi, and Bangalore Innovations: Use of fair-mined gold in the L.U.C. line, introduction of the Happy Diamonds collection with free-moving diamonds, and advanced in-house movements Awards and Recognition: Celebrated for its contributions to ethical luxury and its innovative designs The Chopard L.U.C. line, crafted from fair-mined gold, represents the brand’s dedication to sustainability without compromising on elegance. This collection embodies Chopard's commitment to responsible luxury, appealing to those who seek to balance sophistication with ethical values. The Happy Diamonds series is another iconic collection, featuring free-moving diamonds that create a playful and luxurious aesthetic. A Chopard watch is a statement of moral sophistication, appealing to those who seek to balance luxury with responsibility. For those looking for luxury watch brands in India, Chopard offers timepieces that are not only beautifully designed but also crafted with a conscience. Each watch reflects the brand's dedication to quality, innovation, and ethical practices. Among watch brands in India, Chopard stands out for its unique combination of style, history, and sustainability, making it a preferred choice for those who value both elegance and ethical production. 9. Longines With a heritage dating back to the 19th century, Longines continues to captivate watch enthusiasts with its timeless designs. From the athletic sophistication of the HydroConquest to the classic elegance of the Master Collection, Longines offers a range of styles to suit different preferences. A Longines watch is a graceful blend of tradition and modernity, making it a timeless accessory that transcends trends. 10. Bell & Ross Founded by a team of designers and aviation experts, Bell & Ross creates watches that are both functional instruments and works of art. The brand’s iconic square-cased models are inspired by aviation control panels, making them popular among those who appreciate precision and style. A Bell & Ross watch is for the adventurous and the discerning, embodying a dedication to accuracy and a flair for design. Ways to Choose Right Watch Brand? Choosing the right luxury watch brand in India involves considering various factors such as personal style, functionality, and the brand’s heritage. Here are some tips to help you make the right choice: Understand Your Style Luxury watches come in various styles, from classic and elegant to sporty and modern. Determine your personal style and choose a brand that complements it. For instance, if you prefer timeless elegance, brands like Rolex and Breguet might be ideal. If you lean towards a modern and bold aesthetic, Hublot and Bell & Ross could be more suitable. Consider the Functionality Different watch brands offer various functionalities tailored to specific needs. If you are an adventurer or sports enthusiast, brands like Tag Heuer and Breitling, known for their precision and durability, would be excellent choices. For those who prioritize ethical craftsmanship, Chopard offers luxurious timepieces with a commitment to sustainability. Brand Heritage and Reputation A watch is not just a timekeeping device; it is a statement of identity and prestige. Consider the heritage and reputation of the brand. Rolex, for instance, is renowned for its legacy of excellence and is often associated with success and sophistication. Omega’s association with space exploration adds a layer of historical significance to its timepieces. Budget Considerations Luxury watches come with varying price tags. Establish your budget and explore brands that offer the best value within your range. While some brands like Rolex and Omega are known for their high-end luxury, others like Longines provide a balance of elegance and affordability. Visit Authorized Retailers To ensure the authenticity and quality of your purchase, always buy from authorized retailers. Visiting a showroom allows you to experience the watch firsthand, understand its features, and make an informed decision. In Mumbai, Time Avenue is a premier destination for luxury watches, offering an extensive collection of top-tier brands like Rolex, Omega, and Hublot. Longevity Properly cared for, a luxury watch will last for several decades (or longer). Check out any of the major watch auctions (Phillips, Christie’s, etc.) and you will find ready evidence of this. Worn regularly over years or decades, a watch becomes intimately associated with its owner. A luxury watch’s ability to stand the test of time means it can be passed down to future generations. It can serve as a meaningful heirloom, rite of passage or long-lasting memento. FAQ’s on Luxury Watch Brands in India What are the best luxury watch brands available in India? Many luxury watch brands are available in India, including Rolex, Omega, TAG Heuer, Patek Philippe, Audemars Piguet, and more. The choice often depends on personal taste, budget, and desired features. Where can I buy authentic luxury watches in India? Authorized dealers and boutiques of luxury watch brands are the best places to buy authentic watches. Some well-known retailers in India include Ethos Watches, Kapoor Watch Co., and The Prime - Luxury Watch Boutique. What is the price range for luxury watches in India? Luxury watches in India can range widely in price depending on the brand, model, and materials used. Entry-level luxury watches might start around Rs 1 lakh, while high-end models can go up to several crore. Do luxury watches come with international warranties in India? Yes, most luxury watch brands provide international warranties that are valid in India. It's essential to purchase from authorized dealers to ensure your warranty is honoured. Are luxury watches a good investment in India? Luxury watches can be a good investment as they often retain or appreciate in value over time, particularly limited-edition models or those from prestigious brands. However, it's essential to research and buy wisely to ensure a return on investment. Conclusion Best watch brands in India are more than just timepieces; they are symbols of craftsmanship, heritage, and personal style. The market offers a diverse range of brands and models to suit different tastes and budgets, from classic designs to avant-garde complications. Purchasing a luxury watch is not just a transaction but an investment in a piece of artistry and history. It's a decision that reflects an appreciation for quality and an understanding of the value of time. As the luxury watch market in India continues to evolve, consumers can expect to see more innovation, exclusivity, and personalized service from brands and retailers. Whether as a personal indulgence or an investment opportunity, luxury watches remain a timeless choice for discerning individuals in India who appreciate the finer things in life.","filter_flag":1}
{"title":"Top 10 Best Paper Manufacturing Companies In India 2024 - Inventiva","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5\" target=\"_blank\">Top 10 Best Paper Manufacturing Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 10 Best Paper Manufacturing Companies In India 2024 - Inventiva","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi90cmVuZHMvcGFwZXItbWFudWZhY3R1cmluZy1pbmRpYS0yMDI0L9IBAA?oc=5\" target=\"_blank\">Top 10 Best Paper Manufacturing Companies In India 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inventiva<\/font>","source.href":"https:\/\/www.inventiva.co.in","source.title":"Inventiva","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Sourcing\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"India’s paper manufacturing industry has emerged as a significant contributor to the country’s economic growth, fueled by rising demand for paper-based products across various sectors. In 2024, the landscape of paper manufacturing in India continues to evolve, witnessing the establishment of technologically advanced companies that have pushed the boundaries of innovation and sustainability. As the nation strives for economic development, these top 10 paper manufacturing companies have cemented their positions as leaders in the industry, driving growth, efficiency, and environmental consciousness. The demand for paper products remains steady in India, with industries such as packaging, education, publishing, and communication heavily relying on paper-based materials. However, in recent years, environmental concerns have driven the need for sustainable and eco-friendly practices in the paper manufacturing sector. As the Indian government enforces stringent regulations to minimize environmental impact, companies have been compelled to adopt greener practices, resulting in a surge of eco-conscious manufacturing processes and products. In this dynamic landscape, the top 10 paper manufacturing companies in India have not only adapted to changing market demands but have also excelled in creating a balance between economic viability and environmental stewardship. These companies have invested significantly in research and development to innovate their manufacturing techniques, focusing on minimizing waste, reducing energy consumption, and incorporating recycled materials. The advent of digital technology has posed challenges to the paper industry, but the companies featured in this list have demonstrated their resilience by embracing digital transformation. By integrating technology into their operations, they have streamlined processes, enhanced supply chain management, and optimized resource utilization. This comprehensive list of India’s top 10 paper manufacturing companies in 2024 is a testament to their unwavering commitment to quality, innovation, sustainability, and customer satisfaction. Through their relentless efforts, these companies have not only shaped the future of the paper industry but have also contributed significantly to India’s economic development and environmental preservation. In the following sections, we will delve into the details of each company, exploring its unique strengths, product portfolios, technological advancements, sustainability initiatives, and market influence. Join us on this journey as we uncover the pioneers that are driving India’s paper manufacturing sector forward into a promising and eco-friendly future. The paper manufacturing industry has been a crucial pillar of the global economy for centuries, providing a wide range of products that cater to various sectors. As technology and sustainability become increasingly important in the modern world, the growth prospects of paper manufacturing companies will inevitably evolve. This essay delves into the potential strategies and factors that can propel a paper manufacturing company’s growth in the coming years. Embrace Sustainability and Eco-Friendly Practices In the face of growing environmental concerns, the paper manufacturing industry must pivot towards sustainability and eco-friendly practices. Adopting sustainable sourcing of raw materials, utilizing renewable energy, and implementing efficient waste management systems are essential steps for long-term growth. Customers are increasingly inclined to support environmentally responsible companies, providing an opportunity for paper manufacturers to distinguish themselves in the market. Technological Advancements and Digital Transformation Integration of advanced technologies like artificial intelligence, the Internet of Things (IoT), and big data analytics can significantly enhance productivity and efficiency in paper manufacturing processes. Smart automation and digitalization can streamline operations, reduce costs, and improve product quality. Moreover, digital transformation enables the creation of innovative paper products tailored to modern needs, such as specialty papers for packaging and electronic applications. Diversification of Product Portfolio To foster growth, paper manufacturing companies must expand their product portfolios to meet diverse market demands. Exploring niche markets and producing high-value specialty papers can open new revenue streams. For example, developing papers suitable for sustainable packaging, biodegradable materials, or even functional papers with integrated technology can offer a competitive advantage. Global Market Penetration Expanding into new geographical regions can fuel growth and provide access to untapped markets. Developing economies often exhibit rising demand for paper products due to increased literacy rates, education, and economic development. Companies must invest in understanding regional preferences, cultural nuances, and regulatory environments to successfully penetrate and thrive in foreign markets. Focus on Research and Development Investing in research and development (R&D) is paramount to the future growth of paper manufacturing companies. R&D efforts can lead to the development of cutting-edge technologies, sustainable practices, and innovative paper grades, thereby maintaining a competitive edge in the industry. 1. ITC PSPD ITC PSPD, short for ITC Paperboards and Specialty Papers Division, is a pioneering force in the paper manufacturing industry. With a rich legacy and unwavering commitment to excellence, ITC PSPD has emerged as a prominent player in the market. The company’s relentless pursuit of innovation and sustainability has set new benchmarks in the paper sector. One of the key pillars of ITC PSPD’s success lies in its advanced manufacturing processes and cutting-edge technologies. The company leverages state-of-the-art machinery to produce high-quality paperboards and specialty papers, catering to a diverse range of industries and applications. From packaging solutions to graphic printing, ITC PSPD’s products have found widespread acclaim. Sustainability is deeply ingrained in ITC PSPD’s business philosophy. The company actively promotes eco-friendly practices and responsibly sourced raw materials. By adopting sustainable forestry and recycling practices, ITC PSPD reduces its environmental footprint, making it an environmentally conscious choice for consumers. ITC PSPD’s unwavering focus on research and development has led to continuous improvements in product quality and performance. Their team of dedicated experts works tirelessly to create innovative solutions that cater to the evolving needs of the market. As a result, ITC PSPD has earned accolades for its excellence in innovation and design. In addition to its commitment to quality and sustainability, ITC PSPD also prioritizes social responsibility. The company actively engages in community development initiatives, promoting education, healthcare, and livelihood opportunities for local communities. In conclusion, ITC PSPD stands tall as a transformative force in the paper manufacturing sector. With a strong emphasis on innovation, sustainability, and community engagement, the company has carved a distinct niche for itself in the market, setting an exemplary standard for others to follow. 2. Ballarpur Industries Limited Ballarpur Industries Limited, popularly known as BILT, boasts a rich legacy of excellence in the paper manufacturing domain. As one of India’s largest paper companies, BILT has played a crucial role in shaping the country’s paper industry landscape. Established several decades ago, BILT has continuously evolved and adapted to the changing market dynamics. The company’s robust manufacturing infrastructure equipped with modern technologies enables it to produce a diverse range of paper products. From writing and printing paper to industrial-grade paper, BILT caters to both domestic and international markets. Quality is the cornerstone of BILT’s success. The company adheres to stringent quality control measures at every stage of production, ensuring that its products meet the highest standards. This unwavering commitment to quality has earned BILT a loyal customer base and a stellar reputation in the industry. BILT’s commitment to sustainable practices is commendable. The company has taken significant strides in conserving natural resources, reducing waste, and promoting responsible forestry. By investing in eco-friendly technologies and implementing green initiatives, BILT aims to minimize its environmental impact and contribute to a greener planet. The company’s customer-centric approach is evident through its focus on innovation and customization. BILT collaborates closely with its clients to develop tailor-made solutions that address their specific requirements effectively. This customer-centric strategy has helped BILT build strong and enduring partnerships with its clients. In conclusion, Ballarpur Industries Limited continues to be a trailblazer in the paper manufacturing industry. With its commitment to quality, sustainability, and customer satisfaction, BILT remains a leading player in the market, leaving a lasting impact on the world of paper. 3. JK Paper Limited JK Paper Limited is a leading player in the paper industry in India, renowned for its premium-quality papers that are synonymous with excellence. With over six decades of experience, the company has grown to become a trusted name in the market. JK Paper’s product offerings cater to a wide spectrum of needs, including office documentation, packaging, and specialty papers. Their emphasis on product development and innovation has resulted in an extensive range of eco-friendly papers, reflecting their commitment to sustainability. The company’s manufacturing units are equipped with advanced technology, ensuring efficient production processes and superior product quality. JK Paper has consistently been recognized for its efforts in promoting eco-friendly practices and reducing waste generation. As a customer-focused organization, JK Paper prioritizes customer satisfaction by providing reliable and timely services. Their distribution network spans across the country, ensuring their products reach every corner of the nation. 4. Tamilnadu Newsprint & Papers Limited Tamilnadu Newsprint & Papers Limited (TNPL) is a prominent player in the paper manufacturing industry, based in Tamil Nadu, India. Established in the early 1980s, TNPL has emerged as a leading manufacturer of high-quality paper products, catering to both domestic and international markets. TNPL’s state-of-the-art paper manufacturing plants boast cutting-edge technology and adhere to eco-friendly practices, emphasizing sustainable production. The company specializes in producing a wide range of paper products, including newsprint, writing and printing paper, and packaging paper. Their commitment to quality has earned them several certifications, ensuring their products meet global standards. With a strong emphasis on research and development, TNPL continuously strives to innovate and introduce new products to meet the evolving demands of the paper industry. Their dedication to sustainability is evident through their responsible sourcing of raw materials and efficient energy utilization, minimizing their environmental footprint. In addition to being a major paper producer, TNPL actively contributes to social development and community welfare initiatives. They support educational programs, healthcare facilities, and environmental conservation projects, showcasing their commitment to corporate social responsibility. 5. Century Pulp & Paper Century Pulp & Paper is a renowned name in the paper manufacturing sector, known for its high-quality products and consistent growth. As a leading player in the industry, Century Pulp & Paper operates multiple manufacturing facilities across India, equipped with advanced machinery to produce an extensive range of paper and pulp products. The company’s dedication to innovation has led them to develop specialty papers catering to various industries such as packaging, textiles, and printing. Their papers are known for their superior strength, durability, and versatility, making them a preferred choice for businesses worldwide. With a focus on sustainability, Century Pulp & Paper emphasizes responsible forest management and promotes the efficient use of resources during the production process. This commitment has been acknowledged through various certifications, affirming their eco-friendly practices. Century Pulp & Paper’s commitment to social welfare is evident through their engagement with local communities, supporting skill development programs, healthcare initiatives, and promoting women’s empowerment. Their efforts in corporate social responsibility have gained them recognition as a responsible and caring organization. 6. The Andhra Pradesh Paper Mills Limited The Andhra Pradesh Paper Mills Limited (APPM) holds a prominent position in the paper manufacturing landscape in India. With a history dating back several decades, APPM has consistently grown and diversified its product portfolio. APPM specializes in producing a wide array of paper products, including fine papers used in stationery, writing, and printing. Additionally, the company is known for manufacturing packaging boards, meeting the demands of diverse industries like pharmaceuticals, FMCG, and more. Dedicated to environmental stewardship, APPM focuses on sustainable forest management practices and has implemented measures to reduce water and energy consumption during the paper manufacturing process. Their commitment to eco-friendly operations has earned them various environmental certifications. As a responsible corporate entity, APPM actively engages in philanthropic endeavors, contributing to the development of nearby communities. Their initiatives include supporting education, healthcare, and vocational training programs, aimed at uplifting the lives of the underprivileged. 7. West Coast Paper Mills Limited West Coast Paper Mills Limited is a prominent player in the paper manufacturing industry, renowned for its high-quality products and sustainable practices. Established several decades ago, the company has grown into a leading name in the paper sector, both domestically and internationally. The company’s commitment to innovation and technological advancement sets it apart from its competitors. With state-of-the-art machinery and cutting-edge production processes, West Coast Paper Mills ensures efficient and eco-friendly paper production. Their diverse range of products cater to various industries, including printing, publishing, packaging, and more. In addition to its emphasis on quality and innovation, West Coast Paper Mills Limited prioritizes environmental responsibility. They have implemented sustainable forestry practices and maintain responsible sourcing of raw materials to minimize their ecological footprint. This commitment to sustainability has earned them numerous accolades and certifications, making them a preferred choice for environmentally conscious customers. 8. Abhishek Industries Limited As a leading player in the paper manufacturing sector, Abhishek Industries Limited has garnered a reputation for its exceptional product quality and customer-centric approach. With a rich history of excellence, the company has continuously expanded its product portfolio and market presence. Abhishek Industries Limited specializes in producing a wide range of paper products, from fine writing paper to industrial-grade packaging materials. Their advanced manufacturing facilities ensure consistent and reliable output to meet the demands of diverse industries. One of the key strengths of Abhishek Industries Limited lies in its focus on customer satisfaction. The company prides itself on delivering tailored solutions to meet specific client requirements. This customer-oriented approach has helped them build lasting relationships and establish a loyal clientele. Furthermore, the company’s commitment to social responsibility and community development sets it apart as an industry leader. They actively engage in various CSR initiatives, including educational programs and environmental conservation projects, showcasing their dedication to the betterment of society. 9. Shree Rama Newsprint & Papers Limited Shree Rama Newsprint & Papers Limited is a well-established player in the paper manufacturing sector, renowned for its high-quality newsprint and paper products. With a strong presence in the domestic and international markets, the company has become a trusted name in the industry. The company’s production facilities are equipped with advanced technology to ensure efficient and cost-effective paper production. Their product range includes newsprint, writing and printing paper, and packaging materials, catering to the diverse needs of their clients. Shree Rama Newsprint & Papers Limited places a strong emphasis on sustainability and environmental conservation. They have adopted eco-friendly practices and responsibly sourced raw materials to reduce their impact on the environment. This commitment aligns with the growing demand for environmentally conscious paper products. Moreover, the company’s dedication to research and development enables them to stay ahead of market trends and meet changing customer preferences effectively. Their continuous innovation ensures that they remain competitive and relevant in the dynamic paper industry. 10. Tamil Nadu Paper Corporation Tamil Nadu Paper Corporation is a significant state-owned enterprise playing a crucial role in the paper manufacturing landscape of the region. Established to promote the growth of the paper industry in Tamil Nadu, the corporation has achieved commendable success over the years. The company produces a diverse range of paper products, including copier paper, newsprint, and packaging materials, serving both commercial and government sectors. Their products are known for their consistent quality and affordability, making them a preferred choice for various businesses and institutions. Tamil Nadu Paper Corporation’s commitment to social responsibility and sustainable practices reflects the government’s vision for a greener and more equitable future. By adopting eco-friendly production methods and promoting forest conservation, the corporation actively contributes to environmental protection. Additionally, the corporation’s role in generating employment and supporting local communities further solidifies its position as a responsible corporate entity. As the paper industry continues to evolve, Tamil Nadu Paper Corporation remains steadfast in its mission to foster growth, development, and sustainability in the region.","filter_flag":1}
