{"title":"SABIC reaffirms commitment to processing 1M tons of circular materials annually by 2030 - BIC Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJpY21hZ2F6aW5lLmNvbS9kZXBhcnRtZW50cy9oc2Uvc2FiaWMtcmVhZmZpcm1zLWNvbW1pdG1lbnQtdG8tcHJvY2Vzc2luZy0xbS10b25zLW9mLWNpcmN1bGFyL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJpY21hZ2F6aW5lLmNvbS9kZXBhcnRtZW50cy9oc2Uvc2FiaWMtcmVhZmZpcm1zLWNvbW1pdG1lbnQtdG8tcHJvY2Vzc2luZy0xbS10b25zLW9mLWNpcmN1bGFyL9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3LmJpY21hZ2F6aW5lLmNvbS9kZXBhcnRtZW50cy9oc2Uvc2FiaWMtcmVhZmZpcm1zLWNvbW1pdG1lbnQtdG8tcHJvY2Vzc2luZy0xbS10b25zLW9mLWNpcmN1bGFyL9IBAA","guidislink":false,"published":"Thu, 19 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=19, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJpY21hZ2F6aW5lLmNvbS9kZXBhcnRtZW50cy9oc2Uvc2FiaWMtcmVhZmZpcm1zLWNvbW1pdG1lbnQtdG8tcHJvY2Vzc2luZy0xbS10b25zLW9mLWNpcmN1bGFyL9IBAA?oc=5\" target=\"_blank\">SABIC reaffirms commitment to processing 1M tons of circular materials annually by 2030<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BIC Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SABIC reaffirms commitment to processing 1M tons of circular materials annually by 2030 - BIC Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3LmJpY21hZ2F6aW5lLmNvbS9kZXBhcnRtZW50cy9oc2Uvc2FiaWMtcmVhZmZpcm1zLWNvbW1pdG1lbnQtdG8tcHJvY2Vzc2luZy0xbS10b25zLW9mLWNpcmN1bGFyL9IBAA?oc=5\" target=\"_blank\">SABIC reaffirms commitment to processing 1M tons of circular materials annually by 2030<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BIC Magazine<\/font>","source.href":"https:\/\/www.bicmagazine.com","source.title":"BIC Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"SABIC, a global leader in the chemicals industry, has reaffirmed its commitment to accelerating the circular carbon economy during the World Economic Forum Annual Meeting in Davos by unveiling its ambition to process one million metric tons (1000kt) of TRUCIRCLE™ solutions annually by 2030. Expand SABIC reaffirms commitment to processing 1M tons of circular materials annually by 2030 Abdulrahman Al-Fageeh, CEO, SABIC SABIC used its reception hosted in the company’s iconic ICEhouse™ (Innovation for the Circular Economy) with global business figures and policymakers, to outline its new advances on its sustainability journey. Abdulrahman Al-Fageeh, SABIC CEO (A) said, “At SABIC, we are committed to helping provide our customers with more sustainable solutions, and our target of one million metric tons of TRUCIRCLE™ solutions by 2030 intends to help usher in the new circular economy.” He added, “Driving circularity for plastics will require a rapid transformation of the entire value chain, which is only possible through collective action, innovation, and collaboration across the industry and eco system of waste management. Therefore, we are working hard with downstream and upstream partners to accelerate this process.” SABIC pioneered the industry back in Davos in 2019, when it announced plans to build a world-first small-scale commercial unit to produce certified circular polymers from the advanced recycling of used plastics. Since then, SABIC has been employing existing facilities to process smaller volumes of advanced recycled materials for brand owners and customers for a variety of applications already available in the market. Construction of the company’s first commercial unit in Geleen, the Netherlands is now entering the final stages and deliveries of first circular polymers are expected in 2023. As a next step on the roadmap to meet this 2030 target, SABIC will upscale volumes globally of advanced and mechanical recycling as well as bio-based materials. In that context, SABIC also announced that it is exploring a new world-scale commercial advanced recycling investment that would have a potential capacity to process around 200 kilotons (KT) of circular materials per year, as well as other projects such as a small-scale advanced recycling plant in Saudi Arabia. Expand SABIC reaffirms commitment to processing 1M tons of circular materials annually by 2030 SABIC CEO Abdulrahman Al-Fageeh speaking with global business figures and policymakers at SABIC’s Innovation for the Circular Economy (ICEhouse™). Since 2020, SABIC’s certified circular polypropylene has been used in ice cream tubs from the Unilever’s A-brand ice cream brand, Magnum, the first to use recycled plastic in the ice cream industry. In another successful collaboration, SABIC teamed up with Mars and Landbell in an innovative closed-loop recycling project designed to close the loop on KIND® snack bar wrap based on certified circular polypropylene. SABIC’s circular polymers and technologies are offered through TRUCIRCLE™, a set of solutions launched to help give value chain partners access to more sustainable materials. The TRUCIRCLE™ portfolio includes not only certified circular products, but also certified bio-based products, based on certified 2nd and 3rd generation renewable feedstock, and mechanical recycled polymers, ocean and ocean bound recycled solutions, as well as closed loop services and design for recyclability. SABIC’s certified circular and certified renewable products are verified and authenticated in a mass balancing approach under the International Sustainability and Carbon Certification (ISCC) PLUS scheme. TRUCIRCLE™ solutions were showcased in Davos, Switzerland, at SABIC’s Innovation for the Circular Economy (ICEhouse™), a distinctive concept-structure designed to demonstrate new possibilities for building in closed-loop carbon systems that reduce energy and material waste.","filter_flag":1}
