{"title":"Where to find green small business grants - Small Business UK - http:\/\/smallbusiness.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA","guidislink":false,"published":"Wed, 15 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=46, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5\" target=\"_blank\">Where to find green small business grants - Small Business UK<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">http:\/\/smallbusiness.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Where to find green small business grants - Small Business UK - http:\/\/smallbusiness.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vc21hbGxidXNpbmVzcy5jby51ay93aGVyZS10by1maW5kLWdyZWVuLXNtYWxsLWJ1c2luZXNzLWdyYW50cy0yNTUyNzczL9IBAA?oc=5\" target=\"_blank\">Where to find green small business grants - Small Business UK<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">http:\/\/smallbusiness.co.uk<\/font>","source.href":"https:\/\/smallbusiness.co.uk","source.title":"http:\/\/smallbusiness.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy-Saving Measures\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"UPDATED: Many entrepreneurs are looking to eco small business grants to help them fund environmental projects, adopt green technologies and become more sustainable. Funding comes under the following categories and are often distributed by local authorities: Renewable energy business grants Sustainability grants Energy efficiency grants Sustainable innovation Green jobs The green business grants below have been divided according to where they are in the UK and contain a link to the application page which will give you more information. UK-wide For start-ups developing sustainability-focused products or recycling technologies that help to keep materials circulating. It’s a three-month equity-free programme supporting early stage start-ups that have a positive impact on the environment. There are two separate tracks for two separate cohorts: one for sustainability focused products and one for recycling technologies. The funding part of the package includes a £10,000 grant, £500 Sponsored Amazon Advertising Credits and US$25,000 AWS Activate Credits. You’ll also receive specialised mentorship and a tailored curriculum of workshops, bootcamps and expert speakers. Apply here to sign up for this year’s cohort. Entries must be submitted by March 17, 2023. The fund is currently in its round two phase. We’ll award grants of £75,000 to £200,000 to organisations working to reduce reliance on: Soy-based animal or fish feed And\/or synthetic fertilisers If you are eligible, you will: Be running a project that reduces UK farmers’ reliance on soy-based animal or fish feed and\/or synthetic fertilisers; Have evidence that a pilot of your work has been completed (you do not have to need to have completed this yourselves); Be legally constituted, have a bank account in your organisation’s legal name, and at least two unconnected (unrelated and not married) people on your board or management committee; Have evidence that your project will reduce greenhouse gas emissions; Have proof this project will not lead solely to a private gain; Commit to open-source sharing of information, processes and learnings; Demonstrate collaboration and\/or co-operation within your project, and; Carry out your project in the UK Co-op suppliers are also welcome to apply for this funding and we’ve ringfenced £100,000 for a supplier applicant. We may also be able to connect successful non-supplier applicants with some of our suppliers working in the same area as a means of support. We’ll explain more about how this will work in our webinar. Applications are being accepted until midday on February 28, 2023. The Zero emission vessel and infrastructure (ZEVI) competition is part of a suite of interventions being launched by the UK Shipping Office for Reducing Emissions (UK SHORE), part of DfT. They aim to transform the UK into a global leader in the design and manufacturing of clean maritime technologies. The aim of this competition is to fund: 100 per cent battery electric vessels Alternative fuel vessels Vessel energy efficiency technology, such as wind assistance Vessel charging infrastructure Shore power and corresponding vessel technology Alternative fuel refuelling infrastructure for vessels Alternative fuel electric hybrid vessels are within scope. “Alternative fuels” in this competition refer to fossil fuel alternatives such as hydrogen, ammonia and methanol. Your proposal must build, deploy and operate novel clean maritime technologies focussed on on-vessel technologies and related shoreside infrastructure including at ports, harbours and offshore. Your demonstration must include the zero emission vessel and infrastructure being used in a representative real world operational environment for a period of three years. It is your responsibility to ensure you submit your application to the correct strand for your project. You will not be able to transfer your application and it will not be sent for assessment if it is out of scope. Your project must cost between £3m and £40m. The total grant can’t exceed £20m. The competition closes at 11am UK time on April 19, 2023. The Workplace Charging Scheme (WCS) is a voucher-based scheme that provides eligible applicants with support towards the upfront costs of the purchase and installation of electric vehicle (EV) chargepoints. It is available in England, Wales, Scotland and Northern Ireland, but not in the Channel Islands or Isle of Man. The grant covers up to 75 per cent of the total costs of the purchase and installation of EV chargepoints (inclusive of VAT), capped at a maximum of: £350 per socket 40 sockets across all sites per applicant – for instance, if you would like to install them in 40 sites, you will have one socket available per site After applying using the online application form, successful applicants are issued with a unique identification voucher code by email, which can then be given to any OZEV-authorised commercial chargepoint installer. Grants are available for private and social landlords to support retrofit property improvements to reduce carbon emissions across housing stock. The aim of this fund is to contribute to the reduction of carbon emissions from social and private housing via the provision of full retrofitting services or direct funding to help landlords reduce capital expenditure on eco-friendly housing improvements. Eligible costs include: Stock overview to identify potential retrofit measures and current EPC rating Internal wall, Room in Roof and under floor insulation installation Central heating and electric storage heater installation EV charging station installation England Receive a maximum of £30,000 per project for creating a woodland. The purpose of these eco business grants is to invest in equipment that cuts down on carbon emissions within your business. Warwickshire District Council will fund up to 40 per cent, providing eco business grants of up to £100,000. The grants are for installing energy efficient equipment like LED controls and renewable technologies. Worcestershire County are providing free energy and resource efficiency reviews as well funding for projects up to £20,000. The intervention rate is 40 per cent. They’re available to SMEs throughout Worcestershire, Herefordshire, Telford and Wrekin and Shropshire. Low Carbon Workspaces is supplying match-funded eco business grants between £1,000 and £6,750 for businesses to take on green initiatives like double glazing, LED lighting and smart heating. It’s open to SMEs in Hertfordshire, Buckinghamshire, Bedfordshire, Berkshire, Milton Keynes and Northamptonshire. There are now two grant schemes available under the Howardian Hills umbrella. This one is a Yorkshire-based grant for community infrastructure projects and countryside conservation work in the Howardian Hills Area of Natural Beauty (AONB). Assistance normally sits in the 30-75 per cent range but with this scheme you may be funded 100 per cent of your project. The Farming in Protected Landscapes scheme supports farmers and land managers along with people who work and live in these areas. The scheme will run until March 2025. The support is for farmers and land managers who are carrying out projects to mitigate climate change, provide opportunities for people to discover, enjoy and understand the landscape and cultural heritage or support nature-friendly and sustainable farm shop businesses. The programme will fund a portion of your costs – the amount will depend on how much the project will benefit your business. Your project must end by March 2025. Energy for Business has grants up to £10,000. They’re aimed at businesses in Nottinghamshire, Derbyshire or Leicestershire who improve energy, reduce emissions or are introducing sustainable technologies. The organisation will fund 40 per cent, up to £10,000. You’ve got a few conditions to bear in mind. The minimum project cost must be £2,500 and the maximum £24,999 – you’ll be given the grant once the work is completed. This is a page detailing several grants and funding opportunities for farmers and land managers. Pig, beef and dairy farmers whose farming systems produce slurry are able to apply for a grant which will allow them to build new slurry stores, replace slurry stores and expand existing slurry stores. You can apply for a grant between £25,000 and £250,000 for six months of storage. You can also apply for money to improve tree health and for grants from the Farming and Innovation Programme. Click on the link above to find out more about this grant and others for farmers and land managers. This one’s open to businesses in the green tech, low carbon and renewable energy sectors, with grants starting from £10,000 available. Your aim should be to increase productivity, skills and employment. You can use the money in the following areas: Launch a new business Modernise, expand or re-organise an existing business Upgrade a business by introducing innovative new technology or processes Take a new product from development to production An SME may apply for a grant between £200-£1000 to cover a maximum 40 per cent of the total value of their energy efficiency project through the Sustainable Business Partnership CIC. The grant is available to any business, social enterprise or charity that: Has fewer than 250 full time equivalent employees Has a turnover less than £44m Is not owned by a group or company that does not meet the above two criteria To apply for a grant the SME must also have: A premises in East Sussex (excluding Brighton & Hove) where the energy efficiency project will be installed Received an Energy Audit to identify energy saving measures; provided through the LoCASE project, or through a similar scheme or a private supplier. Public sector organisations and schools are not eligible for funding. Download Application Form You can download your application form using the link above. To apply for the grant please email your completed application form and supporting documents to info@sustainablebusiness.org.uk. SMEs in Greater Manchester may be eligible for grants between £2,000 and £25,000 (before VAT) and the grant would be funded up to 50 per cent of the cost of your energy efficiency improvements, up to a maximum grant of £12,500. The grants are available for a limited time on a first-come-first-served basis and can go towards, for example: A new LED lighting system for your premises Heating equipment upgrades Replacement drives or motors Process efficiency investments If you’re eligible, fill out the form in the link above. This grant helps businesses who are seeking to transition technologies that contribute to a lower carbon economy. The project you propose must cost no less than £5,000 and no more than £24,999. It will be 50 per cent match-funded in Cheshire and Warrington, Greater Manchester and the Halton district of the Liverpool region. Grants are awarded on a 60 per cent match basis for businesses based in Lancashire, Cumbria and majority Liverpool region. Businesses will need to demonstrate that they can fund the remaining project costs. This £10.05m grant scheme aims to help SMEs within the West Midlands region to meet European standards. You must have been trading for more than 12 months and own or lease heavy goods vehicles or light good vehicles that are not complaint with Clean Air Zone emission standards. You must also be able to demonstrate your use of clean air zones through your commercial operations. The total grant package for each business is up to £180,000 – that’s up to £15,000 per heavy goods vehicle and up to 35 per cent of the maximum cost of an upgrade up at a maximum of £4,000 for each light goods vehicle. This programme offers free renewable energy\/low carbon innovation assessments along with grants to SMEs in Worcestershire (and grants only to SMEs in Shropshire). SMEs will be encouraged and enabled to adopt lower carbon technologies – or the grant can help businesses in the clean innovation or those developing low carbon solutions alongside their normal business operations. Some sectors such as primary agriculture and finance are not eligible. Low Carbon SMEs helps businesses gain access to capital grants that will help them make green improvements to their operations. Eligibility is based on the ability to demonstrate sufficient energy savings. The maximum intervention rate is 50 per cent. Low carbon investment initiatives include: Voltage Optimisation System – to assist the company in lowering its carbon footprint and energy costs. Power factor correction equipment Variable speed air compressor with integral air dryer This scheme is to help small businesses in West Yorkshire to deal with rising energy costs. It offers 50 per cent funding up to £5,000 as well as providing practical support such as help to buy a more efficient boiler or help installing new low-energy lighting. The grants are open to businesses with 50 or fewer employees of all sectors. With this scheme, you can get a grant to cover part of the cost of replacing fossil fuel heating systems with a heat pump or biomass boiler. You’re eligible if: Own the property you’re applying for (including if it’s a business, a second home or a property you rent out to tenants) Have installed your new heating system on or after April 1, 2022 Be replacing fossil fuel heating systems (such as oil, gas or electric) You’re still eligible if you’ve already had funding to make your property more energy efficient, for example by insulating it. Community Solar Accelerator is a European Regional Development Fund (ERDF) funded, SME support project, delivered by Brighton Energy Co-op. Community Solar Accelerator will enable SMEs to reduce CO2 emissions by match funded grants of up to £25,000 towards either: Solar PV arrays Solar PV arrays & electric vehicle charging points Grants are available at up to 40 per cent of total eligible costs and are paid once the work is done and paid for. Match funding of 60 per cent of the project cost will come from the SME and loans, investments, savings and company reserves can be used. However, please note your time can’t be included as match funding. The Community Solar Accelerator programme will run until June 30, 2023. LoCASE is closing in June 2023. Funding is still available in many of the regions that the programme covers: Hampshire, Surrey, West Sussex, East Sussex, Greater Essex, Kent and Medway. This can be standard SMEs in the region who are looking at ‘green’ projects or LCREE\/EGSS firms seeking grant funding for business development purposes, especially pertinent through Covid-19 adaptation. Maximum 40 per cent ERDF grant contributions will remain at a limit of £10,000 with the minimum grant of £1,000 for qualifying projects. The LoCASE Programme brings together three key requirements for the growth of a low carbon economy – “Stimulating Demand”, “Supporting Supply” and “Transferring Knowledge”. This work will offer focused, individual support to SMEs (including social enterprises) improving competitiveness and creating jobs through increased energy efficiency and new low carbon business predominantly across the Local Enterprise Partnership (LEP) areas of South East (SELEP), Solent, Coast 2 Capital and Enterprise M3. This is a grant fund to help businesses, organisations communities and individuals interested in developing skills in the green economy and investing in green energy and carbon reduction schemes. The green entrepreneurs fund, which is being run in collaboration with the University of Derby, is made up of three funding streams: Green entrepreneurs small grant fund Grants of between £6,000 to £20,000 are available for proposals for alternative energy, clean fuel and carbon reduction projects. To be eligible, projects must have a minimum spend of £15,000 and there is a maximum intervention rate of 40 per cent. A total of £500,000 has been set aside for this fund. Green entrepreneurs demonstrator grant fund £1.2m has been earmarked for a small number of high-quality, larger scale carbon-cutting projects in Derbyshire. This fund is open to larger scale projects that are designed to encourage solutions beyond the mainstream of current thinking. The maximum grant available through this fund is £200,000. Green entrepreneurs scholarship fund This fund will support individuals to retrain with skills to enable them to enter the field of low carbon, green energy. Individuals can access up to £1,500 for training costs. £100,000 has been set aside for this fund. The scholarship grants will allow individuals to study around their existing responsibilities. It will enable them to obtain the skills and qualifications they need to change their career or progress in employment. The study can take place either online or face to face or a combination of both. Applicants are encouraged to contact the careers service and discuss their plans before applying for a green entrepreneur programme scholarship grant. The Sustainability in Enterprise project helps small and medium-sized enterprises (SMEs) in Greater Nottingham on their journey to Net Zero. Part-funded by the European Regional Development Fund (ERDF), we help businesses fully understand their current carbon emissions and identify effective carbon reduction measures. Financial support is available to help SMEs take action. Free, practical support is also available from specialists in sustainable business operations, building management, product design and employee engagement. Carbon grants and recruitment grants are available. Benefit from up to £25,000 financial support to help meet the costs of workplace travel improvements such as electric vehicle charge points, cycle parking, showers, pool bikes, car sharing and car parking management. You’re eligible if your business is inside the Nottingham City boundary. Take a look on the webpage for what the grant will and won’t support. The Green Heat Network Fund (GHNF) is a three-year £288m capital grant fund that will support: The commercialisation and construction of new low and zero carbon (LZC) heat networks (including the supply of cooling) The retrofitting and expansion of existing heat networks There will be a series of quarterly application rounds until the scheme closes in 2025. Individuals, households and sole traders cannot apply. Scotland NESTRANS supports development of travel plans in Aberdeen City and Shire. Applicants can bid for up to £10,000 in matched funding to support sustainable transport initiatives. This scheme is focused on providing financial support for businesses involved in the creation of either new woodland spaces or the sustainable management of existing woodlands. It is managed by the Scottish Rural Payments and Services agency and Scottish Forestry. If you’re looking to grow your Scottish manufacturing business through developing low carbon products, processes or services, you can apply for the LCMCF grant. Your project can use pure Research and Development (R&D), capital investment or environmental aid support in its effort to speed-up the transition to a low carbon economy in manufacturing. There’s a minimum value grant of £150,000 available. The LCMCF doesn’t provide 100 per cent of funding towards eligible project costs. The level of grant support will be determined dependent upon project activity, the size of your company and the location of the project. Once an amount has been allocated, you’ll be required to fund the rest of the project independently. Grants with a minimum value of £150,000 are available to cover eligible costs. You’ll have the chance to discuss the full details with your advisor. Your idea can include, but is not limited to: The development of a new product, service or technology that will reduce emissions, energy consumption, waste production and decrease the use of raw materials in the manufacture, and\/or end use, of the existing alternative The development of new business models based on the principles of a circular economy. Through circular supplies, resource recovery, product life extension or use of sharing platforms, for example. The challenge applies to companies based in Scotland. Maybe yours is a Scottish company working in isolation (a single company project), or one of a group of multiple companies working in collaboration – as long as at least one is based in Scotland, you’re eligible to apply. It’s important to consider the following: An assessment of your company or project eligibility will be made once we’ve received your fully completed expression of interest form All companies must follow Fair Work practices Funding will be available until March 31, 2026. Scottish Enterprise and Transport Scotland have developed ZEMIF to support Scottish based businesses to scale the manufacture of prototype zero emission niche and HDV components, systems and vehicles through R&D activities. The fund will encourage collaboration and clustering of innovation activity as projects move towards low-volume manufacturing. Successful project outcomes will be commercialised to fuel the decarbonisation of niche and HDVs in Scotland and across the globe. The fund has two main strands. These are: Innovation2Manufacture – for R&D projects focused on enabling the manufacture of prototype zero emission vehicles, components and systems, through to small scale manufacturing Innovation2Deployment – for R&D projects aimed at the rapid testing of new transport ideas using technology, business model, software and financial innovation This is a discretionary fund with a grant value assigned to your project on an individual basis. It doesn’t provide 100 per cent of funding towards eligible project costs. The level of grant support will be determined dependent upon project activity and the size of your company. Once an amount has been allocated, you’ll be required to fund the rest of the project independently. If your project can help speed up the transition to zero emission niche and HDVs, we’d like to hear from you. You can apply to the fund if you are: A company of any size based in Scotland Ready to scale the manufacturing of a prototype, or trial existing technologies in new ways Working alone or in collaboration with others All applicants are subject to a check on ownership and finances. It’s important to consider the following: An assessment of your company or project eligibility will be made once we’ve received your fully completed expression of interest form All companies must follow Fair Work practices The application length varies but is typically between four and twelve weeks, depending on the size and scale of your project. The aim of this challenge is to support Research and Development (R&D) to assist companies in developing technology that will lead to new commercial uses for CO2, and the creation of jobs, as part of our journey to a low carbon economy. The challenge will support projects to develop and test products and to enable infrastructure developments at emissions sources for use in your project. However, projects with a strong focus on carbon capture technology are out of scope, as are projects which do not involve CO2 transformation – using CO2 as a solvent or working fluid, for example. The challenge grants are contributory covering up to 50 per cent of incurred eligible costs following submission of evidence of the successful applicant’s expenditure and are expected to be in the region of £150,000 – £500,000. Larger grants may be available for exceptional projects. The grant is only available to companies based in Scotland, or those with the goal of establishing a presence within Scotland to carry out research and development and create jobs. To secure an R&D grant, companies will be legally obligated to create and\/or safeguard jobs throughout the project and maintain these positions for a period of up to 24 months after the project is completed. Funding is available to 31 March, 2024. Funding will be available to companies across Scotland until March 2026 and can be accessed in various ways, including: Grant funding – open to applications at all times, support is available for large-scale company R&D and capital investment projects focused on innovation in the crucial areas of green heat. Feasibility studies – these competitive funding calls help Scotland-based businesses develop innovative green heat solutions, focusing on technology readiness levels five to seven. The first of these calls is expected to launch in early 2023. CAN DO Innovation Challenges – using the Scotland CAN-DO approach, this route supports public sector innovation challenges. It provides innovators with 100 per cent funding via R&D service contracts through a competitive procurement process to fund the development of solutions. Its end goal is the deployment of commercial products and a contract with a challenge sponsor. It’s expected two CAN DO Innovation Challenges will be launched as part of the programme – the first by end of June 2023. European funding, through the Clean Energy Transition Partnership – a new transformative research, development and innovation programme which will support transnational collaborative projects designed to accelerate the energy transition. The programme has now launched, is open to organisations based in Scotland, and is delivered by Scottish Enterprise. More details about each type of funding can be found on the Scottish Enterprise link above. Energy Saving Trust is offering micro businesses and sole traders, with an operating site within 20km of Scotland’s low emission zones, a grant towards the safe disposal of non-compliant vehicles. The Low Emission Zone Support Fund, funded by Transport Scotland and administered by Energy Saving Trust, offers an incentive for eligible businesses to take their older, more polluting vehicles off the road. Grants of £2,000 are available to micro businesses with nine or fewer full-time employees and sole traders. Successful applicants will be required to dispose of their vehicle at a Scottish authorised treatment facility. A grant offer must be in place prior to vehicle disposal. Following vehicle disposal and successful receipt of the fund, eligible businesses will be offered an additional £1,000 towards the purchase of a cargo or electric cargo bike option through Travel Better Fund for businesses. The Glasgow City Council Green Business Grant will help businesses in Glasgow address both the cost of living and climate crises through measures such as energy efficiency, renewables, active travel and waste management. The Green Business Grant is a non-repayable grant of up to £10,000, which will cover up to 50 per cent of the total cost of a project. Projects can include anything that helps businesses reduce their energy bills and make progress towards achieving net zero carbon emissions. To be eligible for the grant, your business must: Be a small or medium-sized enterprise (as defined in the Companies Act 2006) Have been trading for at least six months Own its own premises in Glasgow or have written permission from your landlord to make changes to the premises and seek planning permissions from Glasgow City Council Planning Division to implement the works detailed in your application Have a Glasgow postcode and pay non-domestic rates in Glasgow Be headquartered in Glasgow Premises of an organisation based outside Glasgow will not be considered. Businesses whose main base is within the city boundary cannot use the grant to improve premises or create jobs outside Glasgow. Businesses that are owned by another business with more than a 25 per cent stake are not eligible. The grant will cover up to 50 per cent of the total cost of a project, to a maximum of £10,000. Businesses must be prepared to cover the rest of the cost from other sources. The grant will close to new applications on June 30, 2023 or when the budget is fully allocated, whichever is earlier. All projects must be completed by December 31, 2023. You will be contacted within 10 working days of submitting your completed online application. Through the Green Recovery Capital Development Grant, Perth and Kinross Council has made funding of up to £25,000 available for businesses that were financially affected by Covid-19 and now want to make capital investments in the Perth and Kinross area. This fund offers grants of up to £25,000 to cover up to 50 per cent of eligible costs. Projects must involve a minimum spend of £10,000, which means that businesses must match the funding with at least £5,000. Preference will be given to projects that involve green initiatives which will reduce your business’ carbon footprint. The grant will not be awarded upfront immediately after approval – instead, you will receive payment after you make your purchases and submit receipts or invoices. This means that initially you must be able to afford the project’s full cost until you are refunded. Priority will be given to projects that reduce the carbon footprint of your business. Applications must be submitted before February 28, 2023. To support the use of electric vehicles across Scotland, Transport Scotland offers grant funding to help organisations install electric vehicle (EV) charging infrastructure on their premises. The funding is distributed by Energy Saving Trust and is currently available for chargepoints that will only be used by occupiers, staff and visitors. Grants to cover up to 50 per cent of the costs of purchasing and installing electric vehicle chargepoints are available to rural businesses and property factors who manage communal property areas, including parking, and other organisations that manage communal parking for residential properties, such as private landlords. Grants to cover up to 75 per cent of the costs of purchasing and installing electric vehicle chargepoints are available to third sector organisations. SMEs in rural areas of Scotland are eligible. Property factors who manage communal property areas, including parking, and other organisations that manage communal parking for residential properties, such as private landlords, are also eligible. IBioIC has various funding programmes to help you progress your R&D, find collaborators and build your business. The Midlothian Council LACER Fund provides grants to businesses to support green projects, social enterprises to support start up and growth and aims to develop a network of local business associations to encourage collaboration. Available funds are: Social Enterprise Fund Grants of up to £4,000 are available to support the development of locally based social enterprises, helping them to start up and grow. Green Transition Fund Supports businesses to implement a project that helps them be more environmentally friendly and progresses Scotland’s transition to Net Zero. A grant of 70 per cent of project costs up to £20,000 is available to help with the green transition. Business Association Fund A £1,500 grant is available to help businesses come together to deliver local projects collaboratively as part of a Business Association. The LACER funds are available for Midlothian based businesses only. To find out more about the funds and how to apply, email bg@midlothian.gov.uk The SBA Get to Zero Grant provides funding for businesses in East Renfrewshire that wish to diversify and invest in sustainable measures to help their business become more efficient, in order to reduce carbon emissions and energy loss. Businesses can receive a 50 per cent match-funded grant of up to £5,000. Measures could include: Low energy heating and lighting systems Improved insulation for roof and building Solar, ground or air source heat or solar thermal technology Waste management or recycling Equipment that demonstrates a significant energy saving through its installation The Business Recovery and Growth Fund (BRGF) is targeted at new and existing businesses based in North Lanarkshire to support their strategic, longer term sustainability and growth. BRGF grants will cover 50 per cent of eligible project costs, up to £50,000, to fund specific activities to help businesses recover, adapt and diversify their operations. You are eligible if your business: Is based in North Lanarkshire Is a micro, small or medium-sized enterprise (up to 250 employees) Expects its turnover to reach a minimum level of £85,000 within 12 months of the date of the application Does not operate in an ineligible sector: gambling and betting or drinking places (bars or public houses) Is not a ratepayer of a business in the retail sector operating in premises with a rateable value of £51,001 or over Has not incurred any project-related expenditure until after a formal decision on the grant application has been received Owns the business premises or has more than 12 months remaining on a commercial lease at the date of application Is not connected to a tax haven, as set out in the Coronavirus (Scotland) (No. 2) Act 2020 Home-based businesses must be trading (not incorporated) for more than 12 months and will only be considered for support in exceptional cases. The fund can provide grants to cover up to 50 per cent of your project costs, with a maximum of £10,000 per grant. The minimum grant value is £1,000, which means your project must cost at least £2,000. The fund can be used to make changes to business premises and business operations to reduce their carbon footprint from energy consumption. This might include: Changing to a low carbon heating system Installation of low and zero carbon generating technologies, such as solar PV, biomass and micro-wind Building fabric upgrades such as insulation, energy-efficient lighting, draught-proofing, double or triple glazing Before you begin your application, you will need a record of: The trading name of the business The number of employees, your turnover and export sales (where applicable) The proposed expenditure Your business bank details The rateable value of your premises – this can be found on www.saa.gov.uk A copy of your lease if you are paying non-domestic rates for the premise Your latest set of accounts and management accounts, as well as a business plan (or mini business plan) Two quotes for each item being purchased A calculation of your baseline carbon footprint The projected emissions reduction from this investment The East Ayrshire Net Zero Grant provides up to 50 per cent funding, up to £3,000, to support local businesses to transition towards net zero carbon emissions and also help offset the current rises in energy costs. The fund is intended to help small to medium-sized businesses (SMEs) to implement energy and resource efficiency improvements. It can be used for: The purchase of equipment that would contribute to energy saving Green skills training Renewable energy installations (for example, solar, ground or air source heat pumps) Waste management or recycling Lighting systems Roof and building insulation Low energy heating To be eligible, a business must: Have been trading for at least 12 months Employ between three and 49 people Be working with Business Energy Scotland or the University of Strathclyde Have completed a business energy efficiency audit and created a carbon reduction plan The Low Carbon\/Energy Efficiency Grant is for West Lothian businesses that are looking to: Overcome barriers to reducing their carbon emissions Implement new business processes that will help reduce carbon emissions Implement strategic changes identified through consultancy support Promote their green credentials Enter a new market in the net zero landscape Your business must also: Have at least five employees Have been trading for at least one year Have growth potential over the next three years Wales Small Grants – Woodland Creation is a scheme aimed at farmers and other land managers to encourage planting of small areas of trees on land which is agriculturally improved or low environmental value in Wales. Funding is available for tree planting to create shelterwoods, alongside watercourses, and in field corners or small fields for stock shelter, biodiversity and woodfuel. Small Grants – Woodland Creation also offers 12 years of payments for Maintenance and Premium payment in respect of the new planting. This application window will open on February 13, 2023 and close on March 24, 2023. The budget allocation for this application window is £3m. All of the elements are laid out in a series of digital booklets. Find out how to apply in this booklet. The fund will provide capital support to businesses towards the purchase of renewable energy systems for their business premises. Grants available are between £1,000 and £10,000 towards the cost of the renewable energy system, which will make up no more than 50 per cent of eligible costs. Your business must either: Own the freehold, or Hold a lease with a seven-year minimum period remaining after the final grant payment date. You will need to secure your landlord’s written consent for the proposed works. The business premises must be registered on Carmarthenshire County Council’s Non-Domestic Rates register. All expenditure associated to the grant must be completed within four months of the date of approval letter. Applicants will be treated on a first come, first served basis until the allocated fund has been used up. The Sustainability Development Fund offers project grants, management grants to support staff costs or development grants to act as a catalyst for new action or partnerships. It normally provides 50 per cent of total project costs but up to 75 per cent is available for eligible voluntary sector projects. Applicants are expected to contribute at least 25 per cent of total project costs either from their own reserves or from other sources such as European funds, National Lottery funding or ‘in kind’ contributions. The private sector and individuals can apply, but the project has to be in the wider public interest to be eligible. The fund supports projects which will: Conserve and enhance the natural beauty of the AONB, including the built environment Promote sustainable forms of social and economic development Promote the economic and social well-being of local communities Promote quiet enjoyment of the AONB Priority is given to projects which: Involve local communities and young people Lever in contributions from other sources in cash or in kind Overcome barriers to sustainability and promote a wider understanding of sustainability Promote sustainable forms of social and economic development or add value to existing sustainability projects Raise awareness of the AONB and generate jobs or income for communities, without damaging the landscape Demonstrate innovation or best practice Contact Ceri Lloyd at Loggerheads Country Park on 01824 712757 for more information. Led by Cadwyn Clwyd and Denbighshire Voluntary Services Council (DVSC), the £600,000 Community Innovation Denbighshire project will focus on encouraging micro firms, community groups and social enterprises in rural and urban areas to put forward proposals that will deliver regional and environmental benefits. Supported by Denbighshire County Council and part-funded by the UK Government through the £220m UK Community Renewal Fund, support is available for 25 organisations or individuals who can apply for a £5,000 grant they will match-fund to trial new products, systems and services. Business Wales will also be on hand with guidance and advice throughout the process. For more information, email admin@cadwynclwyd.co.uk or call 01490 340500. This is the same as the Boiler Upgrade Scheme, but it’s available in Wales as well as England. With this scheme, you can get a grant to cover part of the cost of replacing fossil fuel heating systems with a heat pump or biomass boiler. You’re eligible if: Own the property you’re applying for (including if it’s a business, a second home or a property you rent out to tenants) Have installed your new heating system on or after April 1, 2022 Be replacing fossil fuel heating systems (such as oil, gas or electric) You’re still eligible if you’ve already had funding to make your property more energy efficient, for example by insulating it. Northern Ireland The Department of Agriculture, Environment and Rural Affairs is a government department in the Northern Ireland Executive. This page lists environmental grants along with other business support. If you can’t find any suitable eco business grants in the list above, take a look at the government’s finance and business support round-up or your local authority’s website. Just be aware that some of the grants listed on the government’s website have expired. Finally, support may be available in other forms for green improvements you want to make – this could be advice, mentoring, energy assessments or something else entirely. Read more 150 UK small business grants to apply for right now","filter_flag":1}
