{"title":"Soundproof and colorful acoustic products for walls and ceilings","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.archpaper.com%2f2024%2f06%2facoustic-products-walls-ceilings%2f&c=17498675867061907992&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.archpaper.com%2f2024%2f06%2facoustic-products-walls-ceilings%2f&c=17498675867061907992&mkt=en-us","summary":"The latest acoustic innovations for walls and ceilings offer an updated roster of shapes, sizes, and textures, including a new quilted acoustic material technology.","published":"Tue, 18 Jun 2024 02:58:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=18, tm_hour=2, tm_min=58, tm_sec=0, tm_wday=1, tm_yday=170, tm_isdst=0)","news_source":"archpaper","news_image":"http:\/\/www.bing.com\/th?id=OVFT.4kf_yM-2GKEg9O5IdjgvYC&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":525,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Soundproof and colorful acoustic products for walls and ceilings","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The latest acoustic innovations for walls and ceilings offer an updated roster of shapes, sizes, and textures, including a new quilted acoustic material technology.","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"Even the best-designed offices can benefit from additional noise reduction. The latest acoustic innovations for walls and ceilings offer an updated roster of shapes, sizes, and textures, including new quilted acoustic material technology. Many of these new products can be arranged to create dynamic patterns that not only capture sound but define work zones. Additionally, this selection prioritizes recycled content, impressive NRCs, and easy installation. MIO QuiltForms Mio Culture Polygon Cloud Kirei Tempo Loftwall Dulcet Panel Falcon","filter_flag":1}
{"title":"Apple’s New CO2 Neutral Products Are Cool, But Don’t Let Them Distract You From the Big Picture","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fgizmodo.com%2fgateway%2fapple-carbon-neutral-products-apple-watch-1850834303&c=14452986948866235256&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fgizmodo.com%2fgateway%2fapple-carbon-neutral-products-apple-watch-1850834303&c=14452986948866235256&mkt=en-us","summary":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday.","published":"Thu, 21 Sep 2023 17:53:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=17, tm_min=53, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","news_source":"Gizmodo","news_image":"http:\/\/www.bing.com\/th?id=OVFT.YixtM8q2AjdHA7Gpne906y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":200,"news_imagemaxheight":200,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple’s New CO2 Neutral Products Are Cool, But Don’t Let Them Distract You From the Big Picture","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday.","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday. Apple explained that it was able to reduce emissions from materials and transportation in production by having suppliers switch to renewable energy. The company also announced that it would no longer use leather in its new bands for Apple Watches, or for phone cases due to the high carbon footprint from the cattle industry. Instead, the company is using a material made from almost 70% recycled content that it’s calling FineWoven. Their sustainability message came with a skit in which Apple employees and CEO Tim Cook explained to Octavia Spencer, who plays Mother Nature, that the company is on track for all of its products to be carbon neutral by 2030. 2030 Status | Mother Nature | Apple But it turns out that having an entirely carbon-neutral product depends on the combination of items purchased. “Select case and band combinations of Apple Watch Series 9, Apple Watch Ultra™ 2, and Apple Watch SE® are Apple’s first-ever carbon neutral products,” a press release about the products explained. It’s great that a multinational business is working on lowering its emissions, but major corporations need to be held to higher standards that go beyond buying the right combination of things. Apple’s large target is carbon neutrality by 2030—that should be the most important metric that we judge the company by. On one end, Apple is definitely moving in the right direction to reach that goal. According to data from the company’s 2023 sustainability report, Apple produced about 20.6 million metric tons of carbon dioxide in 2022. Just half a decade earlier in 2018, the company produced 25.2 metric tons of carbon dioxide. The company has also paired lowering overall emissions with carbon credit programs that remove CO2 from the atmosphere by restoring grassland and wetland environments worldwide. “Only after Apple steeply cuts product emissions, will the company apply high-quality carbon credits from nature-based projects for emissions that cannot yet be avoided or reduced with existing solutions,” Apple said in a statement. According to the United States Geological Survey, wetlands are actually an amazing tool for carbon sequestration. Restoring and protecting these wetlands from erosion and vegetation loss could boost natural sequestration methods. However, these projects that Apple is investing in need to be permanent in order to claim that the project did remove carbon emissions from the atmosphere, according to the Natural Resources Defense Council. Apple is also working on developing AI tools that could rival options like OpenAI or ChatGPT, Bloomberg reported in July. If developed and widely used, chatbot tools could increase Apple’s water usage. Recent data found that other major tech companies have used alarming amounts of water to cool data centers. Data from Microsoft’s latest sustainability report outlined that the software giant’s water usage spiked by more than a third between 2021 and 2022 as the company heavily invested in its AI capabilities and planned for new AI-related data centers. It also takes up a lot of energy to train machine-learning models. A report released this April by the Stanford Institute for Human-Centered Artificial Intelligence outlined how the energy needed to train models like OpenAI’s GPT-3 is enough to power an average home in the U.S. for hundreds of years. Apple has put a lot of action behind making its products and operations increasingly sustainable. But companies often switch up their tactics or decide to delay sustainability deadlines. Everyone from consumers to watchdogs has to keep an eye out on corporations, well after a company releases a well-worded press release about lowering the emissions created by products. Want more climate and environment stories? Check out Earther’s guides to decarbonizing your home, divesting from fossil fuels, packing a disaster go bag, and overcoming climate dread. And don’t miss our coverage of the latest IPCC climate report, the future of carbon dioxide removal, and the invasive plants you should rip to shreds.","filter_flag":1}
{"title":"Standardised packaging could save up to 0.8 million tonnes of plastic waste","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fstandardised-packaging-could-save-0-121738357.html&c=18171147940906423423&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fstandardised-packaging-could-save-0-121738357.html&c=18171147940906423423&mkt=en-us","summary":"Extending the existing Plastic Packaging Tax (PPT), which mandates a minimum recycled content percentage in plastic packaging, could significantly boost recycling rates. Biffa suggests increasing the ...","published":"Mon, 24 Jun 2024 05:17:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=5, tm_min=17, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"YAHOO!Finance","news_image":"http:\/\/www.bing.com\/th?id=OVFT.aV9_VlB_J4rMYR_Bwmz75S&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":393,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Standardised packaging could save up to 0.8 million tonnes of plastic waste","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Extending the existing Plastic Packaging Tax (PPT), which mandates a minimum recycled content percentage in plastic packaging, could significantly boost recycling rates. Biffa suggests increasing the ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"A new report by sustainable waste management company Biffa highlights significant opportunities to reduce plastic packaging waste in the UK. The report, titled 'The UK Journey to Circularity', outlines a nine-point plan with achievable timelines for businesses, consumers, and the government. Standardisation of packaging materials across the country emerges as the largest potential contributor, with Biffa estimating that via adopting this, up to 0.8 million tonnes of plastic waste could be diverted from landfills by 2029. This process would involve designing products for easier recycling by using consistent materials throughout. Specifically, clear caps reduce contamination in recycled high-density polyethylene plastic, allowing bottles and caps to be recycled together into new products. The report acknowledges the role of government legislation in achieving the targets. Extending the existing Plastic Packaging Tax (PPT), which mandates a minimum recycled content percentage in plastic packaging, could significantly boost recycling rates. Biffa suggests increasing the mandated recycled content from the current estimated 40% to 75%, potentially saving an additional 0.5 to 0.75 million tonnes of plastic waste. Beyond standardisation and legislation, Biffa's plan explores other interventions: Shift towards reusable packaging: This could divert an estimated 0.13 million tonnes of waste from landfills. 'Consumer pays' schemes: Consumers paying for disposal services could incentivise responsible waste management, potentially recovering 0.35 million tonnes of waste. Investment in non-mechanical recycling technologies: New technologies could handle complex plastics that are currently unrecyclable, potentially saving another 0.35 million tonnes. Achieving these ambitious goals requires a multipronged approach, according to Carla Brian, head of Biffa Project Partnerships. “Requirements for new infrastructure are necessary but hinge on when, and to what extent, changes in the supply chain are made. Efforts to make plastic packaging more circular could simplify (with standardisation, for example) or lessen the burden on existing waste management infrastructure,” said Brian. Legislation plays a crucial role. Upcoming initiatives such as Simpler Recycling will lay the groundwork for a more circular economy while future legislation can further accelerate this progress. Overlapping policies, including deposit return schemes and extended producer responsibility, can achieve similar goals if implemented effectively. Educating businesses and consumers is also paramount. Story continues Highlighting the environmental, financial, and societal benefits of a circular economy can help drive behavioural change. Businesses already responsive to consumer demand for sustainable products and services will likely adapt faster to these changes. Finally, investment beyond infrastructure is essential. Funding research, development, and demonstration projects will help identify and validate best practices in circularity, paving the way for a more sustainable future. \"Standardised packaging could save up to 0.8 million tonnes of plastic waste \" was originally created and published by Packaging Gateway, a GlobalData owned brand. The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.","filter_flag":1}
{"title":"Amazon replaces plastic air pillows with recycled paper for North American packaging","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.lesprom.com%2fen%2fnews%2fAmazon_replaces_plastic_air_pillows_with_recycled_paper_for_North_American_packaging_113796%2f&c=13133765082057078597&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.lesprom.com%2fen%2fnews%2fAmazon_replaces_plastic_air_pillows_with_recycled_paper_for_North_American_packaging_113796%2f&c=13133765082057078597&mkt=en-us","summary":"Amazon is replacing plastic air pillows with recycled paper filler in North American packaging to address environmental concerns. The company has already replaced 95% of plastic air pillows in ...","published":"Mon, 24 Jun 2024 06:48:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=24, tm_hour=6, tm_min=48, tm_sec=0, tm_wday=0, tm_yday=176, tm_isdst=0)","news_source":"Lesprom Network","news_image":"http:\/\/www.bing.com\/th?id=OVFT._wBqljK5cgmMtad_Yb98SS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":393,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Amazon replaces plastic air pillows with recycled paper for North American packaging","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Amazon is replacing plastic air pillows with recycled paper filler in North American packaging to address environmental concerns. The company has already replaced 95% of plastic air pillows in ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"Amazon is replacing plastic air pillows with recycled paper filler in North American packaging to address environmental concerns. The company has already replaced 95% of plastic air pillows in delivery packaging and aims for full removal by the end of the year, company said in a statement. This initiative represents Amazon’s largest plastic packaging reduction effort in North America, avoiding nearly 15 billion plastic air pillows annually. By Prime Day this year, almost all customer deliveries will exclude plastic air pillows. Pat Lindner, VP of Mechatronics and Sustainable Packaging, highlighted the collaboration across Amazon to achieve this goal, emphasizing the focus on using recyclable materials.","filter_flag":1}
{"title":"‘You are the compass for a sustainable future’","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2frecyclinginternational.com%2fbusiness%2fbusiness-news%2fyou-are-the-compass-for-a-sustainable-future%2f57616%2f&c=17294171971172217586&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2frecyclinginternational.com%2fbusiness%2fbusiness-news%2fyou-are-the-compass-for-a-sustainable-future%2f57616%2f&c=17294171971172217586&mkt=en-us","summary":"Recyclers in Europe have been assured of a key role as the EU looks for greater circularity when it develops its industrial strategy over the next five ...","published":"Sun, 31 Dec 2000 16:00:00 GMT","published_parsed":"time.struct_time(tm_year=2000, tm_mon=12, tm_mday=31, tm_hour=16, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=366, tm_isdst=0)","news_source":"Recycling International","news_image":"http:\/\/www.bing.com\/th?id=OVFT.NMdzvinV8Xkw1nSgX_EdqS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":467,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"‘You are the compass for a sustainable future’","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Recyclers in Europe have been assured of a key role as the EU looks for greater circularity when it develops its industrial strategy over the next five ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"Recyclers in Europe have been assured of a key role as the EU looks for greater circularity when it develops its industrial strategy over the next five years. The commissioner responsible for the circular economy (CE), Aurel Ciobanu-Dordea, stressed the importance of both a CE and recyclers when speaking at the International Automobile Recycling Congress in Antwerp on 20 June. He also suggested the Waste Directive could be re-framed as a ‘resource’ directive when it is next reviewed. Ciobanu-Dordea’s wide-ranging address also floated the idea of lower taxes for recycled content in new products; embraced chemical recycling (CR) as a complement technology to mechanical recycling; and suggested more would be done to retain critical raw materials and other vital resources within the EU. ‘Tsunami’ of regulations He began by apologising for the previous ‘hectic four-to-five years’ when the European Commission had prepared a ‘tsunami’ of regulations in the wake of the Green Deal, saying he had listened to calls for greater predictability in future. ‘We will act in a more integrated way. We will try to make new proposals as a package because this will improve the conception. ‘In practice, CE models are still reserved to the pioneers and on the fringes of the economy. We need to make the fringes the mainstream. It should be the objective in the next decade that circularity and circular business models become more dominant. ‘We aim to work with you, with the industry,’ the commissioner told delegates. ‘You are likely to become the compass of a strategic economy and competitiveness.’ ‘Only solution‘ Ciobanu-Dordea acknowledged that the political complexion of Europe would be changing after the recent elections so the challenge was to persuade the new policy makers in the Parliament. He quoted recent Council statements that underlined circularity was ‘the only solution’ for the EU’s economy to survive. And in reference to the car dismantling sector, he added: ‘We need to retain steel, aluminium and plastic within the EU.’ Speaking of an imbalance between the markets for virgin materials and recyclates, the commissioner acknowledged it was not politically appealing to ‘tax virgin more’ but suggested recyclates could be taxed less alongside other measures could make them more attractive. During questions afterwards, Ciobanu-Dordea said lower taxes for recyclates was a ‘topic for active consideration; we need to reflect on this’. As for converting the Waste Directive to one about resources, he thought it was ‘a tall order – but we hear the call’. Big beasts Turning specifically to the forthcoming ELV Directive for end-of-life vehicles, the commissioner hoped it would enter into force by July 2025. He praised the recent work of the Belgian presidency in driving it forward and believed the subsequent Hungarian and Polish presidencies would maintain progress. But cautioned this would need the support of the automotive sector and the OEMs in particular. ‘Some of the big beasts of the car industry have engaged with us. But not everyone has and some have lobbied against us. We call on all manufacturers in Europe to find the median line that works for everybody.’ Ciobanu-Dordea thought that the proposed eco-design directive would ‘dovetail’ into the ELV directive in terms of the sustainability of steel, aluminium and tyres. Meanwhile, he expected the Single Use directive for plastics to recognise the use of CR for plastics and packaging. ‘Chemical recycling will play an important role as plastic exports from are removed,’ he said, while insisting that mechanical recycling would not be ‘economically intimidated’ by CR. He thought CR would be relevant for tyre recycling. The commissioner said the ELV sector could ‘count on our door remaining permanently open’. ‘We plan to stay engaged with you – together with the automotive industry. We want to make rapid progress but with progress supported by the industry.’","filter_flag":1}
{"title":"Let’s work together to end plastic pollution","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fcorporate.dow.com%2fen-us%2fpurpose-in-action%2fcircular-economy%2fplastics-treaty.html&c=9359478334830094049&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fcorporate.dow.com%2fen-us%2fpurpose-in-action%2fcircular-economy%2fplastics-treaty.html&c=9359478334830094049&mkt=en-us","summary":"The global plastics value chain is highly interlinked and interdependent. It will take every stakeholder – from resin producers to converters, brand owners, governments, communities, and waste ...","published":"Mon, 17 Jun 2024 18:14:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=17, tm_hour=18, tm_min=14, tm_sec=0, tm_wday=0, tm_yday=169, tm_isdst=0)","news_source":"Dow Chemical Company","news_image":"http:\/\/www.bing.com\/th?id=OVFT.qrCXOCSQWfTMIu2JfrHzVy&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":458,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Let’s work together to end plastic pollution","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"The global plastics value chain is highly interlinked and interdependent. It will take every stakeholder – from resin producers to converters, brand owners, governments, communities, and waste ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"Plastic waste has value. Today, science and economics have a way to take plastic waste, break it down into its basic building blocks and turn those building blocks into something useful again. There is immense growth potential in a recycling industry that includes evolved waste management systems. We estimate current rates of recycling growth could drive $60 to $90B in investments –with about $100B more for collection and sortation—all while creating about one million new jobs.1 What’s more, with these economic opportunities come more ways to reduce carbon emissions because plastics circularity and climate action go together. Expanding the use of circular feedstocks from plastic waste will contribute to the industry’s net zero goals by lowering carbon emissions in manufacturing products and packaging by reducing the amount of fossil fuels used in making them. Dow is also evaluating and revaluating manufacturing processes to produce packaging with as little carbon emissions as possible. We have a roadmap outlined which enables Dow to decarbonize our manufacturing while growing. This roadmap includes replacing end-of-life assets with high-efficiency, low-carbon assets. This includes a multi-generation site decarbonization plan for each of our top 12 sites globally – which account for ~90% of our emissions. For example, Dow announced plans to build the world’s first ever zero carbon emissions (scope 1 and 2) cracker complex in Ft. Saskatchewan, Alberta. As this new industry grows, Dow recognizes the need for a systems approach and is actively adopting new ways of working by investing in technologies, value chain partnerships, business models and waste management infrastructure. A global plastics pollution agreement can help accelerate the creation of a materials ecosystem and bring this system to scale. 1Estimates based on investment and job creation data from the U.S. Environmental Protection Agency, the American Chemistry Council, and The Recycling Partnership.","filter_flag":1}
{"title":"Latest Global Carpet Tile and LVT Collections from Interface Explore Crafted Textiles and Natural Forms","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240606965490%2fen%2f&c=18282542500131173389&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.businesswire.com%2fnews%2fhome%2f20240606965490%2fen%2f&c=18282542500131173389&mkt=en-us","summary":"Interface launches new global carpet tile and LVT collections that deliver more inspiration, climate progress, and performance.","published":"Thu, 06 Jun 2024 09:00:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=6, tm_hour=9, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=158, tm_isdst=0)","news_source":"Business Wire","news_image":"http:\/\/www.bing.com\/th?id=OVFT.b-46mcRs2UmlGHG10TPJXS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":365,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Latest Global Carpet Tile and LVT Collections from Interface Explore Crafted Textiles and Natural Forms","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Interface launches new global carpet tile and LVT collections that deliver more inspiration, climate progress, and performance.","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"ATLANTA--(BUSINESS WIRE)--Interface, Inc. (NASDAQ: TILE), the global flooring solutions company and leader in sustainability, today unveiled its latest global carpet tile and luxury vinyl tile (LVT) collections. The Etched & Threaded™ carpet tile and Earthen Forms™ LVT collections push the boundaries of design while continuing the company’s commitment to creating flooring solutions made for purpose and without compromise. The products offer innovative, modular tiles that fit together effortlessly and combine eye-catching textures, natural patterns, and neutral tones that can be mixed and matched, offering more ways to create high-performing, beautiful spaces. “We’re challenging how we think about flooring and its role in creating amazing spaces. Flooring can and should be Made for More™ – made to do more, made to support more, and made to stand for more,” said Kelly Simcox, Head of Global Design at Interface. “Interface designed these two global collections with this thinking in mind, helping architects and designers create dynamic spaces that encourage end-users to use the space to support their specific needs, from focused work to a moment for relaxation, and beyond. We created these collections to stand out and match the performance and sustainability needs of any space.” Etched & Threaded: Carpet Tile Crafted for Comfort Designed to bring the warmth of luxury textiles into commercial spaces, Etched & Threaded provides textured carpet tile products that fit together effortlessly. The collection features seven styles available in 12 neutral colorways that take cues from the geometric flow of natural stone to create serene environments. Etched & Threaded includes: Two bold, geometric styles that draw inspiration from natural stone formations and polished pebbles. They are offered as 50 cm x 50 cm formats in four colorways. Two timeless, textured styles, featuring large geometric patterns to create movement and pattern. They are offered as 25 cm x 1 m formats in eight colorways. Three texture-heavy products in cable knit, tweed, and threaded patterns that are perfect for large-scale use in commercial settings. They are available as 25 cm x 1 m formats in eight colorways. Interface has a 30-year history of taking the necessary steps to restore the planet and make progress toward its bold sustainability targets. Through innovations across its products, factories, and supply chain, the company has achieved the lowest carbon footprint carpet tile in the industry. Earthen Forms: LVT Designed for More Tapping into the warmth of natural woodgrain and the cool textures of travertine stone, Earthen Forms helps bring the outdoors in. With three styles available in a range of neutral hues and modular tile shapes, the collection features on-trend aesthetics with all the performance benefits designers expect from Interface LVT. The Earthen Forms styles include: Hearth, the collection’s stone and travertine-inspired style, adds soft texture to any space. It is offered in a 50 cm x 1 m format in four colorways. Crossroads, featuring a fusion of woodgrain and concrete aesthetics, provides a distinct, mixed material look to interiors. It is offered in a 25 cm x 1 m format in four colorways. On Grain, the true woodgrain style of the collection, features a warm, resilient design in a variety of light oak to rich wood hues. It is offered in a 25 cm x 1 m format in eight colorways. All three styles of the Earthen Forms collection feature Interface’s Ceramor+® ceramic bead coating, which minimizes everyday scratching and scuffing and provides enhanced slip resistance. This is the first Interface LVT collection with Ceramor+ available in all markets globally. In addition, as part of the company’s commitment to decarbonizing the built environment through product and supply chain innovation, Earthen Forms, like all Interface LVT, is made with 39% recycled content. Experience Why Interface Flooring is Made for More With Etched & Threaded and Earthen Forms, Interface continues its commitment to creating flooring solutions that never compromise on innovation, design, sustainability, and performance. The collections are complementary, offering choice and flexibility to designers looking to define space through texture, pattern, or color. Both are available now and can be experienced in Interface showrooms and at leading design industry events globally. Etched & Threaded and Earthen Forms will be featured in Interface’s Chicago showroom at 345 North Wells Street during NeoCon and Fulton Market Design Days. Visitors are invited to explore the space for a curated design experience where flooring applications, textures, and patterns are explored to spur creativity and excitement. The showroom features the new collections, plus products from FLOR and nora® rubber flooring, showing how Interface solutions are made for more inspiration, more climate progress, more performance, and for more ways to create purposeful spaces. To learn more about Interface and its portfolio of flooring solutions, visit www.interface.com. About Interface Interface, Inc., (NASDAQ: TILE) is a global flooring solutions company and sustainability leader, offering an integrated portfolio of carpet tile and resilient flooring products that includes Interface® carpet tile and LVT, nora® rubber flooring, and FLOR® premium area rugs for commercial and residential spaces. Made with purpose and without compromise, Interface flooring brings more sophisticated design, more performance, more innovation, and more climate progress to interior spaces. A decades-long pioneer in sustainability, Interface remains “all in” on becoming a restorative business. Today, the company is focusing on carbon reductions, not offsets, as it works toward achieving its verified science-based targets by 2030 and its goal to become a carbon negative enterprise by 2040. Learn more about Interface at interface.com and blog.interface.com, nora by Interface at nora.com, FLOR at FLOR.com, and the company’s sustainability journey at interface.com\/sustainability. Follow us on Facebook, Instagram, LinkedIn, X, and Pinterest.","filter_flag":1}
{"title":"From the SEE Impact Report: Q&A With Timi Fadiran, Ph.D.","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.csrwire.com%2fpress_releases%2f804321-see-impact-report-qa-timi-fadiran-phd&c=672191811188005885&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2fwww.csrwire.com%2fpress_releases%2f804321-see-impact-report-qa-timi-fadiran-phd&c=672191811188005885&mkt=en-us","summary":"Timi Fadiran, Ph.D. is a manager on SEE’s sustainability technology innovation team and is responsible for identifying and advancing new technologies to accelerate transitions to circular business ...","published":"Fri, 14 Jun 2024 10:47:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=14, tm_hour=10, tm_min=47, tm_sec=0, tm_wday=4, tm_yday=166, tm_isdst=0)","news_source":"CSR Wire","news_image":"http:\/\/www.bing.com\/th?id=OVFT.9W_uAxhK2QoZYtH5z7ZiNi&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":576,"news_imagemaxheight":556,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"From the SEE Impact Report: Q&A With Timi Fadiran, Ph.D.","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Timi Fadiran, Ph.D. is a manager on SEE’s sustainability technology innovation team and is responsible for identifying and advancing new technologies to accelerate transitions to circular business ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"Published 06-14-24 Submitted by SEE® Originally published in the SEE Impact Report 2022 Timi Fadiran, Ph.D. is a manager on SEE’s sustainability technology innovation team and is responsible for identifying and advancing new technologies to accelerate transitions to circular business models. He leads SEE’s collaboration efforts with advanced recycling technology providers, investigating the acceptability of essential packaging in these processes and establishing specifications for advanced recycling technologies. Timi was featured as one of America’s Change Makers in the American Chemistry Council’s campaign recognizing those who are leading sustainable change in the plastics industry. Why is circularity so important to SEE? Circularity may sound like a new term, but many of us have been practicing it for a while. Those who drop off shopping bags and other flexible plastics at storefront bins are participating in a form of circularity. We’re allowing those materials to be remade into new products. Many people understand it’s irresponsible to waste products and see the value in repurposing materials when they have reached end of use. This is why the concept of recycling is attractive to most consumers. Circularity is simply renewing or regenerating products rather than wasting and discarding them. SEE believes achieving circularity is critical to keeping plastic waste out of landfills and our environment, as well as reducing the need for fossil resources. SEE's packaging solutions are made to reduce waste, but we must continue to innovate to eliminate plastic waste. If we are not able to achieve circularity of flexible packaging, the problem of plastic waste will only continue to grow. How is SEE driving the industry in creating circular value chains that prevent waste, enable the recovery of materials, and reduce dependence on natural resources? SEE is uniquely positioned to drive circularity in the flexible packaging industry because of relationships with plastic producers and customers. Our position in the value chain allows us to understand the life cycle of products from raw materials manufacturing to final end use or disposal. SEE has established in-house testing capabilities to assess the recyclability of our products in the mechanical recycling infrastructure that exists today. We are also looking past the current recycling infrastructure and exploring emerging solutions such as advanced recycling (i.e., chemical or molecular recycling) to process hard-to-recycle plastic waste and remanufacture it into plastics that can be used over and over again. Advanced recycling refers to several technologies that use chemistry to enable a broader range of plastic products to be recycled, including hard-to-recycle flexibles with multiple layers and packaging solutions that have contacted food. SEE can further enable circularity by manufacturing its solutions with recycled content produced from recovered flexible packaging, thus reducing our dependence on natural resources. SEE is driving the industry through demonstrations such as the circular solution collaboration with ExxonMobil and Ahold Delhaize USA where food packaging waste was diverted from landfill, processed through an advanced recycling process, and attributed to new food-grade packaging materials for poultry. This collaboration demonstrated the technical, economic, and scalable feasibility of solutions based on advanced recycling and circular economy business models. In what ways has SEE been investing and collaborating to accelerate scalable circularity solutions? Investments and collaborations present opportunities to accelerate speed to market of scalable solutions while leveraging innovation to create a sustainable competitive advantage. SEE has participated in a number of projects that have proven advanced recycling is a viable circular solution for hard-to-recycle food packaging waste. SEE made an equity investment in 2020 in Plastic Energy (an industry-leading company in advanced recycling technology) to drive materials circularity and expand the recyclability of packaging. The research collaboration is ongoing and resulted in a successful closed-loop demonstration that took flexible plastics collected from store drop-off locations and recycled them into new food packaging. SEE has also made investments in the Alliance to End Plastic Waste and Closed Loop Partners to advance circularity initiatives that address plastic waste. SEE is a member of the REMADE Institute, which brings together industry innovators, academic researchers, trade organizations, and national labs to lead the transition to a circular economy in the U.S. Through the institute, we piloted a project with Michigan State University exploring the development of more effective ways to sort and clean contaminated plastic waste. Our activity in this space makes one thing clear: Collaboration is essential. No one member in the value chain can do this alone. Industry experts, competitors, academia, trade organizations, and other groups must work together to innovate, scale the lack of robust recycling infrastructure, and drive toward a more circular economy. Cross-collaboration is critical to solve the complex challenge of eliminating plastic waste. How are you and your team contributing to the SEE’s circularity efforts? My team is at the forefront of identifying and advancing new technologies such as pyrolysis and gasification to enable the recovery, processing, and repurposing of SEE's flexible packaging solutions. We collaborate with customers to understand their plastic-waste challenges, including the amount of different types of plastic in the waste they generate, the level of food contamination present in waste, and viable options for recycling plastic waste. We collaborate with circular technology providers to evaluate things such as the required preparation of plastic waste, the impact of hard-to-recycle flexible packaging made of multiple plastics, and the tolerance for food contamination in their processes. We use chemistry to help us determine the limits of hard-to-recycle plastics and food contamination in advanced recycling processes. We are working to establish new outlets for recycling flexible plastics and enabling SEE and its customers to achieve ambitious sustainability goals and reduce environmental impacts. Read the full SEE Impact Report 2022","filter_flag":1}
{"title":"Apple Arrives on the Scene With Its AI Debut","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fapple-arrives-scene-ai-debut-192957366.html%3ffr%3dsycsrp_catchall&c=1316174602925341314&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5cebb712435b960a8cc0dcd00323&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2fapple-arrives-scene-ai-debut-192957366.html%3ffr%3dsycsrp_catchall&c=1316174602925341314&mkt=en-us","summary":"In this podcast, Motley Fool host Dylan Lewis and analysts Jason Moser and Emily Flippen discuss: Apple's entrance to the world of AI, the details of Apple Intelligence, and the OpenAI partnership.","published":"Thu, 20 Jun 2024 12:29:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=20, tm_hour=12, tm_min=29, tm_sec=0, tm_wday=3, tm_yday=172, tm_isdst=0)","news_source":"YAHOO!Finance","news_image":"http:\/\/www.bing.com\/th?id=OVFT.BRaqgqRx-xEeFsE59skZKS&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700,"news_imagemaxheight":393,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple Arrives on the Scene With Its AI Debut","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"In this podcast, Motley Fool host Dylan Lewis and analysts Jason Moser and Emily Flippen discuss: Apple's entrance to the world of AI, the details of Apple Intelligence, and the OpenAI partnership.","query":"https:\/\/www.bing.com\/news\/search?q=\"Recycled content\" \"new products\"&format=rss","text":"In this podcast, Motley Fool host Dylan Lewis and analysts Jason Moser and Emily Flippen discuss: Apple 's entrance to the world of AI, the details of Apple Intelligence, and the OpenAI partnership. Tesla shareholders approving Elon Musk's pay package and plans to move to Texas, and what's next for the largest executive compensation plan of all time. The Fed's plan to hold steady on rates, and Adobe' s stellar quarter. Two stocks worth watching: Autodesk and Green Thumb Industries. Trex CEO Bryan Fairbanks talks through the state of outdoor decking and the company's plans to grow by replacing the average wood deck. To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video. Should you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $830,777!* Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*. See the 10 stocks » *Stock Advisor returns as of June 10, 2024 This video was recorded on June 14, 2024. Dylan Lewis: Apple makes a splash in AI, and the Fed holds steady. This week's Motley Fool Money radio show starts now. It's The Motley Fool Money radio show. I'm Dylan Lewis. Joining me in the studio, Motley Fool senior analysts, Emily Flippen and Jason Moser. Fools, great to have you both here. Jason Moser: Happy to be here. Emily Flippen: Hey, good to be here. Dylan Lewis: We've got the details on the biggest pay package in history, an early summer check in on the state of the decking market. Of course, stocks on our radar. We are going to be kicking off this week though with a rundown on the world of AI. Jason, we've been waiting a while, but we finally have a glimpse into Apple's AI ambitions. They unveiled some of their efforts at their Worldwide Developers Conference this week. What did you see? Story continues Jason Moser: Feels like there was a lot of emoji stuff, I guess. We're in this period of discovery. We're learning not just with Apple, but with AI in general, learning what all of the stuff can do, what is going to be most helpful versus what is more noise. Apple was, I guess, some might say a little late to the table. But that is done by intention. Tim Cook has said it before and he said it again, I think this week, he says, \"Our objective is never to be first. Our objective is to be best.\" They're not in a hurry, but they're looking to do it their way. It seems like this is an interesting first step. But I'm not sure how y'all felt, and I'd be interested to get your opinion on this. I know this was an important step for Apple. I do get that. It It definitely felt like one of those incremental phone updates. Like better camera, longer battery life. I wasn't overwhelmed. But by the same token, like I said, I know it's an important step, and it's just the first step. Dylan Lewis: Digging into some of the stuff that they unveiled, we had Genmoji, as you were alluding to, the generative AI application for emojis, a lot of GenAI and image stuff, Image Playground, and other one, Image Wand, all of these things, generating images based on inputs like sketches or text inputs from users. One of the things that I think was more interesting and a little bit more practical, Emily, as I was looking out at some of the things that they unveiled was the Apple Intelligence demo. This is their AI for the rest of us, their assistance on email writing. Things that seem to play a little bit more into how people use their phones and communicate. That seems like the most interesting part. But what chomped out to you? Emily Flippen: I love that AI for the rest of us, is a perfect way to describe it. It was extremely practical. I will say heading into this developer conference. I was incredibly skeptical. Apple is late to the AI game. Coming into this, I think expectations were incredibly high. We have all of these other big tech giants have been launching these really big ambitions in terms of how they're going to change the world as it comes to artificial intelligence. I think expectations were coming out. What is Apple going to do? What are they going to say? How are they going to change our lives? They really didn't change our lives. But they did do these little tiny incremental things to make our lives just a little bit easier. Interestingly enough, I actually think this could be great for them because ultimately, they're not an AI business. They're a hardware business. They want you to upgrade your cellphone. These little small changes. Summarizing your text messages, these little things that will get you to upgrade your phone, and I actually think they did a good job of selling people on that. I came out of this developer conference, pleasantly surprised, especially considering expectations were high coming into it. Dylan Lewis: A very big part of how Apple seems to want users to interact with AI is within the context of what the phone knows about you, your contacts, your messages, and they are bringing Apple intelligence into Siri, as well. One of the interesting pieces of this Jason is not only is there Apple intelligence, which I believe is home grown and their own system. They're also partnering up with OpenAI's ChatGPT, and we'll source to that and we disclose that to the user when they feel like they will be getting a better result that way. Interestingly enough, Apple users will not have to pay for ChatGPT. I look at this partnership, and I say, this is pretty interesting. Apple is saying, there's someone strong in this space. OpenAI, may be getting some distribution here from all these Apple users. Jason Moser: It sounds like not really any money changing hands for this, but it's absolutely a great opportunity for OpenAI just from a distribution perspective. The first thing it made me think of was just this idea that content creators would accept less money to produce a show on Netflix because they knew it was going out to the biggest audience because Netflix has so many subscribers. This could be one of those things here. Where OpenAI saying, listen, we'll take a little bit on the front end there and not have to worry so much about that short term profitability if it's going to get us into all of these devices. We're talking about hundreds and hundreds of millions of iPhones. I think Emily's right. This is going to be an opportunity for them to really convince us that we need to upgrade our phones. I think a lot of people have gotten tired with the, it's just a little bit of a better battery and maybe the camera is a little bit better, but is that a reason for me to upgrade? A lot of people are starting to say, no, this stuff could change that because ultimately, this is what Apple does. They figure out ways to make your phone more yours, more personal. If they can utilize these AI tools to do that even more, then it becomes a more compelling case for sure. Dylan Lewis: To your point, Jason, This AI system will be available on the iPhone 15 Pro, as well as the iPads and Macs with M1 chips and later. I think 90% of the existing iPhones out there would not qualify for these upgrades. They are providing a reason for people to upgrade. Having software fuel, a little bit of the hardware story. Emily, I do think this is an interesting opportunity for us to check in on OpenAI, because this is a company that we've seen so many headlines about. Generally, we've been interacting directly with ChatGPT. Interesting to see their software going out and being more widely distributed. This is not the only news though about this company this week. We also had updates on their executive suite. They'll be bringing Sarah Fryer formerly at Square over as their CFO. What do you think of the state of OpenAI at this point? Emily Flippen: I actually think in hindsight, this is a massive missed opportunity for OpenAI. The longer that I've had to reflect on this deal, the more that I think the value is truly held in Apple's hands here as opposed to OpenAI's. Despite the fact that they're bringing in presumably people who have a lot of experience, both with publicly traded companies, both with artificial intelligence, who have a lot of experience behind their belts. I will say, I think that this is great evidence, the fact that they did not get an exclusive deal with Apple, that Apple is still reportedly making partnerships with [Alphabet's] Google's Gemini, with Entropic. They're bringing other systems to Apple for free. OpenAI is presumably not getting any money as part of the deal, but they're still going to be paying for the servers, for all the people who are going to be upgrading their iPhone, who are going to be using their systems for free, they're still going to be paying for all that data. Hopefully, somebody does pay for OpenAI. They upgrade to their $20 month subscription through their iPhone, and maybe at some point, Apple gets a cut of that. But ultimately, I think OpenAI really doesn't have a mote here. That ultimately is the problem. Whereas Apple is just getting all of this great software for free. I don't know. I'm reflecting on this. I'm like, did Apple just beat everybody in AI by doing the absolute least? Jason Moser: I like that you brought up the mote question because 'cause I started to ask myself that as well. Just struck me we had a meeting our CEO was closing it out the other day, Tom Gardner. He just started rattling off all of these different LLMs, all of these different chatbot type functions. It feels like it's become very commoditized. Then, so it all boils down to what's the easiest to use, and what's the one that is going to hallucinate the least? Hopefully, getting out into that many devices will keep these things improving, and it will make sense more as time goes on. But when you think about OpenAI, not only are they not getting anything from this. They're still having to cut some serious cheques to Microsoft, just to keep their business open. It cost a lot of money to run that. I think I saw $700,000 a day, just to keep that thing running. That adds up. Dylan Lewis: It is interesting that regardless, Microsoft seems to win here, and Apple seems to be doing OK. Now that we have Apple at the AI party, you can check in on the different approaches here and some of the different things that the big tech companies have been doing. I know it's early days, Emily, but as you look out at the landscape in the AI race, is there anything that you think gives anyone an advantage here? Emily Flippen: I think there's two different approaches. We're seeing this approach from Apple, which is, I'm going to do the bare minimum in AI, which is going to say, what can I do to get consumers to do that hardware upgrade, improve their lives just a little bit, while also not doing the most. Well, I think Microsoft is out here saying, I'm going to do the most. OpenAI, obviously, that entire business model, but Microsoft is making waves this week because they actually had to delay the launch of one of their newest AR products, the recall system, which is very controversial screenshots, your computer as you're using it. There's a lot of privacy and security concerns. They are moving full force ahead. Some say AI at any cost. But you have to appreciate the fact that they are moving full steam ahead in what many perceived to be the future of the technology world. As what is one of the largest companies in the world, I can never keep track, who's ahead of who at this point, I think Apple surpassed them this week. You have to say to yourself, what is going to be the winning model here? Is it the least or is it the most? Because Apple and Microsoft have taken two completely different approaches. Dylan Lewis: It's interesting on the wake of that Microsoft news, seeing Apple really lean into the privacy and security part of the conversation with the Worldwide Developer Conference announcements. Alright, we're going to be back in a minute coming up after the break. We've got an update on Elon Musk's $50 billion pay package and a company that could be facing boom or bust with AI. Stay right here. This is Motley Fool Money. Ricky Mulvey: Ricky Mulvey with Motley Fool Money. I want to tell you about another podcast, though called the Next Wave. Whether you're just starting to explore AI or you're already using it in your business, the next wave provides the insights and guidance you need to confidently navigate this constantly shifting landscape. I checked out their episode titled My Google Search Isn't Going Anywhere with their guest Bilawal Sidhu. He's a former Google employee who worked on AR and VR projects there, super knowledgeable. Before listening, I didn't know that Google had a fleet of airplanes to go and collect data or how the tech giant is trying to avoid the innovator's dilemma. In the episode, you'll also learn about the impact of AI generated content on search results, the implications for advertising, and what could challenge Google search engine supremacy. Matt and Ethan also do a good job pacing their interviews, and they don't cut off their guest, which I really appreciate. There are more episodes available where you'll learn practical strategies for integrating AI into your business operations to drive growth and innovation. Search for the Next Wave in your favorite podcast app. That's the Next Wave. Dylan Lewis: Welcome back to Motley Fool Money. I'm Dylan Lewis. Joined here in studio by Motley Fool analysts Emily Flippen and Jason Moser. A Lot going on this week, including Tesla's annual meeting in Austin, Texas. A lot of different things for shareholders to weigh in on, a lot of proxy items. Chief among them, Elon Musk's 2018 compensation plan, Emily quick history lesson here. Earlier this year, a Delaware judge struck down the $50 billion pay package after finding its approval process flawed. Shareholders had an opportunity to weigh in. It won't supersede the judge's opinion in Delaware, but overwhelmingly, we saw support for the package. Emily Flippen: Musk went to the Court of public opinion this week, and he did win, which is impressive considering there were a lot of large institutional shareholders who publicly spoke out against this plan. Of course, we don't know how people voted, but they did come out and say, Hey, we think you should vote against this plan, that included the California State teacher Retirement System, as well as the Norwegian Sovereign Wealth Fund, as well as top proxy advisor, ISS. However, ultimately, retail investors, I think, if you are a shareholder of Tesla, you put a lot of faith into Elon Musk, who has fearlessly led this company since its founding days. Just because there is a large narrative around this business, obviously, Elon Musk and Tesla are constantly in the news. Ultimately shareholders are the people who decide these things. Not only do they approve this, I believe $56 billion if I'm not mistaken, pay package, but they also approved to move the headquarters from Delaware, where this judge did strike down the pay package to Texas. I do think there is some legal nuance there, so we'll see if that sticks, but it does show a lot of support from shareholders. Dylan Lewis: We'll have to see how this one plays out. There are a lot of wrinkles that could come up, but in so much as this is a referendum on Musk, it seems like he continues to have retail support, Jason. Jason Moser: I think so. Relatively speaking, Tesla is under held by institutional shareholders, a lot of retail and just everyday investors like us own a lot of that company. Stock price dictates everything. If you bought Tesla five years ago, you're probably feeling OK about this stocks up like 1,200%. If you bought it three years ago, one year ago, you're probably feeling a little bit differently with the stock down, the way it is. I think it's always worth keeping that perspective in mind. I think regardless, if you're a bull on Tesla, then Elon Musk is a large reason why. That's no secret. It's not surprising to see him get the support. Dylan Lewis: This week, we also got an update from the Fed on the rate picture. Fed officials indicating rates will stand right where they are, for the foreseeable future as the focus continues to be on moderating that stubborn last part of inflation. Emily, the Fed says there has been modest further progress toward the committee's 2% inflation objective. What say you? Emily Flippen: I will say, the market responded awfully positive to some of the news this week. CPI data came in lighter than expected. It was flat on a monthly basis and 3.3% higher on a yearly basis. This was, for once, slightly lower than expectations. Inflation is coming down a little bit and expectations were for a 0.1% rise on a monthly basis and a 3.4% rise on a yearly basis. That is so much barely lower than expectations. The fact that the market responded so positively surprises me a little bit. Then the Fed comes out and they say, I know the expectations were for us to lower rates three times this year, but maybe we'll do it once, and the market goes up. I'm sitting here scratching my head, saying, Am I crazy? But this doesn't sound good to me. Unemployment is rising, and inflation, it seems awfully sticky to me. When I look at the graph of how inflation has trended over the course of 2024, yes, it hasn't gotten worse, and that's great, but at the same time, it almost looks like it's stagnating. It hasn't come down as rapidly as I think a lot of people, including the Fed, have wanted it to come down. Investors seem to be rewarding it. I think at this point, we're coming in the mid half of the year here with no rate cuts. If you had told us that at the beginning of 2024, I think investors would have sold off pretty heavily. The fact that this has been responded so positively by the market, I'm just pretty surprised. I don't want to look a gift horse in the mouth, but this is awfully surprising to me. Dylan Lewis: I think about a month ago on the radio show, our colleague, Matt Argersinger said, maybe one rate cut, but let's be real. There's an entire possibility here that we have no rate cuts in 2024. Jason, as you look out to the macro picture, and are just thinking about how companies may be processing the rate environment, what are you looking at for the rest of the year? Jason Moser: You're right. It's persistent. Inflation is just sticky, and it's not going anywhere. These are better than expected numbers are just less bad than what maybe was expected. I saw with core inflation, that came down primarily because they saw moderation in car insurance prices, which have just been on fire lately. Anybody who's paying their car insurance bill, those things have been on a meteoric rise. Then I think also, I saw air fares came down as well. But for a general consumer is not feeling all that great right now. You've got well over half of the country that actually thinks we're in a recession right now. That's just polled data. Most people out there actually think we're in the middle of a recession right now. I saw a statistic posted by Amanda Kish on our site earlier that just referred to a recent TransUnion survey that now 84% of consumers list inflation as their top financial concern. That's compared to 79% just a year ago. Clearly, that narrative is only growing louder. I don't think numbers like these are going to cut it. I think one cut is the absolute best scenario, wouldn't shock me at all to see none. Dylan Lewis: As Emily mentioned, a pretty good week for the market, SMP up about 1.5%, and a particularly good week for Adobe shares up 15% after earnings this week. Pretty big reaction from a pretty big company here, Jason. What do you see in the results? Jason Moser: Well, they have several large platforms and their creative Cloud and Document Cloud and the Experience Cloud, where they're able to innovate and bring additional value. A big installed customer base out there. Emily raised a good question earlier this morning when we were going through what we were going to talk about here on the show. In regard to their investments in AI. Are these investments keeping them relevant, or are they being disrupted? I think judging from this quarter, it looks like the numbers are still telling a pretty positive story. Revenue 5.3 billion dollar, that was up 11% from a year ago, excluding currency impacts and non GAAP earnings per share, up 15% from a year ago. Strong performance in the Creative Cloud, that revenue grew 11%. I was impressed Document Cloud. That was 19%. I think they've been taking a little share from DocuSign with their recent stumbles. Keep an eye on that. Sherry purchases continue to bring the share account down. It's modest, but, 7% over the last five years, and that's good for shareholders, too. I think they're investing in AI early. That's the right thing to do. Back to that Apple discussion, we're just in this period of discovery. They need to be very careful of how they use that content in training their models. It sounds like they've, come full circle on that and are trying to make people feel better about privacy. But it seems like they're doing the right things. Dylan Lewis: Emily, Adobe is a battleground AI stock. It seems like AI is a little bit in the eye of the beholder. There are other companies like Duolingo that are also in a tough spot with AI. What are you looking for generally with companies to get a sense of how they're going to be shaken out? Emily Flippen: So long as that bottom line is growing faster than the top, I will not fault Adobe for it. That's what I look for. Dylan Lewis: Emily Flippen, Jason Moser, Fools, we'll see you a little bit later in the show. Up next, we're checking in on the market for decking and outdoor space with Trex CEO Bryan Fairbanks. Stay right here. You're listening to Motley Fool Money. Welcome back to Motley Fool Money. I'm Dylan Lewis. If you're like me, June means patio furniture is out on the deck, and the grill is set up for afternoons outside. Now that we're officially in summer season and busy season for decking company Trex, we caught up with the company's CEO Bryan Fairbanks, to get a read on how the outdoor project space is holding up during a tough renovation market and how the company's war on wood is going. Summertime feels like the perfect time for us to be chatting. I admittedly spent a solid six hours out on my deck this past Sunday hanging out, reading, taking in the sun. I know that there's no coincidence there. The warm weather months are a busier time for you guys and for your business. But there's also a lot of macro factors swirling right now in the space of real estate, in the space of renovation. What's the state of the business right now? How are you feeling? Bryan Fairbanks: You're right. Regardless of the state of the economy, good times or bad times, we are a highly seasonal business. Second and third calendar quarters of the year are when the vast majority of the decks get installed, and especially when you're talking about a DIY installer, they tend to have more time over the summer months, and we see that volume go through the roof during that time frame. From an economic perspective, we are continuing to see positivity from the consumer as it relates to repair and remodel spend, and looking at the deck as a relatively inexpensive way to add living space to their home. Today we've got an environment with higher priced homes, higher interest rates, yet people have the desire to make more of their existing space, and we continue to see momentum because of that. Dylan Lewis: I want to parse some of what I'm seeing from the likes of Home Depot and Lowe's and then what you're seeing with your business, because we see commentary from Home Depot's management saying, they're seeing consumers put some renovation plans on hold due to the financing environment, due to household budgets being a little bit tighter. Are you seeing any of that flow through to you guys as well? Bryan Fairbanks: Fortunately, only about 10% of people installing decks are using financing programs to be able to do that. It's not a significant driver of volume. The average Trex customer is different than the average customer walking into one of the home centers. We're tending to bring in a consumer who has a higher overall family income and is still active in repair and remodeling activities. I would expect there to be some difference between the overall average home center customer and then the Trex home center customer. We are continuing to see that those higher end customers, those with $150,000 and higher family income are continuing to see strength from there and buying our premium products. Dylan Lewis: Then over on the housing stats and permitting side, we've seen some activity die down a little bit, but as I understand it, most of your business is more in the remodeling and renovating side? Bryan Fairbanks: Yeah, that's correct. About less than 10% of our business is on the new home side of things, so the vast majority of it is going to be associated with repair and remodel. Whether that home gets it when it's brand new or not, it's still designed to receive that deck, especially where you've got water or slope. More often than not, it'll get a deck. If it gets a year later, two years later, that's fine, it gets counted as repair, remodel spend, rather than new home spending. Dylan Lewis: If I'm parsing everything you just said, a lot of the major macro trends that seem to be affecting the space are things that you feel a little bit of pinch from, but as a business, are not going to be as much of a headwind as they may be for some of the other major players and major industries in real estate and renovations? Bryan Fairbanks: Yeah, I think that's correct. If you had asked me a number of years ago that Bryan, we're going to be in a higher interest rate environment. Home prices are going to be extremely high or much higher than what they have been historically. I would have expected there to be more pressure on our business. The piece of it that's allowing us to continue performing well is that people are staying in those existing homes. It's difficult to be able to trade up to that next 500,000 square feet that the family usually wants to do every five or 10 years. Instead, they're building on that additional square footage, but doing it in an outdoor environment, which is very much on trend these days. Dylan Lewis: One of the things I wanted to check in with you on with the macro picture in the big picture is pricing. We've seen different markets and different industries over the past few years take very different approaches to the inflationary environment. Some companies being incredibly opportunistic looking to seize some of those extra margin that they're able to squeeze out, only to then have to become a little bit more value oriented recently. You guys are a premium product. How have you been thinking about pricing in this environment? Bryan Fairbanks: We took a very balanced view as we moved through the pandemic, and we saw the surge in inflation. In late 2021 and into 2022, we took the majority of our pricing, and then a little bit in 2023 time frame. A lot of questions that, hey, you probably could have taken more just from a pure opportunistic perspective, that's really not the way that we drive the company. Our profitability algorithm is first going to be looking at continuous improvement opportunities, second, efficiency within manufacturing, and third, going to be improving the utilization within our existing capacity. That's delivered well for Trex over the years, where we can provide for higher gross margins and higher EBITDA margins. But when we are faced with significant inflation that we can't offset with those programs, we will revert to pricing, and we did that in '21 and '22. We haven't seen a need to do that at that time. If we see inflation run 3 or 4%, there probably will be some pricing that we'll have to take in the coming years. If we see it drop back to that 2% or below, then there's probably less need for pricing. We're not looking at taking pricing just purely from an opportunistic perspective. Dylan Lewis: I know about 95% of material that you guys wind up putting into your decking is recycled. Is that something that wound up not really playing into higher input costs with the inflationary environment or did it? It's a unique supply chain for manufacturing. Bryan Fairbanks: You're right. It is very unique. We did see inflationary pressures on that recycled material. The reason for that was that virgin plastics went up quite significantly. Other manufacturers who in the past, maybe wouldn't have used recycled materials, elected to start using more of that, and therefore, the prices went up for it. Because there is now a stronger desire across all manufacturers and producers, for using recycled content, we've seen that price remain high. Virgin plastic went up, virgin plastic came back down again. What we've seen is with recycled materials we're buying, really, pretty much just held in that same spot. Fortunately, we've not had a significant amount of volatility. After that, it's held pretty steady. Also another rationale for not taking significant additional pricing. Dylan Lewis: When we had checked in with you a little over a year ago, one of the big themes in the conversation was normalization. I think that's probably been something that a lot of companies have been dealing with over the last couple of years. I think in your case, it was related to inventory channels, focusing a little bit more on product development. Where do you feel like you're at with those priorities now? Bryan Fairbanks: I feel as though 2024 is the year of normalization for the company. Like many companies, we were whipsawed during the pandemic. 2021, inventories were emptied out of the channel. We started to bring more capacity on. Our customers purchased as much as they could get to make sure that they weren't going to run out. By mid '22, the channel was now overstocked with material. Through the second half of 2022, we took that material back out of the channel again, '23, everybody was very conservative from where they needed to be from an inventory perspective. Bryan Fairbanks: Moving into 24, what we've told our customers is that between our disk distributors, and between tracks, that inventory will absolutely be there to service you, regardless of what happens in the marketplace. I think we've hit the right equilibrium again, where our distributors have plenty of material on the ground, we have the material on the ground. Nobody has an excess that we're concerned about at this point in the cycle. We feel good about getting back to more of a normal environment. Dylan Lewis: In that normal environment, what becomes the main focuses and priorities for you guys going forward? Bryan Fairbanks: First thing is making sure that when the season turns on during the second quarter, the appropriate amounts of inventory are in the channel. If the channel tries to bring all of that inventory in during the peak, it's very difficult to be able to receive all of those trucks. We have a hard time holding onto it on our ground just from a space perspective, so we want to make sure that we're staging it ahead of the season so it's ready to go. Next will be new product development. During our investor day last year, we talked about every 6-9 months, we'd be bringing new products to the market. It's a little bit different from the strategy that we've had over the past five years. The next five years will be heavily driven by product development. Since that time, we've launched additional colors with our transcend lineage, which has heat mitigating technology. One of the complaints in the composite industry is still about heat on the deck. We're coming up with solutions to reduce that heat impact. We've also launched a couple of railing lines. Our cable rail is just hitting the market now, and then our T-rail program, which is designed to go after the vinyl PVC marketplace, roughly a $300 million market by itself. We started shipping that last year, and we are seeing nice traction on those product lines. You'll continue to see more as we move forward. Dylan Lewis: I want to take a look at some of the big long-term growth opportunities for you guys. The US is a large chunk of your overall business, but you do sell to over 40 countries. You've talked about it being something where the reception's generally been good, but there's some education and branding work that you need to do on the international side. What is that opportunity looking like for you right now? How do you feel about the progress you've been making so far? Bryan Fairbanks: International markets from a decking perspective, are probably 10 years behind where things are in North America. Where we were education-wise, at that point, is where the international markets are. We tend to focus on the largest economies, highest GDP, highest family incomes as to where we're going to have the most success. Through the pandemic, it was quite a challenge for us to get the appropriate amount of product into those markets. We are starting to see things turn there. The European economy over the past couple of years has been challenged with war in the backyard, higher energy prices, higher inflation. But we are starting to see those markets turn again. Our focus is on those larger markets in Europe and Australia. As you mentioned, we do ship to over 40 countries, so if you're interested in a commercial project or need a container of material in any country, we're willing to work with them. We just won't be building websites or doing custom literature for those smaller market opportunities. But long-term, we've got great excitement over the opportunity, and over the next 10 years to bring that education level up to a similar level where we are in North America. Dylan Lewis: Over here at the Fool, we joke internally that the credit card companies are fighting the war on cash. That is their opportunity. Any transaction that's currently being used in cash is an opportunity for the credit card businesses. In your case, you are fighting the war on wood, in a sense. You are looking for replacements of conventional decking, and in recent results, you provided a little bit of an update on the breakdown between wood and alternatives. I think it's about a quarter of the market overall. Where do you see that sitting longer term as you're able to make in-roads, in all these growth markets you see? Bryan Fairbanks: Yeah. People talk about Trex being the number one player in the industry, and we are from a composite perspective. But from an overall perspective, wood is still number 1, by far, from a volume perspective. Wood today is about 75% of the market. Composites in total are about 25%, and Trex is about half of that 25% in total. We do not lose focus on where that largest opportunity. Anytime somebody is in the market for a deck, very likely they're talking about wood, how do we make sure that we're getting in front of that consumer to show them that there are great products available for them? Very affordable if they want to go with wood conversion, something like our enhanced basics, our enhanced naturals, anywhere between 2-3 times the price of wood, moving up to some of our more premium products that could be five or six times wood. It's more about the aesthetics and the performance of that deck board. But longer term, we've been seeing that wood conversion expand between 150 and 200 basis points a year of share coming over to the composite industry. I see a pathway upwards of 45-50% conversion. With the products that are in the market today, it will take time to get there. When we start seeing a pathway to get to those kind of numbers, like we've always done in the past before, we'll step back, we'll understand, what do we need to do next to keep this market moving forward? Dylan Lewis: If you ever need any help on the advertising side. I think you can just show people a video of me pressure-washing and staining my wood deck, that came with the place that I currently live in, every year-and-a-half, or so. I think that'll be a compelling pitch for anyone who's thinking about maybe going to the more traditional route. Bryan Fairbanks: That's usually our best customer. Somebody who's gone through that process just a couple of times. I will never install a wood deck again, and they're automatically buying a Trex deck the next time. Dylan Lewis: [laughs] That'll be me in a few years. I promise. [laughs] Listeners, hope you got somewhere cool to spend the warmer months. We're always looking for interview ideas. [MUSIC] If you have someone you think we should talk to for the show, shoot us a note at radio@fool.com. Coming up next, Emily Flippen and Jason Moser join me again with some stocks on their radar. Stay right here. You're listening to Motley Fool Money. [MUSIC] As always, people on the program may have interests in the stocks they talk about, and the Motley Fool may have formal recommendations for or against, so don't buy or sell anything based solely on what you hear. I'm Dylan Lewis, joined again in the studio by Emily Flippen and Jason Moser. Fools, we've got stocks on our radar coming up in a minute. But first, a fun one. Jason, every few years, we see a story about investing in sports. This week, that story was that Broncos linebacker, Baron Browning, will be offering stock in his NFL earnings through company Vestible. This keeps popping up. I feel like it's a little cyclical every couple of years one of these concepts comes up. What do you make of the investing in athletes? Jason Moser: Well, it feels like it's definitely in line with the way sports are being viewed these days, I think, as younger generations come into play here. It's more about the athlete, and less about the team, it feels like. You're following the athletes to wherever they go, fantasy, stuff like that. I definitely get it. I'd be a little concerned with the staying power. I could see maybe, I'm a little bit more attracted to something like music. I wouldn't mind owning a couple of shares of Widespread Panic [laughs] but hey, you know, I love innovation in the space. That's for sure. Dylan Lewis: Emily, Jason is going music rather than sports. If I can give you the ability to invest in any celebrity, any category. Where are you going? Emily Flippen: I like Jason's point about staying power, which leads me, I've been watching a lot of Netflix recently. I'm going to go with the Netflix reality star circle. I want to be able to buy stock in that group of entertainment stars. The Love Island USA crowd or the Bachelor Franchise. How do I buy into their earnings? Because those people are making bank. [laughs] Dylan Lewis: I like that even in the investing hypothetical, Emily is sticking with the tried and true. Buy what you know. [laughs] Emily Flippen: Exactly. Exactly. I don't have to watch sports to make money, please. Dylan Lewis: Let's get over to stocks on our radar. Our man behind the glass, Dan Boyd, is going to hit you with a question. Jason, you're up first. What are you looking at this week? Jason Moser: Yeah. Autodesk, ticker ADSK. They reported earnings this week, shares traded up modestly higher on the report. For those who are unfamiliar, Autodesk provides software tools like AutoCAD, computer aided design tools for architects, engineers, construction professionals all over, runs the gamut there. But revenue was up 13%. They saw remaining performance obligations up 9%. Ultimately bringing a little bit more down to the bottom line, they saw non-GAAP operating margin expand three percentage points, and ultimately, earnings per share grew just under 21%. Encouraging from that perspective. It's been a very slow start to the year for Autodesk, they had a recent investigation into previous financial statements. Part of that was due to a change in how they were pricing with their partners. But that's been all resolved. There will be no restatements, so now you've got a business that can focus a little bit more on the future, and that's a good thing. Dylan Lewis: Dan, a question about Autodesk. Dan Boyd: I'm actually already an Autodesk shareholder. Jason Moser: As am I. Dan Boyd: It has been a little bit of a rough ride, so I'm glad to hear some good news. Jason Moser: Me too, Dan. Me too. I'll keep you up to speed. Dylan Lewis: All right. There we go. Some support from Dan early on in stocks on our radar. Emily, what is on your radar this week? Emily Flippen: I had something a bit more fun than boring old Autodesk. Please. Dan, I want you to hear about Green Thumb Industries. The ticker is GTBIF. It's traded over the counter, and it's one of the best-performing US-based multi-state operators. It is a cannabis company, actually. Believe it or not, hear me out, it is profitable, it produces 5% GAAP net income margins, and that's after paying out more than 10% of its total revenue in taxes. That is hopefully going to change this year with rescheduling. You can buy it and hopefully see that that net income is going to increase here in the relatively near future with the rescheduling of cannabis and the change in tax laws. Dylan Lewis: Dan, a question or comment about Green Thumb Industries. Dan Boyd: I mean, the stock chart, though, Emily, over this is wild. Emily Flippen: Are you a Fool, Dan? What do you mean the stock chart? Since when do you look at stock charts and make your decision that way? Dan Boyd: [laughs] That's a good point. The whole marijuana industry definitely has some tailwinds right now. But this is the kind of thing I look at and I'm just like, what is going on? Dylan Lewis: Dan, I got to put you on the spot. Which one's going on your watchlist? Dan Boyd: I'm going to go Green Thumb. I mean, Autodesk is already there. Dylan Lewis: Yeah, he already owns it. That's going to do it for this week's Motley Fool Money Radio Show. This show is mixed by Dan Boyd. I'm Dylan Lewis. Thank you for listening. We'll see you next time. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Dan Boyd has positions in Autodesk. Dylan Lewis has no position in any of the stocks mentioned. Emily Flippen has positions in Green Thumb Industries and Home Depot. Jason Moser has positions in Adobe, Alphabet, Apple, Autodesk, and Home Depot. Ricky Mulvey has positions in Home Depot, Netflix, and Trex. The Motley Fool has positions in and recommends Adobe, Alphabet, Apple, Autodesk, Duolingo, Green Thumb Industries, Home Depot, Microsoft, Netflix, Tesla, and Trex. The Motley Fool recommends Lowe's Companies and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy. Apple Arrives on the Scene With Its AI Debut was originally published by The Motley Fool","filter_flag":1}
