{"title":"ZTE joins the Science-Based Targets Initiative - ZTE","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lnp0ZS5jb20uY24vZ2xvYmFsL2Fib3V0L25ld3MvenRlLWpvaW5zLXRoZS1zY2llbmNlLWJhc2VkLXRhcmdldHMtaW5pdGlhdGl2ZS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lnp0ZS5jb20uY24vZ2xvYmFsL2Fib3V0L25ld3MvenRlLWpvaW5zLXRoZS1zY2llbmNlLWJhc2VkLXRhcmdldHMtaW5pdGlhdGl2ZS5odG1s0gEA?oc=5","id":"CBMiXGh0dHBzOi8vd3d3Lnp0ZS5jb20uY24vZ2xvYmFsL2Fib3V0L25ld3MvenRlLWpvaW5zLXRoZS1zY2llbmNlLWJhc2VkLXRhcmdldHMtaW5pdGlhdGl2ZS5odG1s0gEA","guidislink":false,"published":"Wed, 24 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=144, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lnp0ZS5jb20uY24vZ2xvYmFsL2Fib3V0L25ld3MvenRlLWpvaW5zLXRoZS1zY2llbmNlLWJhc2VkLXRhcmdldHMtaW5pdGlhdGl2ZS5odG1s0gEA?oc=5\" target=\"_blank\">ZTE joins the Science-Based Targets Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZTE<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ZTE joins the Science-Based Targets Initiative - ZTE","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vd3d3Lnp0ZS5jb20uY24vZ2xvYmFsL2Fib3V0L25ld3MvenRlLWpvaW5zLXRoZS1zY2llbmNlLWJhc2VkLXRhcmdldHMtaW5pdGlhdGl2ZS5odG1s0gEA?oc=5\" target=\"_blank\">ZTE joins the Science-Based Targets Initiative<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZTE<\/font>","source.href":"https:\/\/www.zte.com.cn","source.title":"ZTE","query":"https:\/\/news.google.com\/rss\/search?q=\"Emission Reduction Strategies\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Shenzhen, China, May 24, 2023 - ZTE Corporation (0763.HK \/ 000063.SZ), a global leading provider of information and communication technology solutions, has officially announced its participation in the Science-Based Targets Initiative (SBTi) and conducted a commitment signing ceremony. Aligning with the initiative's guidelines, ZTE will establish science-based emission reduction targets in the near term and strive for long-term net-zero emissions. Over the course of 5-10 years, ZTE aims to achieve significant reductions in greenhouse gas emissions in line with the 1.5°C temperature rise limitation pathway and ultimately reach net-zero emissions by 2050 at the latest. At the commitment signing ceremony, Mr. Wang Xiang, Senior Vice President and Chief Strategy Officer of ZTE, signed the pledge to the SBTi. Distinguished guests, including Mr. Lin Guoen, Vice Chairman of Deloitte China; Mr. Zhuang Binghan, Vice President of the Marketing Group at Intel; Mr. Hong Xiongbin, Regional General Manager of SGS Limited; and Mr. Ma Qi, Executive Deputy General Manager of Great Wall Power Technology Co., Ltd., representing valued suppliers, were in attendance, bearing witness to this significant milestone. SBTi is recognized as one of the world's most influential emission reduction mechanisms. Launched in 2015 by the collaboration of the World Wide Fund for Nature (WWF), the Carbon Disclosure Project (CDP), the World Resources Institute (WRI), and the United Nations Global Compact (UNGC), this initiative provides businesses with a well-defined and scientifically derived pathway to effectively reduce emissions. By aligning with the goals of the Paris Agreement, the SBTi empowers companies to proactively mitigate climate change's adverse impacts by implementing scientifically grounded emission reduction strategies. As a leader in the information and communication industry, ZTE has consistently been dedicated to reducing its operational and value chain emissions. Through continuous technological innovation, ZTE strives to enhance the energy efficiency of its products and solutions. Moreover, its Green ICT infrastructure empowers diverse industries to achieve energy savings and carbon reduction. In 2022, ZTE achieved an impressive 7.48% reduction in overall carbon emissions compared to the previous year while maintaining revenue growth. This accomplishment was made possible through the implementation of comprehensive and multidimensional energy-saving and emission reduction measures. The announcement of ZTE joining the Science-Based Targets Initiative (SBTi) this time marks a significant milestone in the Company's carbon neutrality journey. Following the introduction of its visionary \"Digital Economy Green Road\" strategy in 2021, ZTE is now committed to working closely with SBTi to develop tailored emission reduction action plans. These plans will cover various domains, including corporate operations, product research and development, manufacturing, and supply chain management. By aligning with the SBTi guidelines and leveraging its expertise in technological innovation, ZTE aims to make a substantial contribution to driving global economic growth towards a greener and more sustainable future. The Company firmly believes in the power of collaboration and collective action to address climate change challenges and create a positive impact on both human society and the natural environment. ABOUT ZTE: ZTE helps to connect the world with continuous innovation for a better future. The company provides innovative technologies and integrated solutions, its portfolio spans all series of wireless, wireline, devices and professional telecommunications services. Serving over a quarter of the global population, ZTE is dedicated to creating a digital and intelligent ecosystem, and enabling connectivity and trust everywhere. ZTE is listed on both the Hong Kong and Shenzhen Stock Exchanges. www.zte.com.cn\/global FOLLOW US: Facebook www.facebook.com\/ZTECorp Twitter www.twitter.com\/ZTEPress LinkedIn www.linkedin.com\/company\/zte YouTube https:\/\/www.youtube.com\/@ZTECorporation MEDIA INQUIRIES: ZTE Corporation Communications Email: ZTE.press.release@zte.com.cn","filter_flag":1}
