{"title":"Apple’s New CO2 Neutral Products Are Cool, But Don’t Let Them Distract You From the Big Picture","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2fgizmodo.com%2fgateway%2fapple-carbon-neutral-products-apple-watch-1850834303&c=14452986948866235256&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2fgizmodo.com%2fgateway%2fapple-carbon-neutral-products-apple-watch-1850834303&c=14452986948866235256&mkt=en-us","summary":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday.","published":"Thu, 21 Sep 2023 17:53:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=21, tm_hour=17, tm_min=53, tm_sec=0, tm_wday=3, tm_yday=264, tm_isdst=0)","news_source":"Gizmodo","news_image":"http:\/\/www.bing.com\/th?id=OVFT.YixtM8q2AjdHA7Gpne906y&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":200.0,"news_imagemaxheight":200.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Apple’s New CO2 Neutral Products Are Cool, But Don’t Let Them Distract You From the Big Picture","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday.","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Sequestration\" \"new products\"&format=rss","text":"Apple announced what it’s calling its first-ever carbon-neutral products during its Wanderlust event this Tuesday. Apple explained that it was able to reduce emissions from materials and transportation in production by having suppliers switch to renewable energy. The company also announced that it would no longer use leather in its new bands for Apple Watches, or for phone cases due to the high carbon footprint from the cattle industry. Instead, the company is using a material made from almost 70% recycled content that it’s calling FineWoven. Their sustainability message came with a skit in which Apple employees and CEO Tim Cook explained to Octavia Spencer, who plays Mother Nature, that the company is on track for all of its products to be carbon neutral by 2030. 2030 Status | Mother Nature | Apple But it turns out that having an entirely carbon-neutral product depends on the combination of items purchased. “Select case and band combinations of Apple Watch Series 9, Apple Watch Ultra™ 2, and Apple Watch SE® are Apple’s first-ever carbon neutral products,” a press release about the products explained. It’s great that a multinational business is working on lowering its emissions, but major corporations need to be held to higher standards that go beyond buying the right combination of things. Apple’s large target is carbon neutrality by 2030—that should be the most important metric that we judge the company by. On one end, Apple is definitely moving in the right direction to reach that goal. According to data from the company’s 2023 sustainability report, Apple produced about 20.6 million metric tons of carbon dioxide in 2022. Just half a decade earlier in 2018, the company produced 25.2 metric tons of carbon dioxide. The company has also paired lowering overall emissions with carbon credit programs that remove CO2 from the atmosphere by restoring grassland and wetland environments worldwide. “Only after Apple steeply cuts product emissions, will the company apply high-quality carbon credits from nature-based projects for emissions that cannot yet be avoided or reduced with existing solutions,” Apple said in a statement. According to the United States Geological Survey, wetlands are actually an amazing tool for carbon sequestration. Restoring and protecting these wetlands from erosion and vegetation loss could boost natural sequestration methods. However, these projects that Apple is investing in need to be permanent in order to claim that the project did remove carbon emissions from the atmosphere, according to the Natural Resources Defense Council. Apple is also working on developing AI tools that could rival options like OpenAI or ChatGPT, Bloomberg reported in July. If developed and widely used, chatbot tools could increase Apple’s water usage. Recent data found that other major tech companies have used alarming amounts of water to cool data centers. Data from Microsoft’s latest sustainability report outlined that the software giant’s water usage spiked by more than a third between 2021 and 2022 as the company heavily invested in its AI capabilities and planned for new AI-related data centers. It also takes up a lot of energy to train machine-learning models. A report released this April by the Stanford Institute for Human-Centered Artificial Intelligence outlined how the energy needed to train models like OpenAI’s GPT-3 is enough to power an average home in the U.S. for hundreds of years. Apple has put a lot of action behind making its products and operations increasingly sustainable. But companies often switch up their tactics or decide to delay sustainability deadlines. Everyone from consumers to watchdogs has to keep an eye out on corporations, well after a company releases a well-worded press release about lowering the emissions created by products. Want more climate and environment stories? Check out Earther’s guides to decarbonizing your home, divesting from fossil fuels, packing a disaster go bag, and overcoming climate dread. And don’t miss our coverage of the latest IPCC climate report, the future of carbon dioxide removal, and the invasive plants you should rip to shreds.","filter_flag":1}
{"title":"Bayer to deliver ten blockbusters in ten years","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2fwww.futurefarming.com%2fcrop-solutions%2fweed-pest-control%2fbayer-to-deliver-ten-blockbusters-in-ten-years%2f&c=7615618010601593472&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2fwww.futurefarming.com%2fcrop-solutions%2fweed-pest-control%2fbayer-to-deliver-ten-blockbusters-in-ten-years%2f&c=7615618010601593472&mkt=en-us","summary":"Bayer aims to launch ten blockbuster products in the next ten years to support farmers worldwide, the company announced at its 2024 Crop Science innovation update in Chicago. According to Bayer ...","published":"Tue, 25 Jun 2024 00:30:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=25, tm_hour=0, tm_min=30, tm_sec=0, tm_wday=1, tm_yday=177, tm_isdst=0)","news_source":"futurefarming","news_image":"http:\/\/www.bing.com\/th?id=OVFT.I4SIUPat8en_mjNcB1PJCy&pid=News","news_imagesize":"w={0}&h={1}&c=14","news_imagemaxwidth":700.0,"news_imagemaxheight":466.0,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Bayer to deliver ten blockbusters in ten years","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Bayer aims to launch ten blockbuster products in the next ten years to support farmers worldwide, the company announced at its 2024 Crop Science innovation update in Chicago. According to Bayer ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Sequestration\" \"new products\"&format=rss","text":"Bayer aims to launch ten blockbuster products in the next ten years to support farmers worldwide, the company announced at its 2024 Crop Science innovation update in Chicago. According to Bayer farmers will benefit from new technologies that will help them produce more while restoring nature through innovations that power regenerative agriculture. Bayer considers regenerative agriculture as an outcome-based production model, with improving soil health as a key component, leading to increased resilience. Other key aspects include increased productivity; adaption and mitigation of climate change through reductions in greenhouse gas emissions; increased carbon sequestration in the soil; maintaining, preserving or restoring on-farm biodiversity; conserving water resources through improved water retention, reduction in water run-off, as well as improved social and economic well-being of farmers and their communities. Regenerative agriculture Bayer’s R&D pipeline is driving the transformation to regenerative agriculture through three pillars. The first is through an annual portfolio refresh of new germplasm and new crop protection formulations that help farmers compete in a changing environment. The second pillar refers to completely new products like seed and trait technologies or novel crop protection solutions with blockbuster potential, fueling stable long-term growth. The third pillar consists of key collaborations on technologies like gene editing and biological solutions with strategic partners that are complementing Bayer’s in-house R&D efforts. Preceon Smart Corn System With the Preceon Smart Corn System farmers will benefit from better protection of their crops, better access during the season and higher yields. Bayer’s 2023 Groundbreaker trials in the U.S., which included 365 growers, resulted in more than 80 percent reporting they would plant Preceon Smart Corn again. The targeted commercial launch of the conventional breeding short-stature corn approach earlier this year is also paralleled with progress on the biotech version which has now advanced to R&D phase 4. Biologicals are complementing synthetic products Bayer has accelerated its Biologicals R&D pipeline substantially. Through multi-year strategic research and development partnerships with Ginkgo Bioworks, Kimitec, MustGrow and others, Bayer is accelerating the delivery of breakthrough biological innovations in the areas of next-generation nitrogen fixation, crop protection and biostimulant products – all while continuing to deliver innovative new products through leading development platforms. Ibisio, a biological bird control which uses black pepper oleoresin as its active ingredient, was advanced to Phase 4 and is expected to launch in Europe where it will help to protect freshly sown fields prevent attacks from crows, pigeons, pheasants and other birds. In 2023, about 20 percent of the total corn area in the EU and the UK was protected with a seed treatment solution including bird repellents and there are very few remaining crop protection products to address the problem. Join 17,000+ subscribers Subscribe to our newsletter to stay updated about all the need-to-know content in the agricultural sector, two times a week. \"*\" indicates required fields Email * First name * Phone This field is for validation purposes and should be left unchanged. Ed Asscheman Online editor Future Farming","filter_flag":1}
{"title":"Fact.MR: Industrial Hemp Market Soars from $6.6 Billion to $25.7 Billion by 2034, Fueled by Sustainable Innovation","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2fwww.finanznachrichten.de%2fnachrichten-2024-06%2f62470524-fact-mr-industrial-hemp-market-soars-from-dollar-6-6-billion-to-dollar-25-7-billion-by-2034-fueled-by-sustainable-innovation-008.htm&c=3405586039097572527&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2fwww.finanznachrichten.de%2fnachrichten-2024-06%2f62470524-fact-mr-industrial-hemp-market-soars-from-dollar-6-6-billion-to-dollar-25-7-billion-by-2034-fueled-by-sustainable-innovation-008.htm&c=3405586039097572527&mkt=en-us","summary":"Industrial Hemp Playing Key Role in Carbon Sequestration and Soil Remediation Aligning with ... paving the way for exciting new products and applications. The automotive industry is also exploring the ...","published":"Wed, 12 Jun 2024 03:30:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=12, tm_hour=3, tm_min=30, tm_sec=0, tm_wday=2, tm_yday=164, tm_isdst=0)","news_source":"Finanznachrichten","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fact.MR: Industrial Hemp Market Soars from $6.6 Billion to $25.7 Billion by 2034, Fueled by Sustainable Innovation","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"Industrial Hemp Playing Key Role in Carbon Sequestration and Soil Remediation Aligning with ... paving the way for exciting new products and applications. The automotive industry is also exploring the ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Sequestration\" \"new products\"&format=rss","text":"Industrial Hemp Playing Key Role in Carbon Sequestration and Soil Remediation Aligning with Sustainable Farming Practices ROCKVILLE, Md., June 12, 2024 \/PRNewswire\/ -- Based on a new research report by Fact.MR, worldwide sales of Industrial Hemp Market are estimated to reach US$ 6.6 billion in 2024. By 2034, this market is anticipated to skyrocket to a staggering US$ 25.7 billion, driven by a steady CAGR of 14.5% from 2024 onward. Demand for industrial hemp is skyrocketing as more and more industries recognize its versatile and sustainable properties. Once overlooked, this remarkable crop is now being embraced for its myriad uses across various sectors. From textiles and construction materials to biofuels and nutritional supplements, hemp's applications are seemingly endless. Environmentally conscious consumers are driving much of this demand, as hemp requires minimal pesticides and herbicides, making it an eco-friendly choice for sustainable farming. Its ability to sequester carbon dioxide and remediate contaminated soil further adds to its appeal. Moreover, hemp's durability, lightweight nature, and renewable qualities make it an attractive alternative to traditional materials in manufacturing. Request a Sample of this Report: https:\/\/www.factmr.com\/connectus\/sample?flag=S&rep_id=3989 As awareness of hemp's benefits continues to spread, industries are investing in research and development to unlock its full potential. With its multi-faceted applications and sustainable credentials, industrial hemp is poised to become a cornerstone of the green economy, meeting the growing demand for environmentally responsible products and practices. Key Takeaways from the Market Study: Based on nature, sales of organic hemp are estimated to reach a valuation of $3.2 billion in 2024. The market in Mexico is evaluated to expand at a CAGR of 13.6% from 2024 to 2034. Revenue from sales of industrial hemp in East Asia is projected to reach $5.9 billion by the end of 2034. The South Korean market is evaluated to reach a valuation of $1.4 billion by the end of 2034. North America is analyzed to hold a global market share of 24.3% by 2034. \"Use of industrial hemp in textiles, medicines, and food, coupled with global sustainability trends, is creating opportunities for suppliers. Governments worldwide are collaborating to boost global hemp distribution,\" says a Fact.MR analyst. Increasing Awareness of Therapeutic Potential of Hemp in Medical Applications Once relegated to the fringes, industrial hemp is rapidly emerging as a sustainable wonder crop, fueling a wave of cutting-edge innovations across diverse industries. As researchers and entrepreneurs unlock its vast potential, hemp is proving to be a versatile and eco-friendly resource, paving the way for exciting new products and applications. The automotive industry is also exploring the use of hemp fibers as a reinforcement material for lighter, stronger, and more sustainable car parts. These natural fiber composites could reduce vehicle weight, improving fuel efficiency and reducing emissions. In the field of biotechnology, scientists are harnessing the unique properties of hemp to develop innovative products. For instance, researchers are exploring the use of hemp-derived compounds, such as cannabidiol (CBD), for their potential therapeutic applications in various medical conditions. Japan's Industrial Hemp Market Poised for Rapid Growth The industrial hemp market in Japan is projected to grow at a compound annual growth rate (CAGR) of 15.1% from 2024 to 2034, with the country expected to hold a 29.4% market share by the end of the period. Increased investment in research is crucial for unlocking the full potential of industrial hemp. Research efforts may focus on improving hemp genetics for higher yield and quality, optimizing cultivation practices, and exploring innovative applications such as advanced nanomaterials or pharmaceuticals. This investment fosters innovation and establishes a foundation for the hemp industry's long-term growth and competitiveness in an ever-evolving market. Get Customization on this Report for Specific Research Solutions: https:\/\/www.factmr.com\/connectus\/sample?flag=RC&rep_id=3989 Expanding Opportunities in the United States Industrial Hemp Market The industrial hemp market in the United States offers abundant opportunities for stakeholders to broaden their product portfolios. Beyond traditional uses like textiles and oils, there is significant potential for hemp-based products to evolve into biodegradable polymers, eco-friendly packaging, and even biofuels. This diversification, a prominent trend in the industrial hemp market, not only targets emerging markets but also positions hemp as a versatile and sustainable resource with applications across various industries. More Valuable Insights on Offer: Fact.MR, in its new offering, presents an unbiased analysis of the industrial hemp market for 2019 to 2023 and forecast statistics for 2024 to 2034. The study divulges essential insights into the market based on nature (organic, conventional), product type (fiber, seeds), and end use (food & beverages, consumer textiles, personal products, industrial applications, hemp CBD, supplements, other consumer products), across seven major regions of the world (North America, Latin America, Eastern Europe, Western Europe, East Asia, South Asia & Pacific, and MEA). Check out More Related Studies Published by Fact.MR Research: Hemp-Based Products Market is expected to reach $1.8 billion in 2023 and jump to a size of $16.2 billion by 2033. Cannabis Infused Drinks Market is predicted to race ahead and end up at US$ 8.7 billion by 2032. Ready-to-use Therapeutic Food Market to surge from $459.9M in 2024 to $800.6M by 2034, driven by 5.7% CAGR, marking substantial growth. Specialty Fat and Oil Market will hit $85.94 billion by 2034 with a 4.6% Annual Growth Rate. Baking Ingredient Market is set to reach $41.48 billion by 2034, Driven by 6.5% Annual Growth Rate. Infant Milk Formula Market: From Growth Spurts to Baby Boom - Projected Surge to $22.35 Billion by 2034. About Us: Fact.MR is a distinguished market research company renowned for its comprehensive market reports and invaluable business insights. As a prominent player in business intelligence, we deliver deep analysis, uncovering market trends, growth paths, and competitive landscapes. Renowned for its commitment to accuracy and reliability, we empower businesses with crucial data and strategic recommendations, facilitating informed decision-making and enhancing market positioning. With its unwavering dedication to providing reliable market intelligence, FACT.MR continues to assist companies in navigating dynamic market challenges with confidence and achieving long-term success. With a global presence and a team of experienced analysts, FACT.MR ensures its clients receive actionable insights to capitalize on emerging opportunities and stay ahead in the competitive landscape. Contact: 11140 Rockville Pike Suite 400 Rockville, MD 20852 United States Tel: +1 (628) 251-1583 Sales Team : sales@factmr.com Follow Us: LinkedIn | Twitter | Blog View original content:https:\/\/www.prnewswire.co.uk\/news-releases\/industrial-hemp-market-soars-from-6-6-billion-to-25-7-billion-by-2034--fueled-by-sustainable-innovation-302170602.html","filter_flag":1}
{"title":"Aemetis Appoints India Subsidiary Chief Executive Officer to Lead Corporate Growth Initiatives","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2faemetis-appoints-india-subsidiary-chief-120000603.html&c=11973720724694950720&mkt=en-us'}]","link":"http:\/\/www.bing.com\/news\/apiclick.aspx?ref=FexRss&aid=&tid=667b5d046d0443dda3b5f644fb2dc868&url=https%3a%2f%2ffinance.yahoo.com%2fnews%2faemetis-appoints-india-subsidiary-chief-120000603.html&c=11973720724694950720&mkt=en-us","summary":"CUPERTINO, CA - () - June 18, 2024 - Aemetis, Inc. (NASDAQ: AMTX), a renewable natural gas and renewable fuels company focused on low and negative carbon intensity products, today announced the ...","published":"Tue, 18 Jun 2024 05:01:00 GMT","published_parsed":"time.struct_time(tm_year=2024, tm_mon=6, tm_mday=18, tm_hour=5, tm_min=1, tm_sec=0, tm_wday=1, tm_yday=170, tm_isdst=0)","news_source":"YAHOO!Finance","news_image":null,"news_imagesize":null,"news_imagemaxwidth":null,"news_imagemaxheight":null,"title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Aemetis Appoints India Subsidiary Chief Executive Officer to Lead Corporate Growth Initiatives","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"CUPERTINO, CA - () - June 18, 2024 - Aemetis, Inc. (NASDAQ: AMTX), a renewable natural gas and renewable fuels company focused on low and negative carbon intensity products, today announced the ...","query":"https:\/\/www.bing.com\/news\/search?q=\"Carbon Sequestration\" \"new products\"&format=rss","text":"CUPERTINO, CA - (NewMediaWire) - June 18, 2024 - Aemetis, Inc. (NASDAQ: AMTX), a renewable natural gas and renewable fuels company focused on low and negative carbon intensity products, today announced the appointment of Sanjeev Duggal as the Managing Director and Chief Executive Officer of Universal Biofuels Private Limited, the India-based subsidiary of Aemetis, Inc. Mr. Duggal will join the company officially on July 1, 2024. Before joining Aemetis, Mr. Duggal was the Managing Director at NTPC GE Power Services Limited for 4 years and was an executive at GE in India for 11 more years. He previously worked for 8 years at the global diesel engine and power solutions company, Cummins, Inc., in the U.S. in business development and as a manager of corporate treasury. \"The rapid growth of our subsidiary in India has positioned the company for a potential initial public offering to fund further expansion of biodiesel production capacity while adding sustainable aviation fuel and renewable diesel as new products,\" stated Eric McAfee, Chairman and CEO of Aemetis, Inc. \"Sanjeev's background as the top executive at GE's power solutions joint venture in India, as well as leading roles at Cummins, provides important relationships with government and oil marketing company customers in India. We look forward to further success and the rapid expansion of our India business under his leadership.\" \"I look forward to joining the company in order to lead operational growth as well as pursuing the IPO of the India subsidiary,\" said Sanjeev Duggal, the incoming Managing Director and CEO of Universal Biofuels. \"Renewable fuels are growing rapidly in India, but the industry is still at an early stage of growth and is expected to expand significantly in order to meet India's goals for energy independence, improved air quality and reducing greenhouse gas emissions.\" Universal Biofuels is currently shipping biodiesel under a $150 million, one year allocation by the three India government-owned oil marketing companies that distribute fuels in India. India's National Policy on Biofuels states a 5% goal for biodiesel blending by 2030, a substantial increase from the 0.5% usage in 2018 when the policy was first adopted. Aemetis built, owns and operates a 60 million gallon per year capacity biodiesel plant with a refined glycerin facility and a 50 million gallon per year tallow refining facility on the east coast of India near the port of Kakinada in Andhra Pradesh. Growth initiatives include the export of tallow to the U.S. as feedstock for sustainable aviation fuel (SAF) and renewable diesel (RD) production, as well as the production of SAF and RD in India to meet expanding demand. Story continues About Aemetis Headquartered in Cupertino, California, Aemetis is a renewable natural gas, renewable fuel and biochemicals company focused on the operation, acquisition, development and commercialization of innovative technologies that replace petroleum-based products and reduce greenhouse gas emissions. Founded in 2006, Aemetis is operating and actively expanding a California biogas digester network and pipeline system to convert dairy waste into renewable natural gas. Aemetis owns and operates a 65 million gallon per year ethanol production facility in California's Central Valley near Modesto that supplies about 80 dairies with animal feed. Aemetis owns and operates a 60 million gallon per year production facility on the East Coast of India producing high quality distilled biodiesel and refined glycerin for customers in India and Europe. Aemetis is developing a sustainable aviation fuel (SAF) and renewable diesel biorefinery in California to utilize renewable hydrogen, hydroelectric power, and renewable oils to produce low carbon intensity renewable jet and diesel fuels. For additional information about Aemetis, please visit www.aemetis.com. Safe Harbor Statement This news release contains forward-looking statements, including statements regarding assumptions, projections, expectations, targets, intentions or beliefs about future events or other statements that are not historical facts. Forward-looking statements include, without limitation, projections of financial results in 2024 and future years; statements relating to the development, engineering, financing, construction and operation of the Aemetis biodiesel, ethanol, biogas, SAF and renewable diesel, and carbon sequestration facilities; the potential IPO of our India subsidiary; growth initiatives; and our ability to promote, develop and deploy technologies to produce renewable fuels and biochemicals. Words or phrases such as \"anticipates,\" \"may,\" \"will,\" \"should,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"predicts,\" \"projects,\" \"showing signs,\" \"targets,\" \"view,\" \"will likely result,\" \"will continue\" or similar expressions are intended to identify forward-looking statements. These forward-looking statements are based on current assumptions and predictions and are subject to numerous risks and uncertainties. Actual results or events could differ materially from those set forth or implied by such forward-looking statements and related assumptions due to certain factors, including, without limitation, competition in the ethanol, biodiesel and other industries in which we operate, commodity market risks including those that may result from current weather conditions, financial market risks, customer adoption, counter-party risks, risks associated with changes to federal policy or regulation, and other risks detailed in our reports filed with the Securities and Exchange Commission, including our Annual Reports on Form 10-K, and in our other filings with the SEC. We are not obligated, and do not intend, to update any of these forward-looking statements at any time unless an update is required by applicable securities laws. External Investor Relations Contact: Kirin Smith PCG Advisory Group (646) 863-6519 ksmith@pcgadvisory.com Company Investor Relations\/ Media Contact: Todd Waltz (408) 213-0940 investors@aemetis.com","filter_flag":1}
