{"title":"SABIC and Partners Unveil Renewable In-Mold Labeling Solution for Food Packaging - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxMDctc2FiaWMtYW5kLXBhcnRuZXJzLXVudmVpbC1yZW5ld2FibGUtaW4tbW9sZC1sYWJlbGluZy1zb2x1dGlvbi1mb3ItZm9vZC1wYWNrYWdpbmfSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxMDctc2FiaWMtYW5kLXBhcnRuZXJzLXVudmVpbC1yZW5ld2FibGUtaW4tbW9sZC1sYWJlbGluZy1zb2x1dGlvbi1mb3ItZm9vZC1wYWNrYWdpbmfSAQA?oc=5","id":"CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxMDctc2FiaWMtYW5kLXBhcnRuZXJzLXVudmVpbC1yZW5ld2FibGUtaW4tbW9sZC1sYWJlbGluZy1zb2x1dGlvbi1mb3ItZm9vZC1wYWNrYWdpbmfSAQA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxMDctc2FiaWMtYW5kLXBhcnRuZXJzLXVudmVpbC1yZW5ld2FibGUtaW4tbW9sZC1sYWJlbGluZy1zb2x1dGlvbi1mb3ItZm9vZC1wYWNrYWdpbmfSAQA?oc=5\" target=\"_blank\">SABIC and Partners Unveil Renewable In-Mold Labeling Solution for Food Packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SABIC and Partners Unveil Renewable In-Mold Labeling Solution for Food Packaging - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihAFodHRwczovL3d3dy5wYWNrYWdpbmdzdHJhdGVnaWVzLmNvbS9hcnRpY2xlcy8xMDQxMDctc2FiaWMtYW5kLXBhcnRuZXJzLXVudmVpbC1yZW5ld2FibGUtaW4tbW9sZC1sYWJlbGluZy1zb2x1dGlvbi1mb3ItZm9vZC1wYWNrYWdpbmfSAQA?oc=5\" target=\"_blank\">SABIC and Partners Unveil Renewable In-Mold Labeling Solution for Food Packaging<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"End-of-life recycling\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"SABIC, a global leader in the chemical industry, has partnered with three specialists in the field of in-mold labeling (IML) to demonstrate the use of certified renewable polypropylene (PP) resins in high quality mono-PP thin-wall container packaging without compromising quality, processability, safety or convenience. The single-step IML technology achieves a seamless part decoration right in the injection mold, where the label becomes an integral component of the packaging itself. Dedicated label film types and high-definition printing technology result in a very attractive and cost-effective decorative solution. Besides using certified renewable PP resins for both the molded parts and the label film, the resulting packaging can be recycled in existing rigid PP recycling streams. “The demand for in-mold labeled packaging is constantly growing across various different consumer market segments, as it provides major opportunities for cost effective and highly sustainable solutions,” said Abdullah Al-Otaibi, General Manager, ETP & Market Solutions at SABIC. “Together with the responsibly sourced and certified renewable polymers from our TRUCIRCLE™ portfolio, this flexible decoration technology has enormous potential in fully recyclable mono-material packaging with no compromise on shelf visibility and consumer appeal in the retail space. At the same time, it can help manufacturers and brand owners reduce their environmental impact and carbon footprint while addressing the need for preventing valuable used plastic from ending up as waste.” The label material for the IML containers is a biaxially oriented polyethylene (BOPP) film produced by Taghleef, a leading global supplier of films solutions to customers worldwide, using a SABIC® certified renewable resin tailored to the BOPP process. BOPP films are widely used for in-mold labeled injection molding applications in food, dairy and beverages, home, beauty and personal care packaging. Taghleef offers transparent, white and metalized PP label films, which can all be produced using polymers with bio-based feedstock. Furthermore, they can easily be customized to meet specific needs of gravure or offset printing for desired haptic textures and visual appearance, from glossy, matt, orange peel or velvet feel to an entirely non-label look. “Our BOPP film range for in-mold-labeling gives brand owners a wide choice of premium packaging finishes to enhance brand differentiation and shelf visibility with a low environmental impact,” added Monica Battistella, Sustainability Manager at Taghleef. “In combination with the sustainable nature of SABIC’s mass balance certified renewable polymer from second-generation feedstock, the exceptional printability, die-cutting, anti-static and non-stick properties of these films deliver maximum value throughout the entire life cycle of the labeled products, including end-of-life recycling.” As part of the present collaboration, the final BOPP label film is supplied to Karydakis, a leading specialist in optimized printing techniques, ink formulations and conversion technologies tailored to PP-based in-mold labels. The company’s sophisticated process delivers high-quality labels pre-printed with captivating designs and branding elements to match end customer specifications and ensure the effortless integration with the containers throughout the molding process. “With this collaborative initiative, we are demonstrating the feasibility of bio-based materials in the production of high-quality IML labels,” stated Giorgos Karydakis, General Manager at Karydakis IML S.A. “We offer our customers a wide range of attractive printing options for cups, tubs, jars, shakers and pails in sizes from 50 ml to 50 liters, including additional digital watermarking with material information in line with the European HolyGrail 2.0 initiative for smart automated mechanical recycling.” \"In-mold labeling offers substantial productivity benefits, since it eliminates the need for separately applied adhesive labels on the finished packaging product by forming a permanent, tamper proof bond with the container right in the mold,” explained Augustinos Kotronis, General Manager at Kotronis Packaging. “In addition, the renewable container material from SABIC complies with all relevant international standards for food-contact applications, while showing excellent processability on our machines, including high flowability for reduced wall thicknesses. Moreover, it meets with our targets for reducing both CO2 emissions and fossil consumption.\" Cut to shape for stacking, the IML labels are finally supplied to Kotronis, a medium-sized family business specializing in injection molded containers for food products. Here, they facilitate the efficient in-mold labeling of cups and tubs in a seamlessly integrated and fully automated, single-step process. This IML solution will be on display at Taghleef’s Booth 4C35 during Labelexpo in Brussels from September 11-14.","filter_flag":1}
{"title":"ALUMOBILITY OUTLINES 8 REASONS WHY ALUMINUM IS THE MATERIAL OF THE FUTURE FOR AUTOMAKERS - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FsdW1vYmlsaXR5LW91dGxpbmVzLTgtcmVhc29ucy13aHktYWx1bWludW0taXMtdGhlLW1hdGVyaWFsLW9mLXRoZS1mdXR1cmUtZm9yLWF1dG9tYWtlcnMtMzAxOTE5MDk2Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FsdW1vYmlsaXR5LW91dGxpbmVzLTgtcmVhc29ucy13aHktYWx1bWludW0taXMtdGhlLW1hdGVyaWFsLW9mLXRoZS1mdXR1cmUtZm9yLWF1dG9tYWtlcnMtMzAxOTE5MDk2Lmh0bWzSAQA?oc=5","id":"CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FsdW1vYmlsaXR5LW91dGxpbmVzLTgtcmVhc29ucy13aHktYWx1bWludW0taXMtdGhlLW1hdGVyaWFsLW9mLXRoZS1mdXR1cmUtZm9yLWF1dG9tYWtlcnMtMzAxOTE5MDk2Lmh0bWzSAQA","guidislink":false,"published":"Wed, 06 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=249, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FsdW1vYmlsaXR5LW91dGxpbmVzLTgtcmVhc29ucy13aHktYWx1bWludW0taXMtdGhlLW1hdGVyaWFsLW9mLXRoZS1mdXR1cmUtZm9yLWF1dG9tYWtlcnMtMzAxOTE5MDk2Lmh0bWzSAQA?oc=5\" target=\"_blank\">ALUMOBILITY OUTLINES 8 REASONS WHY ALUMINUM IS THE MATERIAL OF THE FUTURE FOR AUTOMAKERS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ALUMOBILITY OUTLINES 8 REASONS WHY ALUMINUM IS THE MATERIAL OF THE FUTURE FOR AUTOMAKERS - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FsdW1vYmlsaXR5LW91dGxpbmVzLTgtcmVhc29ucy13aHktYWx1bWludW0taXMtdGhlLW1hdGVyaWFsLW9mLXRoZS1mdXR1cmUtZm9yLWF1dG9tYWtlcnMtMzAxOTE5MDk2Lmh0bWzSAQA?oc=5\" target=\"_blank\">ALUMOBILITY OUTLINES 8 REASONS WHY ALUMINUM IS THE MATERIAL OF THE FUTURE FOR AUTOMAKERS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"End-of-life recycling\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Global association launches new white paper entitled: When it Comes to Aluminum, Less is More ZURICH, Sept. 6, 2023 \/PRNewswire\/ -- One of the most important reasons the use of aluminum is rapidly gaining traction in the automotive industry is because aluminum has one-third the density of steel, according to Alumobility's recent white paper: When it Comes to Aluminum, Less is More. When comparing two identical vehicles with equal stiffness and load-carrying capacity-- one made of aluminum, the other of steel--the aluminum vehicle body will be up to 45% lighter, which provides many advantages that will affect the future of the automotive industry. Alumobility Alumobility's Technical Director, Professor Mark White outlines the Top 8 Reasons Why When it Comes to Aluminum, Less is More, which are highlighted in Alumobility's newly published white paper of the same name. LESS WEIGHT = MORE EFFICIENCY: There are efficiency advantages of aluminum lightweighting in Battery Electric Vehicles (BEVs) as well as Internal Combustion Engine (ICE) vehicles. ICE vehicles manufactured from aluminum have better mileage, consume less fuel and produce less emissions. BEV's do not run on fossil fuels but still require energy to move so the lighter weight of an Aluminum Intensive Vehicle (AIV) improves range capability. Because electric vehicle batteries can weigh as much as 2000 pounds, automakers are embracing the lightweighting benefits of aluminum as the market shifts to electrification. LESS WEIGHT = MORE SECONDARY SAVINGS: A lighter aluminum body means a car can use smaller parts, including brakes, suspension parts, batteries, motors, yet achieve the same acceleration, performance and range with less emissions. (INQUIRE WHETHER ALL PARTS ARE SMALLER) In BEV's, smaller batteries translate not only to greater range in traveling but also less extraction of raw materials and chemicals for manufacturing, which helps to protect the earth's resources. The overall manufacturing of AIVs versus steel is more efficient in terms of materials and labor. This means that in addition to primary weight savings of, for example, 160 kg which is achieved by replacing 400 kg of steel with 240 kg of aluminum, the vehicle will also have another 40 to 60 kg savings in the weight of other materials savings. LESS WEIGHT = MORE SAFETY: It is a common misconception that heavy cars are safer than light ones, but lighter weight AIVs are safer than those made of steel. Aluminum absorbs more energy that steel per Kg (lb.), so a lightweight aluminum vehicle can even be safer for the occupant than a comparable steel-based vehicle. When kinetic energy is absorbed in a controlled manner, vehicle occupants will be better protected from intrusion into the safety cell. In addition to being safer for vehicle occupants, an AIV is safer for everyone else--occupants of other vehicles, cyclists and pedestrians, as it carries less mass into any accident, therefore less energy to be absorbed. LESS WEIGHT = MORE DURABILITY: Since aluminum vehicles are lighter, they create less friction on key components such as tires and brakes. Less friction means that materials such as rubber and plastic emit fewer particle emissions and with less wear and tear, are expected to have a longer vehicle lifespan. LESS CORROSION = MORE YEARS IN SERVICE: Automotive grades of aluminum alloys are less prone to corrosion due to the self-healing, protective barrier that forms in milliseconds when cracked, dented, or deformed. Unlike automotive steel grades, which are inherently susceptible to rust and rely on protective systems for durability, aluminum does not need a protective coating, even in severe environments. LESS WEIGHT = MORE PAYLOAD AND TOWING CAPACITY: Pick-up trucks, SUVs and last mile delivery vehicles manufactured from aluminum can carry more cargo and\/or have the potential for overall weight reduction compared to a steel reference vehicle. The lighter weight vehicles made of aluminum have a reduced impact on the roads, protecting an older infrastructure from extra wear and costly repairs. The lightweight aluminum body and chassis can enable secondary weights savings and result in lower cost per mile in running costs. LESS COMPLEXITY = MORE EFFICIENCY IN MANUFACTURING: Compared to a steel-intensive vehicle, the process to manufacture an AIV requires fewer parts, translating to less complexity. AIVs require less of the following: tools, robots, joints, energy, factory emissions, less inventory, capital and sealers. These parts will be made from fewer alloys, allowing for simpler end-of-life recycling. More than 90% of a vehicle's aluminum can be recovered and recycled--so an aluminum-intensive car at the end of its life can be recycled and practically made into another car body. LESS WASTE = MORE CIRCULARITY: More sustainable than steel, aluminum is infinitely recyclable without a loss in its qualities, including lightness, durability and formability. Recycling aluminum scrap in a closed loop process allows vehicle manufacturers to reduce their carbon emissions immediately while end-of-life recycling offers an opportunity for future reductions. Steel is recyclable but it is important to know that it melts at 1400 degrees centigrade whereas aluminum melts at less than half that temperature, at 650 degrees. Since vehicles are manufactured with 600 kg or less of aluminum for every metric ton of steel, the energy savings of aluminum are noteworthy. In conclusion, there are numerous benefits for accelerating aluminum use in motor vehicles. As outlined, infinitely recyclable, lightweight aluminum provides clearly defined advantages demonstrating its superiority as the material of the future for mobility. About the Author : Professor Mark White is Technical Director for Alumobility. In this role, he provides strategic guidance to the technical work streams, overseeing Alumobility's studies and related partnerships and presents them at various conference and events where he is a sought-after speaker, revered for his expertise. With more than 30 years of automotive experience, predominantly at Jaguar Land Rover, White has held a variety of leadership roles in body engineering, design, research, vehicle manufacturing processes and electrification. Throughout his career, he has focused on reducing overall vehicle weight, particularly in the car body and related systems, through the application of lightweight materials and part integration to achieve better performance at a lower cost. White received an Honors Degree in Automotive Design from Coventry University and was awarded a Doctor of Engineering in 2011 for work on lightweight structures. He is a Professor at Brunel University London and the Industry Advisory Board Chairman for the Brunel Centre for Advanced Solidification Technology (BCAST). About Alumobility: Alumobility is a global ecosystem of leading aluminum and downstream technology partners that supports automotive manufacturers in creating lighter, safer, smarter and more sustainable vehicles. The non-profit association was founded to focus on technical studies to advance the adoption of aluminum automotive body sheet (ABS). Alumobility is helping to fulfill the promise of a lighter, more efficient, more sustainable mobility future. Media Contact: [email protected] Natalia Freeman +1 561 690 4241 SOURCE Alumobility","filter_flag":1}
{"title":"The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion - Retail TouchPoints","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA","guidislink":false,"published":"Tue, 19 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=262, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5\" target=\"_blank\">The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail TouchPoints<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion - Retail TouchPoints","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5\" target=\"_blank\">The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail TouchPoints<\/font>","source.href":"https:\/\/www.retailtouchpoints.com","source.title":"Retail TouchPoints","query":"https:\/\/news.google.com\/rss\/search?q=\"End-of-life recycling\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"In the U.S. alone, up to 85% of all textiles end up in landfills every year, largely driven by inefficient and outdated practices during the product design and development stages. At the same time, global consumption of fashion has increased by 400%, while overall usage of products has dropped by about 40%. These are all realities that Coach has had to face head on as one of the top fashion and leather goods brands in the world. The brand has worked for many years to improve the sustainability of its operations and mitigate its environmental impact across the value chain. While these efforts, including the Coach Re(Loved) repair and refurbishment initiatives, have been critical, they weren’t sufficient, explained Joon Silverstein, SVP of Global Marketing, Creative and Sustainability at Coach and Head of Coachtopia during the Retail Influencer CEO Forum in New York City. Through the creation of Coachtopia, a new brand that operates separately from the core Coach business, the brand is tapping into its rich legacy while embracing a start-up mentality to completely rethink the way fashion items are designed, crafted and recycled. “Fundamentally, we needed to address the core challenge of fashion, which is that it is a linear and unsustainable system,” Silverstein said. “We had to face that realization head on, that Coach is part of that linear, unsustainable system contributing to climate change. And therefore, the only way to truly transform our impact was to rethink the end-to-end system; to go outside the linear system and think about how to reimagine it in a circular way.” Although Coachtopia has only existed since April 2023, the brand has made a big splash and has helped Coach stand out as a pioneer in the circular fashion industry. And it also quickly is becoming a fan favorite among Gen Z consumers. With sights set on growth, Coachtopia is ensuring its approach to circularity is clear, impactful and scalable. The business currently operates as a separate sub-brand so it could operate as a startup and “think radically about rethinking the system and ways of working to pioneer circularity,” Silverstein said. But the goal ultimately is to apply and scale these learnings so Coach can be circular too. “As we develop learnings and scalable processes that will feed back into Coach and Coachtopia, we’ll move on to tackle additional problems,” Silverstein said. “The whole purpose is eventually to move Coach and the overall industry.” Creating a Brand that Gen Z Loves Aesthetically, Coachtopia is a brand designed for Gen Z. Colorful charm necklaces are reminiscent of summer camp art projects and the brand’s “Wavy Dinky” handbag comes in a range of out-there patterns — from cherries to mushrooms and checkerboard. But this “fun and cool” vibe isn’t the only draw for Gen Z, according to Silverstein. Coachtopia aims to create a “more hopeful vision” that relies on Gen Z’s active participation to grow and thrive. “The way we engage Gen Z is part of the brand’s success,” Silverstein said. “We always think about the ‘what’ and the ‘why,’ but the ‘how’ is equally important to us. And it’s powered by community. Since the earliest days, when Coachtopia was just a nugget in our brain before we even named it, we had engaged a growing group of Gen Z across all walks of life: Designers, climate activists, journalists, filmmakers, entrepreneurs, fashion enthusiasts, people who care. And we’ve been pressure testing and involving them and co-creating with them at every step.” Coachtopia partnered with JUV Consulting, a Gen Z consulting agency, to better engage and resonate with Gen Z communities. The brand taps these community insights to garner feedback and perspectives that will drive the future of the brand. This “holistic community” also has become a powerful platform for change. In fact, Coachtopia is investing in talent by creating circular design scholarships like the Coachtopia Catalyst Fund, which was designed to support emerging sustainability non-profits led by the Gen Z community. Developing Consistent, Scalable Processes for Circular Fashion Silverstein admitted that “circularity” has become an industry buzzword with inconsistent definitions, which means it could lose value and impact over time. That’s why the Coachtopia team focused on establishing a clear definition of circularity that would drive product development, marketing and any form of customer communication. “It was really important to us that we defined what we meant by circularity, so our customers knew exactly what it meant too,” she explained. Coachtopia established the Made Circular design principles to inform how the brand designs, crafts and reuses its products: Advertisement Principle 1: Craft with recycled, repurposed or renewable materials The creation of new virgin raw materials accounts for more than 38% of fashion’s greenhouse gas use, Silverstein shared. “We’re starting with the problems in our backyard, and we’re taking the waste we generate as a brand at Coach and using our creativity to reconsider that waste as a valuable raw material in new products.” As a leather brand, Coactopia is prioritizing leather waste by taking all the extra scraps from new bag creation and using these small, sometimes uneven scraps of material for new product creation. ","filter_flag":1}
