{"title":"farming Farmers warn of 'welfare crisis' as new, stricter stocking rates confirmed - Irish Examiner","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI0MDA3Ny5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI0MDA3Ny5odG1s0gEA?oc=5","id":"CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI0MDA3Ny5odG1s0gEA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI0MDA3Ny5odG1s0gEA?oc=5\" target=\"_blank\">farming Farmers warn of 'welfare crisis' as new, stricter stocking rates confirmed<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irish Examiner<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"farming Farmers warn of 'welfare crisis' as new, stricter stocking rates confirmed - Irish Examiner","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LmlyaXNoZXhhbWluZXIuY29tL2Zhcm1pbmcvYXJpZC00MTI0MDA3Ny5odG1s0gEA?oc=5\" target=\"_blank\">farming Farmers warn of 'welfare crisis' as new, stricter stocking rates confirmed<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Irish Examiner<\/font>","source.href":"https:\/\/www.irishexaminer.com","source.title":"Irish Examiner","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Quality Improvement\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Dairy farmers have warned of an impending animal welfare crisis if they are forced to cull heavily pregnant cows to meet new, stricter stocking rates that are seemingly set in stone. It comes as most of Ireland remains included in the new, stricter nitrates limits, outlined in the final implementation map published by the Department of Agriculture on Tuesday evening. Department officials have confirmed the latest interpretation of the Environmental Protection Agency's data resulted in the removal of a small amount of land, equating to 6% of the total area initially identified to move to 220kg\/ha. While the European Commission was clear that its derogation decision would not change, the department identified a limited opportunity to amend the interpretation of the map. The implementation map published by the Department of Agriculture on Tuesday evening. This work, completed by the EPA and presented to the Water Quality Working Group, resulted in the removal of a small amount of land from the area to be reduced to 220Kg\/ha, where underlying water quality is good. A department spokesperson said: “Although these areas did not meet the criteria set down in Article 12 of the commission implementing the decision, solely due to an increase in nitrates concentration between 2021 and 2022, water quality is still good, and the appropriate action from an agricultural perspective is identified as being to protect that good water quality status. Farmers in these areas may continue farming at a maximum derogation stocking rate of 250kg organic N\/ha.” The department confirmed that where land crosses between boundaries, the limit will be calculated on a “parcel-by-parcel basis”, in such a way that if any part is within the 250kg limit area, the whole block will be subject to the higher limit. It said it will begin writing to derogation farmers “in the coming weeks”, to confirm the reduction from 250kg\/ha to 220kg\/ha and provide information relevant to the changes. At this point, however, stockkeepers have less than three months to comply. Agriculture Minister Charlie McConalogue said he recognises it is a “challenging outcome for some farmers\". Speaking to the Irish Examiner, Denis Drennan, deputy president of the Irish Creamery and Milk Suppliers Association, an organisation representing 16,000 dairy farmers, said immediate clarification is needed. “Farmers need to be informed whether they're in or out of the red area immediately and what their options are. With less than three months to destock, we need supports for those affected,” he said. “We need a controlled plan for farmers with no option but to reduce cow numbers, as we really don't want heavily pregnant cows being slaughtered or an animal welfare issue due to the short time frame to reduce stocking rates.” Dairy Industry Ireland director Conor Mulvihill called for Taoiseach Leo Varadkar to meet with the European Commissioner to ensure farmers with cows already in-calf are not forced to slaughter animals in the new year. \"It would be a disaster from an animal welfare and farmer welfare point of view,\" said Mr Mulvihill, adding that the creation of the two-tier derogation map did not acknowledge the \"huge amounts of work being done by farm families around the island on water quality\". \"I am afraid the assessment criteria agreed by the commission and [department] set up large swathes of the country for failure. Undoubtedly, more needs to be done on water quality; farmers and the industry are up for that challenge, but we have to be set actions and criteria that we can achieve before the next assessment, and these need to be agreed upon in advance as part of a clear national water quality improvement plan. “It is clear that we have to closely look at the map and calculate the impact assessment for this industry and farm families that the changes will result in. “We fear that the changes will have a huge effect on all sectors with land market upheaval and drive Irish dairy away from an outdoor grass-based system if we are not careful.”","filter_flag":1}
