{"title":"UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5","id":"CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5\" target=\"_blank\">UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi9wFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3VwZGF0ZWQtNTAtc3RhdGVzLW9mLXJlY3ljbGluZy1hc3Nlc3NtZW50LWZpbmRzLXRoYXQtd2VsbC1kZXNpZ25lZC1wb2xpY3ktaXMtY3JpdGljYWwtdG8tYWNoaWV2aW5nLWhpZ2hlci1yZWN5Y2xpbmctcmF0ZXMtYXBwcm94aW1hdGVseS02LTUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx5LTMwMjAxNTk0My5odG1s0gEA?oc=5\" target=\"_blank\">UPDATED \"50 STATES OF RECYCLING\" ASSESSMENT FINDS THAT WELL-DESIGNED POLICY IS CRITICAL TO ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"2023 \"50 States of Recycling\" report highlights the need for more accurate data, policy and infrastructure investment to improve statewide recycling rates. WESTMINSTER, Colo., Dec. 14, 2023 \/PRNewswire\/ -- Today, Eunomia Research & Consulting and Ball Corporation released an updated \"50 States of Recycling\" report, building on the original, first-of-its-kind state-by-state comparable assessment of common packaging materials by using data on generation, recycling and disposal rates from across the United States. Key findings include: 9 of the 10 states with the highest recycling rates have Recycling Refunds (also known as bottle bills or Deposit Return Systems). While states with Recycling Refunds only account for 27% of the U.S. population, they account for 47% of all packaging recycled, 51% of all aluminum cans and glass bottles recycled and 61% of all PET bottles recycled. States with Recycling Refunds recycle 34% of packaging, excluding fibers and flexible plastics (FFP), through closed-loop end markets (i.e., can-to-can or bottle-to-bottle) compared to 7% for non-Recycling Refund states. Nationally, the value of material diverted from landfills is $2.6 billion , which only represents 32% of the value that could be captured annually. , which only represents 32% of the value that could be captured annually. There is around $6.5 billion worth of material that is lost to landfill annually that could be captured through more effective recycling practices. Since the last iteration of the \"50 States of Recycling\" report, overall recycling rates across the country have stagnated or declined. Several factors contributed to these declines, including pandemic-related shutdowns at many recycling centers. Currently, the U.S. recycles just 45.2% of aluminum cans. Getting that recycling rate closer to 90% by 2030 would create opportunities to reduce greenhouse gas emissions (GHG) – in 2021, 79 million MTCO2e of GHG emissions were avoided through recycling, comparable to removing more than 17 million vehicles from the roads - and grow our economy. The updated report ranks U.S. states by recycling rates while also examining the benefits of implementing policies such as Recycling Refunds, and Extended Producer Responsibility (EPR), which holds producers responsible for product management through the product's lifecycle. When the two policies are enacted alongside one another, the report found that states achieve higher recycling rates, maximize closed-loop recycling (i.e. bottle-to-bottle and can-to-can) and thereby deliver the best social, environmental and economic outcomes for the U.S. \"The recycling rates in our report represent the real recycling—versus collection—rate, meaning this rate is not what is collected for recycling, but rather what is available to be made into new products. Recycling rates in many states are still measured in terms of what is collected for recycling, so to enable a 'like for like' comparison between states, the collection rates have been adjusted to show the real recycling rate. Having a true assessment of recycling rates will better enable us to understand what policy and program measures are needed to capture more quality material, increasing circularity, reducing our need for virgin materials and thus helping protect the planet,\" said Sarah Edwards, Director, Eunomia North America. The 10 states with the highest recycling rates (excluding FFP) in 2021 include: Maine (65%); Vermont (51%); Massachusetts (48%); Iowa (45%); Oregon (45%); New York (44%); California (41%); Michigan (40%); New Jersey (39%); and Connecticut (39%). The 10 states with the lowest recycling rates (excluding FFP) in 2021 include: West Virginia (2%); Louisiana (4%); Tennessee (5%); Alaska (6%); South Carolina (6%); Mississippi (6%); Oklahoma (8%); Alabama (8%); Texas (8%); and Colorado (11%). When expressed as a monetary benefit, the total economic value of recycling in the U.S. is approximately $35 billion, accounting for gross value, employment income from recycling-related jobs and greenhouse gas impact reduction – comparable to removing more than 17 million vehicles from the roads. If effective recycling policies were enacted nationwide, such as pairing Extended Producer Policy alongside Recycling Refunds, the benefit of recycling would double to $70 billion annually. \"Many consumers want to, and think they are, doing the right thing when they put their can or bottle in the recycle bin. However, collection does not equal real recycling. Creating a true closed-loop system — where a can becomes a can, or a bottle becomes a bottle — will require a well-designed recycling policy that creates compelling incentives to recycle and expand recycling infrastructure and systems to ensure the process is simple, convenient and affordable for everyone,\" said Daniel W. Fisher, Chairman and CEO, Ball Corporation. As policymakers and stakeholders from across the supply chain work together to enact meaningful policies and develop effective recycling programs, the \"50 States of Recycling\" report should serve as a resource for developing beneficial programs for the future. How the next generation of recycling systems is designed matters, and smart policies and programs that work together are essential to deliver the best outcomes in the U.S. For more information and state-by-state analysis, view the full \"50 States of Recycling\" report. About Ball Corporation Ball Corporation supplies innovative, sustainable aluminum packaging solutions for beverage, personal care and household products customers, as well as aerospace and other technologies and services primarily for the U.S. government. Ball Corporation and its subsidiaries employ 21,000 people worldwide and reported 2022 net sales of $15.35 billion. For more information, visit www.ball.com, or connect with us on Facebook or Twitter. About Eunomia Established in 2001, Eunomia Research & Consulting ('Eunomia') is an international environmental consultancy dedicated to adding value to organisations through the delivery of improved outcomes. Eunomia has over 100 employees, with offices in Bristol, London, Manchester, Brussels, Athens, New York and Auckland. Working throughout the UK, other EU Member States and beyond, Eunomia's consultants have experience and expertise in environmental, technical and commercial disciplines. For more information about Eunomia, please visit www.eunomia.co.uk . Forward-Looking Statement This release contains \"forward-looking\" statements concerning future events and financial performance. Words such as \"expects,\" \"anticipates,\" \"estimates,\" \"believes,\" and similar expressions typically identify forward looking statements, which are generally any statements other than statements of historical fact. Such statements are based on current expectations or views of the future and are subject to risks and uncertainties, which could cause actual results or events to differ materially from those expressed or implied. You should therefore not place undue reliance upon any forward-looking statements, and they should be read in conjunction with, and qualified in their entirety by, the cautionary statements referenced below. Ball undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Key factors, risks and uncertainties that could cause actual outcomes and results to be different are summarized in filings with the Securities and Exchange Commission, including Exhibit 99 in Ball's Form 10-K, which are available on Ball's website and at www.sec.gov. Additional factors that might affect: a) Ball's packaging segments include product capacity, supply, and demand constraints and fluctuations and changes in consumption patterns; availability\/cost of raw materials, equipment, and logistics; competitive packaging, pricing and substitution; changes in climate and weather and related events such as drought, wildfires, storms, hurricanes, tornadoes and floods; footprint adjustments and other manufacturing changes, including the startup of new facilities and lines; failure to achieve synergies, productivity improvements or cost reductions; unfavorable mandatory deposit or packaging laws; customer and supplier consolidation; power and supply chain interruptions; changes in major customer or supplier contracts or loss of a major customer or supplier; inability to pass through increased costs; war, political instability and sanctions, including relating to the situation in Russia and Ukraine and its impact on Ball's supply chain and its ability to operate in Europe, the Middle East and Africa regions generally; changes in foreign exchange or tax rates; and tariffs, trade actions, or other governmental actions, including business restrictions and orders affecting goods produced by Ball or in its supply chain, including imported raw materials; b) Ball's aerospace segment include funding, authorization, availability and returns of government and commercial contracts; and delays, extensions and technical uncertainties affecting segment contracts; failure to obtain, or delays in obtaining, required regulatory approvals or clearances for the proposed transaction; any failure by the parties to satisfy any of the other conditions to the proposed transaction; the possibility that the proposed transaction is ultimately not consummated; potential adverse effects of the announcement or results of the proposed transaction on the ability to develop and maintain relationships with personnel and customers, suppliers and others with whom it does business or otherwise on the business, financial condition, results of operations and financial performance; risks related to diversion of management's attention from ongoing business operations due to the proposed transaction; the impact of the proposed transaction on the ability to retain and hire key personnel; and c) Ball as a whole include those listed above plus: the extent to which sustainability-related opportunities arise and can be capitalized upon; changes in senior management, succession, and the ability to attract and retain skilled labor; regulatory actions or issues including those related to tax, environmental, social and governance reporting, competition, environmental, health and workplace safety, including U.S. Federal Drug Administration and other actions or public concerns affecting products filled in Ball's containers, or chemicals or substances used in raw materials or in the manufacturing process; technological developments and innovations; the ability to manage cyber threats; litigation; strikes; disease; pandemic; labor cost changes; inflation; rates of return on assets of Ball's defined benefit retirement plans; pension changes; uncertainties surrounding geopolitical events and governmental policies, including policies, orders, and actions related to COVID-19; reduced cash flow; interest rates affecting Ball's debt; successful or unsuccessful joint ventures, acquisitions and divestitures, and their effects on Ball's operating results and business generally; and potential adverse effects of the announcement or results of the proposed transaction on the market price of Ball Corporation's common stock. SOURCE Ball Corporation","filter_flag":1}
{"title":"Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually - Recycling Product News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5\" target=\"_blank\">Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually - Recycling Product News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5yZWN5Y2xpbmdwcm9kdWN0bmV3cy5jb20vYXJ0aWNsZS80MTIyMS91cGRhdGVkLXN0YXRlLW9mLXVzLXJlY3ljbGluZy1yZXBvcnQtZmluZHMtZG9sbGFyNjUtYmlsbGlvbi13b3J0aC1vZi1tYXRlcmlhbC1sb3N0LXRvLWxhbmRmaWxsLWFubnVhbGx50gEA?oc=5\" target=\"_blank\">Updated U.S. recycling report finds $6.5 billion worth of material lost to landfill annually<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Recycling Product News<\/font>","source.href":"https:\/\/www.recyclingproductnews.com","source.title":"Recycling Product News","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Eunomia Research & Consulting and Ball Corporation released an updated 50 States of Recycling report, building on the original state-by-state comparable assessment of common packaging materials by using data on generation, recycling, and disposal rates from across the United States. Key findings of the report include: 9 of the 10 states with the highest recycling rates have recycling refunds (also known as bottle bills or deposit return systems). While states with recycling refunds only account for 27 percent of the U.S. population, they account for 47 percent of all packaging recycled, 51 percent of all aluminum cans and glass bottles recycled, and 61 percent of all PET bottles recycled. States with recycling refunds recycle 34 percent of packaging, excluding fibres and flexible plastics (FFP), through closed-loop end markets compared to 7 percent for non-recycling refund states. Nationally, the value of material diverted from landfills is $2.6 billion, which only represents 32 percent of the value that could be captured annually. There is around $6.5 billion worth of material that is lost to landfills annually that could be captured through more effective recycling practices. Since the last iteration of the 50 States of Recycling report, overall recycling rates across the country have stagnated or declined. Several factors contributed to these declines, including pandemic-related shutdowns at many recycling centres. Currently, the U.S. recycles just 45.2 percent of aluminum cans. Getting that recycling rate closer to 90 percent by 2030 would create opportunities to reduce greenhouse gas emissions (GHG) – in 2021, 79 million MTCO2e of GHG emissions were avoided through recycling, comparable to removing more than 17 million vehicles from the roads – and grow the U.S. economy. The updated report ranks U.S. states by recycling rates while also examining the benefits of implementing policies such as recycling refunds and extended producer responsibility (EPR) which holds producers responsible for product management through the product's lifecycle. When the two policies are enacted alongside one another, the report found that states achieve higher recycling rates, maximize closed-loop recycling (i.e. bottle-to-bottle and can-to-can), and deliver the best social, environmental, and economic outcomes for the U.S. \"The recycling rates in our report represent the real recycling – versus collection – rate, meaning this rate is not what is collected for recycling, but rather what is available to be made into new products. Recycling rates in many states are still measured in terms of what is collected for recycling, so to enable a 'like for like' comparison between states, the collection rates have been adjusted to show the real recycling rate. Having a true assessment of recycling rates will better enable us to understand what policy and program measures are needed to capture more quality material, increasing circularity, reducing our need for virgin materials, and thus helping protect the planet,\" said Sarah Edwards, director of Eunomia North America. The 10 states with the highest recycling rates (excluding FFP) in 2021 include Maine (65 percent), Vermont (51 percent), Massachusetts (48 percent), Iowa (45 percent), Oregon (45 percent), New York (44 percent), California (41 percent), Michigan (40 percent), New Jersey (39 percent), and Connecticut (39 percent). The 10 states with the lowest recycling rates (excluding FFP) in 2021 include West Virginia (2 percent), Louisiana (4 percent), Tennessee (5 percent), Alaska (6 percent), South Carolina (6 percent), Mississippi (6 percent), Oklahoma (8 percent), Alabama (8 percent), Texas (8 percent), and Colorado (11 percent). When expressed as a monetary benefit, the total economic value of recycling in the U.S. is approximately $35 billion, accounting for gross value, employment income from recycling-related jobs, and greenhouse gas impact reduction – comparable to removing more than 17 million vehicles from the roads. If effective recycling policies were enacted nationwide, such as pairing extended producer policy alongside recycling refunds, the benefit of recycling would double to $70 billion annually. \"Many consumers want to, and think they are, doing the right thing when they put their can or bottle in the recycle bin. However, collection does not equal real recycling. Creating a true closed-loop system – where a can becomes a can, or a bottle becomes a bottle – will require a well-designed recycling policy that creates compelling incentives to recycle and expand recycling infrastructure and systems to ensure the process is simple, convenient and affordable for everyone,\" said Daniel W. Fisher, chairman and CEO of the Ball Corporation. As policymakers and stakeholders from across the supply chain work together to enact meaningful policies and develop effective recycling programs, the 50 States of Recycling report should serve as a resource for developing beneficial programs for the future. How the next generation of recycling systems is designed matters, and smart policies and programs that work together are essential to deliver the best outcomes in the U.S. For more information and state-by-state analysis, view the full 50 States of Recycling report.","filter_flag":1}
{"title":"Serial clothes shoppers to be targeted in new sustainability campaign - TheJournal.ie","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZmFzdC1mYXNoaW9uLXNob3BwaW5nLWNocmlzdG1hcy1zYWxlcy02MjU3NTg0LURlYzIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZmFzdC1mYXNoaW9uLXNob3BwaW5nLWNocmlzdG1hcy1zYWxlcy02MjU3NTg0LURlYzIwMjMv0gEA?oc=5","id":"CBMiUGh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZmFzdC1mYXNoaW9uLXNob3BwaW5nLWNocmlzdG1hcy1zYWxlcy02MjU3NTg0LURlYzIwMjMv0gEA","guidislink":false,"published":"Tue, 26 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=26, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=360, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZmFzdC1mYXNoaW9uLXNob3BwaW5nLWNocmlzdG1hcy1zYWxlcy02MjU3NTg0LURlYzIwMjMv0gEA?oc=5\" target=\"_blank\">Serial clothes shoppers to be targeted in new sustainability campaign<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheJournal.ie<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Serial clothes shoppers to be targeted in new sustainability campaign - TheJournal.ie","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vd3d3LnRoZWpvdXJuYWwuaWUvZmFzdC1mYXNoaW9uLXNob3BwaW5nLWNocmlzdG1hcy1zYWxlcy02MjU3NTg0LURlYzIwMjMv0gEA?oc=5\" target=\"_blank\">Serial clothes shoppers to be targeted in new sustainability campaign<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TheJournal.ie<\/font>","source.href":"https:\/\/www.thejournal.ie","source.title":"TheJournal.ie","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"IN A BID to end the unsustainable buying habits of serial shoppers, the government is to launch a public campaign in 2024 targeted particularly at those who buy clothes several times a week. These so-called ‘high frequency purchasers’ will be encouraged to reduce their consumption of clothes and to adopt more sustainable behaviours. Over a fifth of Irish people buy clothes several times a week and half of those report buying items they never wear, according to Environmental Protection Agency (EPA) data. They love browsing the latest trends and don’t find clothes shopping a chore. Most are women but 35% are men. The women tend to be under 50 and the men under 34-years-old. You’re sure to see many of them hitting the shops today because these fashionistas are more influenced by sales than anything else – more than friends, family or social media. Maybe you’ll see a high frequency purchaser looking back at you in the changing room mirror. “In terms of individual purchasers, [serial shoppers] might be the best representative of the consumer culture that we have,” Solene Schirrer, textile waste campaign lead from the environmental NGO VOICE, told Noteworthy. “It’s not like those people are bad,” she said, it’s a reflection of what consumers are being offered – they’ve been taught to see clothes as disposable. “It shows that there’s a clear lack of value put on the clothes, and that people don’t get the link between the clothes and the resources it takes to make them.” This suits companies who want us to keep buying. Shoppers on Grafton Street on St Stephen's Day in 2020 just before non-essential retail was shut at the end of December. NurPhoto SRL \/ Alamy Stock Photo NurPhoto SRL \/ Alamy Stock Photo \/ Alamy Stock Photo Noteworthy, the crowdfunded community-led investigative platform from The Journal, supports independent and impactful public interest journalism. Textile consumption volume ‘a problem’ Ireland is one of the biggest consumers and disposers of textiles in the EU. We consume 53 kg per person per year and throw away 35 kg, compared to the European average of 26 kg and 12 kg. The industry needs to change but at the same time, so do individual buying patterns, says Schirrer. High consumption needs to be “a bit less socially acceptable” at an individual level. Though they buy a lot of clothes, high frequency shoppers tend to be more likely to look out for ethical, sustainably-sourced and locally-produced clothes. But even if these shoppers are more conscious of what they buy, is the amount they buy undoing all their potential good? We asked Schirrer. “The problem is the volume,” she said. Around 110,000 tonnes of textiles in Ireland end up in waste-to-energy plants or landfill each year. Recycling isn’t the answer. Only 1% of clothes globally are recycled into new clothing, according to Schirrer. Often what is meant as recycling is really downcycling: using old clothing fibres as housing insulation, for example. “Yes, buy better, but also buy less,” she said, adding, “there’s still confusion over what is really sustainable”. Sustainability or greenwashing? It’s difficult for consumers to know how to assess brands’ sustainability claims. Recycled polyester, for example, tends to come from plastic bottles. What’s the problem with that, we asked – isn’t it all recycling? This ‘open loop’ recycling, where resources from one industry are used in another, might be better than nothing. Advertisement But the problem is that we still have all these waste textiles that we can’t deal with and so that recycled polyester is likely to end up in landfill, just a bit later than it might have. Plus it gives industry “an out” to keep using virgin (non-recycled) material and our consumption grows, says Schirrer. Much better would be ‘closed loop’ recycling. It’s the idea of circularity where [we] reuse the same products for the same purposes so that… you don’t use as many virgin resources. VOICE Ireland are working on a website, to be launched next year, where consumers will be able verify sustainability claims. The EU is also working on a ‘greenwashing’ directive which will make it harder for companies to make vague or misleading claims. In the meantime, Schirrer says, look for certifications and try to buy pure, natural fibres such as cotton or wool. Pure because current technology is unable to separate mixed fabrics such as stretch jeans which are a cotton-elastane mix. Natural because, she says, they are easier to turn into new textiles and “in the worst case scenario” are compostable. Data to inform policy and interventions The data on high frequency purchasers comes from a National Textiles Survey carried out by the EPA in 2021 but published this year. The survey and the 2024 awareness campaign are all part of the government’s green ambitions to move Ireland towards a circular economy in which products are kept in circulation as long as possible through reuse, repair and recycling. “Textiles is a priority policy area,” said a spokesperson for the Department of the Environment, Climate and Communications, because it wants “to tackle the environmental degradation caused by this material stream and in realising its circular economy ambitions.” Textile waste is a major global polluter. Shutterstock \/ Anwarul Kabir Photo Shutterstock \/ Anwarul Kabir Photo \/ Anwarul Kabir Photo To this end, the Department established a Textile Advisory Group in 2022. It had its third meeting at the end of November with a progress report due in early 2024. The group is involved in the publicity campaign and has committed to publishing a National Policy Statement on Textiles, and to explore extending a producer responsibility scheme for textiles, although no date for those is set. What’s an ethical fashionista to do? Even though they purchase more, frequent shoppers are also more likely to engage in some behaviour that is compatible with textile sustainability. 30% are willing to rent clothes compared to 24% of other consumers and 28% have bought second-hand clothing in the past 12 months compared to 17%. Schirrer says all these are great options for a fashion-conscious shopper. And for those who love the thrill of the hunt, Stephen’s Day sales can scratch that itch, too, if approached more sustainably. Go to charity shops, buy natural fabrics – Schirrer recommends Irish linen or wool – and invest in a well-designed piece that will last a really long time which you couldn’t afford otherwise. “Ask yourself, ‘how many times will I wear this?’” she said, “and then get creative in the circular economy.” Are we doing enough to tackle fashion’s throwaway culture in Ireland? By Alice Chambers of Noteworthy Noteworthy is the crowdfunded investigative journalism platform from The Journal. This project was proposed and funded by our readers alongside support from our investigative fund. What’s next? We want to unmask hazardous practices in nail salons which are putting workers at risk. Help fund this work >>","filter_flag":1}
