{"title":"Next-Gen Professional Cleaning Calls for Sustainable, Easy-to-Use Products - Happi","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmhhcHBpLmNvbS9uZXh0LWdlbi1wcm9mZXNzaW9uYWwtY2xlYW5pbmctY2FsbHMtZm9yLXN1c3RhaW5hYmxlLWVhc3ktdG8tdXNlLXByb2R1Y3RzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmhhcHBpLmNvbS9uZXh0LWdlbi1wcm9mZXNzaW9uYWwtY2xlYW5pbmctY2FsbHMtZm9yLXN1c3RhaW5hYmxlLWVhc3ktdG8tdXNlLXByb2R1Y3RzL9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vd3d3LmhhcHBpLmNvbS9uZXh0LWdlbi1wcm9mZXNzaW9uYWwtY2xlYW5pbmctY2FsbHMtZm9yLXN1c3RhaW5hYmxlLWVhc3ktdG8tdXNlLXByb2R1Y3RzL9IBAA","guidislink":false,"published":"Fri, 01 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=335, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmhhcHBpLmNvbS9uZXh0LWdlbi1wcm9mZXNzaW9uYWwtY2xlYW5pbmctY2FsbHMtZm9yLXN1c3RhaW5hYmxlLWVhc3ktdG8tdXNlLXByb2R1Y3RzL9IBAA?oc=5\" target=\"_blank\">Next-Gen Professional Cleaning Calls for Sustainable, Easy-to-Use Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Next-Gen Professional Cleaning Calls for Sustainable, Easy-to-Use Products - Happi","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vd3d3LmhhcHBpLmNvbS9uZXh0LWdlbi1wcm9mZXNzaW9uYWwtY2xlYW5pbmctY2FsbHMtZm9yLXN1c3RhaW5hYmxlLWVhc3ktdG8tdXNlLXByb2R1Y3RzL9IBAA?oc=5\" target=\"_blank\">Next-Gen Professional Cleaning Calls for Sustainable, Easy-to-Use Products<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Happi<\/font>","source.href":"https:\/\/www.happi.com","source.title":"Happi","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-12-01+before:2023-12-31","text":" ISSA Executive Director John Barrett addresses the audience at “Then, Now, Forever: Celebrating 100 Years of ISSA.” ISSA Executive Director John Barrett addresses the audience at “Then, Now, Forever: Celebrating 100 Years of ISSA.” Solution Seeking for Cleaning Ecolab Rapid Multi Surface Disinfectant Cleaner has both hard and soft surface claims. Ecolab Rapid Multi Surface Disinfectant Cleaner has both hard and soft surface claims. More Solutions for I&I Issues Lysol Pro & BlueDot Forecast Concurrent Rise in Flu, RSV & Covid-19 Predictive analysis conducted for Reckitt’s Lysol Pro Solutions by data experts at BlueDot Inc. suggests that US businesses should anticipate a concurrent rise in flu, RSV, and covid-19 this year, but that the onset of respiratory virus season will be closer to typical pre- pandemic timing than last year. “With flu and RSV expected to hit the US at a similar time, businesses should deploy effective germ reduction strategies to help address the spread through both surfaces and air,” said Dr. Julie McKinney, director of R&D at Reckitt’s Lysol Pro Solutions. “The season has historically shaved off productivity from businesses due to worker and school absenteeism. Early indicators suggest that this year is likely to mirror pre-pandemic trends compared to last year, which was highly unpredictable.” According to McKinney, holistic hand and surface hygiene, including the use of EPA-approved products such as Lysol Disinfectant Spray or Lysol Disinfecting Wipes, as well as a focus on “effective cleaning measures on germ-harboring hot spots can help reduce the spread of germs, and support a more productive workforce.” Last year, the flu season began, on average, seven weeks earlier than pre-pandemic trends. This year, signs from the southern hemisphere suggest that the flu season is trending toward pre-pandemic patterns, according to Lysol. Formulation Science Save The Date: HCPA’s 2024 New Horizons Is October 1-3 in Asheville, NC The Household and Commercial Products Association (HCPA) New Horizons conference will be held Oct. 1-3, 2024 at the Grand Bohemian Hotel Asheville in Asheville, NC. Hosted every three years by HCPA’s Cleaning Products Division, experts from industry and academia come together to engage in workshops that explore the future of product formulation. HCPA’s Annual Meeting is this month (Dec 3-6) in Fort Lauderdale. The keynote speaker is quarterback Joe Theismann. www.thehcpa.org Cleaning, Curated The I&I cleaning category has a long history in innovative technologies that keep surfaces sparkling, stop the spread of germs and keep bacteria at bay—and there’s a place that pays homage to it all: the Museum of Clean. Attendees at the ISSA Show were able to get a taste of what’s inside the 74,000 sq.ft. facility in Pocatello, ID through a display on the show floor in Las Vegas last month. The museum was opened in 2011 by Don Aslett, an industry icon with his own storied history in the cleaning industry. Whirlpool’s In-School Laundry Program Helps Combat Chronic Absenteeism Whirlpool is embarking on its eighth—and biggest—year of the Care Counts Laundry Program, which provides access to washers and dryers in schools primarily located in underserved communities. The idea is to help remove a small but important barrier to attendance: access to clean clothes. For the 2023-2024 academic year, the program has expanded to 154 schools across 40 states, including new schools in Connecticut, Michigan, Montana, North Carolina and Oregon. Whirlpool began installing washers and dryers in schools in 2015. The program now provides an estimated 50,000 students with clean clothes. Based on findings from the 2022-2023 academic year, nearly 80% of participating high-risk elementary school students where the program is active saw an increase in student attendance. By 2028, Whirlpool expects to expand the Care Counts Laundry Program to all 50 states. “You are doing something that really truly matters in the world,” ISSA Executive Director John Barrett told an audience assembled last month for “Then, Now, Forever: Celebrating 100 Years of ISSA”—a special event held just before the doors opened on the 2023 ISSA Show North America Las Vegas. ISSA —the worldwide cleaning industry association—has come a long way since 1923, when its predecessor, the National Sanitary Supply Association, was formed with seven founding members. A century ago, just a handful of manufacturers were part of the membership of the fledging organization.Today, ISSA has about 1,000 manufacturer members, whom Barrett called the “heart and soul of this convention.”They fuel the industry as well.Inside the ISSA North America show, which this year was held at the Mandalay Bay Convention Center, were manufacturers of disinfectants dish detergents and air care products , as well as makers of tools and devices to dispense, wash, scrub and dispose. All told, ISSA has more than 10,500 members spanning distributors, manufacturers and manufacturer reps, building service contractors (BSCs), in-house service providers, residential cleaners and associated services.It is an ecosystem that insures consumers’ most favorite and important spaces are clean. And that, in turn, protects the health and wellness of everyone—whether a football stadium filled with Swifties, a local school packed with students and teachers, or a corporate office seeing a steady stream of workers back at their desks and inside conference rooms.Leading cleaning solution manufacturers not only formulate in the lab—they’re tracking flu season, collaborating with microbiologists, digging into societal needs to deliver improved hygiene for more people and sourcing more sustainable solutions. And if that’s not enough, they provide training programs to help their busy customers who remain under great pressure from labor shortages.The pressure cooker atmosphere of the pandemic has subsided, but cleaning professionals are still under the gun. Many are burned out, according to recent polling from CloroxPro . In the CloroxPro’s 2023 Clean Index report—which reflects the current challenges and perceptions of more than 1,700 cleaning professional—nearly nine out of ten (87%) cleaning professionals personally experienced burnout in the past two years.This troubling stat comes as consumer confidence in the cleanliness of public spaces increased 23% during the past year. According to Clorox, 59% consumers are confident in the professional cleaning industry’s ability to aid in preventing the spread of illness-causing germs, up from 48% in 2022. That confidence stems from important visual and sensory cues that make consumers feel safe—think a clean, pleasant smell, seeing janitors and staff cleaning, shiny floors or bright and clean walls\/surfaces and public availability of disinfectant wipes.Despite this, Clorox Pro data revealed cleaning professionals feel less confident year-over-year in their ability to prevent the spread of illness-causing germs. In fact, cleaning professionals’ confidence fell nearly 5% compared to last year, with the largest confidence drop among building-service contractors ( down 15% vs. 2022). The primary drivers of declining confidence were cited as a lack of training programs (22%, up 9% vs. 2022) and more public scrutiny of cleaning practices (20%, up 6% vs. 2022).According to CloroxPro, the data reinforces how much responsibility is placed on cleaning professionals and the need to ensure they have the tools and support to create clean and healthy public spaces.For CloroxPro, that can mean delivering ready-to-use (RTU) cleaning and disinfecting products like Clorox EcoClean, which includes EcoClean Disinfecting Cleaner, which is made with a plant-based active ingredient that kills 99.9% of illness-causing germs in two minutes or less when used as directed. This product garnered The Clorox Company an Environmental Protection Agency (EPA) 2023 Green Chemistry Award in the “Designing Greener Chemicals” category. The EcoClean product range also includes all-purpose cleaner and glass cleaner.According to CloroxPro, 82% of cleaning professional cite killing germs as the most important quality for eco-friendly cleaners. Jordan Bastian, senior infection preventionist at The Clorox Company, says EcoClean offers facilities managers and professional cleaning staff numerous benefits—from efficacy and versatility to reduced effort and time saved.Similar sentiments were echoed across the show floor at ISSA last month. Collectively, the I&I cleaning space is constantly pushing its resources toward solving key pain points for cleaning professionals.Take Ecolab’s entry in the 2023 ISSA Innovation Award competition: Ecolab Rapid Multi Surface Disinfectant Cleaner. With both hard and soft surface claims, this “4-in-1” solution is versatile; it can be a hospital disinfectant, a streak-free glass cleaner in the office, a bactericide for high-touch counters, and even sprayed on upholstered chairs in the hotel lobby, according to officials. What’s more, it can be applied with spray bottles, mop, microfiber pad, bucket, auto scrubber and electrostatic sprayer.“Cleaning staff deserve a solution that works in the way they do today,” said Amanda Bakken, an Ecolab chemist who presented the Rapid Multi Surface Disinfectant Cleaner on the ISSA show floor. “It is a disinfectant that goes where you go.”Improved efficiency in cleaning is increasingly being driven by technology, too. While consumers are familiar with touch-free units that provide squirts of soap or roll out a paper towel on demand, IoT and connected dispensers provide tangible benefits for cleaning service professionals and facilities managers.“They are contending with labor shortages and they are interested in having smart dispensers that help their skeleton staff be more efficient by sending a ping or notification to janitor\/manager’s iPhone or tablet. This way, they can spend less time checking dispensers that are full or half-full and focus on the ones that are empty,” said Laura Mahecha, director of industrial and institutional cleaning practice at Kline & Company. Tork Vision Cleaning uses real-time data from connected dispensers and people counters to help facility managers and cleaning staff know when and where cleaning and dispenser refilling are needed. According to Tork, this relates to a 91% reduction in dispenser checks. And as sensors track movement, a cleaning manager knows when a conference room sits unused, and therefore doesn’t require immediate attention.According to Kline’s Industrial & Institutional Hand Care report , 34.3% of respondents in a survey conducted this summer said they used smart (IoT) dispensers at their facility or customer’s facility, and 40.4% said they did not, but planned to install them. The remainder said they did not and did not plan to install. The survey encompassed 508 respondents across building service contractors, healthcare, foodservice, education, retailers, industry, lodging and sport\/fitness.Newer dispensers are also more sustainable.As of October, 11 existing Tork brand dispensers in the US (and 15 in Canada) are carbon neutral. Tork says it is one of the first in its class in North America to have reduced and offset carbon for the entire lifecycle of selected soap, toilet paper and hand towel dispensers. Carbon emissions have already been reduced by using purchased renewable electricity in the production, and the remaining carbon emissions are offset with verified credits from climate projects, according to the brand, which is part of Essity. SC Johnson Professional’s Proline Wave Dispenser is a one-liter dispenser made with 70% Recovered Coastal Plastic (plastic that is collected on land within 31 miles of an ocean, in countries with high volumes of uncollected plastic waste). The dispenser’s recovered plastic materials are sourced through SCJ’s partnership with Plastic Bank. Each dispenser uses the equivalent of 16 16.9 fl.oz. recovered coastal plastic waste plastic bottles.Proline Wave is compatible with SC Johnson Professional’s full line of Refresh Foam soaps, which use 30% less product and can reduce average water consumption as much as 45% when washing and rinsing hands compared to traditional lotion soap, said the company. Independent tests show that washing hands with foam soap rather than lotion soap can reduce average water consumption by as much as 45% when using a modified hand wash approach of dispensing soap on dry hands and turning the tap on only when rinsing off.Foaming soap is at the heart of Soap2o Ltd, a company that exhibited at the ISSA Show for the first time to tout its Super Hydro Pod. According to officials, its point of differentiation is its increased sustainability profile and ease of use. One pod creates one gallon of foaming soap when dropped into a gallon container with water and agitated by hand for about a minute. The company plans to expand beyond hand soap, offering shampoos and other personal care products in 2024.More sustainable solutions are being sought by endusers of I&I products, including the hospitality sector, which is pursuing green practices due to both new regulations and customer expectations.“We are starting to see increased usage of amenities dispenser in hotel rooms across the country,” said Mahecha of Kline.According to Kline’s Janitorial and Housekeeping Cleaning Products USA study, more than 20 states have laws banning single use plastics (SUPs), but the initiative has taken hold on a more widespread nature due to the cost savings afforded hotel operators by using bulk products in dispensers rather than small bottles.Across the ISSA show floor in Las Vegas, there were solutions for all types of I&I settings.In addition to offering a sneak peek of its new laundry lineup due out next spring (Tide Professional commercial laundry detergent in pods, liquid and powder and Downy Professional commercial fabric softener), P&G Professional showcased new Dawn Professional Heavy Duty Manual Pot and Pan detergent. The proprietary formula, made with Dawn Professional’s highest level of proprietary grease-cutting surfactant, contains three times more baked-on grease cleaning power to help dishwashers spend less time and energy on greasy cookware and can reduce scrubbing by 50% from active ingredients that do more of the work.“With the time and effort they spend on cleaning greasy pots and pans and other kitchen tools, back-of-house kitchen staff have some of the hardest jobs in a restaurant but rarely are celebrated by customers. Restaurant owners want a detergent that saves time and makes the lives of their dishwashers easier,” said Paul Edmondson, vice president of P&G North America, in a statement.Like dirty pots and pans, ants are another thing customers don’t want to see when dining out.To that end, Henkel this year showcased its Combat brand, which provides roach and ant killing solutions for professional kitchens as well as commercial and manufacturing settings, offices and more. The newest product in the range is Combat 2-in-1 Ant Bait, billed as the first 2-in-1 in the US market, according to James Lothrop, a Combat brand manager.Ants, according to Henkel officials Happi spoke with at ISSA, are historically picky eaters, but Combat’s 2-in-1 solution is designed to kill 11 kinds of ants by way of two baits: one grease-based, the other sugar-based (officials at the show likened it to a “buffet”). Ants take the bait back to the colony, eliminating insects at the source.O3 Technologies Inc., Los Angeles, showcased its OxiTerminator Mattress Sanitizer, a system that allows hotel workers to clean and disinfect mattresses in less than 30 minutes. It would offer an alternative to the cumbersome process of removing a mattress from a room and taking it to a disinfection truck, according to Andy Rifkin, founder and chief technology officer.According to Rifkin, O3’s work centers on the use of activated oxygen, or O3 (hence, its name). First, the mattresses are placed into a sealed, leakproof bag. Then, activated oxygen is pumped in, “pulled through” the layers of material at “safe, therapeutic levels,” and subjected to UVC light and a series of catalysts. The process is said to kill covid and other disease-causing pathogens, as well as mold, parasites, bed bugs, fleas and mites.The mattresses need to be vacuumed after the process, according to the company.O3 Technologies also developed a commercial sonic mop adapter that can be attached to existing commercial mops as well as Swiffer-style tools. The OxiTerminator Mattress Sanitizer is set to launch at the end of Q1 2024 with the mop adapter following in Q2 2024.NPD continues around use of natural components in disinfectant technologies. According to Kline, 38% of end users view green cleaning products to be as effective as traditional cleaning chemicals. Demand is increasing for products with active ingredients that are plant-based or botanical, such as lavender, citric acid and thymol, notes Kline.Last month, Diversey signed a multi-year licensing accord with Virox Technologies to bring its patented disinfectant technology known as Citr-IQ, to the healthcare sector and other segments. Diversey will add multiple disinfectant products, powered by Virox’s Citr-IQ, to its lineup of professional offerings.Citr-IQ is a synergistic blend that effectively kills pathogens by harnessing the natural disinfectant power of citric acid. Citr-IQ maintains the balance of efficacy and safety that Virox antimicrobial technologies are known for while advancing performance in sustainability and material compatibility, according to Diversey. Citr-IQ’s synergistic chemistry is said to be powerful enough to eliminate pathogens of concern, including SARS-CoV2, ESBLs, norovirus and Candida auris. Additionally, it is the first citric-acid-based tuberculocidal disinfectant with a one-minute contact time and the first one-minute tuberculocidal disinfectant compatible with fully biodegradable wipes. It is safe for multiple surfaces and devices, including plastics and soft metals.Under the terms of the agreement, Virox will receive undisclosed license fees and royalties for the use of the formulas covered under the Citr-IQ platform. It will manufacture products containing the Citr-IQ formulas for Diversey’s North American markets.This new accord lengthens a 24-year-long partnership; Diversey had previously licensed accelerated hydrogen peroxide (AHP) chemical disinfectant technology from Virox, which Diversey fully acquired in 2019. AHP is the active ingredient in multiple brands, including Diversey’s Oxivir and Accel infection prevention platforms.Indie brands are also developing safer solutions for I&I cleaning. Dear Planet Labs, Placentia, CA exhibited at ISSA for the first time. Its Everyday Disinfectant Spray contains just three ingredients: hypochlorous acid (HOCI), water and salt. The limited-ingredient spray eliminates 99.9% of bacteria and viruses, including covid-19, in 60 seconds. It is EPA List-N and List-Q approved and offers an alternative to traditional disinfectant sprays formulated with quats, said officials.Safer, smarter and more sustainable solutions are the future of I&I cleaning.","filter_flag":1}
{"title":"YKK’s New DynaPel™ Water-Repellant Zipper Wins Best Product In ISPO Textrends Competition - Textile World Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQva25pdHRpbmctYXBwYXJlbC8yMDIzLzEyL3lra3MtbmV3LWR5bmFwZWwtd2F0ZXItcmVwZWxsYW50LXppcHBlci13aW5zLWJlc3QtcHJvZHVjdC1pbi1pc3BvLXRleHRyZW5kcy1jb21wZXRpdGlvbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQva25pdHRpbmctYXBwYXJlbC8yMDIzLzEyL3lra3MtbmV3LWR5bmFwZWwtd2F0ZXItcmVwZWxsYW50LXppcHBlci13aW5zLWJlc3QtcHJvZHVjdC1pbi1pc3BvLXRleHRyZW5kcy1jb21wZXRpdGlvbi_SAQA?oc=5","id":"CBMinAFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQva25pdHRpbmctYXBwYXJlbC8yMDIzLzEyL3lra3MtbmV3LWR5bmFwZWwtd2F0ZXItcmVwZWxsYW50LXppcHBlci13aW5zLWJlc3QtcHJvZHVjdC1pbi1pc3BvLXRleHRyZW5kcy1jb21wZXRpdGlvbi_SAQA","guidislink":false,"published":"Wed, 13 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=347, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQva25pdHRpbmctYXBwYXJlbC8yMDIzLzEyL3lra3MtbmV3LWR5bmFwZWwtd2F0ZXItcmVwZWxsYW50LXppcHBlci13aW5zLWJlc3QtcHJvZHVjdC1pbi1pc3BvLXRleHRyZW5kcy1jb21wZXRpdGlvbi_SAQA?oc=5\" target=\"_blank\">YKK’s New DynaPel™ Water-Repellant Zipper Wins Best Product In ISPO Textrends Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"YKK’s New DynaPel™ Water-Repellant Zipper Wins Best Product In ISPO Textrends Competition - Textile World Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMinAFodHRwczovL3d3dy50ZXh0aWxld29ybGQuY29tL3RleHRpbGUtd29ybGQva25pdHRpbmctYXBwYXJlbC8yMDIzLzEyL3lra3MtbmV3LWR5bmFwZWwtd2F0ZXItcmVwZWxsYW50LXppcHBlci13aW5zLWJlc3QtcHJvZHVjdC1pbi1pc3BvLXRleHRyZW5kcy1jb21wZXRpdGlvbi_SAQA?oc=5\" target=\"_blank\">YKK’s New DynaPel™ Water-Repellant Zipper Wins Best Product In ISPO Textrends Competition<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Textile World Magazine<\/font>","source.href":"https:\/\/www.textileworld.com","source.title":"Textile World Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"ATLANTA — December 13, 2023 —The ISPO Textrends judges have selected YKK’s DynaPel™ water-repellent zipper as the Best Product in the accessories category. The competition, held twice a year in conjunction with the ISPO trade show, recognizes the most innovative performance textiles, components, and apparel. Designed to be compatible with garment recycling systems, the DynaPel zipper uses GTT’s EMPEL® technology instead of the standard PU film to achieve its water repellency. The lack of a PU film helps remove one of the barriers of textile-to-textile recycling of performance apparel by eliminating the urethane material, which presents challenges to garment recycling processes.1 “Receiving an ISPO Textrends Award helps validate the technology and our efforts to develop fasteners for circular systems,” said Terry Tsukumo, vice president, Product Strategy Division, Global Sales Headquarters, YKK Corp. “By employing EMPEL® technology, we can achieve the robust water protection expected from YKK® products while eliminating the challenges that PU poses to recycling systems.” Conventional chemical and mechanical garment recycling systems cannot process the polyurethane film commonly used on water-repellent zippers, necessitating the removal of zippers from garments before recycling. This additional processing step often deters recyclers from accepting garments with PU zippers, resulting in unnecessary waste. EMPEL technology uses advanced green chemistry devoid of PFAS and a specialized manufacturing process that allows the chemistry to penetrate the yarn and encapsulate it with a water-repellent layer through molecular cross-linking. The molecular cross-linking creates an extremely durable layer that is highly resistant to abrasion and invisible to the eye. 1 It is recommended to trial products in your targeted recycling system to fully assess its processability. Posted: December 13, 2023 Source: YKK","filter_flag":1}
{"title":"Oleochemicals Market Size Estimated to Reach USD 46.26 Billion by 2032 - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xOS8yNzk4Njg3LzAvZW4vT2xlb2NoZW1pY2Fscy1NYXJrZXQtU2l6ZS1Fc3RpbWF0ZWQtdG8tUmVhY2gtVVNELTQ2LTI2LUJpbGxpb24tYnktMjAzMi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xOS8yNzk4Njg3LzAvZW4vT2xlb2NoZW1pY2Fscy1NYXJrZXQtU2l6ZS1Fc3RpbWF0ZWQtdG8tUmVhY2gtVVNELTQ2LTI2LUJpbGxpb24tYnktMjAzMi5odG1s0gEA?oc=5","id":"CBMikQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xOS8yNzk4Njg3LzAvZW4vT2xlb2NoZW1pY2Fscy1NYXJrZXQtU2l6ZS1Fc3RpbWF0ZWQtdG8tUmVhY2gtVVNELTQ2LTI2LUJpbGxpb24tYnktMjAzMi5odG1s0gEA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xOS8yNzk4Njg3LzAvZW4vT2xlb2NoZW1pY2Fscy1NYXJrZXQtU2l6ZS1Fc3RpbWF0ZWQtdG8tUmVhY2gtVVNELTQ2LTI2LUJpbGxpb24tYnktMjAzMi5odG1s0gEA?oc=5\" target=\"_blank\">Oleochemicals Market Size Estimated to Reach USD 46.26 Billion by 2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Oleochemicals Market Size Estimated to Reach USD 46.26 Billion by 2032 - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMi8xOS8yNzk4Njg3LzAvZW4vT2xlb2NoZW1pY2Fscy1NYXJrZXQtU2l6ZS1Fc3RpbWF0ZWQtdG8tUmVhY2gtVVNELTQ2LTI2LUJpbGxpb24tYnktMjAzMi5odG1s0gEA?oc=5\" target=\"_blank\">Oleochemicals Market Size Estimated to Reach USD 46.26 Billion by 2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Ottawa, Dec. 19, 2023 (GLOBE NEWSWIRE) -- The global oleochemicals market size was valued at USD 22.66 billion in 2022 and the sector is growing at a CAGR of 7.4% from 2023 to 2032. Asia Pacific led the global market with the largest market share of 41.58% in 2022. The oleochemicals market is driven by the growing bio-based product demand, increasing government initiatives, rising consumer awareness, increasing applications in diverse sectors and technological advancements. In addition, the growing transition towards green chemistry is also propelling the market expansion during the forecast period. Oleochemicals are chemical compounds derived from natural fats and oils, typically of plant or animal origin. These raw materials are mainly triglycerides, which consist of glycerol and three fatty acid chains. Oleochemicals are produced by various chemical and enzymatic processes that involve the transformation of these triglycerides into a wide range of chemical products. Oleochemicals are appreciated for being renewable and for being able to replace products made with petrochemicals. Download the Sample Pages@ https:\/\/www.precedenceresearch.com\/sample\/1693 They are also frequently seen as more sustainable and eco-friendly, which adds to the increased interest in the green and bio-based sectors. The growing collaboration in the industry is also propelling the market growth during the forecast period. For instance, in October 2022, the newly created PET Antifogging compound for direct food contact PET packaging was announced by Emery Oleochemicals and Sukano. Key Insights: The specialty esters segment is expected to hold the largest market share during the forecast period. The personal care & cosmetics segment is expected to dominate the market during the forecast period. The liquid segment is expected to dominate the market share over the forecast period. You can place an order or ask any questions, please feel free to contact us at sales@precedenceresearch.com | +1 650 460 3308 Growth Factors of Oleochemicals Market It is anticipated that the overall product demand in the US shall rise with the use of all chemicals in the end user industries such as the personal care industries and the pharmaceutical industries. The demand for the olechemicals is also expected to grow as there is an increase in the demand for cleaning products industry which includes self acting soaps, etc. Procter and Gamble, which is a leading manufacturer in the cleaning products line, it is based in Europe and imports many oleochemicals from Malaysia and Indonesia. The oleochemical segment is expected to grow in the forecast period as there is a demand for the use of natural organic skin care and hair care cosmetic products. As the environmental regulations are becoming stringent constantly and the renewable resources are getting depleted. There is an opportunity for the growth of the oleochemicals and they shall substitute the conventional petroleum based products. The market for green chemicals is rising and there's an increase in the demand for such products in the consumer markets. Regional Stance: Asia Pacific is expected to dominate the market during the forecast period because of the growing soap, drug, and personal care sectors in nations like China, India, and Japan, as well as their enhanced capability for manufacturing. According to the Chinese National Bureau of Statistics, retail sales of cosmetics in China reached USD 3.85 billion in April 2023, exceeding USD 3 billion in the same month the previous year. Over the past 10 years, China's cosmetics industry has experienced rapid growth. In 2022, the retail value of cosmetics was valued at USD 55.14 billion. Additionally, the Asia Pacific oleochemical producers have invested much in increasing production capabilities and implementing cutting-edge technology. This demonstrates the region's dedication to fulfilling the rising demand for products derived from oleochemicals. Furthermore, there are government programs to promote the oleochemicals business in some nations, particularly in Southeast Asia. The industry has grown as a result of policies that support the development of sustainable practices and bio-based companies. Customize this study as per your requirement@ https:\/\/www.precedenceresearch.com\/customization\/1693 North America is expected to grow at a steady rate over the projected period. The key driver behind this rise is the region's expanding need for oleochemicals in the personal care, cosmetics, and pharmaceutical industries. The oleochemical sector is expanding due in large part to the region's emphasis on ecologically friendly technologies and sustainability. Consumer desire and knowledge of natural and bio-based goods is growing, which is driving up demand for oleochemicals. Furthermore, market development is expected to be supported by the region's robust infrastructure and distribution networks. Oleochemicals Market Scope Report Coverage Details Growth Rate from 2023 to 2032 CAGR of 7.4% Global Market Size in 2023 $ 24.27 Billion Global Market Size by 2032 $ 46.26 Billion Asia Pacific Market Size in 2023 $ 10.16 Billion Asia Pacific Size by 2032 $ 20.62 Billion Asia Pacific Market Share in 2022 41.58% Glycerol Esters Segment Revenue Share 2022 32.83% Base Year 2022 Forecast Period 2023 to 2032 Segments Covered Products, Applications, Form, Feedstock, and Regions Regions Covered North America, Europe, Asia-Pacific, Latin America and Middle East & Africa (MEA) We've prepared a service to help you write your own Go-To-Market strategy. Click to Unlock Your GTM Strategy for the Oleochemicals Market Report Highlights: Product Insights The specialty esters segment is expected to hold the largest market share during the forecast period. Specialty esters find applications in various industries, including cosmetics, personal care, lubricants, plastics, pharmaceuticals, and food. Their unique properties make them well-suited for specific functions in these diverse sectors. It is used in the formulation of cosmetics and personal care products. They can act as emollients, moisturizers, and solubilizers, contributing to the texture and performance of skincare and haircare formulations. Moreover, it is utilized in the production of bio-based polymers and plasticizers. These esters can enhance the flexibility and performance of polymers, serving as alternatives to conventional petrochemical-based additives. Furthermore, the growing investment by the market participants also propels the market growth. For instance, in May 2023, the production activities for specialty esters and amphoteric surfactants in Hopewell, Virginia were acquired by US chemicals company Kensing from Evonik. With an emphasis on skin care, hair care, and dental care applications, Kensing's acquisition of amphoteric surfactants and specialty esters products is largely directed towards the personal care sector. Application Insights The personal care & cosmetics segment is expected to dominate the market during the forecast period. Consumer intentions for natural and sustainable ingredients have led to a substantial use of oleochemicals in the personal care and cosmetics business. Derived from natural fats and oils, oleochemicals have a variety of qualities that fit them for use in cosmetics and personal care products. In skincare and haircare products, oleochemicals such as fatty acids, fatty alcohols, and esters work well as emollients and moisturizers. They add to the overall texture of formulations, hydrate the skin, and enhance skin sensation. Thereby, driving the market growth. Form Insights The liquid segment is expected to dominate the market share over the forecast period. The usage of liquid oleochemicals in a variety of applications as bio-based solvents is growing. Cleaners, paints, and varnishes, for instance, use bio-based solvents made from citrus oils or other oleochemical sources. Liquid oleochemicals are also utilized as lubricants in industrial applications; examples of these include some vegetable oils and their derivatives. In addition to having lubricating qualities, they can be more ecologically friendly than lubricants made of petroleum. Thus, the usage of liquid oleochemicals in diverse sectors drives market growth. Market Dynamics: Driver An increase in the market for bio-based products The market is expanding as a result of the growing demand for bio-based products among consumers worldwide. As consumers grow more aware of environmental issues, they are starting to choose products made from biofuel. Accordingly, people's growing inclination for natural and bio-based substitutes in their daily lives is fueling the market's expansion. Oleochemicals are biodegradable, plant-based substances that are safe for the body. In addition, the market is seeing a rise in demand for natural ingredients in moisturizers and emollients, among other cosmetics and personal care products. In the same way, customers who value environmentally friendly cleaning products use bio-based surfactants extensively. Restraint Volatility in raw material price The two main raw materials utilized in the production of oleochemicals are vegetable and animal fats. The production of biofuels uses the same basic resources. However, using animal and vegetable lipids as biofuels presents supply chain difficulties. The market for oleochemicals is not expanding as a result of these obstacles. Primarily in the oleochemical markets of North America and Europe, animal fats are utilized as raw materials. The flexible availability of animal fat is one of the main obstacles to its use. According to estimates, 50% of the raw materials used in the European oleochemicals business come from animal fat. Nevertheless, the Bovine Spongiform Encephalopathy (BSE) laws restrict its availability in the area. Players in the oleochemicals industry in these nations may expect challenges due to the indirect reliance of oleochemicals producers on these regulatory policies and an inelastic raw material supply. Opportunity The expansion of the packaged food and beverage sector Breakfast cereals, dairy products, baked goods, baby food, biscuits, cakes, ice cream, fruit snacks, yogurts, gum, candies, frozen food, and energy\/cereal bars are examples of packaged foods. The consumption of packaged foods has grown dramatically in emerging nations. Growing economic levels and a preference for urban lives are the main causes of this growth. Products have a longer shelf life because of innovations in the packaged food sector, such as self-cooling and self-heating packaging. The main uses of oleochemicals are as preservatives and emulsifiers in bread, cakes, pastries, and confections, among other food and beverage goods. Furthermore, these compounds are employed in the manufacturing of food additives, which are mostly utilized in sealed food products. Oleochemicals are employed in the dairy sector to produce flavored and plain ice cream. Throughout the projected period, the market is anticipated to develop at a rapid pace due to the growing demand for oleochemicals, notably in the packaged food industry. Related Reports: Specialty Oleochemicals Market: The global specialty oleochemicals market size was estimated at USD 26.06 billion in 2022 and is expected to hit around USD 59.48 billion by 2032, poised to grow at a CAGR of 8.6% during the forecast period 2023 to 2032. The global size was estimated at USD 26.06 billion in 2022 and is expected to hit around USD 59.48 billion by 2032, poised to grow at a CAGR of 8.6% during the forecast period 2023 to 2032. Emulsifiers Market: The global emulsifiers market size was reached at USD 7.87 billion in 2022 and is projected to hit around USD 15.27 billion by 2032, growing at a CAGR of 6.9% between 2023 and 2032. The global size was reached at USD 7.87 billion in 2022 and is projected to hit around USD 15.27 billion by 2032, growing at a CAGR of 6.9% between 2023 and 2032. Nutricosmetics Market: The global nutricosmetics market size accounted for USD 6.5 billion in 2022 and it is expected to hit around USD 14.63 billion by 2032, growing at a CAGR of 8.5% during the forecast period 2023 to 2032. The global size accounted for USD 6.5 billion in 2022 and it is expected to hit around USD 14.63 billion by 2032, growing at a CAGR of 8.5% during the forecast period 2023 to 2032. Wellness Supplements Market: The global wellness supplements market size was valued at USD 240 billion in 2022 and it is expected to hit around USD 474.31 billion by 2032, growing at a significant CAGR of around 7.10% from 2023 to 2032. The global size was valued at USD 240 billion in 2022 and it is expected to hit around USD 474.31 billion by 2032, growing at a significant CAGR of around 7.10% from 2023 to 2032. Functional Ingredients Market: The global functional ingredients market size was exhibited at USD 100 billion in 2022 and is expected to hit around USD 199.48 billion by 2032, poised to grow at a CAGR of 7.20% during the forecast period from 2023 to 2032. Recent Developments: In September 2023, having successfully finished the REACH registration procedure, one of the top manufacturers of excellent oleochemicals from renewable sources in Europe is now permitted to create medium chain triglycerides, or MCTs. In August 2023, the leading Japanese business Tsukino Oleochemicals achieved great progress in the field of sustainable development. The business just revealed the introduction of a new range of fatty acid ester products made from residual cooking oil. This advancement demonstrates Tsukino's dedication to encouraging the effective use of resources for non-edible vegetable oil, a market that has experienced a recent increase in demand. The new products are an important step toward the realization of a decarbonized society and help to increase the biomass content in diverse products. This program is in line with the Tsukino Group's overarching objectives, which center on maximizing the utilization of rice bran. The organization has ventured into three industries: fine chemicals, oleochemicals, and rice bran oil. Market Key Players: Evonik Industries AG Corbion Cargill, Incorporated Wilmar International Ltd. Kao Chemicals Global Ecogreen Oleochemicals Emery Oleochemicals Vantage Specialty Chemicals, Inc. KLK OLEO Godrej Industries IOI Corporation Berhad Oleon NV Market Segmentation By Product Specialty Esters Glycerol Esters lkoxylates Fatty Acid Methyl Ester Fatty Amines Others By Application Personal Care & Cosmetics Consumer Goods Food & Beverages Textiles Paints & Inks Industrial Healthcare & Pharmaceuticals Polymer & Plastic Additives Others By Form Liquid Solid Flakes Pellets Beads Others By Feedstock Palm Soy Rapeseed Sunflower Tallow Palm Kernel Coconut Others By Geography North America Europe Asia-Pacific Latin America Middle East & Africa (MEA) Immediate Delivery Available | Buy This Premium Research Report@ https:\/\/www.precedenceresearch.com\/checkout\/1693 You can place an order or ask any questions, please feel free to contact us at sales@precedenceresearch.com | +1 650 460 3308 Unlocking Market Insights through Data Excellence The \"Precedence Statistics\" flexible dashboard is a powerful tool that offers real-time news updates, economic and market forecasts, and customizable reports. It can be configured to support a wide range of analysis styles and strategic planning needs. This tool empowers users to stay informed and make data-driven decisions in various scenarios, making it a valuable asset for businesses and professionals looking to stay ahead in today's dynamic and data-driven world. To Access our Premium Real-Time Data Intelligence Tool, Visit: www.precedencestatistics.com About Us Precedence Research is a worldwide market research and consulting organization. We give an unmatched nature of offering to our customers present all around the globe across industry verticals. Precedence Research has expertise in giving deep-dive market insight along with market intelligence to our customers spread crosswise over various undertakings. We are obliged to serve our different client base present over the enterprises of medicinal services, healthcare, innovation, next-gen technologies, semi-conductors, chemicals, automotive, and aerospace & defense, among different ventures present globally. Web: https:\/\/www.precedenceresearch.com\/ Our Blogs: https:\/\/www.towardshealthcare.com https:\/\/www.towardspackaging.com For the Latest Update Follow Us: Linkedin | Facebook | Twitter Asia Pacific Market Share in 2022 41.58% 32.83% ","filter_flag":1}
{"title":"“Wool-based products improve crop production” - hortidaily.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmhvcnRpZGFpbHkuY29tL2FydGljbGUvOTU4NDQ1NS93b29sLWJhc2VkLXByb2R1Y3RzLWltcHJvdmUtY3JvcC1wcm9kdWN0aW9uL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmhvcnRpZGFpbHkuY29tL2FydGljbGUvOTU4NDQ1NS93b29sLWJhc2VkLXByb2R1Y3RzLWltcHJvdmUtY3JvcC1wcm9kdWN0aW9uL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmhvcnRpZGFpbHkuY29tL2FydGljbGUvOTU4NDQ1NS93b29sLWJhc2VkLXByb2R1Y3RzLWltcHJvdmUtY3JvcC1wcm9kdWN0aW9uL9IBAA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmhvcnRpZGFpbHkuY29tL2FydGljbGUvOTU4NDQ1NS93b29sLWJhc2VkLXByb2R1Y3RzLWltcHJvdmUtY3JvcC1wcm9kdWN0aW9uL9IBAA?oc=5\" target=\"_blank\">“Wool-based products improve crop production”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">hortidaily.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"“Wool-based products improve crop production” - hortidaily.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmhvcnRpZGFpbHkuY29tL2FydGljbGUvOTU4NDQ1NS93b29sLWJhc2VkLXByb2R1Y3RzLWltcHJvdmUtY3JvcC1wcm9kdWN0aW9uL9IBAA?oc=5\" target=\"_blank\">“Wool-based products improve crop production”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">hortidaily.com<\/font>","source.href":"https:\/\/www.hortidaily.com","source.title":"hortidaily.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Veratin has launched two new products for its Verigrow range, including a biodegradable pot, Verigrow Pot, and a fertilizer supplement, Verigrow Supplement. Verigrow Pot uses a novel biodegradable material that acts as food as it decomposes, helping plants get the nutrients they need as they are placed in the ground. Verigrow Supplement complements the Company’s existing range of liquid fertilizer and soil improver products by acting as an all-purpose product containing a balanced blend of macro (except phosphorus), micronutrients, and trace elements. Veratin created the Verigrow liquid fertilizer and soil improver range through the green chemistry process by extracting amino acids from upcycled waste wool, making it the first of its kind. Verigrow is also one of the greenest organic fertilizers in the market, as the amino acids present reduce the need for high levels of phosphorus and potassium by some 25%-30%, and it uses fewer units of nitrogen than other organic fertilizers, reducing the environmental footprint of the product. Veratin’s Founder and Executive Chairman, Dr. Ramiz Boulos, said that amino acids are part of the building blocks of life. “Amino acids are molecules used to make proteins for living beings, your body needs them to function, and they are usually obtained through consumption of food in humans. In plants, they are manufactured in an energy-intensive process utilizing the nutrients available in the soil, carbon and oxygen from the air, and hydrogen from the water as the base. Supplementing plants with amino acids saves them energy, which they can use for other purposes, which is why the development of the Verigrow biodegradable pot and supplements are so important. “These products are the first of their kind to be made of amino acids extracted from upcycled waste wool, and the use of amino acids to act as sources of growth reduces the need for high levels of fertilizers, reducing environmental damage. Verigrow Pot also helps the environment by reducing the need for plastic, which aligns with our environmentally conscious customers. “Veratin is ideally placed to meet the growing market and regulatory demand for sustainable products that naturally fit into the circular economy, as its products use upcycled materials, support biodiversity, and reduce the need for harmful plastics. For more information: Verigrow 14A Hines Road, O’Connor Western Australia 6163, Australia Tel.: +61 8 6323 8013 [email protected] verigrow.com.au","filter_flag":1}
{"title":"Big Freedia’s Black Opal Collaboration Is All About Bounce - Essence","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVzc2VuY2UuY29tL2JlYXV0eS9iaWctZnJlZWRpYS1ibGFjay1vcGFsLWJvbGQtYmVhdHMtbWFrZXVwL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVzc2VuY2UuY29tL2JlYXV0eS9iaWctZnJlZWRpYS1ibGFjay1vcGFsLWJvbGQtYmVhdHMtbWFrZXVwL9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3LmVzc2VuY2UuY29tL2JlYXV0eS9iaWctZnJlZWRpYS1ibGFjay1vcGFsLWJvbGQtYmVhdHMtbWFrZXVwL9IBAA","guidislink":false,"published":"Sat, 30 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=364, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVzc2VuY2UuY29tL2JlYXV0eS9iaWctZnJlZWRpYS1ibGFjay1vcGFsLWJvbGQtYmVhdHMtbWFrZXVwL9IBAA?oc=5\" target=\"_blank\">Big Freedia’s Black Opal Collaboration Is All About Bounce<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Essence<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Big Freedia’s Black Opal Collaboration Is All About Bounce - Essence","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmVzc2VuY2UuY29tL2JlYXV0eS9iaWctZnJlZWRpYS1ibGFjay1vcGFsLWJvbGQtYmVhdHMtbWFrZXVwL9IBAA?oc=5\" target=\"_blank\">Big Freedia’s Black Opal Collaboration Is All About Bounce<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Essence<\/font>","source.href":"https:\/\/www.essence.com","source.title":"Essence","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Erika Goldring\/ Getty Images When we envision Big Freedia, we see glamorous looks, full beats, and bold takes on beauty. So, why not launch a makeup line? “I had been talking about doing a line of makeup for a long time,” Big Freedia tells ESSENCE. The New Orleans bounce artist partnered with beauty brand Black Opal on her first, limited edition makeup collection: Bold Beats. “When they reached out to me, I was very familiar with the brand,” she says. Founded by Carol Jackson-Mouyiaris in 1994, “Black Opal is the biggest Black-centric make-up line that I’m aware of.” As for the inspiration? Naturally, “Bounce music and culture,” she says. “Every product is named after a Bounce beat, move, or one of my signature phrases.” The five product collection includes the Bounce Eyeshadow Palette, Swiggle Wiggle Nails, and three eyelash styles: The Girl Down, lightweight lashes; Ya Besta Believe, rhinestone and voluminous lashes; and Yaka Yaka, long and luscious lashes. These beauty products are all integral to Big Freedia’s most iconic beats. Think: bold, saturated colors radiating the full scope of her personality. Freedia had also been using the brand’s makeup well before the collaboration, especially the eyeshadows, which speaks to the quality of the product. “BLACK OPAL gave me a lot of creative license,” she tells ESSENCE. Even so, “they were extremely helpful in teaching me how to work with cosmetic ingredients, quality-control, packaging” and other developments throughout the collection. Announcing the new line in an Instagram post, Freedia shares with her fans how Bold Beats was her creative outlet, telling us “this fell right in line with what I wanted to do with my makeup line.” At the foundation of it all, however, her iconic beauty falls back on skincare and confidence. “No matter how tired I am, I wash my face every night, exfoliate [and use] a face mask (once a week), and moisturize,” she says. But even with her success, Big Freedia’s key to confidence is knowing how to “bounce” back from hardships. Similar to the message behind Beyoncé’s hit song, “Break My Soul,” which she was featured on, “rejection is part of life– and an important part of building strength.”","filter_flag":1}
{"title":"Lubrizol's 2023 Innovations Advanced Mobility, Improved Wellbeing and Enhanced Modern Life - Business Wire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTIwNjMzODM0Ni9lbi9MdWJyaXpvbCVFMiU4MCU5OXMtMjAyMy1Jbm5vdmF0aW9ucy1BZHZhbmNlZC1Nb2JpbGl0eS1JbXByb3ZlZC1XZWxsYmVpbmctYW5kLUVuaGFuY2VkLU1vZGVybi1MaWZl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTIwNjMzODM0Ni9lbi9MdWJyaXpvbCVFMiU4MCU5OXMtMjAyMy1Jbm5vdmF0aW9ucy1BZHZhbmNlZC1Nb2JpbGl0eS1JbXByb3ZlZC1XZWxsYmVpbmctYW5kLUVuaGFuY2VkLU1vZGVybi1MaWZl0gEA?oc=5","id":"CBMimgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTIwNjMzODM0Ni9lbi9MdWJyaXpvbCVFMiU4MCU5OXMtMjAyMy1Jbm5vdmF0aW9ucy1BZHZhbmNlZC1Nb2JpbGl0eS1JbXByb3ZlZC1XZWxsYmVpbmctYW5kLUVuaGFuY2VkLU1vZGVybi1MaWZl0gEA","guidislink":false,"published":"Wed, 06 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=340, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTIwNjMzODM0Ni9lbi9MdWJyaXpvbCVFMiU4MCU5OXMtMjAyMy1Jbm5vdmF0aW9ucy1BZHZhbmNlZC1Nb2JpbGl0eS1JbXByb3ZlZC1XZWxsYmVpbmctYW5kLUVuaGFuY2VkLU1vZGVybi1MaWZl0gEA?oc=5\" target=\"_blank\">Lubrizol's 2023 Innovations Advanced Mobility, Improved Wellbeing and Enhanced Modern Life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Wire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lubrizol's 2023 Innovations Advanced Mobility, Improved Wellbeing and Enhanced Modern Life - Business Wire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTIwNjMzODM0Ni9lbi9MdWJyaXpvbCVFMiU4MCU5OXMtMjAyMy1Jbm5vdmF0aW9ucy1BZHZhbmNlZC1Nb2JpbGl0eS1JbXByb3ZlZC1XZWxsYmVpbmctYW5kLUVuaGFuY2VkLU1vZGVybi1MaWZl0gEA?oc=5\" target=\"_blank\">Lubrizol's 2023 Innovations Advanced Mobility, Improved Wellbeing and Enhanced Modern Life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Wire<\/font>","source.href":"https:\/\/www.businesswire.com","source.title":"Business Wire","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Lubrizol launched new products and extensions in 2023 aimed to help solve customer challenges as part of its purpose to leverage science to advance mobility, improve wellbeing and enhance modern life. (Graphic: Business Wire) Lubrizol launched new products and extensions in 2023 aimed to help solve customer challenges as part of its purpose to leverage science to advance mobility, improve wellbeing and enhance modern life. (Graphic: Business Wire) CLEVELAND--(BUSINESS WIRE)--For 95 years, Lubrizol has been synonymous with breakthrough scientific innovation, and 2023 was no exception. The company launched new products and extensions in 2023 aimed to help solve customer challenges as part of its purpose to leverage science to advance mobility, improve wellbeing and enhance modern life. “Lubrizol has a relentless drive for innovation – both in the decisions we make today and the solutions we create for tomorrow,” said Lubrizol Chief Technology Officer Julie Edgar. “As a core pillar of our organization, innovation propels our purpose and creates opportunities for our customers and those they serve, and we’re proud of the new innovations and extensions introduced as part of our portfolio this year, several of which were recognized through leading award programs.” Among the company’s 2023 innovations and extensions: Eco-friendly lubricant additives Growing demand for lubricants with improved environmental properties has been driven by increasingly stringent regulatory requirements. Lubrizol’s EcoAssurant™ portfolio meets that need through environmentally acceptable finished fluids, additive packages and components. The product family is designed to help industrial fluid and lubricant manufacturers accelerate the speed to bring environmentally acceptable lubricant (EAL) offerings to the market with confidence. Enabling sustainable beauty products Increasingly eco-conscious consumers and a rigorous regulatory environment are driving a shift to silicone-free beauty products. Lubrizol’s SilSense™ Bio 5 emollient is a sustainable silicone alternative, bringing unique sensory experience and proven performance to skin, hair, sun care and makeup applications. This innovation was recognized by the industry with the Makeup Bar Silver award at in-cosmetics® Global and Innovation Awards. A preventive approach to aging More than ever, younger consumers are looking for a science-based skin care that offers preventative solutions to slow the signs of aging. Argireline® YOUth peptide is an oil-soluble version of the well-known Argireline® peptide, thanks to the proprietary LipoClear™ inverse micelle delivery system. The active ingredient shows efficacy against the areas of greatest concern among young generations, helping to prevent the emergence of future expression wrinkles. Advancing new beauty aesthetic trends Today’s consumers are drawn to a new “phygital\" beauty aesthetic that blends the physical and digital worlds, emphasizing facial sculpting by reshaping the face, raising the cheekbones and bringing increased attention to the eyes. Lubrizol’s sustainable Uplevity™ e-Lift peptide helps achieve this effect by mimicking the benefits of microcurrent devices on the skin for an upper face lifted appearance and reduced visibility of wrinkles. It is designed and produced according to the principles of green chemistry. Carbopol® polymers continue to outperform in countless applications and categories Carbopol® polymers have remained front and center for decades—and for good reason. Engineered with varying levels of crosslinking in powder or liquid emulsion form, they inspire boundless formulating opportunities that are both distinctive and functionally diverse. This high value application has been part of our portfolio for 60 years and continues to drive value with new formulations and uses, including Carbopol® polymers for nutraceuticals, which create a convenient way to make tablets smaller and easier to take, while delivering stable sustained release for consistent delivery of the nutraceutical actives and Carbopol® SC-800 polymer designed to thicken and stabilize challenging-to-thicken skin cleansing formulations, particularly mild amino acid surfactant systems and low pH systems, meeting a need in the Asia Pacific region. Accelerating the development of life-saving solutions for patients Lubrizol’s patented Apisolex™ Polymer solubilizing excipient was recognized with multiple awards this year, including the prestigious CPhI Finished Formulation Award and the Medicine Maker Award, for its ability to increase the solubility of active pharmaceutical ingredients (APIs) by as much as 50,000-fold. To continue extending the impact of this solution, this year the company also licensed the Apisolex™ excipient to Welton Pharma to develop and commercialize a formulation to treat colorectal cancers, the third most common cancer and the second leading cause of cancer-related deaths worldwide. Increasing sustainability along the value chain ESTANE® RNW TPU was developed to meet the growing sustainability requirements in a wide range of markets. It has the same reliable performance as traditional EstaneTPU products, but with total or partial bio carbon attribution. This innovation boosts performance with a lower carbon footprint, providing manufacturers with high performance, quality aesthetics and durable products. To learn more about these innovations and others across Lubrizol’s award-winning portfolio, visit www.lubrizol.com. About The Lubrizol Corporation The Lubrizol Corporation, a Berkshire Hathaway company, is a specialty chemical company whose science delivers sustainable solutions to advance mobility, improve wellbeing and enhance modern life. Founded in 1928, Lubrizol owns and operates more than 100 manufacturing facilities, sales and technical offices around the world and has more than 8,000 employees. For more information, visit www.Lubrizol.com.","filter_flag":1}
{"title":"New plant-based cosmetic ingredients - CosmeticsDesign-Europe.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMi8yMS9OZXctcGxhbnQtYmFzZWQtY29zbWV0aWMtaW5ncmVkaWVudHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMi8yMS9OZXctcGxhbnQtYmFzZWQtY29zbWV0aWMtaW5ncmVkaWVudHPSAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMi8yMS9OZXctcGxhbnQtYmFzZWQtY29zbWV0aWMtaW5ncmVkaWVudHPSAQA","guidislink":false,"published":"Fri, 22 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=356, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMi8yMS9OZXctcGxhbnQtYmFzZWQtY29zbWV0aWMtaW5ncmVkaWVudHPSAQA?oc=5\" target=\"_blank\">New plant-based cosmetic ingredients<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New plant-based cosmetic ingredients - CosmeticsDesign-Europe.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1ldXJvcGUuY29tL0FydGljbGUvMjAyMy8xMi8yMS9OZXctcGxhbnQtYmFzZWQtY29zbWV0aWMtaW5ncmVkaWVudHPSAQA?oc=5\" target=\"_blank\">New plant-based cosmetic ingredients<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Europe.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-europe.com","source.title":"CosmeticsDesign-Europe.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Plant-based emollient​ Sonneborn LLC has launched SonneNatural™ NXG, a new plant-based emollient that enhances lip balm, lipstick, body lotion and facial scrub formulations. The ingredient has firmness and sensory properties and reduces the amount of thickener or wax needed in the end formulation for anhydrous formulas. It’s been specially developed with an occlusive agent to help stabilise cosmetic formulas, making it a perfect plant-based alternative to lanolin or other animal-based emollients. Upcycled skin care active​ Expanscience has transformed one of its flagship active ingredients to improve skin elasticity and reshape facial contours into an organic version, CO2LLAGENEER® Bio. The active ingredient is obtained by a supercritical CO2 extraction process. It’s an upcycled by-product of the agri-food industry and organic-certified at 95.4% by Ecocert Greenlife, according to the COSMOS standard. The ingredient is based on a concentration of lupéol, extracted from the seeds of French sweet white lupine, from the West of France. This is then combined with organic oleic sunflower oil. In-vitro tests demonstrates that the active ingredient stimulates collagen synthesis to improve skin elasticity, and reshapes and firms areas prone to sagging. It also stimulates the production of quality collagen by activating the chaperone protein HSP47 (Heat Shock Protein), contributing to its optimal organisation and structure. Circular ingredient with malodour counteracting effects The ‘circular chemistry’ ingredient holds promising malodour counteracting properties, according to Barcelona-based Eurofragance. The new ingredient is based upon a previous launch L’Âme du Bois – a proprietary upcycled ingredient made from discarded sawdust of western red cedarwood. It’s created from the natural crystallisation process to precipitate and extract methyl thujate present in the wood’s essential oil as crystals. Verdenix™ was then obtained by similarly treating the residues from producing the first ingredient. Eurofragance’s R&D team worked with perfumers to incorporate it into existing or new fragrance compositions and it gives the typical olfactive notes of cedarwood, which makes it relatively easy to integrate into perfume formulas as a bottom note. The ingredient also works to eliminate and harmonise malodours. It was tested on a variety of smells, such as tobacco, and it reduced malodour perception up to 80%, which is equivalent or even above other similar chemicals, such as citral or ethylene brassylate. Multi-purpose active based on alfalfa ​ The multifunctional natural active is enriched in alfalfa galactomannans, which enhances the beauty of all skin types, and its efficacy has been demonstrated on various panels. To develop the active ingredient enriched in galactomannans, SILAB used the seeds of the alfalfa plant from certified organic farms selected in France with a secure, traceable supply. It then combined its expertise in tissue engineering and transcriptomics to explore the transversal activity spectrum of the ingredient on the biological pathways essential for epidermal and dermal functions. A large-scale exploratory study has been established that the ingredient stimulates epidermal functionalities by modulating the biological pathways related to the physical and water barrier, the immune barrier, and the anchoring of the epidermis to the dermis; and reinforces the dermal matrix quality by boosting the synthesis of collagen I and reducing the synthesis of MMP-1. Upcycled citrus byproduct CP Kelco’s KELCOSENSTM Citrus Fiber has been certified as an upcycled ingredient by the Upcycled Food Association. The ingredient is upcycled from spent citrus peels, a byproduct of the juice industry near the company’s manufacturing facility in Brazil. With a circular approach, leftover materials from the citrus fibre production process are repurposed and nutrients in the process water are used to fertilise local crops, such as sugar cane. The personal care ingredient can be used in a range of products, from silky serums to luxe creams, to help formulators stabilise emulsifier-free formulations and deliver different textures. Cold-pressed black seed oil ​ B’utyQuin™ TriNutra’s cold-pressed black seed oil (BSO) standardised to 3% thymoquinone, the key phytonutrient, with low free fatty acids (<2%) to maintain its purity, quality, stability and bioavailability. It has been shown in vitro​ and clinically to possess antimicrobial, antioxidant, anti-inflammatory and mitochondrial functionality improvement properties to improve and protect skin and scalp health. One published in-vitro study​ demonstrated B’utyQuin’s ability to both support the maintenance of a healthy skin and gut microbiome via anti-bacterial and antifungal activity against pathogens. The study investigated four black seed oil products from different origins with varying levels of thymoquinone and free fatty acid content. Of the four products, B’utyQuin was superior in its ability to inhibit the overgrowth of Malassezia furfur​, Candida albicans​ and Staphylococcus aureus​.","filter_flag":1}
