{"title":"Why is recycling so important? The dirty truth behind our trash - ZME Science","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA","guidislink":false,"published":"Fri, 28 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=118, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5\" target=\"_blank\">Why is recycling so important? The dirty truth behind our trash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZME Science<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why is recycling so important? The dirty truth behind our trash - ZME Science","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5\" target=\"_blank\">Why is recycling so important? The dirty truth behind our trash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZME Science<\/font>","source.href":"https:\/\/www.zmescience.com","source.title":"ZME Science","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Facebook X LinkedIn Pinterest Email Recycling is about much more than just reducing the amount of waste sent to the landfill, with a long list of benefits that aren’t limited to the environment — there are economic and social advantages too. Even as we live in a consumer-driven world, with a growing appetite for new things, if we begin to look at the waste created by this level of consumption in a different light, we might turn our problem into an opportunity. Credit Flickr What is recycling? Every day, we produce a vast amount of waste that ends up in landfills or polluting our oceans. From plastic bottles to food packaging, our throwaway culture is taking a toll on the environment. Recycling is one of the most effective ways to reduce the amount of waste that goes to landfills and to mitigate the negative impact on the planet. Whether it’s plastic, paper, or aluminum, the products, and materials that can be used after they fulfill their original purpose are far from worthless. In fact, most materials have great recycling value. The EPA estimates that up to 75% of all the waste can be recycled or repurposed, a figure that shows how impactful the process can be if done right. Almost everything we see around us can be technically recycled, although different materials require different techniques when they are recycled. Most of the commonly recyclable materials include batteries, biodegradable waste, clothing, electronics, garments, glass, metals, paper, plastics, and a lot more. Recycling is the process of separating, collecting, and remanufacturing or converting used or waste products into new materials. But if we want to truly focus on recycling, it’s important to change the way we address it both on a personal and societal level. Recycling helps extend the life and usefulness of something that has already served its initial purpose by returning it to its raw materials and then using those materials to produce something that is usable. It’s part of the three golden rules of sustainability (Reduce, Reuse, and Recycle) and has a lot of benefits both to us humans and to the environment. Virtually all of the environment is impacted by how much we recycle. Benefits of recycling The world’s natural resources are finite, and some are in very short supply. At a fundamental level, recycling paper and wood can save trees and forests, recycling plastic means creating less new polluting plastic, recycling metals means there’s less need for hugely costly mining, and recycling glass reduces the use of new raw materials like sand that affect coastal systems. Of course, the reality of it is much more complex, but the fundamental process is valid nonetheless. Some materials are technically recyclable, but doing so is so expensive it virtually never happens, while other materials retain their properties better than others. Metals, for instance, are repeatedly recyclable, while maintaining most or all of their properties. The most obvious benefit of recycling is the reduction of landfill waste. Landfills are rapidly filling up, and many cities are struggling to find new places to dump their trash. Recycling reduces the amount of waste that goes to landfills, making it a vital solution to the problem of overflowing landfills. When we recycle, we give new life to materials that would otherwise end up in a landfill. Recycling reduces the need to grow, harvest, or extract new raw materials from the Earth. That, in turn, reduces the harmful disruption and damage being done to the natural world, which means fewer forests cut down, rivers diverted, wild animals harmed or displaced, and less pollution. It’s also much better to recycle existing products than to damage someone else’s community or land during the exploration and exploitation of new raw materials. The demand for new goods has led to more of the poorest and most vulnerable people being displaced from their homes or otherwise exploited. Making products from recycled materials typically requires less energy than making them from new raw materials — sometimes it’s a huge difference in energy. For example, producing new aluminum from old products uses 95% less energy than making it from scratch. For steel, the energy saving is around 70%. Recycling paper saves 60% of the energy required to produce new paper from wood pulp. By conserving energy, we reduce the amount of greenhouse gases emitted during the production process. While not always, manufacturing something the second time around usually consumes far less energy. Because recycling means you need to use less energy on sourcing and processing new raw materials, it produces lower carbon emissions, which means it can help with global warming. It also keeps potentially methane-releasing waste out of landfill sites. Overall, reducing carbon dioxide and other greenhouse gases being emitted into the atmosphere is vital to stop climate change. Recycling also makes economic sense. As a rule of thumb, it’s six times cheaper to dispose of recycled waste than general refuse. So, the more you recycle, and the less you put in the bin, the more money is saved — which should be good for households, businesses, and local public services. Recycling food waste and green waste is a great idea too, often generating lots of valuable compost. Recycling can stimulate the economy in multiple ways. The EPA has shown recycling helps to create jobs in both the recycling and manufacturing industries. Recycling companies need workers to collect, sort, and process materials. These jobs can range from manual labor to high-tech positions, providing employment opportunities for people with different levels of education and skill. A 2016 study said recycling activities account in a single year for 757,000 jobs, $36.6 billion in wages, and $6.7 billion in tax revenues. Recycling also helps protect wildlife. When we dispose of waste improperly, it can end up in our oceans and harm marine life. For example, plastic waste can entangle and suffocate sea turtles and other animals. By recycling, we reduce the amount of waste that ends up in our oceans and protect marine life. The steps of recycling Recycling includes three essential steps, which create a continuous loop, represented by the familiar recycling symbol. The first one is to actually collect the recyclables, which can be done in different ways. For example, they can be collected from the curbside, dropped off at centers, or gathered through deposit or refund programs. Following the collection, recyclables are sent to a recovery facility where they are sorted, cleaned, and processed into materials that can be used in manufacturing. Recyclables are then bought and sold just like raw materials would be, and prices go up and down depending on supply and demand. A growing number of products are being manufactured with recycled content. Common household items that contain recycled materials are newspapers, steel cans, plastic laundry detergents, and soft drink containers. Recycled materials are also used in new ways such as recovered glass in asphalt to pave roads. Consumers can help close the recycling loop by buying new products made from recycled materials. There are thousands of products that contain recycled content. When you go shopping, look for products that can be easily recycled and products that contain recycled content. Types of recycled materials It’s important to recycle any materials possible, but one of the most relevant is plastic as it is such a big part of the solid waste that we make. When plastic is sent to a landfill, it does not break down as it’s not biodegradable, and even in ocean water, plastic stays around virtually forever, breaking down into smaller and smaller pieces called microplastics. Most plastics are used only once before they are discarded, known as single-use plastics — this type of single-use plastic is already being banned in many parts of the world. Recycling metal is also very important as it saves energy, reduces emissions, and creates jobs. Using recycled metal, known as scrap metal, instead of new metal reduces mining waste by 97% and saves more than 90% on energy, depending on the material. Recycling metals creates six times more jobs than sending the metals to a landfill. The same applies to paper recycling. One ton of recycled paper saves 17 trees and 7,000 gallons of water. It also saves energy, about 4,000 kilowatts of it, enough t power an average American home for six months. Paper takes up a lot of space in landfills, so the more is recycled the better the landfills operate. Like paper, cardboard recycling uses less water, cuts back on emissions, saves prime real estate in landfills for materials that are not recyclable, and prevents deforestation. It is estimated that recycling one ton of cardboard can save 17 trees from harm, and 7,000 gallons of water. Reduce and reuse You may have heard of “The 3 R’s”: Reduce, Reuse, and Recycle. While recycling is important, the most effective way to reduce waste is to not create it in the first place. Making a new product requires a lot of materials and energy and then the product has to be transported to wherever it will be sold. That means reducing and reusing are also important ways to protect the environment. Image via Wikipedia Commons Some of the ways to reduce and reuse include looking for products that use less packaging, which means less raw materials, buying reusable over disposable items, maintaining and repairing products like clothing so they don’t have to be thrown away, as well as borrowing, renting or sharing items that are used infrequently like tools. Reducing our consumption should be the first step, and reusing also tends to be far more sustainable than recycling. Recycling means turning an item into raw materials which can be used again, either for the same product or a new one, while reusing means using an object as it is, without treatment. The reason why recycling is so important is that it prevents pollution, reduces the need to harvest new raw materials, saves energy, reduces greenhouse gas emissions, saves money, reduces the amount of waste that ends up in landfills, and allows products to be used to their fullest extent. Sounds like a no-brainer, eh? If our society wants to truly reach some level of sustainability, recycling needs to play a core role in that, there’s just no alternative. Was this helpful? Thanks for your feedback!","filter_flag":1}
{"title":"FEATURE: \"Horizontal recycling\" tackling waste and giving plastics 2nd life - Kyodo News Plus","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2VuZ2xpc2gua3lvZG9uZXdzLm5ldC9uZXdzLzIwMjMvMDQvNDU0Nzk2ZThmYmUzLWZlYXR1cmUtaG9yaXpvbnRhbC1yZWN5Y2xpbmctdGFja2xpbmctd2FzdGUtYW5kLWdpdmluZy1wbGFzdGljcy0ybmQtbGlmZS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2VuZ2xpc2gua3lvZG9uZXdzLm5ldC9uZXdzLzIwMjMvMDQvNDU0Nzk2ZThmYmUzLWZlYXR1cmUtaG9yaXpvbnRhbC1yZWN5Y2xpbmctdGFja2xpbmctd2FzdGUtYW5kLWdpdmluZy1wbGFzdGljcy0ybmQtbGlmZS5odG1s0gEA?oc=5","id":"CBMihQFodHRwczovL2VuZ2xpc2gua3lvZG9uZXdzLm5ldC9uZXdzLzIwMjMvMDQvNDU0Nzk2ZThmYmUzLWZlYXR1cmUtaG9yaXpvbnRhbC1yZWN5Y2xpbmctdGFja2xpbmctd2FzdGUtYW5kLWdpdmluZy1wbGFzdGljcy0ybmQtbGlmZS5odG1s0gEA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2VuZ2xpc2gua3lvZG9uZXdzLm5ldC9uZXdzLzIwMjMvMDQvNDU0Nzk2ZThmYmUzLWZlYXR1cmUtaG9yaXpvbnRhbC1yZWN5Y2xpbmctdGFja2xpbmctd2FzdGUtYW5kLWdpdmluZy1wbGFzdGljcy0ybmQtbGlmZS5odG1s0gEA?oc=5\" target=\"_blank\">FEATURE: \"Horizontal recycling\" tackling waste and giving plastics 2nd life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kyodo News Plus<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"FEATURE: \"Horizontal recycling\" tackling waste and giving plastics 2nd life - Kyodo News Plus","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2VuZ2xpc2gua3lvZG9uZXdzLm5ldC9uZXdzLzIwMjMvMDQvNDU0Nzk2ZThmYmUzLWZlYXR1cmUtaG9yaXpvbnRhbC1yZWN5Y2xpbmctdGFja2xpbmctd2FzdGUtYW5kLWdpdmluZy1wbGFzdGljcy0ybmQtbGlmZS5odG1s0gEA?oc=5\" target=\"_blank\">FEATURE: \"Horizontal recycling\" tackling waste and giving plastics 2nd life<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kyodo News Plus<\/font>","source.href":"https:\/\/english.kyodonews.net","source.title":"Kyodo News Plus","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"KYODO NEWS - Apr 21, 2023 - 18:43 | Feature, All, Japan A process known in Japan as \"horizontal recycling\" is gaining a foothold, with the practice able to contribute to a more sustainable society while addressing the nation's plastic addiction. Horizontal recycling refers to recovering and processing used products into raw materials to be used to reproduce the original item. For example, although most used plastic bottles are collected and recycled into fiber and other items, such as food trays, beverage manufacturers are now focusing on recycling them into new plastic bottles. But the horizontal recycling movement is expanding beyond that to include refill packs for daily use products like shampoo and dishwashing liquid. By promoting the process, used plastic bottles and other items can be repeatedly recycled into the same thing without the need for new petroleum-derived materials. The recycling of plastics in Japan can be broadly classified into two categories: material recycling, in which waste is converted to raw materials for new products, and chemical recycling, in which waste is chemically decomposed into other substances and used as raw materials to make new products. Plastics are also processed along with other waste via thermal recovery, which involves utilizing heat generated when trash is incinerated. Horizontal recycling falls under the category of material recycling. In October 2021, the municipal government of Kobe in Hyogo Prefecture, western Japan, together with 16 manufacturers of daily-use articles, retailers and recycling companies, launched the \"Kobe Plastic Next\" initiative aimed at providing collection points for refill packaging from detergent, shampoos and other items at 75 retail locations. Among the participants are companies such as cosmetics giants Kao Corp. and Lion Corp. and pharmaceutical firm Earth Corp. Having since added two more participants and three more recycling locations, the project brings together rival companies for the common good. Refill packaging uses 70-80 percent less plastic than the bottles in which the respective products are traditionally sold. Used widely in Japan, the refill packs significantly cut plastic waste generation. According to the Japan Soap and Detergent Association, some 80 percent of daily-use articles are shipped in refill packs in Japan and more refill packs than bottled containers fill the household detergent aisles at many stores. Even so, the film used for the packs is difficult to recycle due to its multi-layered structure made of composite materials, and in many cases, it is treated as burnable waste. Under such circumstances, the Kobe city office thought of somehow recycling the refill packs \"by aiming to return them to the same object using high-level horizontal recycling,\" Mitsunori Shimizu, a city official in charge, said. Kao, which sells large quantities of refill packs, participated in the project out of a fear that such containers if deemed unsuitable to a recycling-oriented society, \"could be subject to restrictions or even seen as 'evil,'\" said Keiji Seto of the research and development section at the Tokyo-based company. At its research center in Wakayama, Kao project leader Seto and his team are devising technology to crush collected refill packs into pellets, which are then converted into film and remade into refill packs. \"We found it was possible that products from all the project participants could be used to make film for use in recycled packs,\" Seto said, adding that Kao plans to roll out recycled refill packs for general consumer use by 2025. Kobe collected 1.13 tons of refill packs in one year. Kiyotake Matsui, assigned to promote sustainable development goals, or SDGs, at Consumers Co-operative Kobe, which has installed recycling bins at its stores, said, \"There is a need as we see that some stores are collecting more refill packs than expected.\" The city will aim to collect 5 tons of refill packs a year to achieve its horizontal recycling goal ahead of schedule to move Japan a step closer toward decarbonization. With inquiries about the project coming into the city and project participants from other local governments and entities, expectations are high that the horizontal recycling initiative will spread nationwide before long. According to Toyota Tsusho Corp., whose subsidiary last October opened a horizontal recycling factory in Hino, Shiga Prefecture, Japan recovers about 97 percent of its plastic bottles. But of the approximately 290,000 tons recycled, roughly 70 percent are processed into food trays, car interior materials, among other objects, and ultimately incinerated.","filter_flag":1}
{"title":"Johnson Controls launches a partnership with Nucor to recycle nearly 100% of scrap steel at major Johnson Controls ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2pvaG5zb24tY29udHJvbHMtbGF1bmNoZXMtYS1wYXJ0bmVyc2hpcC13aXRoLW51Y29yLXRvLXJlY3ljbGUtbmVhcmx5LTEwMC1vZi1zY3JhcC1zdGVlbC1hdC1tYWpvci1qb2huc29uLWNvbnRyb2xzLWZhY2lsaXRpZXMtaW4tdGhlLXVuaXRlZC1zdGF0ZXMtMzAxODAyNTE4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2pvaG5zb24tY29udHJvbHMtbGF1bmNoZXMtYS1wYXJ0bmVyc2hpcC13aXRoLW51Y29yLXRvLXJlY3ljbGUtbmVhcmx5LTEwMC1vZi1zY3JhcC1zdGVlbC1hdC1tYWpvci1qb2huc29uLWNvbnRyb2xzLWZhY2lsaXRpZXMtaW4tdGhlLXVuaXRlZC1zdGF0ZXMtMzAxODAyNTE4Lmh0bWzSAQA?oc=5","id":"CBMiyQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2pvaG5zb24tY29udHJvbHMtbGF1bmNoZXMtYS1wYXJ0bmVyc2hpcC13aXRoLW51Y29yLXRvLXJlY3ljbGUtbmVhcmx5LTEwMC1vZi1zY3JhcC1zdGVlbC1hdC1tYWpvci1qb2huc29uLWNvbnRyb2xzLWZhY2lsaXRpZXMtaW4tdGhlLXVuaXRlZC1zdGF0ZXMtMzAxODAyNTE4Lmh0bWzSAQA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2pvaG5zb24tY29udHJvbHMtbGF1bmNoZXMtYS1wYXJ0bmVyc2hpcC13aXRoLW51Y29yLXRvLXJlY3ljbGUtbmVhcmx5LTEwMC1vZi1zY3JhcC1zdGVlbC1hdC1tYWpvci1qb2huc29uLWNvbnRyb2xzLWZhY2lsaXRpZXMtaW4tdGhlLXVuaXRlZC1zdGF0ZXMtMzAxODAyNTE4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Johnson Controls launches a partnership with Nucor to recycle nearly 100% of scrap steel at major Johnson Controls ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Johnson Controls launches a partnership with Nucor to recycle nearly 100% of scrap steel at major Johnson Controls ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiyQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2pvaG5zb24tY29udHJvbHMtbGF1bmNoZXMtYS1wYXJ0bmVyc2hpcC13aXRoLW51Y29yLXRvLXJlY3ljbGUtbmVhcmx5LTEwMC1vZi1zY3JhcC1zdGVlbC1hdC1tYWpvci1qb2huc29uLWNvbnRyb2xzLWZhY2lsaXRpZXMtaW4tdGhlLXVuaXRlZC1zdGF0ZXMtMzAxODAyNTE4Lmh0bWzSAQA?oc=5\" target=\"_blank\">Johnson Controls launches a partnership with Nucor to recycle nearly 100% of scrap steel at major Johnson Controls ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Johnson Controls has launched a closed-loop steel recycling partnership program with Nucor in the US The program will salvage nearly 100% of secondary scrap steel at major Johnson Controls facilities in the US, amounting to thousands of tons per year, repurposing it as low-embodied-carbon steel. Johnson Controls sources over 70% of steel in the US and 45% globally from recycled materials, as part of its program to reduce embodied carbon across its product portfolio. MILWAUKEE, April 20, 2023 \/PRNewswire\/ -- Johnson Controls (NYSE: JCI), a global leader for smart, healthy and sustainable buildings, today announced the launch of a program for recycling steel, through a collaboration with Nucor Corporation, the largest steel producer and recycler in North America. Johnson Controls is engaged globally to use our purchasing power to accelerate the adoption of near net zero steel. Post this Over 70% of Johnson Controls steel purchases in the US and 45% globally are manufactured from recycled scrap materials. The program with Nucor will recycle nearly 100% of that secondary scrap steel again, amounting to thousands of tons each year, at major Johnson Controls manufacturing sites in the US. Nucor will remelt the scrap steel using electric arc furnace (EAF) technology, which generates approximately 75% less emissions than traditional blast furnace manufacturing. The remelted steel will be sold back to Johnson Controls for use in manufacturing. This closed-loop recycling process is a highly efficient form of circularity that is especially well suited to metals like steel, which retain their robust material structures through multiple rounds of recycling and repurposing. Johnson Controls is engaged globally to use our purchasing power to accelerate the adoption of near net zero steel, including being a founding member of the First Movers Coalition, an organization initiated by the US State Department and the World Economic Forum. \"With our smart building technology trifecta – energy-efficient equipment, clean electrification, and systemic digitalization – we have already reached the point of being able to help customers reduce building operational emissions to net zero,\" says Katie McGinty, Vice President and Chief Sustainability and External Affairs Officer at Johnson Controls. \"However, embodied carbon emissions in hard-to-abate sectors like steel are much more challenging. We are unravelling the complexities of embodied carbon, by addressing the challenge from different angles: from low-carbon steel purchases to steel recycling, material recycling, and overall product footprint reduction. This partnership with Nucor will allow us to accelerate upstream decarbonization significantly through the further recycling of thousands of tons of steel every year. We are excited not only about the immediate resource and emissions reductions, but also about the long-term ripple effect this closed-loop recycling partnership will have for resource, energy and emissions savings.\" \"We are excited to work more closely with Johnson Controls and build on our longstanding relationship by developing this recycling program,\" said Noah Hanners, Executive Vice President of Raw Materials for Nucor Corporation. \"Nucor pioneered the use of EAF technology in the late 1960s, and we are now one of the cleanest, most sustainable steel producers in the world. We formed Nucor Industrial Recycling to work with our steel customers to find new and better ways to return steel scrap directly from manufacturing facilities to our steel mills for re-melting to make new steel products. This closed-loop recycling program is a great example of how we work with our customers to improve resource efficiency in the steel supply chain.\" Johnson Controls Recognition for ESG & Sustainability: To read more about Johnson Controls commitment to sustainability, please visit: https:\/\/www.johnsoncontrols.com\/corporate-sustainability\/environment. INVESTOR CONTACT: MEDIA CONTACT: Jim Lucas Olivia Coker-Decker Direct: +1 651 391 3182 Direct: +41 79 672 10 53 Email: [email protected] Email: [email protected] About Nucor Nucor and its affiliates are manufacturers of steel and steel products, with operating facilities in the United States, Canada and Mexico. Products produced include: carbon and alloy steel -- in bars, beams, sheet and plate; hollow structural section tubing; electrical conduit; steel racking; steel piling; steel joists and joist girders; steel deck; fabricated concrete reinforcing steel; cold finished steel; precision castings; steel fasteners; metal building systems; insulated metal panels; overhead doors; steel grating; and wire and wire mesh. Nucor, through The David J. Joseph Company and its affiliates, also brokers ferrous and nonferrous metals, pig iron and hot briquetted iron \/ direct reduced iron; supplies ferro-alloys; and processes ferrous and nonferrous scrap. Nucor is North America's largest recycler. About Johnson Controls At Johnson Controls (NYSE: JCI), we transform the environments where people live, work, learn and play. As the global leader in smart, healthy and sustainable buildings, our mission is to reimagine the performance of buildings to serve people, places and the planet. Building on a proud history of nearly 140 years of innovation, we deliver the blueprint of the future for industries such as healthcare, schools, data centers, airports, stadiums, manufacturing and beyond through OpenBlue, our comprehensive digital offering. Today, with a global team of 100,000 experts in more than 150 countries, Johnson Controls offers the world's largest portfolio of building technology and software as well as service solutions from some of the most trusted names in the industry. Visit www.johnsoncontrols.com for more information and follow @Johnson Controls on social platforms. SOURCE Johnson Controls International plc","filter_flag":1}
{"title":"GUNPLA (GUNDAM Plastic Models) Recycling Project \/ METI Ministry of Economy, Trade and Industry - meti.go.jp","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm1ldGkuZ28uanAvZW5nbGlzaC9tb2JpbGUvMjAyMy8yMDIzMDQyODAwMWVuLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm1ldGkuZ28uanAvZW5nbGlzaC9tb2JpbGUvMjAyMy8yMDIzMDQyODAwMWVuLmh0bWzSAQA?oc=5","id":"CBMiPWh0dHBzOi8vd3d3Lm1ldGkuZ28uanAvZW5nbGlzaC9tb2JpbGUvMjAyMy8yMDIzMDQyODAwMWVuLmh0bWzSAQA","guidislink":false,"published":"Fri, 28 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=118, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm1ldGkuZ28uanAvZW5nbGlzaC9tb2JpbGUvMjAyMy8yMDIzMDQyODAwMWVuLmh0bWzSAQA?oc=5\" target=\"_blank\">GUNPLA (GUNDAM Plastic Models) Recycling Project \/ METI Ministry of Economy, Trade and Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">meti.go.jp<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"GUNPLA (GUNDAM Plastic Models) Recycling Project \/ METI Ministry of Economy, Trade and Industry - meti.go.jp","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3Lm1ldGkuZ28uanAvZW5nbGlzaC9tb2JpbGUvMjAyMy8yMDIzMDQyODAwMWVuLmh0bWzSAQA?oc=5\" target=\"_blank\">GUNPLA (GUNDAM Plastic Models) Recycling Project \/ METI Ministry of Economy, Trade and Industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">meti.go.jp<\/font>","source.href":"https:\/\/www.meti.go.jp","source.title":"meti.go.jp","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Operation Gundam R', Experiential Events Featuring the GUNPLA Recycling Project Held Nationwide\" Plastic models of characters from the popular TV animation series \"Mobile Suit Gundam,\" known in Japan as \"GUNPLA,\" (Gundam Plastic Models) were a social phenomenon among young people back in the 1980’s. Some forty years on, GUNPLA still attracts fans of all ages. Now, the Bandai Namco Group, the maker of the Gundam plastic models, are partnering with these fans to take on the challenge of recycling resources. The \"GUNPLA Recycling Project\" The \"GUNPLA Recycling Project\" launched by four Bandai Namco Group companies involves the collection of “runners,” which are the disposable frames that hold the plastic model parts in the original package, turning the runners into new plastic models. This is done through cutting-edge chemical recycling technology. Collected runners, together with other waste plastics from the Bandai Hobby Center, a plant that produces GUNPLA, are recycled for use in three ways. First, some are used for demonstration experiments of the latest chemical recycling technology. These demonstrations involve chemically decomposing polystyrene, the main materials used in plastic models, and recycling it into styrene monomer, a key raw material of polystyrene. This technology makes it possible to recycle used plastics into new plastics that can be reused in a broad range of applications including new GUNPLA models. Second, collected runners are also partially used for material recycling and recycled into resin for \"ECOPLA,\" (Eco Plastic Models) and are reborn as new GUNPLA. In cooperation with partner companies, the remainder of the collected runners are reused for thermal recycling for sustainable power generation. \"GUNPLA Recycling Project partners with fans of these iconic plastic models\" Maximizing the Efficiency of Recycling The GUNPLA Recycling Project aims to achieve highly-efficient recycling by collecting runners in a way that minimizes the resources required for crushing and reuse. Bandai Namco Group has installed dedicated collection boxes at its approximately 200 namco stores nationwide as well as other stores belonging to the Group. Trucks making deliveries of goods to those stores collect runners on their return trips to minimize the burden related to the distribution process. Since the Since GUNPLA are all Bandai Namco products with familiar components, the company can reuse the plastic for new plastic models by employing a simple crushing process. Participation in Resources Recycling Starting from \"Love for GUNPLA\" \"New products, 'ECOPLA,' created through recycling\" Since their launch, GUNPLA models have continued to be much loved and cherished by their many fans. The experiences of the parents are handed down to their children and GUNPLA becomes a source of fun for people across generations. As resources recycling has attracted people's attention, the new concept of fan-based recycling programs like this emerged and have been making further progress. The love of the GUNPLA fans will lead to higher awareness of resource recycling and will contribute to creating a more sustainable society. Plastic is ubiquitous in modern society because it can be used in such a wide range of applications. Yet there is a growing global awareness of the very significant problems linked to the management and disposal of plastic waste, such as marine plastic. Japan recognizes that the scale of the problem requires urgent attention. Building on Japan’s strong track in the 3Rs (reduce, reuse, recycle), METI is promoting new legislation in this area. Effective from April 2022, the Act on Promotion of Resource Circulation for Plastics is designed to strengthen programs that promote the recycling and reuse of plastic resources in Japan. Related Website","filter_flag":1}
{"title":"How yachts are disposed of – and why it's so environmentally toxic - Yachting Monthly","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA","guidislink":false,"published":"Thu, 13 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=103, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5\" target=\"_blank\">How yachts are disposed of – and why it's so environmentally toxic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yachting Monthly<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How yachts are disposed of – and why it's so environmentally toxic - Yachting Monthly","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5\" target=\"_blank\">How yachts are disposed of – and why it's so environmentally toxic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yachting Monthly<\/font>","source.href":"https:\/\/www.yachtingmonthly.com","source.title":"Yachting Monthly","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"The marine industry is puzzling over how to dispose safely of redundant, environmentally toxic GRP-built craft. Ollie Taylor investigates The annual volume of composite waste generated by the marine industry each year is a staggering 55,000 tonnes – and it’s predicted to increase by 10% every year in the near future as more and more leisure yachts reach their end of life (EOL). Glass reinforced plastic (GRP), commonly known as fibreglass, is the wonder material that created the modern leisure marine industry back in the 1960s, transforming what was once an artisanal, predominantly wood-based industry, into the high volume mass production model now pumping out an estimated 10,000 new boats in the UK alone each year. However, GRP, and the successful lightweight, rigid structures it produces were never designed with an EOL solution in mind, leaving today’s boatbuilding industry scratching its head for a solution to what is becoming an increasingly urgent problem. There are an estimated six million boats in the EU at the moment, 95% of which are made of GRP. Each year, 1-2% (60,000-120,000) reach the end of their usable life. The fate of these craft is relatively unknown but it’s estimated that only 2,000-3,000 are properly recycled each year. And, unfortunately, there are several fundamental challenges that currently restrict the marine industry and its ability to solve this problem. Composite structures, such as GRP, by their very nature are designed to last a long time, delivering very specific material properties. Stronger than many metals by weight, non-conductive, and with the ability to be moulded into highly complex shapes, GRP is the perfect material for making boats in high volumes and at low cost. However, the process of combining glass fibre with a thermoset resin to achieve the properties modern designs need results in a structure that was never meant to ever be separated again. So why has this problem not been addressed before now? The average lifespan of mixed composite laminates is anywhere between 25 to 100 years, and most usually towards the latter end of that scale. Given that GRP was widely adopted in the marine industry during the 1960s and 1970s, we are only now reaching the point where a high volume of vessels are beginning to reach the end of their life. This ticking time bomb is combining with a fast-evolving and much stricter waste control landscape than seen in previous decades. A number of European countries have banned, or soon will ban, fibreglass waste from landfill completely, so finding a secondary purpose for waste GRP will be critical. By reducing our demand for virgin raw materials, and thereby reducing our negative impact on the environment, we can begin to solve this urgent and growing problem for the maritime industry. Recycling technologies Five main recycling technologies offer potential solutions to how we can deal with the 55 kilotons of GRP waste the industry creates each year: mechanical grinding; incineration with energy recovery; co-processing in cement production; pyrolysis; and solvolysis. Mechanical grinding is the most widely available recycling process, although still only at a small scale compared to other processes such as glass recycling. It takes small to medium-size GRP panels through multiple stages of crushing and grinding to reduce the material into small fragments or powder. It doesn’t separate the fibre from the resin, or any other laminate reinforcements (plywood or foam core, for instance). Instead, it lumps everything together, resulting in a material that has limited mechanical properties and thus very low financial value. The recyclate can be used as a filler or bulk agent in new composite products. However, market demand for it is low, while the cost and energy required to complete the process is relatively high. Incineration with energy recovery converts fibreglass panels into energy by burning the organic resin element to create heat which can be converted to electricity via steam turbines. Unfortunately, the glass fibre element has no calorific value and limits the ability for generating energy. It has also been documented that using domestic refuse incinerators for GRP tends to overload the incinerator and displaces domestic refuse which may end up in landfill rather than being incinerated. The biggest challenge is the creation of bottom ash from the process which is typically sent to landfill. Very few commercial incinerator operators actively choose to take GRP waste as it’s a tricky material to deal with. Co-processing in cement production uses almost 100% of the EOL composite. During co-processing the waste is simultaneously used as both an energy source (the resin) and a raw material input (the fibres) into clinker cement production. There is a growing consensus that this solution could significantly reduce the greenhouse gas emissions of the cement industry whilst also solving the EOL composite waste conundrum. Cement production is one of the world’s biggest causes of carbon pollution, responsible for 7% of global emissions, equivalent to more than any country except China and the US. Unfortunately, this process is still operating at a relatively small scale, but we’re likely to see a widespread scaling up of the technology in the near future. However, it is still considered to be ‘downcycling’ as you are not actually reclaiming the original material inputs. Pyrolysis and solvolysis both use a combination of high heat (pyrolysis) and chemicals (solvolysis) in the absence of oxygen to break the composite down into its separate fibre and resin components. The incineration temperatures range from 300-700°C and essentially burn the resin from the fibre. It currently only operates at academic or pilot scale. The very high cost of running the process means it’s geared towards carbon fibre reclamation only. The benefit is that you end up with the raw fibre, which can be reused. The downside is that recycled fibre is short and discontinuous, requiring further processing. Lineat, a new company based in Bristol has come up with an innovative solution for realigning the reclaimed fibres into uni-directional discontinuous fibre tapes that can be used in a wide range of new composite products. The tapes retain >75% of the strength and >85% of the stiffness of continuous virgin carbon fibre tapes. The process takes the short, reclaimed fibres and immerses them in a liquid which is then fired through a small nozzle to realign all the fibres into a straight line. The newly aligned fibres are then combined with a resin to create a pre-preg tape. Again, this technology is operating at a small scale, but it has proven that we are now able to use reclaimed carbon fibre. Price incentives The key barrier to all of these processes reaching widespread scale and adoption is money. The price of virgin raw materials remains incredibly low, and the incentive to use recycled raw materials is almost non-existent as the price and availability of virgin materials is more attractive. This is combined with the fact that most recycled materials often have worse mechanical properties than the virgin material, and in a world of high performance lightweight structures there is little room for performance trade-offs. Due to the low demand and the commercial value of the recyclate from the processes shown above, few operators are willing to invest in developing suitable infrastructure to perform the process. That leaves the marine industry in the chicken and egg situation of having no suitable infrastructure development and no commercial incentive for investors to fund development. APER scheme However, there is some good news. France’s APER scheme offers a glimpse of what is possible when the marine industry works collaboratively. APER is a world first which requires French manufacturers to pay an ‘eco-contribution’ for every new boat sold. That money is then supplemented by contributions from the national annual taxation on recreational craft, giving the scheme an operating budget to deal with recycling the legacy fleet, partially funded by the new fleet. In 2022, the scheme recycled 2,980 boats and is now building up its infrastructure to deal with around 3,000 vessels per year, ranging from 2.5m to 24m. The scheme currently has 30 approved deconstruction sites across France catering for most regional boating centres. At present, just over 60% of the composite waste is sent for incineration with energy recovery, while the remaining 40% is ‘disposed’ of, although it’s not clear if this simply means landfill. The other main components are separated and sent to their respective material recycling processes. Producer Responsibility The APER scheme is an example of ‘extended producer responsibility’ (EPR), a legislative instrument that will significantly change how new products are designed, used, and treated at EOL in the future. EPR works on the simple premise that the original manufacturer retains responsibility for the item when it reaches its EOL. Legacy fleet So where does this leave the marine industry? The problem can be split into two distinct categories: the legacy fleet; and the new fleet. How we reuse, recycle or recover materials from the legacy fleet remains unclear. What is becoming evident, though, is the need to collaborate across various industries to scale the technology and build the required infrastructure. The marine industry will not solve this problem in isolation. Even then, the need to develop innovative and commercially viable uses for the recyclate itself is paramount. If this can be achieved, the vital investment required to scale the technology will come. Ultimately, the power to completely remove this problem for future generations lies in the hands of designers and engineers, as over 80% of a product’s lifelong environmental impact is determined during the design phase. New fleet The new fleet is potentially easier to solve, as it currently exists within the minds of the industry’s designers and engineers, who have the power to solve this problem permanently. The key lies in the marine industry’s ability to transition to circular models of operation. Much of this will be driven by coming legislation. EPR and the addition of ‘digital product passports’ will require manufacturers to not only take their product back at EOL but also provide full transparency and traceability of a product’s impact across its entire lifespan. All manufacturers will have to change their business models and design production processes to ensure they extract maximum value from the product at EOL. With the increasing availability of bio-based materials, recyclable resin systems and novel ownership models being developed every day, the future looks bright for boatbuilding. Whether the current industry’s heavy hitters choose to take notice and alter their path, however, remains to be seen. Flax future Bio-based materials and natural fibres offer multiple benefits across the life cycle of a vessel. They come from renewable feedstocks that can be regrown on an annual basis and have low global warming potential as they produce fewer greenhouse gas emissions during production. Plant-based fibres also sequester carbon during growth and lock this carbon into the structure for the life of the product. The calorific value of flax-based structures is far greater than GRP as both the fibre and resin get burnt, increasing energy recovery. Flax, if used with a bio-based resin system, will also naturally biodegrade over time, returning the stored carbon to the short-term carbon cycle. German boatbuilder Greenboats has developed a novel concept utilising flax-based laminate panels. It produces interior panels, doors and bulkheads from flax which has NFC (near field communication) chips embedded into the laminate structure to show the user or recycler the complete material content and process for recycling, including strain gauges and temperature sensors, so they know what level of stress a panel has experienced across its 30-year lifespan. Design for Disassembly Another core concept boatbuilders might embrace is ‘design for disassembly’. Lots of work is being done to create reversible bonding joints using thermally expanding graphite particles, for instance, to make splitting bonded composite panels possible. Or even simpler, looking at using traditional panel designs rather than highly complex moulded shapes so the deconstruction at EOL is straightforward, with the resultant panels capable of being reused in new structures. Enjoyed reading this? A subscription to Yachting Monthly magazine costs around 40% less than the cover price. Print and digital editions are available through Magazines Direct – where you can also find the latest deals. YM is packed with information to help you get the most from your time on the water. Take your seamanship to the next level with tips, advice and skills from our experts Impartial in-depth reviews of the latest yachts and equipment Cruising guides to help you reach those dream destinations Follow us on Facebook, Twitter and Instagram.","filter_flag":1}
{"title":"Global Black Mass Recycling Market Report 2023: A $52.99 Million Market by 2029 from $9.22 Million in 2022 - A ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi6QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8xOS8yNjQ5Nzc3LzI4MTI0L2VuL0dsb2JhbC1CbGFjay1NYXNzLVJlY3ljbGluZy1NYXJrZXQtUmVwb3J0LTIwMjMtQS01Mi05OS1NaWxsaW9uLU1hcmtldC1ieS0yMDI5LWZyb20tOS0yMi1NaWxsaW9uLWluLTIwMjItQS1SYXBpZGx5LUV4cGFuZGluZy1NYXJrZXQtYXMtU2FsZXMtb2YtRVZzLUV4cGxvZGUuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi6QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8xOS8yNjQ5Nzc3LzI4MTI0L2VuL0dsb2JhbC1CbGFjay1NYXNzLVJlY3ljbGluZy1NYXJrZXQtUmVwb3J0LTIwMjMtQS01Mi05OS1NaWxsaW9uLU1hcmtldC1ieS0yMDI5LWZyb20tOS0yMi1NaWxsaW9uLWluLTIwMjItQS1SYXBpZGx5LUV4cGFuZGluZy1NYXJrZXQtYXMtU2FsZXMtb2YtRVZzLUV4cGxvZGUuaHRtbNIBAA?oc=5","id":"CBMi6QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8xOS8yNjQ5Nzc3LzI4MTI0L2VuL0dsb2JhbC1CbGFjay1NYXNzLVJlY3ljbGluZy1NYXJrZXQtUmVwb3J0LTIwMjMtQS01Mi05OS1NaWxsaW9uLU1hcmtldC1ieS0yMDI5LWZyb20tOS0yMi1NaWxsaW9uLWluLTIwMjItQS1SYXBpZGx5LUV4cGFuZGluZy1NYXJrZXQtYXMtU2FsZXMtb2YtRVZzLUV4cGxvZGUuaHRtbNIBAA","guidislink":false,"published":"Wed, 19 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=109, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi6QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8xOS8yNjQ5Nzc3LzI4MTI0L2VuL0dsb2JhbC1CbGFjay1NYXNzLVJlY3ljbGluZy1NYXJrZXQtUmVwb3J0LTIwMjMtQS01Mi05OS1NaWxsaW9uLU1hcmtldC1ieS0yMDI5LWZyb20tOS0yMi1NaWxsaW9uLWluLTIwMjItQS1SYXBpZGx5LUV4cGFuZGluZy1NYXJrZXQtYXMtU2FsZXMtb2YtRVZzLUV4cGxvZGUuaHRtbNIBAA?oc=5\" target=\"_blank\">Global Black Mass Recycling Market Report 2023: A $52.99 Million Market by 2029 from $9.22 Million in 2022 - A ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Black Mass Recycling Market Report 2023: A $52.99 Million Market by 2029 from $9.22 Million in 2022 - A ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi6QFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8xOS8yNjQ5Nzc3LzI4MTI0L2VuL0dsb2JhbC1CbGFjay1NYXNzLVJlY3ljbGluZy1NYXJrZXQtUmVwb3J0LTIwMjMtQS01Mi05OS1NaWxsaW9uLU1hcmtldC1ieS0yMDI5LWZyb20tOS0yMi1NaWxsaW9uLWluLTIwMjItQS1SYXBpZGx5LUV4cGFuZGluZy1NYXJrZXQtYXMtU2FsZXMtb2YtRVZzLUV4cGxvZGUuaHRtbNIBAA?oc=5\" target=\"_blank\">Global Black Mass Recycling Market Report 2023: A $52.99 Million Market by 2029 from $9.22 Million in 2022 - A ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Material Recycling\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Dublin, April 19, 2023 (GLOBE NEWSWIRE) -- The \"Black Mass Recycling Market - A Global and Regional Analysis: Focus on Application, Battery Source, Technology, Recovered Metal, and Region - Analysis and Forecast, 2022-2031\" report has been added to ResearchAndMarkets.com's offering. The global black mass recycling market is projected to reach $52,990.87 million by 2031 from $9,220.51 million in 2022, growing at a CAGR of 21.45% during the forecast period 2022-2031. The black mass recycling market is a fast-expanding industry that deals with the reprocessing and recovery of essential metals from discharged lithium-ion batteries. The market for these batteries is anticipated to expand rapidly as electric vehicles gain popularity, which will also fuel the expansion of the black mass market for recycling. In addition, there are a few key players who dominate the black mass recycling market, including Umicore, BASF SE, Tenova S.p.A., and many more. Nonetheless, a large number of new competitors are anticipated to enter the market in the upcoming years, increasing competition and spurring additional growth and innovation. Market Lifecycle Stage The global black mass recycling market is in a growing phase. New trends, such as rising investments in recycling technologies, increasing traction of second-life batteries, change in business models of companies due to climate action, increasing demand for lithium-ion batteries and raw materials across the value chain, and development of economic and environmental technologies, are further expected to provide opportunities for the market to grow in the coming years. Industrial Impact Black mass recycling has a large industry influence since it provides numerous environmental and economic benefits. Furthermore, it has a significant effect on end-use sectors since it provides a plethora of benefits that can increase their efficiency, lower their costs, and give them a consistent source of important metals. With an increased worldwide focus on circular economic principles and the advancements in recycling technologies for the recovery of high-performance metals, there is an increasing shift toward the demand and consumption of lithium-ion batteries in the end-use industries, thereby creating demand for black mass powder. Additionally, the shift is more prominent in the automotive and energy sectors in regions such as China, Asia-Pacific and Japan and Europe. Impact of COVID-19 The COVID-19 epidemic has had a contradictory influence on the black mass recycling business. On the one hand, the pandemic has affected the availability of old lithium-ion batteries for recycling by disrupting the global distribution network. Yet, the epidemic has also boosted the use of electric vehicles, increasing the need for essential metals, and opening up new markets for the black mass recycling industry. Recent Developments in the Black Mass Recycling Market In February 2023, Manganese-rich battery material technology for electric vehicles is being industrialized by Umicore. This significant achievement expands Umicore's wide spectrum of NMC (nickel, manganese, cobalt) battery materials for exceptional productivity, and long-range EVs and introduces a distinctly competitive technology to existing design-to-cost battery technologies for EVs. In September 2022, General Motors Co. and Lithion Recycling invested strategically in Lithion Recycling's Series A fundraising round in support of a new strategic collaboration agreement between the two companies to create a circular battery ecosystem employing Lithion Recycling's cutting-edge battery recycling technology. How can this report add value to an organization? Product\/Innovation Strategy: The product segment helps the reader understand the different sources from where the batteries are coming for recycling and reaching to their best potential globally. Moreover, the study provides the reader with a detailed understanding of the different battery chemistries and their assortments in different batteries employed in various end-use applications in industries such as aerospace, automotive, energy, and others. Growth\/Marketing Strategy: Business expansions, partnerships, acquisitions, collaborations, and joint ventures are some key strategies adopted by key players operating in this space. For instance, in April 2022, in Europe, Umicore and Automotive Cells Company (ACC) formed a strategic cooperation for EV battery materials. With the first commercial volumes anticipated in early 2024, the long-term arrangement will begin with an annual offtake commitment of 13 GWh to a significant platform of a European automaker. Competitive Strategy: Key players in the global black mass recycling market analysed and profiled in the study involve black mass recycling providers. Moreover, a detailed competitive benchmarking of the players operating in the global black mass recycling market has been done to help the reader understand how players stack against each other, presenting a clear market landscape. Additionally, comprehensive competitive strategies such as partnerships, agreements, and collaborations will aid the reader in understanding the untapped revenue pockets in the market. Key Market Players and Competition Synopsis The companies profiled have been selected based on inputs gathered from primary experts and analysing the company's coverage, product portfolio, and market penetration. Market Segmentation Based on battery source, the industrial batteries segment held the majority share in the black mass recycling market in 2021 Based on the recycling technology, the hydrometallurgy technology segment held the majority share in the black mass recycling market in 2021. It is one of the most significant recycling technologies, which meets the requirement of major industrial application areas. Based on the recovered metals segment, nickel was the dominant metal, in the global black mass recycling market in 2021. Based on application, the automotive segment dominated the black mass recycling market in 2021 and was the dominant segment owing to the increased sales of electric vehicles across the globe. China currently controls the majority of the global black mass recycling market due to its enormous electric vehicle industry, top suppliers throughout the supply chain, and rapidly expanding economy. Key Attributes: Report Attribute Details No. of Pages 234 Forecast Period 2022 - 2031 Estimated Market Value (USD) in 2022 $9.22 Billion Forecasted Market Value (USD) by 2031 $52.99 Billion Compound Annual Growth Rate 21.5% Regions Covered Global Industry Outlook Trends: Current and Future Lithium Iron Phosphate (LFP) Batteries to Gain Traction over Nickel Manganese Cobalt (NMC) Batteries Second Life of Batteries and Recycling Business Dynamics Business Drivers Exponential Increase in Electric Vehicles and Consumer Awareness Rising Metal Prices Government Initiatives with Technological Advancements Business Challenges Broad Array of Battery Chemistries Variations in the Prices of Battery Raw Materials (Lithium and Cobalt) Business Strategies Market Developments Corporate Strategies Partnerships, Collaborations, and Joint Ventures Business Opportunities Generating Lithium Hydroxide Closing the Loop, i.e., Making Batteries from Recyclable Materials Start-up Landscape Supply Chain Analysis Ecosystem\/Ongoing Programs Consortiums and Associations Regulatory Bodies Government Programs Programs by Research Institutions and Universities Impact of COVID-19 on the Black Mass Recycling Market Impact of Russia-Ukraine War on Black Mass Recycling Market Analysis of Circular Economy in Battery Lifecycle Snapshot of Lithium-Ion Battery Recycling Market Leading Countries Leading Companies Global Lithium-Ion Black Mass Recycling Market Projection for the Forecast Period (in Volume) Snapshot of Battery Manufacturing Equipment Market Key Companies Profiled BASF SE Umicore Tenova S.p.A. Li-Cycle Corp. Lithion Recycling AKKUSER Duesenfeld ELECTRA ROYALBEES RUBAMIN Aqua Metals Inc. HYDROVOLT AS SungEel Hi-Tech. Co. Ltd. ECOGRAF Fortum Redux GmbH Green Li-ion Pte Ltd. TATA Chemicals Ltd. ATTERO Exigo Recycling Pvt. Ltd. For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/vrlhyc About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
