{"title":"The benefits to biodiversity of a strong circular economy - European Environment Agency","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5","id":"CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA","guidislink":false,"published":"Mon, 12 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=163, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5\" target=\"_blank\">The benefits to biodiversity of a strong circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The benefits to biodiversity of a strong circular economy - European Environment Agency","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQ2h0dHBzOi8vd3d3LmVlYS5ldXJvcGEuZXUvcHVibGljYXRpb25zL3RoZS1iZW5lZml0cy10by1iaW9kaXZlcnNpdHnSAQA?oc=5\" target=\"_blank\">The benefits to biodiversity of a strong circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">European Environment Agency<\/font>","source.href":"https:\/\/www.eea.europa.eu","source.title":"European Environment Agency","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The circular economy aims to transform our economy from the current, mostly linear, take-make-waste model towards a closed-loop model. This transformation can minimise the use of materials and energy while reducing environmental pressures linked to resource extraction, emissions and waste (EEA, 2016). In this way, the circular economy principles provide solutions that achieve more sustainable production and consumption patterns, which in turn benefit biodiversity and nature through reduced resource extraction and waste. Nevertheless, the potential benefits circular economy has on biodiversity is somewhat overlooked. At the same time, growing efforts to reduce biodiversity loss, including recent initiatives such as the EU’s biodiversity strategy for 2030, the 2022 global agreement at the UN Biodiversity Conference, and the European Commission’s proposal for an EU nature restoration law, could benefit from further inclusion of circular economy actions. This briefing explores the intersections between the circular economy and biodiversity (see Ellen MacArthur Foundation, 2021; IUCN, 2022; Sitra, 2022) and advocates a biodiversity-inclusive circular economy. It is based on the European Topic Centre on Circular Economy and Resource Use report. Drivers of and pressures on biodiversity loss Biodiversity and well-functioning ecosystems are the very foundation of our economy and well-being. We depend on ecosystems services for our food, materials, clean water, climate regulation, and cultural and spiritual enrichment, among many other things. However, biodiversity is facing a threat unprecedented in human history. Three quarters of the Earth’s terrestrial area and two thirds of its marine environment have been significantly altered by human activities, putting about 1 million species at direct risk of extinction, and prompting experts to argue that we are already experiencing a sixth ‘mass extinction event’ (IPBES, 2019). The magnitude of this problem has led the UN to include biodiversity loss as one of the triple planetary crises facing humanity, together with climate change and pollution. This alarming global trend is evident in Europe as well. European natural ecosystems have declined both in extent, e.g. wetland has declined by 50% since 1970, and in species diversity, e.g. 28% of species living exclusively in Europe and Central Asia are threatened. Moreover, landscapes and seascapes have become more uniform in their species composition and thus their diversity has declined (IPBES, 2018). So what is driving this alarming rate of biodiversity loss? The Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services (IPBES) points to five key anthropogenic drivers of biodiversity loss, namely habitat loss, overexploitation of natural resources, climate change, pollution and invasive alien species. Figure 1 illustrates these drivers, providing examples from Europe. Figure 1. Key drivers of biodiversity loss These drivers are the result of underlying anthropogenic activities, which is referred to as ‘pressures’ (Figure 2). Key pressures include: Land use, land cover and land management changes: the significant increase in land needed for anthropogenic activities such as agriculture and built-up areas has left little room for habitats for plants, animals and ecosystems to thrive in. the significant increase in land needed for anthropogenic activities such as agriculture and built-up areas has left little room for habitats for plants, animals and ecosystems to thrive in. Material use: our demand for materials and resources can lead to habitat loss and overexploitation of natural resources during the extraction, processing and use stages of the life cycle. Demand for materials can also increase the spread of invasive species, e.g. when new plant species are introduced into agriculture or forestry to fulfil anticipated consumer demand, or by accident, because the threat of invasive species is often intensified in disturbed habitats. our demand for materials and resources can lead to habitat loss and overexploitation of natural resources during the extraction, processing and use stages of the life cycle. Demand for materials can also increase the spread of invasive species, e.g. when new plant species are introduced into agriculture or forestry to fulfil anticipated consumer demand, or by accident, because the threat of invasive species is often intensified in disturbed habitats. Energy system: producing energy can cause climate change through greenhouse gas emissions, habitat loss during resource extraction and overexploitation of biomass. The increasing demand for biomass needs to consider the biophysical limits, as one parcel of land cannot indefinitely satisfy competing demands for biomass provision and biodiversity conservation (EEA, forthcoming). producing energy can cause climate change through greenhouse gas emissions, habitat loss during resource extraction and overexploitation of biomass. The increasing demand for biomass needs to consider the biophysical limits, as one parcel of land cannot indefinitely satisfy competing demands for biomass provision and biodiversity conservation (EEA, forthcoming). Waste and emissions: producing the goods and services we consume creates harmful greenhouse gases and causes water, soil and air pollution. In addition, in most production sectors and consumption domains, waste is generated that may lead to pollution, especially in cases of improper waste management. How our current production and consumption patterns impact biodiversity The source of these drivers of and pressures on biodiversity is our production and consumption systems (Figure 2). The International Resource Panel estimates that 90% of global biodiversity loss can be attributed to the extraction of natural resources (mainly agriculture) and that we are heading towards a doubling of material extraction by 2060 (IRP, 2019). This means that the entire production and consumption system must be transformed if we are to reduce the alarming trend in biodiversity loss. Targeting individual drivers or pressures without considering our production and consumption systems will have limited effect. Circular economy’s contribution to halting biodiversity loss Circular economy has the potential to reduce the impact of our production and consumption systems on biodiversity through three key areas of intersection (Figure 2): Reduce primary resource demand can be achieved by changing consumption patterns, extending product lifespans, recycling materials and adopting circular business models (EEA, 2021b). Lower demand for primary resources decreases the demand for excavation activities and for converting natural habitats into cropland or monocrop plantations. As a result, key drivers of biodiversity loss, including habitat loss, overexploitation and the introduction of invasive species, will be eased. Preventing pollution can be achieved by phasing out hazardous substances, reducing emissions and other forms of leakage, and promoting closed and clean loops (EEA, 2022a). This in turn reduces the impacts on biodiversity of pollution, such as air pollution, fertiliser run-off, or leakage of toxic chemicals, but also contributes to climate change mitigation by lowering greenhouse gas emissions from waste decomposition. Biodiversity-friendly supply relates to the sourcing and cultivation of raw materials). It can be achieved by reducing the negative impact of resource extraction, e.g. by improving environmental practices in the forestry sector or by promoting the regeneration of natural habitats in areas where resources are extracted (e.g. silvopasture or agroforestry). This in turn contributes to more resilient production and consumption systems. Figure 2. How the circular economy can reduce the loss of biodiversity attributed to our production and consumption systems Source: European Topic Centre on Circular Economy and Resource Use and EEA. Examples of circular economy actions that can reduce pressure on biodiversity To illustrate how this could look in practice, we use examples of product value chains that put considerable pressure on biodiversity, namely the food, construction and textile sectors (Kurth et al., 2021). The examples have been selected for illustrative and inspirational purposes and have not been subjected to impact assessments for this briefing. Food The food and agriculture sector is a major contributor to the loss of biodiversity and ecosystem services, due to land use change (habitat loss) and land use intensification in particular (Jaureguiberry et al., 2022; ETC CE, 2023). About half of the world’s habitable land is currently used for agriculture, and nearly two thirds of all species are threatened by agriculture and aquaculture (Sitra, 2022). Hence, using circular economy actions to change the current food and biomass production systems is critical to change the current trend in biodiversity loss. It is also an area where the concept of ‘regeneration’ can be further explored. The following examples of circular economy actions that reduce pressure on biodiversity from the food and agriculture sectors illustrate the potential in this value chain: Projects that recycle nutrients from agricultural waste into animal feed and fertilisers using insects increase the efficiency of resource and material use and reduce the land needed (habitat loss) to produce feed and can produce a more environmentally friendly fertiliser to regenerate soils. Using seaweed to produce a biodiversity-friendly supply of food, animal feed and fertiliser can also help regenerate local marine ecosystems by absorbing nutrients and CO 2 , and requires no synthetic inputs. Construction Infrastructure and buildings are currently designed, developed and demolished in a predominantly linear way, leading to a significant environmental impact and fragmentation of landscapes. Globally, the construction sector is responsible for more than a third of global material resource consumption, including 12% of all freshwater and 85% of all mining material, and significantly contributes to the generation of solid waste (UNEP, 2011). Construction and demolition waste streams account for approximately 37% of all waste generated in the EU (Eurostat, 2022). Circular economy examples in the construction sector that benefit biodiversity include: projects that re-circulate water from green rooftops for use in urban pools, toilet flushing and irrigation, which increases the effective use of resources and materials; using by-products from other sectors (industrial symbiosis) to produce construction materials, or reusing and recycling existing materials (EEA 2022b). These examples can help reduce the demand for primary resources, thereby reducing habitat loss and overexploitation of natural resources. Moreover, as illustrated with green roofs, such actions can also provide co-benefits in terms of temperature control and reducing air pollution. Textiles The textile supply chain for consumption in Europe cause on average the fourth highest pressures on the environment and climate after food, housing and mobility. More specifically it causes the third highest water and land use and the fifth highest use of materials and greenhouse gas emissions, (EEA, 2021c). Less than 1% of material used to produce clothing is recycled into new clothing (Ellen MacArthur Foundation, 2017). Over 90% of the water and land used for producing textiles consumed in Europe occurs outside Europe (EEA, 2022c). Examples of projects in the textile sector that increase circularity and reduce pressure on biodiversity include: projects that produce raw materials for textiles using agroforest production methods and industrial by-products; extending the lifespan of clothes by leasing and repairing them, or advancing techniques to recycle, for example, cellulose fibres. These examples cover all three areas of intersection (reduce use of primary resources, preventing pollution, and biodiversity-friendly sourcing). They help reduce water and land use, and can keep fibres and (non-toxic) chemicals within closed loops. The above examples represent a small selection of how circular economy actions can be used to reduce the pressure on biodiversity from our production and consumption systems. These actions can also help address other environmental threats, including climate change and pollution. A biodiversity-inclusive circular economy By maintaining the value of products, materials and other resources in the economy for as long as possible, enhancing their efficient use in production and consumption, and returning them to the product cycle at the end of their life, circular economy measures reduce the need for resource extraction and reduce waste, which can help reduce the current rate of biodiversity loss. These two principles are commonly covered when discussing circular economy measures and strategies (Figure 3). However, to further enhance the positive impact of the circular economy and not only reduce but also reverse biodiversity loss, more attention needs to be devoted to biodiversity-friendly sourcing efforts. This entails reducing harm to nature but also, importantly, adopting regenerative production practices in, for example, agriculture, aquaculture and forestry, including nutrient retention, soil conservation, water management and sustainable pest management. A recent study found that a circular economy built around regenerative production principles can halt and even partly reverse biodiversity loss (Sitra, 2022). The positive impacts that the circular economy can have on biodiversity (and climate change) should not be taken for granted but need to become a central part of designing and implementing circular economy actions. How resources are sourced and cultivated needs to be added to the traditional hierarchy of ‘reduce, reuse and recycle’. This entails bridging links between how we make use of materials in our economy and how we produce and source them in the first place (Figure 3). From the case studies examined above, eco-design came up as a crucial ‘circular touchpoint’ for both enhancing the circularity of products and ensuring that the resources used to make the products come from a biodiversity-friendly supply chain. The circular economy is, however, not a panacea; policies and measures specifically designed for biodiversity protection remain indispensable (e.g. the EU biodiversity strategy and the European Commission’s proposal for a nature restoration law). Figure 3. A biodiversity-inclusive circular economy Source: EEA. Policymakers, business and citizens all play a vital role Policymakers play a crucial role in developing the necessary framework for further integrating the circular economy and biodiversity. It can be challenging to tackle individual pressures on or drivers of biodiversity loss, as actions targeting one driver may negatively affect other drivers (Sitra, 2022). Therefore, policymakers need to adopt a systemic approach to integrating biodiversity and circular economy that considers multiple factors across the entire life cycle of goods and services. More systemic approaches that integrate the circular economy and biodiversity are essential to leverage synergies while mitigating trade-offs. The European Green Deal and the EU’s taxonomy for a sustainable finance system are important steps in this direction by integrating a broad range of agendas, including biodiversity and the circular economy. Other policies, such as eco-design, green public procurement, material and reporting requirements, and due diligence for supply chains, also represent avenues for further development of a more biodiversity-inclusive circular economy. Businesses have a role in developing and upscaling technical innovations and circular eco-design options. This means (1) continuing to work on enhancing the reusability, repairability and recyclability of their products, (2) ensuring that components do not leak into the environment and (3) carefully considering the materials and resources used and how they are sourced. Implementing corporate sustainability strategies is vital, including adopting biodiversity targets and ensuring compliance from the supply chain, recognising that biodiversity loss is not only bad for us and our environment but is also a key business risk. Lastly, citizens can play their part in the transformation by reducing consumption levels and demanding more biodiversity-friendly choices. Dietary shifts alone can free up a significant amount of land and reduce water use, as well as reducing greenhouse gas emissions. The difficult issues of overconsumption and sufficiency will need to be addressed at the same time as the more technical approaches to the circular economy, in order to allow biodiversity and ecosystems to regenerate. However, the responsibility for shifts in consumption patterns needs to be shared between public authorities, businesses and consumers. The circular economy has quickly become a political priority, but we need to remember that it is not an end in itself — it is a means to an end. Reducing biodiversity loss needs to be one of the overarching aims of the circular economy, and therefore we need to make it more biodiversity inclusive.","filter_flag":1}
{"title":"Five priorities for sustainable procurement in healthcare - Feature - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5\" target=\"_blank\">Five priorities for sustainable procurement in healthcare - Feature<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Five priorities for sustainable procurement in healthcare - Feature - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL2ZlYXR1cmVzLzIwMjMvMjAyMzA2MDEtZml2ZS1wcmlvcml0aWVzLWZvci1zdXN0YWluYWJsZS1oZWFsdGgtdGVjaG5vbG9neS1wcm9jdXJlbWVudC1pbi1ldXJvcGUuaHRtbNIBAA?oc=5\" target=\"_blank\">Five priorities for sustainable procurement in healthcare - Feature<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Time to act To enable the healthcare industry to make a meaningful contribution to the 2015 Paris Agreement and 2050 net-zero targets, we call on governments, purchasing agencies and procurement organizations in Europe to improve supplier evaluation criteria for Green Public Procurement across five key themes: Ensure that suppliers report their environmental impact (including emissions) and that they have a greenhouse gas emission (GHG) reduction plan in place Focus on circularity for health technology products and solutions Require supplier transparency on product performance and EcoDesign for products and equipment Require suppliers to demonstrate how digital offerings support decarbonization and dematerialization by optimizing resources and workflow efficiency Require suppliers to publicly report their social impact Find out more about these five key themes, and action you can take, by downloading our full guidance paper for European procurers. ","filter_flag":1}
{"title":"A circular economy for critical minerals is fundamental for our future - Deloitte","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmRlbG9pdHRlLmNvbS91ay9lbi9JbmR1c3RyaWVzL2VuZXJneS9wZXJzcGVjdGl2ZXMvY2lyY3VsYXItZWNvbm9teS1jcml0aWNhbC1taW5lcmFscy1mdW5kYW1lbnRhbC1vdXItZnV0dXJlLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmRlbG9pdHRlLmNvbS91ay9lbi9JbmR1c3RyaWVzL2VuZXJneS9wZXJzcGVjdGl2ZXMvY2lyY3VsYXItZWNvbm9teS1jcml0aWNhbC1taW5lcmFscy1mdW5kYW1lbnRhbC1vdXItZnV0dXJlLmh0bWzSAQA?oc=5","id":"CBMifGh0dHBzOi8vd3d3LmRlbG9pdHRlLmNvbS91ay9lbi9JbmR1c3RyaWVzL2VuZXJneS9wZXJzcGVjdGl2ZXMvY2lyY3VsYXItZWNvbm9teS1jcml0aWNhbC1taW5lcmFscy1mdW5kYW1lbnRhbC1vdXItZnV0dXJlLmh0bWzSAQA","guidislink":false,"published":"Wed, 21 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=172, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmRlbG9pdHRlLmNvbS91ay9lbi9JbmR1c3RyaWVzL2VuZXJneS9wZXJzcGVjdGl2ZXMvY2lyY3VsYXItZWNvbm9teS1jcml0aWNhbC1taW5lcmFscy1mdW5kYW1lbnRhbC1vdXItZnV0dXJlLmh0bWzSAQA?oc=5\" target=\"_blank\">A circular economy for critical minerals is fundamental for our future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A circular economy for critical minerals is fundamental for our future - Deloitte","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifGh0dHBzOi8vd3d3LmRlbG9pdHRlLmNvbS91ay9lbi9JbmR1c3RyaWVzL2VuZXJneS9wZXJzcGVjdGl2ZXMvY2lyY3VsYXItZWNvbm9teS1jcml0aWNhbC1taW5lcmFscy1mdW5kYW1lbnRhbC1vdXItZnV0dXJlLmh0bWzSAQA?oc=5\" target=\"_blank\">A circular economy for critical minerals is fundamental for our future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deloitte<\/font>","source.href":"https:\/\/www.deloitte.com","source.title":"Deloitte","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Critical minerals are key components of modern technologies, including those needed for a low-carbon future. From solar panels and electric vehicles to electronic devices we carry in our pocket, critical minerals are the foundations of a modern, net zero economy. This is expected to increase their demand six-fold by 2050. However, their supply is in jeopardy – they have complex, volatile and opaque supply chains that are already at capacity. In response to the need to secure a resilient and sustainable supply of critical minerals, the UK government produced a critical minerals strategy. Included in the strategy is the need to maximise the use of critical minerals by adopting circularity principles. A circular economy aims to reduce waste, prolong the life of materials at the highest possible value, design products for materials to be cycled back into the economy and regenerate nature. It is much more than recycling. In this article we explore the opportunities and challenges of implementing a circular approach for critical minerals and highlight how to address them. These include:","filter_flag":1}
{"title":"WCEF2023 Summary Report - Sitra","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnNpdHJhLmZpL2VuL3B1YmxpY2F0aW9ucy93Y2VmMjAyMy1zdW1tYXJ5LXJlcG9ydC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnNpdHJhLmZpL2VuL3B1YmxpY2F0aW9ucy93Y2VmMjAyMy1zdW1tYXJ5LXJlcG9ydC_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vd3d3LnNpdHJhLmZpL2VuL3B1YmxpY2F0aW9ucy93Y2VmMjAyMy1zdW1tYXJ5LXJlcG9ydC_SAQA","guidislink":false,"published":"Fri, 30 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=181, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnNpdHJhLmZpL2VuL3B1YmxpY2F0aW9ucy93Y2VmMjAyMy1zdW1tYXJ5LXJlcG9ydC_SAQA?oc=5\" target=\"_blank\">WCEF2023 Summary Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sitra<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"WCEF2023 Summary Report - Sitra","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vd3d3LnNpdHJhLmZpL2VuL3B1YmxpY2F0aW9ucy93Y2VmMjAyMy1zdW1tYXJ5LXJlcG9ydC_SAQA?oc=5\" target=\"_blank\">WCEF2023 Summary Report<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sitra<\/font>","source.href":"https:\/\/www.sitra.fi","source.title":"Sitra","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Towards a nature positive tomorrow together with future leaders In 2023, one of the world’s most influential circular economy events, the World Circular Economy Forum, returned to the Nordics. With examples from around the world, the Forum gathered a global audience in Helsinki, Finland to share solutions and show how the circular economy can help both nature and the economy. Since these issues are multi-generational and the core principle of a circular economy must be ensuring sustainability in the long-term, one goal of WCEF2023 was engaging younger generations in the top-level circular economy discussions. On the opening day, a plenary session designed by four youth organisations had young leaders boldly speaking for a future they believe in. Youth were also well represented in the audience, with 31 per cent of all participants being under 35 years. Overall, speakers at the Forum agreed that circular solutions implemented today can grow our economy, regenerate nature and sustain a safe and just space for future generations. Last year in Kigali, someone hit the bull’s eye by saying that the discussion around circularity is still stuck in the future. Therefore, this year the aim was to shift the focus from “why” to “how and now”. Some of the key levers discussed during the Forum included the need to strengthen collaboration and engagement at different levels, leverage finance and policy to support circular businesses, regenerate land, translate global ideas to local solutions, prioritise human well-being and rethink the way we consume and do business. With the Kunming-Montreal global biodiversity framework steering efforts to deliver a future where biodiversity loss is reversed, the Forum brought nature as an integral element to the table. By delivering solutions that reduce pressures on land-use and give more value from biomass, the circular economy provides a plethora of opportunities to accelerate the transition towards a nature-positive future. The Forum shared inspiring and scalable examples of the circular economy covering a variety of topics, such as: finance, accounting and metrics, everyday life and health, future skills, and strategies and road maps. It also covered industries like regenerative agriculture and forestry, finite materials and energy, mining, trade, fashion and textiles, food, construction and the built environment, plastics and packaging, electronics and hydrogen. On 30 and 31 May, 151 speakers from across the world shared their innovative ideas and action plans across 20 sessions. Between the main event sessions, more than 50 organisations shared their solutions at the WCEF2023 Expo. And on 1 and 2 June, 41 partner-led Accelerator Sessions delved deeper into the daily work of WCEF partners – online and in Helsinki. The Forum gathered 1,867 global participants to Helsinki and more than 12,500 views online. Attendees from 155 countries participated in the main event. The World Circular Economy Forum 2023 was co-hosted by Nordic Innovation and the Finnish Innovation Fund Sitra, together with 21 partners, 51 expo stand hosts and many more international collaborators. Concrete results from WCEF2023 The World Circular Economy Forum 2023 provided a platform for the launch of various agreements, plans and publications. Some of the highlights include: Strengthening collaboration to transform systems During the Forum, both speakers and the audience once again highlighted collaboration as a critical element to accelerate the transition towards a circular future. Collaboration can be approached from many different angles, but what stood out this year was systems thinking: we cannot change the world just by redesigning single products. Instead, the focus must be on redesigning the big systems – by bringing finance, policy and practice as well as whole value chains to the same table. The audience was also reminded that collaboration should extend to frontline communities. Currently, some indigenous communities view the green transition as green colonialism. This is due to the unfair extraction and exploitation of resources which is often associated with violence – for instance between indigenous peoples in the Amazon and the fossil fuel and mining industries. Education is key: circularity and sustainability education that provides people with shared understanding and vocabulary can foster collaboration. Not everyone needs to have the same knowledge or skills but by sharing basic understanding across sectors, it is easier to come together and create solutions that tackle the root causes of multiple crises. In addition to shared basics, trust is a must for successful collaboration. One interesting example of trust building shared during WCEF2023 was Carbon Action platform’s “mistake battle”. By sharing their mistakes, farmers were able to build trust and empower their community to collaborate further to build regenerative food systems. Uniting stakeholders across geographies and value chains also requires creativity and taking small first steps. Some successful examples of changing systems together include: Climate Farmers have built a community of European farmers that provides funding for the transition to regenerative agriculture while also offering a space to share best practices through storytelling. have built a community of European farmers that provides funding for the transition to regenerative agriculture while also offering a space to share best practices through storytelling. Néstle aims to increase ingredients from regenerative agriculture from 6.8 per cent by 2050. To achieve this, the company is working together with farmers and experts to build understanding on regenerative practices that work on their producers’ farms. aims to increase ingredients from regenerative agriculture from 6.8 per cent by 2050. To achieve this, the company is working together with farmers and experts to build understanding on regenerative practices that work on their producers’ farms. The New Cotton Project has brought together 12 actors across the textiles value chain including research, retail, communications, manufacture and innovation. Together the consortium is showcasing that creating new clothing from regenerated textile waste can be commercially viable. has brought together 12 actors across the textiles value chain including research, retail, communications, manufacture and innovation. Together the consortium is showcasing that creating new clothing from regenerated textile waste can be commercially viable. The youth movement ReGeneration2030 is creating collective spaces where politicians, business leaders and youth can meet one another as humans, leaving hierarchical roles aside. This approach allows different voices to be heard equally. Businesses need to be engaged Businesses play a key role in making the circular transition reality, yet companies face many internal and external barriers. They often lack financing to scale up their operations for a variety of reasons, such as perceived risks, inadequate metrics and standards, limited understanding and because the prices in linear business models do not cover the full cost of production. To accelerate the circular economy, companies also need new skills and education, as well as political support such as regulatory and taxation frameworks. Currently, governments not only fail to tax the linear economy appropriately but also subsidise it, thus hindering the needed transition. It is important that corrective measures by taxation and regulation are actively promoted to support already existing private sector solutions. Policies will encourage investments to come in. Today only a very limited number of companies understand their impact on nature. To understand the progress they make, companies first need to understand their baseline. However, perfection should not be the enemy of good – it is important that companies begin to understand their impact on nature and people. Right now, it shouldn’t be about whether a company is 100 per cent circular, but their path towards circularity. Environmental accounting is just as important as financial accounting. There is also a need to encourage the formulation of industrial symbioses, where circular economy businesses complement each other and create ecosystems. Electronics and mining The green transition and population growth, especially in Africa, are rapidly increasing the global demand for minerals and metals. The informal collection of electronic waste in Africa is efficient, but it is important to integrate this into the formal recycling systems to ensure high environmental and social standards. Centralised waste treatment can provide benefits. Not every country needs to have electronic waste management facilities, as everyone can benefit from the economy of scale. Yet, we need to ensure that the waste is moving in the right direction so that the Global South does not become a dumping ground for global waste streams. Circular electronic waste management, metals-as-a-service and extending the lifespan of old devices provide successful business opportunities, especially as the demand and prices of critical raw materials are increasing. At the same time, consumers also need to engage to ensure that electronic waste is compliantly collected and managed. Construction Construction is another industry with various circular business opportunities. Around half of the built environment is urban sprawl and a misuse of space. We need to shift the focus towards serving the well-being of people and optimising the use of existing resources to meet people’s needs. Especially in many countries in the Global South, much of the housing stock is yet to be built, which offers a juicy opportunity to think differently in terms of the solutions. The construction sector needs to leverage solutions such as low-carbon construction, life-cycle impact assessment and reuse and recycling. Digitalisation can provide significant benefits in facilitating circular practices, for example, through improved material traceability, progress tracking and optimisation. Money talks, but how do we get money to listen? One of the key questions of this year’s World Circular Economy Forum was how to accelerate financing for circular companies, especially small and medium-sized enterprises. Many inspiring solutions are already out there, but investors often see them as too risky due to limited understanding, lack of international standards or because investment models are designed to maximise short-term profits over long-term well-being. Many circular businesses are successful by traditional standards. However, if environmental and social aspects are integrated into investors’ risk considerations, circular business models are often less risky than linear ones. To increase the financial attractiveness of circular solutions, there is a need for international collaboration, such as de-risking activities among investors with different risk-return expectations. A common language for metrics and standardisation needs to be created to combat a lack of transparency. The availability of data is constantly increasing and we need to use it to make right decisions. Finally, and perhaps most importantly, investors will not invest in projects they do not understand. Hence, it is important to increase understanding of the fact that 100 per cent of the economy is dependent on the natural world and that biodiversity loss already causes as big a risk as climate change. The expectations of stakeholders and consumers are rapidly increasing, and this factor will continue to steer the markets in the future. Politics and regulation Public policies define the rules of the playing field and set the stage for investors. Political measures can tilt the markets to support the scaling of circular solutions in various ways: Collaboration between private and public sector: If policymakers don’t act businesses will take the lead, which leads to fragmented policymaking. In addition to the ministries of environment, whole governments should come up with plans and tasks on how to transform the economy so that it supports circularity. Taxation and regulation: Not only do we tax the linear economy too little, but currently we also subsidise it. The field should be tilted to support sustainability in a way that attracts investors. Due to their significant volume, public procurements are a huge driver for increasing the demand of circular products and services. The circular economy must be also institutionalised in legislation to support the transition. Circular economy road maps: Provide a vision and a long-term strategy. Without a road map, there is no clear destination. More than 40 countries already have circular economy road maps and strategies, and more than 50 countries have included circular strategies in their nationally determined contributions (NDCs). But we need to up the game. Global governance: An improved version of the European Green Deal is crucial for accelerating Europe’s socially inclusive green transition amid a worsening ecological crisis. Global systems for extended producer responsibility, digital product passports and paying farmers for their ecosystem services are important drivers for change. Regenerating land through circular approaches Many of us are used to viewing circularity as technical cycles, but biological cycles are also part of the circular economy. We must conserve land as well as use land in new regenerative ways to halt and reverse biodiversity loss. Regenerative agriculture is a huge opportunity to recover the diversity of life and increase carbon sinks on agricultural lands. Experts pointed out that regenerative agriculture provides more resilient and nutritious food systems than conventional farming to feed the growing population. As a holistic solution, regenerative agriculture needs to become the new norm, not a new niche like organic production. Redesigning food products to include regeneratively produced, diverse, upcycled and lower-impact ingredients can also help drive this change. Solutions like upcycling left over ingredients from oat milk production or combining under-used fish species with beans to create lower impact fishcakes are showing the way. Agriculture is the main cause of deforestation globally. Therefore, it is important to design solutions where feeding the world goes hand in hand with forestry, such as agroforestry. Agroforestry is one of the oldest forms of land use. The practice breaks industrial silos by combining forest management with crops or livestock production. During the Forum we heard that agroforestry solutions can also be scalable. The forest sector on its own can also ramp up efforts to make the most value out of the finite resources forests provide. Regenerative principles in forestry can ensure forest biodiversity increases instead of decreases after operations. The life cycles of wood products can be extended – even waste wood can be cycled back into use through methods such as charring. Most importantly, forests need to be respected beyond the wood they carry, including ecosystem services, food and compounds for other industries such as cosmetics. To create circular solutions that regenerate nature, circularity must transform our relationship with resources by narrowing, slowing and closing resource flows. Circularity needs to shift from global to local The triple planetary crisis affects the whole globe, and often the circular economy is viewed as a global solution. However, speakers at the Forum stressed repeatedly that the best circular solutions are often local. They make use of local knowledge and local resources, adapt and nurture local ecology and respect local culture. For example, in the agricultural sector farmers can learn from each other in a global community, but transitioning to regenerative agriculture will look very different based on local weather conditions, native crops, available resources and culture. The key is to leverage global goals to build place-based solutions, to empower local communities and to bring learnings from global conferences like the World Circular Economy Forum back home and adapt them to local circles and contexts. Putting people at the heart of the economy The circular transition is not taking place fast enough as the transition does not have critical mass. Therefore, it is crucial to attract more people and new sectors. WCEF2023 focused on engaging youth in the discussion as well as bringing in new sectors like hydrogen. Many speakers emphasised that the circular economy is a tool, not the end goal. The goal is securing a thriving biosphere and prosperous communities. While we need to urgently implement our current ideas, we must also keep evaluating whether our solutions are really taking us towards a future that prioritises the well-being of people and the planet. An inclusive transition The linear economy is not delivering for everyone. To ensure a just and inclusive transition to circularity we must embrace the fact that changing our relationship with nature is ultimately not just a matter of environmental concern, but also an imperative for equality, security and resilience. A sustainable future concerns everyone, so all voices must be heard, including those traditionally marginalised in the Global South. To ensure that the Forum remains truly global, WCEF will work closely with the United Nations Development Programme, an organisation that helps countries around the world to fight poverty, inequality and climate change. From ancient wisdom to future generations The circular economy creates solutions that ensure sustainability in the long-term. To do this, circularity must evolve: learning from the wisdom of the past, nurturing new ideas of leaders yet to be and securing the well-being of future generations. In other words, intergenerational collaboration must be at the centre of circular decision-making and innovation. Rediscovering ancestral knowledge and techniques can wield great opportunities. For example, ancient agroforestry practices are being scaled up by Pretaterra in Brazil and a wood preserving charring method from the 18th century Japan is upcycling waste wood. Engaging youth voices in circular discussions can bring in fresh and innovative ideas. The young leaders at the Forum highlighted that no decisions concerning them should be made without them. To make youth participation meaningful, companies and policy makers need to create participation systems to work with young people and monitor the value of participation. In addition, young people need allies and low-barrier opportunities for engagement – like reverse mentorship that brings together business leaders and young people. Circular solutions must be long term. One concrete way of fostering intergenerational justice is transitioning to agricultural practices that will also feed future generations. wisdom of the young Young leaders’ key ingredients for a truly just and circular future: Clarity: To get engaged in the circular economy, (young) people need clarity, including practical examples of what has worked and practical skills of how to be a change maker. Meaningful participation: Participation should lead to changes in business as usual with long-term engagement at different stages of decision making. Power of people: Harnessing the power of communities and giving power to historically marginalised peoples will help generate grass roots action. Systemic approaches: The only way to solve the polycrisis is approaching it from a systemic perspective. Redesign: To create solutions that will last, people need to rethink everything we do and how we organise. Economic system change: To create a truly circular economy, the drivers of our current linear economic system need dismantling. Joy: Indigenous communities face violence from natural resource extraction and suffer from climate change and rely on joy to get through each day. Joy opens our eyes to everything not yet lost and worth saving. Human rights: Our current economic systems do not prioritise human lives and well-being. Human rights are central to creating a just future. Youth platform: Young people need a space to share their ideas on the changes they would like to see. The most important R is Rethink During the Forum, many speakers highlighted the role of consumers in transforming the economy: both by lowering the material intensity of consumption, but more importantly reducing the amount of consumption. Before WCEF2023 the international online market research and data analytics firm YouGov surveyed consumers in the Nordics about their circular actions. The most common activities include using reusable instead of disposable coffee cups, offering items for reuse, and recycling. Unfortunately renting and repairing were not too popular. In Europe, up to 70 per cent of emissions can be traced back to people’s daily choices. Lifestyle Test, a free web app presented at the Forum offers a tool to calculate one’s carbon footprint based on the local context and to receive tailor-made suggestions for actions to build a positive and sustainable life. Although sufficiency solutions that reduce consumption are most impactful, they are least likely to be adopted by individuals. To change the trend, businesses and governments need to take a role in rebranding sufficiency. Sufficiency is a way of living enriched and more purposeful lives while supporting the resilience of individuals and societies. Businesses can reinvent long-lasting products, use recycled and less impact-intensive materials, reduce material use, create modular structures, and offer maintenance, repair and vintage services. For examples, Fiskars offers recoating services for used pans. However, to truly facilitate the public’s interest in these new products and services, companies need to take a more active role in educating consumers and finding ways to make the solutions attractive. Besides bigger players on the journey towards circularity, the World Circular Economy Forum 2023 also offered a platform for “born circular” startups to share their ways of rethinking business. One inspiring example was Swimbe’s custom-made swimwear encouraging emotional attachment leading to longevity. The company uses plastic waste as a material and using all damaged and left over fabric pieces to create scrunchies and bags. Rethinking won’t take place in companies without efforts to reskill workers. Vocational training can play a key role here as it has strong links to industry and provides the flexibility needed to reskill or update the skills of workers. In addition, vocational training can offer an accessible pathway for people with different levels of skills and even help people outside of the workforce back into business. Whether talking about consumers or companies, rethinking means changing the way resources, jobs, skills and people are valued. For example, people working in end-of-value-chain jobs like waste sorting have extremely valuable skills for the circular economy, but their efforts are currently undervalued and even invisible. Another example could be finding new pathways for plastics to be shared and reused instead of thrown away. Fostering connections to the materials that fuel our lives, for instance by visiting local farms, is a must to make the circular future reality. While consumers and businesses do play a role in the circular transition, positioning individuals not only as consumers, but also as activists, political subjects and members of communities, can be a very powerful way of rethinking each of our roles in society. Key takeaways from the audience The World Circular Economy Forum 2023 provided inspiration and actions to accelerate the circular transition. Yet, the audience also highlighted the need to ask uncomfortable questions related to the fundamental principles of the economic structures. The importance of overarching system-level change has been on the table for quite some time, but the audience raised the importance of considering alternative models, such as a well-being economy and regenerative economy in the context of discussions around circularity. We asked the audience what they will do now to advance circularity. Some of the promised actions included strengthening collaboration between companies globally, updating their companies’ sustainability policies, stopping investments in the linear economy, increasing youth participation and education in their work, and using the new Lifestyle Test. Next stop: Brussels The next WCEF will be organised in Brussels, Belgium. The conference will take place in spring 2024 and the exact dates and topics of the Forum will be revealed later, so stay tuned! At WCEF2023, it was also revealed that the Forum will deepen its cooperation with the International Resource Panel (IRP) and the United Nations Development Programme (UNDP). IRP is a global science-policy platform established by the United Nations Environment Programme (UNEP) and Circle Economy is a leading global impact organisation. UNDP is a UN agency tasked with helping countries sustainably develop and eliminate poverty. Programme Programme – main Forum on 30–31 May and Accelerator Sessions on 1–2 June Key figures Key figures by 11 June, page 1 of 4 Key figures page 2 of 4 – geographic by registration Key figures page 3 of 4 – registrants by sector Key figures page 4 of 4 – social media #WCEF2023 Organisers Organisers – co-hosts and partners Timeline","filter_flag":1}
{"title":"Seizing the Opportunity of E-Waste Recycling | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc2VpemluZy1vcHBvcnR1bml0eS1ld2FzdGUtcmVjeWNsaW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc2VpemluZy1vcHBvcnR1bml0eS1ld2FzdGUtcmVjeWNsaW5n0gEA?oc=5","id":"CBMiSmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc2VpemluZy1vcHBvcnR1bml0eS1ld2FzdGUtcmVjeWNsaW5n0gEA","guidislink":false,"published":"Mon, 26 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=177, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc2VpemluZy1vcHBvcnR1bml0eS1ld2FzdGUtcmVjeWNsaW5n0gEA?oc=5\" target=\"_blank\">Seizing the Opportunity of E-Waste Recycling | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Seizing the Opportunity of E-Waste Recycling | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvc2VpemluZy1vcHBvcnR1bml0eS1ld2FzdGUtcmVjeWNsaW5n0gEA?oc=5\" target=\"_blank\">Seizing the Opportunity of E-Waste Recycling | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Collection Impediments. Several barriers inhibit e-waste collection. Current regulations provide, at best, mixed motivations to recycle. Most US states do not have e-waste landfill bans, and many of those that do cover only some categories of waste (screens, for example, but not small equipment). Half of US states have e-waste recycling programs, but they do not necessarily mandate recycling, even for products with hazardous components such as video screens. Twenty-four states have extended producer responsibility laws, but the manufacturers and the products that these laws cover vary widely. The high cost of logistics relative to recovered value is a key problem, since logistics make up a substantial portion of the total recycling bill. Low-value e-waste, such as TVs and printers, have large plastic casings and small circuit boards, increasing transport costs relative to e-waste density. (Transportation can account for a third of total recycling costs.) Rural areas often have insufficient critical density to offset the capital investment needed to start a large recycling network, resulting in sparse or infrequent collection. All aspects of collection can be a challenge. Collection points include municipal drop-off centers, recycling centers, retailers, and charities, but availability and options for treating end-of-life electronics vary down to the level of the individual municipality. Collection can be as infrequent as once a month at some locations. Participation rates also differ, with some localities reporting less than 30% household uptake. Limited consumer awareness of the possibilities for e-waste is another challenge. Consumers are not always (or even widely) knowledgeable about the environmental and social benefits of depositing spent electronics with a responsible recycler, let alone where to do so. E-waste collection can be a profit center for retailers, but companies must see sufficient consumer awareness and willingness before they invest in a collection capability. According to a 2020 survey in Waste Advantage Magazine, 60% of Gen Z and Millennial consumers in the US reported being unfamiliar with the term “e-waste,” and 57% said they were unaware of the impact of e-waste on the environment. Recycling Obstacles. E-waste is costly to recover. Separating e-waste that is intermingled with municipal solid waste must be done by hand. Worse, smaller devices, such as phones, laptops, and printers, are often crushed and contaminated with hazardous household waste. Dismantling certain electronics is difficult, and some types of e-waste, including screens and refrigerators, contain hazardous materials. The need for specialized technicians (in the case of refrigerants) or processes (in the case of mercury-bearing cold-cathode fluorescent lamps in LCD screens) drives up processing costs. Limited domestic processing capacity and commodity price volatility are additional barriers. Despite export restrictions under the Basel Convention, export continues: one study found that more than 40% of tagged e-waste was being exported, most of it likely illegally. Commodity volatility disrupts the business case for investing in the equipment needed to better extract materials from e-waste by making revenue streams unpredictable. Indeed, much of the business case for e-waste recycling will rest on the ability to stabilize revenue streams. Even when intentions are good, economic incentives can work against circularity by emphasizing rapid product updates and sales volumes over product longevity. Product Life Cycle Hurdles. Circularity, which goes well beyond recycling, is about doing more with fewer resources. But even when intentions are good, economic incentives can work against circularity by emphasizing rapid product updates and sales volumes over product longevity. These disincentivize repairability or refurbishment (some devices cost less to buy new than to repair), impeding recycling. In addition, lone players have a tough time making a business case for recycling some kinds of e-waste. Those that make the investment can end up collecting or recycling other companies’ products as well as their own—without compensation. Absent partnerships along the value chain or programs that highlight the value of e-waste, landfilling and export continue to be cheaper than responsibly recycling many kinds of e-waste. Reaping ESG rewards from circularity requires strengthening standards and oversight. Data-tracking capabilities are limited, the origins of product inputs are unknown, and end-of-life products are not commonly tracked. Primary and secondary metals are often smelted into the same product, limiting traceability. Waste Not The biggest potential enabler of greater e-waste recycling is the public sector: legislation or regulation, which can be modeled on rules in place in some US states or regulatory measures currently implemented in Europe. For example, “polluter pays” laws can obligate manufacturers to finance e-waste recycling, especially of computer equipment and screens, if they do not recycle the waste themselves. Extended producer responsibility laws (such as those that require companies to put in place measures to recover plastic packaging) can incentivize recycling and divert e-waste from landfills. Export bans, linked to recycling mandates, can increase the domestic supply of e-waste and boost the attractiveness of some e-waste categories to recyclers. The Secure E-waste Export and Recycling Act, which would establish such a ban, is currently under consideration in Congress. The inclusion of copper on the critical-minerals list would also motivate domestic retention of e-waste. Still, public-private partnerships may be needed to ensure that municipal e-waste is recycled responsibly. For their part, companies and industry associations can address the roadblocks described above with their own actions. Improving Collection with Incentives, Infrastructure, and Consumer Education. E-waste collection can be improved by providing incentives to consumers and partners. Retailers can increase collection and drive foot traffic by offering vouchers for e-waste. Manufacturers can offer retailers new-product rebates for collecting their end-of-life products. As consumer concern over sustainability rises, companies can capitalize by integrating e-waste collection into their business models. As consumer concern over sustainability rises, companies can capitalize by integrating e-waste collection into their business models. Implementing in-store end-of-life collection systems, including buyback and takeback programs, can become a source of competitive advantage. Similarly, reverse-logistics programs can provide distributors and e-retailers with valuable data and boost loyalty. More aggressive and continuous consumer education can help promote circularity by raising awareness of existing e-waste programs and of the value of e-waste and its potential for environmental harm. Boosting Recycling by Stabilizing Off-Take and Upgrading Capabilities. Value recovery rebates or long-term contracts can be key enablers for recyclers and waste management companies to increase e-waste volumes. They can stabilize future cashflows for e-waste and protect recyclers against volatile commodity prices while securing feedstock for material processors and OEMs. Recyclers can offer municipalities waste management sorting-as-a-service with long-term recovery contracts. Upgrading separation and refining technology is a prerequisite to extracting value from many grades of e-waste. Robotic processing (using robots to dismantle monitors, for example) can mitigate hazards and reduce costs, but its impact is currently limited by throughput speed. There may be viable business cases for upgrading harder-to-process classes of e-waste or shredded products, such as advanced mechanical sorting of fine granulates to separate valuable metal fines from organics. Establishing a domestic recycling network can reduce logistics costs and offer other ecosystem benefits. Players need to work together to optimize logistics through, for example, regionalized recycling strategies that minimize the distances that waste needs to travel. ERI runs a national network of electronics and IT asset disposition services, including recycling. Circularity by Design, Life Cycle Extension, and Service Models. Manufacturers need to adapt products to a circular future, implementing circularity-by-design principles that emphasize durability, repairability, and modularity. They can conduct full-life-cycle assessments across the product portfolio to identify points for intervention and use more lightweight materials (which also bring cost benefits) and easily separable monomaterials. Cisco has committed to incorporating circular-design principles into all products and packaging by 2025; these principles include standardization and modularization as well as design for disassembly, reuse, and repair. Enabling repair and reuse can extend the product life cycle, and using refurbished equipment reduces companies’ carbon footprint. Philips refurbishes some classes of electronics, including medical equipment, to lengthen their useful life. Business model creativity may be necessary to make the transition from linearity to circularity. One example is adopting an everything-as-a-service model. HP Managed Print Services enables longer product life cycles through a charge-for-usage rather than a sales model, selling printed pages, for example, rather than the machine itself, with the company retaining ownership and keeping equipment in use for as long as possible. Manufacturers need to adapt products to a circular future, implementing circularity-by-design principles that emphasize durability, repairability, and modularity. Closing the Loop: Collaboration, Standards, and Validation Systems. Addressing the roadblocks is essential, but private- and public-sector actors can go further. Some industry alliances, such as the Global System for Mobile Communications Association, are developing blueprints for a circular economy, including recommendations for data gathering. Circularity tracking and data ecosystems can improve visibility into end-of-life product outcomes, reveal pockets of opportunity, illuminate unexpected challenges to achieving a circular future, and enable green premiums. Products with “digital passports” facilitate the transition to a more circular economy by collecting and storing product information throughout the life cycle. In May 2023, the European Health and Digital Executive Agency opened a grant program to investigate digital passports. Among other goals, the program aims to “enable sharing of key product related information that are essential for products’ sustainability and circularity” and “provide new business opportunities to economic actors through circular value retention and optimization (for example product-as-a-service activities, improved repair, servicing, remanufacturing, and recycling) based on improved access to data.” In Up to the Waste While these individual steps can help bridge the gap, the biggest opportunity comes in the form of new and inventive collaboration models, such as value-chain partnerships and joint ventures, which will be needed to turn e-waste into a positive-sum game. Manufacturers, recyclers, retailers, and IT and telecom companies should evaluate their opportunities in e-waste. The first step is understanding the company’s role in the e-waste ecosystem, setting goals (both financial and nonfinancial), and assessing the capabilities required to play. Next, identify market pain points by considering where circular solutions currently face roadblocks and where you can leverage your company’s capabilities to break through them. Then, test partnerships. As customers, investors, regulators, and others place more importance on climate concerns and environmental responsibility, there may be opportunities for both early-mover and longer-term competitive advantages from committing to a circular ecosystem. Finally, start small and scale quickly by mitigating upfront investments and risks while demonstrating the viability of solutions through pilots. E-waste is a complex and growing challenge. The solutions will require time, creativity, and ecosystems of actors. But there are substantial returns to be gained for those that are prepared to think beyond linear supply chains. The authors thank Pol Cardona, Chirine Mouharam, and Diana Sukailo for their assistance with this article. ","filter_flag":1}
{"title":"Design Shanghai to spotlight brands bridging east and west - Dezeen","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wMS9kZXNpZ24tc2hhbmdoYWktZWFzdC1tZWV0cy13ZXN0LTEwdGgtYW5uaXZlcnNhcnkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wMS9kZXNpZ24tc2hhbmdoYWktZWFzdC1tZWV0cy13ZXN0LTEwdGgtYW5uaXZlcnNhcnkv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wMS9kZXNpZ24tc2hhbmdoYWktZWFzdC1tZWV0cy13ZXN0LTEwdGgtYW5uaXZlcnNhcnkv0gEA","guidislink":false,"published":"Thu, 01 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=152, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wMS9kZXNpZ24tc2hhbmdoYWktZWFzdC1tZWV0cy13ZXN0LTEwdGgtYW5uaXZlcnNhcnkv0gEA?oc=5\" target=\"_blank\">Design Shanghai to spotlight brands bridging east and west<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dezeen<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Design Shanghai to spotlight brands bridging east and west - Dezeen","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wMS9kZXNpZ24tc2hhbmdoYWktZWFzdC1tZWV0cy13ZXN0LTEwdGgtYW5uaXZlcnNhcnkv0gEA?oc=5\" target=\"_blank\">Design Shanghai to spotlight brands bridging east and west<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dezeen<\/font>","source.href":"https:\/\/www.dezeen.com","source.title":"Dezeen","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Promotion: Design Shanghai trade fair is set to return from 8 to 11 June 2023 for its 10th anniversary year, with an aim to explore the meeting of eastern and western design philosophies. One of Asia's largest design events, Design Shanghai will be taking place at Shanghai World Expo Exhibition and Convention Center over four days in June. As well as the trade fair, which will stretch over three halls, the event will include installations, exhibitions, a design forum and networking events. A major focus this year is on how eastern and western design philosophies can meet and work together, with a spotlight put on brands that involve collaborations between Asia and Europe or the US. These include Chinese brands Stellar Works and U+ as well as Danish brand Royal Copenhagen, whose porcelain nods to traditional Chinese techniques and motifs. Among the new products set to make their global debut at the event are French brand Christofle's Mood Asia platter designed for Asian gastronomy, Chinese brand Fuli's lipstick-themed tapestry created by British fashion designer Dame Zandra Rhodes and new contemporary Californian furniture from Maria Yee. Elsewhere in the fair, new products from international brands including Gubi, Mattiazzi, Flos as well as Chinese brand Jianze and Taiwan's SeeDesign will make their debut on the Asian continent. Chinese brands exhibiting at Design Shanghai include Pentfair, which works with artisans and craftspeople from all over the world to reinvent traditional handicrafts; the playful design studio Benwu, which features curved lines and bright colours; Junse, which will present new designs by designer Shen Zhanjun informed by the human skeleton; and new brand Nula Living with its local take on minimalism. Installations this year will include a bamboo forest by architect Chen Hao Ru in the Neooold exhibition space, which promises to create a \"vortex\" that leads people deep inside it while recreating a sense of \"the Jianhu dream\". There is also Interlude by Chi Wing Lo, which is intended to offer visitors a moment of peace and reflection with its spatial and musical design using folding screens. There will be two key features: Róng – Weaving, featuring the work of 28 designers who have been conducting deconstructive research into traditional weaving and knitting, and Disappearing Borders, curated by designer Jamy Yang, which explores the meeting of the physical and digital worlds. A returning feature is the Talents showcase, where 22 groups of emerging designers will explore the linking of China and the West in the form of a \"banquet\", and a new display called Design Street, which is curated by Design Burger and aims to build a bridge between independent design studios and brands. Headline partner Audi will also present its \"activesphere\" concept vehicle. Design Shanghai's Design Forum will include a series of talks that focus on a number of design-related topics such as memory and perception in design, holistic design, sustainability and designing for distinctiveness. Speakers include Aidan Walker forum director of Design Shanghai and Design Shenzhen; Craig Miller, partner and project leader at Heatherwick Studio; Zandra Rhodes, British fashion designer; Ross Lovegrove, founder and director of For Love and Design.com; and Michael Young, founder of MY Studio. Design Shanghai is celebrating its 10th year in 2023, which will also be its first for some time with no Covid restrictions, as China emerges from its years of aggressive zero-Covid policy that saw previous events postponed or cancelled. \"During the past decade we have provided a platform to share design ideas across China and the global stage and it has been an honour to witness the vigorous development of the design community in China,\" said Design Shanghai event director Zhuo Tan. \"This year's edition of Design Shanghai hopes to enhance the audience's perspective through exploring the 're-creation' of design.\" \"For this momentous 10th anniversary we will be comprehensively upgrading the scale and content at the event, with exemplary design showcased from across the world.\" To view more about Design Shanghai, visit its website. Design Shanghai will take place at the Shanghai World Expo Exhibition and Convention Center from 8-11 June 2023. For more information about events, exhibitions and talks, visit Dezeen Events Guide. Partnership content This article was written by Dezeen for Design Shanghai as part of a partnership. Find out more about Dezeen partnership content here.","filter_flag":1}
{"title":"“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa - Philips","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5","id":"CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5\" target=\"_blank\">“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa - Philips","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivwFodHRwczovL3d3dy5waGlsaXBzLmNvbS9hLXcvYWJvdXQvbmV3cy9hcmNoaXZlL3N0YW5kYXJkL25ld3MvYXJ0aWNsZXMvMjAyMy8yMDIzMDYwNy1pbXBhY3QtZmlyc3QtaW52ZXN0bWVudC1mdW5kLXRyYW5zZm9ybS1oZWFsdGgtZnVuZC13aWxsLWhlbHAtdG8taW1wcm92ZS1hY2Nlc3MtdG8taGVhbHRoY2FyZS1pbi1hZnJpY2EuaHRtbNIBAA?oc=5\" target=\"_blank\">“Impact First” investment fund 'Transform Health Fund' will help to improve access to healthcare in Africa<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Philips<\/font>","source.href":"https:\/\/www.philips.com","source.title":"Philips","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Inspiring corporate peers and other investors In addition to fostering access to quality and affordable care, Philips’ involvement in the fund should help inspiring its corporate peers by showing that it’s possible to have a positive impact on such a pressing issue. As such, Philips serves as a catalyst, resulting in more Corporates, Foundations and Development Finance Institutions to support the Transform Health Fund. “Private capital can be the critical catalyst, especially when having a higher risk appetite. It demonstrates that private return-seeking capital can catalyze health system improvements at scale,” Annette Jung, Impact Finance Lead at Philips, emphasizes. For more information about the Transform Health Fund, its activities, and its supporters, and to become an investor, visit this website: Health Finance Coalition. [1] In addition to Philips, Transform Health Fund’s group of investors includes Merck & Co., Inc. (known as MSD outside of the United States and Canada), the U.S. International Development Finance Corporation (DFC), International Finance Corporation (IFC), Swedfund, FSD Africa Investments, Grand Challenges Canada (with funding from Global Affairs Canada), U.S. Agency for International Development (USAID), Netri Foundation, Anesvad Foundation, Chemonics International, and MCJ Amelior Foundation. [2] World Population Clock: 8 Billion People (LIVE, 2023) - Worldometer (worldometers.info)","filter_flag":1}
{"title":"Four Aldi Finds this week including perfect gift ideas for Father’s Day starting at $5... - The US Sun","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL9IBSWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL9IBSWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL2FtcC8?oc=5","id":"CBMiRWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL9IBSWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL2FtcC8","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL9IBSWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL2FtcC8?oc=5\" target=\"_blank\">Four Aldi Finds this week including perfect gift ideas for Father’s Day starting at $5...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The US Sun<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Four Aldi Finds this week including perfect gift ideas for Father’s Day starting at $5... - The US Sun","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL9IBSWh0dHBzOi8vd3d3LnRoZS1zdW4uY29tL21vbmV5LzgzMTA5NTMvYWxkaS1naWZ0LWlkZWFzLWZpbmRzLXByb2R1Y3RzL2FtcC8?oc=5\" target=\"_blank\">Four Aldi Finds this week including perfect gift ideas for Father’s Day starting at $5...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The US Sun<\/font>","source.href":"https:\/\/www.the-sun.com","source.title":"The US Sun","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"KING FOR A DAY Four Aldi Finds this week including perfect gift ideas for Father’s Day starting at $5 ALDI shoppers are in for a treat if they’re looking for the perfect Father’s Day gift this week. Aldi just released its weekly Aldi Finds, which include great deals on home goods, clothing, and grocery items. 5 Aldi launched several new products this week Credit: Getty The deals are only available as supplies last, so it pays to go to the store right when they come out each Wednesday. For shoppers who are quick to run to stores, there’s several new items that seem geared toward the upcoming Father’s Day holiday. With Father’s Day around the corner, taking place on Sunday, June 18, Americans are already looking for unique presents catered specifically for the father figure in their life. Here’s a full list of Aldi Finds that might make a perfect surprise for your dad come Father’s Day. 1. BEER CANDLE 5 The Beer Candle will be loved by many fathers across the country Credit: Aldi If your dad is a craft beer connoisseur, he will jump at the chance to have the Huntington Home Craft Beer Candle in his possession. Three different variations are available of the beer candle, depending on your (or your dad’s) specific taste. The Chocolate & Oatmeal Stout is sure to provide the traditional stout aroma with a hint of sweetness. Meanwhile, the Wolf Mountain Brewing is another soy-based candle that promises to deliver the scent of Hops and grapefruit. The last option is an Amber Ale variety, which delivers a honey and barley scent. All are available for just $5.99. 2. BBQ TOOL SET 5 The BBQ tool set is perfect for fathers who enjoy grilling Credit: Aldi If your dad is less of a beer drinker and more of a grill master, then consider Aldi’s new BBQ tool set. The four-piece Range Master set includes several tools that will up your grilling style this summer. The full set is made with stainless steel and includes a pair of tongs, a basting brush and spatula. Best of all, the entire set comes for just $12.99. Since Father’s Day is conveniently placed around the summer months, this Aldi’s find could prove best of all. 3. OUTDOOR FIRE PIT 5 Aldi's outdoor fire pit is under $60 Credit: Aldi Speaking of summer, nothing can bring together a summer gathering quite like a fire pit. Luckily, this week, Aldi also has an Aldi Finds Outdoor Fire Pit priced at $59.99. This gift will properly bring the party together if you or your dad wants to host an outdoor event this season. The Belavi 30 inch pit includes a mesh spark screen and fire poker. Fire pokers are used to stoke the logs or lift the spark screen. The item also boasts a circular design for more air flow and bigger flames, according to the product description. 4. FRUIT SMOOTHIE SELTZER 5 The Tropical Fruit Smoothie Seltzer will work at summer parties this season Credit: Aldi If instead of smelling a candle, you’d rather just open up a cold one with your father, Aldi also has a new seasonal alcoholic beverage you can try. The State of Brewing Tropical Fruit Smoothie Seltzer has a colorful design and could be a perfect accompaniment to your Father’s Day celebration. It also works for any casual sipping pool or beachside this summer season. The beverage has an alcoholic content percentage of 5 percent and contains pineapple, mango, passion fruit, and dragon fruit flavors. The exact price of the drink could vary by store and location. SCORE MORE SAVINGS AT ALDI You are already putting yourself in good budgeting hands by choosing to shop at Aldi. After all, as a bargain retailer, Aldi regularly sells products far cheaper than other store brands. However, there are other specific things you can do to save even more. For one, timing is everything. If you go to Aldi on a Wednesday, you might have better luck because this is when they add in new Aldi Finds every week. These are the specialty food or home goods items that Aldi’s does not plan to restock, so you need to find them quickly. While Aldi’s doesn’t accept coupons, their meat, eggs and produce prices are regularly lower than even top competitors like Walmart. You can also use cashback apps like Ibotta or Fetch Rewards to make some money while you shop, earning rewards on name brand items you can regularly find at Aldi. You should also generally try to stock your pantry with staples and compare prices between stores to get the best deals. While Aldi regularly adds new items to its lineup, the retailer has been slammed by customers for discontinuing a popular sweet snack. Similarly, a beloved $1 ice cream’s discontinuation at the store has left shoppers heartbroken.","filter_flag":1}
{"title":"Day One from 3 Days of Design in Copenhagen - Dezeen","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wOC9kYXktb25lLWZyb20tMy1kYXlzLW9mLWRlc2lnbi1pbi1jb3BlbmhhZ2VuL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wOC9kYXktb25lLWZyb20tMy1kYXlzLW9mLWRlc2lnbi1pbi1jb3BlbmhhZ2VuL9IBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wOC9kYXktb25lLWZyb20tMy1kYXlzLW9mLWRlc2lnbi1pbi1jb3BlbmhhZ2VuL9IBAA","guidislink":false,"published":"Thu, 08 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=159, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wOC9kYXktb25lLWZyb20tMy1kYXlzLW9mLWRlc2lnbi1pbi1jb3BlbmhhZ2VuL9IBAA?oc=5\" target=\"_blank\">Day One from 3 Days of Design in Copenhagen<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dezeen<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Day One from 3 Days of Design in Copenhagen - Dezeen","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8wNi8wOC9kYXktb25lLWZyb20tMy1kYXlzLW9mLWRlc2lnbi1pbi1jb3BlbmhhZ2VuL9IBAA?oc=5\" target=\"_blank\">Day One from 3 Days of Design in Copenhagen<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Dezeen<\/font>","source.href":"https:\/\/www.dezeen.com","source.title":"Dezeen","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"The Dezeen team are reporting live from the 10th edition of 3 Days of Design in Copenhagen (7-9 June). Read on for all the coverage from the first day (Wednesday 7 June) 5:30pm The Ukurant exhibition, which was founded by young designers for young designers, chose to showcase its third exhibition at 3 Days of Design in a functioning carpentry workshop on the Refshaleøen peninsula. Here, works by 18 emerging designers from all over the world mingled with woodwork machines and raw materials. Each contributor was chosen by Ukurant from around 200 applicants and pieces ranged from lights made from egg protein to Paperwork, an artwork and lighting design made from paper, thread, steel weights and artificial lights that was suspended from the high ceiling – Cajsa Carlson 5:00pm Le Corbusier's Lampe Cabanon and the Lampe de Bureau collection by Charotte Perriand are on show in Nemo Lighting's Copenhagen showroom during 3 Days of Design. \"Le Corbusier and Charlotte Perriand's lamps were conceived as absolute projects, made exclusively for the architectures for which they were designed,\" Nemo CEO Federico Palazzari told Dezeen. Read more about Nemo Lighting's \"abandoned\" Le Corbusier and Charlotte Perriand lamps 4:00pm Zurich-based designer Alfredo Häberli and Max Fraser are being filmed for 3 Days of Design \"Walk and Talk\" series. Community is central to the culture of design Häberli, an established designer of furniture and products, stressed the importance of physical events post-Covid and the need \"for human connection again\". He continued \"we can't only exist digitally. We need interaction, to discuss and debate, to enjoy some drinks together. Community is central to the culture of design\" – Max Fraser 3:30pm Dezeen events guide editor Sophie Chapman has been to see Mater's What a Waste exhibition, which explores the material cycle and presents Mater's furniture alongside how many grams of waste – predominantly coffee shells – are included in the material composition of each one. The exhibition begins outside of the venue, with visitors invited to follow a path highlighting environmentally-related facts, reminding the visitor of the global impact of consumption. The brand revealed it uses more than four kilograms of coffee shells in the production of their Eternity Chair model, and almost two kilograms in the Edge shelf. What a Waste also spotlights the brand's collaboration with Arla and Holmris B8, using surplus plastic from Arla's milk cartons to make its Matek material – Sophie Chapman 2:00pm At the Conversations in Sound exhibition at 3 Days of Design, design duo GamFratesi (Stine Gam and Enrico Fratesi) spoke to Dezeen about their tactile speaker design for Bang & Olufsen and about how the festival has grown since it started a decade ago. After Milan, 3DD is the second biggest destination for design \"We started this adventure and after ten years, it's becoming probably, after Milan, the second biggest destination for design,\" Fratesi told Dezeen. \"We have clients and press coming from the US, coming from the Far East; everybody that we met in Milan is basically travelling again to be in Copenhagen,\" Fratesi continued. The speaker, Beosound A5, features modular covers made from paper raffia and oak lamellas. It was presented together with a table from GamFratesi's studio featuring the different materials and components of the speaker and the design process of the project, as well as a room clad entirely in paper raffia – Cajsa Carlson Read more about the project on Dezeen later this week. 1:00pm Danish furniture brand Fredericia has announced it has just attained B Corp certification, one of only a few furniture companies in Denmark to do so. B Corp is the good side of capitalism Owner Thomas Graversen explained \"being a family-owned business, you feel more responsibility when you put new products into the world. For us, it was important to express this through our commitment to the stringent environmental and social principles adhered to by B Corp\". Other Danish companies awaiting B Corp certification include lighting brand Astep. \"B Corp is the good side of capitalism,\" Astep founder Alessandro Sarfatti told Dezeen – Max Fraser 12:00pm French designer Inga Sempé has collaborated with Kvadrat creative director Isa Glink to create a collection of fabrics that translate continuous and rhythmic lines drawn by Sempé into yarn and fabrics. \"It's not a boring grid, as if you were in jail,\" said Inga Sempé at Kvadrat's showroom when discussing the design of one of the fabrics that forms part of the new collection – James Parkes 11:30am Dezeen editorial director Max Fraser has caught up with 3 Days of Design co-founder Signe Byrdal Terenziani. We are here to celebrate passionate designers, to share ideas, and explore new things She reflected on ten years of the citywide event. \"Now more and more people know and have experienced 3 Days of Design but the concept remains the same ten years on: we are here to celebrate passionate designers, to share ideas, and explore new things.\" \"It's not just a regular fair where you have to sell, sell, sell. The fact that you can easily walk from showroom to showroom in Copenhagen makes a difference to the experience. You wouldn't experience that in a fairground,\" Byrdal Terenziani continued. 11:00am Dezeen reporter James Parkes has been to see Spanish artist and designer Jaime Hayon's installation at &Tradition's headquarters-turned showroom for the launch of its Momento and Fomakami collection. The installation comprises two spaces including a \"cabinet of curiosities\" and a decorative vignette (pictured above), which serves as the backdrop for the product launches. 10:30am Dezeen deputy editor Cajsa Carlson has had a sneak peak of Finnish pine furniture brand Vaarnii's exhibition at Tableau and spoke with the brand's founder. The way that we consume stuff is broken Vaarnii founder Antti Hirvonen told Dezeen \"we originally started the brand with the idea that the way that we consume stuff is broken\". \"We wanted to do things that actually last a hundred years.\" Vaarnii’s \"brutal and sophisticated\" furniture is juxtaposed against sculptural pieces by other artists and designers that are part of the display at multidisciplinary studio Tableau's gallery space in Copenhagen during 3 Days of Design. The exhibition at Store Kongensgade 50 is on view from 7 to 9 June. 10:00am Also from yesterday, Dezeen editor-at-large Amy Frearson was the first journalist to see an exhibition by glassware design studio Helle Mardahl Studio for The Sensory Society and spoke to the designer. I love being an artist as well as a designer – it's a playground and there are no limits Mardahl's work spans lighting and homeware. Her designs are all mouth-blown glass objects and typically have a candy-like aesthetic, with bold colours and round shapes. For 3 Days of Design Mardahl is presenting in her studio's apartment showroom. Each room has a different installation, including one designed to look like a grand dressing room, and another set up with an incredible circular bar counter. Across the rooms new and recent products are displayed, including her Candy Series One collection, which launches today (7 June). The new products include wine glasses and her take on the perfect bowl. In a presentation to a room of special preview guests – mostly interior designers – she said \"I love mixing art and functionality; I love being an artist as well as a designer. To me, it's a playground and there are no limits\". \"This year we named the exhibition The Sensory Society. We transformed this old amazing apartment into a world of imagination. I was inspired by Wes Anderson's The Grand Budapest Hotel when I implemented the colours from our newest additions to the Candy Collection, such as grapefruit, blue jelly and champagne – absolutely yummy. 9:30am Ahead of the official launch later this morning, yesterday afternoon Dezeen reporter James Parkes attended the unveiling of House of Finn Juhl's latest project, the 77 chair. Founder Ivan Hansen (pictured above, left) described the new chair as \"a piece of Lego\" and named it \"perhaps the brand's least iconic chair\". \"You won't believe how difficult it is to make something this simple,\" he said. The 77 chair is available in textile or leather upholstery (pictured) with burnished steel legs and wooden toes in oak or walnut. 9:00am Dezeen's editorial director Max Fraser, editor-at-large Amy Frearson, deputy editor Cajsa Carlson, events guide editor Sophie Chapman and junior reporter James Parkes are on the ground in Copenhagen reporting from the 10th edition of 3 Days of Design. Dezeen Events Guide has created a 3 Days of Design guide, highlighting the key events at the festival this year. As the 2023 event gets under way, look back at of some of our coverage from last year – including architects Frank Maali and Gemma Lalanda's \"sacral feeling\" steel-clad 1950s garage event space for Vipp and a translucent pavilion by Henning Larsen Architects for Fritz Hansen's 150th anniversary. To stay up to date, follow Dezeen live: 3 Days of Design in Copenhagen, taking place from 7 to 9 June 2023. Dezeen Events Guide has created a 3 Days of Design guide, highlighting the key events at the festival. See Dezeen Events Guide for all the latest information you need to know to attend the event, as well as a list of other architecture and design events taking place around the world. All times are Copenhagen time. The lead image is by Cajsa Carlson.","filter_flag":1}
