{"title":"How a ban on single-use plastics creates new opportunities for the paper industry - The Times of India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5L9IBgwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5Lw?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5L9IBgwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5Lw?oc=5","id":"CBMigwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5L9IBgwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5Lw","guidislink":false,"published":"Tue, 28 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=59, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5L9IBgwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5Lw?oc=5\" target=\"_blank\">How a ban on single-use plastics creates new opportunities for the paper industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How a ban on single-use plastics creates new opportunities for the paper industry - The Times of India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5L9IBgwFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9ibG9ncy92b2ljZXMvaG93LWEtYmFuLW9uLXNpbmdsZS11c2UtcGxhc3RpY3MtY3JlYXRlcy1uZXctb3Bwb3J0dW5pdGllcy1mb3ItdGhlLXBhcGVyLWluZHVzdHJ5Lw?oc=5\" target=\"_blank\">How a ban on single-use plastics creates new opportunities for the paper industry<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Times of India<\/font>","source.href":"https:\/\/timesofindia.indiatimes.com","source.title":"The Times of India","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"There is no denying the fact that what goes around comes around, especially when it comes to plastic. And being a global environmental problem, plastic pollution received attention from all over the world. Even clothing that we choose to discard or that has worn out is never truly gone. According to the Central Pollution Control Board, India produces a staggering 3.5 million pounds of plastic waste annually. A third of India’s plastic usage is used for packaging, and 70% of that plastic packaging is quickly decomposed and thrown into the garbage. And last year, the government announced a ban on single-use plastic in an effort to slow the growth of plastic consumption while putting an emphasis on making every step count. The ban has led to an increase in the use of sustainable products. While different industries are still looking for ways to create novel products and eco-friendly alternatives to plastic, paper products have been proposed as a promising substitute that cannot be disregarded. According to industry experts, the paper industry can contribute to a number of applications, including paper straws, cutlery, and bags. As a result, the single-use plastic ban has opened up ideal gateways and opportunities for the paper industry. Single-Use Plastic Ban in India Over the past few years, due to its ease of availability, affordability, high ductility, and insulation, plastic has been widely used in industries such as agriculture, medicine, and other fields. In this context, the production of plastics has experienced rapid growth. Plastic pollution has had a serious and irreversible impact on the global ecosystem and biodiversity. In order to avoid or alleviate these problems, India is one of several nations that have successively introduced a series of schemes and regulations that forbid and restrict the use of plastic items in an effort to prevent or lessen these issues. In fact, every sustainable action we take to lower our carbon footprint and environmental impact benefits our ecosystem. In practice, sustainability is as much about our future as it is about our present. Making larger changes in our lives is challenging, but taking gradual steps in the correct direction may pave the way. Similarly, the Indian government has made a minor attempt to eliminate single-use plastics and replace them with goods made of reusable materials. And to stay abreast of the trends, in today’s world, humankind as well as organizations have started using paper bags instead of single-use plastic materials. Since avoiding single-use plastic goods saves non-renewable resources and non-biodegradable garbage that would otherwise wind up in landfills, In truth, sustainability is a daily option that may encourage individuals to make more sustainable choices and preserve our future by minimizing our environmental imprint! The capacity to fulfil all of our present demands without jeopardizing future generations’ ability to meet their own is characterized as sustainability. Therefore, the efforts made by the government, such as the single-use plastic ban, have had a positive impact by creating myriads of opportunities for the paper industry. Opportunities Made Available by the Ban The ban on single-use plastics has had a positive impact on the paper industry. Here are a few opportunities that have been created by a plastic ban. Increased demand for paper products: With the ban on plastic, the shift towards more environmentally friendly alternatives such as paper bags, paper straws, and paper food containers has gained traction in the country. The increased demand for paper products led to new business opportunities and growth for the paper industry. Companies that produce paper products can expand their operations, and new businesses can be established to meet the growing demand. Increased investment in research and development: With the growing demand for more environmentally friendly products, the paper industry may also see an increase in investment in research and development. This could lead to the development of new and more sustainable paper products that can be used as alternatives to plastic. Development of new and innovative paper products: The paper industry can also respond to the plastic ban by developing new and innovative paper products that are designed to replace plastic products. For instance, there can be an increase in the production of compostable paper products that can be used for food packaging. Diversification of product offerings: In order to stay competitive, paper manufacturers also consider diversifying their product offerings. For instance, they can start producing paper products that are specifically designed for use in industries such as food service, healthcare, and retail. Creation of job opportunities: The prohibition on single-use plastics will offer new opportunities with the overall growth in the paper sector as people seek alternatives to plastic items. As a result, the production of paper products creates jobs for people to do the work effectively and efficiently and contributes to the local economy. All Things Considered! In the modern day, where everything is changing at a breakneck pace and environmental concerns have gained huge traction in the country, the government has come up with a single-use plastic ban and created the opportunity for paper products as a replacement. As a result, the ban has also generated numerous possibilities for the paper industry, such as increased demand for paper-based products, the creation of several job opportunities, and the development of new products. Facebook Twitter Linkedin Email Disclaimer Views expressed above are the author's own.","filter_flag":1}
{"title":"BRIEF23 | Anil Chowta, Ecosac: A limitation is in one's mind- what you believe, you will achieve - Mediabrief","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbWVkaWFicmllZi5jb20vYnJpZWYyMy1hbmlsLWNob3d0YS1lY29zYWMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbWVkaWFicmllZi5jb20vYnJpZWYyMy1hbmlsLWNob3d0YS1lY29zYWMv0gEA?oc=5","id":"CBMiMmh0dHBzOi8vbWVkaWFicmllZi5jb20vYnJpZWYyMy1hbmlsLWNob3d0YS1lY29zYWMv0gEA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbWVkaWFicmllZi5jb20vYnJpZWYyMy1hbmlsLWNob3d0YS1lY29zYWMv0gEA?oc=5\" target=\"_blank\">BRIEF23 | Anil Chowta, Ecosac: A limitation is in one's mind- what you believe, you will achieve<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mediabrief<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BRIEF23 | Anil Chowta, Ecosac: A limitation is in one's mind- what you believe, you will achieve - Mediabrief","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vbWVkaWFicmllZi5jb20vYnJpZWYyMy1hbmlsLWNob3d0YS1lY29zYWMv0gEA?oc=5\" target=\"_blank\">BRIEF23 | Anil Chowta, Ecosac: A limitation is in one's mind- what you believe, you will achieve<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mediabrief<\/font>","source.href":"https:\/\/mediabrief.com","source.title":"Mediabrief","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"BRIEF23 brings you insights and inspiration from Anil Chowta , Founder & CEO, Ecosac – the eco-friendly and reusable utility bags and sustainable consumer products brand. Anil writes on invitation and exclusively for our special series BRIEF23, which features industry stalwarts, thought leaders, industry captains, business heads, brand custodians and other C-suite heads from diverse companies across sectors, size and scale, sharing their learnings from 2022, and guidance and inspiration to help empower professionals for the upcoming FY 2023-24. Chowta stepped into the business world in 1990 with Falcon as a brand providing training kits to more than 3000 engineering colleges globally. An engineer in Electronics & Telecommunications, he explored the field of technical training products for 22 years. While he built a scalable business at Falcon, his desire to improve society and the environment led him to establish the sustainable product brand – Ecosac. In 2016, he created Ecosac to eradicate single-use plastic and paper shopping bags. The ecopreneur subsequently launched Kachra Sack- compostable and oxo-degradable garbage bags to replace the plastic garbage bags that end up as deadly waste in landfills and oceans. BRIEF23 by Anil Chowta – Ecosac 2022 defined: 2022 was surely a year full of mixed sentiments. Like most businesses, the first half of the year was recovery time from the jolts we took from Covid-19. From the point of view of retail business, the good news was that the consumers gradually stepped out of their homes to shop for essentials, as well as daily use consumables, leading to a gradual increase in the demand for our products. Towards the mid of the year, as the transition phase got over and lifestyles started getting back to normal, we saw a boost in the confidence of retailers too. With consumers increasingly buying non-essential products, the market displayed welcoming opportunities for our products. By the second half of the year, festivals followed. As celebrations were largely awaited since the past two years, consumers were open to spending and we witnessed a surge in demand and hence, sales. What stood out about 2022? Growth of Online Quick service business – Consumer behaviour changed to a great extent during the pandemic. Online services received a great impetus during the lockdown. As the options were explored and utilized then, so were they continued to be in demand post the pandemic too. Global Acceptance of the world moving towards sustainability – One really positive addition to the entire shift in consumer behaviour is that there is now, due emphasis on going sustainable. The pandemic was an eye-opener about the damage being caused to the environment, given that there were major ecological changes while people and businesses were under a complete lockdown. With this, there is a greater level of awareness and acceptance for products and services that serve the purpose of sustainability and planet friendliness. The world over, people as well as global organizations are encouraging and adopting sustainable living as their way of life. Increase in travel – which was a positive sign of confidence toward consumers, retailers, etc. Increased travel in the year 2022 has opened up new opportunities for our business. On track, ahead of, or trailing the pack?: We are on track. We have been able to tick all the vertices we wanted to be in with a presence in major ecommerce platforms – Bigbasket, Zepto, and Reliance along with strengthened exports. We have also successfully attained our goal of being present in 10,000 outlets globally. This year we expanded our product range with the launch of our brand, Ecopath, which is a range of eco-friendly alternatives to single-use consumer products. In 2022, we were able to successfully chart out our plans and lay the foundation for exponential growth. Lessons learnt: On the professional front, I understood that optimising costs is an exercise organisations must do prudently and consistently and it can take place through multiple unexpected sources. The biggest learning about optimizing costs can be learnt by understanding how the customer manages to cut costs. On the Personal front, I have realised the fundamentals of compounding and how it works in all aspects of life. I am also trying to implement the art of delegation, so as to optimise my own potential to expand and scale up the business. Who\/What inspired me: Shantanu Deshpande’s podcast BarberShop. I tune into it regularly. The episodes are really enriching from the business growth point of view and inspiring for any entrepreneur. There has been a diverse set of learnings and takeaways from the various guests at the show. There are many aspects to learn from founders of startups and unicorns who have scaled up their businesses to greater levels. It is really valuable to go through their journeys, their success stories, and the strategies used, which we could implement in our businesses for growth. Looking ahead: Our company is poised for 3x growth, and we are building the right path for our journey ahead. What excites me about the future? Opportunities presented by CoP 27. World leaders are coming together and talking about adopting measures to go carbon neutral; an excellent step that complements our goals and also our product proposition. Opening up market for sustainable products in 175 countries Sustainable product alternatives in other product categories- such as stationery and baby care products have also shown promising signs of growth. The large appetite for D2C brands in India is promising and remains a key focus for us. And here’s how we’ll do it!: We plan to develop a new range of products exploring other eco-friendly materials for our existing customers, as well as white labeling for upcoming customers. This will lead us to explore the following opportunities, Cross Range selling to newly acquired high-value customers and steady development and testing of new products. We also look forward to hiring senior personnel and talent on our way forward for upscaling the business. Advice (To myself): Persevere. Utilise my time better. Delegate work to develop the business and work on strategies. Look at raising funds to achieve higher goals. One big learning\/realization: A limitation is in one’s mind- what you believe, you will achieve. Train the mind to achieve and the sky is the limit. The quote or thought that’ll inspire me in 2023: If you think you can, or you think you cannot, you will be right","filter_flag":1}
{"title":"Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5\" target=\"_blank\">Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL2Zhc2hpb24tYmVhdXR5L3RyZW5kcy90ZWNoLWRyaXZlbi1zdXBwbHktY2hhaW4tYW5kLXRyZW5kLWFuYWx5c2VzLW1ha2UtYXJyb3ctaW5kaWEtb21uadIBAA?oc=5\" target=\"_blank\">Tech-driven Supply Chain and Trend Analyses Make Arrow India Omni-enabled<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Eco-friendly Alternatives\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Year Ender: How India is embracing New-Age Beauty and Personal Care Brands With the eventful year of 2022 coming to an end, every Indian can be seen to rejoice and prep for the new year as the same is happening after a pandemic-struck hiatus of 2 long years. With festivities around the corner, there has been a significant surge in demand in the markets which are flooded with consumers. Every industry is witnessing the surge, and Beauty and Personal Care is not behind. However, the stiff competition for customers between online and offline brands has become more prominent than ever. To understand the commotion among the brands this season, these brands give us an insight into their 2022 journey and their 2023 growth plans. SUGAR Cosmetics This year SUGAR Cosmetics touched larger milestones, becoming one of the select few brands that have launched 120+ of their own stores in retail, reaching a total of 45000+ retail touchpoints across 550+ cities. SUGAR’s IG page garnered 2.4M+ followers, becoming the largest consumer brand in India on the platform, along with our experiment into gamified AR filters that hit virality on platforms like Instagram and Moj. The brand’s #ShukarHaiSUGARHai Campaign with campaign ambassadors Ranveer Singh and Tamannaah Bhatia was also a huge viral success allowing the brand to receive support from impactful investors namely LCatterton and Ranveer Singh. “At SUGAR in 2022, we managed to almost double our sales over the previous year, achieved the target of being one of the Top 3 brands in color cosmetics in India, and are looking at another year of massive growth,” said Vineeta Singh, Co-founder, and CEO, SUGAR Cosmetics. She further added, “Our plans for 2023 include targeting and achieving a 100 percent Y-O-Y revenue growth over last year, expansion to more than 60,000 retail outlets, making our D2C platform base stronger and larger, and growing our team size to 3,000 employees.” Keeping its audience in mind, SUGAR is looking forward to tapping into different categories of the beauty industry. The brand will also focus on creating solid content to keep educating and engaging its community across all platforms–digital and others. The Body Shop \"We at The Body Shop are embarking upon a new strategy of ‘Change Making Beauty’, which means that we aim to empower customers, employees, and partners to drive positive change for the world through our channels, our products, and our activism,\" stated Vishal Chaturvedi, Vice President, The Body Shop, South Asia. With this vision, the brand is aligned to reach its goal of 25 new stores in 2022 at various locations. Currently, having 200 highly visible and accessible stores all over India, including Tier I and II cities, with the latest additions in Itanagar, Surat, and Indore. The brand's current product portfolio is already over 60 percent Vegan, aiming to become 100 percent Vegan by 2023. This aim is the natural next step forward for the brand's Cruelty-Free commitment, including reformulating all our core products from 100 percent Vegetarian to 100 percent Vegan, while focusing on making its product packaging 100 percent recyclable thus reducing its environmental impact. \"We are strengthening our retail and e-commerce channels by opening more workshop stores and launching new digital experiences. We are expanding our retail footprint with a clear focus on smaller cities and towns. Rolling out the new Workshop store format in as many stores as possible: 30+ new ACTIVIST Workshop stores per year, every year till 2025 bringing the brand to people where they love to shop,\" added Chaturvedi. Plum Plum would be closing the financial year at over 2x the revenue of the previous FY, complemented by the 44 percent growth seen in its overall customer base with a 96.54 percent increase in repeat buyers which is a great win in the D2C space. “We raised $35 million (Rs 270 crore) in a Series C round in March 2022 totaling our funding to over $50 million. With this, our efforts have been towards bringing in more salient brand communication, growing our omnichannel presence and onboarding high-quality talent with a focus on investments in marketing and technology,” said Shankar Prasad, Founder & CEO, Plum Having launched over 8 exclusive brand outlets in the last year across cities, the brand plans to scale this up to 50 in the coming year. Furthermore, Plum onboarded Rashmika Mandanna and Mithila Palkar as its brand ambassadors for the Plum skincare range and Ananya Panday for the Plum Body Lovin’ fragrance range. “We would be expanding our makeup range aggressively with a host of innovative product formats in the coming year. We would also be launching a line of products in the essentials and advanced ranges under both skincare and haircare categories,” added Prasad. Colorbar The post-pandemic period has witnessed a radical shift in consumer behavior and expectations. As per research, the total retail sale is expected to reach $5.5 trillion by 2027 with online sales making up 30 percent of the market. The retail industry has been largely shadowed by challenges across the supply chain, economic uncertainty, and geo-political factors. I feel that going forward, the only way for retailers to sail through is by exhibiting strong levels of adaptability, agility, and flexibility. \"As we graduate into the next year, we can expect a renewed focus on enhancing the customer shopping journey by providing a seamless experience for hybrid shopping. Re-invention of physical store designs along with a robust omnichannel strategy would, however, emerge as a top priority. Many companies will be seen adding features to support new shopping initiatives while integrating technologies supporting AR\/VR advancements. We are aligned to lead the change and have a strong conviction that our strategy would create benchmarks of excellence in 2023,” stated Samir Kumaar Modi, Founder, and Managing Director, Colorbar Cosmetics. Kapiva “We have been relentlessly working towards improving the health and wellness quotient of Indians with Ayurveda. Recently, we expanded in the US and UAE to enable this for the global audience as well. Our focus this year was on increasing the effectiveness of our products. We’ve moved the needle on that front by successfully conducting a clinical trial for our Dia Free Juice. It has also proven to be effective in decreasing HbA1c to an extent of 11 percent and increasing insulin production in the body by up to 25-30 percent. However, the highlight of the year was definitely the recognition by Honorable PM Modi,” said Ameve Sharma, Founder, Kapiva. In the upcoming year, Kapiva aims to double down, concurrently increasing brand awareness and recall to become a household name. Modern consumers are less concerned with outward appearance than they once were, and are more concerned with their complete well-being, which encompasses physical, mental, and emotional health. In order to capitalize on this trend, Kapiva is constantly creating consumer awareness by keeping the emphasis on the paramount importance of Ayurveda and how it can enable people to live a holistic lifestyle. Earth Rhythm 2022 was a favorable year for Earth Rhythm, as it brought in a lot of positive changes in terms of organization, growth, and product. At an organizational level, the brand was able to double the size of the team with its customer base growing 4x times compared to the previous financial year. The brand also went offline with the launch of its exclusive kiosks at 12 different locations across India. “We are expanding our makeup category which will go on to strengthen Earth Rhythm’s wide-ranging portfolio, we have also been intensifying the existing categories. True to our digital-first identity, it was also a natural step for us to continue investing in technology in a bid to further streamline operations and give our customers every convenience they desire. We successfully launched our very own mobile App for both Android and iOS platforms this year and have been gaining steady traction on it. Next year, we plan to further build our portfolio by deepening the makeup category launched in 2022. We reckon 2x growth over FY 2021-22,” said Harini Sivakumar, Founder, and CEO, Earth Rhythm. In keeping with this shift in the consumer’s preference, the brand aims to reinforce its multifunctional product range in both makeup and personal care (face, body, hair), aimed at eliminating the need for and use of multiple products in everyday makeup and skincare routines. ARATA This year at Arata launched over 20 products and 30 offline stores across India, steadily growing 10 percent month on month with respect to GMV. “In the upcoming year, we will go full throttle to bridge the gaps in our product line and be a one-stop shop for all hair care needs. We have already begun our groundwork and have set processes to create formulas in the anti-hair fall, hair colorants, and hair styling segments,” said Dhruv Madhok, Co-Founder, ARATA. BlushBee 2022 has been the year of the first full-fledged operations for Blushbee. Beginning with just three products and later expanding to 10 categories with 64 unique SKUs, the brand has witnessed massive organic growth in its customer base. BlushBee as a cosmetics line is a product of careful decisions in choosing what it wants, the other advantage is that being a clean and green beauty brand which is an important factor in the value proposition. “We hope to grow into a one-stop shop for all things related to color cosmetics, so we are actively looking into introducing new products like foundations, gloss, and so on. We have also discussed extending our horizons beyond just the realm of color cosmetics very soon,” stated Shobana and Navneethan, Founders, BlushBee Organic Beauty Brand. Crazy Owl - Your Skin Co The brand was launched in 2022 with the mindset of embracing the true self and exploring the crazy side. The brand is PETA and IFRA certified, FDA approved, and currently provides the best possible sensorial experience in Hair Care with India's First Date Seed Oil Shampoo, Conditioner, and Hair Oil. “In the short term, we are working towards expanding on two fronts- launching more affordable luxury products across categories in which we operate. With the right set of team, products, and marketing strategy we were able to launch our brand, and today, 6 months post the launch we are happy to serve more than 2000+ households,” commented Damanjit Kohli and Karishma Sahni, Founders, Crazy Owl - Your Skin Co. Increasing its touchpoint and interaction with the product, currently, Crazy Owl has signed up on all major marketplace platforms – Amazon Launchpad, Flipkart Propel Program, Purple, Snapdeal, Tata 1 mg, First cry, Myntra, Nykaa, Bigbasket and will be launching itself on Blink it, Paytm, Pharmeasy and Shopperstop planning to grow its channel every month. Pilgrim “As one of the fastest growing personal care brands in India, we have seen significant growth in the last 12 months and clocked a sale of Rs 10 crore per month along with a growth of 6X. With the trust that the brand has built throughout, we have had some great partnerships this year for our campaigns. Celebrity shout-outs from personalities like Soha Ali Khan, and Vidya Balan, and association with Kalki Koechlin in our most recent commercial have been one of the key highlights,” said Anurag, Co-Founder and CEO, Pilgrim. With a strong consumer base of 1 million, the brand aims to improve its interaction and thus upgraded its technology. Along with updating its technology, the brand is also using innovative ways to reach its target audience. Pilgrim aims to be a Rs 1,000 crore brand in the next 3-4 years by facilitating new product and category launches and exploring newer international markets like the Middle East. Moreover, planning to double down on its R&D capabilities and increase brand investments by bringing in global experiences for its customers, both online and offline. Along with establishing its presence internationally, Pilgrim aims to achieve an annualized run rate of Rs 500 crore by December 2023. iluvia Professional As a new-age, self-care brand pioneering product-driven innovation and technology, during the course of the year iluvia witnessed growth across different channels, and new launches, and hit several milestones. The organization has grown 25x in revenue between October 2021 and 2022 along with a 20x growth in its online consumer base, currently present across key marketplaces and in over 1800 salons in India across 70+ cities. “It is a very exciting time for us as we are working on introducing new patented treatment technologies and new launches in the haircare category. We also expect a positive growth trajectory of 6x to 7x in the coming year,” stated Nishant Gupta and Palash Pandey, Directors, Renaura Wellness Pvt. Ltd. Beauty and Skincare, as a category, has burst forth since the onset of the pandemic in late 2019. The D2C space, especially, has seen remarkable growth which we expect will continue in 2023 and beyond. Moreover, The Indian beauty and personal care segment, which stood above Rs 54,500 crore only two years ago, is expected to grow at a CAGR of 11 percent over the next five years.","filter_flag":1}
