{"title":"Harnessing The Future Of Digital And Smart Manufacturing Of Medical Devices - Med Device Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm1lZGRldmljZW9ubGluZS5jb20vZG9jL2hhcm5lc3NpbmctdGhlLWZ1dHVyZS1vZi1kaWdpdGFsLWFuZC1zbWFydC1tYW51ZmFjdHVyaW5nLW9mLW1lZGljYWwtZGV2aWNlcy0wMDAx0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm1lZGRldmljZW9ubGluZS5jb20vZG9jL2hhcm5lc3NpbmctdGhlLWZ1dHVyZS1vZi1kaWdpdGFsLWFuZC1zbWFydC1tYW51ZmFjdHVyaW5nLW9mLW1lZGljYWwtZGV2aWNlcy0wMDAx0gEA?oc=5","id":"CBMidGh0dHBzOi8vd3d3Lm1lZGRldmljZW9ubGluZS5jb20vZG9jL2hhcm5lc3NpbmctdGhlLWZ1dHVyZS1vZi1kaWdpdGFsLWFuZC1zbWFydC1tYW51ZmFjdHVyaW5nLW9mLW1lZGljYWwtZGV2aWNlcy0wMDAx0gEA","guidislink":false,"published":"Tue, 02 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=122, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm1lZGRldmljZW9ubGluZS5jb20vZG9jL2hhcm5lc3NpbmctdGhlLWZ1dHVyZS1vZi1kaWdpdGFsLWFuZC1zbWFydC1tYW51ZmFjdHVyaW5nLW9mLW1lZGljYWwtZGV2aWNlcy0wMDAx0gEA?oc=5\" target=\"_blank\">Harnessing The Future Of Digital And Smart Manufacturing Of Medical Devices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Med Device Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Harnessing The Future Of Digital And Smart Manufacturing Of Medical Devices - Med Device Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3Lm1lZGRldmljZW9ubGluZS5jb20vZG9jL2hhcm5lc3NpbmctdGhlLWZ1dHVyZS1vZi1kaWdpdGFsLWFuZC1zbWFydC1tYW51ZmFjdHVyaW5nLW9mLW1lZGljYWwtZGV2aWNlcy0wMDAx0gEA?oc=5\" target=\"_blank\">Harnessing The Future Of Digital And Smart Manufacturing Of Medical Devices<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Med Device Online<\/font>","source.href":"https:\/\/www.meddeviceonline.com","source.title":"Med Device Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Product life cycle management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Harnessing The Future Of Digital And Smart Manufacturing Of Medical Devices Digital transformation is rapidly evolving throughout the medical, pharmaceutical, and healthcare industries. In the medical device manufacturing segment, digital and smart manufacturing are essential to maximize efficiency, improve productivity, and exceed customer needs and expectations. Yet, many manufacturing processes are still performed manually. Reliance on outdated systems and processes negatively impacts corporate resources of time, money, and personnel. To eliminate this problem, systems, procedures, and processes need to continue to evolve, and advancements in automation can help accomplish these goals. There are many benefits to medical device manufacturers that embrace digitalization and smart manufacturing. Not only does this transformation streamline work, which reduces errors and saves time and money on repetitive or mundane tasks, it also expedites the expansion of a company’s product portfolio and satisfies regulatory requirements. In the medtech industry, technical documentation is interconnected, so if paper content is revised, multiple documents must be updated to maintain accuracy. Converting these systems to digital makes updates and maintenance faster and simpler. The digitalization of appropriate processes also improves end-user safety by removing risks associated with providing increased traceability of technical documentation. A design dossier, or a design history file, is one of the essential documents inspected by internal and external auditors. A comprehensive and fully traceable design dossier represents all the steps and evidence of the processes carried out during the design phase and enhances regulatory compliance, leading to smooth and transparent internal and external audits. Inspecting these interconnected design elements when they are not digitalized is extremely difficult. This leads to longer turnaround times for medical manufacturers to fulfill the requirements and pulls valuable financial and employee resources from existing tasks. Increased traceability can be obtained only through digitalization. Advanced Technologies And Industry 4.0 The movement toward mass digital and smart manufacturing has been dubbed the Fourth Industrial Revolution, or Industry 4.0, which includes: Implementation of artificial intelligence. Artificial intelligence (AI) in manufacturing can help with decision-making and creating countless data points that determine predictability, allowing manufacturers to take proactive steps to minimize errors and improve yield. Data analytics. New products improving patient safety are only possible when the manufacturers improve day-to-day operations by analyzing user response data points and leveraging insights. Machine learning. Machine learning algorithms can efficiently perform data collection and prediction of repeated tasks, improving accuracy and productivity. It can also assist with inventory management and compliance management. Reliance on the Internet of Things. The Internet of Things (IoT) has made remote monitoring possible by opening up opportunities for patient interactions with physicians, which is also cost-efficient. Wearables and home monitoring equipment allow physicians to keep track of a patient’s health more effectively and can be used to track medical equipment in real time. To optimize the use of digitalization, it is essential to implement product life cycle management (PLM) systems. PLM manages the entire life cycle of a product from inception through engineering, manufacturing, and even servicing and disposal. Each part of the process that can be moved from manual to digital improves that individual step, and the more steps that are digitalized, the more impactful the overall outcome. Smart manufacturing enhances digital manufacturing processes even further through the use of manufacturing execution systems (MESs). These are software solutions that connect live production information between multiple vendors and locations and integrate with a company’s existing equipment and business applications, creating smart connections. MESs deliver quality and efficiency, optimizing production and providing control over processes across the entire enterprise. An MES solution tailored to the medical device and diagnostic industry should generate a paperless manufacturing environment by eliminating much of the human element, reducing errors while increasing regulatory compliance. R&D Versus Manufacturing Connecting medical research and development (R&D) with manufacturing is critical to the success of digital and smart acceptance and implementation. For example, the role of an R&D team is to determine what product should be created and then proceed with the development of that item, adjusting and improving it along the way. Once a final decision is reached, the project shifts to manufacturing through a design transfer process, where the product is actually produced. It is important for both the R&D and manufacturing teams to perform their duties as cleanly and efficiently as possible. This includes vital and continuous communication between the groups to facilitate informed decision-making. Without clear direction and specificity, the manufacturing team cannot satisfactorily complete the job. If the manufacturer runs into issues that tie back to the R&D team to resolve, it is vital to document these challenges and communicate appropriately so applicable revisions can be made. Without digitalization, this process would be slow and inefficient, potentially resulting in major delays and lost revenue. Tips For Successful Implementation Of A Digital And Smart Manufacturing Plan No new process is without its challenges, but it is possible to eliminate risks through awareness, careful planning, and mitigation. By doing the research before implementing a plan, an organization can be aware of potential issues. For example, companies can mitigate the problem of trying to move too much too fast by developing a plan to verify which systems are the most important to improve first and then identifying which processes can and can’t be easily digitalized. Not every process or product is upgradable, because some legacy products use older technology and documentation. For processes that can be upgraded, the implementation plan should be staggered. For legacy systems or products that cannot be upgraded, replacement is the only option, and this can be expensive. If multiple processes need to be upgraded, this also increases the cost. To decrease expenses, companies must determine which systems are most important to upgrade and then compare those against the easily digitalized systems to see where they overlap. Then, companies can choose one solution to start with and proceed as finances permit. For the successful implementation of a digital and smart manufacturing plan, follow these five steps: Run an end-to-end gap assessment of your business’ current conditions. Perform a feasibility analysis\/risk assessment to evaluate the practicality of the plan before proceeding. Include stakeholders in this part of the process. Create a data configuration and transfer plan by performing remediation to migrate the current data and process to the digital environment, possibly with some modification. Once complete, validate, verify, process, and evaluate data in a training environment before launching the product. Go live with implementation and install a tracking system to verify effectiveness and opportunities for improvement through a formal control change process. The Future Of Digitalization And Smart Manufacturing One of the biggest lessons learned from the COVID-19 pandemic was that remote work and digitalization are the unavoidable future. By taking steps now to shift manual processes to a smart manufacturing system, organizations are better poised to meet ever-evolving consumer demands. To be successful, manufacturers need to designate or hire coordinators who take ownership of researching and implementing new digitalized systems. Even if an organization has upgraded some of its existing processes, new options regularly become available to replace or upgrade older technology. As such, vigilance and the willingness to change are essential to a company’s ongoing growth and success. About the Author: Arokia Pranesh Kanna Sorimuthu is a global delivery head and an associate general manager with over 20 years of experience in the medtech industry. He works with top medtech manufacturers to implement key projects in the R&D and manufacturing domains. He is pursuing an MBA from Jack Welch Management Institute (USA) and holds a bachelor’s degree in engineering from Karunya Institute of Technology and a diploma in mechanical engineering from St. Xavier’s Polytechnic in India. For more information, contact praneshkanna81@gmail.com.","filter_flag":1}
{"title":"Medtech Innovation Needs a Digital Upgrade | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29tcGFuaWVzLW5lZWQtZGlnaXRhbC10cmFuc2Zvcm1hdGlvbi1pbi1tZWR0ZWNo0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29tcGFuaWVzLW5lZWQtZGlnaXRhbC10cmFuc2Zvcm1hdGlvbi1pbi1tZWR0ZWNo0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29tcGFuaWVzLW5lZWQtZGlnaXRhbC10cmFuc2Zvcm1hdGlvbi1pbi1tZWR0ZWNo0gEA","guidislink":false,"published":"Wed, 03 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=123, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29tcGFuaWVzLW5lZWQtZGlnaXRhbC10cmFuc2Zvcm1hdGlvbi1pbi1tZWR0ZWNo0gEA?oc=5\" target=\"_blank\">Medtech Innovation Needs a Digital Upgrade | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Medtech Innovation Needs a Digital Upgrade | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvY29tcGFuaWVzLW5lZWQtZGlnaXRhbC10cmFuc2Zvcm1hdGlvbi1pbi1tZWR0ZWNo0gEA?oc=5\" target=\"_blank\">Medtech Innovation Needs a Digital Upgrade | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Product life cycle management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Medical devices are vastly more sophisticated today than they were a decade ago. They are increasingly digitized and able to capture, process, and communicate far more information, leading to better efficiency and improved outcomes for patients, providers, and health care systems. However, innovation and development processes for medical technology (medtech) products have not kept pace. Many companies still think of development in terms of discrete products, with a clear start and finish line, rather than evergreen platforms with a more iterative innovation cadence. This must change. Leading technology and industrial goods players in sectors ranging from agriculture to aerospace have already made this transition and re-engineered their businesses. They are now equipped to continually improve their products—both hardware and software—and release upgraded versions to customers over time. Those firms’ success points to four clear priorities for medtech device and technology companies that want to apply a similar approach to innovation and product development. Shift from individual products to evergreen platforms. First, medtech firms need to adopt a platform approach that focuses less on isolated product launches and more on consistently updating and improving products after they get released. This approach lets companies monetize products across their full life cycle. For example, Apple’s iPhone is not a single product—it’s an ongoing platform, with new devices released roughly once a year and iOS software upgraded regularly. Apple doesn’t think of product launches as the finish line but merely the first step in a life cycle of continuous product innovation. It’s not a coincidence that the company outperforms customer expectations and has benefited financially as a result. Design teams should be tasked with continually improving the most important and common components across the entire product portfolio as an ongoing endeavor. This is a major mindset and strategy shift for medtech companies, with product development treated as long-term journey during which platform teams are accountable beyond the initial release. Several aspects can help: Modularize product design. A key aspect of this change is breaking products up into individual modules, each of which can evolve independently on its own timeline. These modules can be deployed and reused across multiple product lines and generations of devices. Design teams should be tasked with continually improving the most important and common components across the entire product portfolio as an ongoing endeavor. A key aspect of doing this is reallocating resources and shifting investment priorities to focus on modular designs. A key aspect of this change is breaking products up into individual modules, each of which can evolve independently on its own timeline. These modules can be deployed and reused across multiple product lines and generations of devices. Design teams should be tasked with continually improving the most important and common components across the entire product portfolio as an ongoing endeavor. A key aspect of doing this is reallocating resources and shifting investment priorities to focus on modular designs. Establish clear guidelines for interfaces across subcomponents and products. To make subcomponents (modules) work together and create reusability, companies need to be proactive about designing their interfaces, both for data flows and for physical connections. Interfaces need to be clearly defined and closely governed, with all design and innovation teams adhering to the determined parameters, both within the company and among third parties such as suppliers. To make subcomponents (modules) work together and create reusability, companies need to be proactive about designing their interfaces, both for data flows and for physical connections. Interfaces need to be clearly defined and closely governed, with all design and innovation teams adhering to the determined parameters, both within the company and among third parties such as suppliers. Evolve R&D funding models. Capital allocation needs to support the use of reusable and scalable modular designs while still holding business units accountable, informing portfolio decisions, and improving ROI. To accomplish these needs, organizations must establish new approaches to funding R&D. Firms must also identify, elevate, and fully fund larger programs and technologies that can generate benefits across the entire portfolio. Capital allocation needs to support the use of reusable and scalable modular designs while still holding business units accountable, informing portfolio decisions, and improving ROI. To accomplish these needs, organizations must establish new approaches to funding R&D. Firms must also identify, elevate, and fully fund larger programs and technologies that can generate benefits across the entire portfolio. Adjust incentives to drive reuse. Building a library of proven and ready-to-use modules requires up-front investment, but companies that can do this will reap the rewards. To help aid the transition, medtech leaders should create incentives for teams to develop modular designs and then set expectations that those designs will be used by teams that develop subsequent products (adhering to reestablished guidelines). There should also be clear disincentives to build one-off components unless absolutely essential. For example, companies should create more-stringent design reviews or senior approvals if a department wants to incorporate nonstandard components. Innovate more closely with end users. Second, top-performing medtech companies must adapt their design control process to engage with customers early, often, and at fixed intervals. They can start to do this in some of the following ways: Embed user testing into iteration sprints. User testing for medtech products has traditionally been treated as a milestone event that only happens at a few key junctures in the development process. Instead, innovation teams should work with customers regularly to gather and incorporate feedback. The easiest way to do this is to build user demos into the regular sprint cadence—typically every two weeks for software and monthly for hardware. This kind of fixed cadence increases not only the frequency but also the consistency of user input, and it prepares teams for a continuous-release cadence when products reach market. User testing for medtech products has traditionally been treated as a milestone event that only happens at a few key junctures in the development process. Instead, innovation teams should work with customers regularly to gather and incorporate feedback. The easiest way to do this is to build user demos into the regular sprint cadence—typically every two weeks for software and monthly for hardware. This kind of fixed cadence increases not only the frequency but also the consistency of user input, and it prepares teams for a continuous-release cadence when products reach market. Ensure user feedback is fully incorporated. Too often, end-user feedback is only considered for minor tweaks to engineering specs or slight improvements to the user experience—and it’s the R&D team’s responsibility to address any issues. This is a missed opportunity. A few medtech companies are starting to leverage end-user feedback to continually reprioritize which features are needed for a product’s initial release and which ones can be pushed to subsequent upgrades (or canceled entirely). By incorporating these changes earlier in the process, not only can companies ensure that products meet the needs of their target market, but innovation teams can accelerate their launch schedules. Success requires that R&D and marketing teams collaborate closely. It’s also essential that program leaders stay engaged to help teams evolve beyond the initial concept for the product. Product managers should be made accountable for the success of products both during development and after they’re in the market. Redesign innovation processes for speed. Third, medtech companies need to redesign their legacy innovation processes to be faster and more iterative. Automating repetitive processes in the development life cycle will help, along with several other measures: Streamline product documentation and regulatory filings. Just as end products can be broken down into modular components with their own design teams and innovation timeline, product documentation and regulatory filings can be simplified and streamlined. Companies can then isolate the documentation updates and retesting required for each release and focus only on those components that were meaningfully changed. This approach not only improves speed between releases but also helps reduce costs and keep resources focused on higher-value tasks. Just as end products can be broken down into modular components with their own design teams and innovation timeline, product documentation and regulatory filings can be simplified and streamlined. Companies can then isolate the documentation updates and retesting required for each release and focus only on those components that were meaningfully changed. This approach not only improves speed between releases but also helps reduce costs and keep resources focused on higher-value tasks. Enhance development and machine learning operations (DevOps and MLOps). Medtech companies have invested significantly in their processes for quality and product life cycle management. However, those processes are often suited for hardware intended to be released once and updated infrequently. In a more iterative and software-enabled world, medtech firms need strong DevOps and MLOps capabilities that enable ongoing releases and upgrades. Often this means creating overarching standards to make software code more portable, building out shared libraries and testing suites with blocks of code that are proven and well-documented. Companies can also invest in standardized tools for software development so engineers can collaborate more seamlessly across projects. Creating this type of environment can generate huge dividends in terms of speed. One medtech firm we studied was able generate its regulatory and quality documentation directly from its code base, keeping code, tests, and product documentation in sync at all times. Develop the talent base. Fourth, medtech companies need to apply the management strategies of tech organizations by empowering forward-thinking leaders to govern the strategy for the portfolio and the evolution of the underlying systems. Product managers should be made accountable for the success of products both during development and after they’re in the market. These managers should own the systems engineering function of the organization and be responsible for getting individual components completed and ready for use in end products. Such changes require top-line talent and leaders who put those people first. There are several ways to do this: Create product owners who are fully accountable to outcomes. Many medtech companies traditionally work in a very cross-functional way, with decisions largely made by committee. Instead, they should designate a leader who can own each product; make decisions about trade-offs with features, design, and costs; and have sole accountability for results—all based on a strong understanding of both the business and technology aspects involved. Notably, these owners retain their responsibility beyond the initial launch; they are accountable for the ongoing success of the product after it enters the commercial phase as well as for future releases and upgrades. Many medtech companies traditionally work in a very cross-functional way, with decisions largely made by committee. Instead, they should designate a leader who can own each product; make decisions about trade-offs with features, design, and costs; and have sole accountability for results—all based on a strong understanding of both the business and technology aspects involved. Notably, these owners retain their responsibility beyond the initial launch; they are accountable for the ongoing success of the product after it enters the commercial phase as well as for future releases and upgrades. Build the right capabilities. Medtech firms need to build up organizational capabilities in areas like robotics, software engineering, and AI and machine learning. Upskilling initiatives can build up these capabilities among current employees, but companies will also need to hire new talent, which means they will often be competing with other industries that are digitizing. To gain an edge in this highly competitive market, medtech players need a talent strategy for digital. This often starts with being clear on the skills that will be needed in the future, upgrading key elements of the employee value proposition, and rethinking location and talent sourcing strategies. Digital technology is transforming health care. Medtech innovation must evolve to take advantage of this opportunity. By focusing on the four priorities we have identified here—most of which have been proven in other industries—medtech companies can get new products to market faster and more efficiently and ensure that they are fulfilling their mandate of improving patient lives.","filter_flag":1}
{"title":"How businesses can close China's AI talent gap - McKinsey","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9jYXBhYmlsaXRpZXMvcXVhbnR1bWJsYWNrL291ci1pbnNpZ2h0cy9ob3ctYnVzaW5lc3Nlcy1jYW4tY2xvc2UtY2hpbmFzLWFpLXRhbGVudC1nYXDSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9jYXBhYmlsaXRpZXMvcXVhbnR1bWJsYWNrL291ci1pbnNpZ2h0cy9ob3ctYnVzaW5lc3Nlcy1jYW4tY2xvc2UtY2hpbmFzLWFpLXRhbGVudC1nYXDSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9jYXBhYmlsaXRpZXMvcXVhbnR1bWJsYWNrL291ci1pbnNpZ2h0cy9ob3ctYnVzaW5lc3Nlcy1jYW4tY2xvc2UtY2hpbmFzLWFpLXRhbGVudC1nYXDSAQA","guidislink":false,"published":"Fri, 05 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=125, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9jYXBhYmlsaXRpZXMvcXVhbnR1bWJsYWNrL291ci1pbnNpZ2h0cy9ob3ctYnVzaW5lc3Nlcy1jYW4tY2xvc2UtY2hpbmFzLWFpLXRhbGVudC1nYXDSAQA?oc=5\" target=\"_blank\">How businesses can close China's AI talent gap<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How businesses can close China's AI talent gap - McKinsey","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3Lm1ja2luc2V5LmNvbS9jYXBhYmlsaXRpZXMvcXVhbnR1bWJsYWNrL291ci1pbnNpZ2h0cy9ob3ctYnVzaW5lc3Nlcy1jYW4tY2xvc2UtY2hpbmFzLWFpLXRhbGVudC1nYXDSAQA?oc=5\" target=\"_blank\">How businesses can close China's AI talent gap<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">McKinsey<\/font>","source.href":"https:\/\/www.mckinsey.com","source.title":"McKinsey","query":"https:\/\/news.google.com\/rss\/search?q=\"Product life cycle management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"Attracting and retaining AI talent is challenging everywhere. China is no exception. In our 2022 global AI survey of senior business executives, 75 percent of respondents in China reported challenges in hiring data scientists. More than half also said they had difficulties finding talent to fill other critical AI-related roles, including data engineers, data architects, and machine learning engineers, all of whom are needed to design, build, and industrialize advanced digital and AI capabilities. About the research We conducted surveys and interviews with 102 leading companies in China that have adopted AI in at least one function. We also analyzed global and local reports, use cases, and hiring databases to understand the demand for AI talent in China, the challenges companies face in addressing talent gaps, and the actions they’ve taken to close these gaps. To estimate talent demand, we considered both the economic impact of AI in key sectors (consumer, finance, manufacturing, enterprise services, automotive, transportation and logistics, and healthcare and life sciences) and modeled productivity per employee in each sector. On the supply side, we considered the estimated number of STEM graduates from domestic universities and those from foreign universities who prefer to work in China, along with the existing number of top-tier tech talent. Our latest research suggests it’s about to get harder, even with recent market contractions. By 2030, demand in China for individuals skilled in building AI products will grow sixfold from current levels (from one million people to six million) as companies race to unlock the more than $1 trillion in potential value AI can deliver in China. (See sidebar, “About the research,” for details on our research methods.) However, local and overseas universities and existing top-tier talent are estimated to supply only about two million (or one-third) of the AI talent needed by 2030, resulting in a shortage of four million people for AI roles (Exhibit 1). Beyond 2030, our research suggests that the declining birth rate will further tighten the availability of AI talent, as fewer students will be entering university programs. 1 With this enormous talent gap looming, we set out to understand what companies could do to ensure they have the people and capabilities they need to compete. Our surveys and interviews with more than 100 top companies in China reveal two crucial insights: Not all talent gaps are the same. While all companies will need to upskill existing employees and look beyond traditional hiring practices to attain the talent and capabilities they need, the types of investments and interventions required will differ based on each company’s level of digital maturity. While Chinese graduates increasingly favor local companies and their innovative and performance-based incentive structures, foreign multinational companies operating in China will be able to draw from a much larger talent pool if they effectively leverage their global footprint. In this article, we share the types of talent companies should prioritize at each stage of digital maturity and how they can best access the skills and capabilities they need as AI talent becomes even scarcer. Talent and skills needs vary based on digital maturity The digital and AI initiatives driving the most significant value creation across China will require a wide range of advanced technical skills. These skills fall broadly into seven areas: customer experience, cloud, automation, platforms and products, data management, DevOps (a methodology for streamlining software development), and cybersecurity and privacy. While leaders will ultimately need to build out their talent benches in all areas, our research suggests that their priorities will vary based on which common digital-maturity archetype a company fits into: traditionalist, hybrid, or digitalist (Exhibit 2). Exhibit 2 Digital maturity will dictate talent priorities for companies in China. Archetype Definition Priority AI talent battleground Associated skills Traditionalist Companies that have just started their digital transformations and typically have small in-house teams Data management Data architecture, data engineering, data analysis, and analytics-translator skills Hybrid Sector incumbents that have invested heavily in digital transformation and have built strong in-house tech capabilities DevOps Agile product management, continuous integration\/continuous delivery (CI\/CD), and microservices Customer experience Predictive analytics, design thinking, and automated testing and prototyping Cloud Kubernetes, Docker, and multicloud architectures Digitalist Hyperscalers, digital natives, or AI\/tech start-ups with strong tech capabilities Cybersecurity and privacy Shift-left security (moving security testing earlier in product development), zero-trust security, and data protection laws and practices Automation Generative AI, robotic process technologies, machine learning, AI-enabled analytics, and quantum computing Unique workforce considerations for multinational corporations All workers Fluency in a second language other than Mandarin to leverage and share work across a global footprint Understanding of Western ways of working to communicate seamlessly with colleagues worldwide Leaders Strong partnership skills to align efforts with an organization’s global IT and AI standards while effectively executing the expectations of local business leaders Product owners Knowledge of what data and designs can be reused and scaled from different regions, and what must be rebuilt locally to address the uniqueness of the digital ecosystem in China Traditionalists Traditionalist companies are those at the start of their digital transformations. They typically have small in-house teams and face immense competitive pressures to get their digital and AI transformation launched. Much of their emphasis will be on building data foundations to optimize business processes and focusing on targeted use cases designed to deliver immediate business impact (as opposed to research and development of AI capabilities for future innovation). To do so, two types of talent, in particular, are priorities: The first type is data management experts with skills in data architecture, data engineering, data analysis, and analytics translation, who can build the data platforms, pipelines, and processes to democratize data access, enable real-time data-driven insights, ensure data quality and governance, and manage the life cycle of use cases. Leaders may hire these experts to serve on data product or use-case teams that bring new digital and AI capabilities to life. Some of these experts will also be needed within a data center of excellence to collectively design and oversee data management processes that ensure appropriate access controls, data quality, and approval and retention policies. One agricultural enterprise began by building a centralized enterprise data center that supports data management protocols and governance processes and is accessed by thousands of employees from different functions for AI and analytics use cases. The work has significantly reduced IT costs by eliminating the need for repeated development of new data pipelines and has enabled the company to modernize its business methods—for example, by leveraging robots to track breeding conditions for animals and to generate automatic alerts when potential diseases and other issues are detected. One agricultural enterprise began by building a centralized enterprise data center that supports data management protocols and governance processes and is accessed by thousands of employees from different functions for AI and analytics use cases. The work has significantly reduced IT costs by eliminating the need for repeated development of new data pipelines and has enabled the company to modernize its business methods—for example, by leveraging robots to track breeding conditions for animals and to generate automatic alerts when potential diseases and other issues are detected. The second type of priority talent is platform and product experts with software development skills who can customize software-as-a-service (SaaS) or other outsourced solutions to improve business efficiency and deliver new customer-facing services. One consumer electronics manufacturer, for instance, began investing in a team of data platform developers after seeing promising results from an initial AI use case, which optimized production schedules and labor productivity. The team will update the underlying models, user interface, data pipelines, and back-end infrastructure so they can continuously enhance and introduce current and additional AI use cases. Would you like to learn more about QuantumBlack, AI by McKinsey Hybrids Hybrids are those sector incumbents that have already invested mightily in digital transformations. They’ve built strong in-house tech capabilities and foundations and now have set their sights on streamlining development processes to deliver new digital and AI products faster and increase domain expertise to deliver excellent customer experiences. To do this, they’ll need DevOps experts skilled in software development practices such as agile product management, continuous integration\/continuous delivery (CI\/CD) practices, and microservices that can accelerate deployment. They’ll also compete for customer experience experts who are skilled in using a broad range of predictive analytics, design thinking, and automated testing and prototyping capabilities to launch new customer experiences. IT efficiency and server spend will also loom large for hybrids as they continue to scale their capabilities and host more AI models and applications in the cloud. Our 2022 cloud survey found that more than three-quarters of companies in China plan to use multiple cloud services, and 90 percent plan to use a mixture of public and private cloud services by 2025. Knowing what capabilities are needed and how to run them in each type of cloud will require cloud experts with experience in Kubernetes, Docker, and multicloud architectures. Digitalists Digitalists are the digital natives, such as hyperscalers and AI and tech start-ups. While they already have a strong talent bench in most areas of digital and AI, they will need to expand them further to keep up with evolving industry expectations and technology advances. One area of focus will be cybersecurity and data privacy. In China, there have been increased efforts to mitigate security and privacy concerns that can sideline AI and digital efforts, and digitalists will need experts with a holistic view and a systemic approach to address these issues. At the top of the list are individuals skilled in moving security testing earlier in product development (often called shift-left security), zero-trust security frameworks, and data protection laws and practices. Another priority will be automation experts with advanced skills in generative AI, robotic process technologies, machine learning, AI-enabled analytics, and quantum computing, who can automate development, testing, and deployment processes end to end to increase the efficiency and speed at which they can bring new capabilities to market. Multinational corporations in all archetypes Across all levels of digital maturity, multinational corporations operating in China must also ensure their AI talent has the skills to leverage and share work across their global footprint. For instance, teams will need fluency in a second language other than Mandarin and an understanding of Western ways of working to communicate seamlessly with colleagues worldwide. Leaders will need strong partnership skills to align efforts with their organization’s global IT and AI standards while effectively meeting the expectations of local business leaders. Product owners will require knowledge of what data and designs from different regions they can reuse and scale, and what they’ll need to rebuild locally to address the uniqueness of the digital ecosystem in China. Consider a worldwide transportation application, developed by a multinational’s European offices, that uses consumer traffic data from Google, Facebook, and Instagram to optimize routes. While most of the company's divisions worldwide could reuse the capability as is, product owners in China would need to guide their teams in modifying the application to pull data from Chinese platforms before they could deploy it. Addressing gaps by upskilling and diversifying talent sources Our interviews with companies about their practices to attract, develop, and retain talent suggest that traditionalists and hybrids both have much work to do across most stages of talent management (Exhibit 3). Unsurprisingly, digitalists need to shore up only a few areas to remain on top of their talent management game. 3 But as we delved further into companies’ strategies, it became clear that the best opportunities for all companies to advance their digital and AI agendas rest in two key areas: upskilling existing talent and diversifying talent sources. In both areas, our research suggests company archetype informs which levers executives should pull. Upskilling existing workers Upskilling is a common strategy for sourcing in-demand skills. Our research suggests that companies in China can obtain in-demand skills through targeted capability building in their existing business and AI talent benches (Exhibit 4). 4 Instead of broad-based efforts, however, our interviews with leaders suggest that upskilling is best targeted to linchpin skills that are hard to find and can’t be outsourced or easily acquired, such as an understanding of the legacy application landscape or existing product functionality (see Exhibit 5 for how to start). Exhibit 5 To kick off the skills development journey, business executives can consider a checklist of priorities. Key actions Potential approach Prioritize worker skills. Identify skills gaps and devote management time and budget to closing them Skills and competency mapping Competitive benchmarking Expand skills training. Provide training needed to cover all workers, preferably with tailored content Digital platform Cohort-based programs Ensure incentives to train are in place. Introduce training “opt out” system and link with performance evaluation system Corporate credit banks Revised evaluation metrics to reflect learning Adjust training content. Offer a mix of “forum, field, and feedback” to improve the effectiveness of learning Digital technologies (eg, gamification) Field trips and on-the-job training Track impact. Ensure that effective evaluation systems are in place to track effectiveness of training and value for money Pre- and post-training assessment Peer observations, self-reflection Develop partnerships. Explore partnerships with educators to offer competitive, up-to-date programs and content Corporate universities Public-private partnerships Integrate training into government affairs efforts. Ensure that training provision is integral to government relations Policy monitoring Public program application Source: McKinsey Global Institute analysis The next frontier for AI in China could add $600 billion to its economy Traditionalists One such area for traditionalists is crucial analytics translator skills, without which, our work suggests, it’s much harder to gain business buy-in and adoption of new digital and AI initiatives. Upskilling business experts within different domains to identify and evaluate potential digital and AI use cases, assess their potential business value, and guide deployment can position traditionalists to gain value more quickly from their digital and AI investments. This training is best delivered in-house through an analytics academy, an approach that allows organizations to customize content and incorporate active apprenticeships so that business experts can practice what they learn in the classroom. An advanced manufacturer at the start of its transformation journey, for instance, launched an academy to upskill more than 200 people across the company to become analytics translators. The curriculum included half-day weekly lectures over two to three months on problem solving, talent, and use case requirements; best practices in agile delivery and change management; and on-the-job training guiding use cases from the company’s road map. Since taking on their new roles, these translators have enabled more than 50 new digital and AI use cases. Hybrids Only 8 percent of today’s AI talent in China is equipped with advanced AI-related skills, such as edge computing, big data and machine learning, and cognitive AI. For hybrids, upskilling existing staff with such skills will be crucial to completing their transformation journeys. But they will need to increase their investment in online courses and certification programs. In our 2022 global AI survey, only about a third of respondents in China reported using such programs (31 percent for self-directed online courses and 29 percent for certification programs). One leading financial institution prioritized online learning by providing customized learning journeys based on employees’ roles and career paths. Each employee can access skill-building courses identified as critical to their role via a mobile learning app that offers a broad range of courses—everything from coding in Python to building multicloud architectures to developing the leadership skills necessary for digital transformations. Digitalists Digitalists will find their greatest challenge is staying up-to-date with fast-moving emerging technologies, such as generative AI and quantum computing. Encouraging employees to keep up with the latest breakthroughs—for example, by sending staff to academic conferences and giving them time to conduct research, pursue patents, and attend hackathons—can help close their emerging talent gaps. One technology company gives employees the time, space, and budget to research and develop new capabilities with emerging technologies outside of value-generating use cases. This freedom has resulted in myriad patents and patent applications across AI, blockchain and cloud computing, and new-product innovations. Diversifying talent sources Outsourcing work and acquiring essential technology capabilities (and talent to support it) can also provide companies in China with a path toward filling their talent gaps. Multinationals have a distinct advantage in this area given their global reach, which enables them to tap into existing solutions built by colleagues in other regions or new capabilities developed in other countries, such as Vietnam and India. While there are many financial and regulatory considerations in evaluating such paths, such as ensuring adherence to all Chinese data protection laws, our research suggests that some approaches are better than others for each archetype. Traditionalists Traditionalists must move quickly to catch up with AI and digital leaders and remain competitive. However, hiring and onboarding new talent to launch their digital transformations, especially in a tight labor market, can take a great deal of time. One way to get AI talent and capabilities quickly is by partnering with vertical IT and SaaS providers. Some leaders use these partnerships to get work under way while they search for new talent. The consumer electronics manufacturer discussed earlier, for instance, outsourced the development of new AI optimization models as it began to build out its talent strategy. By doing so, leaders were able to get new capabilities into production (and generating value) in fewer than eight weeks rather than the many months it can take to onboard new talent. Others may seek external providers to build their digital system’s entire foundation. For example, a Chinese industrial-vehicles provider engaged a leading software company to integrate more than half a dozen business and factory systems, including those for enterprise resource planning, manufacturing execution, product life-cycle management, vendor management, human resources, and business intelligence. Completed over three years, this work enabled the company to launch a broad set of use cases, including a collaborative product design system that increases R&D efficiency and helps bring new products to market. When outsourcing work, companies should ensure they have a holistic data and tech strategy aligned with strategic priorities that vendors can use to guide design decisions. In this way, organizations can engage multiple vendors to work on different tasks and projects with confidence that all solutions can seamlessly share data and insights. Hybrids Outsourcing can be extremely valuable for hybrids in improving the reach and productivity of their existing tech experts during the next phase of their digital transformations. Outsourcing can free tech staff from the substantial time and effort required to maintain and upgrade back- and middle-office legacy systems. Today, the rise of enterprise software solutions in China for human resources, finance, communications, and business process automation allows companies to quickly move these systems to the cloud and redeploy AI talent to high-value use cases. In other instances, companies may leverage third-party resources to assist teams in building some part of a new digital or AI solution. Digitalists Many digital natives have found frequent expansion and reorganization have led to high tech talent turnover rates and expensive recruitment costs, threatening their continued growth. As the talent gap grows, digitalists will be better served by strategic acquisitions that offer access to new markets or business areas than by building new capabilities in-house. Bytedance’s acquisition of Music.ly is an example. Through this acquisition and subsequent merging of the technology into TikTok, Bytedance gained access to new virtual-reality capabilities that it could use to expand TikTok and to a team of virtual-reality experts capable of using the technology to build out new capabilities. As demand for AI talent in China increasingly outpaces supply, leaders will need to get creative to ensure they have the people and capabilities to remain competitive in the coming decade. Those organizations that prioritize upskilling of existing talent and strategically leverage outsourcing and acquisitions will find they can close their talent gaps and build their competitive advantage in any market.","filter_flag":1}
{"title":"Viral Safety With ICH Q5A Revision 2 - BioProcess Insider","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMisAFodHRwczovL3d3dy5iaW9wcm9jZXNzaW50bC5jb20vdmlyYWwtY2xlYXJhbmNlL3ZpcmFsLXNhZmV0eS1mb3ItYmlvdGVjaG5vbG9neS1wcm9kdWN0cy1pbmNsdWRpbmctdmlyYWwtdmVjdG9ycy1pY2gtcTVhLXJldmlzaW9uLTItYnJpbmdzLXVwZGF0ZWQtYW5kLW1vcmUtY29tcHJlaGVuc2l2ZS1ndWlkYW5jZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMisAFodHRwczovL3d3dy5iaW9wcm9jZXNzaW50bC5jb20vdmlyYWwtY2xlYXJhbmNlL3ZpcmFsLXNhZmV0eS1mb3ItYmlvdGVjaG5vbG9neS1wcm9kdWN0cy1pbmNsdWRpbmctdmlyYWwtdmVjdG9ycy1pY2gtcTVhLXJldmlzaW9uLTItYnJpbmdzLXVwZGF0ZWQtYW5kLW1vcmUtY29tcHJlaGVuc2l2ZS1ndWlkYW5jZdIBAA?oc=5","id":"CBMisAFodHRwczovL3d3dy5iaW9wcm9jZXNzaW50bC5jb20vdmlyYWwtY2xlYXJhbmNlL3ZpcmFsLXNhZmV0eS1mb3ItYmlvdGVjaG5vbG9neS1wcm9kdWN0cy1pbmNsdWRpbmctdmlyYWwtdmVjdG9ycy1pY2gtcTVhLXJldmlzaW9uLTItYnJpbmdzLXVwZGF0ZWQtYW5kLW1vcmUtY29tcHJlaGVuc2l2ZS1ndWlkYW5jZdIBAA","guidislink":false,"published":"Wed, 17 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=137, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisAFodHRwczovL3d3dy5iaW9wcm9jZXNzaW50bC5jb20vdmlyYWwtY2xlYXJhbmNlL3ZpcmFsLXNhZmV0eS1mb3ItYmlvdGVjaG5vbG9neS1wcm9kdWN0cy1pbmNsdWRpbmctdmlyYWwtdmVjdG9ycy1pY2gtcTVhLXJldmlzaW9uLTItYnJpbmdzLXVwZGF0ZWQtYW5kLW1vcmUtY29tcHJlaGVuc2l2ZS1ndWlkYW5jZdIBAA?oc=5\" target=\"_blank\">Viral Safety With ICH Q5A Revision 2<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BioProcess Insider<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Viral Safety With ICH Q5A Revision 2 - BioProcess Insider","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMisAFodHRwczovL3d3dy5iaW9wcm9jZXNzaW50bC5jb20vdmlyYWwtY2xlYXJhbmNlL3ZpcmFsLXNhZmV0eS1mb3ItYmlvdGVjaG5vbG9neS1wcm9kdWN0cy1pbmNsdWRpbmctdmlyYWwtdmVjdG9ycy1pY2gtcTVhLXJldmlzaW9uLTItYnJpbmdzLXVwZGF0ZWQtYW5kLW1vcmUtY29tcHJlaGVuc2l2ZS1ndWlkYW5jZdIBAA?oc=5\" target=\"_blank\">Viral Safety With ICH Q5A Revision 2<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BioProcess Insider<\/font>","source.href":"https:\/\/www.bioprocessintl.com","source.title":"BioProcess Insider","query":"https:\/\/news.google.com\/rss\/search?q=\"Product life cycle management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"HTTPS:\/\/WWW.ALAMY.COM The International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use (ICH) provides guidance on the testing and evaluation of viral safety of biotechnological products derived from characterized cell lines of human or animal origin through its harmonized guideline ICH Q5A (1). The latest revision, released for consultation in October 2022, maintains the key principles of previous versions while introducing key changes in response to important advances in the field. Those advances are covered in new sections that reflect improvements to current scientific knowledge. They include new product types that are amenable to viral clearance, including viral-vector–derived products; considerations for continuous manufacturing; and the use of prior knowledge (PrK) for modular validation and resin-reuse studies. Also discussed are new molecular analytical methods, particularly next-generation sequencing (NGS). The aims of this update are to reduce the need for product-specific validation efforts and to provide flexibility for the testing of already well-characterized rodent cell substrates. ICH Q5A’s second revision (R2) completed the public consultation phase in February 2023. Although minor changes could be made to the final document in response to comments, the essence of this revision is likely to remain as currently proposed. Thus, it is well placed to support the implementation of advances in viral safety based on recent published scientific advances. Below, we review and summarize the updated topics and discuss their impact on viral-safety testing and evaluation. Viral Vectors and Related Products Since the release of ICH Q5A’s first revision (R1) in the late 1990s, new and advanced cell-based production platforms have been developed for manufacturing new product types. Products manufactured using such platforms include genetically engineered viral vectors and viral-vector–derived products, both dependent on and independent of helper viruses. For such products, viral clearance without negative product effects has become increasingly important (2). For some time, it has been the practice of regulatory authorities worldwide to require evidence of that at least at the time of commercial licensing. Products such as virus-like particles (VLPs) and protein subunits made using baculovirus, herpes-simplex virus, or adenovirus production systems — as well as nanoparticle-based vaccines and viral vectors such as adenoassociated virus (AAV) — now are considered in the new Annex 7 to ICH Q5A. Manufacturing platforms used for those products have the potential to introduce viral-contamination risks over and above the general viral-safety considerations for biopharmaceutical products. The expression systems used include a host of less-common cell substrates, including insect cell lines, for which general substrate characterization knowledge is not as extensive as it is for the standard eukaryotic cell workhorses — e.g., Chinese hamster ovary (CHO) cells — used in most biomanufacturing processes. For viral-vector and other products manufactured using viral-vector platforms, the potential for contamination with replication-competent viruses also needs to be considered. The revised ICH Q5A advocates a risk-based approach to ensuring viral safety of these products that should address the associated raw materials, options for viral testing at appropriate manufacturing steps, and removal\/inactivation of both adventitious and helper viruses during downstream processing. In addition to the standard approach of testing for adventitious viruses while characterizing master cell banks (MCBs), working cell banks (WCBs), and cells at the limit of in vitro age (LIVCA), product developers need to consider aspects such as the presence of residual helper viruses and replication-competent viruses. Similarly, the guideline recommends testing for adventitious\/endogenous viruses as well as helper and replication-competent viruses in virus seeds, unprocessed bulk (harvest) material, and drug substance (3). For products produced by insect cells, it also suggests testing for certain known intracellular contaminants such as insect rhabdovirus. One challenge that developers can face in this regard is testing viral seeds that could propagate through indicator cells. Details of the testing approach depend on the specific viral vector and viral-based production system used as well as on test results for the cellular substrate that can indicate residual retroviral activity, for example. If viral-clearance studies can be conducted, then they need to demonstrate the capacity of a manufacturing process to remove and\/or inactivate potential viral contaminations at relevant manufacturing steps. For viral vectors and related products, the revised guideline highlights specific considerations for determining whether and how such studies should be conducted. Initially, the physicochemical characteristics of viral vectors and viral-vector–derived products determine whether an approach is feasible and how virus clearance can be applied within the purification operation. When studies are conducted, virus-clearance validation normally must include model viruses that represent the most likely adventitious, endogenous, and (if possible\/necessary), relevant helper viruses that can be expected for a given product. To be representative, model viruses need to be given careful consideration and the choices scientifically justified to regulators. Developers also need to consider the suitability of viral-inactivation and filtration steps for the types of viral vectors used. Standard technologies include detergents and\/or solvents for nonenveloped viral vectors and large, virus-specific, retentive filters for small vectors such as AAVs. It is important to remember that helper viruses are process-related impurities, so their adequate clearance must be demonstrated. Experience shows that although high virus log-reduction factors can be achieved regularly for such products, those factors are not comparable to the clearance observed with recombinant proteins. Therefore, viral clearance only contributes to product safety. It must be underpinned by a full-spectrum control strategy for adventitious agents including, for example, closed processing, material controls, and in-process and product testing. Continuous Manufacturing For many traditional biotechnology products, the shift from conventional batch processes toward continuous manufacturing (CM) is gaining momentum. CM is used to produce and\/or process products without interruption between batches so that raw materials, process intermediates, and starting materials are fed continuously into a manufacturing process while products are discharged continuously — or in a series of pulses — throughout an operation period (4). In this type of biomanufacturing, multiple process steps are controlled automatically, thereby simplifying an overall operation and reducing process-associated risks. The advantages of CM include increased efficiency and productivity with associated economic benefits. The revised guideline recognizes that technical aspects of viral-safety control for CM necessarily will differ to some extent from those for batch processing. Monitoring, detection, and removal of viruses are affected by system dynamics, the monitoring frequency, and both system start-ups and shutdowns. Advanced process controls, process models and their validation, and continuous process verification also can influence viral-control strategy in CM operations. Therefore, the viral-safety controls for a CM process need to be designed with all those aspects in mind. Fluctuations of different parameters in a CM system, including protein-product concentration, can affect both the validity of in-process testing and the design of viral-clearance studies. ICH Q5A(R2) discusses key considerations in this respect. They include the extent to which a process is run continuously and whether only some production steps are directly connected. Such concerns feed into assessments of the risk that upstream failures could put downstream operations in jeopardy — a risk that also is influenced by the types of connections between unit operations. The guideline acknowledges that it is feasible to use PrK based on batch processes for evaluating unit operations, especially when a process is a series of “minibatch” pulses rather than one continuous stream. In some situations, continuous processes can be treated as a series of batch-mode processes, validation for which is based on small-scale batch models covering potential extremes in parameters such as transient protein concentration and column backpressure. Appropriate process monitoring and sampling strategies are needed to detect inadvertent disturbances and adventitious virus contamination, taking into account the potential effects of fluctuations in raw-material attributes, flow rate, operational loading capacity, and multicolumn cycling. The guideline also discusses other viral-safety aspects of CM, such as appropriate sampling points and risks associated with long-term cell culture. The latter can include potential fluctuations in the levels of endogenous retroviruses and other viral contaminations. Virus-clearance studies for processes such as chromatography, low-pH treatment, solvent\/detergent inactivation, and virus filtration also require an adapted approach. Note that ICH Q5A(R2) acknowledges a number of settings and circumstances under which viral-clearance testing for a continuous process can use scaled-down batch models. For example, clearance studies using batch-based small-scale models can be an option for chromatography unit operations and are discussed in the guideline. For repeat-use systems (e.g., multicolumn processing of successive subbatches), sponsors may use a well-justified scale-down model based on a batch process. Simultaneous validation of two or more connected unit operations also is possible when an entire unit operation is intended for viral clearance. Study design is affected by equipment considerations and unit integration. For low-pH and solvent\/detergent inactivation processes, CM validation using batch operations also could be justified if control of relevant dynamic process parameters is ensured: pH, concentration of solvent\/detergent, homogeneity and mixing conditions, temperature, and time. For virus-filtration steps, CM validation using batch processes can be appropriate when settings or ranges are established for relevant parameters (e.g., transmembrane pressure) that can affect viral clearance — and where those ranges are well justified. Additionally, process controls must be defined such that filter changes and postuse integrity tests can be performed without interruption of CM, and process designs should include optional diversion of material to a backup filter in case of primary filter failure or blockage. New Molecular Test Methods Global regulatory bodies now encourage biopharmaceutical developers to use new test methods based on NGS and polymerase chain reaction (PCR), for example, to align with the initiative of reducing animal use in drug testing — the 3R principle of replacement, reduction, and refinement (5). The revised ICH Q5A provides more details on considerations for alternative analytical methods. Nucleic-acid–amplification techniques (NATs) such as PCR-based analytical methods are used singly or in a multiplex format to detect specific virus sequences or measure model virus levels in clearance studies. Such molecular methods are effective tools for detection of specific viruses and can be used to supplement cell-based assays that are limited by interference. NATs also can be adapted for detection of a broad range of viruses, although specificity of results in such cases might be reduced. Whichever approach is taken, NAT-based methods need to be qualified or validated appropriately for their intended use. Advanced molecular methods such as NGS can detect a broad range of different viruses. Because of the sensitivity and breadth of virus detection capability with such methodologies, the guideline recommends their use to reduce both testing time and the use of laboratory animals. Developers are encouraged to provide a complete validation package to support their use of NGS, including method validation and assay or matrix-specific qualification. In addition, suitable standards and reference materials should be used for assay qualification and validation, including available reference-virus reagents with distinct physical, chemical, and genomic characteristics. When applying NGS, critical steps include sampling and sample processing, efficient nucleic acid extraction and library preparation, sequencing platform selection, and comprehensive bioinformatics analysis. Overall, the guideline encourages developers to use NGS as a replacement for • in vivo tests with broad virus-detection capabilities for known and unknown or unexpected virus species • hamster-antibody production (HAP), mouse-antibody production (MAP), and rat-antibody production (RAP) tests. NGS is considered to be useful particularly for characterization and testing of cell substrates and cell banks, viral seeds, and harvests. Because NGS has a complex workflow, however, the guideline encourages manufacturers to discuss method validation and data submission with regulatory authorities. ICH Q5A(R2) signals a clear commitment of international regulators to accept NGS as a key method for virus detection that should be used as the biopharmaceutical industry progresses. Prior Knowledge: Including “In-House” Experience The term prior knowledge has been used in several ICH guidelines without a formal statement of its meaning (6–10). The draft revision of Q5A(R2) contains a welcome definition. Furthermore, this draft guidance provides several examples of how PrK can be applied to evaluation of steps involved in viral clearance and reduction, which thereby potentially allows for alternative viral-clearance validation strategies. For example, a footnote to Table A-1 of the guideline suggests that PrK based on scientific principles can be applied to validating the performance of small virus-retentive filters — e.g., by using parvovirus instead of larger viruses as a worst-case model, an approach that makes sense scientifically. Parvoviruses facilitate handling and filter throughput, making such an approach more practical logistically. A new Annex 6 to the revised guideline provides useful details for developers applying PrK from their own product development and experience to similar products or platforms (internal\/in-house PrK) for reducing the amount of product-specific data needed. If PrK is leveraged in lieu of product-specific experiments, it should be accompanied by a holistic viral risk assessment for a given medicinal product. Factors to consider that can inﬂuence the potential quantity of infectious particles in the product include information gained from the cell-substrate and raw-material characterization and the overall viral-clearance strategy. Adding PrK-related content to the guideline has been a welcome step toward flexibility regarding the provision of data from such supportive studies that could provide time savings for the industry. Prior Knowledge for Clearance Evaluation and Validation Viral clearance generally is evaluated in experiments based on spiking different viruses into product-specific in-process material from each downstream processing step. When a biomanufacturer is using a process that has been established and well characterized for a similar product (using the same platform technology), then clearance data generated for previous products could be applicable to a new product. This is called in-house knowledge in the European Union; in the United States, it is called modular clearance. The applicability (“representativeness”) of such PrK for a specific process step should be justified clearly. Whether based on external or in-house experience, PrK should include • a good understanding of the mechanism underlying virus clearance • all process parameters affecting viral clearance • the influence of interactions between viruses and biological products • potential interference based on composition of some process intermediate(s) with viral clearance. External PrK based on published data can be useful in understanding and predicting the clearance potential of a given manufacturing step. For example, it can help developers define critical process parameters (CPPs) and predict worst-case limits for testing. The mechanism underlying virus clearance is well understood for many unit operations based on years of scientific evaluation described in published literature, and in many cases it does not differ among products. However, ICH Q5A(R2) suggests limiting the role of externally published reduction factors for specific products to support in-house knowledge and process-specific validation efforts. Application of external published reduction factors requires • accompanying evidence that demonstrates sufficient comparability of the external and in-house processes for manufacturing their respective products • comparability of process intermediates • assurance that product-specific attributes do not affect virus reduction. Changes to a biomanufacturing process during product life-cycle management can affect virus-clearance efficacy and could be evaluated using internal PrK and a platform concept. If PrK from other products cannot be extrapolated to a specific product, and\/or if the platform concept no longer can be applied, then product-specific viral-clearance studies must be performed. Annex 6 to the ICH Q5A(R2) guideline provides case studies of specific unit operations in which PrK (including in-house experience from other products) could be used to claim a reduction factor for a new product made using the same manufacturing platform. In general, the referenced unit operations are robust and well understood in the industry. A virus-clearance claim for a new product based on PrK (including in-house experience) should include discussion of all data available and the rationale to support the platform validation approach. Sponsors could provide part of the PrK used to reduce product-specific validation requirements in the form of a comparison of the new product and its manufacturing process with other in-house products, related process conditions, and product intermediates. Thus, process steps dedicated to virus clearance (e.g., inactivation by solvents\/detergents, low-pH treatment, and removal by viral filtration) are suitable to a platform validation approach. The revised guidance provides examples for applications of PrK — such as for xenotropic murine leukemia virus (X-MuLV) inactivation\/removal by detergent or low pH or for parvovirus removal by virus filtration — and describes process parameters of the different inactivation\/removal steps and their criticality in relation to potential step performance. Chromatography Media Earlier versions of ICH Q5A focused on the concern that over time, and after repeated use, viral-clearance capability can diminish for chromatography columns and other components used in purification processes. Chromatography media\/resin lifetime use should be established, and CPPs that affect viral clearance should be defined. Since the initial release of ICH Q5A in 1998, multiple published scientific studies and industry databases have contributed to PrK (11–13). Thus, R2 provides some flexibility on these requirements for well-known chromatography media such as protein A affinity and anion-exchange resins. For protein A affinity chromatography, PrK indicates that virus removal is not affected — or even can increase slightly — in used (e.g., end-of-life) media. Therefore, product-specific studies are not expected for used resins. That has been acknowledged by regulatory authorities (14), but now it is stated explicitly in ICH Q5A(R2). Resin life has been studied less for other chromatography types, such as anion exchange. Accordingly, repeated resin use for those chromatography types requires equivalent in-house experience and a detailed justification to replace product-specific viral-clearance studies of end-of-lifetime media. Flexibility on Testing of Well-Characterized Cell Substrates PrK also can be applied to provide some flexibility in requirements for well-characterized cell lines. For instance, in a case study for calculating per-dose virus-safety factors, Annex 5 states that a safety margin of <10–4 particles\/dose for retroviral-like particles from CHO cells is acceptable for recombinant proteins if in vitro testing fails to identify the presence of infectious retroviruses. That supplants a previous case study from the 1999 version of this guideline, in which the target safety margin was implied to be <10–6 particles\/dose. Although that was intended only as a case study, many industry and regulatory experts had interpreted the <10–6 particles\/dose to be a regulatory rule. In addition, the requirements for in vivo adventitious-agent testing for well-characterized lines such as CHO cells, NS0 murine myeloma cells, and SP2\/0 murine lymphocytes have been reduced significantly based on cell-line history, PrK, and on other risk-based considerations. PrK now can include prior in vivo virus testing or NGS testing of the untransfected parental cell line alongside demonstrated control of the derivation of the MCB from those parental cells. PrK regarding virus-safety testing of other MCBs derived from the same parental cell bank (according to the same protocol) also should be considered. In vivo testing also is generally unnecessary for the first WCB or subsequent WCBs from that MCB if they are prepared under approved, controlled conditions. Similarly, for cells at the LIVCA, such testing may be unnecessary according to PrK and other risk-based considerations. If a residual risk is determined, then retention of the test or replacement with a molecular method for broad virus detection (e.g., NGS or PCR) could be applied to detect viruses that might be introduced during establishment of the MCB or during cell culturing at the LIVCA stage. A Solid Update The released draft of ICH Q5A(R2) provides comprehensive and up-to-date guidance on viral-safety evaluations for biotechnological products derived from cell lines of human and animal origin. It has been kept sufficiently flexible to accommodate novel approaches and includes several examples and statements that clarify considerations in the light of new products, production types, emerging science, and PrK. The guideline continues to emphasize the value of a multipronged approach to viral safety, including comprehensive characterization and screening of cell substrates as well as raw and starting materials to identify potential viral contaminants. It also encourages establishment of appropriate testing programs for adventitious, endogenous, and helper viruses in unprocessed bulk drug substance. This guideline stresses the need for careful design of viral-clearance studies, details of which depend on the type of biotechnological product that is manufactured, using different methods of virus inactivation and removal to achieve maximum viral clearance. The details of how to design those studies and achieve these goals have been updated based on extensive experience among companies and regulators over the 25 years since the first Q5A revision. Altogether, we find ICH Q5A(R2) to be a successful revision that incorporates many important new developments brought about by scientific progress in the field of viral safety since the release of the Q5A(R1). We believe that, when it is finalized, the changes will have made this important guideline fully able to address the viral-safety concerns of the 21st-century biopharmaceutical industry. References 1 ICH Q5A (R2). Viral Safety Evaluation of Biotechnology Products Derived from Cell Lines of Human or Animal Origin. International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use: Geneva, Switzerland, 29 September 2022; https:\/\/database.ich.org\/sites\/default\/files\/ICH_Q5A%28R2%29_Step2_draft_Guideline_2022_0826.pdf. 2 Barone PW, et al. Viral Contamination in Biologic Manufacture and Implications for Emerging Therapies. Nature Biotechnol. 38, 2020: 563–572; https:\/\/doi.org\/10.1038\/s41587-020-0507-2. 3 Ma H, et al. Identification of a Novel Rhabdovirus in Spodoptera frugiperda Cell Lines. J. Virol. 88(12) 2014: 6576–6585; https:\/\/doi.org\/10.1128\/JVI.00780-14. 4 ICH Q13. Continuous Manufacturing of Drug Substances and Drug Products. International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use: Geneva, Switzerland, 16 November 2022; https:\/\/database.ich.org\/sites\/default\/files\/ICH_Q13_Step2_DraftGuideline_%202021_0727.pdf. 5 EMA\/CHMP\/CVMP\/JEG-3Rs\/450091\/2012. Guideline on the Principles of Regulatory Acceptance of 3Rs (Replacement, Reduction, Refinement) Testing Approaches. European Medicines Agency: Amsterdam, The Netherlands, 2012; https:\/\/www.ema.europa.eu\/en\/documents\/scientific-guideline\/guideline-principles-regulatory-acceptance-3rs-replacement-reduction-refinement-testing-approaches_en.pdf). 6 ICH Q2(R2). Validation of Analytical Procedures. International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use: Geneva, Switzerland, 1 November 2005; https:\/\/database.ich.org\/sites\/default\/files\/ICH_Q2-R2_Document_Step2_Guideline_2022_0324.pdf. 7 ICH Q8(R2). Pharmaceutical Development. International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use: Geneva, Switzerland, 1 August 2009; https:\/\/database.ich.org\/sites\/default\/files\/Q8%28R2%29%20Guideline.pdf. 8 ICH Q10. Pharmaceutical Quality System. International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use: Geneva, Switzerland, 4 June 2008; https:\/\/database.ich.org\/sites\/default\/files\/Q10%20Guideline.pdf. 9 ICH Q12. Technical and Regulatory Considerations for Pharmaceutical Product Lifecycle Management. International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use: Geneva, Switzerland, 20 November 2019; https:\/\/database.ich.org\/sites\/default\/files\/Q12_Guideline_Step4_2019_1119.pdf. 10 ICH Q14. Analytical Procedure Development. International Council for Harmonisation of Technical Requirements for Pharmaceuticals for Human Use: Geneva, Switzerland, 24 March 2022: https:\/\/database.ich.org\/sites\/default\/files\/ICH_Q14_Document_Step2_Guideline_2022_0324.pdf). 11 Mattila J, et al. Retrospective Evaluation of Cycled Resin in Viral Clearance Studies — A Multiple Company Collaboration. PDA J. Pharm. Sci. Technol. 73(5) 2019: 470–486; https:\/\/pubmed.ncbi.nlm.nih.gov\/31101706. 12 Ajayi OO, et al. An Updated Analysis of Viral Clearance Unit Operations for Biotechnology Manufacturing. Curr. Res. Biotechnol. 4, 2022: 190–202; https:\/\/doi.org\/10.1016\/j.crbiot.2022.03.002. 13 Brorson K, et al. Identification of Protein A Media Performance Attributes That Can Be Monitored As Surrogates for Retrovirus Clearance During Extended Re-Use. J. Chromatogr. A 989(1) 2003: 155–163; https:\/\/pubmed.ncbi.nlm.nih.gov\/12641291. 14 EMA\/CHMP\/BWP\/187162\/2018. Meeting Report: Joint BWP\/QWP Workshop with Stakeholders in Relation to Prior Knowledge and Its Use in Regulatory Applications. European Medicines Agency: Amsterdam, The Netherlands, 2018; https:\/\/www.ema.europa.eu\/en\/documents\/report\/meeting-report-joint-biologics-working-party\/quality-working-party-workshop-stakeholders-relation-prior-knowledge-its-use-regulatory-applications_en.pdf. Corresponding author David Perez-Caballero and David Murray are principal consultants and CMC biologics experts; and Christiane Niederlaender and Kurt Brorson are technical vice presidents at Parexel International; 34-649-127-438; [email protected].","filter_flag":1}
{"title":"IDM Approach Continues to Strengthen ST's Semiconductor Leadership - EE Times India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmVldGluZGlhLmNvLmluL2lkbS1hcHByb2FjaC1jb250aW51ZXMtdG8tc3RyZW5ndGhlbi1zdHMtc2VtaWNvbmR1Y3Rvci1sZWFkZXJzaGlwL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmVldGluZGlhLmNvLmluL2lkbS1hcHByb2FjaC1jb250aW51ZXMtdG8tc3RyZW5ndGhlbi1zdHMtc2VtaWNvbmR1Y3Rvci1sZWFkZXJzaGlwL9IBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3LmVldGluZGlhLmNvLmluL2lkbS1hcHByb2FjaC1jb250aW51ZXMtdG8tc3RyZW5ndGhlbi1zdHMtc2VtaWNvbmR1Y3Rvci1sZWFkZXJzaGlwL9IBAA","guidislink":false,"published":"Mon, 15 May 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=5, tm_mday=15, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=135, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmVldGluZGlhLmNvLmluL2lkbS1hcHByb2FjaC1jb250aW51ZXMtdG8tc3RyZW5ndGhlbi1zdHMtc2VtaWNvbmR1Y3Rvci1sZWFkZXJzaGlwL9IBAA?oc=5\" target=\"_blank\">IDM Approach Continues to Strengthen ST's Semiconductor Leadership<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EE Times India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IDM Approach Continues to Strengthen ST's Semiconductor Leadership - EE Times India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3LmVldGluZGlhLmNvLmluL2lkbS1hcHByb2FjaC1jb250aW51ZXMtdG8tc3RyZW5ndGhlbi1zdHMtc2VtaWNvbmR1Y3Rvci1sZWFkZXJzaGlwL9IBAA?oc=5\" target=\"_blank\">IDM Approach Continues to Strengthen ST's Semiconductor Leadership<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">EE Times India<\/font>","source.href":"https:\/\/www.eetindia.co.in","source.title":"EE Times India","query":"https:\/\/news.google.com\/rss\/search?q=\"Product life cycle management\" \"new products\"+after:2023-05-01+before:2023-05-31","text":"IDM Approach Continues to Strengthen ST’s Semiconductor Leadership Article By : Stephen Las Marias ST's Catania facility expansion is a key step in advancing the company's vertical integration strategy for its SiC business. As electronics manufacturers worldwide step up their efforts to promote sustainability through power-efficient solutions and technologies, the onus is on semiconductor providers to develop devices that will help support this trend. In line with this, more and more chip makers are focusing on wide-bandgap (WBG) semiconductors, especially gallium nitride (GaN) and silicon carbide (SiC), as traditional silicon devices are reaching their theoretical limits in performance. WBG devices are increasingly designed in applications including power modules and power inverters, motor drives, and chargers and adapters, among others. The power GaN market is forecast to be worth $2 billion in 2027, according to Yole Developpement. Consumer applications including power supplies and Class D audio amplifiers are expected to account for 48% of the total GaN industry by the end of the forecast period. In particular, the consumer power supply market for GaN is forecast to be worth over $915.6 million by 2027, growing at a compound annual growth rate (CAGR) of 52% between 2021 and 2027. For the datacom\/telecom industry, Yole projects the power GaN market growth to be at 69% CAGR during the forecast period, while the GaN automotive market is expected to register a CAGR of 99%. On the other hand, the SiC device market is forecast to reach $6.3 billion in 2027, up from around $1 billion in 2021, mainly driven by electric vehicles (EVs) and their charging infrastructures—especially with the arrival of 800V EV models, which are expected to support fast DC charging—and photovoltaics, according to Yole. Amid these rosy forecasts, STMicroelectronics, a leading integrated device manufacturer (IDM), is investing heavily in boosting its production capacities and strengthening its manufacturing capabilities for SiC and GaN. “We will integrate SiC substrate manufacturing into our overall strategy,” says Henry Cao, Executive Vice President of Sales & Marketing, China Region, at STMicroelectronics. “SiC is in huge demand today, and it is very difficult for the semiconductor industry to provide enough supply of SiC. Global SiC substrate wafer sourcing is dominated by a small number of companies. ST sources mainly from one American company and one Japanese company, in 150mm. With internal capacity—we are building a €730 million investment in Catania—we will both increase the balance of our supply and continue to drive our costs down.” ST is accelerating the expansion of its SiC device manufacturing capacity. “In volume production with SiC devices since 2017, we have grown a lot, with more than 100 million devices shifted to automotive customer already,” says Cao. “For capacity, we have expanded it by more than 2.5x by 2022 from 2020. Currently, we are leveraging Catania and Singapore as the main sites for SiC capacity. For SiC assembly and testing, we are leveraging Shenzhen in China and Bouskoura in Morocco.” ST’s SiC substrate manufacturing facility in Catania is expected to commence production this year. “It will be able to deliver monocrystalline SIC ingot, the epitaxy, and wafer processing,” says Cao. “It will be a first of its kind in Europe for the volume production of 150mm (6in) SiC epitaxial substrate. Moving forward, ST is committed to developing 8in wafers.” Cao says the Catania facility will enable a balanced supply of SiC substrate between ST’s internal and external supply. “Soon, after qualification, we will also introduce the SmartSiC technology,” he explains. “Today, the substrate is obtained by slicing the monocrystalline SiC ingot. The drawback of this approach is that the ingot of SiC crystal is quite thin and you can only obtain a limited number of wafers. The cost is quite high. With the SmartSiC process, you remove a layer of SiC and you use a polycrystalline SiC substrate, which is much easier to produce. This is used to dope the polycrystalline with the layer of monocrystalline on the monocrystalline, which has lower resistivity and enables a better performance and lower cost. It should also bring performance improvement.” The Catania facility is an important site for ST’s power innovations. “ST’s leadership in SiC is a natural result of 25 years of focus and commitment in R&D with a large portfolio of key patents,” says Cao. “And Catania is the place with the largest SiC R&D and manufacturing operations in ST. Catania has also an established ecosystem on power electronics, with long term, successful collaboration between ST and different stakeholders locally, including Catania University, the Italian National Research Council (CNR), equipment and product manufacturing companies, and our suppliers. The investment will strengthen Catania’s role as a global competence center for SiC and for further growth opportunities.” Moreover, the project is a key step in advancing ST’s vertical integration strategy for its SiC business. “This will support the increasing demand from ST’s customers for SiC devices across automotive and industrial applications as they transition to electrification and seek higher efficiency,” says Cao. ST’s SiC substrate plant in Norrköping, Sweden, focuses on 150mm volume production. The new SiC integrated plant in Catania will help achieve the company’s target of more than 40% substrate in-sourcing by 2024. In addition to SiC investments, ST is also building GaN capacities and capabilities. “We have power conversion GaN and RF-power GaN,” says Cao. “We have 8in power GaN fab in Tours; we have epitaxial capability and pilot line in place, and we already have fab qualification in 2022. Beyond this 8in power GaN, we have 6in RF GaN in Catania, and fab qualification was already available last year. So, we are also focusing a lot on GaN technology because it’s a huge complementary technology to SiC to cover the customer demand for power devices.” Outsourcing partners critical to meet growing demand While ST is strengthening its manufacturing capabilities and building internal capacities, customer demand continues to outpace supply. Which is why the company continues to work with some outsourcing partners for strategic manufacturing. “For front end, we are leveraging 80% of ST internal source for fab capacity and working with partners for 20% of external source. For back end, ST provides 65% of the internal capacity, while our sourcing partners OSAT can provide 35% of the capacity,” says Cao. “With this strategy and working model, we can be very flexible to react to growing customer demand, to manage our internal capacity expansion plan, and to run all the processes smoothly to ensure the highest level of service to our customers.” According to Cao, collaborating with leading foundries and OSATs enable access to selected advanced technologies to complement ST’s portfolio. For front-end, the company partners with TSMC for its FinFET technology, and with Samsung Foundries and GlobalFoundries for the FD-SOI ecosystem. For back end, ST partners with ASE and Amkor for advanced BGA package and WLCSP. Digitalization in ST’s factory floor ST is likewise investing heavily in digital transformation and Industry 4.0 to enhance its manufacturing processes and related activities. For one, the company is leveraging digital technologies to reengineer its supply chain into a demand-driven adaptive system to be resilient amid global disruptions. “Today, our world is full of challenges, such as market fluctuations, disruptions, supply chain duplication, environment challenges, trade war,” says Cao. “We need to leverage more digital technologies to reduce waste, to make sure our supply chain is very robust and resilient to whatever change we can see from the market. We also leverage digital transformation to do product life cycle management. We connect and digitalize products related to information and processes for a more efficient and effective innovation engine.” According to Cao, ST’s fabs are highly automated. The company utilizes automated material handling systems for materials transport. “For production, 100% of our production tools are managed automatically. For the automated processes, 95% of the dispatching decisions are done without human intervention.” With this level of automation, ST’s fabs can run 24 hours, 365 days a year. “This is the reason why we can run our manufacturing factories with such a high efficiency,” says Cao. ST is also digitalizing its semiconductor factory floor by leverages its manufacturing data and analytics capabilities to help improve manufacturing quality, yield, equipment productivity, and manufacturing costs. “We have tons of data generated every day, and we analyze those data to optimize our shop floor and equipment, to automatically classify all the defects. We optimize the process control, we design for manufacturability, and we also accelerate the ramp up of new products,” says Cao. “All these capabilities are built on digital technologies. We need to have a very strong capability to analyze those data, to fully leverage those data and those analytical results to improve our efficiency.” Moreover, the company uses Industry 4.0 technologies, such as mixed reality (AR\/VR) for remote maintenance, and autonomous intelligent vehicles to enhance automation at its factory. Finally, the company leverages digital twin technologies, especially for its 12in fabs in both Crolles and Agrate. Utilizing digital twin technologies, ST can enable a much faster ramp-up of its new 12in fab in Agrate based on Crolles, which is built much earlier. “Moving forward, we can leverage this to even speed up the ramp up of many other 12in fabs because they have similar technologies, so there are a lot of synergies and experiences that can be replicated,” says Cao. Stephen Las Marias is the editor of EETimes Asia. He can be reached at stephen.lasmarias@aspencore.com. Share this: Twitter Facebook LinkedIn More Print Reddit Tumblr Pinterest Pocket Telegram WhatsApp ","filter_flag":1}
