{"title":"The Current: Summer 2023 | US EPA - U.S. EPA.gov","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmVwYS5nb3Yvd2F0ZXJzZW5zZS9jdXJyZW50LXN1bW1lci0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmVwYS5nb3Yvd2F0ZXJzZW5zZS9jdXJyZW50LXN1bW1lci0yMDIz0gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3LmVwYS5nb3Yvd2F0ZXJzZW5zZS9jdXJyZW50LXN1bW1lci0yMDIz0gEA","guidislink":false,"published":"Tue, 17 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=290, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmVwYS5nb3Yvd2F0ZXJzZW5zZS9jdXJyZW50LXN1bW1lci0yMDIz0gEA?oc=5\" target=\"_blank\">The Current: Summer 2023 | US EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. EPA.gov<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Current: Summer 2023 | US EPA - U.S. EPA.gov","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3LmVwYS5nb3Yvd2F0ZXJzZW5zZS9jdXJyZW50LXN1bW1lci0yMDIz0gEA?oc=5\" target=\"_blank\">The Current: Summer 2023 | US EPA<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. EPA.gov<\/font>","source.href":"https:\/\/www.epa.gov","source.title":"U.S. EPA.gov","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Summer 2023 - Issue LVI The WaterSense Current is a quarterly update dedicated to news and events related to WaterSense. Sign up to receive The WaterSense Current and get WaterSense news delivered right to your Inbox. In This Issue: Consumers and Businesses Look to WaterSense for Savings Since the WaterSense program was launched in 2006, consumers and businesses have saved a total of more than 7.5 trillion gallons of water by purchasing water-saving plumbing fixtures and irrigation products—with 1.1 trillion gallons saved in 2022 alone. That’s the water used in 9½ months by all U.S. households! WaterSense partners with more than 2,100 utilities, communities, manufacturers, home builders, retailers, and other organizations to produce and promote toilets, faucets, showerheads, spray sprinkler bodies, irrigation controllers and homes that are independently certified to use less water and perform well. Americans can look to the WaterSense label to save water, energy, and money. Since 2006, WaterSense labeled faucets, faucet accessories, and showerheads have helped American homes save 880 billion kilowatt hours of electricity—enough energy to supply a year’s worth of power to nearly 83 million homes—and eliminated 337 million metric tons of greenhouse gas emissions, which is the equivalent of planting 5.6 billion trees. The energy and water savings associated with WaterSense labeled products has also saved consumers $171 billion in water and energy bills over the past 16 years. Learn more about WaterSense labeled products and program accomplishments by reading the 2022 Accomplishments Report. Beat the Heat With Water-Saving Events School may be out, but there are still plenty of opportunities to have fun and learn this summer. If you’re looking for something fun for you and your family to do while learning ways to save water, check your local water utility or water district's website to see what they have planned. Many utilities participate in water festivals, have tables at county fairs, and conduct workshops to show you how to save water during times of drought or summer’s heat. WaterSense partners have a variety of events where they show consumers how and why to save water. Athens-Clarke County (Georgia) Public Utilities Department cohosts monthly gardening programs called Green Thumb Lectures to discuss a variety of topics on the importance of water conservation and efficiency. The City of Plano (Texas), holds an annual WaterWise Landscape Tour where residents can visit a selection of beautiful, sustainable landscapes in Plano showcasing plants and practices great for garden enthusiasts in North Texas. Also in Texas, the San Antonio Water System’s Garden Style San Antonio program has a range of events to help residents learn how to have beautiful and water-smart gardens. In California, the Sonoma-Marin Saving Water Partnership has organized “Drought Drop-By” events in the past to distribute free water-saving kits. The Partnership also participates in its local WaterSmart Expo, holds Saving Water Summer Pop-Ups, and is hosting a rainwater harvesting tour. At all events, they raise awareness about drought and discuss ways to save water at home—and give away water-saving tools. Look out for what is happening in your area and start saving water this summer. Spray Sprinkler Nozzles Are Not to Be Mist WaterSense already has a suite of labeled products to help you water your landscape efficiently, including two types of controllers and sprinkler bodies. Coming soon to round out this list are spray sprinkler nozzles. A spray nozzle is a component of a sprinkler system that combines with a sprinkler body to distribute water on a landscape. Some types of nozzles can reduce the amount of water used for irrigation by distributing water more slowly, evenly, and with larger droplets— reducing runoff and misting. Some utilities offer incentives for purchasing spray sprinkler nozzles now, and in the future, they may direct homeowners to look for the WaterSense label to identify nozzles that use less water compared to standard models. Currently, irrigation products eligible for the WaterSense label include weather-based irrigation controllers, soil moisture-based irrigation controllers, and spray sprinkler bodies—all helping to make your irrigation system water efficiently. Looking to upgrade your system? Use the WaterSense Product Search Tool to find just what you need to water smart all summer long. Don’t forget to use the Rebate Finder to see if your new products are eligible for any incentives in your area. Celebrating Smart Irrigation Month Is a No-Brainer July is Smart Irrigation Month and the perfect opportunity to make it rain with water savings. Start by taking some time to spruce up your sprinkler system. Walk through your landscape to inspect pipes and valves for leaks and look for missing or broken sprinkler heads. Double check that sprinkler parts are connected properly to avoid leaks—just one leak could waste up to 6,300 gallons of water. When running sprinkler systems, make sure sprinklers are directed just on the landscape and not driveways or sidewalks. Finally, make sure your irrigation controller is programmed correctly—better yet, select a WaterSense labeled model to take the guess work out of watering. WaterSense labeled irrigation controllers can schedule watering based on local weather conditions or soil moisture levels, so find the type that works best for your landscape. Installing a WaterSense labeled irrigation controller can save up to 15,000 gallons of water annually! You can also install WaterSense labeled spray sprinkler bodies to help control water pressure and reduce wasted water. Need some help getting started with your water-efficient landscape? Hire a landscape irrigation professional certified by a WaterSense labeled irrigation program to conduct a system audit, inspect your sprinkler system, suggest water efficiency improvements, and install WaterSense labeled products. Learn more ways to celebrate Smart Irrigation Month and water smarter all year long on the WaterSense website: https:\/\/www.epa.gov\/watersense\/watering-tips. The City of Durham Strikes Again With Savings Capturing its second WaterSense Partner of the Year Award, the City of Durham (North Carolina) Department of Water Management kept up a steady pace of water savings with its creative outreach efforts in 2021. To celebrate Fix a Leak Week, the City created an online virtual scavenger hunt with the theme, “Leaks can run, but they can’t hide.” Participants navigated through pages of its website to track down clues and solve 10 different riddles as they learned about the Department of Water Management and WaterSense labeled products for the chance to win WaterSense labeled products and other water conservation prizes. The City also offered various outreach events throughout the year to educate residents and businesses about water conservation and how to save with WaterSense. To make the most of its outreach during the pandemic, the City offered a mix of virtual and in-person outdoor events, including online sessions with students, virtual tours, environmental field days, and appearances at several community vaccination events, where they provided information on WaterSense and water efficiency. The City was able to reach over 400 individuals through these various events! To help residents save water and money, the City rebated over 550 water-efficient toilets in 2021. They also conducted nearly 100 residential water use assessments, providing visual inspections of all water-using fixtures and appliances in and around local homes. During these assessments, they gave away nearly 100 WaterSense labeled showerheads and aerators to residents. To learn more about the City of Durham Water Management’s award-winning water-saving activities in 2021, visit the WaterSense website: https:\/\/www.epa.gov\/watersense\/watersense-awards#Durham22. The City of Fort Worth Makes Plumbing Repair Accessible The City of Fort Worth (Texas) earned its second WaterSense Partner of the Year Award by helping its community save water. To make water efficiency more accessible, Fort Worth Water launched a plumbing repair program to fix minor leaks in 2021 called SmartRepair. Qualifying low-income homeowners could participate in the program, which repairs or replaces toilets and fixtures. Fort Worth Water directed city-contracted plumbers to use WaterSense labeled fixtures whenever possible. Repairs for nearly 50 homes in 2021 resulted in an estimated yearly savings of 821,200 gallons of water! To reduce water waste even further, Fort Worth Water implemented an Advanced Metering Infrastructure system that allows the City to monitor customers’ water usage and detect leaks. Using this system, the City of Fort Worth notified over 68,000 customers of high water use with a link to their web page about checking for leaks. An analysis of the mailings showed 65 percent of customers no longer showed continuous usage 30 to 60 days after receiving the letter. Fort Worth also collaborated with several other partners to promote WaterSense as part of its educational offers through a combination of live and virtual classes focused on water conservation. The City partnered with Tarrant Regional Water District in Texas to host four irrigation classes and two YardSmart conferences and worked with the cities of Dallas and Houston to host a two-part Fix a Leak Week workshop. Fulton Homes Constructs to Conserve Fulton Homes built up its efforts in 2021 to bring WaterSense labeled homes to the market, earning it its third Partner of the Year Award. In 2021, Fulton closed on 609 WaterSense labeled homes, nearly double the number it built in 2020! This represented nearly 80 percent of the total new houses that Fulton Homes closed on in 2021. What’s more, all of the homes built by Fulton in 2021 included WaterSense labeled plumbing products. Fulton Homes expanded its customer service team and trained them on WaterSense labeled products to further amplify the value of saving water with WaterSense labeled products to their customers. Fulton also trains their project managers and assistants in all areas of WaterSense and sustainable building practices and works closely with plumbing contractors so that they understand the importance of installing WaterSense labeled products. To ensure its homes were able to meet version 2.0 of the WaterSense homes program, Fulton management met quarterly with their third-party inspectors to review the updated specification, discussed methods to meet the new requirements, and conducted community outreach.","filter_flag":1}
{"title":"International Code Council Releases 2021 International Water Conservation Code Provisions - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludGVybmF0aW9uYWwtY29kZS1jb3VuY2lsLXJlbGVhc2VzLTIwMjEtaW50ZXJuYXRpb25hbC13YXRlci1jb25zZXJ2YXRpb24tY29kZS1wcm92aXNpb25z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludGVybmF0aW9uYWwtY29kZS1jb3VuY2lsLXJlbGVhc2VzLTIwMjEtaW50ZXJuYXRpb25hbC13YXRlci1jb25zZXJ2YXRpb24tY29kZS1wcm92aXNpb25z0gEA?oc=5","id":"CBMidGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludGVybmF0aW9uYWwtY29kZS1jb3VuY2lsLXJlbGVhc2VzLTIwMjEtaW50ZXJuYXRpb25hbC13YXRlci1jb25zZXJ2YXRpb24tY29kZS1wcm92aXNpb25z0gEA","guidislink":false,"published":"Tue, 17 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=17, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=290, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludGVybmF0aW9uYWwtY29kZS1jb3VuY2lsLXJlbGVhc2VzLTIwMjEtaW50ZXJuYXRpb25hbC13YXRlci1jb25zZXJ2YXRpb24tY29kZS1wcm92aXNpb25z0gEA?oc=5\" target=\"_blank\">International Code Council Releases 2021 International Water Conservation Code Provisions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"International Code Council Releases 2021 International Water Conservation Code Provisions - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ludGVybmF0aW9uYWwtY29kZS1jb3VuY2lsLXJlbGVhc2VzLTIwMjEtaW50ZXJuYXRpb25hbC13YXRlci1jb25zZXJ2YXRpb24tY29kZS1wcm92aXNpb25z0gEA?oc=5\" target=\"_blank\">International Code Council Releases 2021 International Water Conservation Code Provisions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Washington, DC — The International Code Council recently released the 2021 International Water Conservation Code Provisions (IWCCP). This resource provides the best and most comprehensive tool for the design, installation and administration of potable and non-potable water conservation and efficiency systems. “The world needs a much greater sense of urgency about water scarcity and the IWCCP gives governments the tools they need to have a real impact in conserving water resources,” said Code Council Chief Executive Officer Dominic Sims, CBO. The 2021 IWCCP contains all the water conservation and hot water energy-saving requirements from the I-Codes for both residential and commercial occupancies including provisions from the International Green Construction Code (IgCC) and International Energy Conservation Code (IECC). The Code Council’s Plumbing, Mechanical and Fuel Gas I-Codes are a vital part of a complete building system. Their usage allows for communities to stay current with the latest building technologies while meeting the public health, sanitation and safety requirements necessary for the built environment. “The adoption of water conservation practices is essential, as they not only aid communities in tackling water scarcity but also lower utility expenses for both homeowners and businesses while reducing our carbon footprint,” said Mark Johnson, Code Council Executive Vice President of the Content and Services Group and President of RESNET. “With the 2021 IWCCP, industry professionals will have a comprehensive and valuable resource to establish efficient water conservation systems in commercial and residential settings.” The American Society of Heating, Refrigerating and Air-Conditioning Engineers (ASHRAE), National Association of Builders (NAHB) and the Residential Energy Services Network (RESNET) supported Code Council efforts toward incorporating technical requirements into the 2021 IWCCP. The resource includes the following standards: The International Green Conservation Code, powered by ANSI\/ASHRAE\/USGBC\/IES 189.1-2020 Standard for the Design of High-Performance Green Buildings Excerpts from the ICC 700-2020 National Green Building Standard ASABE\/ICC 8052-2020 Landscape Irrigation Sprinkler and Emitter Standard ANSI\/RESNET\/ICC 850-2020 Standard for the Calculation and Labeling of the Water Use Performance of One- and Two-Family Dwellings Using the Water Rating Index “The 2021 IWCCP is an excellent tool for industry professionals to ensure that water conservation and efficient systems are established in large multi-unit residential and commercial buildings,” said 2023-24 ASHRAE Treasurer Bill McQuade, P.E., Fellow ASHRAE, LEED AP. “These systems are crucial not only for achieving cost savings, but also towards our goal of realizing a sustainable and water-secure future.” “Home builders will enjoy the operational efficiency provided by the new comprehensive water conservation provisions,” said Alicia Huey, chairman of the NAHB and a custom home builder and developer from Birmingham, Ala. “Water conservation is an increasingly important consideration for home builders and buyers. This new publication will make it easier to take additional steps to incorporate water conservation in residential projects.” ###","filter_flag":1}
{"title":"Annual Program Emphasizes Water Conservation - CleanLink","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL0FubnVhbC1Qcm9ncmFtLUVtcGhhc2l6ZXMtV2F0ZXItQ29uc2VydmF0aW9uLS0tMzAyMDHSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL0FubnVhbC1Qcm9ncmFtLUVtcGhhc2l6ZXMtV2F0ZXItQ29uc2VydmF0aW9uLS0tMzAyMDHSAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL0FubnVhbC1Qcm9ncmFtLUVtcGhhc2l6ZXMtV2F0ZXItQ29uc2VydmF0aW9uLS0tMzAyMDHSAQA","guidislink":false,"published":"Thu, 05 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=278, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL0FubnVhbC1Qcm9ncmFtLUVtcGhhc2l6ZXMtV2F0ZXItQ29uc2VydmF0aW9uLS0tMzAyMDHSAQA?oc=5\" target=\"_blank\">Annual Program Emphasizes Water Conservation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CleanLink<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Annual Program Emphasizes Water Conservation - CleanLink","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LmNsZWFubGluay5jb20vbmV3cy9hcnRpY2xlL0FubnVhbC1Qcm9ncmFtLUVtcGhhc2l6ZXMtV2F0ZXItQ29uc2VydmF0aW9uLS0tMzAyMDHSAQA?oc=5\" target=\"_blank\">Annual Program Emphasizes Water Conservation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CleanLink<\/font>","source.href":"https:\/\/www.cleanlink.com","source.title":"CleanLink","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Contributed by Waterless Co. Imagine a day without water. · How would it feel? · What would you do? · How would it change your life? These are some of the questions the Imagine a Day Without Water program is asking us to think about. This National Day of Action is on Oct. 19, 2023, each year. It is a global initiative to raise awareness and inspire action on the water crisis that affects millions of people around the world. According to Water.org, 771 million people currently lack access to safe water and nearly one million people die annually due to the lack of safe water. “The numbers are staggering,” says Klaus Reichardt, CEO and founder of Waterless Co. Inc. manufacturers of no-water urinals and other restroom products. “But they don't tell the whole story. Behind these statistics, there are human beings who suffer from the consequences of water scarcity and contaminated water.” He says this is why Waterless Co. is proud to support Imagine a Day Without Water and join the global movement to make water a priority for everyone. “We believe that waterless [urinal] technology is one way to help reduce water consumption, save money, and protect the environment. Fortunately, more no-water urinals are being installed around the world today than ever before.” But Reichardt adds that waterless products are not enough to solve the water crisis. “We need collective action, political will, and social change to ensure that everyone has access to safe and sufficient water, and one more thing, learns how to use water efficiently.” He adds that by participating and recognizing this special day and all that it means, “we will gain a deeper understanding of the value of water and the urgency of the water crisis.”","filter_flag":1}
{"title":"Save Our Water Introduces New Rebate Finder Tool and Resources Page to Help Californians Transform Their Yards - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NhdmUtb3VyLXdhdGVyLWludHJvZHVjZXMtbmV3LXJlYmF0ZS1maW5kZXItdG9vbC1hbmQtcmVzb3VyY2VzLXBhZ2UtdG8taGVscC1jYWxpZm9ybmlhbnMtdHJhbnNmb3JtLXRoZWlyLXlhcmRzLTMwMTk2NzUzOS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NhdmUtb3VyLXdhdGVyLWludHJvZHVjZXMtbmV3LXJlYmF0ZS1maW5kZXItdG9vbC1hbmQtcmVzb3VyY2VzLXBhZ2UtdG8taGVscC1jYWxpZm9ybmlhbnMtdHJhbnNmb3JtLXRoZWlyLXlhcmRzLTMwMTk2NzUzOS5odG1s0gEA?oc=5","id":"CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NhdmUtb3VyLXdhdGVyLWludHJvZHVjZXMtbmV3LXJlYmF0ZS1maW5kZXItdG9vbC1hbmQtcmVzb3VyY2VzLXBhZ2UtdG8taGVscC1jYWxpZm9ybmlhbnMtdHJhbnNmb3JtLXRoZWlyLXlhcmRzLTMwMTk2NzUzOS5odG1s0gEA","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NhdmUtb3VyLXdhdGVyLWludHJvZHVjZXMtbmV3LXJlYmF0ZS1maW5kZXItdG9vbC1hbmQtcmVzb3VyY2VzLXBhZ2UtdG8taGVscC1jYWxpZm9ybmlhbnMtdHJhbnNmb3JtLXRoZWlyLXlhcmRzLTMwMTk2NzUzOS5odG1s0gEA?oc=5\" target=\"_blank\">Save Our Water Introduces New Rebate Finder Tool and Resources Page to Help Californians Transform Their Yards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Save Our Water Introduces New Rebate Finder Tool and Resources Page to Help Californians Transform Their Yards - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMipgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NhdmUtb3VyLXdhdGVyLWludHJvZHVjZXMtbmV3LXJlYmF0ZS1maW5kZXItdG9vbC1hbmQtcmVzb3VyY2VzLXBhZ2UtdG8taGVscC1jYWxpZm9ybmlhbnMtdHJhbnNmb3JtLXRoZWlyLXlhcmRzLTMwMTk2NzUzOS5odG1s0gEA?oc=5\" target=\"_blank\">Save Our Water Introduces New Rebate Finder Tool and Resources Page to Help Californians Transform Their Yards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The Save Our Water website now offers more information on how Californians can access financial resources to transform their thirsty lawns and turf with water-wise plants https:\/\/saveourwater.com\/ SACRAMENTO, Calif., Oct. 25, 2023 \/PRNewswire\/ -- California's Save Our Water public awareness campaign launched a new rebates page that connects Californians with local resources and rebates in their area. Californians can now quickly and easily find local rebates to update their lawns by simply entering their zip codes at SaveOurWater.com. Many local water agencies provide these rebates to encourage homeowners to save water by transforming their thirsty lawns and turf with water-wise plants or other drought-tolerant landscapes. As 40% of the water Californians use is outdoors, transforming a yard can save a significant amount of water. Hotter and drier weather could diminish California's water supply by up to 10% by 2040, according to climate experts. The Save Our Water campaign reminds Californians about the importance of making water conservation a way of life. \"California will naturally swing from flood to drought, making our water supplies unpredictable. That is why it continues to be extremely important to use water wisely every day,\" stated Margaret Mohr, Deputy Director of Communications, California Department of Water Resources. \"We know our changing climate will bring more dry years in the future, and we all can prepare now for more weather extremes of wet to dry periods.\" Save Our Water has been ramping up efforts all year to make sure the message of water conservation reaches Californians year-round. In the spring, Save Our Water refreshed its look and updated its campaign website and social media channels ( Instagram , TikTok , Facebook ) in English and Spanish. The campaign has also produced promotional spots to address barriers and misconceptions about drought-tolerant landscaping with humorous and beautiful water conservation content (Promotional Spot Links for viewing: For the Love of Water , Tough Love ). Additionally, Save Our Water has partnered with a diverse set of influencers and content creators ranging from educators, family-friendly channels, DIY'ers, parents, plant and garden enthusiasts, fitness coaches, and climate advocates. Creators like Benji Le ( @benji_plant ), Emmanuel Duverneau ( @Emmanuel.Duverneau ), Brad and Tim ( @CraftGrooms ), Patty Rodriguez ( @pattyrodriguez ), and Free Plants Forever ( @Free.Plants.Forever ) have generated social media content to reach a wide range of ages and demographics to encourage Californians to conserve water, rain or shine. Reaching Californians is core to the Office of Community Partnerships and Strategic Communications (OCPSC), who co-manages Save Our Water with the California Department of Water Resources. \"Climate change disproportionately impacts underserved communities. OCPSC is committed to meet people where they are with culturally competent and actionable information. We're excited to serve as partners with the California Department of Water Resources to encourage our communities across the state to conserve water and connect them to available resources,\" said Yumi Sera, Executive Director, OCPSC. The OCPSC works with a trusted network of messengers across 100 community-based organizations, ethnic media, and other key partners to connect Californians with rebates, resources, and information on how to save water. For more information and resources visit www.saveourwater.com. About Save Our Water: Save Our Water is California's statewide water conservation program. Co-managed by the Office of Community Partnerships and Strategic Communications and the Department of Water Resources, the program's goal is to make water conservation a California way of life. Save our Water teaches Californians how to use water more efficiently inside and outside their homes and how to transform their yards into water-wise landscapes. Through partnerships with local water agencies and community-based organizations, social media, earned media, and event sponsorships, Save Our Water is helping people conserve water, rain or shine. About the Office of Community Partnerships and Strategic Communications: The Office of Community Partnerships and Strategic Communications (OCPSC) manages the State's highest priority community engagement and public awareness efforts including COVID-19 vaccines and climate justice, water conservation and extreme heat. The Office works with the respective agencies and departments to help inform campaign efforts and supports greater coordination and collaboration within state government. About DWR: DWR manages California's water resources, systems, and infrastructure, including the State Water Project (SWP), in a responsible, sustainable way. DWR's responsibilities and duties include: preventing and responding to floods, droughts, and catastrophic events; informing and educating the public on water issues; developing scientific solutions; restoring habitats; planning for future water needs, climate change impacts, and flood protection; constructing and maintaining facilities; generating power; ensuring public safety; and providing recreational opportunities. SOURCE Save Our Water","filter_flag":1}
{"title":"Whole Foods Market’s Top 10 Food Trends for 2024 - Food Institute Blog","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZm9vZGluc3RpdHV0ZS5jb20vdGVzdC1zaXRlL2ZvY3VzL3dob2xlLWZvb2RzLW1hcmtldHMtdG9wLTEwLWZvb2QtdHJlbmRzLWZvci0yMDI0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZm9vZGluc3RpdHV0ZS5jb20vdGVzdC1zaXRlL2ZvY3VzL3dob2xlLWZvb2RzLW1hcmtldHMtdG9wLTEwLWZvb2QtdHJlbmRzLWZvci0yMDI0L9IBAA?oc=5","id":"CBMiWmh0dHBzOi8vZm9vZGluc3RpdHV0ZS5jb20vdGVzdC1zaXRlL2ZvY3VzL3dob2xlLWZvb2RzLW1hcmtldHMtdG9wLTEwLWZvb2QtdHJlbmRzLWZvci0yMDI0L9IBAA","guidislink":false,"published":"Thu, 19 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=292, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZm9vZGluc3RpdHV0ZS5jb20vdGVzdC1zaXRlL2ZvY3VzL3dob2xlLWZvb2RzLW1hcmtldHMtdG9wLTEwLWZvb2QtdHJlbmRzLWZvci0yMDI0L9IBAA?oc=5\" target=\"_blank\">Whole Foods Market’s Top 10 Food Trends for 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Institute Blog<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Whole Foods Market’s Top 10 Food Trends for 2024 - Food Institute Blog","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vZm9vZGluc3RpdHV0ZS5jb20vdGVzdC1zaXRlL2ZvY3VzL3dob2xlLWZvb2RzLW1hcmtldHMtdG9wLTEwLWZvb2QtdHJlbmRzLWZvci0yMDI0L9IBAA?oc=5\" target=\"_blank\">Whole Foods Market’s Top 10 Food Trends for 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Institute Blog<\/font>","source.href":"https:\/\/foodinstitute.com","source.title":"Food Institute Blog","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"As 2023 winds down, Whole Foods Market has released its top 10 anticipated food trends for 2024. The annual predictions report is composed by the grocer’s Trends Council—a group of more than 50 Whole Foods Market team members, including foragers, buyers, and culinary experts. “Our annual food trends predictions list is a way for us to pull back the curtain for customers and share insight into what our buyers and culinary experts are keeping on their radar for the upcoming year,” said Cathy Strange, ambassador of food culture for Whole Foods Market. Here are Whole Foods Market’s top 10 trending items to watch for 2024: Simple Ingredient Plant Products Complex meat alternatives are out and protein-forward products made with simple ingredients such as mushrooms, walnuts, tempeh, and legumes are in. This shift is already permeating the plant-based industry, as Veggie Grill just announced a menu refresh that will bring the chain back to its whole-ingredient roots. Whole Cacao As upcycling continues to gain popularity, utilizing by-products like cacao pulp (a practice that other countries have done for centuries) is a trend to watch in 2024. Instead of being discarded and wasted, cacao pulp is now being made into jellies and jams. Likewise, new cacao fruit powders are a sugar alternative that doesn’t compromise on sweet, ambrosial flavor. Buckwheat Buckwheat has a lot going for it. It’s used as a cover crop to support soil health; it’s a superfood containing protein, carbs, and fiber; and it’s naturally gluten free. As more brands embrace regenerative agriculture, buckwheat could show up in everything from plant-based milk alternatives to crackers and granola. Fancy Faux Fish Caviar is no longer just for the wealthy elite—the delicacy has exploded in popularity over the last several years and fancy fish has become a hot commodity. As such, plant-based brands are capitalizing on the trend and creating innovative alternative seafood products. Look for carrots masquerading as lox, trumpet mushrooms subbing in for scallops, and the root vegetable konjac appearing in sushi rolls and poke bowls. Water Stewardship In 2024, products promoting water conservation will be all over the grocery store. Whether it’s responsibly-farmed foods or lifestyle brands touting water-conscious products like dry shampoo, shampoo bars, and laundry detergent sheets—consumers and brands are rallying together in the interest of water stewardship. Complex Heat Peppers are so hot right now—both literally and figuratively—and they are only getting hotter. In fact, the hot pepper expert from South Carolina who crossbred and grew the California Reaper (previously the world’s hottest pepper) a decade ago just broke his own record with a pepper that’s three times hotter. Ramen is All the Rage Brands are embracing consumers’ love for ramen with new elevated takes on the old classics, often made without certain preservatives or added MSG. Demand for simple, convenient meals is unwavering and noodles bring all the comfort of a warm meal without the hassle of extensive preparation. Little Treat Culture TikTok is a constant source of inspiration for food trends, and the introduction of “Little Treat Culture” has got brands shrinking both the cost and format of their products. Little treats may be daily rituals, like commuting with bubble tea, or spontaneous rewards, like tossing a cookie or a bath bomb into the cart. Either way, shoppers are looking for single-serving pack sizes that are easy to buy on impulse without breaking the bank. Women’s Health Social media has made it possible for women to have more public conversations about their health, shedding light on symptoms and life stages that were previously swept under the rug. Brands have taken notice and are now making new products for periods, pregnancy, postpartum, and menopause. Some companies are even introducing specially formulated foods for different aspects of women’s health, like menopause energy bars. Caffeine With Purpose Sure, a caffeine buzz is great—but what about caffeine with added functional benefits? That’s an even better boost. In 2024, expect to see new coffee and energy drinks enhanced with functional ingredients such as mushrooms, adaptogens, probiotics, and more. The Food Institute Podcast Consumers have been hammered by the one-two punch of the pandemic and inflation, which is impacting what groceries they buy and where they purchase these items. RBC Capital Markets managing director Nik Modi discusses cost pressures for CPG makers, a consumer shift to the perimeter of the grocery store, and increasing credit issues among consumers.","filter_flag":1}
{"title":"2024 Will Be the Most Vegan Year Yet, According to These 2 Trend Predictors - VegNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiKmh0dHBzOi8vdmVnbmV3cy5jb20vZm9vZC10cmVuZHMtMjAyNC12ZWdhbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiKmh0dHBzOi8vdmVnbmV3cy5jb20vZm9vZC10cmVuZHMtMjAyNC12ZWdhbtIBAA?oc=5","id":"CBMiKmh0dHBzOi8vdmVnbmV3cy5jb20vZm9vZC10cmVuZHMtMjAyNC12ZWdhbtIBAA","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKmh0dHBzOi8vdmVnbmV3cy5jb20vZm9vZC10cmVuZHMtMjAyNC12ZWdhbtIBAA?oc=5\" target=\"_blank\">2024 Will Be the Most Vegan Year Yet, According to These 2 Trend Predictors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"2024 Will Be the Most Vegan Year Yet, According to These 2 Trend Predictors - VegNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiKmh0dHBzOi8vdmVnbmV3cy5jb20vZm9vZC10cmVuZHMtMjAyNC12ZWdhbtIBAA?oc=5\" target=\"_blank\">2024 Will Be the Most Vegan Year Yet, According to These 2 Trend Predictors<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VegNews<\/font>","source.href":"https:\/\/vegnews.com","source.title":"VegNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"As we inch closer to 2024, trend forecasts continue to point to plant-based eating as a cornerstone of the modern diet. While vegan burgers were a mega trend in recent years, plant-based seafood is now stepping into the spotlight as the trend to watch for 2024, according to reports released by both The Specialty Food Association (SFA) and Whole Foods Market. Overall, both SFA and Whole Foods find that consumers are looking for simpler, less processed foods that lean into value and sustainability. Whole Foods Market “Our annual food trends predictions list is a way for us to pull back the curtain for customers and share insight into what our buyers and culinary experts are keeping on their radar for the upcoming year,” Cathy Strange, Ambassador of Food Culture for Whole Foods Market and member of the Trends Council, said in a statement. “From specific product ingredients and flavor trends, to growing movements in the food industry, we can’t wait to see these trends gain momentum in the year ahead,” Strange said. Plant-based embraces whole foods Whole Foods Market’s ninth annual trend report—compiled by 50 of its foragers, buyers, and culinary experts—explains that plant-based food is still a big trend and on a trajectory of reverting back to basic ingredients. In 2024, trendspotters predict that the focus will be on whole foods such as mushrooms, walnuts, tempeh, and legumes. This shift, Whole Foods says, is largely consumer-driven, as more people are increasingly wary of processed foods and are seeking alternatives that they perceive as more natural. Mushrooms are also a continuing trend according to both SFA and Whole Foods, revered for their versatility across sectors. “People will discover mushrooms in every food and beverage category and product developers will find ways to weave in ancient wisdom into new craveable food formats,” Trendspotter Kantha Shelke said in a statement. Overall, it seems consumers are demanding more from their plant-based foods—not just meatless, but also health-focused and transparently sourced, and brands are catching onto these concerns. At Whole Foods, Meati Foods is capitalizing on this trend with its line of vegan chicken, steak, and jerky which it makes from mycelium (a mushroom root). The company is also capturing the sustainability trend identified in both reports as it can grow one teaspoon of its mushroom root spores into the equivalent of hundreds of cows worth of meat in just four days. Plant-based seafood swims into 2024 Plant-based seafood has been trending for several years and was identified as a top pick for Whole Foods’ first annual plant-based trends report that it published in 2021. That year, the plant-based seafood industry generated $42.1 million according to market research firm Allied Market Research (AMR). By 2031, AMR predicts the sector will reach $1.3 billion, with growth primarily attributed to factors such as depletion of natural ocean resources, rise in the global vegan population, increased pressure on the global food supply chain, and heightened awareness regarding animal welfare and cruelty in farms. Whole Foods Market Whole Foods identifies 2024 as the year that new and more gourmet innovation will continue to bring excitement to the category by way of vegan tinned fish—a plant-based take on a broader trend. SFA agrees that plant-based seafood—typically made from soy, wheat, pea, and konjac— will be a big thing next year. And while recreating plant-based versions of products such as shrimp, crab, fish, and lobster has been difficult in the past, SFA Trendspotter Chala June says that might soon change. “Historically, this has been a challenge for producers as the textures are particularly hard to mimic,” June said in a statement. “But with advancing technology more brands are going to take a swing at it.” Konscious Foods (makers of plant-based seafood that is both in the freezer and sushi case at Whole Foods); Seed to Surf (which produces innovative tinned vegan seafood); Good Catch (creators of vegan tuna pouches and frozen goods); and others are already showcasing these trends in their new products. Focus on sustainability Sustainability is not a new trend, but it is one that continues to evolve and grow in importance, permeating across different food categories. According to Whole Foods’ report, water conservation and stewardship are taking on new significance in food production. The retailer expects to see new water brands that make use of fruit by-products, essentially converting waste into a resource. This innovative approach to water signals broader changes in the way we think about sustainability and food production. The report also notes that brands are getting creative with the use of entire food parts. For example, cacao pods, which are usually discarded, are being used in their entirety in some food products. Whole Foods Market Another example is buckwheat, a crop known for its role in improving soil health, becoming an increasingly popular ingredient. The environmental benefits are double: buckwheat helps to restore soil, and its use in food products reduces the need for less sustainable ingredients. SFA Trendspotters agree that sustainability—a key differentiator between plant-based foods and their animal counterparts—is a key trend for 2024 and beyond. “Regenerative, upcycled, and sustainably packaged are not just buzzwords but keywords in consumers’ quests to eat well while doing good,” Trendspotter Jonathan Deutsch said in a statement.","filter_flag":1}
{"title":"Innova sees popularity of protein, mushrooms accelerating in 2024 - Food Business News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODk0LWlubm92YS1zZWVzLXBvcHVsYXJpdHktb2YtcHJvdGVpbi1tdXNocm9vbXMtYWNjZWxlcmF0aW5nLWluLTIwMjTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODk0LWlubm92YS1zZWVzLXBvcHVsYXJpdHktb2YtcHJvdGVpbi1tdXNocm9vbXMtYWNjZWxlcmF0aW5nLWluLTIwMjTSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODk0LWlubm92YS1zZWVzLXBvcHVsYXJpdHktb2YtcHJvdGVpbi1tdXNocm9vbXMtYWNjZWxlcmF0aW5nLWluLTIwMjTSAQA","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODk0LWlubm92YS1zZWVzLXBvcHVsYXJpdHktb2YtcHJvdGVpbi1tdXNocm9vbXMtYWNjZWxlcmF0aW5nLWluLTIwMjTSAQA?oc=5\" target=\"_blank\">Innova sees popularity of protein, mushrooms accelerating in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Innova sees popularity of protein, mushrooms accelerating in 2024 - Food Business News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODk0LWlubm92YS1zZWVzLXBvcHVsYXJpdHktb2YtcHJvdGVpbi1tdXNocm9vbXMtYWNjZWxlcmF0aW5nLWluLTIwMjTSAQA?oc=5\" target=\"_blank\">Innova sees popularity of protein, mushrooms accelerating in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","source.href":"https:\/\/www.foodbusinessnews.net","source.title":"Food Business News","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"ARNHEM, THE NETHERLANDS — Protein and mushroom ingredients will continue to grow increasingly popular in 2024, according to Innova Market Insights. The market researcher’s “ingredients taking the spotlight” trend ranks No.1 for next year, taking over from 2023’s top trend of redefining value. Innova’s research revealed protein and mushrooms as two of the most up and coming ingredients, with 42% of consumers saying protein is the most important ingredient, and meals featuring mushroom growing 12% year-over-year from 2018 to 2023. “This may be for reasons of flavor or texture, for example, or other positive associations — not purely because of any better-for-you benefits,” said Lu Ann Williams, global insight director at Innova. “Those associations might echo other well-loved products, snippets picked up from social media or potentially many years of online information on healthy ingredients from ‘superfruits’ to gut-friendly bacteria.” Sustainability is at the center of Innova’s No.2 trend: nurturing nature. Seventy percent of consumers said sustainability is more important when choosing a product than two years ago, and products that touch on the increased awareness of climate concerns may be able to better differentiate themselves from competitors, Ms. Williams said. “From regenerative agriculture to farming conditions for livestock, brands that highlight a bond with nature and the environment are achieving cut-through with consumers,” she said. “For example, over the last four years, our analysis found an astonishing 40% annual increase in food and drink products making some sort of water usage claim.” Interest in water waste has been noted elsewhere, with Whole Foods Market also identifying water conservation as a top trend in 2024. Personal health benefits also remain an important factor for consumers. Innova’s third trend for 2024, prioritizing prevention, emphasizes products that help shoppers be proactive about maintaining their health and avoiding long-term complications like cardiovascular disease. The trend also underscores an increase in consumers wanting to take personal responsibility for their health. The No. 4 trend for 2024 blends plant-based formulations and formats with other popular label claims, including familiarity and convenience. For instance, ready meals and sides with plant-based and vegan claims have grown 8% annually since 2020. “Time-saving ready meals are serving up increasing numbers of popular dishes in alternative vegan or vegetarian versions, such as lentil lasagna,” Ms. Williams said. “There is a clear message coming through to brands and retailers that, while some consumers don’t eat meat at all, many more are happy to eat less of it.” Rounding out Innova’s top five trends is “local goes global.” Products that merge locally sourced ingredients with global cuisine can capitalize on the 66% of consumers interested in flavors from around the world, though it will be important to strike a balance between the competing elements. “The end result can combine the opportunity for local pride with the excitement of international dishes,” Ms. Williams said. “This does not replace the popularity of traditional, local menus, but extends them into new domains.”","filter_flag":1}
{"title":"Car detailing services market to register $68.8 billion by 2033 - Carwash Online","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmNhcndhc2guY29tL2RldGFpbGluZy1tYXJrZXQtMjAzMy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmNhcndhc2guY29tL2RldGFpbGluZy1tYXJrZXQtMjAzMy_SAQA?oc=5","id":"CBMiLmh0dHBzOi8vd3d3LmNhcndhc2guY29tL2RldGFpbGluZy1tYXJrZXQtMjAzMy_SAQA","guidislink":false,"published":"Fri, 20 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=293, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmNhcndhc2guY29tL2RldGFpbGluZy1tYXJrZXQtMjAzMy_SAQA?oc=5\" target=\"_blank\">Car detailing services market to register $68.8 billion by 2033<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Carwash Online<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Car detailing services market to register $68.8 billion by 2033 - Carwash Online","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLmh0dHBzOi8vd3d3LmNhcndhc2guY29tL2RldGFpbGluZy1tYXJrZXQtMjAzMy_SAQA?oc=5\" target=\"_blank\">Car detailing services market to register $68.8 billion by 2033<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Carwash Online<\/font>","source.href":"https:\/\/www.carwash.com","source.title":"Carwash Online","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"NEWARK, Del. — The global car detailing services market registered an astonishing CAGR of 6.6% in the historical period between 2018 and 2022, according to a press release from Future Market Insights Inc. The release said the global car detailing services market will reach $68.8 billion by 2033. It is estimated to record a steady CAGR of 5.5% in the review period 2023 to 2033; and is likely to exceed a valuation of $40.2 billion in 2023. Download the Sample PDF Summary for an overview of the Comprehensive Research Report: https:\/\/www.futuremarketinsights.com\/reports\/sample\/rep-gb-17940 The car detailing services market includes a range of specialized car cleaning and restoration services designed to improve the appearance and condition of vehicles. These services go beyond a regular carwash, including deep cleaning, restoration and protecting exterior and interior vehicle surfaces. Car detailing services are sought after by car owners who value maintaining the aesthetics and functionality of their vehicles. Car detailing services include various services, including paint touch-ups, exterior washing, polishing, interior vacuuming, leather conditioning, seat cleaning and more. The market leverages advanced technologies to achieve superior results, including high-quality cleaning products, specialized equipment and application techniques. Several car detailing services market companies are adopting eco-friendly practices, water-saving methods and biodegradable cleaning solutions to minimize their environmental impact. Establishing an online presence, including on websites, social media and booking platforms, has become important for reaching and attracting customers, as several prefer the convenience of booking online. Retail companies are paying attention to complying with environmental policy and adopting sustainable practices. This comprises proper disposal of chemical waste and water conservation efforts. Building a robust brand image and providing outstanding customer service is increasingly important. Retail businesses focus on creating outstanding client experiences to build loyalty and drive positive word of mouth. The car detailing services market is dynamic and prejudiced by consumer preferences, technological advances and environmental considerations. It serves diverse clients, from those seeking basic maintenance services to enthusiasts looking for high-end protection and restoration services. Key Takeaways from the Car Detailing Services Market Report The United Kingdom car detailing services market is anticipated to be $2 billion by 2033. by 2033. China’s car detailing services market is projected to reach $10 billion by 2033. by 2033. Japan’s car detailing services market is projected to total $5.7 billion by 2033. by 2033. South Korea’s car detailing services market will surge to $2.7 billion by 2033. by 2033. Based on type, the exterior car detailing category is projected to grow at a CAGR of 5.4% through 2033. through 2033. In terms of service, the conventional service station segment is expected to expand at 5.0% CAGR through 2033. “Car owners are increasingly aware of the importance of upholding their vehicles’ overall appearance and condition, leading them to seek professional car detailing services regularly,” said Sneha Varghese, senior consultant, consumer products and goods. “The rising trend of car enthusiasts and collectors is also contributing to the expansion of the market. Growing disposable incomes and general economic prosperity in several regions have allowed customers to spend on car detailing and maintaining services.” Competitive Landscape The global car detailing industry is very competitive, and several players are trying to enter untapped markets. Service suppliers are undertaking key initiatives to serve their customers better. Some SMEs are directing toward product development and launches, improved service offerings, and mergers and acquisitions to compete worldwide. For instance, In February 2023, Splash Car Wash, a USA-based company, acquired Guilderland, another USA-based Knockout Car Wash company. In March 2021, Wrapmate, a 3M brand, launched an e-commerce stage for vehicle graphics plan to assist customers seamlessly purchase vehicle graphics online. In its new offering, Future Market Insights (FMI) provides an unbiased analysis of the global car detailing services market, presenting historical demand data (2018 to 2022) and forecast statistics from 2023 to 2033. The study incorporates compelling insights on the car detailing services industry based on type (exterior car detailing [car wash, car wax, others] interior car detailing [leather conditioning, vacuum conditioning, others]) service (conventional service station, on-demand service) across several regions.","filter_flag":1}
{"title":"Lessons in Energy Efficiency and Sustainability From The New American Home - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VuZXJneS1lZmZpY2llbmN5LXN1c3RhaW5hYmlsaXR5LWxlc3NvbnMtbmV3LWFtZXJpY2FuLWhvbWUtMjAyM9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VuZXJneS1lZmZpY2llbmN5LXN1c3RhaW5hYmlsaXR5LWxlc3NvbnMtbmV3LWFtZXJpY2FuLWhvbWUtMjAyM9IBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VuZXJneS1lZmZpY2llbmN5LXN1c3RhaW5hYmlsaXR5LWxlc3NvbnMtbmV3LWFtZXJpY2FuLWhvbWUtMjAyM9IBAA","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VuZXJneS1lZmZpY2llbmN5LXN1c3RhaW5hYmlsaXR5LWxlc3NvbnMtbmV3LWFtZXJpY2FuLWhvbWUtMjAyM9IBAA?oc=5\" target=\"_blank\">Lessons in Energy Efficiency and Sustainability From The New American Home<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lessons in Energy Efficiency and Sustainability From The New American Home - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2VuZXJneS1lZmZpY2llbmN5LXN1c3RhaW5hYmlsaXR5LWxlc3NvbnMtbmV3LWFtZXJpY2FuLWhvbWUtMjAyM9IBAA?oc=5\" target=\"_blank\">Lessons in Energy Efficiency and Sustainability From The New American Home<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Each year the International Builders’ Show features a show home built to demonstrate the latest in home design, building technologies, and innovation. The New American Home (TNAH) 2023 not only showcases stunning design and views of the Las Vegas Valley but also serves as a model of high performance in home design, from the home's natural resource efficiencies and renewable energy systems to the healthy, comfortable indoor environment it creates for its owners. But what happens in Vegas doesn't have to say in Vegas: Home builders can apply many of the materials, methods, and home-performance best practices that make TNAH 2023 exemplary to build their own energy-efficient homes. TNAH 2023 Performance Achievements Essential Elements for Building a High-Performance, Energy-Efficient Home As the green building and energy consultants on the home (and on several previous TNAH projects), the team from Two Trails collaborated with Luxus Design Build and its trade and materials supply partners to meet the highest standards of energy and water savings, indoor air quality, and reliable comfort to deliver an ultra-efficient home. An extensive rooftop solar array was essential for The New American Home 2023 to achieve a net-zero energy balance, but so was reducing the home's overall energy load to a score of 50 on the HERS (Home Energy Rating System) Index. | Image: Joel Gamble But although this Las Vegas home is a luxury dwelling, the products, systems, and best practices used in TNAH 2023 can actually be applied to any residential property at any price point for greater energy efficiency and better home performance. Here are the keys to the home's success. Optimizing for Energy Efficiency: Passive Solar Design Working with the path of the sun to determine a home’s orientation is one of the most overlooked aspects of site selection for many homes. Yet designing a home that will function properly and more efficiently depends a great deal on how the structure is sited on the lot. The orientation of The New American Home 2023 is optimized for both solar gain and shading. The home is designed to take advantage of the sun’s natural light and heat, with large windows and skylights strategically placed to allow maximum daylight, which reduces the need for artificial lighting. At the same time, south-facing glass is shaded to prevent overheating and increased cooling loads in the spring and fall. RELATED Keeping It Tight: Thermal Envelope In a high-performance home, the thermal envelope is essential to achieving home energy savings and healthy indoor air quality, and it starts from the ground. Thermal bridging can be a major source of energy loss in buildings. Thermal bridges are essentially areas in the building envelope that allow heat to pass through more easily and occur where materials that are better conductors of heat form a \"bridge\" between the inner and outer face of the construction. So for a high-performance thermal envelope, it's essential to seal around penetrations, such as electrical outlets behind the faceplates, doors and windows and around sliding glass door openings, and in storage closets not located in conditioned space. Thermal bridging and air and moisture infiltration through the thermal envelope can reduce insulation's effectiveness and lead to uncomfortable cold spots inside the home, so it's critical to properly and completely seal penetrations into the building shell prior to drywall being installed. (Once a building reaches the drywall stage, sealing penetrations is a case of out of sight, out of mind.) The 2x6 perimeter walls are a hybrid approach of open-cell spray-foam insulation and a thin but durable, multi-layer reflective barrier from Fi-Foil that helps achieve total wall assembly R-values above R-30. | Image: courtesy NAHB Studios-Structure Productions In addition to a tight structural frame, TNAH 2023 combines a 2-inch layer of open-cell spray foam insulation in 2x6 wall cavities with a multi-layer reflective barrier from Fi-Foil. (The ceiling also uses a thin but durable multi-layer reflective barrier from the manufacturer.) This hybrid approach, which optimizes the thermal benefits of both products in tandem, provides superior thermal resistance compared with using traditional batt or blown-in fiberglass insulation. That said, the choice of insulation must be appropriate for the climate and the building type and, of course, it must be installed properly. In addition, a 2-inch-thick continuous layer of rigid foam insulation was applied to the outside surface of the home's perimeter walls to further reduce thermal bridging, enabling the whole wall assembly to achieve R-30 or greater, well above code minimum. The 2023 New American Home also used a product called Aeroseal to fill even the smallest cracks in the thermal envelope prior to drywall being installed. In a depressurized environment, the spray-applied product seeks out small fissures and seals them against air leaks. It's like “fix-a-flat” for home building. The depressurized blower door test conducted at TNAH 2023 returned an airtightness rating of 2.98 air changes per hour. | Image: courtesy Two Trails RELATED: Energy-Efficiency Road Map: Whole-Building Envelope Sealing Proper Design and Installation of the HVAC System Correctly installing the heating, ventilation, and air conditioning system ensures the comfort of the home’s occupants while reducing energy consumption and providing optimal indoor air quality. Properly sizing the HVAC equipment is critical; a unit that’s too small will struggle to keep up with the demands of the occupants and will lead to energy waste and compromised comfort. An oversized unit will consume more energy than needed and may result in the unit not being able to maintain consistent temperature and humidity levels while constantly cycling on and off. TNAH 2023 specified LG’s Multi-V, variable refrigerant flow (VRF) system with a SEER 18.9 efficiency rating. This multi-zoned system consisted of smaller outdoor condenser units (see below) and in-wall\/in-ceiling interior units that are completely contained in conditioned space to reduce thermal loss, improve the home's energy efficiency, and deliver consistent, reliable indoor comfort. The HVAC system in The New American Home 2023 includes a trio of compact, variable-speed heat pumps from LG that feed multiple zones in the house through unobtrusive mini-split units, enabling better comfort control and energy efficiency. | Image: courtesy Two Trails Ductwork design is also an important aspect of an energy-efficient home, considering such factors as the HVAC system's airflow rate, pressure, and temperature differentials to help maintain indoor comfort and reliable temperatures and energy use. Of course, the ducts need to be properly insulated, sealed, and balanced to reduce thermal loss and air leaks that erode energy savings. Performing a blower door test (see above) provides immediate feedback about any duct leaks, in addition to the home's overall air leakage. Indoor Environmental Quality for Better Occupant Health and Comfort The quality of the indoor environment affects occupant health, comfort, and productivity. Proper ventilation is crucial for maintaining good indoor air quality (IAQ). It helps remove pollutants while cycling fresh air from the outside, preventing a build-up of indoor pollutants such as carbon dioxide, volatile organic compounds (VOCs), and allergens. With that, removing pollutants from the air such as dust, pollen, pet dander, and other allergens—what indoor air quality geeks call “source control”—creates a healthy baseline of indoor air from the get-go. In addition, ignoring high humidity levels can lead to growth of mold and mildew and can encourage bed bugs. Humidity that’s too low can cause dry skin and respiratory irritation for occupants. Crestron touchscreens and companion handheld remote controls throughout the home enable the owners to set and regulate comfort across one or multiple zones, as well as controlling lighting and other systems. | Image: courtesy Two Trails TNAH 2023 has a fully automated whole-home fresh air system that uses sensor technology to continuously monitor and exhaust air pollution caused by increased humidity, VOCs, smoke, carbon dioxide, and small particles. The system from Broan-NuTone automatically activates the nearest ventilation fan or range hood to remove contaminated air while bringing in fresh outside air and features three modules that can be monitored and controlled in real time using a mobile app. Finally, proper lighting can improve occupant comfort and productivity as well. The New American Home 2023 features 100% LED lighting, both indoors and out, which helps to reduce energy use and costs, as well as bulb replacement costs and hassle ... especially for fixtures located in volume spaces such as the open floor plan in the center of The New American Home. With that, choosing the right color temperature is key to achieving a pleasing ambience; color temperatures range from 2,700K to 3,000K for warm light and 5,000K to 6,500K for cool white. About Color Temperature Color temperature is a way to describe the appearance of the light provided by a light bulb. Measured in degrees of Kelvin (K) on a scale from 1,000 to 10,000, color temperatures above 5,000K are described as cool colors (bluish), while lower color temperatures (2,700K–3,000K) are described as warm (yellowish). As a general rule, the higher the Kelvin rating, the whiter the light will be. An equally important aspect of choosing fixtures and lights is looking for high-quality LED chips to ensure maximum efficiency and longevity. Energy Star–certified products meet strict efficiency and quality standards, and LED lighting is now often dimmable. Occupancy sensors can be installed to further reduce energy consumption for a more energy-efficient home. Water Efficiency Take it from an expert: High-efficiency toilets, showerheads, and faucets, as well as Energy Star–rated water-using appliances, really do reduce water consumption without sacrificing performance. Outdoors, you can achieve significant water efficiencies by using plants that are native to the climate zone, along with a landscape design that considers what each plant will need in terms of water, fertilization, and sunlight. Installing drip irrigation will greatly reduce the need for constant watering, since the water is delivered directly to plants' roots, while traditional sprinkler systems are more difficult to control and the water evaporates more quickly. Part of The New American Home's water-wise strategy is to use drought-tolerant plants that are well-suited to the home's Las Vegas location. | Image: courtesy Two Trails The New American Home 2023 is outfitted with a wealth of water-saving products, including kitchen and laundry appliances from Signature Kitchen Suite and LG, respectively, and highly efficient plumbing fixtures and faucets from Kohler. Outside, an automated drip irrigation system for the home's drought-tolerant landscaping keeps water where it needs to be (at the base of each plant), significantly reducing wasteful evaporation. Combined, these features reduce the home's water use by 50% compared to a baseline home of comparable size—a critical consideration in a hot, dry desert climate, such as Las Vegas. Energy Efficiency Look for the Energy Star label (usually bright yellow with black writing) on all appliances. The label indicates the appliance meets or exceeds energy-efficiency standards set by the Environmental Protection Agency (EPA). That said, not all Energy Star-rated appliances are equal. Some models are more efficient than others, even among those made by the same brand. Those featured in this home from Signature Kitchen Suite are all certified energy efficient—from the 48-inch range\/oven to the French-door refrigerator to the beverage chillers and warming drawers. A tankless water heater, sometimes referred to as an on-demand water heater, offers energy efficiency and a continuous supply of hot water, but you have to ensure the unit is the right size for the home's needs, since incorrect sizing can lead to inadequate hot water supply. The Rinnai units installed in TNAH 2023 use recirculating technology to provide almost instant hot water and a consistent flow, which significantly reduces wasteful \"lag time\" waiting for hot water to reach the tap or showerhead. Yes, the New American Home 2023 has a dramatic (and clever) zero-edge pool, and there is no argument that pool pumps can be an energy suck. The one in this home, however, meets Energy Star standards to use less energy compared with standard models. These pumps also go through further testing for durability and performance while often providing enhanced functionality. The pool pump is just one piece of your pool filtration system. For the entire system to run efficiently, it’s important not only to get the sizing right but to also ensure the system has proper plumbing and electrical connections, and that it’s compatible with other pool equipment. On-Site Renewable Energy (Solar) Solar panels are a great way for homeowners to reduce their carbon footprint and save money on electricity bills. Key factors when considering installing solar panels include: Location: The location of solar panels is critical for optimum performance. Ideally, panels should be south facing in the Northern Hemisphere and north facing in the Southern Hemisphere. The location of solar panels is critical for optimum performance. Ideally, panels should be south facing in the Northern Hemisphere and north facing in the Southern Hemisphere. Roof structure: Weight is a factor, and the roof structure needs to be engineered and built to handle the additional load of the solar panels. Weight is a factor, and the roof structure needs to be engineered and built to handle the additional load of the solar panels. Shading: Any shading on solar panels can greatly reduce their efficiency. This also includes shadows cast by nearby buildings and trees. Any shading on solar panels can greatly reduce their efficiency. This also includes shadows cast by nearby buildings and trees. Inverter: This is the most critical component of the solar energy system. The inverter converts DC (direct current) power generated by the solar panels to AC (alternating current) power to be used within the home. This is the most critical component of the solar energy system. The inverter converts DC (direct current) power generated by the solar panels to AC (alternating current) power to be used within the home. Maintenance: Accumulation of dirt and debris on the surface of solar panels over time will affect the panels’ performance. It’s important to clean panels at least once a year. The rooftop solar array at TNAH 2023 takes full advantage of the home's sunny climate and the latest technologies to collect and convert sunlight into clean electricity, as well as providing an energy surplus. | Image: Joel Gamble For TNAH 2023, the project team benefitted from a flat roof that enabled the installation of an extensive 20kW solar array of Solaria PowerXT 400-watt solar panels. The system uses micro-inverters from Enphase to provide more precise troubleshooting of each panel's performance, as opposed to inverters that connect to multiple (or all) of the panels. All of the factors mentioned above are proven building science, performing together and interacting with the natural environment to create a comfortable, efficient living environment. The New American Home showcases the latest in building technologies and sustainable methods so home builders can see these products and innovations at work. Drew Smith is the chief operating officer of Two Trails, a company focused on sustainable building consulting. A sustainable building expert for more than 15 years, he formed the company to help builders, developers, and homeowners understand the process of green building and to provide them with the knowledge to easily bring their green projects to life. For more information, go to twotrails.com.","filter_flag":1}
{"title":"Qatar strives to lead on sustainability - GlobalCapital","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lmdsb2JhbGNhcGl0YWwuY29tL2dsb2JhbG1hcmtldHMvYXJ0aWNsZS8yY2F2eXJ0eGF5aWtheGp5eHo1a3cvcWF0YXItc3RyaXZlcy10by1sZWFkLW9uLXN1c3RhaW5hYmlsaXR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lmdsb2JhbGNhcGl0YWwuY29tL2dsb2JhbG1hcmtldHMvYXJ0aWNsZS8yY2F2eXJ0eGF5aWtheGp5eHo1a3cvcWF0YXItc3RyaXZlcy10by1sZWFkLW9uLXN1c3RhaW5hYmlsaXR50gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3Lmdsb2JhbGNhcGl0YWwuY29tL2dsb2JhbG1hcmtldHMvYXJ0aWNsZS8yY2F2eXJ0eGF5aWtheGp5eHo1a3cvcWF0YXItc3RyaXZlcy10by1sZWFkLW9uLXN1c3RhaW5hYmlsaXR50gEA","guidislink":false,"published":"Wed, 11 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=284, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lmdsb2JhbGNhcGl0YWwuY29tL2dsb2JhbG1hcmtldHMvYXJ0aWNsZS8yY2F2eXJ0eGF5aWtheGp5eHo1a3cvcWF0YXItc3RyaXZlcy10by1sZWFkLW9uLXN1c3RhaW5hYmlsaXR50gEA?oc=5\" target=\"_blank\">Qatar strives to lead on sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobalCapital<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Qatar strives to lead on sustainability - GlobalCapital","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3Lmdsb2JhbGNhcGl0YWwuY29tL2dsb2JhbG1hcmtldHMvYXJ0aWNsZS8yY2F2eXJ0eGF5aWtheGp5eHo1a3cvcWF0YXItc3RyaXZlcy10by1sZWFkLW9uLXN1c3RhaW5hYmlsaXR50gEA?oc=5\" target=\"_blank\">Qatar strives to lead on sustainability<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobalCapital<\/font>","source.href":"https:\/\/www.globalcapital.com","source.title":"GlobalCapital","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Qatar famously has the world’s third largest gas reserves, which have provided plentiful, cheap electricity and served as a major driver of economic growth. The hydrocarbon sector contributed an average 38% of real GDP between 2019 and 2021, according to S&P Global Ratings. This fell only slightly in 2022, when hosting the football World Cup increased the contribution from other sectors. Looking to the future, the country’s abundant gas fields will continue to help finance Qatar’s transformation and provide an important source of activity for domestic banks. The flagship North Field Expansion (NFE) project — one of the largest industrial projects in the world — will bring six new gas liquefaction trains, boosting production by over 60%. This will help maintain Qatar’s dominance in the liquefied natural gas market, ensuring the country is protected from inflationary pressures being felt elsewhere in the region. There will be attendant benefits for industries that rely on LNG, including Qatar’s world-beating petrochemical and fertiliser firms. For the banks, there will be ample opportunity to help finance sub-contractors and downstream operators. Natural gas is also an important base fuel that can help drive the global energy transition and there is much Qatar can do to reduce LNG emissions. Sheikh Fahad Bin Mohammad Bin Jabor Al Thani, chairman of Doha Bank, notes that Qatar’s Vision 2030 aims to have the country assume a leading international role in assessing the impact of climate change and how to improve mitigation. Although Qatar will continue to develop its natural gas sources, Vision 2030 also highlights the importance of energy efficiency. The country’s energy sustainability strategy includes a variety of targets to improve performance across the LNG sector and boost renewable energy capacity. In total, Qatar aims to reduce the carbon intensity of its LNG operations by around 30%. Capturing value and emissions The authorities are already hard at work making this vision a reality. Earlier this year, French firm Technip Energies was awarded the engineering, procurement, and construction contract for the North Field South project. This will include two new LNG mega-trains with a combined capacity of 16 million tonnes per annum, but the project also includes a large CO2 carbon capture and sequestration (CCS) facility. Technip estimates that the CCS system will capture 1.5 million tonnes of carbon each year — reducing emissions by 25%. The firm has a similar contract for the North Field East project. Recognising the huge potential for combining LNG production with CCS, Qatar’s government is working hard to support and develop carbon capture technology. The first ever MENA region Capture Capital Utilisation and Storage (CCUS) forum took place in Qatar in May this year, and the authorities are investing heavily to meet a target of capturing 11 million tonnes of CO2 each year by 2035. Key technology incubators include the Gulf Organisation for Research & Development (GORD) Institute based in the Qatar Science and Technology Park. Focussed on using scientific research to improve sustainability, the institute’s research projects include reducing CO2 emissions in the built environment and — in collaboration with University College London — CCUS systems for gas-fired combined heat and power schemes. Visitors to the science park during the carbon capture forum were treated to demonstrations of the latest innovations from global leaders including Shell, ExxonMobil and General Electric. “CCS is being used to reduce emissions from the country’s operations in the already cleaner-burning natural gas sector, while green building initiatives promote sustainable building practices and environmentally friendly construction,” says Ahmed I. Hashem, acting group CEO of Dukhan Bank. “All of these areas offer excellent prospects to potential investors.” Qatar has multiple attributes that make it suitable for carbon capture. The country’s geology and underground gas deposits are ideal for storing CO2. Its large scale, concentrated LNG infrastructure, meanwhile, is optimal for CCUS hubs. Major industrial centres like Ras Laffan have large manufacturing operations that could also benefit from carbon capture. QatarEnergy has signed a memorandum of understanding with GE to develop a carbon capture roadmap for the country’s energy sector. This includes exploring the development of a “world scale” carbon hub at Ras Laffan. Sun and wind The ambition and intent do not end there. As part of Qatar’s commitments to the Paris Agreement and its own Vision 2030 goals, the authorities have set a target to bring renewables up to 20% of its total electricity generation capacity by 2030. “Qatar has made significant progress in recent years in advancing renewable energy and energy efficiency initiatives,” says Joseph Abraham, group CEO of Commercial Bank of Qatar. “This strategic commitment aligns with the nation’s goals to diversify its energy sources, reduce its carbon footprint and contribute to global sustainability efforts.” The government itself has set an example, by widely installing solar panels on ministry buildings and establishing the Qatar Environment and Energy Research Institute to explore renewable energy and environmental responsibility. One important entity dedicated to building out renewables is Siraj Energy, formed through a joint venture between QatarEnergy and Qatar Electricity & Water (QEWC). Last year, QatarEnergy agreed to buy the remaining 49% stake in Siraj from QEWC as part of its 4C Climate Framework, which will significantly reduce the carbon intensity of its upstream operations and LNG facilities by 2030. Given its location, Qatar’s solar potential is enormous and this is reflected in the scale of the projects. Late last year, the country inaugurated its first large solar power installation — the 1,000 hectare Al Kharsaah plant, developed by a consortium that includes Siraj and TotalEnergies. Two million solar modules spread over an area the size of 1,400 football fields have the potential to generate 800MW — enough to cover 10% of the country’s peak demand. TotalEnergies estimates that over the plant’s lifetime it will reduce the country’s CO2 emissions by 26 million tonnes. Several other major projects are already under way. QatarEnergy Renewables Solutions has picked Samsung C&T as the contractor for its industrial cities solar power project IC Solar. This will see two more large scale solar photovoltaic plants built at the Mesaieed Ras Laffan Industrial cities. The authorities hope these will come online in late 2024, taking the country’s total renewable generation capacity up to 1.675GW. That will have to increase much more if the country is to meet its goal of 5GW of solar power by 2035, but BMI analysts expect solar generation capacity to increase rapidly, at an average of over 16% each year between 2022 and 2032. Qatar’s wind power potential may not match that of its solar endowment. But the authorities have recognised a resource of major value. The Asia Wind Energy Association highlights the particular promise for projects along the Qatar-Bahrain Causeway. “Although wind energy has less potential than solar in Qatar, technological advances and falling costs have led to the development of offshore wind energy projects,” says Ahmed I. Hashem at Dukhan Bank. Selected aspects of QatarEnergy’s Sustainability Strategy Methane intensity reduction to 0.2% by 2025 Carbon intensity reduction of 15%-25% from upstream and 25%-35% from LNG facilities by 2030 Zero routine flaring by 2030 Addition of 2GW to 4GW of renewable energy by 2030 Deployment of carbon capture and sequestration technology to capture over 11 million tonnes per annum of CO2 by 2035 Source: International Energy Agency Holistic approach Sustainability is about far more than simply building renewable energy capacity, and Qatar’s efforts are placing the country at the cutting edge of sustainability on multiple fronts. It boasts the Middle East’s largest waste management facility — the Domestic Solid Waste Management Centre in Mesaieed — which generates 50MW of electricity and helps produce organic fertilisers. Ooredoo Qatar has partnered with Ericsson to install the firm’s Smart Connected Site Solution across its telecom operations. This allows Ooredoo sites to use lithium ion batteries, dramatically reducing reliance on diesel generators and the grid. Qatar’s desert environment brings sunlight for solar, but also challenges when it comes to water. ConocoPhillips operates a Global Water Sustainability Center in Doha’s Science and Technology Park, developing water-related technologies and promoting conservation awareness. Qatar’s colossal desalination plants are becoming increasingly environmentally friendly through more efficient chemical processes and lower energy use. “Qatar’s sustainability initiatives extend beyond energy to encompass water conservation, waste management and green transportation,” says Abraham at Commercial Bank. “These efforts contribute to a holistic approach to sustainability and resource management.” Banks on board Sustainability has been a priority for the nation’s banks for years now, providing investors, business and entrepreneurs with expertise across the environmental, social and governance spectrum. “As one of the main funding engines in the country, the banking system appears to be well placed to help facilitate the growth of new economic activity, including sustainability-linked projects,” says Benjamin Young, director at S&P Global Ratings. The landscape of green loan products available from major lenders continues to grow. “Commercial Bank offers green loan products designed to finance environmentally responsible initiatives,” says Abraham. “These loans are directed toward projects that promote energy efficiency, renewable energy, water conservation, waste management and other sustainable practices.” Dukhan Bank’s suite of green lending products includes electric vehicle financing — appropriate for a country that now hosts international EV manufacturing operations. Lenders are also financing eco-friendly real estate projects and sustainable infrastructure. Qatar has introduced green building standards and certifications to promote sustainable construction practices. The Qatar Sustainability Assessment System encourages the design and construction of environmentally friendly buildings. This type of involvement reflects a broader global shift toward environmentally responsible finance and Qatar’s own sustainability objectives. In the capital markets, Qatari banks have already become issuers of green bonds and more are putting issuance plans in place. In May 2023, Doha Bank published its inaugural Sustainable Finance Framework, which allows for the issuance of green, social and sustainability financing instruments. “The portfolio of Qatari banks is expected to accommodate ESG projects in line with the country’s objectives,” says Sheikh Fahad Bin Mohammad Bin Jabor Al Thani. Part of adopting an ESG mindset involves banks improving their own internal operations. Many lenders have been working diligently to track and lower their emissions across key areas including fuel, water and waste usage. Doha Bank’s annual sustainability reports show that over the last five years it has managed to steadily reduce carbon dioxide-equivalent emissions. “The bank has embraced the principles outlined in the Qatar National Vision 2030,” says its chairman. “In its operations, the bank not only reviews the emissions, but also investigates the retail and wholesale loans of customers and their impact on climate change.” Dukhan Bank’s community initiatives have included a partnership with the Al Meera supermarket chain to reduce the use of plastic bags. In 2022, the bank announced a new ESG strategy that includes a commitment to achieving a net zero carbon footprint by 2035. “Not only will this help protect the planet, but it is good business, since customers and investors increasingly choose banks that recognise the importance of sustainability and ESG principles,” says Hashem. All this serves to illustrate the significant strides Qatar has made in advancing renewable energy and energy efficiency initiatives, and positioning itself as a regional leader in sustainability. These efforts not only contribute to Qatar’s environmental goals but enhance its energy security, economic resilience and global reputation among investors as a responsible partner.","filter_flag":1}
{"title":"Whole Foods Market forecasts top trends in 2024 - Food Business News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODU3LXdob2xlLWZvb2RzLW1hcmtldC1mb3JlY2FzdHMtdG9wLXRyZW5kcy1pbi0yMDI00gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODU3LXdob2xlLWZvb2RzLW1hcmtldC1mb3JlY2FzdHMtdG9wLXRyZW5kcy1pbi0yMDI00gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODU3LXdob2xlLWZvb2RzLW1hcmtldC1mb3JlY2FzdHMtdG9wLXRyZW5kcy1pbi0yMDI00gEA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODU3LXdob2xlLWZvb2RzLW1hcmtldC1mb3JlY2FzdHMtdG9wLXRyZW5kcy1pbi0yMDI00gEA?oc=5\" target=\"_blank\">Whole Foods Market forecasts top trends in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Whole Foods Market forecasts top trends in 2024 - Food Business News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzI0ODU3LXdob2xlLWZvb2RzLW1hcmtldC1mb3JlY2FzdHMtdG9wLXRyZW5kcy1pbi0yMDI00gEA?oc=5\" target=\"_blank\">Whole Foods Market forecasts top trends in 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","source.href":"https:\/\/www.foodbusinessnews.net","source.title":"Food Business News","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"AUSTIN, TEXAS — Faux fish, complex heat and buckwheat are among next year’s top trends, according to Whole Foods Market, a subsidiary of Amazon.com, Inc., in its ninth annual forecast. The retailer’s trends council, representing dozens of its buyers, merchants and culinary experts, has compiled its picks based on decades of experience and expertise in product sourcing and consumer preferences, plus workshopping with emerging and existing brands. “Our annual food trends predictions list is a way for us to pull back the curtain for customers and share insight into what our buyers and culinary experts are keeping on their radar for the upcoming year,” said Cathy Strange, ambassador of food culture for Whole Foods Market and member of the trends council. “From specific product ingredients and flavor trends, to growing movements in the food industry, we can’t wait to see these trends gain momentum in the year ahead.” The trend forecasters noted an evolution within the plant-based category toward shorter and simpler ingredient lists. Mushrooms, walnuts, tempeh and legumes are seen replacing complex meat alternatives, according to Whole Foods Market. Examples on its shelves include Actual Veggies burgers made with a medley of greens, beans, seeds and grains; Meati carne asada steaks formulated with mycelium, the muscular root structure of fungi; and Atlantic Sea Farms vegetable burgers featuring kelp, green chickpeas and pea protein. A handful of products highlight parts of the cacao plant that traditionally are discarded. Blue Stripes Urban Cacao offers a range of items including ready-to-drink beverages, trail mixes, chocolate bars and more, incorporating the shell, fruit and beans, which are rich in antioxidants, theobromine, electrolytes and calcium, according to the company. Additionally, cacao fruit powders are an emerging source of sweetness in product formulations, Whole Foods noted. Buckwheat, a sustainable seed containing protein and fiber, is cropping up in a variety of applications, from pancake and waffle mix to noodles to non-dairy milk. Snack brands betting on buckwheat include Lil Bucks, which produces a collection of buckwheat snack clusters, and Better with Buckwheat, formerly Maine Crisp, a creator of crackers featuring a blend of tartary buckwheat and common buckwheat. On the fins of a tinned fish trend comes a wave of brands bringing plant-based takes on popular seafood dishes to store shelves. Per Whole Foods, carrots are masquerading as lox, trumpet mushrooms are standing in for scallops, and the root vegetable konjac stars in fish-free sushi rolls and poke bowls. Brands diving into this trend include Konscious Foods, Good Catch, Save da Sea and Seed to Surf. Water conservation has entered the conversation of many manufacturers across the industry. Applications include regenerative organic certified grains and beans, hydroponically grown greens and responsibly farmed oysters. Global peppers continue to deliver nuanced heat in everything from cold-pressed juices to confections. Whole Foods cited specific varietals such as scorpion peppers, guajillo and Hungarian Goathorn peppers, as well as new botana sauces and chili oils gaining traction in the condiment section. Macaroni and cheese, cashews and olive oil are among grocery staples packing a spicy surprise. Premium noodles popping up on shelves include Momofuku Tingly Chili Wavy Noodles, immi Black Garlic “Chicken” Ramen, Omsom Saucy Noodles and more. Such products are designed to create convenient, restaurant-quality meals. As shoppers seek to save cash, some are likely to splurge on what Whole Foods Market has dubbed “little luxuries,” such as milk tea, gourmet sardines or individually packed desserts. TikTok creators are credited with creating “little treat culture,” and brands are buying in, according to Whole Foods. Emerging brands are aiming to support women’s health, offering supplements and even food and beverage products for menstrual cycles, pregnancy, postpartum and menopause. New coffee and energy drinks are enhanced with mushrooms, probiotics and other functional ingredients, tapping into consumer desire for a “boost with benefits,” according to Whole Foods. Brands participating in the trend include Four Sigmatic, Bulletproof and Halfday.","filter_flag":1}
{"title":"BharatAgri raises ₹35 cr Series A funding led by Arkam Ventures - BusinessLine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vZWNvbm9teS9hZ3JpLWJ1c2luZXNzL2JoYXJhdGFncmktcmFpc2VzLTM1LWNyLXNlcmllcy1hLWZ1bmRpbmctbGVkLWJ5LWFya2FtLXZlbnR1cmVzL2FydGljbGU2NzQzNzUwMS5lY2XSAZIBaHR0cHM6Ly93d3cudGhlaGluZHVidXNpbmVzc2xpbmUuY29tL2Vjb25vbXkvYWdyaS1idXNpbmVzcy9iaGFyYXRhZ3JpLXJhaXNlcy0zNS1jci1zZXJpZXMtYS1mdW5kaW5nLWxlZC1ieS1hcmthbS12ZW50dXJlcy9hcnRpY2xlNjc0Mzc1MDEuZWNlL2FtcC8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vZWNvbm9teS9hZ3JpLWJ1c2luZXNzL2JoYXJhdGFncmktcmFpc2VzLTM1LWNyLXNlcmllcy1hLWZ1bmRpbmctbGVkLWJ5LWFya2FtLXZlbnR1cmVzL2FydGljbGU2NzQzNzUwMS5lY2XSAZIBaHR0cHM6Ly93d3cudGhlaGluZHVidXNpbmVzc2xpbmUuY29tL2Vjb25vbXkvYWdyaS1idXNpbmVzcy9iaGFyYXRhZ3JpLXJhaXNlcy0zNS1jci1zZXJpZXMtYS1mdW5kaW5nLWxlZC1ieS1hcmthbS12ZW50dXJlcy9hcnRpY2xlNjc0Mzc1MDEuZWNlL2FtcC8?oc=5","id":"CBMijQFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vZWNvbm9teS9hZ3JpLWJ1c2luZXNzL2JoYXJhdGFncmktcmFpc2VzLTM1LWNyLXNlcmllcy1hLWZ1bmRpbmctbGVkLWJ5LWFya2FtLXZlbnR1cmVzL2FydGljbGU2NzQzNzUwMS5lY2XSAZIBaHR0cHM6Ly93d3cudGhlaGluZHVidXNpbmVzc2xpbmUuY29tL2Vjb25vbXkvYWdyaS1idXNpbmVzcy9iaGFyYXRhZ3JpLXJhaXNlcy0zNS1jci1zZXJpZXMtYS1mdW5kaW5nLWxlZC1ieS1hcmthbS12ZW50dXJlcy9hcnRpY2xlNjc0Mzc1MDEuZWNlL2FtcC8","guidislink":false,"published":"Thu, 19 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=292, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vZWNvbm9teS9hZ3JpLWJ1c2luZXNzL2JoYXJhdGFncmktcmFpc2VzLTM1LWNyLXNlcmllcy1hLWZ1bmRpbmctbGVkLWJ5LWFya2FtLXZlbnR1cmVzL2FydGljbGU2NzQzNzUwMS5lY2XSAZIBaHR0cHM6Ly93d3cudGhlaGluZHVidXNpbmVzc2xpbmUuY29tL2Vjb25vbXkvYWdyaS1idXNpbmVzcy9iaGFyYXRhZ3JpLXJhaXNlcy0zNS1jci1zZXJpZXMtYS1mdW5kaW5nLWxlZC1ieS1hcmthbS12ZW50dXJlcy9hcnRpY2xlNjc0Mzc1MDEuZWNlL2FtcC8?oc=5\" target=\"_blank\">BharatAgri raises ₹35 cr Series A funding led by Arkam Ventures<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessLine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BharatAgri raises ₹35 cr Series A funding led by Arkam Ventures - BusinessLine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vZWNvbm9teS9hZ3JpLWJ1c2luZXNzL2JoYXJhdGFncmktcmFpc2VzLTM1LWNyLXNlcmllcy1hLWZ1bmRpbmctbGVkLWJ5LWFya2FtLXZlbnR1cmVzL2FydGljbGU2NzQzNzUwMS5lY2XSAZIBaHR0cHM6Ly93d3cudGhlaGluZHVidXNpbmVzc2xpbmUuY29tL2Vjb25vbXkvYWdyaS1idXNpbmVzcy9iaGFyYXRhZ3JpLXJhaXNlcy0zNS1jci1zZXJpZXMtYS1mdW5kaW5nLWxlZC1ieS1hcmthbS12ZW50dXJlcy9hcnRpY2xlNjc0Mzc1MDEuZWNlL2FtcC8?oc=5\" target=\"_blank\">BharatAgri raises ₹35 cr Series A funding led by Arkam Ventures<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BusinessLine<\/font>","source.href":"https:\/\/www.thehindubusinessline.com","source.title":"BusinessLine","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"BharatAgri, an advisory-led e-commerce platform for farmers, has raised Series A funding of ₹35 crore ($4.3 million) led by Arkam Ventures, an early-stage venture fund dedicated to ‘Middle-India’ startups. A media statement said the funding marks Arkam’s third investment in the agri-tech space, furthering its commitment to support builders of Bharat. The round also saw participation from Capria Ventures, and the existing investors, India Quotient, 021 Capital, and Omnivore. The funds will be used to scale up BharatAgri’s e-commerce platform to cater to new geographies and strengthen its last-mile delivery. Rahul Chandra, Managing Director of Arkam Ventures, will join the board of BharatAgri. Founded by IIT-Madras alumni Siddharth Dialani and Sai Gole, BharatAgri uses smart farming advisory to help farmers identify and order the best input specific to their needs. The company has built prediction algorithms that provide advisory customised to crops, region and climatic changes. The statement said BharatAgri’s e-commerce platform offers 10,000-plus agricultural products such as fertilisers, seeds, pesticides, insecticides, and farming equipment, among others, and is delivered pan-India across 20,000-plus pin codes. Dialani said: “In the next three years, 50 million-plus farmers will use the internet for the first time, and we want BharatAgri to be their bridge to the digital era of agri that is now dawning. With 10 lakh-plus unique monthly users, 10,000-plus SKUs, 100-plus marketplace partners, and 20,000-plus serviceable pin codes, BharatAgri is making a significant impact on farmers’ lives. With this investment, BharatAgri aims to further strengthen its rural supply chain, expand the user base and become the largest and the de facto e-commerce platform for farmers.” The company statement said that BharatAgri has conducted extensive weather experiments for four years at ICAR, Hyderabad, and collected parameters to build the prediction algorithm to offer personalised and dynamic crop calendars for farmers, satellite-based monitoring, and soil and water testing services. It added that the integration of advisory and e-commerce has enabled BharatAgri to increase farmers’ production by 30 per cent, reduce cost by 10 per cent, and improve their earning by 100 per cent. It is looking to open multiple warehouses across different regions. Rahul Chandra, MD of Arkam Ventures, said agri inputs is a $44-billion market in India and suffers from stockouts, misinformation and non-scientific usage. The Indian farmer is now seeking digital information and concerned with farm yields, crop as well as personal safety and household wealth, he said. He said BharatAgri is a fantastic combination of custom advice and ready assortment of products — reducing confusion around the usage of chemical products and giving fastest access to the best quality agri brands. “The rural infrastructure in India is rapidly modernising with the last mile touching more and more villages, and farmers are increasingly trusting digital knowledge sources. The credible advice from BharatAgri helps bridge the trust deficit that accompanies input purchasing, and promises to open a digital channel for thousands of new products and brands that farmers seek to buy,” Chandra said. The statement said digitisation of the fragmented Indian agri industry is one of the key themes under Arkam’s ‘Middle-India’ thesis. The fund has been backing early-movers and market winners that are empowering farmers and strengthening the agri valuechain with technology, it said.","filter_flag":1}
{"title":"Retail - News - Retail India News: Kareena Kapoor Khan Partners with SUGAR Cosmetics Founders to Launch Quench ... - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1rYXJlZW5hLWthcG9vci1raGFuLXBhcnRuZXJzLXN1Z2FyLWNvc21ldGljcy1mb3VuZGVycy1sYXVuY2gtcXVlbmNoLWJvdGFuaWNz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1rYXJlZW5hLWthcG9vci1raGFuLXBhcnRuZXJzLXN1Z2FyLWNvc21ldGljcy1mb3VuZGVycy1sYXVuY2gtcXVlbmNoLWJvdGFuaWNz0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1rYXJlZW5hLWthcG9vci1raGFuLXBhcnRuZXJzLXN1Z2FyLWNvc21ldGljcy1mb3VuZGVycy1sYXVuY2gtcXVlbmNoLWJvdGFuaWNz0gEA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1rYXJlZW5hLWthcG9vci1raGFuLXBhcnRuZXJzLXN1Z2FyLWNvc21ldGljcy1mb3VuZGVycy1sYXVuY2gtcXVlbmNoLWJvdGFuaWNz0gEA?oc=5\" target=\"_blank\">Retail - News - Retail India News: Kareena Kapoor Khan Partners with SUGAR Cosmetics Founders to Launch Quench ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Retail - News - Retail India News: Kareena Kapoor Khan Partners with SUGAR Cosmetics Founders to Launch Quench ... - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5pbmRpYW5yZXRhaWxlci5jb20vbmV3cy9yZXRhaWwtaW5kaWEtbmV3cy1rYXJlZW5hLWthcG9vci1raGFuLXBhcnRuZXJzLXN1Z2FyLWNvc21ldGljcy1mb3VuZGVycy1sYXVuY2gtcXVlbmNoLWJvdGFuaWNz0gEA?oc=5\" target=\"_blank\">Retail - News - Retail India News: Kareena Kapoor Khan Partners with SUGAR Cosmetics Founders to Launch Quench ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Retail India News: Juicy Chemistry and Mommy Shots by Amrita Unveil 'Scars are Beautiful' In honor of Women’s Day, Juicy Chemistry and Mommy Shots by Amrita join forces for the 'Scars are Beautiful' campaign, shedding light on the beauty of postpartum bodies and stretch marks. The campaign, launched on March 5th, 2024, features 11 mothers proudly displaying their bodies and sharing their motherhood experiences to inspire other women to embrace their bodies and change societal perceptions. Era Vashishta, mother of a 2.5-year-old shares her story “ I was diagnosed with chronic PCOD when I was 28, which got me very scared as to whether or not I would ever get pregnant or have a baby. I never thought of motherhood before this. Because of the PCOD it made me want to be a mom, because I thought maybe I might not happen. After which, I became a mom and everything changed. As soon as I met my baby that’s when I knew this is someone I want to protect for the rest of my life, the love is unconditional. It was so scary and overwhelming, but once you hang on to all these feelings you wouldn’t have it any other way, I’d never not want to be a mom. My scars are my tiger stripes, because I think I draw a lot of power from them. I’m a mom and this body gave birth to a life, which is what makes me bigger, it makes me a tiger.” Megha Asher, the Co-Founder and COO of Juicy Chemistry said, “At Juicy Chemistry, we believe in promoting self-love and body positivity, and we are thrilled to partner with Mommy Shots for this unique campaign. Through this powerful photo series, we hope to inspire and empower women to embrace their bodies, and scars not just physical but emotional ones as well, and celebrate their unique journeys of motherhood. As mothers ourselves, we understand the challenges that come with motherhood and the impact it can have on a woman's body and self-perception. We hope that this campaign will help shift the narrative and encourage women to see their bodies as beautiful and strong, no matter their shape or size. Together, we can create a more inclusive and diverse representation of beauty and promote self-love and acceptance for all women.\" Amrita Samant, Founder and CEO Mommyshots said, “In my world of photography, motherhood, babies and art, creating something meaningful that helps change the world obsessed with perfection was very close to my heart. We want to redefine beauty with every line and every scar that spells resilience strength and a unique journey, we want to go beyond the surface with this campaign. They’re more than blemishes, they’re badges of honor, they are tender and timeliness. I am super proud of the 11 women who came forward to normalize what the society has for far too long considered unsightly.” Sonia Chandrakumar, one of the 11 mothers who posed and actively participated in the shoot said, “The journey of motherhood is very different for me, I had a really tough time the first 6 months. I had all kinds of nausea, I could not brush my teeth and I had a lot of body changes that took place. My husband was my greatest support because he constantly reminded me that there’s something beautiful coming out of this and if you want something beautiful in life you need to cope with the changes that take place in your body or yourself. So I kept reminding myself and dealing with the challenges. I’d describe my marks as Caleb’s wonderful art palette that I have around my stomach. I would not want to get rid of my marks, I want to keep it as a memory.” Motherhood scars, resembling intricate battle scars, symbolize the strength and resilience embedded in a woman's journey. Each mark narrates a story of endurance and courage, celebrating the remarkable strength of women. In honoring these scars, we acknowledge the transformative power of motherhood, inspiring women to embrace their bodies and celebrate their unique journeys. #scarsarebeautiful ","filter_flag":1}
{"title":"Union Cabinet approves NPK fertiliser subsidy for Rabi season; inclusion of Jamrani Dam Multipurpose Proje - The Economic Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvaW5kbC1nb29kcy9zdnMvY2hlbS0vLWZlcnRpbGlzZXJzL2NhYmluZXQtYXBwcm92ZXMtbnBrLWZlcnRpbGlzZXItc3Vic2lkeS1mb3ItcmFiaS1zZWFzb24tc291cmNlcy9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z0gGkAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9pbmR1c3RyeS9pbmRsLWdvb2RzL3N2cy9jaGVtLS8tZmVydGlsaXNlcnMvY2FiaW5ldC1hcHByb3Zlcy1ucGstZmVydGlsaXNlci1zdWJzaWR5LWZvci1yYWJpLXNlYXNvbi1zb3VyY2VzL2FtcF9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvaW5kbC1nb29kcy9zdnMvY2hlbS0vLWZlcnRpbGlzZXJzL2NhYmluZXQtYXBwcm92ZXMtbnBrLWZlcnRpbGlzZXItc3Vic2lkeS1mb3ItcmFiaS1zZWFzb24tc291cmNlcy9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z0gGkAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9pbmR1c3RyeS9pbmRsLWdvb2RzL3N2cy9jaGVtLS8tZmVydGlsaXNlcnMvY2FiaW5ldC1hcHByb3Zlcy1ucGstZmVydGlsaXNlci1zdWJzaWR5LWZvci1yYWJpLXNlYXNvbi1zb3VyY2VzL2FtcF9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z?oc=5","id":"CBMioAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvaW5kbC1nb29kcy9zdnMvY2hlbS0vLWZlcnRpbGlzZXJzL2NhYmluZXQtYXBwcm92ZXMtbnBrLWZlcnRpbGlzZXItc3Vic2lkeS1mb3ItcmFiaS1zZWFzb24tc291cmNlcy9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z0gGkAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9pbmR1c3RyeS9pbmRsLWdvb2RzL3N2cy9jaGVtLS8tZmVydGlsaXNlcnMvY2FiaW5ldC1hcHByb3Zlcy1ucGstZmVydGlsaXNlci1zdWJzaWR5LWZvci1yYWJpLXNlYXNvbi1zb3VyY2VzL2FtcF9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z","guidislink":false,"published":"Wed, 25 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=298, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvaW5kbC1nb29kcy9zdnMvY2hlbS0vLWZlcnRpbGlzZXJzL2NhYmluZXQtYXBwcm92ZXMtbnBrLWZlcnRpbGlzZXItc3Vic2lkeS1mb3ItcmFiaS1zZWFzb24tc291cmNlcy9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z0gGkAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9pbmR1c3RyeS9pbmRsLWdvb2RzL3N2cy9jaGVtLS8tZmVydGlsaXNlcnMvY2FiaW5ldC1hcHByb3Zlcy1ucGstZmVydGlsaXNlci1zdWJzaWR5LWZvci1yYWJpLXNlYXNvbi1zb3VyY2VzL2FtcF9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z?oc=5\" target=\"_blank\">Union Cabinet approves NPK fertiliser subsidy for Rabi season; inclusion of Jamrani Dam Multipurpose Proje<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Union Cabinet approves NPK fertiliser subsidy for Rabi season; inclusion of Jamrani Dam Multipurpose Proje - The Economic Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvaW5kbC1nb29kcy9zdnMvY2hlbS0vLWZlcnRpbGlzZXJzL2NhYmluZXQtYXBwcm92ZXMtbnBrLWZlcnRpbGlzZXItc3Vic2lkeS1mb3ItcmFiaS1zZWFzb24tc291cmNlcy9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z0gGkAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9pbmR1c3RyeS9pbmRsLWdvb2RzL3N2cy9jaGVtLS8tZmVydGlsaXNlcnMvY2FiaW5ldC1hcHByb3Zlcy1ucGstZmVydGlsaXNlci1zdWJzaWR5LWZvci1yYWJpLXNlYXNvbi1zb3VyY2VzL2FtcF9hcnRpY2xlc2hvdy8xMDQ2OTExMzYuY21z?oc=5\" target=\"_blank\">Union Cabinet approves NPK fertiliser subsidy for Rabi season; inclusion of Jamrani Dam Multipurpose Proje<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times<\/font>","source.href":"https:\/\/m.economictimes.com","source.title":"The Economic Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Conservation\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Nitrogen- Rs 47.02\/kg Phosphorus- Rs 20.82\/kg Potassium- Rs 2.38\/kg Sulphur- Rs 1.89\/kg (You can now subscribe to our (You can now subscribe to our Economic Times WhatsApp channel The Union Cabinet on Wednesday approved the Nutrient Based Subsidy (NBS) rates for NPK (Nitrogen, Phosphorus, Potassium) fertiliser for Rabi season effective October 1, 2023, till March 30, 2024, announced Anurag Thakur.The expenditure on subsidy is expected to cost Rs 22,303 crore, said Thakur.For Rabi season, the subsidised prices will be as followed:Thakur said di-ammonium phosphate will continue to be sold at the old rate of Rs 1,350 per bag, while for Muriate of Potash (MoP) the rate will go down.The cabinet also approved the inclusion of the Jamrani Dam Multipurpose Project of Uttarakhand under the Pradhan Mantri Krishi Sinchayee Yojana-Accelerated Irrigation Benefit Programme (PMKSY-AIBP), which will cost Rs 2,584 crore.The project envisages the construction of a dam near Jamrani village across river Gola, a tributary of river Ram Ganga, in the Nainital district of Uttarakhand. The dam will feed the existing Gola barrage through its 40.5 km length of canal system and 244 km long canal system completed in 1981.Giving details about the decision taken at the Cabinet Committee on Economic Affairs, Information and Broadcasting Minister Anurag Thakur said the central support of Rs 1,557.18 crore will be provided to Uttarakhand for completion of the project at an estimated cost of Rs 2,584.10 crore, scheduled to be completed by March 2028.An official release said the project envisages additional irrigation of 57,065 hectares (9,458 hectares in Uttarakhand and 47,607 hectares in Uttar Pradesh) in Nainital and Udham Singh Nagar districts of Uttarakhand, and Rampur and Bareilly districts in Uttar Pradesh.Apart from the construction of two new feeder canals, 207 km of existing canals are to be renovated, and 278 km of pucca field channels are also to be taken up under the project.In addition, the project also envisages hydropower generation of 14 MW and provision of 42.70 million cubic metres (MCM) of drinking water to Haldwani and nearby areas, benefitting more than 10.65 lakh population.Pradhan Mantri Krishi Sinchayee Yojana (PMKSY) was launched during 2015-16 with an aim to enhance physical access to water on farms, expand cultivable areas under assured irrigation, improve on-farm water use efficiency, and introduce sustainable water conservation practices.The central government has approved the implementation of PMKSY during 2021-26 with an overall outlay of Rs 93,068.56 crore (central assistance of Rs 37,454 crore).So far, 53 projects have been completed under PMKSY-AIBP, and an additional irrigation potential of 25.14 lakh hectares has been created.Six projects have been included after the AIBP component of PMKSY 2.0 since 2021-22.Jamrani Dam Multipurpose Project is the seventh project to be included in the list.(With inputs from PTI)","filter_flag":1}
