{"title":"A look at how we're building more sustainable hardware - The Keyword | Google Product and Technology News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvZGV2aWNlcy1zZXJ2aWNlcy9hLWxvb2stYXQtaG93LXdlcmUtYnVpbGRpbmctbW9yZS1zdXN0YWluYWJsZS1oYXJkd2FyZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvZGV2aWNlcy1zZXJ2aWNlcy9hLWxvb2stYXQtaG93LXdlcmUtYnVpbGRpbmctbW9yZS1zdXN0YWluYWJsZS1oYXJkd2FyZS_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvZGV2aWNlcy1zZXJ2aWNlcy9hLWxvb2stYXQtaG93LXdlcmUtYnVpbGRpbmctbW9yZS1zdXN0YWluYWJsZS1oYXJkd2FyZS_SAQA","guidislink":false,"published":"Thu, 06 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=96, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvZGV2aWNlcy1zZXJ2aWNlcy9hLWxvb2stYXQtaG93LXdlcmUtYnVpbGRpbmctbW9yZS1zdXN0YWluYWJsZS1oYXJkd2FyZS_SAQA?oc=5\" target=\"_blank\">A look at how we're building more sustainable hardware<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Keyword | Google Product and Technology News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"A look at how we're building more sustainable hardware - The Keyword | Google Product and Technology News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vYmxvZy5nb29nbGUvcHJvZHVjdHMvZGV2aWNlcy1zZXJ2aWNlcy9hLWxvb2stYXQtaG93LXdlcmUtYnVpbGRpbmctbW9yZS1zdXN0YWluYWJsZS1oYXJkd2FyZS_SAQA?oc=5\" target=\"_blank\">A look at how we're building more sustainable hardware<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Keyword | Google Product and Technology News<\/font>","source.href":"https:\/\/blog.google","source.title":"The Keyword | Google Product and Technology News","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Increasing our use of recycled materials We’re trying to reduce how much waste we generate as a company and minimize the demand for new raw materials — this starts with how we source materials that go into our products. Approximately 30% of all materials used in our new products launched and manufactured in 2022 were recycled content. This includes recycled material used in our devices’ aluminum, stainless steel, rare earth magnet, glass and plastic parts. For plastic specifically, 48% of all materials used came from recycled content. Using recycled materials also lowers the carbon footprint of our product manufacturing. For example, the aluminum in the phone enclosures of Pixel 7 and 7 Pro is made with 100 percent recycled content, reducing the carbon footprint of the aluminum portion of the enclosures by over 35% compared to using 100% primary aluminum. Providing new ways to repair phones Last year, we announced our partnership with iFixit to provide genuine Pixel spare parts, tools and documentation on models as far back as Pixel 2 for customers who are skilled in repair and independent service providers. This partnership, alongside our other mail-in and authorized service provider repair channels, expand the choices customers have in Pixel phone repair. Improving our packaging Product packaging typically contains many materials — like the plastic film materials you often see on electronic packages — which can be difficult to recycle. That’s why we’re committed to eliminating plastic from our hardware product packaging by 2025. Our latest packaging for Pixel 7 uses 99% plastic-free materials, getting us closer to this goal. Overall, in 2022, we reduced Pixel packaging plastic by 97%, and reduced the volume of packages by 54% and the weight by over 50% when compared to our first Pixel phone.","filter_flag":1}
{"title":"Why is recycling so important? The dirty truth behind our trash - ZME Science","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5","id":"CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA","guidislink":false,"published":"Fri, 28 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=118, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5\" target=\"_blank\">Why is recycling so important? The dirty truth behind our trash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZME Science<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Why is recycling so important? The dirty truth behind our trash - ZME Science","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieGh0dHBzOi8vd3d3LnptZXNjaWVuY2UuY29tL2ZlYXR1cmUtcG9zdC90ZWNobm9sb2d5LWFydGljbGVzL3N1c3RhaW5hYmlsaXR5L2dyZWVuLWxpdmluZy0xL3doeS1pcy1yZWN5Y2xpbmctc28taW1wb3J0YW50L9IBAA?oc=5\" target=\"_blank\">Why is recycling so important? The dirty truth behind our trash<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ZME Science<\/font>","source.href":"https:\/\/www.zmescience.com","source.title":"ZME Science","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Facebook X LinkedIn Pinterest Email Recycling is about much more than just reducing the amount of waste sent to the landfill, with a long list of benefits that aren’t limited to the environment — there are economic and social advantages too. Even as we live in a consumer-driven world, with a growing appetite for new things, if we begin to look at the waste created by this level of consumption in a different light, we might turn our problem into an opportunity. Credit Flickr What is recycling? Every day, we produce a vast amount of waste that ends up in landfills or polluting our oceans. From plastic bottles to food packaging, our throwaway culture is taking a toll on the environment. Recycling is one of the most effective ways to reduce the amount of waste that goes to landfills and to mitigate the negative impact on the planet. Whether it’s plastic, paper, or aluminum, the products, and materials that can be used after they fulfill their original purpose are far from worthless. In fact, most materials have great recycling value. The EPA estimates that up to 75% of all the waste can be recycled or repurposed, a figure that shows how impactful the process can be if done right. Almost everything we see around us can be technically recycled, although different materials require different techniques when they are recycled. Most of the commonly recyclable materials include batteries, biodegradable waste, clothing, electronics, garments, glass, metals, paper, plastics, and a lot more. Recycling is the process of separating, collecting, and remanufacturing or converting used or waste products into new materials. But if we want to truly focus on recycling, it’s important to change the way we address it both on a personal and societal level. Recycling helps extend the life and usefulness of something that has already served its initial purpose by returning it to its raw materials and then using those materials to produce something that is usable. It’s part of the three golden rules of sustainability (Reduce, Reuse, and Recycle) and has a lot of benefits both to us humans and to the environment. Virtually all of the environment is impacted by how much we recycle. Benefits of recycling The world’s natural resources are finite, and some are in very short supply. At a fundamental level, recycling paper and wood can save trees and forests, recycling plastic means creating less new polluting plastic, recycling metals means there’s less need for hugely costly mining, and recycling glass reduces the use of new raw materials like sand that affect coastal systems. Of course, the reality of it is much more complex, but the fundamental process is valid nonetheless. Some materials are technically recyclable, but doing so is so expensive it virtually never happens, while other materials retain their properties better than others. Metals, for instance, are repeatedly recyclable, while maintaining most or all of their properties. The most obvious benefit of recycling is the reduction of landfill waste. Landfills are rapidly filling up, and many cities are struggling to find new places to dump their trash. Recycling reduces the amount of waste that goes to landfills, making it a vital solution to the problem of overflowing landfills. When we recycle, we give new life to materials that would otherwise end up in a landfill. Recycling reduces the need to grow, harvest, or extract new raw materials from the Earth. That, in turn, reduces the harmful disruption and damage being done to the natural world, which means fewer forests cut down, rivers diverted, wild animals harmed or displaced, and less pollution. It’s also much better to recycle existing products than to damage someone else’s community or land during the exploration and exploitation of new raw materials. The demand for new goods has led to more of the poorest and most vulnerable people being displaced from their homes or otherwise exploited. Making products from recycled materials typically requires less energy than making them from new raw materials — sometimes it’s a huge difference in energy. For example, producing new aluminum from old products uses 95% less energy than making it from scratch. For steel, the energy saving is around 70%. Recycling paper saves 60% of the energy required to produce new paper from wood pulp. By conserving energy, we reduce the amount of greenhouse gases emitted during the production process. While not always, manufacturing something the second time around usually consumes far less energy. Because recycling means you need to use less energy on sourcing and processing new raw materials, it produces lower carbon emissions, which means it can help with global warming. It also keeps potentially methane-releasing waste out of landfill sites. Overall, reducing carbon dioxide and other greenhouse gases being emitted into the atmosphere is vital to stop climate change. Recycling also makes economic sense. As a rule of thumb, it’s six times cheaper to dispose of recycled waste than general refuse. So, the more you recycle, and the less you put in the bin, the more money is saved — which should be good for households, businesses, and local public services. Recycling food waste and green waste is a great idea too, often generating lots of valuable compost. Recycling can stimulate the economy in multiple ways. The EPA has shown recycling helps to create jobs in both the recycling and manufacturing industries. Recycling companies need workers to collect, sort, and process materials. These jobs can range from manual labor to high-tech positions, providing employment opportunities for people with different levels of education and skill. A 2016 study said recycling activities account in a single year for 757,000 jobs, $36.6 billion in wages, and $6.7 billion in tax revenues. Recycling also helps protect wildlife. When we dispose of waste improperly, it can end up in our oceans and harm marine life. For example, plastic waste can entangle and suffocate sea turtles and other animals. By recycling, we reduce the amount of waste that ends up in our oceans and protect marine life. The steps of recycling Recycling includes three essential steps, which create a continuous loop, represented by the familiar recycling symbol. The first one is to actually collect the recyclables, which can be done in different ways. For example, they can be collected from the curbside, dropped off at centers, or gathered through deposit or refund programs. Following the collection, recyclables are sent to a recovery facility where they are sorted, cleaned, and processed into materials that can be used in manufacturing. Recyclables are then bought and sold just like raw materials would be, and prices go up and down depending on supply and demand. A growing number of products are being manufactured with recycled content. Common household items that contain recycled materials are newspapers, steel cans, plastic laundry detergents, and soft drink containers. Recycled materials are also used in new ways such as recovered glass in asphalt to pave roads. Consumers can help close the recycling loop by buying new products made from recycled materials. There are thousands of products that contain recycled content. When you go shopping, look for products that can be easily recycled and products that contain recycled content. Types of recycled materials It’s important to recycle any materials possible, but one of the most relevant is plastic as it is such a big part of the solid waste that we make. When plastic is sent to a landfill, it does not break down as it’s not biodegradable, and even in ocean water, plastic stays around virtually forever, breaking down into smaller and smaller pieces called microplastics. Most plastics are used only once before they are discarded, known as single-use plastics — this type of single-use plastic is already being banned in many parts of the world. Recycling metal is also very important as it saves energy, reduces emissions, and creates jobs. Using recycled metal, known as scrap metal, instead of new metal reduces mining waste by 97% and saves more than 90% on energy, depending on the material. Recycling metals creates six times more jobs than sending the metals to a landfill. The same applies to paper recycling. One ton of recycled paper saves 17 trees and 7,000 gallons of water. It also saves energy, about 4,000 kilowatts of it, enough t power an average American home for six months. Paper takes up a lot of space in landfills, so the more is recycled the better the landfills operate. Like paper, cardboard recycling uses less water, cuts back on emissions, saves prime real estate in landfills for materials that are not recyclable, and prevents deforestation. It is estimated that recycling one ton of cardboard can save 17 trees from harm, and 7,000 gallons of water. Reduce and reuse You may have heard of “The 3 R’s”: Reduce, Reuse, and Recycle. While recycling is important, the most effective way to reduce waste is to not create it in the first place. Making a new product requires a lot of materials and energy and then the product has to be transported to wherever it will be sold. That means reducing and reusing are also important ways to protect the environment. Image via Wikipedia Commons Some of the ways to reduce and reuse include looking for products that use less packaging, which means less raw materials, buying reusable over disposable items, maintaining and repairing products like clothing so they don’t have to be thrown away, as well as borrowing, renting or sharing items that are used infrequently like tools. Reducing our consumption should be the first step, and reusing also tends to be far more sustainable than recycling. Recycling means turning an item into raw materials which can be used again, either for the same product or a new one, while reusing means using an object as it is, without treatment. The reason why recycling is so important is that it prevents pollution, reduces the need to harvest new raw materials, saves energy, reduces greenhouse gas emissions, saves money, reduces the amount of waste that ends up in landfills, and allows products to be used to their fullest extent. Sounds like a no-brainer, eh? If our society wants to truly reach some level of sustainability, recycling needs to play a core role in that, there’s just no alternative. Was this helpful? Thanks for your feedback!","filter_flag":1}
{"title":"BRIDGESTONE DEVELOPS TIRE USING 75% RECYCLED AND RENEWABLE MATERIALS INCLUDING RECYCLED ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMi1QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JyaWRnZXN0b25lLWRldmVsb3BzLXRpcmUtdXNpbmctNzUtcmVjeWNsZWQtYW5kLXJlbmV3YWJsZS1tYXRlcmlhbHMtaW5jbHVkaW5nLXJlY3ljbGVkLXBsYXN0aWMtYm90dGxlcy1yZWN5Y2xlZC1zdGVlbC1hbmQtbmF0dXJhbC1ydWJiZXItZnJvbS11cy1kZXNlcnQtc2hydWItMzAxNzkxMTU5Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMi1QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JyaWRnZXN0b25lLWRldmVsb3BzLXRpcmUtdXNpbmctNzUtcmVjeWNsZWQtYW5kLXJlbmV3YWJsZS1tYXRlcmlhbHMtaW5jbHVkaW5nLXJlY3ljbGVkLXBsYXN0aWMtYm90dGxlcy1yZWN5Y2xlZC1zdGVlbC1hbmQtbmF0dXJhbC1ydWJiZXItZnJvbS11cy1kZXNlcnQtc2hydWItMzAxNzkxMTU5Lmh0bWzSAQA?oc=5","id":"CBMi1QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JyaWRnZXN0b25lLWRldmVsb3BzLXRpcmUtdXNpbmctNzUtcmVjeWNsZWQtYW5kLXJlbmV3YWJsZS1tYXRlcmlhbHMtaW5jbHVkaW5nLXJlY3ljbGVkLXBsYXN0aWMtYm90dGxlcy1yZWN5Y2xlZC1zdGVlbC1hbmQtbmF0dXJhbC1ydWJiZXItZnJvbS11cy1kZXNlcnQtc2hydWItMzAxNzkxMTU5Lmh0bWzSAQA","guidislink":false,"published":"Thu, 06 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=96, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi1QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JyaWRnZXN0b25lLWRldmVsb3BzLXRpcmUtdXNpbmctNzUtcmVjeWNsZWQtYW5kLXJlbmV3YWJsZS1tYXRlcmlhbHMtaW5jbHVkaW5nLXJlY3ljbGVkLXBsYXN0aWMtYm90dGxlcy1yZWN5Y2xlZC1zdGVlbC1hbmQtbmF0dXJhbC1ydWJiZXItZnJvbS11cy1kZXNlcnQtc2hydWItMzAxNzkxMTU5Lmh0bWzSAQA?oc=5\" target=\"_blank\">BRIDGESTONE DEVELOPS TIRE USING 75% RECYCLED AND RENEWABLE MATERIALS INCLUDING RECYCLED ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BRIDGESTONE DEVELOPS TIRE USING 75% RECYCLED AND RENEWABLE MATERIALS INCLUDING RECYCLED ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMi1QFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2JyaWRnZXN0b25lLWRldmVsb3BzLXRpcmUtdXNpbmctNzUtcmVjeWNsZWQtYW5kLXJlbmV3YWJsZS1tYXRlcmlhbHMtaW5jbHVkaW5nLXJlY3ljbGVkLXBsYXN0aWMtYm90dGxlcy1yZWN5Y2xlZC1zdGVlbC1hbmQtbmF0dXJhbC1ydWJiZXItZnJvbS11cy1kZXNlcnQtc2hydWItMzAxNzkxMTU5Lmh0bWzSAQA?oc=5\" target=\"_blank\">BRIDGESTONE DEVELOPS TIRE USING 75% RECYCLED AND RENEWABLE MATERIALS INCLUDING RECYCLED ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Tires comprised of 37% recycled and 38% renewable materials are designed for the next generation of electric SUVs and crossover vehicles. Bridgestone plans to work with automakers on joint testing and market development throughout 2023. Bridgestone is also in the process of developing tires comprised of 90% recycled and renewable materials for passenger cars. NASHVILLE, Tenn., April 6, 2023 \/PRNewswire\/ -- Bridgestone Americas (Bridgestone) announced today it has produced a run of demonstration tires made with 75%*1 recycled and renewable materials, including synthetic rubber made with recycled plastics and natural rubber*2 harvested from desert shrubs grown domestically, in the Arizona desert. The company has completed production of 200 demonstration tires and is pursuing joint evaluation with automakers for use on the next generation of electrified SUVs and crossovers (CUVs). Bridgestone has produced a run of demonstration tires made with 75% recycled and renewable materials, including synthetic rubber made with recycled plastics and natural rubber harvested from desert shrubs grown domestically, in the Arizona desert. The company's relentless commitment to its goal of using 100% sustainable materials in its products by 2050*3 was underscored in remarks by Bridgestone Global CEO, Shuichi Ishibashi, during a February 16 briefing with media and industry analysts in Tokyo where Bridgestone also announced that it is pursuing a tire design utilizing 90% recycled and renewable materials for passenger cars. Designed and engineered at Bridgestone's Americas Technology Center in Akron, Ohio, the new tires were produced at the company's Aiken County Passenger\/Light Truck Radial Tire Plant in Graniteville, South Carolina. The Aiken plant is the first tire manufacturing facility in America to earn International Sustainability and Carbon Certification (ISCC) PLUS certification for transparency and traceability of sustainable raw materials including bio, bio-circular and circular-based material. Aiken also operates an on-site, 8-acre solar array that provides renewable energy to aid in powering the plant's manufacturing operations. \"As we progress in our transformation to a sustainable solutions company, we are making incredible progress in the use of recycled and renewable materials to bring sustainable tire technology from the drawing board to the driveway,\" said Paolo Ferrari, president & CEO, Bridgestone Americas. \"The production and deployment of a 75-percent recycled and renewable materials tire technology marks a significant milestone as we accelerate our progress toward using fully sustainable materials in our products by 2050.\" 75% Recycled and Renewable Materials The tires contain a multitude of materials derived from recycled and biobased feedstocks. These include recycled monomer, produced with recycled materials including plastic bottles, to create the synthetic rubber in the tire1 as well as recycled steel, recycled carbon black, TPO*4-derived carbon black, and bio-based carbon black.*5 Multiple materials are ISCC PLUS certified. The new tire is the first street tire to utilize natural rubber derived from the guayule desert shrub cultivated at Bridgestone's guayule R&D agricultural facility in Eloy, Arizona. Bridgestone has spent more than 10 years and over $100 million on the research and development of guayule as an alternative to imported natural rubber from the Hevea Brasiliensis tree grown mainly in Southeast Asia. Guayule can serve as an alternative to existing crops, such as alfalfa and cotton, in America's drought-stricken desert southwest, requiring as little as half the water to cultivate. Guayule is part of Bridgestone's plan to achieve carbon neutrality and make tires from 100% sustainable materials by 2050. The company is targeting commercial production of guayule-derived natural rubber by the end of the decade. Bridgestone's development of the 75% recycled and renewable materials tire aligns with the Bridgestone E8 Commitment that consists of 8 Bridgestone-like values starting with the letter \"E\" (Energy, Ecology, Efficiency, Extension, Economy, Emotion, Ease and Empowerment) to help realize a more sustainable society. *1 38% Renewable, 37% Recycled Content *2 The natural rubber contains hevea and guayule *3 Sustainable materials are those that: (1) come from resources with a continual supply; (2) can be used as part of the business over the long term; and (3) have a low environmental and social impact over their lifecycle from procurement to disposal *4 Tire Pyrolysis Oil *5 ISCC certified Bio, bio-circular and circular butadiene rubber, styrene butadiene rubber and oil extended styrene butadiene rubber. (Sustainable content is allocated using the ISCC mass balance approach). About Bridgestone Americas, Inc.: Bridgestone Americas, Inc. is the U.S.-based subsidiary of Bridgestone Corporation, a global leader in tires and rubber, building on its expertise to provide solutions for safe and sustainable mobility. Headquartered in Nashville, Tenn., Bridgestone Americas employs more than 50,000 people across its worldwide operations. Bridgestone offers a diverse product portfolio of premium tires and advanced solutions backed by innovative technologies, improving the way people around the world move, live, work and play. SOURCE Bridgestone Americas, Inc.","filter_flag":1}
{"title":"Setting Buy Clean Standards to Green US Steel - Rocky Mountain Institute","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcm1pLm9yZy9zZXR0aW5nLWJ1eS1jbGVhbi1zdGFuZGFyZHMtdG8tZ3JlZW4tdXMtc3RlZWwv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcm1pLm9yZy9zZXR0aW5nLWJ1eS1jbGVhbi1zdGFuZGFyZHMtdG8tZ3JlZW4tdXMtc3RlZWwv0gEA?oc=5","id":"CBMiPmh0dHBzOi8vcm1pLm9yZy9zZXR0aW5nLWJ1eS1jbGVhbi1zdGFuZGFyZHMtdG8tZ3JlZW4tdXMtc3RlZWwv0gEA","guidislink":false,"published":"Thu, 27 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=117, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcm1pLm9yZy9zZXR0aW5nLWJ1eS1jbGVhbi1zdGFuZGFyZHMtdG8tZ3JlZW4tdXMtc3RlZWwv0gEA?oc=5\" target=\"_blank\">Setting Buy Clean Standards to Green US Steel<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Setting Buy Clean Standards to Green US Steel - Rocky Mountain Institute","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vcm1pLm9yZy9zZXR0aW5nLWJ1eS1jbGVhbi1zdGFuZGFyZHMtdG8tZ3JlZW4tdXMtc3RlZWwv0gEA?oc=5\" target=\"_blank\">Setting Buy Clean Standards to Green US Steel<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Rocky Mountain Institute<\/font>","source.href":"https:\/\/rmi.org","source.title":"Rocky Mountain Institute","query":"https:\/\/news.google.com\/rss\/search?q=\"Recycled content\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Shares Setting Buy Clean Standards to Green US Steel Buy Clean Standards must be designed correctly to lower emissions without driving domestic steel manufacturing out of business. The Inflation Reduction (IRA) act contains billions in direct investments to decarbonize US industrial manufacturing and pilot procurement of low-carbon steel, concrete, and other widely used construction materials across key federal agencies. This is all under the umbrella of Buy Clean — an ambitious Biden administration strategy to use the purchasing power of the government to reduce the climate footprint of infrastructure projects and strengthen US industry. The new climate law tasks the Environmental Protection Agency (EPA) with developing first-ever climate performance standards for Buy Clean across priority materials categories, defining what constitutes “clean” for federally funded public works projects. To be effective, Buy Clean programs must encourage near-term emissions reductions while creating a longer-term pathway to deep decarbonization (emissions cuts of 70 percent or greater, all the way to zero emissions or near-zero emissions industrial manufacturing) across critical domestic industrial manufacturing sectors. This is especially critical in the steel sector, where carbon intensity varies significantly based on the method of steel production. Designed poorly, Buy Clean could drive segments of the domestic steel manufacturing industry out of business without lowering the overall emissions intensity of the industry. Designed well, Buy Clean for steel can accelerate decarbonization, serving as a major incentive for clean, globally competitive manufacturing and high-quality jobs. To thread this needle, the EPA must design policies that don’t simply leak emissions abroad or produce other unintended consequences that may inadvertently hurt climate goals. This will require the agency to take a flexible approach that is both responsive to the current state of the steel industry and evolves over time in alignment with industry transformation. Highlights While scrap steel can meet growing steel demand to an extent, US domestic primary steel production will still be a key component of the steel industry in 2050. US primary steel producers are key partners in decarbonizing the steel sector, as investments in decarbonizing primary steel production are necessary to achieve national climate goals. Recycled content reporting can support fair emissions target-setting: As EPA develops Buy Clean standards for procurement of steel, it should — from the outset — prioritize transparency around the recycled scrap content in specific steel products (e.g., rebar, plate steel) as a reported parameter in environmental product declarations (EPDs). Once actual recycled content and raw material input reporting is a standard practice, emissions standards for the steel industry can be set using a sliding scale that accounts for the fraction of primary and secondary steel OR separate targets for these component parts. It is appropriate to set near-term emissions targets based on product-categories rather than on manufacturing process. The EPA should prevent bifurcation of product category rule development in the steel industry by manufacturing process, which could reduce comparability of EPDs in the future. In the nearest-term, targets can be set using estimated average recycled content in steel product types. Near-term product-based standards should be set in such a way as to avoid driving demand away from primary steelmaking facilities, but at the same time begin to push basic oxygen furnace (BOF) facilities to adopt best practice emissions reduction strategies. Steel Manufacturing Today In today’s industry, steelmaking is a mix of primary manufacturing (from ore) and recycling. In primary steelmaking, iron ore is processed using an integrated blast furnace\/basic oxygen furnace (BF\/BOF) system, or in a direct reduced iron (DRI) plant. In a BF, coke (a fuel derived from coal) is burned to chemically reduce iron ores at temperatures of up to 1300 °C. Carbon dioxide (CO 2 ) is emitted both in heating the ore and in chemical reactions with it. In DRI, a reducing gas (e.g., hydrogen) reacts at lower temperatures with iron ore to make sponge iron, which can then be briquetted and used in an electric arc furnace (EAF). In secondary steelmaking, an EAF is used to melt existing steel, primarily steel scrap, and recycle it into a new steel product. This use less energy per ton of steel and results in substantially fewer emissions than the BF\/BOF route, but it is limited by the supply of DRI products and steel scrap. While globally more than 70 percent of steel is produced using the BF\/BOF route and about 30 percent of steel is DRI\/EAF or scrap\/EAF, the ratio is roughly the inverse in the United States, where EAF facilities dominate the industry. Exhibit 1: Processes for Primary and Secondary Steelmaking Critically, EAF steelmaking does require non-scrap inputs in the form of pig iron (BF) or sponge iron (DRI) to achieve the desired chemical composition of the steel. The amount of iron in production at EAFs varies. The sourcing of pig iron can be problematic, as companies recently had to grapple with supplies coming from Russia and Ukraine. Setting aside the horrific nature of the Russian invasion of Ukraine, the production of iron in these two countries often rates as the dirtiest in the world. In contrast, most DRI has been produced domestically in the United States or imported from nearby (e.g., Trinidad and Tobago). The EPA must take special care to understand the full impact of the inputs into steelmaking and in setting initial standards. Steel recycling can help mitigate emissions, especially if the EAFs used to melt steel scrap run on zero-carbon electricity. However, it is not possible to supply the world’s steel needs using the EAF route alone because EAFs do not make new steel, but rather melt existing steel to make new products. While scrap steel can meet growing steel demand to an extent, US domestic primary steel production will still be a key component of the steel industry in 2050. Decarbonizing the US steel industry thus requires credible pathways to slash emissions from primary steelmaking. Exhibit 2: Projected Composition of US Crude Steel Production RMI Chart. Data: RMI Analysis The Role of Buy Clean Standards in Steel Decarbonization For the reasons outlined above, US primary steel producers are key partners in this effort, as investments in decarbonizing primary steel production are necessary to achieve national climate goals. However, poorly designed Buy Clean standards risk shifting demand away from the BF\/BOF production route in the short term, compromising the primary steelmakers’ ability to invest in decarbonization, while not meaningfully changing the emissions profile of the US steel industry. Take the example of hollow structural steel sections. Hollow structural sections are made with steel slabs. These slabs can be made using the BF\/BOF or the EAF route. The emissions intensity of these products will depend on the share of primary metal and scrap metal in those products, yet it bears repeating that not the entire demand for structural steel products can be met with EAFs. Nearly all hollow structural steel products made via the BOF process, however, will have higher emissions than those made via EAFs. Early Buy Clean emissions standards for steel products are being set based on a percentile of the industry average emissions reported in environmental product declarations (EPDs) for a product category, such as hollow structural steel sections. In the near term, these product-based standards should be set in such a way as to avoid driving demand away from primary steelmaking facilities, but at the same time begin to push BOF facilities to adopt best practice emissions reduction strategies. The EPA should prevent bifurcation of product category rule development in the steel industry by manufacturing process, which could reduce comparability of EPDs in the future. However, as the EPA tightens Buy Clean emissions standards over time, it will be increasingly difficult for primary steelmakers to compete head-to-head with EAF-made steel. One unintended consequence could be that BOF manufacturers increase the ratio of scrap steel in their products (up to a practical limit of roughly 30 percent) without fundamentally shifting production practices at the BOF steel facility. Another could be that buyers move to purchase exclusively from EAF facilities, reducing business at BOF facilities at a time when critical decarbonization investments are needed. Both scenarios would lead to simple reshuffling of emissions without significant decarbonization in the sector. Avoiding this will require the EPA to adopt a dynamic approach to setting Buy Clean emissions standards for steel, based on more accurate reporting of recycled content in EPDs. A Proposed Approach to Buy Clean Standard Setting One way to approach setting emissions standards for steel products is to use the share of primary and scrap steel in the final product in conjunction with the separate decarbonization trajectories for each. Consider again the case of the hollow structural steel sections. Internal analysis conducted by RMI shows that hollow steel section products made domestically in the United States are comprised of roughly 50 percent scrap steel on average — a ratio that is expected to shift over time. Assume you are trying to set a standard for hollow steel sections for the year 2030. According to the International Energy Agency’s Net Zero Emissions by 2050 Scenario, the emissions intensity for primary steelmaking in 2030 is 1.8 tCO 2 \/t of steel and 0.3 tCO2\/t of steel for scrap-based secondary steelmaking. Exhibit 3: Projected Average Composition of US Produced Hollow Structural Sections RMI Chart. Data: RMI Analysis Rather than setting a static emissions intensity standard, the EPA could adjust standards for products with higher or lower recycled content. For example, for a hollow structural section with 60 percent scrap steel content, the emissions intensity standard could be 0.9 tCO 2 \/t of steel (1.8 x 40 percent + 0.3 x 60 percent). For hollow steel sections with a higher scrap content, the standard could be lower. If the reported emissions intensity for the hollow section includes emissions from fabrication processes, an average emissions intensity value for fabricating the steel can be added to the calculated standard of 0.9 tCO 2 \/t of steel. This ensures that the reported data and the calculated standard both are easily comparable. As the EPA develops Buy Clean standards for procurement of steel, it should — from the outset — prioritize transparency around the recycled scrap content in specific steel products (e.g., rebar, plate steel) as a reported parameter in EPDs, as well as the sourcing of key raw material inputs such as pig iron. To ensure standardization across EPDs, the agency should work with product category rule program operators in the steel industry to determine a standardized approach for including recycled content as a reported parameter in EPDs. In the nearest-term, targets can be set using estimated average recycled content in steel product types. Once actual recycled content and raw material input reporting is a standard practice, emissions standards for the steel industry can be set using a sliding scale that accounts for the fraction of primary and secondary steel OR separate targets for these component parts. The EPA should signal its intent to proceed flexibly and adjust standards in a manner that is responsive to changes in the industry over time. In the long-run, to achieve deep decarbonization and ultimately near-zero emissions by midcentury, primary steelmakers — currently using the BF\/BOF process — must undertake significant decarbonization efforts. Buy Clean standards should incentivize and help accelerate the adoption of key decarbonization technologies. The EPA should continuously review targets over time to account for shifts in the industry. Eventually, as emissions intensities converge, it may be appropriate for the EPA to establish a single embodied emissions standard for steel products purchased under Buy Clean regardless of the ratio of primary to scrap steel. Exhibit 4: IEA Net-Zero Emissions Intensity Trajectories — Global Average RMI chart. Data: IEA NZE data Technology Pathways to Decarbonize US Steel There are multiple potential pathways for zeroing out emissions from primary steelmaking. One is by replacing a BOF with an EAF powered by zero-carbon electricity, and replacing a BF with DRI via a process that runs on 100 percent hydrogen. To the extent that the hydrogen is “green” (i.e., that it is produced in a process powered by 100 percent or near 100 percent renewable electricity), the process would result in nearly emissions-free steel. Scaling this technology remains a big challenge, in large part because of the necessary renewables buildout. However, cultivating a domestic green steel industry could be a boon for the US economy and a source of good quality jobs. The economic benefits of such reindustrialization are especially pronounced considering the United States is currently the world’s largest steel importer. And with incentives in the IRA, the United States now has the potential to produce the world’s most competitive low- and zero-carbon steel. Buy Clean and other federal procurement policies must have a line of sight toward incentivizing this transformation in the US steel sector, while mitigating near-term leakage risks. Given the urgency, it will be imperative for the federal government to invest directly in this transition. Recognizing this, Congress made available a historic $6 billion in industrial decarbonization grants via the Department of Energy to decarbonize heavy industrial facilities, including retrofitting or replacing blast furnaces with low-carbon primary steelmaking technology, alongside other federal programs aimed at speeding this industry transition. For their part, American steel producers must urgently focus on reducing emissions over the short, medium, and long term — and adopt deep decarbonization technologies for primary steelmaking.","filter_flag":1}
