{"title":"UNLIMEAT: \"It’s the Perfect Time to Enhance the ‘Deliciousness’ of Alternative Meat\" - vegconomist - the vegan business magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdmVnY29ub21pc3QuY29tL2ludGVydmlld3MvdW5saW1lYXQtcGVyZmVjdC10aW1lLWVuaGFuY2UtZGVsaWNpb3VzbmVzcy1hbHRlcm5hdGl2ZS1tZWF0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdmVnY29ub21pc3QuY29tL2ludGVydmlld3MvdW5saW1lYXQtcGVyZmVjdC10aW1lLWVuaGFuY2UtZGVsaWNpb3VzbmVzcy1hbHRlcm5hdGl2ZS1tZWF0L9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vdmVnY29ub21pc3QuY29tL2ludGVydmlld3MvdW5saW1lYXQtcGVyZmVjdC10aW1lLWVuaGFuY2UtZGVsaWNpb3VzbmVzcy1hbHRlcm5hdGl2ZS1tZWF0L9IBAA","guidislink":false,"published":"Thu, 19 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=292, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdmVnY29ub21pc3QuY29tL2ludGVydmlld3MvdW5saW1lYXQtcGVyZmVjdC10aW1lLWVuaGFuY2UtZGVsaWNpb3VzbmVzcy1hbHRlcm5hdGl2ZS1tZWF0L9IBAA?oc=5\" target=\"_blank\">UNLIMEAT: \"It’s the Perfect Time to Enhance the ‘Deliciousness’ of Alternative Meat\"<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"UNLIMEAT: \"It’s the Perfect Time to Enhance the ‘Deliciousness’ of Alternative Meat\" - vegconomist - the vegan business magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vdmVnY29ub21pc3QuY29tL2ludGVydmlld3MvdW5saW1lYXQtcGVyZmVjdC10aW1lLWVuaGFuY2UtZGVsaWNpb3VzbmVzcy1hbHRlcm5hdGl2ZS1tZWF0L9IBAA?oc=5\" target=\"_blank\">UNLIMEAT: \"It’s the Perfect Time to Enhance the ‘Deliciousness’ of Alternative Meat\"<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">vegconomist - the vegan business magazine<\/font>","source.href":"https:\/\/vegconomist.com","source.title":"vegconomist - the vegan business magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"UNLIMEAT, originating in South Korea and also enjoying success in the USA, is addressing a global issue that needs to be addressed more urgently by our food system, our producers, and our politicians. In the US alone, over 80 billion pounds of food is wasted each year, meaning that 30-40% of America’s annual food supply goes to waste, says founder and CEO Keum Chae Min. In response, the young entrepreneur set out initially in her home country to upcycle unused, “ugly” plants to create plant-based meat products tailored for diverse global cuisines. “We want to accelerate the transition to plant-based eating by making it convenient and delicious for consumers. That is why we’re relentlessly finding ways to expand our offerings, from Korean BBQ to Pulled Pork, Pepperoni, and Dumplings to Katsu, using diverse plant ingredients, not just soy and pea protein,” explains Keum Chae. Barely a single month has passed since UNLIMEAT’S US launch in 2022 that we haven’t reported on interesting developments from this forward-thinking producer of plant-based meats. It was time we got to know Keum Chae to hear more about her journey, motivation, and plans for the future. Can you start by giving us an introduction to UNLIMEAT and its mission? What inspired you to start this company? UNLIMEAT is a company that produces plant-based meat, seafood, dairy products, and various other foods using upcycled materials. I started an upcycled food tech business seven years ago to address the reduction of food waste. My initial business model involved selling upcycled products created with B-grade inventory collected from farms at the first step in the value chain, enhancing the value of said inventory through research and development. I crafted processed fruit and vegetable products from imperfect plums, tangerines, grapes, and apples, while also producing and distributing soups and porridge using “ugly” sweet potatoes, pumpkins, and mushrooms. During this journey, I discovered an abundance of grain inventory in my homeland, South Korea, which inspired me to embark on the development of plant-based meat using these grain resources. This marked the inception of our current brand, UNLIMEAT, a plant-based label that has since flourished. Today, in addition to our plant-based meat offerings, we provide a diverse range of products designed for the enjoyment of all kinds of consumers, including seafood, dairy items, frozen kimbap, and rice balls. How do you assess the current situation in both North America and South Korea in terms of demand for plant-based products? What, in your opinion, does the future hold for meat alternatives? Recently, the alternative meat market has experienced a period of stagnation lasting 2-3 years. In contrast, the plant-based food market is consistently growing by more than 10% each year. Both American and Korean consumers were interested in alternative meats due to their curiosity about ‘technology’ and the appeal of ‘healthy food.’ However, we believe that the alternative meat market will continue to stagnate unless it also focuses on delivering enjoyment, confidence, and satisfaction in the essential aspect of food: ‘deliciousness.’ It’s the perfect time to enhance the ‘deliciousness’ of alternative meat. Consumers are actively seeking out plant-based alternatives, not just for health reasons, but also due to the delicious and innovative options available. Our goal is to provide consumers with the ‘pleasure of taste’ through K-VEGAN concept products like frozen kimbap, rice balls, and mochi cake. Furthermore, we aim to drive the expansion of plant-based foods by evolving beyond mere ‘meat substitutes’ and emphasizing the ‘convenience’ of easy consumption rather than the pleasure of cooking. UNLIMEAT is known for using upcycled ingredients in its plant-based products. Could you tell us more about your approach to upcycling and how it aligns with the company’s philosophy? Although we produce plant-based products, we never forget our mission to upcycle and reduce food waste, which was our initial model. That’s why our plant-based products contain a variety of upcycled ingredients, ranging from as little as 1-2% to more than 10%. As a result, UNLIMEAT products currently span both the plant-based food market (worth USD 75.7 billion) and the food upcycle market (valued at USD 53 billion). Korea produces approximately 10 million tons of food by-products annually, with 70% of them classified as industrial waste, which poses a significant environmental and disposal burden. Among these by-products, 1.5 million tons consist of rice by-products, and approximately 430,000 tons are rice bran. Some of these by-products find use in cosmetics and animal feed. However, a substantial 70% of these materials are discarded as waste, resulting in an annual disposal cost of 7.4 billion won. We procure these by-products from farms and then entrust their primary processing to a manufacturing plant that stabilizes and refines them. Subsequently, they are transformed into plant-based foods at UNLIMEAT Factory, our exclusively plant-based food facility. Our primary goal is to reduce unnecessary costs associated with food disposal. The soybean meal and rice bran we use are rich in nutrients like dietary fiber and protein. Since soybean meal and rice bran are abundant in Korea, our initial products used these ingredients. However, we have recently diversified our upcycling materials to balance UNLIMEAT’s protein content, color, and nutritional value. Particularly for new products, we are expanding our material sources to include not only soybean meal and rice bran but also by-products from potatoes, beets, carrots, and tomatoes. What does a clean label mean to your company, and how do you ensure your products meet these standards? Currently, our products not only comply with U.S. FDA standards but also adhere to the guidelines for prohibited raw materials set by Organic & Natural Mart. We avoid the use of chemical additives like MSG to enhance flavor and focus on creating nutritionally superior products with higher protein and carbohydrate content. How are your products performing in various markets? How has your entrance in the US been received in comparison to your home market, and are there any expansion plans for further markets or retailers? We have been active in Korea and Asia for about three years, and we are proud of the meaningful results we have achieved during this time. Our signature product, Korean BBQ, has been used in vegan options at major franchises like Subway, Domino’s, and Quiznos in Korea. Sukiya in China, one of the three major gyudon chains, has launched vegan gyudon menu items featuring our product, and IKEA has done so as well. We have been engaging with consumers in the U.S. market through retail channels, offering a range of products including plant-based Korean BBQ, pulled pork, dumplings, and beef jerky since the beginning of this year. UNLIMEAT products are now available in 1,300 retail stores across the United States, including Albertsons. Additionally, they have recently been introduced in several organic and natural stores, such as Berkeley Bowl, Mollie Stone’s Market, Lassens in California, and Good Earth Market in Utah. We also introduced Korean-style corn dogs made with UNLIMEAT sausage through Two Hands’ hot dog franchise stores located throughout the United States. Looking ahead, we plan to introduce our diverse product range to consumers across the United States through e-commerce platforms like PlantX, Amazon, and our own online store. Furthermore, through the expansion of the food service channel, our aim is to incorporate UNLIMEAT products into a diverse range of menus tailored to cater to the localized tastes of American consumers. We are also expanding our reach to provide consumers with the opportunity to savor our products through food trucks. What is your current portfolio and are there any innovations in the pipeline? As of now, UNLIMEAT offers a diverse portfolio of plant-based products. Our current lineup includes options such as Korean BBQ, pulled pork, dumplings, beef jerky, and tuna, among others. These products are designed to provide consumers with a wide range of flavors and experiences beyond traditional meat alternatives, catering to various culinary preferences. We aim to take an extra step forward and are dedicated to developing products that make it even more convenient for consumers to enjoy our food. This initiative begins with the creation of ready-to-heat K-food meals such as frozen kimbap, rice balls, and bulgogi. Unlike other plant-based brands that typically offer only burger patties and chicken nuggets, UNLIMEAT introduces new gastronomic experiences to consumers with items such as Bulgogi, pulled pork, dumplings, beef jerky, and tuna. We firmly believe that igniting curiosity beyond the usual meat textures and providing a distinctive and delightful experience to consumers who enjoy Korean cuisine represents a unique competitive advantage and a strategic approach to expanding our retail presence. In addition to traditional favorites like sliced beef-type Korean BBQ and pulled pork, you also offer plant-based alternatives like tuna and jerky. How do these products contribute to expanding the choices for MZ consumers seeking diverse plant-based options? Millennials and Gen Z prioritize sustainability, health, and wellness, making them more inclined than any previous generation to adopt flexitarian diets, including vegan or vegetarian lifestyles. They also exhibit a willingness to explore new and authentic cuisines from different countries. I believe that our products are well-catered to the needs of Millennials and the Z Generation. Millennials and Gen Z consumers desire a wide range of plant-based foods to savor diverse flavors. UNLIMEAT’s versatile products can be incorporated into a variety of dishes suitable for different situations, including snacks, breakfast, picnics, beer festivals, and lunch boxes, among others. This contributes to the promotion of a healthy lifestyle among the generation, who also favor a variety of nutritious foods. What’s next for UNLIMEAT? Are there any future plans that you’d like to highlight? We are Korea’s leading plant-based food company, and we take pride in our competitive edge in developing and manufacturing the most delicious K-vegan products. Our future plans include the continued introduction of healthy and delicious ‘vegetable foods’ through clean label and K-vegan concept products. Similar to our recent collaboration product with Just Egg, which marked the beginning of our brand collaborations, we intend to introduce a variety of new products through collaborations with other brands in the future.","filter_flag":1}
{"title":"Fresh Thyme Market Reveals Inaugural Top Ten Food Trends for 2024 - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZnJlc2gtdGh5bWUtbWFya2V0LXJldmVhbHMtaW5hdWd1cmFsLXRvcC10ZW4tZm9vZC10cmVuZHMtZm9yLTIwMjQtMzAxOTUxNzk1Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZnJlc2gtdGh5bWUtbWFya2V0LXJldmVhbHMtaW5hdWd1cmFsLXRvcC10ZW4tZm9vZC10cmVuZHMtZm9yLTIwMjQtMzAxOTUxNzk1Lmh0bWzSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZnJlc2gtdGh5bWUtbWFya2V0LXJldmVhbHMtaW5hdWd1cmFsLXRvcC10ZW4tZm9vZC10cmVuZHMtZm9yLTIwMjQtMzAxOTUxNzk1Lmh0bWzSAQA","guidislink":false,"published":"Tue, 10 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=283, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZnJlc2gtdGh5bWUtbWFya2V0LXJldmVhbHMtaW5hdWd1cmFsLXRvcC10ZW4tZm9vZC10cmVuZHMtZm9yLTIwMjQtMzAxOTUxNzk1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Fresh Thyme Market Reveals Inaugural Top Ten Food Trends for 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Fresh Thyme Market Reveals Inaugural Top Ten Food Trends for 2024 - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvZnJlc2gtdGh5bWUtbWFya2V0LXJldmVhbHMtaW5hdWd1cmFsLXRvcC10ZW4tZm9vZC10cmVuZHMtZm9yLTIwMjQtMzAxOTUxNzk1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Fresh Thyme Market Reveals Inaugural Top Ten Food Trends for 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Community-Focused Grocer Provides Fresh Predictions on Local Midwest Shopping Habits DOWNERS GROVE, Ill., Oct. 10, 2023 \/PRNewswire\/ -- Fresh Thyme Market , a grocer with a mission to provide communities with real quality fresh food, vitamins, and body care products, is unveiling its first trends report with a focus on Midwest shopping behaviors and brands. The report's 10 insights offer a glimpse into the emerging trends that shoppers can expect to see in each aisle of the store next year. Fresh Thyme Market releases 2024 Trends Report highlighting up-and-coming products shoppers can expect to see in each aisle of the store next year. Fresh Thyme Market's promise of \"Real. Fresh. Honest. Goodness.\" remains constant as consumer food trends continue to evolve. Fresh Thyme Market is committed to offering real, fresh products inspired by its local communities that give consumers confidence to create delicious and healthy lives. Fresh Thyme Market ensures that shoppers can trust the hand-selected items they find in Fresh Thyme Market's 70 stores. To purchase these on-trend products, check out Fresh Thyme Market's website for easy and convenient shopping both online and in-store. This comprehensive analysis provides valuable insights from SPINS Research. For more information on Fresh Thyme Market, visit ww2.FreshThyme.com and for more information on SPINS Research, visit spins.com . About Fresh Thyme Market Fresh Thyme Market, a local, community-focused grocer with 70 stores in 10 states throughout the Midwest, was born from a genuine desire to help people live better and healthier lives. Every day Fresh Thyme Market works to be a trusted resource in our communities, bringing people access to real food at real affordable prices. With a local focus on what the community needs, each store provides fresh, natural, and organic food at affordable prices. By offering an immersive, intuitive shopping experience, Fresh Thyme Market meets people wherever they are on their journey to living a healthier lifestyle. To learn more, visit freshthyme.com . About SPINS For 20 years, we have been on a mission to increase the presence and accessibility of Natural and better-for-you products that help people live their healthiest and best lives and drive sustainable production practices in North America. From our founding in 1997 to now, our data and industry definitions have become the common language of the Natural Products Industry, helping brands communicate their growth to retailers to scale their distribution and helping retailers understand and maintain their points of difference. As the Natural Products Industry has emerged as a driving force of retail in the US, we have been thrilled to be part of a movement… watching the Natural Products Industry double in size again…and again to a $137B market. To learn more, visit spins.com . Media Contact: Anna McAndrew (847) 224-8113 [email protected] SOURCE Fresh Thyme Market","filter_flag":1}
{"title":"The plastipelago - New Mandala","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3Lm5ld21hbmRhbGEub3JnL3RoZS1wbGFzdGlwZWxhZ28v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3Lm5ld21hbmRhbGEub3JnL3RoZS1wbGFzdGlwZWxhZ28v0gEA?oc=5","id":"CBMiLGh0dHBzOi8vd3d3Lm5ld21hbmRhbGEub3JnL3RoZS1wbGFzdGlwZWxhZ28v0gEA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3Lm5ld21hbmRhbGEub3JnL3RoZS1wbGFzdGlwZWxhZ28v0gEA?oc=5\" target=\"_blank\">The plastipelago<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">New Mandala<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The plastipelago - New Mandala","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3Lm5ld21hbmRhbGEub3JnL3RoZS1wbGFzdGlwZWxhZ28v0gEA?oc=5\" target=\"_blank\">The plastipelago<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">New Mandala<\/font>","source.href":"https:\/\/www.newmandala.org","source.title":"New Mandala","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Given the heterogeneity, tonnage and toxicity of modern waste, a convincing argument could be made for waste as the inscription of the Anthropocene. Even though it is both organic and inorganic waste that contribute to the transition to this new planetary epoch—in which human activity has become the dominant force shaping Earth’s climate and ecosystem—it is the chemical composition, durability and omnipresence of plastics that make some scholars designate our age as the Plasticene. Considering that Indonesia is ranked as the world’s second-biggest marine plastic polluter, one might refer to this large archipelagic country as plastipelago. Indeed, a comparable designation was made by Dandhy Dwi Laksono and Rahung Nasution for their documentary film Pulau Plastik (“Plastic Island”) that explores the magnitude of plastic pollution in Indonesia. However, the postulated age of the Plasticene should denote not only our plastic footprint and its impact on both people and the environment, but also the pliability of contemporary waste management regimes, where waste can be seen as both a problem and an opportunity. What this ambiguity shows is that our modern waste is not only difficult to handle, but also difficult to define. This is especially so in Indonesia, where more than half of the country’s population is still without access to basic waste collection services, and where the government of President Joko Widodo is promoting the economic value of waste as part of a wider effort to address the country’s waste crisis. With Indonesia standing at a critical juncture of a waste crisis, one should welcome the fact that in 2017, the Indonesian government has adopted the universally popular anti-waste strategy known as the “circular economy” as the new paradigm for its national policy on the management of solid waste. Known as Indonesia Clean from Waste (ICFW), the aim of this policy is to reduce by 30% the total annual production of waste by 2025, and to handle the remaining 70% according to environmentally friendly and effective technologies. In the province of West Nusa Tenggara (NTB), where I conducted my doctoral field research on the island of Sumbawa, the government of Governor Zulkieflimansyah has translated this policy into an implementing regulation at the provincial level under the flagship name of NTB Zero Waste. Here, the term “zero waste” is used to communicate the goal of waste prevention, while the notion of circular economy refers to specific mechanisms through which to achieve that objective. Unlike the current linear economic model of “take–make–dispose”, the circular economy recognises that natural resources are finite and aims to eliminate waste by keeping materials in circulation for as long as possible, through strategies such as reusing, recycling and responsible manufacture. This said, the circular economy can play an important role both in making waste management systems more resilient and in strengthening national self-sufficiency by lowering of the import demand of virgin and secondary materials. In Indonesia alone, this could mean reducing the amount of waste going to landfills and increasing the quality and quantity of locally sourced plastics as “feedstock” for recycling and thus reducing the country’s dependence on waste imports. While waste imports to Indonesia are small compared to the total production of waste in the country, they too have a negative impact on Indonesia’s environment and society. Overall, the aim of the circular economy is to close loops of resource flows by galvanising people and industries into “durable” entities able to turn waste into a resource. This ambition can be seen in the words of Siti Nurbaya Bakar, the Minister of Environment and Forestry (MoEF), who in 2021 said that now is the time “to manage waste in ways that can make a real contribution to economic growth”. This was echoed by the Vice-Governor of NTB, Sitti Rohmi Djalilah, who argued that waste cannot be seen as a problem; instead, it has to be managed as a blessing. There is, of course, an inherent incongruity in this statement, for “blessing”, by definition, does not have to be managed. Here, by drawing on data from my doctoral thesis, I trace the development of the ICFW policy through the policy’s processes of problem definition to solution design so as to identify some of the key challenges and (limits) of this naïve and hasty rebranding of waste as resource. Problem definition Broadly speaking, public policies are enacted following the problematisation of an issue. Often expressed in the form of a crisis, an issue is something that can be defined as unwanted outcomes of an action (or lack thereof) that affect a certain group of people. However, crisis is not merely a moment of panic but also an opportunity for reflection in the sense of a critical moment that can lead to social change. There are two distinct, yet interrelated crises that led to the enactment of the ICFW policy. The first refers to the actual crisis of waste that is manifested most viscerally in the country’s clogged up rivers, filthy beaches, toxic air and overflowing landfills. For illustration, the material evidence of such crisis can also be found in more obscure places, such as local abattoirs—where it is common for Indonesian meat merchants to find plastic discards in animal entrails. While these plastics will not be consumed by humans, which is why they have been put aside following their discovery, the toxins and chemicals that are associated with these materials can undoubtedly enter our food chain through a process known as “trophic transfer”. There are multiple reasons why finding plastics in the stomachs of beef cattle is anything but uncommon for abattoir workers in Indonesia. Given the lack of available grasslands caused by changes in land function, some cattle herders in Indonesia use landfills as “pastures” for their livestock. By doing so they help to reduce the amount of food waste in Indonesian landfills, for there is little incentive to valorise organic waste in Indonesia, due to the country’s fertiliser subsidy policy. In this context, this animal infrastructure is sustained insofar as it helps to sustain human livelihood and reduce the pressures put on landfills due to increased food consumption. However, animals do get sick as their digestive systems become clogged up with plastics. Due to high rates of littering along riverbanks and roadsides, it is common nowadays to also find plastic discards in the entrails of cows that feed on grasslands. Perhaps the most littered (and landfilled) items in Indonesia, single-use plastic bags are used excessively not only in traditional markets and modern retails in urban centres, but also by vendors and their customers in more remote rural areas. The second crisis refers to the crisis of reputation that was sparked by a study conducted by a group of scientists led by Jenna R. Jambeck from the University of Georgia (USA) that gave Indonesia the stigmatising label of the world’s second-biggest contributor to marine plastic pollution, after China. At first, the government of Indonesia tried to dispute this study by proposing to make its own research on the matter of marine plastic pollution. Such protestation was, according to Dr Dirhamsyah—the Director of Research Centre for Oceanography at the Indonesian Institute of Sciences (LIPI)—a matter of Indonesia’s reputation. Nevertheless, a detailed examination of a range of government and academic publications shows clearly the influence that Jambeck’s study had on the enactment of the ICFW policy. With the need to clean the nation not only from its waste, but also from the stain on its reputation, the architects of the ICFW policy relied on the characterisation of waste as a major problem. Hence, it is no surprise that in Indonesia, like elsewhere in the world, waste is often represented as a monster. Related Power, illegality and impunity in Indonesia’s plantation zone Palm oil companies can act with impunity because of corporate–state collusion and a lack of organised resistance. This evocation can be seen, for example, in Riyana Rizki’s online fairy tale Raksasa Sampah di Kerajaan Lolontar (Garbage Monster in Lolontar Kingdom). In this short story, the Queen of Lolontar is shocked as she witnesses her people running away from a giant creature made from littered garbage. With an heirloom sword in her hand, the Queen runs towards the garbage monster and slays it with a single slash. “This is the result of your littering”, the Queen says to her people as a cloud of thick black smoke escapes from the monster’s body. Shaken by the experience and ashamed of their habits, the people of Lolontar promise not to litter again. Here, as in Indonesia, the problem of waste is attributed, in large part, to littering behaviour. However, this failure to keep discards within the technopolitical domain of manageable waste should be understood as having an array of causal factors. These include the country’s shift to a consumption-oriented economy and the resulting changes in consumption practices from biodegradable to plastic materials, as well as the failure to meet these transformations with necessary developments in waste management infrastructure and environmental education. Another reason why this tale is interesting is because it chooses a female leader to confront both the monster and the immoral actions of the populace. This reflects quite nicely on the fact that women in Indonesia are the key agents of kebersihan (cleanliness). This gendered division of labour in waste management can be seen not only in the brushing, sweeping, dusting and washing activities of Indonesian women across different cultural groups, but also in the relevant positions of authority that are occupied by female leaders. Take, for example, Siti Nurbaya Bakar, the Minister of Environment and Forestry and Rosa Vivien Ratnawati, the Director General of Waste and Toxic Waste Management at the MoEF. In terms of Indonesia’s bureaucratic structures, these two women are the most senior figures responsible for addressing the country’s waste problem by promoting the circular economy, including its ambition to create entrepreneurially-minded individuals who would recognise and take advantage of the economic value of waste. Within such discourse, waste is no longer represented as a problem. Instead, it is seen as an opportunity or a resource. Solution design The most important instrument of the ICFW policy through which to encourage citizens to participate in the circular economy is the waste bank program. Waste banks (bank sampah) are private or semi-private waste collection facilities where people can exchange different recyclables for money or services. At present, there are around 8,000 waste banks in the country, mainly on the highly populated island of Java that is also home to the majority of recycling companies in Indonesia. As part of the enactment of the ICFW policy, the national government has instructed local governments to help establish at least 31,000 new units across the whole of Indonesia by 2025. One key objective behind the desired proliferation of waste banks is to encourage people to separate their waste—a practice that has previously been done exclusively by the highly stigmatised informal waste pickers (pemulung) who collect recyclables at landfills and kerbsides, and then sell their stock to waste collectors (pengepul) further up the supply chain. In terms of the circular economy, separating products and materials at the end of their life cycle is a crucial action for an optimised recycling, for it reduces leakage and contamination. While waste banks can increase public participation and awareness and make waste management systems in Indonesia more resilient, their proliferation across the country is relatively slow and their impact on recycling rates is moderate when compared to the contribution made by those working in the informal sector. In 2021, Siti Nurbaya Bakar claimed that waste management was one of the few businesses sectors in Indonesia that continued to grow during the pandemic. However, it was also claimed, by her Ministry, that waste banks reported a significant drop in revenue during this crisis, mainly because of social distancing measures. This means that the reason why the waste management sector proved resilient during the pandemic is mostly because of the informal waste workers, especially pemulung, who continued to retrieve recyclables from landfills during the health crisis. It is important to note that some people have joined the informal sector and become pemulung precisely because of the pandemic and the related lack of social security and job opportunities. Even though the informal waste sector forms a vital part of the entities involved in waste management in Indonesia, its contribution to the system has long been unrecognised and uncompensated. Such devaluation stems from the historical association of informal activities with poverty and criminality. For example, during the authoritarian New Order regime (1966–1998), scavenging for waste was made into an illegal activity because it conflicted with modern policies of land-use and town planning. In today’s Indonesia, it is not uncommon to see signs in front of urban neighbourhoods and complexes that read, Pemulung Dilarang Masuk (No Scavengers). The fact that the ICFW initiative makes no consideration for this informal infrastructure, suggests that the policy may not only seek to make Indonesia clean from waste, but also clean from the informal waste sector. This can be seen, for example, in the policy’s strategic plan to establish number of parental waste banks that would be equipped with waste processing technologies (i.e. press and waste shredding machines) needed to process plastics before they could be sold to the recycling companies. This enables waste bank operators to sell plastics within the waste bank family instead of having to go to informal waste collectors who have historically been adept at preparing plastics for recycling. By seeking to circumvent pengepul and by reducing the amount of waste otherwise available to pemulung, the waste bank program is illustrative of how the circular economy and the related commodification and formalisation of waste can lead to the “gentrification of reuse”. Unlike the informal waste sector, waste banks are seen by policymakers as having the potential to nurture environmental and entrepreneurial values among the populace. Hence, besides helping to raise awareness through waste separation, waste banks also serve as places of experimentation where waste bank operators (and their customers) are encouraged to upcycle some of the collected materials into new products, such as grocery baskets, plant pots, handbags, or even paving blocks or bricks, all made, to varying degrees, from plastic waste. These upcycled products are often referred to using the prefix “eco”—hence eco-bricks, eco-paving, eco-fashion and the like. As once noted by Anies Baswedan, the former governor of Jakarta, the terms ecology and economics can actually go hand in hand, because they have same prefix—oikos, or household. While waste banks provide opportunity for waste valorisation, it is the Indonesian household where the initial sorting of waste has to take place. Given that women’s main field of activity in Indonesia has historically been inside the house, this role is often fulfilled by the ibu rumah tangga (housewife). Though most prevalent within the waste bank family, these upcycling principles are being promoted across the wider society, including in formal schooling and rural development programs. There is a lot of enthusiasm around this plastic rush among certain segments of Indonesian society, especially the young. However, turning plastic waste into new and shiny products, such as the paving block seen above, is rarely done with the use of environmentally friendly and effective technologies. Instead, people rely on makeshift devices whereby plastic is melted into a tar that is then moulded into blocks. The heating process relies on the open burning of plastic waste—a practice that takes no consideration for the emission of toxic gases and ash into the air and soil, respectively. Common in rural Indonesia where there is a limited access to basic waste collection services, open incineration of (mixed) wastes is a significant source of pollution. The open burning of plastics is particularly problematic as it is linked with an increased risk of cardiorespiratory and neurological disorders, as well as with toxic contamination of the soil and groundwater. The act of turning plastic waste into paving blocks produces adverse human health and environmental effects. However, these effects are rarely acknowledged by the advocates of these practices. Not all of the upcycling projects that are currently being propagated and practiced in Indonesia as part of the circular economy aspiration rely on the open incineration of plastics. One such example are grocery baskets and handbags that women and children in Indonesia are encouraged to make out of plastic sachets used previously as packaging for food, cosmetic, medicinal and toiletry products. From my observation, these and other upcycling projects often fail, or they end up serving different—often symbolic\/ceremonial—functions. In most cases, it is both the ecological and economic goals that are not realised. Being difficult to valorise, these products regularly end up being discarded. Because they are produced with mixed materials—not only plastic waste, but also new materials, such as tapes, strings, wires, glue and the like—they are unrecyclable. It could be said that making these products increases rather than reduces consumption and waste. In general, these entrepreneurial projects have the capacity to place responsibility for waste in the hands of consumers, rather than producers. This discursive endorsing of creativity has the potential to engender real effects, such as when certain practices and values regarding waste reduction (i.e. extended producer responsibility, and reductions in material throughput and consumption) are valued less than others. This alchemic-like ambition to turn discarded plastics into new objects can also be seen at the hands of government agencies. One such example, is the efforts of the Indonesian Ministry of Public Works and Public Housing (MoPWH) to incorporate discarded single-use plastics into road tar for building national roads in the country. According to Danis Sumadilaga, the head of the Agency for Research and Development at the MoPWH, mixing plastic waste with asphalt will result in stronger and more stable roads. While it is certainly better to have wild plastic discards sequestered inside a road, rather than scattered in the environment or buried deep inside animals’ entrails, this development undoubtedly erects a speed bump on the road towards the nationwide ban on single-use plastics. In other words, mixing single-use plastics with asphalt makes plastic appear as unproblematic. To return to the concept of Plasticene, the plastic road is representative of both the human alteration—the plastification—of the environment, and the blind assumption that the circular economy can coalesce economic growth with sustainability. I would urge policymakers in Indonesia to recognise and acknowledge that waste is indeed a serious problem. Reframing waste as only an economic resource does not convey the urgent need for waste management and waste reduction, nor does it call for greater responsibility among all segments of the populace. What the examples presented here show is that turning plastic discards into new products of economic value is anything but easy. Instead, such efforts often lead to pollution and obstruct meaningful actions aimed at waste prevention. Ensuring that all people have access to basic waste collection services, not only those living in urban areas, would be more effective in reducing waste pollution than encouraging groups and individuals to take advantage of the economic value of waste. This would require the modernisation of existing landfills—the majority of which are mere open dumpsites—and the development of new landfills in the country. This proposition might not be popular in the discourse on circular economy. However, without effective and integrated systems designed to capture and handle waste, waste will inevitably put more pressure on both people and the environment. Such developments should include efforts to incorporate informal waste workers into formal waste management systems. As the case with pemulung showed, policymakers in Indonesia need to take seriously the issue of social justice and equity in the circular economy-inspired transformations.","filter_flag":1}
{"title":"The Employer-Educator Partnership That Can Fill U.S. Jobs - HBR.org Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaGJyLm9yZy8yMDIzLzEwL3RoZS1lbXBsb3llci1lZHVjYXRvci1wYXJ0bmVyc2hpcC10aGF0LWNhbi1maWxsLXUtcy1qb2Jz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaGJyLm9yZy8yMDIzLzEwL3RoZS1lbXBsb3llci1lZHVjYXRvci1wYXJ0bmVyc2hpcC10aGF0LWNhbi1maWxsLXUtcy1qb2Jz0gEA?oc=5","id":"CBMiUGh0dHBzOi8vaGJyLm9yZy8yMDIzLzEwL3RoZS1lbXBsb3llci1lZHVjYXRvci1wYXJ0bmVyc2hpcC10aGF0LWNhbi1maWxsLXUtcy1qb2Jz0gEA","guidislink":false,"published":"Tue, 03 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=276, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaGJyLm9yZy8yMDIzLzEwL3RoZS1lbXBsb3llci1lZHVjYXRvci1wYXJ0bmVyc2hpcC10aGF0LWNhbi1maWxsLXUtcy1qb2Jz0gEA?oc=5\" target=\"_blank\">The Employer-Educator Partnership That Can Fill U.S. Jobs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HBR.org Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Employer-Educator Partnership That Can Fill U.S. Jobs - HBR.org Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaGJyLm9yZy8yMDIzLzEwL3RoZS1lbXBsb3llci1lZHVjYXRvci1wYXJ0bmVyc2hpcC10aGF0LWNhbi1maWxsLXUtcy1qb2Jz0gEA?oc=5\" target=\"_blank\">The Employer-Educator Partnership That Can Fill U.S. Jobs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HBR.org Daily<\/font>","source.href":"https:\/\/hbr.org","source.title":"HBR.org Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"New! HBR Learning Attracting and Cultivating Talent Course Accelerate your career with Harvard ManageMentor®. HBR Learning’s online leadership training helps you hone your skills with courses like Attracting and Cultivating Talent. Earn badges to share on LinkedIn and your resume. Access more than 40 courses trusted by Fortune 500 companies. Discover how to attract, hire, develop, and keep talented people who will grow and thrive throughout their employee journey.","filter_flag":1}
{"title":"Brushes with purpose: Kohl Kreatives eyes growth potential among India's eco-conscious beauty consumers - CosmeticsDesign-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzEwLzAyL3VrLXMta29obC1rcmVhdGl2ZXMtZXllcy1ncm93dGgtcG90ZW50aWFsLWFtb25nLWluZGlhLXMtZWNvLWNvbnNjaW91cy1iZWF1dHktY29uc3VtZXJz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzEwLzAyL3VrLXMta29obC1rcmVhdGl2ZXMtZXllcy1ncm93dGgtcG90ZW50aWFsLWFtb25nLWluZGlhLXMtZWNvLWNvbnNjaW91cy1iZWF1dHktY29uc3VtZXJz0gEA?oc=5","id":"CBMijgFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzEwLzAyL3VrLXMta29obC1rcmVhdGl2ZXMtZXllcy1ncm93dGgtcG90ZW50aWFsLWFtb25nLWluZGlhLXMtZWNvLWNvbnNjaW91cy1iZWF1dHktY29uc3VtZXJz0gEA","guidislink":false,"published":"Mon, 02 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=275, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzEwLzAyL3VrLXMta29obC1rcmVhdGl2ZXMtZXllcy1ncm93dGgtcG90ZW50aWFsLWFtb25nLWluZGlhLXMtZWNvLWNvbnNjaW91cy1iZWF1dHktY29uc3VtZXJz0gEA?oc=5\" target=\"_blank\">Brushes with purpose: Kohl Kreatives eyes growth potential among India's eco-conscious beauty consumers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Brushes with purpose: Kohl Kreatives eyes growth potential among India's eco-conscious beauty consumers - CosmeticsDesign-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5jb3NtZXRpY3NkZXNpZ24tYXNpYS5jb20vQXJ0aWNsZS8yMDIzLzEwLzAyL3VrLXMta29obC1rcmVhdGl2ZXMtZXllcy1ncm93dGgtcG90ZW50aWFsLWFtb25nLWluZGlhLXMtZWNvLWNvbnNjaW91cy1iZWF1dHktY29uc3VtZXJz0gEA?oc=5\" target=\"_blank\">Brushes with purpose: Kohl Kreatives eyes growth potential among India's eco-conscious beauty consumers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Asia.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-asia.com","source.title":"CosmeticsDesign-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Upcycled Products\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The makeup tools brand partnered with beauty e-commerce platform Kult App to enter the India market earlier this month. Its offerings include makeup brushes that are known for its inclusive design for those with motor disabilities, as well as makeup stencil stickers. Kohl Kreatives’ founder Trishna Daswaney told CosmeticsDesign-Asia​ that it observed a demand for products that are sustainable and inclusive, especially among younger consumers, during a pop-up event it co-hosted with Kult App. Price of sustainability​ According to the brand, it is still early days for the sustainable beauty movement in India compared to Western markets in Europe and the United States. However, it believes that consumers are willing to pay a premium for sustainability​ if they understand where the cost has gone to making the products more sustainable. “I feel like there’s this missing knowledge piece around what sustainability means from an order quantity perspective, and how something is made does impact the price. ​ “I think that’s something the Indian consumer is slowly but surely realising the impact. They’re getting to the stage where they’ll eventually catch up with realising our products are not made with a million other units. ​ “It’s bespoke and niche, and it’s also made out of upcycled products. It maybe took us 18 months to collect the ocean waste plastic and make it into an end product. The cost of the raw material is much higher already. So, I think it’s about reinforcing that messaging and how that affects pricing,” ​Daswaney explained. Its makeup stencil sticker costs an average of GBP9.99 (INR1,022) and its makeup brush costs an average of GBP8.99 (INR920). Strategy for India​ Daswaney added that the Indian consumer is a global consumer, and the brand did not have to adapt too much of its marketing or come up with different product offerings when it launched in the market. “While the Indian consumer has a different colour palette, I really do feel that the internet has created a borderless community. We’re heavily invested in the global consumer, and the Indian consumer really fits into that. And honestly, we haven’t change much of our brand to be there.”​ Currently, the brand ships globally via its website, with most of its Asia Pacific customers coming from the South East Asia and Oceania regions. “I think today’s consumer is really e-commerce savvy, especially after the COVID-19 pandemic. I think consumers can find something worthwhile based on the content you see on Instagram and TikTok where they can understand what one’s experience of the products would be. They’re willing to try and invest in something that is digitally presented to them.”​ The brand is planning to set up more physical pop-up events and offer less traditional experiences within the country to connect with its customers.","filter_flag":1}
