{"title":"Europe needs to listen to the unusual suspects - E3G","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmUzZy5vcmcvbmV3cy9ldXJvcGUtbmVlZHMtdG8tbGlzdGVuLXRvLXRoZS11bnVzdWFsLXN1c3BlY3RzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmUzZy5vcmcvbmV3cy9ldXJvcGUtbmVlZHMtdG8tbGlzdGVuLXRvLXRoZS11bnVzdWFsLXN1c3BlY3RzL9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3LmUzZy5vcmcvbmV3cy9ldXJvcGUtbmVlZHMtdG8tbGlzdGVuLXRvLXRoZS11bnVzdWFsLXN1c3BlY3RzL9IBAA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmUzZy5vcmcvbmV3cy9ldXJvcGUtbmVlZHMtdG8tbGlzdGVuLXRvLXRoZS11bnVzdWFsLXN1c3BlY3RzL9IBAA?oc=5\" target=\"_blank\">Europe needs to listen to the unusual suspects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">E3G<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Europe needs to listen to the unusual suspects - E3G","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LmUzZy5vcmcvbmV3cy9ldXJvcGUtbmVlZHMtdG8tbGlzdGVuLXRvLXRoZS11bnVzdWFsLXN1c3BlY3RzL9IBAA?oc=5\" target=\"_blank\">Europe needs to listen to the unusual suspects<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">E3G<\/font>","source.href":"https:\/\/www.e3g.org","source.title":"E3G","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Recent discussions show a welcome realisation that Europe needs to act faster, and more boldly, to transition to a prosperous and fair net zero economy. Making that a reality requires a different way of doing politics. Energy policy debates have been dominated by incumbent industries for too long. Policymakers must reach out and include new voices – citizens, consumers, and companies providing new solutions – to plan a transition that restores Europe’s position as a clean technology leader while maintaining social cohesion. Europe is realising that slow isn’t safe in the clean transition The heads of the European Central Bank, European Investment Bank and International Energy Agency have just co-hosted an unprecedented meeting to discuss how the continent can survive and thrive through the net zero transition. A decade ago, it would have been unthinkable that these organisations would jointly convene European energy ministers, top bankers and clean technology CEOs to discuss action on climate change. But with global clean technology investment outstripping that into fossil production in 2022, and growing at 30% annually, the inevitability and impact of the clean transition is something no-one can ignore. Predictably for a European economic debate this event was framed rather defensively. Concerns that the EU has fallen behind the US and China in attracting investment, deploying clean technology, and achieving competitiveness in future markets, were a driving factor. There were also echoes of past European debates which too often focused on the EU’s weaknesses rather than its unique strengths and assets. This time the debate was much more constructive and optimistic about Europe’s ability to respond. The, perhaps surprising, sense of agency rests on four powerful pillars: The ability of Europe to make fast and hard political decisions to lower dependence on Russian gas. The scale of cheap European renewable energy resources from offshore wind and solar. The depth of European technology and research leadership in many clean technology sectors; nurtured by decades of leadership in climate policy. The strength of the European single market and continental power grid to provide the scale and blend of incentives needed to support new products and solutions. There was also an emergent consensus on what needs to be done. A renewed focus on European-wide industrial policy. Rapid finalisation of critical energy market legislation. Speeding up planning consent processes; especially for new power grids. Leveraging under-used European savings to improve access to finance for all types of productive and infrastructure investments; including through Christine Lagarde’s vision for a Green Capital Markets Union. Together these measures would create the demand pull & financing depth necessary to attract global investment & accelerate green technology business growth. This welcome convergence on an action agenda shows the beginning of a realisation that going slow is no longer safe. Europe needs to make bolder and faster decisions in the new technological and geopolitical context to secure a safe and prosperous future. Learning from past mistakes to choose the right way forward So far so good. But how will these new decisions avoid the economic mistakes of the past and build robust public support for this future? To build an effective industrial strategy Europe will need to make clear choices between different technologies and alternative infrastructure networks. China has focused on frontier markets where there are few established international competitors or domestic incumbents to disadvantage. The realities of US fossil fuel politics means it is following an expensive “all of the above” strategy, which is probably unaffordable for anyone else, while directing investment into disadvantaged areas and communities to solidify public support. Europe will need to decide how it balances electrification and use of zero carbon hydrogen to avoid wasteful duplication of grids and pipelines. The EU needs to have a realistic approach to potential scale of green hydrogen imports which many producer countries are looking to use to power domestic clean industries. Decision makers need to make a hard-headed assessment of the most valuable uses for scarce European carbon storage and likely deployment rates for CCUS given its consistent under delivery over the last two decades. Europe needs to ensure there are credible benefits of transition across the continent and consumers feel the upfront costs are being shared fairly. There are no right answers in this uncertain world. Europe needs to be able to reliably, efficiently and fairly transition under all plausible technological and geopolitical scenarios. This will require clear goals, rigorous analysis, transparently assessed options and balanced advice from all stakeholders. But this is not the history of European energy policy. Europe made major strategic mistakes in failing to reduce its demand for, and dependence on, Russian gas despite supply being politically weaponised since 2002. Cheered on by the gas industry, EU member states repeatedly refused to agree cost-effective gas demand reduction measures over the last two decades. This assertion of national energy discretion resulted in huge continental costs. European consumers supported growth in global clean technology markets through subsidies and regulation, but European companies assumed this would guarantee their continued global competitiveness. Decision makers didn’t respond to the fact that Chinese five-year-plans since 2011 had clearly signalled an intent to overtake the EU in electric vehicles and renewables. Many in the EU were relaxed about relying on low-cost Chinese manufacturing in key sectors and assumed Europe would still capture the high-value added parts of supply chains in technology, design and branding. The Biden administration’s core political and economic strategy of massive support for clean technology manufacturing has been clear since 2019. Even when faced with this inevitable rise in geopolitical competition many European companies continued to lobby against strong renewable and vehicle emissions targets which would have supported European industry. Some European car makers even concentrated their electric vehicle R&D in the Chinese market due to its strong electric vehicle mandates. Public support for climate action is a key macroeconomic asset Europe has built broad public support for its climate policies backed by vibrant civil society and unique social movements. This consensus has survived and strengthened through the global financial crisis, COVID-19 and Russia’s Ukraine invasion. The political and policy certainty it provides has reduced risks and investment costs and made Europe a preferred destination for new clean investment, at least until the impact of US Inflation Reduction Act subsidies. Continued public support is one of Europe’s key macroeconomic assets but it cannot be taken for granted. As decarbonisation deepens to impact citizens’ everyday lives, climate action is increasingly being weaponised for short-term political gain. From German boiler bans to grid planning and UK petrol car phase-out, measures to accelerate clean technology deployment are facing backlash across Europe. Some of this damage has been self-inflicted by a failure to consider the immediate costs to cash-strapped households. This has handed opponents and incumbent industries easy opportunities to inflict political damage, despite the huge potential distributional dividends from transition. Shifting away from fossil fuels will lower energy costs to consumers and gradually release over €400bn a year in spending on fossil imports for investment into the European economy. Social strains will only multiply. Climate damages are already hitting Europe hard but unequally, with southern states and rural areas facing the brunt of early damage. Slovenia experienced damages from extreme floods costing 7% of GDP in 2023. There is only a patchy “social contract” within and between EU states on who will pay to protect citizens and help economies recover from extreme events. The European Green Deal in 2019 anticipated the need to put social issues at the heart of the net zero transition. Unfortunately it depended mainly on EU member states to implement policies in a fair way with the EU only having small additional funds available to help. The EU system is still better at wielding legislative sticks than providing compensatory carrots. Europe needs a plan to ensure all Europeans feel they are benefiting from the transition and being protected from climate impacts. There is a need to design distributional measures into policy from the beginning, rather than this being an afterthought to consider in the implementation phase. Policymakers should listen to unusual suspects: not just energy companies and coal workers, but also tenant associations, health groups, citizen assemblies, etc. There should be strategic consideration of what public policy changes are needed to drive this transformation to healthier lives, and what are the implications for public and private finance. Definitions of good economic management and energy security need to change The IEA expects global oil and gas demand to peak this decade as use of clean alternatives accelerates. Average fossil fuel prices will fall but prices will also become more volatile as the number of major suppliers contracts. Repeated price shocks and poorly managed industrial transitions risk serious macroeconomic stresses, which the UK fiscal watchdog estimates could produce fiscal costs dwarfing the scale of investment for climate action. A renewed focus on scaling and growing a competitive European clean economy is necessary but needs to be combined with processes to identify strategic risks, carefully prioritise investment between different parts of supply, infrastructure and demand, and effectively manage social risks. Europe needs to ensure the quality of net zero investment not just its quantity. This requires more than a change in what policies are prioritised but also a shift in who is involved in European decision making on the net zero transition. The European Commission and member states should reach out systematically to a much broader set of new analysts, actors and consumers who will shape the speed, efficiency and acceptability of future action. Managing an orderly and affordable transition requires a completely different approach to energy security than Europe’s previous focus on diversification of fuel routes. Maintaining Europe’s energy security will fundamentally depend on new factors like: the pace and distribution of technology investment; grid strengthening and deployment; demand evolution and control; climate resilience of key infrastructure; public support for new technology deployment; and access to technology and critical minerals through geopolitically contested global markets. The next European Commission could establish an Expert Taskforce on Energy Transition Stability and Security to develop a new set of energy security objectives and propose how these can be effectively monitored and managed. One solution could be to establish an independent Energy Transition Observatory, perhaps based at the IEA or European Environment Agency, to provide member states and the European institutions with regular and authoritative assessments and advice at a continental and global scale. The EU can seize the opportunity to collectively leverage the impact, size and integration of the single market to grow demand for net zero solutions within Europe and internationally. The EU can support the development of lead markets for green products and processes by setting binding requirements for green public procurement and ambitious standards to drive cleaner production and consumption practices. This would stimulate innovation in industries where Europe has a technological lead and incentivise manufacturing to stay “onshore”. These have been underplayed areas to date in the European Green Deal toolbox. Meanwhile, the US is racing ahead on green public procurement with federal “Buy Clean” initiatives already driving demand and changing the market fundamentals for greener steel, cement and aluminium. Incumbent energy and technology industries in Europe currently dominate input into energy policy debates despite having a remarkably poor track record in anticipating changes in global clean technology markets. The voices of consumers, innovative companies and new providers are not adequately reflected in the net zero transition debate. The dominance of large supply-side companies could be balanced by establishing a “European Net Zero Transition Council” to engage those representing consumers and social actors and the companies and institutions providing demand-side solutions such as distributed energy services companies, digital platform providers, cities, industrial electrification solutions, consumer cooperatives, grid and storage innovators. The first task for such a Council could be to advise the European Commission on how member state National Energy and Climate Plans can be strengthened to permanently drive down EU gas demand. Current policies are likely to only deliver 30% gas savings by 2030, but 50% cuts are needed to fully displace Russian gas and meet European climate targets. A comprehensive approach to tackling gas demand by domestic consumers and industry is needed to protect European citizens and industry from further devastating energy price shocks. Mobilising more and fairer investment Scaling-up European green investment needs much stronger alignment between financial regulators, governments, public banks and the private sector. Financial regulators are already working to define requirements for major investors, banks and businesses to publish “transition plans”, providing transparency as to forward investment and business plans. The aim is to ensure better informed investment decisions and hopefully accelerate finance into the transition. EU governments could complement these firm-level efforts by publishing their own transition investment plans, giving international investors more visibility of continental-scale opportunities. Transition planning is also needed for an orderly phase-down of the gas grid and acceleration of transmission and distribution investment. These plans should be supported by a comprehensive framework of European transition finance instruments, developed through broad multi-stakeholder consultation beyond the finance sector. Facilitating greater market-based investment is vital but experience suggests it is unlikely to direct sufficient finance to the communities, businesses and countries seeing the greatest social stresses from clean transition and climate impacts. Over 80% of funding from Europe’s “green recovery” fund established after the global financial crisis flowed to the largest economies of Western Europe, although post-COVID-19 recovery allocation is somewhat more even. One way of achieving fairer and faster distribution of investment is to better harness the rich ecosystem of European public banks to direct finance into vulnerable and marginalised communities. At the global level Europe, led by President Macron, is pushing for radical reform of the multilateral development banks to finance climate action in developing countries. Europe needs a similar bold process to bridge our internal divides, which could be powered by the European Investment Bank acting as Europe’s Climate Bank, based on its unrivalled access to the continents’ deep capital markets. Time to break out of politics-as-usual The good news is that everyone agrees that business-as-usual is not sufficient for Europe to succeed in the clean energy transition which it catalysed. This will require changes to politics as usual if Europe’s is to deploy its unique assets as the world’s greatest continental-scale policy, institutional, market and social contract innovator. The new net zero economy will not be built and managed by the businesses, markets or regulators of the past. Urgent change will not happen if incumbent voices continue to have privileged access to policy debates. Europe needs to reach out to the unusual suspects if it is to regain its lead in the clean technology revolution.","filter_flag":1}
{"title":"Cosmetic 360: “The green transition is an innovation challenge” - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpYy0zNjAtdGhlLWdyZWVuLXRyYW5zaXRpb24sMjI3MTjSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpYy0zNjAtdGhlLWdyZWVuLXRyYW5zaXRpb24sMjI3MTjSAQA?oc=5","id":"CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpYy0zNjAtdGhlLWdyZWVuLXRyYW5zaXRpb24sMjI3MTjSAQA","guidislink":false,"published":"Mon, 09 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=282, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpYy0zNjAtdGhlLWdyZWVuLXRyYW5zaXRpb24sMjI3MTjSAQA?oc=5\" target=\"_blank\">Cosmetic 360: “The green transition is an innovation challenge”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cosmetic 360: “The green transition is an innovation challenge” - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9jb3NtZXRpYy0zNjAtdGhlLWdyZWVuLXRyYW5zaXRpb24sMjI3MTjSAQA?oc=5\" target=\"_blank\">Cosmetic 360: “The green transition is an innovation challenge”<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Just like every year, the Cosmetic 360 show organized by the Cosmetic Valley will gather decision makers in the cosmetics and perfume industry and focus on a theme intended to delve into a forward-looking issue. The Cleantech theme chosen covers all technologies serving the green transition: decarbonation, waste management, circular economy, biomaterials... “We are committed to highlighting the inspirations, whether they have already found applications or not, that can be useful to the cosmetics and perfume industry and contribute to its progress as regards environmental protection”, explains Franckie Béchereau. Sharing experiences, solutions, and applications This common theme is vivid in the four-session programme of conferences. The first session will deal with new responsible consumption patterns: refills, bulk products, solid formulas... The trends will be highlighted by Beautystream and Euromonitor, among others. The second session will be focused on packaging ecoresponsibility: players like Aptar, Albéa and Minelli Group will share their own experiences. Then, the cosmetics industry decarbonation will be dealt with at the third session, through solutions like the biomass or the energy transition of manufacturing processes. Lastly, biosourced ingredients and technologies nurturing the circular economy will be addressed as part of the fourth session. Players like L’Oréal, Givaudan, LVMH and the Fondation de la Mer will provide their own visions and innovations. In the exhibition zone, various animation areas – both new and long-standing ones – will also be focused on the central theme, putting forward clean technology solutions. The brand new Innovation Center set up in partnership with IDEC, a company which provides support in implementing an energy transition, will gather a series of startups committed to new solutions. “It is a new, very strong area, because the industry is highly concerned with this issue. We will provide solutions to the cosmetics industry’s environmental challenges. The green and energy transition is definitely an innovation and competitiveness issue now”, says the Director. A Cleantech “totem” will help visitors spot the new ecoresponsible solutions showcased by the 250 exhibitors. And this year, a transversal award for the Best Cleantech Innovation will join the Cosmetic 360 Awards that recognize the best innovation in each expert field. The Tech Corner, in partnership with CNRS (The French National Center for Scientific Research), will put the spotlight on a green continuous flow extraction and potentiation technology intended to exacerbate the biological activity of molecules. The Factory will gather suppliers offering solutions to reduce water and energy consumption in the cosmetics industry. And this year, the Startup Station will welcome about 30 young companies developing clean innovations. It is sponsored by Beauty Tech Chartres, which will emphasize the support provided to entrepreneurs in developing their companies. Lastly, Greentech will offer an immersive experience involving a 3D screen technology for the development of sustainable ingredients. “As the organizers, we are also committed to getting the LEAD label certification attributed to sustainable events”, says the Director. Also, Artificial Intelligence and other digital technologies (Blockchain, RFID, additive manufacturing...) will be introduced in the Deeptech area, through practical demonstrations of their industrial applications. “We will reproduce a value chain live, so visitors can follow the product, check how it is controlled, identified, and eventually sold to customers. Each partner will showcase a technology at different phases”, explains Franckie Béchereau. As far as trends are concerned, two new zones were created this year. The first will be dedicated to perfumes – the Centdegrés agency will offer a global approach to the market –, the other to K Beauty, with South-Korean brand Elroel. Networking at the Cosmetic 360 Week As a complement to the show’s business meeting objective, various events will take place during the week of October 16-22, with industrial and cultural visits related to research, innovation, and distribution. These will include a tour to a vertical farm in Tarascon, in the south of France, a Retail Tour, a symposium on sustainable development organized by the Canadian Cosmetic Cluster, and of course, the Gala night, the key networking event of the week. Announcements for 2024 This year’s show should be inaugurated by the French Ministers of Ecological Transition and Industry, Mr Béchu and Mr Lescure. So far, with 250 exhibitors, the companies’ participation has been the most significant since the event was created. “There is a resolute return of global companies, after the Covid pandemic, in particular Chinese ones, but also new delegations, such as a Belgian group, and Canadians and Iranians as visitors. We are actually expecting 4,500 visitors this year”, says Franckie Béchereau. These dynamics will be further highlighted with the 2024 show announcement: Cosmetic 360 will celebrate its 10th anniversary next year. “We will announce special operations to achieve a strong global reach”, promises the Director.","filter_flag":1}
{"title":"Government of Canada announces $9.9 million to scale up B.C. technology businesses and improve productivity - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWFubm91bmNlcy05LTktbWlsbGlvbi10by1zY2FsZS11cC1iLWMtdGVjaG5vbG9neS1idXNpbmVzc2VzLWFuZC1pbXByb3ZlLXByb2R1Y3Rpdml0eS04MTQwNDA5MjkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWFubm91bmNlcy05LTktbWlsbGlvbi10by1zY2FsZS11cC1iLWMtdGVjaG5vbG9neS1idXNpbmVzc2VzLWFuZC1pbXByb3ZlLXByb2R1Y3Rpdml0eS04MTQwNDA5MjkuaHRtbNIBAA?oc=5","id":"CBMingFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWFubm91bmNlcy05LTktbWlsbGlvbi10by1zY2FsZS11cC1iLWMtdGVjaG5vbG9neS1idXNpbmVzc2VzLWFuZC1pbXByb3ZlLXByb2R1Y3Rpdml0eS04MTQwNDA5MjkuaHRtbNIBAA","guidislink":false,"published":"Fri, 20 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=293, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWFubm91bmNlcy05LTktbWlsbGlvbi10by1zY2FsZS11cC1iLWMtdGVjaG5vbG9neS1idXNpbmVzc2VzLWFuZC1pbXByb3ZlLXByb2R1Y3Rpdml0eS04MTQwNDA5MjkuaHRtbNIBAA?oc=5\" target=\"_blank\">Government of Canada announces $9.9 million to scale up B.C. technology businesses and improve productivity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Government of Canada announces $9.9 million to scale up B.C. technology businesses and improve productivity - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2dvdmVybm1lbnQtb2YtY2FuYWRhLWFubm91bmNlcy05LTktbWlsbGlvbi10by1zY2FsZS11cC1iLWMtdGVjaG5vbG9neS1idXNpbmVzc2VzLWFuZC1pbXByb3ZlLXByb2R1Y3Rpdml0eS04MTQwNDA5MjkuaHRtbNIBAA?oc=5\" target=\"_blank\">Government of Canada announces $9.9 million to scale up B.C. technology businesses and improve productivity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The Integrated Marketplace helps local tech companies pilot green solutions in real-world business environments and export made-in-B.C. products and services VANCOUVER, BC, Oct. 20, 2023 \/CNW\/ - British Columbia is home to hundreds of the most innovative technology companies in the world. By connecting them with large-scale B.C. organizations looking for sustainable solutions, these companies can test their new products and services, and grow their markets at home and abroad. Government of Canada announces $9.9 million to scale up B.C. technology businesses and improve productivity (CNW Group\/Pacific Economic Development Canada) Today, the Honourable Harjit S. Sajjan, Minister of Emergency Preparedness and Minister responsible for the Pacific Economic Development Agency of Canada (PacifiCan), announced $9.9 million in PacifiCan funding to Innovate BC to help establish and grow the Integrated Marketplace. This funding, through PacifiCan's Regional Innovation Ecosystems program, is in addition to $11.5 million provided by the Government of B.C. The Integrated Marketplace provides a platform for B.C. technology companies to develop and operationalize new innovations that address business challenges and advance climate goals in a real-world environment, such as a seaport or airport. Delivered by Innovate BC, the program builds a network of industry partners to identify challenges and implement technological solutions that help large-scale organizations decarbonize, increase competitiveness, and improve health and safety. This will open doors for B.C. companies to prove their technologies, and commercialize, sell, and export new products and services while reducing risk for buyers. Today's announcement took place at the Port of Vancouver, operated by the Vancouver Fraser Port Authority, which was introduced as the program's third industry testbed site. At the Port of Vancouver, the initial project will focus on developing digital tools to optimize the supply chain, which is expected to increase operational reliability and capacity. The first two testbeds were launched over the past year at Vancouver International Airport (YVR) and the Port of Prince Rupert. For its initial testbed project, YVR is electrifying its support vehicles on the airfield to reduce operational greenhouse gas emissions. At the Port of Prince Rupert, tests are being conducted to reduce use of diesel fuel, which will decarbonize operations and increase the port's efficiency and competitiveness. The Government of Canada is committed to net-zero emissions nationwide by 2050, which will require innovative measures and technologies to help transform the economy. The Integrated Marketplace will not only accelerate the development and adoption of clean technologies, it will open up new markets and attract world-class talent to the province. Quotes \"British Columbia is brimming with the talent and innovative solutions needed to position Canada as a global leader in clean technology. By linking local companies with opportunities to demonstrate new products, we are accelerating the adoption of made-in-B.C. technology both domestically and abroad. PacifiCan's support of the Integrated Marketplace is a critical step towards making our industries more competitive, creating good quality jobs, and paving the path to a net-zero future for all Canadians.\" - The Honourable Harjit S. Sajjan, Minister of Emergency Preparedness and Minister responsible for the Pacific Economic Development Agency of Canada \"Canada's innovative, sustainable cleantech solutions are key to our future prosperity. Today's announcement will allow Innovate BC to support Canadian businesses to scale and grow right here at home while becoming global clean-tech leaders. The world needs more Canada and the Integrated Marketplace Initiative creates the right conditions to deliver it.\" - The Honourable Mary Ng, Minister of Export Promotion, International Trade and Economic Development \"Innovation is at the heart of our economy, and the key to supporting our StrongerBC goals of clean and inclusive growth. This investment into the Integrated Marketplace is a great complement to the province's work and will support more good jobs and opportunities for British Columbians. We look forward to working together to develop more made-in-B.C. innovation that will reduce emissions as we support important B.C. industries such as the Port of Vancouver.\" - The Honourable Brenda Bailey, Minister of Jobs, Economic Development and Innovation \"The Integrated Marketplace (IM) is a unique, high-impact program that offers B.C. solution providers a pathway to develop, test and market homegrown innovation while also de-risking technology adoption for local industry. This funding from PacifiCan bolsters the incredible potential that IM has for developing our innovation ecosystem and will enhance opportunities for our innovators to make their mark here and worldwide.\" - Tomica Divic, Interim President + CEO, Innovate BC \"Technology and digitalization offer an exciting opportunity to strengthen the Port of Vancouver's efficiency and resiliency, as well as enhance its ability to recover from disruptions such as the supply chain challenges caused in recent years by the pandemic and extreme weather events. The Port of Vancouver is unique in how it encompasses a broad variety of customers and supply chains, and we recognize the importance of developing digital infrastructure and enhancing data exchange to increase the capacity and reliability of the gateway to improve Canada's competitiveness as a trading nation.\" - Peter Xotta, Vice President, Operations and Supply Chain, Vancouver Fraser Port Authority \"This announcement presents an exciting opportunity for B.C. ports and airports to work with local tech companies to solve challenging business problems and at the same time reduce their greenhouse gas emissions. The Integrated Marketplace initiative also increases export and trade opportunities for innovative B.C. companies and provides sustainable solutions that can benefit all British Columbians.\" - Gerri Sinclair, B.C. Innovation Commissioner Quick facts PacifiCan is the federal economic development agency dedicated to British Columbians. PacifiCan works with partners who are building innovative businesses, creating quality jobs, and supporting inclusive growth throughout our province. The Regional Innovation Ecosystem Program aims to grow and nurture priority sectors, including clean technology, life sciences and digital technology, across British Columbia to build an inclusive innovation ecosystem that allows those sectors to innovate and compete globally. to build an inclusive innovation ecosystem that allows those sectors to innovate and compete globally. The Integrated Marketplace is an initiative that links a group of strategic buyers with suppliers (sellers) to implement, scale up, and ultimately export B.C. innovation solutions. The program started by working with key identified transportation sites in B.C. to bring forward innovations to address operational challenges. The Integrated Marketplace launched in December of 2022. Innovate BC is a Crown Agency of the Government of British Columbia . It funds technology adoption, talent development, and the growth of British Columbia's innovation ecosystem through programs, sponsorship and competitions. Associated links Stay connected Follow PacifiCan on Twitter and LinkedIn Toll-Free Number: 1-888-338-9378 TTY (telecommunications device for the hearing impaired): 1-877-303-3388 SOURCE Pacific Economic Development Canada Haley Hodgson, Senior Communications Advisor Office of the Minister of Emergency Preparedness and Minister Responsible for the Pacific Economic Development Agency of Canada, [email protected]; Jillian Glover, Communications Manager, PacifiCan, [email protected]; Gemma Stroobant, Public Affairs Officer, B.C. Ministry of Jobs, Economic Development & Innovation, [email protected], 778-587-4521","filter_flag":1}
{"title":"Elemis partners with Morro to create upcycled single-use sachets for cosmetics - Premium beauty","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9lbGVtaXMtcGFydG5lcnMtd2l0aC1tb3Jyby10bywyMjgyOdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9lbGVtaXMtcGFydG5lcnMtd2l0aC1tb3Jyby10bywyMjgyOdIBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9lbGVtaXMtcGFydG5lcnMtd2l0aC1tb3Jyby10bywyMjgyOdIBAA","guidislink":false,"published":"Mon, 30 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=30, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=303, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9lbGVtaXMtcGFydG5lcnMtd2l0aC1tb3Jyby10bywyMjgyOdIBAA?oc=5\" target=\"_blank\">Elemis partners with Morro to create upcycled single-use sachets for cosmetics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Elemis partners with Morro to create upcycled single-use sachets for cosmetics - Premium beauty","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3LnByZW1pdW1iZWF1dHluZXdzLmNvbS9lbi9lbGVtaXMtcGFydG5lcnMtd2l0aC1tb3Jyby10bywyMjgyOdIBAA?oc=5\" target=\"_blank\">Elemis partners with Morro to create upcycled single-use sachets for cosmetics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Premium beauty<\/font>","source.href":"https:\/\/www.premiumbeautynews.com","source.title":"Premium beauty","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Elemis wants to upcycle their own left-over plant waste into bio-based film that will be the base of plastic-free single-use sachets for cosmetic products. To achieve this ambitious goal, the British skincare brand is building on Morro’s expertise on plant-based materials. A six month R&D project Created by Xampla, a clean technology start-up spin-out from the University of Cambridge, Morro materials are plant-based drop-in, high-performance replacements for plastics. The two companies hope that, within six months, their collaboration will yield heat-sealable films that can replace single-use plastics used in skincare samples. Elemis will then explore whether the innovation can be scaled and launched to consumers. \"What we find so exciting about this project with Morro is how utilising waste from left-over plant material can potentially tackle one of our key packaging dilemmas too. This project further reflects our commitment to finding new opportunities to have a positive impact on planet and people throughout our value chain,” said Oriele Frank, Co-Founder, Chief Product and Sustainability Officer at Elemis. While Elemis is aiming for all of its packaging to be recyclable, reusable or biodegradable by 2025, sachets remain difficult to recycle. Indeed, this popular format for consumers and brands alike is often made from several layers of different materials, and is very light and may pose contamination issues. The project has been supported by a grant co-funded by Biotechnology and Biological Sciences Research Council (BBSRC), Engineering & Physical Sciences Research Council (EPSRC), and Innovate UK. High interest in alternatives to plastic According to Xampla, more than half (54%) of UK adults see plastic as a “material of the past” and some 76% would prefer their products “to come in natural, plastic free packaging that can be composted at home or taken by the council alongside food waste”. \"Our collaboration with Elemis unlocks significant potential for the cosmetics industry, where waste materials are transformed into innovative solutions to replace plastic sachets. We are proud to have pioneered our breakthrough material using plant feedstocks and we are looking forward to developing this research further with Elemis,\" commented Pete Hutton, Chairman of Xampla.","filter_flag":1}
{"title":"CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5","id":"CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA","guidislink":false,"published":"Thu, 19 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=292, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5\" target=\"_blank\">CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5\" target=\"_blank\">CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean technology\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"B.C. clean energy innovators secure a total of $2.82 million in funding to propel over $12 million in MMV projects VANCOUVER, BC, Oct. 19, 2023 \/CNW\/ - The B.C. Centre for Innovation and Clean Energy (CICE) is announcing its allocation of $2.82 million in non-dilutive funding to develop commercial pathways for innovative B.C.-based solutions that support the measurement, monitoring, and verification (MMV) of carbon emission reduction, removal and avoidance. Congratulations to CICE funding recipients: Arca, Metaspectral, Miraterra and Quatern Limited Partnership (CNW Group\/B.C. Centre for Innovation and Clean Energy) \"B.C. is uniquely positioned to be a world leader in the global shift to clean technology and a low-carbon economy. Promoting made-in-B.C. innovative solutions for decarbonization and emissions reduction moves our province even closer to meeting its CleanBC goals,\" said Josie Osborne, Minister of Energy, Mines and Low Carbon Innovation. \"I applaud the B.C. Centre for Innovation and Clean Energy for their efforts in recognizing and funding projects that have the potential to be real game-changers in carbon management and realize a healthier future.\" Through this investment CICE is supporting the commercialization of MMV solutions which are vital to assessing carbon emissions reductions, removal and avoidance at scale. This investment will help advance the expansion of the global carbon credit market and spur further investment in emissions-reductions programs and technologies. \"British Columbia has a unique opportunity to lead the advancement of carbon management solutions by establishing MMV pathways and innovations,\" said Todd Sayers, Chief Operating Officer of the B.C. Centre for Innovation and Clean Energy. \"CICE is proud to lead catalytic investment into Arca, Metaspectral, Miraterra, and Quatern Limited Partnership and looks forward to seeing their solutions reach global scaling and climate impact potential.\" CICE launched the call for MMV innovation in June 2023, and welcomed over 100 potential applicants. Using an intelligent risk-taking framework, CICE strives to maximize potential impact of breakthrough clean energy and climate solutions by: Identifying the optimal convergence points of decarbonization and real-world readiness backed by CICE research and industry consultation Accelerating clean energy adoption and growth by mobilizing collaboration between government, industry, investors, academia and Indigenous rights holders De-risking investment in early stage cleantech and climate solutions through a government and industry co-funding model MMV funding recipients include: Arca is developing MMV technology for quantifying and validating carbon dioxide removal via carbon mineralization - a geochemical process that removes atmospheric CO2 and permanently stores it as rock - in alkaline waste. While Arca's carbon dioxide removal technologies are currently focused on mine tailings, its MMV technology will be applicable to all methods of surficial carbon mineralization - which are estimated to have a total carbon dioxide removal (CDR) capacity in excess of 1 billion tonnes per year. Metaspectral is creating a precise and cost-efficient method of assessing, quantifying, and tracking the carbon sequestration capacity of land for various industries, including agriculture. AI models ingest hyperspectral imagery in real-time to measure concentrations and fluxes of greenhouse gasses more accurately - specifically CO2 and CH4, but also N2O. With a more efficient way to measure the carbon sequestration capacity of large fields, farmers are able to optimize their practices - such as tillage, over-cropping, fertilization, and watering - to maximize the carbon sequestration potential of their land. Miraterra is developing a faster, more affordable way to test the soil quality of farm fields. Its proprietary Raman sensors provide near instantaneous measurement of key soil components including pH, soil organic carbon, soil organic matter, and NPK. This technology is fast, delivers results at approximately one-third the cost of conventional sampling, eliminates the need for toxic chemicals in conventional soil testing, and will ultimately be deployable in-field. This funding will accelerate the world's ability to measure permanence of carbon sequestered in soil via Miraterra's breakthrough carbon sub-pool measurement system. Quatern Limited Partnership is a collaboration between Quatsino First Nation and Western Forest Products Inc., who will be implementing a technology to measure the change in carbon sequestration of forests due to large-scale fertilization efforts. A technology called Treeid will be used to analyze growth rates of individual trees using LiDAR data collected several years apart. In addition to quantifying the rate at which trees sequester carbon post-fertilization, this technology could also be applied to other forest management treatments such as reforestation and thinning. Past CICE funding recipients include: Anodyne Chemistries, Atlas Power Technologies Inc., Cascadia Seaweed, Corvus Energy Inc., Ekona Power, H2 Portable Power Corp, HTEC, Hydra Energy, Hydron Energy, Illuming Power Inc., Invinity Energy Systems, Lafarge Canada, Mangrove Lithium, Metro Vancouver, Moment Energy Inc., Parkland Refining BC Ltd., Rainhouse Manufacturing Canada Ltd., and Takachar About CICE The B.C. Centre for Innovation and Clean Energy (CICE) is an independent, not-for-profit corporation that grants early-stage funding to fast-track the commercialization of British Columbia's most impactful clean energy solutions – from Canada to the world. We match the urgency and efficiency of the companies we fund, driving innovation like the planet depends on it. Because it does. Together with our climate-first community of innovators, industry leaders, academia, government, and Indigenous partners, we advance future pathways to net-zero - leveraging B.C.'s clean energy advantages to attract investment, create high paying green jobs and build sustainable economic prosperity for decades to come. SOURCE B.C. Centre for Innovation and Clean Energy For questions or interviews, please contact: Stacy Gorkoff, Head of Marketing, BC Centre for Innovation and Clean Energy (CICE), [email protected], 604.828.5548, www.cice.ca","filter_flag":1}
