{"title":"Waste-to-Value and Low-Carbon Infrastructure Leader Nexus PMG Raises $50 Million to Accelerate Its Services and ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiugFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dhc3RlLXRvLXZhbHVlLWFuZC1sb3ctY2FyYm9uLWluZnJhc3RydWN0dXJlLWxlYWRlci1uZXh1cy1wbWctcmFpc2VzLTUwLW1pbGxpb24tdG8tYWNjZWxlcmF0ZS1pdHMtc2VydmljZXMtYW5kLWRldmVsb3BtZW50LWVmZm9ydHMtMzAxODczNTk0Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiugFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dhc3RlLXRvLXZhbHVlLWFuZC1sb3ctY2FyYm9uLWluZnJhc3RydWN0dXJlLWxlYWRlci1uZXh1cy1wbWctcmFpc2VzLTUwLW1pbGxpb24tdG8tYWNjZWxlcmF0ZS1pdHMtc2VydmljZXMtYW5kLWRldmVsb3BtZW50LWVmZm9ydHMtMzAxODczNTk0Lmh0bWzSAQA?oc=5","id":"CBMiugFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dhc3RlLXRvLXZhbHVlLWFuZC1sb3ctY2FyYm9uLWluZnJhc3RydWN0dXJlLWxlYWRlci1uZXh1cy1wbWctcmFpc2VzLTUwLW1pbGxpb24tdG8tYWNjZWxlcmF0ZS1pdHMtc2VydmljZXMtYW5kLWRldmVsb3BtZW50LWVmZm9ydHMtMzAxODczNTk0Lmh0bWzSAQA","guidislink":false,"published":"Tue, 11 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=192, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiugFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dhc3RlLXRvLXZhbHVlLWFuZC1sb3ctY2FyYm9uLWluZnJhc3RydWN0dXJlLWxlYWRlci1uZXh1cy1wbWctcmFpc2VzLTUwLW1pbGxpb24tdG8tYWNjZWxlcmF0ZS1pdHMtc2VydmljZXMtYW5kLWRldmVsb3BtZW50LWVmZm9ydHMtMzAxODczNTk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Waste-to-Value and Low-Carbon Infrastructure Leader Nexus PMG Raises $50 Million to Accelerate Its Services and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Waste-to-Value and Low-Carbon Infrastructure Leader Nexus PMG Raises $50 Million to Accelerate Its Services and ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiugFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3dhc3RlLXRvLXZhbHVlLWFuZC1sb3ctY2FyYm9uLWluZnJhc3RydWN0dXJlLWxlYWRlci1uZXh1cy1wbWctcmFpc2VzLTUwLW1pbGxpb24tdG8tYWNjZWxlcmF0ZS1pdHMtc2VydmljZXMtYW5kLWRldmVsb3BtZW50LWVmZm9ydHMtMzAxODczNTk0Lmh0bWzSAQA?oc=5\" target=\"_blank\">Waste-to-Value and Low-Carbon Infrastructure Leader Nexus PMG Raises $50 Million to Accelerate Its Services and ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Waste-to-Value\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"The world of sustainable fuels, biomass and other waste-to-value asset classes is highly complex. As an early mover in the low-carbon infrastructure sector, Nexus PMG's services business has supported more than 80 unique investors and has advised on over 500 unique infrastructure assets. With the new round of capital, Nexus PMG intends to expand its existing core service offerings including front-end engineering and design, development-as-a-service and operational turnaround. Nexus also leverages its deep knowledge in the space to develop greenfield and brownfield assets across North America, creating low-carbon (or even carbon-negative) products to reduce the emissions of tough-to-abate sectors like chemicals production and aviation. \"Nexus PMG's strategy of consulting for, and directly developing in, the waste-to-value space is an attractive, high-growth proposition,\" said Quinn Pasloske, a Principal at Greenbacker. \"The transformation of our waste infrastructure and the production of low-carbon fuels is a critical component of the global energy transition, but the assets are challenging. Nexus PMG is well-equipped to assist clients in navigating those complexities while advancing its independent platforms and assets.\" Today, Nexus PMG serves upwards of 100 investors, developers and corporations that collectively have more than $300 billion of energy transition assets under management and more than $1 trillion of global assets under management. To date, Nexus PMG has supported various stages of development and execution on more than $35 billion worth of low-carbon infrastructure projects across 26 U.S. states, 13 countries and five continents. With a decade of deep knowledge and experience consulting on the design, bid and build side of low-carbon infrastructure, where Nexus PMG works closely with the owners and financiers of these projects, the company's services business is primed for growth. In the next phase, Nexus PMG will hire additional talent and expand its offerings and client base, while continuing to tailor to industry needs. \"Green molecule infrastructure is rapidly advancing and is a critical component of the energy transition,\" said Ryan Bisch, board member of Nexus. \"Nexus is at the forefront of building and optimizing this type of infrastructure. The company can develop new assets and revitalize existing ones to produce cost-competitive molecules that can reduce or even eliminate harmful greenhouse gasses.\" Nexus PMG also develops assets through two separate subsidiaries: Nexus W2V, which focuses on converting organic waste streams into renewable natural gas, compost products and biochar; and Pathway Energy, which focuses on the production of ultra-low-carbon intensity sustainable aviation fuel by leveraging carbon sequestration. Both subsidiaries are developing greenfield infrastructure assets and expect to commercialize these assets over the next several years. \"Today, as corporations and investors strive to meet near- and long-term sustainability goals, we find that most have existing portfolio assets with a waste component that can be valorized,\" said Ben Hubbard, CEO of Nexus PMG. \"Helping corporates in those waste-to-value asset classes is essential to achieve our larger energy transition goals and now, as an institutionally backed firm, we're looking forward to expanding our team to meet a growing demand for low-carbon infrastructure subject matter expertise.\" About Nexus PMG Nexus PMG is the point where project finance, development and operations connect. The industry-leading firm focuses on providing world-class advisory services to infrastructure investors by delivering technical, operational and financial diligence on projects that reduce carbon intensity and enhance resource efficiency. Nexus PMG's integrated business lines provide end-to-end services within each targeted sector including development; preliminary engineering; contract structuring; engineering, procurement and construction (EPC); commissioning and startup; operational readiness and process improvement. To learn more, visit http:\/\/nexuspmg.com. About Greenbacker Capital Management Greenbacker Capital Management LLC is an SEC-registered investment adviser that provides advisory and oversight services related to project development, acquisition, and operations in the renewable energy, energy efficiency, and sustainability industries. For more information, please visit https:\/\/greenbackercapital.com. Media Contacts Mission Control for Nexus PMG [email protected] Greenbacker Capital Management c.larson@greenbackercapital.com SOURCE Nexus PMG","filter_flag":1}
{"title":"Antioxidant-packed GM purple tomatoes get FDA green light - AgFunderNews","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9icmllZi1hbnRpb3hpZGFudC1wYWNrZWQtZ20tcHVycGxlLXRvbWF0b2VzLWNsZWFyLWZpbmFsLXJlZ3VsYXRvcnktaHVyZGxlLXRvLWVudGVyLXVzLW1hcmtldNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9icmllZi1hbnRpb3hpZGFudC1wYWNrZWQtZ20tcHVycGxlLXRvbWF0b2VzLWNsZWFyLWZpbmFsLXJlZ3VsYXRvcnktaHVyZGxlLXRvLWVudGVyLXVzLW1hcmtldNIBAA?oc=5","id":"CBMidWh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9icmllZi1hbnRpb3hpZGFudC1wYWNrZWQtZ20tcHVycGxlLXRvbWF0b2VzLWNsZWFyLWZpbmFsLXJlZ3VsYXRvcnktaHVyZGxlLXRvLWVudGVyLXVzLW1hcmtldNIBAA","guidislink":false,"published":"Mon, 10 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=191, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9icmllZi1hbnRpb3hpZGFudC1wYWNrZWQtZ20tcHVycGxlLXRvbWF0b2VzLWNsZWFyLWZpbmFsLXJlZ3VsYXRvcnktaHVyZGxlLXRvLWVudGVyLXVzLW1hcmtldNIBAA?oc=5\" target=\"_blank\">Antioxidant-packed GM purple tomatoes get FDA green light<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Antioxidant-packed GM purple tomatoes get FDA green light - AgFunderNews","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidWh0dHBzOi8vYWdmdW5kZXJuZXdzLmNvbS9icmllZi1hbnRpb3hpZGFudC1wYWNrZWQtZ20tcHVycGxlLXRvbWF0b2VzLWNsZWFyLWZpbmFsLXJlZ3VsYXRvcnktaHVyZGxlLXRvLWVudGVyLXVzLW1hcmtldNIBAA?oc=5\" target=\"_blank\">Antioxidant-packed GM purple tomatoes get FDA green light<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AgFunderNews<\/font>","source.href":"https:\/\/agfundernews.com","source.title":"AgFunderNews","query":"https:\/\/news.google.com\/rss\/search?q=\"Waste-to-Value\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Norfolk Plant Sciences (NPS) has completed a pre-market consultation with the FDA on the safety of purple tomatoes genetically engineered to produce high levels of health-promoting anthocyanins as it gears up to launch in the US. Following a three-year review, the FDA said it had “no further questions concerning human food derived from Del\/Ros1-N tomato at this time.” The ‘no questions’ letter arrived nine months after the company satisfied USDA that its purple tomatoes presented no additional safety risks vs conventional tomatoes, said NPS. “With this achievement, the company is ready to introduce a range of purple tomato products, including fresh tomatoes and seeds for home gardeners.” ‘An important process for public trust in new products’ The consultation process is voluntary, Dr. Nathan Pumplin at NPS’ US subsidiary Norfolk Healthy Produce, told AgFunder News (AFN). “However, we believe that it is an important process for public trust in new products, and it is a de facto hurdle for all transgenic crops marketed in the US. We also believe that it is important to have this final letter to support our grower and channel partners, so they may message to their customers that the product has been reviewed.” He added: “Our products have been available for non-commercial sampling [at industry events such as SynBioBeta] for several months. Since receiving the news from FDA, our grower partners have slowly started making fruit available for purchase at select restaurants and farmers markets. “We have begun a soft launch of fresh purple tomatoes, with very limited supply and distribution, and we will make seeds available to home gardeners shortly. Moving forward, we are working to expand production and distribution of fresh purple tomatoes, while we also expand our portfolio of purple tomato products and other innovative crop varieties.” Purple flesh and skin While many tomatoes have purple skin, Norfolk’s tomatoes also have purple flesh, says the firm, which activates the pathway that produces the anthocyanins in the fruit of the tomato by taking two genes from the snapdragon flower that are activated during the ripening process. “These genes are like switches that turn on the natural purple pigments of tomatoes and we get these higher levels of antioxidants,” said Pumplin. “And the great thing is that we can make any kind of tomato variety purple, from a large heirloom slicer to a sweet little cherry tomato, making them extra nutritious. “The antioxidants also slow the softening, so they give you more days of freshness. Most commercial tomatoes are bred not to ripen fully, which is how they can go through the supply chain. What our tomato allows us to do is have a fully ripe, fully flavored tomato like the heirloom varieties that you pick in your backyard garden, but three days later they’re mush. It allows us to have that full flavor and still get through the supply chain.” Further reading:","filter_flag":1}
