{"title":"New Cisco tools aim to enable green networks, data centers - TechTarget","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3NlYXJjaG5ldHdvcmtpbmcvZmVhdHVyZS9OZXctQ2lzY28tdG9vbHMtYWltLXRvLWVuYWJsZS1ncmVlbi1uZXR3b3Jrcy1kYXRhLWNlbnRlcnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3NlYXJjaG5ldHdvcmtpbmcvZmVhdHVyZS9OZXctQ2lzY28tdG9vbHMtYWltLXRvLWVuYWJsZS1ncmVlbi1uZXR3b3Jrcy1kYXRhLWNlbnRlcnPSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3NlYXJjaG5ldHdvcmtpbmcvZmVhdHVyZS9OZXctQ2lzY28tdG9vbHMtYWltLXRvLWVuYWJsZS1ncmVlbi1uZXR3b3Jrcy1kYXRhLWNlbnRlcnPSAQA","guidislink":false,"published":"Fri, 09 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=160, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3NlYXJjaG5ldHdvcmtpbmcvZmVhdHVyZS9OZXctQ2lzY28tdG9vbHMtYWltLXRvLWVuYWJsZS1ncmVlbi1uZXR3b3Jrcy1kYXRhLWNlbnRlcnPSAQA?oc=5\" target=\"_blank\">New Cisco tools aim to enable green networks, data centers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TechTarget<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"New Cisco tools aim to enable green networks, data centers - TechTarget","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3NlYXJjaG5ldHdvcmtpbmcvZmVhdHVyZS9OZXctQ2lzY28tdG9vbHMtYWltLXRvLWVuYWJsZS1ncmVlbi1uZXR3b3Jrcy1kYXRhLWNlbnRlcnPSAQA?oc=5\" target=\"_blank\">New Cisco tools aim to enable green networks, data centers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TechTarget<\/font>","source.href":"https:\/\/www.techtarget.com","source.title":"TechTarget","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable product design\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"When Cisco announced its plans in 2021 to go net zero by 2040, the company emphasized that sustainability is important to its overall strategy. Organizations around the world have followed suit and are prioritizing sustainability as a business initiative. Cisco's updates to its products aim to help organizations meet their sustainability goals as they modernize their infrastructures. Customers around the world are increasingly reporting sustainability as an area of interest, said Cisco Executive Vice President Jeff Sharritts during the opening keynote of Cisco Live 2023 in Las Vegas. \"Technology can be very powerful to help your organization reduce energy consumption,\" he said. Companies can be further incentivized to prioritize sustainability beyond reducing their carbon footprint. Organizations with sustainability initiatives typically earn more in profit and maintain employee retention, said Denise Lee, vice president of Cisco's engineering sustainability office, during a separate presentation on how organizations can reach net-zero goals. \"Data is coming back showing that companies that are making the commitment to sustainability are realizing benefits and gain across the board,\" Lee said. Cisco has two decades of experience in environmental reporting, sustainability implementations in its supply chain and sustainable product design, Lee said. Cisco continues to update its portfolio of eco-friendly networking products geared toward improving energy efficiency. \"This concept of networking energy is what we are trying to pervasively build across all of our control planes and our management systems,\" Lee said. For us #WorldEnvironmentDay is every day! Come check out the activities at the #CiscoLive Sustainability Zone and help make an impact with us! pic.twitter.com\/IkGNLOqgJc — CiscoLive (@CiscoLive) June 5, 2023 Green networks enable modernization Data centers account for a significant portion of energy consumption, so businesses usually look to green their data centers when they begin a sustainability journey. However, such a strategy can pose challenges for organizations because they must ensure their data center networks operate at optimal performance as they work to meet environmental, social and governance goals. That's where modernization comes in. According to Jeremy Foster, senior vice president and general manager of Cisco Networking Compute, modernization enables businesses to save on physical and financial costs at the same time. Tools help modernize data center networks Foster said organizations that replaced legacy hardware with Cisco Unified Computing System (UCS) X-Series servers were able to reduce their physical footprint by 66% and minimize power consumption by approximately 32%. Companies were also able to become more financially efficient because the use of less hardware meant organizations could save on the costs of purchasing and managing contracts for that infrastructure. \"There's a huge opportunity as an IT organization to leverage sustainability to modernize the physical as well as your application landscape at the same time,\" Foster said. Cisco built its latest UCS X-Series server model with sustainability in mind, Foster said. The hardware operates Cisco's SaaS-based Intersight software platform, which provides real-time visibility and metrics on how the infrastructure operates and enables process automation. According to Thomas Scheibe, vice president of product management at Cisco, metrics are vital to help pros understand the energy consumption of their data centers. Metric collection should start with real-time telemetry -- to find out how much energy the network consumes -- and continue with visibility. Visibility lets pros see the network energy consumption and translate it into costs and carbon emissions, Scheibe said.","filter_flag":1}
