{"title":"Signify to introduce new products and innovations at CIIE - SHINE News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LnNoaW5lLmNuL2Jpei9jb21wYW55LzIzMTEwNzYxMDEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LnNoaW5lLmNuL2Jpei9jb21wYW55LzIzMTEwNzYxMDEv0gEA?oc=5","id":"CBMiLGh0dHBzOi8vd3d3LnNoaW5lLmNuL2Jpei9jb21wYW55LzIzMTEwNzYxMDEv0gEA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LnNoaW5lLmNuL2Jpei9jb21wYW55LzIzMTEwNzYxMDEv0gEA?oc=5\" target=\"_blank\">Signify to introduce new products and innovations at CIIE<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SHINE News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Signify to introduce new products and innovations at CIIE - SHINE News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiLGh0dHBzOi8vd3d3LnNoaW5lLmNuL2Jpei9jb21wYW55LzIzMTEwNzYxMDEv0gEA?oc=5\" target=\"_blank\">Signify to introduce new products and innovations at CIIE<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SHINE News<\/font>","source.href":"https:\/\/www.shine.cn","source.title":"SHINE News","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy-saving technology\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Signify is returning to the CIIE with a renewed commitment to invest in China and interact with the local ecosystem for a variety of high-tech and low-carbon solutions. Global lighting company Signify is returning to the China International Import Expo with the latest commitment to further invest in China and connect with the local ecosystem for a wide range of high-technology and low-carbon solutions. “China is Signify’s ‘second home,’ and we see our company as an active participant in China’s high-quality development, a witness of reform and opening up, and a beneficiary of the CIIE platform,” said John Wang, president of Signify Northeast Asia and senior vice president of Signify. The sixth edition of the CIIE provides Signify with new possibilities and venues to demonstrate its steadfast support for the Chinese economy and to introduce its newest innovations and products to the local market. “The CIIE has set up an excellent platform for global enterprises to exchange and cooperate in the economy and trade,” he said. Signify and Shanghai Modern Agricultural Investment Development Group, a state-backed city infrastructure provider and investment firm concentrating on smart infrastructure, have signed a new cooperation agreement at the CIIE. Signify will supply innovative plant lighting solutions for the group, focusing on low-carbon and energy-saving technology. The two parties would pool their resources and promote and establish world-leading agricultural production facilities in the modern agricultural industry park on Hengsha Island in the northeastern Chongming District, with the goal of laying a solid foundation for a world-class modern urban ecological agriculture demonstration area. The two parties are also looking forward to future commercial cooperation in plant lighting and other sectors, as well as exploring new initiatives to promote the development of contemporary green and intelligent agriculture. Other highlights of the CIIE include ultra-efficient LED products for residential and commercial usage, as well as smart LEDs created with circular manufacturing technologies such as 3D printing and the utilization of recycled plastic and green electricity. Philips Hue Perifo smart track lighting will be introduced at the expo. “Signify regards the expo as a rare opportunity for cooperation and a window to show the huge potential of the Chinese market to the outside world, and we’re looking forward to exchanging and cooperating with high-quality enterprises from all over the world during the expo,” Wang said. Cooperation agreements struck at previous CIIE editions have been properly implemented, and the products brought to the show have been warmly received in the local market. “We’re bringing a number of advanced technologies to display the latest product offerings and the potential of the Chinese market. At the same time, it also reflects our determination and confidence to continue to develop and deepen our footprint in the Chinese market,” he said. Signify’s “Brighter Lives, Better World” sustainability plan, implemented a few years ago, precisely aligns with China’s push for carbon emission reduction and carbon neutrality, with good effects on the environment and society. By 2025, it plans to double circular revenues to 32 percent, as well as the Brighter Lives revenues from lighting innovations that boost food security, safety, or health and wellbeing. “Chinese government policies regarding environmentally friendly solutions and sustainability fit well with our own positioning with long-term efforts in sustainability practices as well as our inclusive vision,” he said.","filter_flag":1}
