{"title":"Kuradashi: E-Commerce Website that Combines Food Loss with Social Good | TOKYO UPDATES [The Official ... - TOKYO UPDATES（トーキョー・アップデーツ）","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LnRva3lvdXBkYXRlcy5tZXRyby50b2t5by5sZy5qcC9lbi9wb3N0LTExMDcv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LnRva3lvdXBkYXRlcy5tZXRyby50b2t5by5sZy5qcC9lbi9wb3N0LTExMDcv0gEA?oc=5","id":"CBMiOGh0dHBzOi8vd3d3LnRva3lvdXBkYXRlcy5tZXRyby50b2t5by5sZy5qcC9lbi9wb3N0LTExMDcv0gEA","guidislink":false,"published":"Mon, 28 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=240, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LnRva3lvdXBkYXRlcy5tZXRyby50b2t5by5sZy5qcC9lbi9wb3N0LTExMDcv0gEA?oc=5\" target=\"_blank\">Kuradashi: E-Commerce Website that Combines Food Loss with Social Good | TOKYO UPDATES [The Official ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TOKYO UPDATES（トーキョー・アップデーツ）<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kuradashi: E-Commerce Website that Combines Food Loss with Social Good | TOKYO UPDATES [The Official ... - TOKYO UPDATES（トーキョー・アップデーツ）","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOGh0dHBzOi8vd3d3LnRva3lvdXBkYXRlcy5tZXRyby50b2t5by5sZy5qcC9lbi9wb3N0LTExMDcv0gEA?oc=5\" target=\"_blank\">Kuradashi: E-Commerce Website that Combines Food Loss with Social Good | TOKYO UPDATES [The Official ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TOKYO UPDATES（トーキョー・アップデーツ）<\/font>","source.href":"https:\/\/www.tokyoupdates.metro.tokyo.lg.jp","source.title":"TOKYO UPDATES（トーキョー・アップデーツ）","query":"https:\/\/news.google.com\/rss\/search?q=\"Secondhand Sales\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The e-commerce website Kuradashi, run by a company lauded for their efforts to reduce food loss, utilizes a unique system that has social good built directly into the business model. The Kuradashi e-commerce website offers daily necessities and beauty\/health goods in addition to food products. Confronting the Issues of Food Distribution Head On Large amounts of food are thrown away every day—despite still being consumable—due to difficulties in selling such food through typical distribution channels. According to a June 2022 report by the Ministry of Agriculture, Forestry and Fisheries, Japan experiences 5.22 million tons of food loss per year. Part of the reason why there is so much food loss is what is called the \"one-third rule,\" a Japanese business practice within food distribution. In the \"one-third rule,\" the time from when a product is manufactured to its best-by date is split into three parts: manufacturing date to delivery deadline; delivery deadline to sales deadline; and sales deadline to best-by date. Products that are not delivered to retail stores by their delivery deadline are returned by wholesalers to manufacturers. Products that are not sold in stores by the sales deadline are returned by retail stores to wholesalers, though some are left on shelves to be sold at a discount. In the back rooms of stores with their rows and rows of fresh, shiny new products are products that have not even reached their best-by date, yet are nevertheless being thrown in the trash. Sekito Tatsuya, president of KURADASHI Co., Ltd. He founded the company in 2014 after working at a trading firm, with the mission, \"Continuing to be a social good company.\" Food product manufacturers set production volumes and sales prices under the assumption that a certain amount of product will be thrown away. \"It doesn't benefit anyone—not the producers, the wholesalers, the retailers, or the consumers,\" says Sekito Tatsuya, president of KURADASHI Co., Ltd. Shopping for Yourself as a Force for Good The Kuradashi (meaning releasing stored goods) \"social good\" market, run of course by KURADASHI, is representative of a new kind of effort—a goods market that makes it clear that their goal is to reduce food loss. The products are purchased from producers and food product manufacturers with sufficient time until their best-by dates. They are then sold on the market at a discount, with the reason for the discount explained in clear terms to consumers. KURADASHI donates a portion of their sales to 15 social action organizations, nd when consumers purchase products on the market, they are able to select which organization they would like the company to donate to. Kuradashi is designed in such a way that when consumers purchase food products on the market, they get the sense that they are helping to reduce food loss and doing good for society. The system also allows food product manufacturers and producers to avoid throwing away large amounts of food, without damaging the reputation of the company or the products. If primary distribution is defined as the process of getting products from factories to store shelves, and secondary distribution is defined as secondhand sales, then Kuradashi falls somewhere in between. Their business model is to solve social issues while spotlighting food products that, despite their value as products, have found themselves left behind by conventional market practices. The \"Kuradashi Fund\" set up by the company also provides support to a social action internship program that connects farmers with university students, contributing to the training of the next generation. Turning Tokyo Into a \"Sustainability Leader\" Eight years have passed since the launch of Kuradashi, and the market now has 390,000 members. Many of the 1,085 companies the service has collaborated with are headquartered in Tokyo, making the city Kuradashi's most vibrant hub. In Sekito's vision for the future, Tokyo—through companies and other organizations like KURADASHI—eventually becomes a \"sustainability leader\" that is able to serve as a model for the rest of the world. KURADASHI's efforts are not limited to the e-commerce business. The company is also working with the Tokyo Metropolitan Government as well as Shinagawa City and other local governments, and chambers of commerce to benefit local communities. They provide support for a social action internship that connects university students to farmers, contribute to the training of social entrepreneurs, and pursue various other activities. Their goal, always, is to serve as a force for social good. Interview and writing by Iwasa Shie Photos by Saera Jin Translation by Amitt","filter_flag":1}
