{"title":"Understanding the Voluntary Carbon Market | BCG - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXRoZS12b2x1bnRhcnktY2FyYm9uLW1hcmtldC1pcy10aHJpdmluZ9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXRoZS12b2x1bnRhcnktY2FyYm9uLW1hcmtldC1pcy10aHJpdmluZ9IBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXRoZS12b2x1bnRhcnktY2FyYm9uLW1hcmtldC1pcy10aHJpdmluZ9IBAA","guidislink":false,"published":"Thu, 19 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=19, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXRoZS12b2x1bnRhcnktY2FyYm9uLW1hcmtldC1pcy10aHJpdmluZ9IBAA?oc=5\" target=\"_blank\">Understanding the Voluntary Carbon Market | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Understanding the Voluntary Carbon Market | BCG - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvd2h5LXRoZS12b2x1bnRhcnktY2FyYm9uLW1hcmtldC1pcy10aHJpdmluZ9IBAA?oc=5\" target=\"_blank\">Understanding the Voluntary Carbon Market | BCG<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Despite a sluggish economy and ongoing budget pressures, the demand for voluntary carbon-emissions credits is growing rapidly. And the focus of credit trading is shifting from reducing emissions to removing them altogether. These are two of the key insights from BCG’s latest report on the voluntary carbon markets, written in partnership with Shell. Our global analysis also found that the influence of external organizations on buyers’ decisions is growing; that a reputable monitoring, reporting, and verification framework has become a priority when making purchase decisions; and that companies continue to monitor developments on Article 6 of the Paris Agreement to adapt their strategy as needed. As more companies join the race to net zero, we hope this research will prove useful for those interested in making carbon credits part of their climate and sustainability strategies. An Update on the Voluntary Carbon Market Companies that wish to offset their greenhouse gas emissions can purchase two different types of credits in the voluntary market: avoidance credits for external projects that avoid or reduce emissions production, such as building a wind farm, and removal credits for projects that lower existing emissions. Removal projects deploy either nature-based solutions such as afforestation (introducing trees to a previously unforested area) or technology-based solutions such as renewable energy generation. In 2021, the voluntary carbon market grew at a record pace, reaching $2 billion—four times its value in 2020—and the pace of purchases is still accelerating in 2022. By 2030, the market is expected to reach between $10 billion and $40 billion. Five Important Insights To better understand the impact of current economic headwinds on companies’ carbon-offset purchase strategies, we conducted a worldwide survey of over 200 environmental and sustainability executives across sectors and interviewed over 20 executives in depth. Five key findings emerged: Buyers see spending on carbon credits as nondiscretionary and expect demand to grow. Despite greater economic challenges, most respondents think that the volume of emissions compensated through offsets will increase as more companies set net-zero targets. We found, in fact, that demand for some classes of credit, such as nature-based credits, could soon outstrip supply. Despite greater economic challenges, most respondents think that the volume of emissions compensated through offsets will increase as more companies set net-zero targets. We found, in fact, that demand for some classes of credit, such as nature-based credits, could soon outstrip supply. External organizations are increasingly influencing buyers’ decisions. Companies expect organizations such as the Science Based Targets initiative and the Voluntary Carbon Markets Integrity Initiative to have an increasing influence on market trends; the emerging guidance of these organizations therefore will likely impact market growth. Companies expect organizations such as the Science Based Targets initiative and the Voluntary Carbon Markets Integrity Initiative to have an increasing influence on market trends; the emerging guidance of these organizations therefore will likely impact market growth. A reputable monitoring, reporting, and verification (MRV) framework is a top criterion for purchasing credits. Over 90% of buyers rank MRV as a major factor in credit purchase decisions. As the spotlight on carbon offsets grows, buyers want to ensure that the credits they buy have an impact that’s easy to prove and defensible against claims of greenwashing. Over 90% of buyers rank MRV as a major factor in credit purchase decisions. As the spotlight on carbon offsets grows, buyers want to ensure that the credits they buy have an impact that’s easy to prove and defensible against claims of greenwashing. More than half of companies surveyed expect removal credits to dominate their portfolio by 2030. Although removal credits are expensive, they have gained a following because of their quality—it’s easier to verify a project’s impact than with avoidance credits. Technology-based removals are expected to gain market share as the technology matures and becomes more affordable. Although removal credits are expensive, they have gained a following because of their quality—it’s easier to verify a project’s impact than with avoidance credits. Technology-based removals are expected to gain market share as the technology matures and becomes more affordable. Companies have limited clarity on the impact of Article 6 and corresponding adjustments. Article 6 of the Paris Agreement allows countries to help each other achieve their national determined contribution (NDC) to global emissions reduction. One country can, for example, sell its carbon credits to another, but only one may apply the credit to its NDC. Corresponding adjustments are an accounting mechanism to prevent any double counting between countries, but they could impact companies that wish to source credits internationally. Respondents are also divided on whether Article 6 will lead to a global compliance market, though they expect that an infrastructure for corresponding adjustments will be put in place over the next five years. The Avoidance-Removal Debate According to our analysis, avoidance credits currently represent about 80% of supply, but removal credits are expected to reach 35% by 2030. Our survey respondents expect an even more aggressive shift. Are removals now the best market play? In the context of the shrinking carbon budget, relying exclusively on removal credits seems premature given that we are still underperforming on reducing emissions globally. We’re cutting down forests much faster than any afforestation or reforestation efforts can replace them, for example—so it’s critical to fund the avoidance that stops deforestation. Ultimately, a combination of verifiable avoidance and removal projects will be necessary. The focus, therefore, should be on the quality of both types of credits as the market continues to mature. The rapid rise in voluntary purchases of emissions credits, even in uncertain times, reflects companies’ commitment to reaching net zero and the growing importance of the carbon market. But decarbonization must start with reducing emissions: offsets are an additional tool, not a replacement. And we must ensure that credits deliver on their promises.","filter_flag":1}
{"title":"Roechling Industrial Gastonia Makes Investment Toward Becoming Carbon Neutral - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JvZWNobGluZy1pbmR1c3RyaWFsLWdhc3RvbmlhLW1ha2VzLWludmVzdG1lbnQtdG93YXJkLWJlY29taW5nLWNhcmJvbi1uZXV0cmFsLTMwMTcyMTU2MS5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JvZWNobGluZy1pbmR1c3RyaWFsLWdhc3RvbmlhLW1ha2VzLWludmVzdG1lbnQtdG93YXJkLWJlY29taW5nLWNhcmJvbi1uZXV0cmFsLTMwMTcyMTU2MS5odG1s0gEA?oc=5","id":"CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JvZWNobGluZy1pbmR1c3RyaWFsLWdhc3RvbmlhLW1ha2VzLWludmVzdG1lbnQtdG93YXJkLWJlY29taW5nLWNhcmJvbi1uZXV0cmFsLTMwMTcyMTU2MS5odG1s0gEA","guidislink":false,"published":"Fri, 13 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=13, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JvZWNobGluZy1pbmR1c3RyaWFsLWdhc3RvbmlhLW1ha2VzLWludmVzdG1lbnQtdG93YXJkLWJlY29taW5nLWNhcmJvbi1uZXV0cmFsLTMwMTcyMTU2MS5odG1s0gEA?oc=5\" target=\"_blank\">Roechling Industrial Gastonia Makes Investment Toward Becoming Carbon Neutral<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Roechling Industrial Gastonia Makes Investment Toward Becoming Carbon Neutral - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JvZWNobGluZy1pbmR1c3RyaWFsLWdhc3RvbmlhLW1ha2VzLWludmVzdG1lbnQtdG93YXJkLWJlY29taW5nLWNhcmJvbi1uZXV0cmFsLTMwMTcyMTU2MS5odG1s0gEA?oc=5\" target=\"_blank\">Roechling Industrial Gastonia Makes Investment Toward Becoming Carbon Neutral<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Offset\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Industrial Product Supplier Adds FlexRNG Offering from Gas South to its Sustainability Program DALLAS, N.C., Jan. 13, 2023 \/PRNewswire\/ -- Roechling Industrial Gastonia, LP, an industrial product manufacturer specializing in stock shape thermoplastic products, announced a new commitment to sustainability. The company will start to use FlexRNG in 2023 to address their natural gas consumption with the goal to offset their greenhouse gas emission and targeting carbon neutrality by 2030. FlexRNG is a new and accessible energy option from Gas South. Roechling has set a company-wide goal of becoming carbon neutral by 2030. By investing in FlexRNG, it will ensure there is no net release of carbon dioxide into the atmosphere when it burns natural gas. FlexRNG is a multifaceted offering that works by offsetting natural gas emissions with verified carbon offsets and by displacing a portion of natural gas consumption with renewable natural gas (RNG). It includes verifying, tracking and retiring renewable thermal credits and carbon offset credits in the company's name. \"We are proud to partner with Gas South on our investment to reduce our environmental impact,\" said Tim Brown, President of Roechling Industrial North America. \"We are making strides with our holistic decarbonization strategy and are energized by the vision of a carbon neutral Roechling Industrial.\" Gas South, a wholly owned subsidiary of Cobb Electric Membership Corporation, is the largest retail natural gas provider in the southeastern United States. In addition to delivering renewable energy products like FlexRNG, the Atlanta-based company has invested $23 million in solar energy projects and plans to invest at least $15 million in renewable energy projects annually over the next three years. \"I applaud Roechling Industrial Gastonia for taking this impactful step towards achieving their carbon neutral goal. Adding FlexRNG to their emissions-reduction strategy will help them meet their targets within their budget,\" said Luke Nemes, Senior Originator for Renewables at Gas South. \"This investment is also a huge step forward for Gas South. We pride ourselves on guiding sustainability-focused customers to emissions-reduction solutions that make a difference. I'm proud to be a part of this business, and I can't wait to see Roechling achieve their objectives.\" For more information on Roechling Industrial, please visit www.roechling.com\/us\/industrial. For additional information on Gas South and FlexRNG, please visit www.GasSouth.com\/Renewables. About Roechling Industrial Gastonia: The Röchling Group, made up of Industrial, Medical, and Automotive divisions, employs over 11,000 worldwide at 91 locations in 25 countries. Backed by a global network, Roechling Industrial Gastonia is one of the world's leading manufacturers of high-quality semi-finished thermoplastics and engineering products. Featuring what they believe to be the most comprehensive product line within the United States and Canada, Roechling is committed to developing efficient, innovative, and sustainable solutions for their customers. About Gas South: Gas South is a leading provider of natural gas in competitive markets throughout the southeastern U.S. Following the acquisition of Infinite Energy in 2020, Gas South now serves more than 425,000 residential, business and governmental customers in Georgia, Florida, North Carolina, South Carolina and 10 other states. Gas South offers simple and straightforward rate plans, outstanding local customer service, and a promise to give back 5% of profits to support children in need. Gas South is a wholly owned subsidiary of Cobb EMC, one of the country's largest electric cooperatives. For more information, visit www.GasSouth.com. Media Contact: Bella Luna [email protected] SOURCE Gas South","filter_flag":1}
