{"title":"Back to the future: Signify increases the energy efficiency of LED lamps - LEDs Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5sZWRzbWFnYXppbmUuY29tL2FyY2hpdGVjdHVyYWwtbGlnaHRpbmcvYXJ0aWNsZS8xNDMwMTI5NC9iYWNrLXRvLXRoZS1mdXR1cmUtc2lnbmlmeS1pbmNyZWFzZXMtdGhlLWVuZXJneS1lZmZpY2llbmN5LW9mLWxlZC1sYW1wc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5sZWRzbWFnYXppbmUuY29tL2FyY2hpdGVjdHVyYWwtbGlnaHRpbmcvYXJ0aWNsZS8xNDMwMTI5NC9iYWNrLXRvLXRoZS1mdXR1cmUtc2lnbmlmeS1pbmNyZWFzZXMtdGhlLWVuZXJneS1lZmZpY2llbmN5LW9mLWxlZC1sYW1wc9IBAA?oc=5","id":"CBMijAFodHRwczovL3d3dy5sZWRzbWFnYXppbmUuY29tL2FyY2hpdGVjdHVyYWwtbGlnaHRpbmcvYXJ0aWNsZS8xNDMwMTI5NC9iYWNrLXRvLXRoZS1mdXR1cmUtc2lnbmlmeS1pbmNyZWFzZXMtdGhlLWVuZXJneS1lZmZpY2llbmN5LW9mLWxlZC1sYW1wc9IBAA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5sZWRzbWFnYXppbmUuY29tL2FyY2hpdGVjdHVyYWwtbGlnaHRpbmcvYXJ0aWNsZS8xNDMwMTI5NC9iYWNrLXRvLXRoZS1mdXR1cmUtc2lnbmlmeS1pbmNyZWFzZXMtdGhlLWVuZXJneS1lZmZpY2llbmN5LW9mLWxlZC1sYW1wc9IBAA?oc=5\" target=\"_blank\">Back to the future: Signify increases the energy efficiency of LED lamps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LEDs Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Back to the future: Signify increases the energy efficiency of LED lamps - LEDs Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijAFodHRwczovL3d3dy5sZWRzbWFnYXppbmUuY29tL2FyY2hpdGVjdHVyYWwtbGlnaHRpbmcvYXJ0aWNsZS8xNDMwMTI5NC9iYWNrLXRvLXRoZS1mdXR1cmUtc2lnbmlmeS1pbmNyZWFzZXMtdGhlLWVuZXJneS1lZmZpY2llbmN5LW9mLWxlZC1sYW1wc9IBAA?oc=5\" target=\"_blank\">Back to the future: Signify increases the energy efficiency of LED lamps<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">LEDs Magazine<\/font>","source.href":"https:\/\/www.ledsmagazine.com","source.title":"LEDs Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"With the lighting industry’s emphasis on all things IoT, circular, and circadian, it’s easy to lose sight of the original hallmark of LED illumination: the energy efficiency of lightbulbs. This week, Signify issued a strong reminder of the basics, increasing the efficiency of LED lamps across a range of uses. The world’s largest lighting company added models to its Philips brand Ultra Efficient (UE) line for use on roadways as well as in retail, hospitality, and home environments. Eindhoven, Holland–based Signify said the new models increase energy efficiency over existing Signify Philips-branded LED products by between 43% and 50%, depending on the model. The new editions all have an “A” energy efficiency rating under the European Union eco labels that came into force in September 2021, when “A” replaced “A++” as the most energy-efficient designation, causing many existing products from Signify and other vendors to cascade down as low as E and F. It was around that time that Signify started adding Ultra Efficient models, beginning with some home LED lamps. The company has continued to beef up its UE stable since then. The most recent additions include a replacement for conventional high-intensity discharge (HID) street lamps. Signify said the new Philips MASTER LED SON-T UltraEfficient is 43% more efficient than its previous LED HID replacement offering. Signify also added new lamps for indoor use commercially and residentially that all qualify as “A” in E.U. energy ratings, whereas Signify previously topped out at “B.” The new models include Edison-style lightbulbs in various shapes such as traditional, candle, and globe — some of which are dimmable. They offer 50% greater energy savings than Signify’s previous products. The new offerings also include GU10 spot lamps, with 45% greater efficiency. Signify did not reveal pricing. LEDs Magazine has inquired. Typically the company attaches a premium price tag when it offers a big leap in efficiency. The new products have been available in Europe since September; Signify has only now announced them. LEDs is awaiting answers on availability in other geographic areas. In the E.U.’s September 2021 reconfigured labeling scheme, the top rating of A requires 210 lumens per watt (lm\/W), B means 185 lm\/W, and C 160 lm\/W. The designations run down to G at 0 lm\/W. The less stringent old system topped at A++ at 120 lm\/W, while A+ meant at least 120 lm\/W and A ran at 50 lm\/W. That system bottomed out at E’s 0 lm\/W. Meanwhile, Signify and the lighting industry in general continue pursuing IoT, circular economy, and circadian entrainment ambitions. Watch for more soon on these subjects from LEDs. MARK HALPER is a contributing editor for LEDs Magazine, and an energy, technology, and business journalist ([email protected]). Follow our LinkedIn page for our latest news updates, contributed articles, and commentary, and our Facebook page for events announcements and more. You can also find us on the X platform.","filter_flag":1}
{"title":"Assessment of green technology innovation on energy-environmental efficiency in China under the influence of ... - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00Nzc4Ni0y0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00Nzc4Ni0y0gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00Nzc4Ni0y0gEA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00Nzc4Ni0y0gEA?oc=5\" target=\"_blank\">Assessment of green technology innovation on energy-environmental efficiency in China under the influence of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Assessment of green technology innovation on energy-environmental efficiency in China under the influence of ... - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxNTk4LTAyMy00Nzc4Ni0y0gEA?oc=5\" target=\"_blank\">Assessment of green technology innovation on energy-environmental efficiency in China under the influence of ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The spatial autocorrelation analysis The spatial correlations for EEE, PTE, SE, ER, GTI, SubGI, and SymGI were calculated under three spatial weight matrices, and the results are presented in Table 2. Table 2 The global Moran’s I values of variables from 2003 to 2017. Full size table Table 2 reveals that from 2003 to 2017, the Moran’s I values for EEE, GTI, SubGI, and SymGI were all significantly positive, indicating spatial clustering and substantial positive spatial correlation among provinces. Additionally, it was observed that, except for the years 2003, 2004, and 2005 under conditions \\({W}_{a}\\) and \\({W}_{b}\\), where Moran’s I values for PTE and SE were positive but not significant, all other periods exhibited significantly positive Moran’s I values, signifying a strong positive spatial correlation between PTE and SE. Finally, the Moran’s I results for ER demonstrated that under condition \\({W}_{a}\\) all Moran’s I values were significantly positive, suggesting a robust positive spatial correlation among ER. Under condition \\({W}_{b}\\), apart from the years 2003 to 2006 with positive but insignificant Moran’s I values, all other results were significantly positive. Under condition \\({W}_{c}\\), Moran’s I values for the years 2007 to 2012 were positive but insignificant, while all other results were significantly positive. In summary, the majority of Moran’s I values for ER were significantly positive, indicating a pronounced spatial dependence among ER. Overall, there is substantial spatial correlation between explanatory and dependent variables, underscoring the necessity to account for spatial effects in the study, which aligns with real-world dynamics. Estimated results of the effect of GTI on EEE under the impact of ER This section employs the DSDM to estimate the impact of GTI on EEE without considering the influence of ER (model 5) and the impact of GTI on EEE under the influence of ER (model 6), as presented in Table 3. Results from Table 3 indicate that under all three spatial weight matrices, the coefficients for the variables are generally significant. Under the \\({\\mathrm{W}}_{b}\\) weight matrix, the spatial correlation coefficients and sigma coefficients are also significant, suggesting the suitability of the DSDM model for this estimation. The lagged term coefficient of EEE (\\(\\mathrm{L}.\\mathrm{lnEEE}\\)) and the spatial spillover term coefficient of EEE under weight \\({\\mathrm{W}}_{b}\\) (\\(\\mathrm{L}.\\mathrm{WlnEEE}\\)) are both significantly positive, indicating a clear pattern of continuity, accumulation, and high interdependence among EEE in various provinces of China. In addition, under all three weight matrices, the coefficient for the quadratic term of GTI is significantly positive, indicating a U-shaped relationship between GTI and EEE. One possible explanation for this pattern is that the transformation of GTI takes time and requires significant initial investments in research and improvement, leading to relatively stable energy consumption and CO 2 emissions, resulting in a decline in EEE. However, once the GTI are widely adopted, energy consumption and CO 2 emissions are substantially reduced, leading to improved EEE. Furthermore, the study finds that the direct effect coefficients of ER on EEE and the spatial spillover effect coefficients are opposite in sign. The direct interaction effect coefficients between ER and GTI, as well as the spatial interaction effect coefficients between ER and GTI, are also opposite in sign. This makes it challenging to directly assess the impact of ER on EEE and the role of ER in this impact. Therefore, the study decomposed the model results. Since short-term estimates are particularly valuable for informing national energy controls and energy policies, this study focuses on analyzing short-term effect results, as shown in Tables 4 and 5. Table 3 Results of the impact of GTI on EEE. Full size table Table 4 Results of direct, indirect, and total effects of GTI on EEE under ER in the short-term. Full size table Table 5 Results of direct, indirect, and total effects of SubGI, SymGI on EEE under ER in the short-term. Full size table Table 4 presents the results of the direct, spatial, and total effects of GTI on EEE considering the impact of ER. The coefficients of the total effect of GTI are significantly negative under the weighting matrices \\({W}_{a}\\) and \\({W}_{b}\\) 65. Furthermore, the total effect follows the same trend as the spatial effect, indicating that the inhibitory effect of GTI on neighboring regions is greater than its promoting effect on the local region66. One possible reason for this is that the promotion of GTI leads to resource competition in neighboring areas. What sets this study apart from others is the consideration of the quadratic term of GTI26,47. The study finds that the coefficient for the quadratic term of GTI is significantly positive30 and consistent with the trend of direct effects. This suggests that there is a critical point in the impact of GTI on EEE. Before reaching this critical point, the negative spatial spillover effect of GTI on EEE is greater than the positive direct effect, leading to a decrease in EEE. However, after reaching the critical point, the positive direct effect of GTI on EEE outweighs the negative spatial spillover effect, thereby improving EEE. The main reason for this is that as GTI progresses, its required conditions become more refined, and good cooperative relationships develop among neighboring regions, accelerating the development of green technology in various regions. Similarly, under matrices \\({W}_{a}\\) and \\({W}_{b}\\), the total effect coefficient of ER on EEE is significantly positive, indicating that the implementation of ER can enhance EEE19.One possible reason for this result is that this study uses the ratio of emission fees to GDP as the measurement indicator for ER. Excessive emissions by enterprises lead to higher emission costs, increased operating costs for businesses, thereby prompting companies to update production equipment35, reduce pollutant emissions, and result in a decrease in EEE. Furthermore, the coefficient for the interaction term between ER and GTI is significantly positive, but the impact of GTI on EEE follows a U-shaped curve. This suggests that before GTI reaches its critical point, the implementation of ER mitigates the negative impact of GTI on EEE. The reason for this could be that in the early stages of GTI implementation, businesses face high sunk costs, and the implementation of environmental policies encourages businesses and individuals to invest in the research and application of green technology, thereby increasing financial support for green technology development. After GTI reaches its critical point, the implementation of ER strengthens the promoting effect of GTI on EEE. The primary reason is that the conditions required for green technology innovation are already mature, and businesses have developed awareness of green technology innovation. At this point, the implementation of ER can stimulate long-term investment and collaboration by businesses, accelerating the development and application of green technology. As illustrated in Fig. 3. Figure 3 Moderating effect of ER on the relationship between GTI and EEE. Full size image While we have gained further insights into the impact of GTI on EEE and the role of ER in this effect, the specific source of GTI’s influence on EEE remains unknown. This is because GTI encompasses both the development of new energy technologies and improvement of environmental protection and resource recycling technologies. To unravel this mystery, the study decomposed GTI into SubGI and SymGI and conducted a new empirical analysis, as shown in Table 5. Under the weight matrix \\({W}_{b}\\), the coefficient of SubGI is significantly negative in the total effect, consistent with the trend observed in the GTI coefficient in Table 4. However, the coefficient of SymGI is not significant. This indicates that the effect of GTI on EEE is primarily driven by SubGI31. Which means GTI affects EEE mainly through the development and expansion of new clean energy technologies11. The possible reason is that new clean energy technologies not only reduce resource wastage but also reduce dependence on traditional fossil fuels, further reducing greenhouse gas emissions66. Furthermore, the role of ER and its effect on SubGI’s impact on EEE remain consistent with the results before the decomposition of GTI. Estimated results after EEE decomposition To further estimate which component of EEE is influenced by GTI, as EEE is composed of PTE and SE, this study decomposed EEE into PTE and SE and conducted new empirical analysis, as shown in Table 6. Under the three spatial weight matrices, the coefficients of the explanatory variables corresponding to SE are almost non-significant, indicating that the impact of GTI on EEE is primarily manifested in PTE. Therefore, this research takes PTE as the dependent variable and decomposes GTI into SubGI and SymGI for re-estimation, with results shown in Table 7. Table 6 Results of the impact of GTI on PTE and SE under ER. Full size table Table 7 Results of direct, indirect, and total effects of SubGI, SymGI on PTE under ER in the short-term. Full size table Under the spatial weight matrix \\({W}_{b}\\), the total effect of SubGI on PTE is significantly negative, consistent with the direction of the spatial effect, indicating that SubGI’s impact on the PTE of neighboring areas is greater than on the local area. Additionally, the total effect of SymGI on PTE is not significant, suggesting that GTI’s impact on PTE is also driven by SymGI47,49. The possible reason is that the development of SubGI requires a significant capital and labor input, and as neighboring areas, some of the capital and labor within the province will also be partially absorbed, leading to a decrease in PTE given the allocated resources. In contrast, under the interaction of direct and indirect effects, ER did not play a role in the impact of SymGI on PTE. The possible reason for this is that the implementation of ER increases the emission costs for local businesses, reduces the incentive for local businesses to develop GTI, and subsequently slows down the competition for capital and labor in neighboring areas, leading to a mutual offset between the two effects. The robustness test To ensure the reliability and accuracy of the methodology adopted and the conclusions obtained in this article, a robustness test was conducted by replacing the control variables and the explanatory variable with a one-period lag. Firstly, in the robustness test involving the replacement of control variables, fiscal technology expenditure (FST) was substituted for R&D investment intensity. The effects of GTI, SubGI, SymGI, ER and the interaction term of ER with GTI, SubGI and SymGI on EEE as well as PTE are re-evaluated in this study under short-term effects based on the DSDM and the geographical distance weight matrix (\\({\\mathrm{W}}_{b}\\)), respectively. The results presented in Table 8 show that all outcomes after the replacement of control variables maintain the same positive or negative signs and levels of significance as the original results. The coefficients exhibit only minor changes when comparing before and after the substitution. This suggests a high degree of robustness in the findings, thereby confirming the reliability of our estimates. Table 8 Results of robustness tests for replacement variables. Full size table Secondly, in the short-term effects, the explanatory variables’ spatial Durbin lag one-period models were employed, along with the geographical distance weight matrix (\\({\\mathrm{W}}_{b}\\)), to reassess the impact of GTI, SubGI, SymGI, ER, as well as the interactions between ER and GTI, SubGI, and SymGI on EEE and PTE. Similarly, the results in Table 9 demonstrate that all outcomes using lagged one-period explanatory variables maintain the same positive or negative signs and levels of significance as the dynamic Durbin model’s results. Coefficients exhibit only minor changes, reaffirming the strong robustness of the findings and the reliability of our estimates.","filter_flag":1}
{"title":"Cashing In on High-End HVAC Equipment - ACHR NEWS","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM4MTEtY2FzaGluZy1pbi1vbi1oaWdoLWVuZC1odmFjLWVxdWlwbWVudNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM4MTEtY2FzaGluZy1pbi1vbi1oaWdoLWVuZC1odmFjLWVxdWlwbWVudNIBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM4MTEtY2FzaGluZy1pbi1vbi1oaWdoLWVuZC1odmFjLWVxdWlwbWVudNIBAA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM4MTEtY2FzaGluZy1pbi1vbi1oaWdoLWVuZC1odmFjLWVxdWlwbWVudNIBAA?oc=5\" target=\"_blank\">Cashing In on High-End HVAC Equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ACHR NEWS<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cashing In on High-End HVAC Equipment - ACHR NEWS","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM4MTEtY2FzaGluZy1pbi1vbi1oaWdoLWVuZC1odmFjLWVxdWlwbWVudNIBAA?oc=5\" target=\"_blank\">Cashing In on High-End HVAC Equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ACHR NEWS<\/font>","source.href":"https:\/\/www.achrnews.com","source.title":"ACHR NEWS","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"✕ When it comes to the comforts of home, a functioning heating and\/or cooling system, especially in weather extremes, is right up there with indoor plumbing. You just gotta have it. But for homeowners who can afford more, or for whom little extras make a big difference, the HVAC industry offers an array of higher-end products that can improve comfort, maximize energy efficiency, increase ease of servicing and use, and maybe add designer flair to a showcase home. The ACHR NEWS recently surveyed several major manufacturers about their high-end catalogs, asking each to put forth a product or two that meets that definition. Here are the details of some of the equipment they told us about. Bosch IDS Premium Bosch’s IDS Premium Connected, a heat-pump system for ducted applications, offers high efficiency, connectivity, and monitoring features that benefit both contractor and homeowner, said Shiyu Liu, senior product manager at Bosch Home Comfort. Liu said the IDS Premium Connected is a versatile system suited for home retrofits as well as new construction. “It is a particularly excellent fit for those homeowners who are aiming for maximum energy efficiency and associated rebates and tax credits for their green home upgrades,” he said. The IDS (the initials stand for Inverter Ducted Split) Premium Connected boasts a SEER2 rating of up to 20, an HSPF2 of up to 9.5, and an inverter drive that adjusts compressor speed to optimize comfort, minimize noise, and use only the amount of energy needed, Liu said. The outdoor unit is connected to a BVA20 air handler with a two-stage, electronically commutated motor. The IDS Premium Connected is available in four capacities ranging from 2 tons to 5 tons. The system connects wirelessly to the Bosch EasyAir app, an interactive platform for contractors and homeowners. EasyAir simplifies installation and troubleshooting, Liu said. “With just a few swipes on their phones, contractors can easily access information about installation, warranty registration, and how to monitor the unit remotely,” he said. Homeowners must authorize a contractor’s remote access to the system. The connectivity allows technicians, for example, to remotely check the heat pump’s operation, get notifications in case of system faults, and view fault codes. Contractors can even manage which of their technicians can monitor which homeowner units. Daikin VRV Life FLEXIBILITY: The Daikin VRV Life heat pump system adapts high-end variable refrigerant flow technology to residential use and can be paired with a gas furnace for dual-fuel heating. (Courtesy of Daikin Comfort Technologies) Daikin’s VRV Life is a variable refrigerant volume heat pump system, with efficiencies of up to 18.6 SEER2 and 9 HSPF2, engineered for residential use. “One outdoor unit can connect to up to nine indoor units, and the VRV Life can be used with either ductless or ducted systems or a combination of both,” said David Palazzolo, director of residential product marketing at Daikin Comfort Technologies North America, Inc. “VRV Life provides flexibility for all applications, from simplistic to the most complex, from large to small homes or apartments, from new to older construction. The more complex the application, the more VRV Life, as a single system, will provide the contractor and end user with a high-end system,” Palazzolo said. The unit has an inverter compressor and a variable-speed fan, enabling it to “ramp up and down and provide only the necessary refrigerant to cool or heat to meet the demand, and therefore expend only the energy necessary,” Palazzolo said. “The system can operate in outdoor temperatures as low as -4°F and as high as 122°F,” he said. “Contractors as well as homeowners will appreciate the VRV Life’s flexibility,” Palazzolo said. “VRV Life offers gas furnace, heat pump, or a combination of dual-fuel heating capability by using a traditional residential ducted gas furnace and evaporator coil that can operate using either gas heating or heat pump heating,” he said. “That versatility helps contractors overcome a variety of heating and cooling challenges and meet homeowners’ needs,” he said. Remote monitoring of the VRV Life, by both homeowners and contractors, is available with the use of either the Daikin One+ or the Daikin One touch smart thermostats. The VRV Life is available in capacities of 2, 3, 4, and 5 tons. YORK TM9V EFFICIENCY STANDOUT: The York TM9V furnace has a two-stage burner, an electronically commutated fan motor, and annual fuel utilization efficiency rated at 96%. (Courtesy of Johnson Controls) The York TM9V two-stage variable-speed furnace, from Johnson Controls, offers an annual fuel utilization efficiency (AFUE) of up to 96% and can be fine-tuned to specific heating needs. “This is an ideal gas furnace for homes, with hassle-free installation in tight spaces,” said Tom Tasker, senior product manager for ducted system at Johnson Controls. The TM9V has a two-stage burner and an electronically commutated fan motor, and its compact size (33 inches high) and features like reinforced doors, quarter-turn knobs and positioning flexibility make installations and servicing hassle-free, Tasker said. A self-monitoring system allows for quick diagnostics, he said, and technicians can access the units remotely, with permissions, to evaluate system operation. The unit’s high efficiency and ease of operation, plus the indoor comfort it provides, are some of the features that make it high end, Tasker said. “High-end heating solutions are first and foremost about homeowner comfort. They provide premium control over the temperature and humidity of the conditioned space,” Tasker said. “Homeowners should expect their system to stay close to setpoint without wide temperature swings.” The TM9V’s ClimaTrak feature allows for fine-tuning of the blower for specific functions, such as operation in arid climates or to maximize the use of IAQ accessories like UV-C lights and MERV 16 filters, Tasker said. Tasker said the TM9V is an ideal partner for the York YZT two-stage heat pump for those homeowners in cold climates who are looking for a hybrid system to cut utility bills and their carbon footprint. Hybrid systems can reduce energy use by as much as two-thirds when the heat pump is operating, Tasker said, and eliminate the need for electric resistance backup heating. The TM9V is available in capacities ranging from 2 tons to 5 tons and can be engineered to burn either natural gas or propane. LG Hydro Kit WASTE NOT: The LG High Temperature Hydro Kit is captures heat rejected during the air-conditioning process and heats water with it for other uses, such as domestic hot water. (Courtesy of LG Air Conditioning Technologies) LG’s new High Temperature Hydro Kit is a heat exchanger that captures heat rejected during the air-conditioning process and uses it to heat water for other applications, such as domestic hot water or radiant floor heating. The Hydro Kit can provide water with a leaving temperature of between 86°F and 176°F and is compatible with LG’s Multi V outdoor units, variable-refrigerant flow (VRF) equipment that can provide heating and cooling to different spaces simultaneously. High efficiency, flexibility, and performance are the Hydro Kit’s hallmarks, said Parth Patel, a senior product support engineer at LG Air Conditioning Technologies. The Hyrdo Kit meets the current market trends toward sustainability and decarbonization, Patel said. “The Hydro Kit utilizes waste energy generated during the conditioning process and enhances the energy efficiency of LG VRF systems,” Patel said. “This allows the hot water generated to be distributed out to several different applications with integrated controls that set the temperature of the leaving water, hot water tank temperature, or the temperature of the conditioned space.” The system can also be integrated with various thermostats and sensors, he said. “In situations where robust heat recovery may not be necessary, users can still benefit from repurposing the heat, using the LG Hydro Kit, and maximizing the value of the system,” Patel added. The Hydro Kit can provide domestic hot water without the need for a separate water heater, for example. Features that appeal to contractors and technicians, Patel said, include a compact footprint, accessible piping connections, easy integration into a system control network, and the minimal space required for the exhaust system. METUS EZ Fit SLEEK DESIGN: The METUS EZ Fit is a ceiling-mounted indoor unit, serviceable from below without the need for above-ceiling access, that offers a SEER2 of up to 22.9. (Courtesy of Mitsubishi Electric Trane HVAC US) The EZ Fit from Mitsubishi Electric Trane HVAC US, or METUS, is a ceiling-mounted indoor unit for a ductless heat-pump system that offers a SEER2 rating of up to 22.9. The EZ Fit, for use with either a single- or multizone configuration, comes in four capacities, ranging from a half-ton (for multi-zone use only) to 1.5 tons. Ken Johnson, senior manager of performance construction at METUS, said architects, builders and homeowners in the U.S. like ceiling-mounted indoor units for their aesthetics. “EZ Fit has a clean, flush-mount appearance and a single outlet vane resembling a linear diffuser found in high-end homes,” Johnson said. “The unit recesses between ceiling joists and requires no access panel.” EZ Fit offers stable room temperatures and quiet operation of both the indoor and outdoor units, Johnson said. Ductless systems, he pointed out, don’t introduce dust into the conditioned space, don’t require duct cleaning, and don’t suffer from the energy loss that comes with duct leakage. Technicians, Johnson said, can service the unit from below and don’t need ceiling access. “The filter, accessed through the grille, can be rinsed, cleaned, dried, and put back into the system, and the filter will last many years, providing the homeowner with significant savings,” he said. The units fit between ceiling joists, Johnson said, and need only 8 inches of clearance. Each unit comes with a condensate lift, eliminating the need for a condensate pump, he said. “There are many applications for EZ Fit, including custom homes, townhomes, condos, single-family detached, higher-end apartments, and accessory dwelling units,” Johnson said. “They are also ideal for retrofits and additions where it doesn’t make sense to extend the ductwork for an existing forced-air system.” Midea Advantage HIGH PERFORMANCE: The Midea Advantage High Wall is an indoor unit compatible with Midea Advantage heat-pump systems, which can operate continuously at outdoor temperatures of between 5°F and 122°F. (Courtesy of Midea) Midea’s Advantage High Wall is an indoor unit that’s compatible with Midea’s Advantage single- and multizone systems. The unit, which has four fully modulating fan speeds, can achieve up to 28.1 SEER2 and up to 13 HSPF2, said David Rames, senior product manager at Midea. “The Advantage High Wall indoor unit is an efficient, variable-speed heat-pump solution with individual control, making it a perfect supplement of heating and cooling to save more energy bills while enhancing the comfort level of a specific space,” Rames said. Rames said the Advantage High Wall system can achieve an energy savings of up to 30% compared to a 14.2 SEER2 system, and that using Midea’s Eco mode can cut energy costs by up to 60%. Midea Advantage systems can operate continuously at outdoor temperatures of between 5°F and 122°F, Rames said. Features include a relative humidity sensor that allows users to adjust humidity in 5% increments, an anti-corrosion fin coating, and humidity removal, with the largest model, of up to 12.1 pints per hour. The units come in several capacities, ranging from three-quarters of a ton to 3 tons. Technicians, Rames said, will appreciate the installation flexibility the Advantage High Wall provides; the maximum refrigerant pipe length is 213 and the maximum height differential is 98 feet. An exterior wall hole of just three inches in diameter is required for the refrigerant piping and electrical cable. “You can flexibly install the unit in any needed area,” Rames said. The unit disassembles quickly and has a removable filter on top, making for simplified maintenance, Rames said. The motor and blower can be serviced without removing the cabinet, he said. Trane XV20i SMART SYSTEM: Trane’s XV20i heat pump comes equipped with advance communications technology and a variable-speed fan that helps it adapt in real time to the needs of the conditioned space. (Courtesy of Trane Residential) The Trane XV20i heat pump, with a SEER2 of up to 20.5 and an HSPF2 of up to 8.7, is one of the most efficient heat pumps on the market, according to Katie Davis, vice president of engineering and technology at Trane Residential. The unit has a variable-speed fan that adapts to the needs of the conditioned space in real time and is equipped with communications technologies that simplify installation and servicing and, in zoned applications, optimize comfort and efficiency, Davis said. “Trane’s XV20i variable-speed heat pump with Link is perfect for the homeowner looking to maximize energy efficiency … whether this is a luxury apartment, a remodeled home, or new construction,” Davis said. Link technology, Davis said, assists with the installation of the XV20i by automating configuration, charging, and system testing. With homeowner opt-in, Link lets technicians remotely monitor the system, get fault alerts, adjust thermostat settings if needed, and receive descriptions of potential issues and their causes should a fault be identified, she said. “If a home visit is necessary, the technician can arrive onsite with the parts needed to repair the system,” Davis said. New to Link technology, as of October, is Link Zoning, the brains of an advanced, quiet, and intelligent duct system that learns where airflow is needed most, Davis said. “The new Link Zoning system uses a network of controls, sensors, and motorized dampers for up to six zones to optimize temperature and humidity throughout a home, delivering warm or cool air to only the rooms and zones that need it,” she said. The XV20i comes in four capacities: 2, 3, 4, and 5 tons.","filter_flag":1}
{"title":"Navien enters HVAC market with new product launch - Supply House Times","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5","id":"CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA","guidislink":false,"published":"Fri, 10 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=314, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5\" target=\"_blank\">Navien enters HVAC market with new product launch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply House Times<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Navien enters HVAC market with new product launch - Supply House Times","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWmh0dHBzOi8vd3d3LnN1cHBseWh0LmNvbS9hcnRpY2xlcy8xMDU1OTgtbmF2aWVuLWVudGVycy1odmFjLW1hcmtldC13aXRoLW5ldy1wcm9kdWN0LWxhdW5jaNIBAA?oc=5\" target=\"_blank\">Navien enters HVAC market with new product launch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Supply House Times<\/font>","source.href":"https:\/\/www.supplyht.com","source.title":"Supply House Times","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"✕ In late September Navien held a virtual product launch event to announce three new products, one of which is the company’s first-ever HVAC product — the NPF Hydro-furnace. To hear more about the product launch and Naviens plans for the HVAC market, Supply House Times chatted with Product Management Director David Hoskyn after the event. Available in Upflow and Horizontal configurations, the NPF comes in two sizes of 60,000 BTU\/h and 100,000 BTU\/h that both boast 97.0% AFUE and meet the stringent requirements of SCAQMD rule 1111 for Ultra-Low NOx performance. SHT: Tell us about the decision to branch into the HVAC market. Why is now the right time? DH: We have heard that question many times during the development and launch of the Hydro-furnace, but I want to point out that indirectly we have been in HVAC for a while. We have seen our boilers or water heaters feeding air handling units with hydronics coils for many years. The NPF now combines those to give us a true HVAC product in the market. We also understand that the entire industry is evolving and changing, but we feel there is still a place for this product. SHT: What is the Hydro-Furnace, and how does it work exactly? DH: The Hydro-furnace combines the proven technology of our stainless-steel condensing heat exchanger with a hydronic heat exchanger coil that is placed in the conditioned air stream. In heating mode, water is heated in the combustion heat exchanger and pumped up through the hydronic coil. The hot water flowing through the coil then heats the air stream. One major advantage of this process is our ability to vary the combustion capacity of the unit from 15-100%, which combined with the ECM variable speed blower provides a very consistent room temperature throughout the varying demands of the heating season. This design also allows us to operate the unit at a much lower plenum temperature, and control the unit based on either the supply air temperature or return air temperature. Available in Upflow and Horizontal configurations, the NPF comes in two sizes of 60,000 BTU\/h and 100,000 BTU\/h that both boast 97.0% AFUE and meet the stringent requirements of SCAQMD rule 1111 for Ultra-Low NOx performance. SHT: How much research and development went into this product? Have you considered the specific needs and preferences of HVAC contractors in your product design? DH: As with all our products, there was extensive R&D done on the Hydro-furnace, along with field trials in existing home applications. The benefit of this product is that it adapts much of the technology from our other boilers, combining many proven off the shelf components. In terms of the needs and preferences of the HVAC contractors, we tried to address those through industry standard cabinet widths to adapt to coils, common furnace heights to help with replacement work, and fully capable airflows up to 1.0” static. In addition, the control panel on the NPF provides a clear setup wizard to assist with set up, along with full menu functionality to adjust heating, cooling, and airflow. The NPF also includes the option for either variable air control, or constant air volume. All of this is done using any single stage or two stage thermostat and does not require the addition of a special wall control. And to help support the contractor, the NPF will carry a strong warranty which will include 1 year labor coverage for all products. SHT: How will Navien address environmental concerns and energy efficiency requirements in its HVAC products? DH: The name Navien is made up from the words “Navigating Energy and Environment” and comes from our desire to make products that are environmentally responsible and lower energy usage. From our launch of the first condensing tankless water heater in North America back in 2008, to our condensing combi and boiler products, our focus is on high efficiency products to lower energy use and emissions. The NPF continues that with a 97.0% AFUE rating, and controls that operate the unit only at the capacity required to satisfy the load. Combined with Ultra-Low NOx on all the units, not just market specific ones, we help lower the GHG emissions throughout the US and Canada. SHT: What are the future plans for Navien and the HVAC market? Are there more new products on the pipeline? DH: We are always looking at products that we can add to our lineup, but only if it adds value to the market. If we can introduce a product that does not currently exist, or improve on one that already does, then we certainly will consider it. Since Navien is part of a global company, we are also looking at other markets such as Europe and Asia to follow developments there. I am confident that the NPF will not be the last new product that we introduce for North America. SHT: What are the top customer — contractor and end user — needs in the tankless market in 2023? DH: As we know the tankless industry is going through some changes right now. Issues such as efficiency regulations, electrification, and restrictions on greenhouse gas emissions all have been in the news lately. The trades are also still trying to bring more people to the workforce to help install and service whatever products are out there. Finally the end users are still not sure what many of these changes mean for them in terms of all gas appliances, not just water heaters. But for tankless in general I don’t think the needs have changed that much – the contractor wants you to have a good product that is easy to install and service, and provide training and technical support to help them be efficient at their job. They also want to know that you are a reliable source for information about what is going on in the industry, since most are too busy to keep up with the changes. As for the end user – they want hot water without having to worry about it. SHT: How has the global push for decarbonization affected Navien’s product development and go-to-market strategy? DH: As I mentioned before, we are looking at the changes that are happening not just in the US and Canada, but also in Europe, Asia, and other countries. We are exploring products in the electric segment for North America, both resistance and heat pump technology. Adding one or both of those to our lineup will happen once we have the right products for our market. In addition we are testing with Hydrogen as a fuel source, both as a blend and pure hydrogen. That work is being done while still improving and developing our gas fired products, including additional residential commercial boilers and commercial water heaters. SHT: What new technologies and product features are on the rise in the water heating market? DH: Navien believes there is a place in the market for both electric and gas fired water heaters. We continue to look at options for electric source water heaters, but also exploring ways to improve gas efficiency and lower greenhouse gas emissions. Moving forward solutions such as dual fuel source products can help address applications that utilize the best of both technologies. An evolving area of products is the user interface, or the control panel that is now showing up on products. The launch of the Navien NPE-A2\/S2 included the EZ-Nav panel, which is a multi-line backlit display. This control makes the set up and operation of the product simpler and faster for the installer and helps a service contractor with maintenance or issues in the field. Wireless connectivity to the product for the end user also continues to grow, as IOT products become the norm in homes nowadays. Finally, as the workforce needs to be educated on the evolving technologies, we are looking at ways to help shorten the learning curve on both installation and service of the products. You will see more service tools that interface through a phone or tablet with the products in the future, reducing diagnostic time in the field.","filter_flag":1}
{"title":"LG INDUCTION COOKTOPS, RANGES FIRST IN INDUSTRY CERTIFIED TO NEW ENERGY STAR SPECS - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xnLWluZHVjdGlvbi1jb29rdG9wcy1yYW5nZXMtZmlyc3QtaW4taW5kdXN0cnktY2VydGlmaWVkLXRvLW5ldy1lbmVyZ3ktc3Rhci1zcGVjcy0zMDE5OTgzMjQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xnLWluZHVjdGlvbi1jb29rdG9wcy1yYW5nZXMtZmlyc3QtaW4taW5kdXN0cnktY2VydGlmaWVkLXRvLW5ldy1lbmVyZ3ktc3Rhci1zcGVjcy0zMDE5OTgzMjQuaHRtbNIBAA?oc=5","id":"CBMiiQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xnLWluZHVjdGlvbi1jb29rdG9wcy1yYW5nZXMtZmlyc3QtaW4taW5kdXN0cnktY2VydGlmaWVkLXRvLW5ldy1lbmVyZ3ktc3Rhci1zcGVjcy0zMDE5OTgzMjQuaHRtbNIBAA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xnLWluZHVjdGlvbi1jb29rdG9wcy1yYW5nZXMtZmlyc3QtaW4taW5kdXN0cnktY2VydGlmaWVkLXRvLW5ldy1lbmVyZ3ktc3Rhci1zcGVjcy0zMDE5OTgzMjQuaHRtbNIBAA?oc=5\" target=\"_blank\">LG INDUCTION COOKTOPS, RANGES FIRST IN INDUSTRY CERTIFIED TO NEW ENERGY STAR SPECS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LG INDUCTION COOKTOPS, RANGES FIRST IN INDUSTRY CERTIFIED TO NEW ENERGY STAR SPECS - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2xnLWluZHVjdGlvbi1jb29rdG9wcy1yYW5nZXMtZmlyc3QtaW4taW5kdXN0cnktY2VydGlmaWVkLXRvLW5ldy1lbmVyZ3ktc3Rhci1zcGVjcy0zMDE5OTgzMjQuaHRtbNIBAA?oc=5\" target=\"_blank\">LG INDUCTION COOKTOPS, RANGES FIRST IN INDUSTRY CERTIFIED TO NEW ENERGY STAR SPECS<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"ENERGY STAR Certified Induction Cooking Products Represent Key Element of LG's Whole Home Electrification Strategy WASHINGTON, Nov. 27, 2023 \/PRNewswire\/ -- Induction cooktops and ranges from LG Electronics are the first in the industry to be certified to the brand new ENERGY STAR® specification for residential electric cooking products, according to the U.S. Environmental Protection Agency. LG LSIL6334FE Energy Star-Certified Oven So far, seven LG induction products have been certified to the ENERGY STAR residential electric cooking products version 1.0 specification. The first ENERGY STAR certified induction cooktops are 30- and 36-inch LG models, a 36-inch LG STUDIO model and a 36-inch model from LG's luxury built-in appliance brand, Signature Kitchen Suite. The first ENERGY STAR certified induction ranges are three LG slide-in models. According to the EPA, ENERGY STAR certified residential electric cooking products under the Version 1 specification will offer users, on average, energy savings of approximately 18 percent from standard electric units. ENERGY STAR certified induction models in particular offer faster heating, precision controls, easy cleaning, smart capabilities, various sensors and multiple user-friendly product features. \"Cooking products represent the next frontier for residential energy efficiency, with induction technology offering an exciting new way for American households to be part of the clean energy future,\" said U.S Environmental Protection Agency ENERGY STAR Products Director Ann Bailey. \"If all residential electric cooking tops sold in the United States were ENERGY STAR certified, energy cost savings would grow to $160 million each year, and almost 1.75 billion pounds of greenhouse gas emissions would be prevented.\" Thomas Yoon, CEO of LG Electronics North America, applauded the EPA for the new ENERGY STAR cooking specs: \"As ENERGY STAR Partner of the Year, we are proud to usher in the new ENERGY STAR cooking category, which will help consumers further reduce their carbon footprint.\" Yoon explained that the ENERGY STAR certified induction cooking products are key elements of the company's broader electrification strategy, which empowers customers to convert buildings to conserve energy, saving money and protecting the environment in the process. In addition to electric cooking innovations, LG's suite of whole home electrification products includes ENERGY STAR certified heat-pump-enabled HVAC systems, water heaters and dryers, as well as energy storage systems and electric vehicle charging systems. To further aid in energy and cost savings, the LG ThinQ Energy platform allows customers to take control of their home's energy usage at their fingertips. About LG Electronics USA Ten-time ENERGY STAR® Partner of the Year LG Electronics USA, Inc., based in Englewood Cliffs, N.J., is the North American subsidiary of LG Electronics, Inc., a $68 billion global innovator in technology and manufacturing. In the United States, LG sells a wide range of innovative home appliances, home entertainment products, commercial displays, air conditioning systems, energy solutions and vehicle components. The company's commitment to environmental sustainability and its \"Life's Good\" marketing theme encompass how LG is dedicated to people's happiness by exceeding expectations today and tomorrow. www.LG.com. Media Contacts: LG Electronics USA John I. Taylor JL Lavina [email protected] [email protected] +1 202 719 3490 +1 917 386 4213 Jennifer Tayebi [email protected] +1 734 395 0780 SOURCE LG Electronics (LG)","filter_flag":1}
{"title":"The New Decarbonization Paradigm for Oil and Gas - BCG","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV3LWRlY2FyYm9uaXphdGlvbi1wYXJhZGlnbS1mb3Itb2lsLWFuZC1nYXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV3LWRlY2FyYm9uaXphdGlvbi1wYXJhZGlnbS1mb3Itb2lsLWFuZC1nYXPSAQA?oc=5","id":"CBMiUmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV3LWRlY2FyYm9uaXphdGlvbi1wYXJhZGlnbS1mb3Itb2lsLWFuZC1nYXPSAQA","guidislink":false,"published":"Wed, 22 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=326, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV3LWRlY2FyYm9uaXphdGlvbi1wYXJhZGlnbS1mb3Itb2lsLWFuZC1nYXPSAQA?oc=5\" target=\"_blank\">The New Decarbonization Paradigm for Oil and Gas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The New Decarbonization Paradigm for Oil and Gas - BCG","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUmh0dHBzOi8vd3d3LmJjZy5jb20vcHVibGljYXRpb25zLzIwMjMvbmV3LWRlY2FyYm9uaXphdGlvbi1wYXJhZGlnbS1mb3Itb2lsLWFuZC1nYXPSAQA?oc=5\" target=\"_blank\">The New Decarbonization Paradigm for Oil and Gas<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BCG<\/font>","source.href":"https:\/\/www.bcg.com","source.title":"BCG","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Many companies in the global oil and gas (O&G) industry are moving forward in their efforts to decarbonize. Yet the gap between the leaders and the laggards is growing: The evidence shows that huge differences remain in both the speed and the cost of decarbonization between companies and even among similar assets at the same company. Closing this gap will be critical: to reach net zero by 2050, the average energy intensity of the global supply of oil and gas in 2030 will need to be more than 50% lower than it was in 2022. Companies that lead on decarbonization have proven that they can gain not just a smaller carbon footprint but also a material bottom-line impact, potentially higher revenues, and real competitive advantage. They do so by pulling every abatement lever applicable to their portfolio—including greater energy efficiency, reductions in escaping gases, and switching to low-carbon sources of power and heat—in the most effective way possible. Companies that lead on decarbonization have proven that they can gain material bottom-line impact and real competitive advantage. We analyze how these leaders have gotten past the decarbonization commitment stage and are now reaping the benefits of developing superior decarbonization capabilities. Finally, we lay out how other companies can follow in their lower-carbon footprints. Good News and Bad News We looked at 40 O&G companies, which together contribute more than 25% of the sector’s GHG emissions. The good news is that our analysis shows that 20% of them reduced either their emissions or their emissions intensity by more than 20% between 2017 and 2022. To get there, these companies have pulled on one or more decarbonization levers, including: A shift to lower-emitting products (from oil to gas, for example) Operational and energy efficiencies Flaring reductions Methane emissions reductions Renewable energy Carbon capture, utilization, and storage (CCUS) Switching to bio-based fuels for power and heat generation Many of the companies that are making progress on decarbonization are actively using revenue opportunities to help fund their further decarbonization efforts. Some are installing solar panels to replace the electricity generated by their gas power plants, for example, and at least one plans to sell the surplus energy to generate cash. And one petrochemicals company was able to capture enough CO 2 through CCUS technology to use it to increase its methanol production. The bad news, however, is that the gap between what the industry has accomplished so far and what needs to be done is still huge. Producers of around 40% of global oil and gas production have not yet announced any commitment to a net zero target, and at least half of that is concentrated at the top ten companies. In fact, at least 40% of companies in our analysis actually increased their emissions or emissions intensity between 2017 and 2022. Moreover, there is frequently a large variance in emissions intensity among a company’s assets in the same asset class. Despite similar levels of complexity and maturity, and even when they are within the same jurisdiction and under the same operator, some assets are as much as seven times more emissions intensive than others. The Promise Yet those O&G companies that are developing superior decarbonization capabilities have already begun to capture competitive advantage through both bottom-line improvement and strategic gains. Consider, for example, an offshore O&G platform in a mature basin. Many of the multiple gas turbines, compressors, pumps, and boilers it runs are redundant, serving primarily as back-up, and are operating with less-than-optimal energy efficiency. Leading companies are removing such unnecessary equipment and run the rest as efficiently as possible. Less equipment directly cuts operations and maintenance activities, and thus costs. By reducing its equipment needs, one North Sea platform operator lowered emissions by 30% and operating costs by 20%. In addition, according to reports, 23% of global GHG emissions across industries are subject to an emissions trading system or carbon tax of some kind, and another 13% to various carbon reduction incentives such as carbon credits. In these jurisdictions, less emissions directly results in either savings or new sources of income. In the UK, for example, where carbon prices on the Emissions Trading System hit close to £100 per ton of CO 2 e in 2022, removing a single gas turbine could reduce emissions permanently by 20 kilotons of CO 2 e and could lead to up to £2 million in savings per year. According to our analysis, a carbon price of $100 per ton would add between $2 and $4 per barrel to oil refineries’ operating costs. That’s a lot, given that refineries operate at low margins, so the additional cost could risk the refinery’s competitive advantage. A further risk is that a company’s performance on environmental, social, and governance (ESG) metrics, including its emissions performance, is beginning to influence its borrowing costs, with sustainability leaders securing a significantly lower cost of capital—an average of around 266 basis points less than O&G sector laggards, according to our analysis. O&G companies that can decarbonize quickly will also gain a real strategic advantage. In jurisdictions with decarbonization targets, for example, the advantage will go to producers of oil and gas with the lowest carbon footprint. The result: a greater likelihood that they will retain their regulatory and social licenses to operate and earn the right to redevelop their current assets and to gain access to new acreage. And they can use their advantage as leverage to pursue M&A deals in these jurisdictions. Moreover, the technologies required to decarbonize current assets can also give companies a head start in entering and scaling up new, higher-value energy and low-carbon businesses. For example, building an electrolyzer to decarbonize the supply of refinery hydrogen could open up future opportunities in the nascent low-carbon hydrogen market. Four Imperatives for the New Paradigm In our experience, taking the right approach to decarbonization can cut the typical O&G company’s abatement costs by up to 20% and increase revenues, boosting the return on their investment in some decarbonization projects by as much as 25%. To achieve these gains, companies must put into practice four key imperatives. (See Exhibit 1.)","filter_flag":1}
{"title":"IBS 2024 Show Home in Finishing Stages | NAHB - National Association of Home Builders","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5haGIub3JnL2Jsb2cvMjAyMy8xMS9pYnMtMjAyNC1zaG93LWhvbWUtaW4tZmluaXNoaW5nLXN0YWdlc9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5haGIub3JnL2Jsb2cvMjAyMy8xMS9pYnMtMjAyNC1zaG93LWhvbWUtaW4tZmluaXNoaW5nLXN0YWdlc9IBAA?oc=5","id":"CBMiSGh0dHBzOi8vd3d3Lm5haGIub3JnL2Jsb2cvMjAyMy8xMS9pYnMtMjAyNC1zaG93LWhvbWUtaW4tZmluaXNoaW5nLXN0YWdlc9IBAA","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5haGIub3JnL2Jsb2cvMjAyMy8xMS9pYnMtMjAyNC1zaG93LWhvbWUtaW4tZmluaXNoaW5nLXN0YWdlc9IBAA?oc=5\" target=\"_blank\">IBS 2024 Show Home in Finishing Stages | NAHB<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Association of Home Builders<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IBS 2024 Show Home in Finishing Stages | NAHB - National Association of Home Builders","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vd3d3Lm5haGIub3JnL2Jsb2cvMjAyMy8xMS9pYnMtMjAyNC1zaG93LWhvbWUtaW4tZmluaXNoaW5nLXN0YWdlc9IBAA?oc=5\" target=\"_blank\">IBS 2024 Show Home in Finishing Stages | NAHB<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Association of Home Builders<\/font>","source.href":"https:\/\/www.nahb.org","source.title":"National Association of Home Builders","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The flagship exhibit of the upcoming International Builders’ Show in Las Vegas, The New American Home® 2024 is in the final phase of construction. The build team has been working in overdrive as it prepares the home to make its official debut to IBS 2024 attendees February 27-29. “At any given time, we have 40 to 60 guys working around the house,” said Tim Unick, senior project manager at Sun West Custom Homes. “The work that our team is doing — with the partnerships, with the [Leading Suppliers Council] members, the sponsors, our own team and our trade partners — it couldn’t have gone any better.” The 2024 show home returns to the familiar, luxury-home community of Ascaya in Henderson, Nev., site of three previous editions of The New American Home (2019, 2020 and 2023). But the 2024 edition distinguishes itself with an extensive list of new products and eye-catching design elements. One such feature is a unique stone application that is prominently featured on the interior walls. The stone matches the home’s façade and is intended to blend with the natural landscape surrounding the property. Many other innovations are not as visible to the naked eye but will significantly enhance comfort and boost energy efficiency. Among them, a unique system of waterproofing and floor-heating products from Schluter were integrated throughout the master bedroom and bathroom. (Watch the video below for a sneak peak.) Like many other builders across the country, the build team of The New American Home 2024 has had to overcome a variety of challenges stemming from product delays. The project has managed to stay on schedule thanks to a crew that has embraced working extra hours at a fast pace to reach the finish line. “It’s like [driving] on cruise control at 130 mph in traffic,” Unick said. “It’s been crazy but it’s amazing. We’re excited to see this project finish and share it with everyone who has been involved.” For more details about the home’s featured products and expected performance, visit tnah.com.","filter_flag":1}
{"title":"Best Project, Energy\/Industrial Swift Prepared Foods - Engineering News-Record","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTc0ODgtYmVzdC1wcm9qZWN0LWVuZXJneS1pbmR1c3RyaWFsLXN3aWZ0LXByZXBhcmVkLWZvb2Rz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTc0ODgtYmVzdC1wcm9qZWN0LWVuZXJneS1pbmR1c3RyaWFsLXN3aWZ0LXByZXBhcmVkLWZvb2Rz0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTc0ODgtYmVzdC1wcm9qZWN0LWVuZXJneS1pbmR1c3RyaWFsLXN3aWZ0LXByZXBhcmVkLWZvb2Rz0gEA","guidislink":false,"published":"Mon, 13 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=13, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=317, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTc0ODgtYmVzdC1wcm9qZWN0LWVuZXJneS1pbmR1c3RyaWFsLXN3aWZ0LXByZXBhcmVkLWZvb2Rz0gEA?oc=5\" target=\"_blank\">Best Project, Energy\/Industrial Swift Prepared Foods<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Engineering News-Record<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Best Project, Energy\/Industrial Swift Prepared Foods - Engineering News-Record","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LmVuci5jb20vYXJ0aWNsZXMvNTc0ODgtYmVzdC1wcm9qZWN0LWVuZXJneS1pbmR1c3RyaWFsLXN3aWZ0LXByZXBhcmVkLWZvb2Rz0gEA?oc=5\" target=\"_blank\">Best Project, Energy\/Industrial Swift Prepared Foods<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Engineering News-Record<\/font>","source.href":"https:\/\/www.enr.com","source.title":"Engineering News-Record","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Swift Prepared Foods Columbia, Mo. BEST PROJECT Submitted by: Stellar Owner: Swift Prepared Foods Lead Design Firm: Tanya Tillett General Contractor\/Structural Engineer\/Civil Engineer\/MEP Engineer: Stellar Subcontractor: CNC Foundations Built on a greenfield site in Columbia, Mo., the 315,000-sq-ft Swift Prepared Foods facility produces a variety of dried meats, including salami, pepperoni, prosciutto, pancetta and coppa. Initial processing of raw product occurs in Unit 1. Product is then moved via robotic automated guided vehicles into Unit 2, which is the drying and salting area. Once drying or fermenting processes are complete, the product is moved into Units 3, 4, and 5, which are the ready-to-eat areas. From there, the product is sliced, packaged and shipped. Other areas of the facility feature a research and development plant and a show kitchen. In addition, Stellar designed and constructed two employee welfare areas on either side of the facility to separate the “raw” side personnel from “ready-to-eat” side personnel. At the main office, there’s a small pilot testing plant for new products and an Italian café-inspired show kitchen for customers. Photo courtesy of Notley Hawkins The $149-million two-year project broke ground in April 2021 amid the COVID-19 pandemic. At the beginning of the project, the team saw a shortage of roofing materials, which created challenges with interior construction. Process equipment purchased by the owner was being delivered from overseas, and unpredictable delivery dates caused some delays. Frequent coordination meetings were critical for timely completion of scopes of work. In the end, the team was able to deliver the facility on time in May 2023. The team took a three-phase approach, which included a BIM coordinator, a quality manager and a commissioning representative. Using BIM helped facilitate subcontractor meetings and real-time progress tracking, minimizing delays and incomplete installations. The integration of pre-functional checklists and site visits enabled timely completion and reduced the number of punch-list items. Additionally, the commissioning representative developed a hybrid quality plan, optimizing construction document reviews and resolving conflicts efficiently. Photo courtesy of Notley Hawkins Stellar’s quality control responsibilities spanned from the design phase to project completion and warranty period. For the Swift project, an internal quality representative was assigned early on to establish and manage a hybrid commissioning\/quality plan. This plan encompassed the installation of HVAC, utilities and electrical systems from design development to project close-out. The utilization of Procore software facilitated document storage and management throughout each phase. A notable feature of the project was the incorporation of advanced automation technology into the Italian meats and charcuterie production facility. Collaborative meetings between Stellar and Swift resulted in an energy efficient layout and advanced process equipment design. Automated guided vehicles, gantry robots and conveyor belts were employed to ensure seamless flow and maximize productivity. The increased production capacity and improved operational efficiency will enhance the client’s profitability and competitiveness. Moreover, the integration of advanced materials, such as those used in the facility’s design, sets new industry benchmarks for energy efficiency and sustainability.","filter_flag":1}
{"title":"Demand for More Efficient Hydraulic Systems on the Rise - Power & Motion","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL2h5ZHJhdWxpY3MvYXJ0aWNsZS8yMTI3NjY1NS9kYW5mb3NzLXBvd2VyLXNvbHV0aW9ucy1kZW1hbmQtZm9yLW1vcmUtZWZmaWNpZW50LWh5ZHJhdWxpYy1zeXN0ZW1zLW9uLXRoZS1yaXNl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL2h5ZHJhdWxpY3MvYXJ0aWNsZS8yMTI3NjY1NS9kYW5mb3NzLXBvd2VyLXNvbHV0aW9ucy1kZW1hbmQtZm9yLW1vcmUtZWZmaWNpZW50LWh5ZHJhdWxpYy1zeXN0ZW1zLW9uLXRoZS1yaXNl0gEA?oc=5","id":"CBMiiwFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL2h5ZHJhdWxpY3MvYXJ0aWNsZS8yMTI3NjY1NS9kYW5mb3NzLXBvd2VyLXNvbHV0aW9ucy1kZW1hbmQtZm9yLW1vcmUtZWZmaWNpZW50LWh5ZHJhdWxpYy1zeXN0ZW1zLW9uLXRoZS1yaXNl0gEA","guidislink":false,"published":"Mon, 06 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=310, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL2h5ZHJhdWxpY3MvYXJ0aWNsZS8yMTI3NjY1NS9kYW5mb3NzLXBvd2VyLXNvbHV0aW9ucy1kZW1hbmQtZm9yLW1vcmUtZWZmaWNpZW50LWh5ZHJhdWxpYy1zeXN0ZW1zLW9uLXRoZS1yaXNl0gEA?oc=5\" target=\"_blank\">Demand for More Efficient Hydraulic Systems on the Rise<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Power & Motion<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Demand for More Efficient Hydraulic Systems on the Rise - Power & Motion","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiiwFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL2h5ZHJhdWxpY3MvYXJ0aWNsZS8yMTI3NjY1NS9kYW5mb3NzLXBvd2VyLXNvbHV0aW9ucy1kZW1hbmQtZm9yLW1vcmUtZWZmaWNpZW50LWh5ZHJhdWxpYy1zeXN0ZW1zLW9uLXRoZS1yaXNl0gEA?oc=5\" target=\"_blank\">Demand for More Efficient Hydraulic Systems on the Rise<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Power & Motion<\/font>","source.href":"https:\/\/www.powermotiontech.com","source.title":"Power & Motion","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"P&M: How have you seen hydraulic component and system designs evolve in recent years? JH: We've been talking about electronic control systems taking the place of mechanical controls for years now. I can remember when electronically actuated hydraulics made up 5 or 7% of the market. Now we’re well above 50% – it’s been a 15-year journey to get there. The use of electronic controls is a long-term trend that will continue. A key reason is that OEMs want to differentiate and customize their solutions, and that is almost always done with software today. Hydraulic components have to be electronically actuated to work with these custom solutions. P&M: What are some of the key features or performance attributes your company is working to include with its hydraulic components and systems, or for which customers are asking? JH: Efficiency is, by far, the most common request we get from customers. They need more efficient hydraulic products and solutions, which is a big reason we continue to optimize components and develop new products that reduce power losses. A number of factors are driving this demand, including our customers’ sustainability agendas. Many of those agendas include product circularity, which is another area we’re focused on at Danfoss. We look at the complete lifecycle of the product, beginning with the design through to whether it can be remanufactured or recycled – and if not, how it can be disposed of in the most environmentally responsible manner. To attain true circularity and meet our targets as well as our customers’ targets, we are partnering with customers on the development of new products and solutions, transportation options, and lifecycle optimization. Power density remains a key attribute of hydraulics. With the rise of electric solutions, we’re continuing to improve our components, aiming for even smaller package sizes and higher pressures. READ MORE: Digital Hydraulics Improve Excavator Efficiency P&M: How much, if at all, are you seeing electronic alternatives taking the place of hydraulic components or systems? Can you offer some examples, and how you possibly see this trend progressing? JH: The electrification transformation of mobile machines is coming. It’s already here, to some degree. Electrics have long been important in material handling machines like forklifts. But now, almost every construction OEM has a lineup of battery-powered equipment. From excavators to wheel loaders, we see a number of machines with battery-powered electric architectures. In the past, we might have classified these machines as proofs of concept or reputation machines, where OEMs vied to be the first to introduce electric alternatives to conventional diesel engines. We’re moving beyond that now and starting to see production in significant volumes. Legislation plays a role in this. Some cities in Europe and Japan, for example, are mandating low- or zero-emission vehicles within city limits. Noise pollution is also an increasing target of legislation. In these cases, electrically powered machinery may be the only viable solution. We're still in the early stages of the transformation, but as buyers become more sensitive to emissions and the precision of controllability, electrification will accelerate. Today, many electric machines still have hydraulic systems because fluid power dominates in terms of linear actuation. The long-term trend, though, is that electrics will take more share from hydraulics.","filter_flag":1}
{"title":"Is Solid-State Electricity the Future of Home Electric? - Family Handyman","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9hcnRpY2xlL3NvbGlkLXN0YXRlLWVsZWN0cmljaXR5L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9hcnRpY2xlL3NvbGlkLXN0YXRlLWVsZWN0cmljaXR5L9IBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9hcnRpY2xlL3NvbGlkLXN0YXRlLWVsZWN0cmljaXR5L9IBAA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9hcnRpY2xlL3NvbGlkLXN0YXRlLWVsZWN0cmljaXR5L9IBAA?oc=5\" target=\"_blank\">Is Solid-State Electricity the Future of Home Electric?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Family Handyman<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Is Solid-State Electricity the Future of Home Electric? - Family Handyman","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZhbWlseWhhbmR5bWFuLmNvbS9hcnRpY2xlL3NvbGlkLXN0YXRlLWVsZWN0cmljaXR5L9IBAA?oc=5\" target=\"_blank\">Is Solid-State Electricity the Future of Home Electric?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Family Handyman<\/font>","source.href":"https:\/\/www.familyhandyman.com","source.title":"Family Handyman","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"One of the largest infrastructures on the planet might be getting an overhaul. Here's how solid-state electricity could impact your home. While some products, like cell phones and e-bikes, have skyrocketed with technological innovations over the last couple of decades, the electrical grid in our homes and other buildings has remained pretty much static. But that might be about to change. Starting in late 2024, silicon chips with solid-state technology will begin to be incorporated into some home electrical components, such as LED lighting, circuit breakers and outlet receptacles. For a non-techie, that might sound insignificant, complicated and\/or boring, but it’s something that could notably affect your life. Behind the scenes, these products are designed to keep you safer and make your home more energy efficient. “The fact that today’s modern world is still being powered by the same dangerous infrastructure from back in Thomas Edison’s day shows how ready society is for a change,” says Thar Casey, founder and CEO of AmberSemi. “Once this upgrade has occurred, solid-state will be the norm for every outlet, smart home ecosystem and LED dimmer switch in your home. A true second electrical revolution of the power grid will be complete.” Casey is understandably enthusiastic about solid-state chips. His company is leading the charge, partnering with components manufacturers to roll out the new technology. Gradually, consumers will start seeing packaging with the phrase “Powered by AmberSemi solid-state power technologies.” Here’s what to know about solid-state home electrical components, and when you can expect to see them in your home. What Does Solid-State Mean? Solid-state refers to electrical components, devices and systems based on semiconductor technology. These components are digital, so they operate without the need for moving or analog parts. Solid-state technology as a whole is not new, but it has been rapidly expanding to new products, from cellphones to rechargeable batteries. “The best way to illustrate the impact of solid-state tech is with televisions,” says Casey. “Look at the intelligence and expanded features possible in solid-state-based smart TVs, and how they are worlds more advanced than the old-school, bulky tube TVs that were the norm all the way up until the early 2000s.” What Are Solid-State Home Electric Components? Solid-state home electrical components are endpoints, such as dimmers, circuit breakers and smart-home systems that incorporate silicon chips. This makes them safer, because they cannot arc (create a prolonged electrical discharge). It also means they can be controlled digitally. Currently, AmberSemi holds a series of patents on the technology, and is working with global electrical products and semiconductor companies to integrate their chips into those products. Advantages of Home Electric Solid-State Components Solid-state components can control electricity digitally, and what that means for your home is that they are: Safer, because they are arc-free, so they don’t have the potential to create house fires. Surge proof. Programmable, so they can interface with AI and other smart-home tech to increase energy efficiency. Smaller in size, so they take up less infrastructure space. “Simply put, solid-state is the future of home electricity because it will make buildings profoundly safer, healthier, smarter and more energy-efficient,” says Casey. Solid-state electrical components may also have a profound effect on the industrial and regulatory sides of the industry. Being programmable means manufacturers don’t have to design as many components specific to product types and regions. Increased safety and efficiency also means new electrical codes could be more simple. Will Solid-State Products Cost More? In theory, no, says Casey. Once the technology reaches mass-market manufacturing scale, solid-state components should generally cost less per unit to manufacture than traditional components, while also providing energy savings in homes. “The big unknown will be if manufacturers increase the price of their technologies once solid-state is adopted, because of the direct increase in the value of their products based on added features,” says Casey. He uses an innovative Nest thermostat as an example. It initially launched at a high price point, sold well because of the technology, but is now available at a more reasonable price. When Will Solid-State Home Electrical Components Be Available? Some consumer products with solid-state tech will begin to hit the market in late 2024. But, it may take a while for it to become the norm. Casey attributes that in part to an “It ain’t broke, so why fix it” mentality within the industry. “The ‘old tech’ still works, the factories’ tooling is in place and optimized and they’re regularly pumping out millions of units efficiently around the world,” he says. “Plus, consumers are familiar with and accept the products and functionality as-is, and the companies make a lot of money today with the current arrangement, which creates hesitation to change.” Yet, solid-state technology has become the norm with many other products, so it’s likely home electric will be no exception. “There’s more motivation than ever to make the transformation,” says Casey. “The process is currently in motion. Within the next decade, we expect virtually all electrical endpoints to be solid-state.” About the Expert Thar Casey is founder and CEO of AmberSemi, where he oversees and spearheads all aspects of the company’s current growth trajectory. He is a seasoned, serial entrepreneur with a passion for bringing disruptive technology companies from concept to success.","filter_flag":1}
{"title":"Check out these new livestock products for ranchers - Successful Farming","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS9jaGVjay1vdXQtdGhlc2UtbmV3LXByb2R1Y3RzLWZvci1yYW5jaGVycy04MzkxNDQ30gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS9jaGVjay1vdXQtdGhlc2UtbmV3LXByb2R1Y3RzLWZvci1yYW5jaGVycy04MzkxNDQ30gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS9jaGVjay1vdXQtdGhlc2UtbmV3LXByb2R1Y3RzLWZvci1yYW5jaGVycy04MzkxNDQ30gEA","guidislink":false,"published":"Thu, 09 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=9, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=313, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS9jaGVjay1vdXQtdGhlc2UtbmV3LXByb2R1Y3RzLWZvci1yYW5jaGVycy04MzkxNDQ30gEA?oc=5\" target=\"_blank\">Check out these new livestock products for ranchers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Successful Farming<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Check out these new livestock products for ranchers - Successful Farming","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LmFncmljdWx0dXJlLmNvbS9jaGVjay1vdXQtdGhlc2UtbmV3LXByb2R1Y3RzLWZvci1yYW5jaGVycy04MzkxNDQ30gEA?oc=5\" target=\"_blank\">Check out these new livestock products for ranchers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Successful Farming<\/font>","source.href":"https:\/\/www.agriculture.com","source.title":"Successful Farming","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Detect sick calves Whisper On Arrival is a new technology product from Merck Animal Health and Allflex Livestock Intelligence that identifies sick calves needing treatment. The paddle-type device is used chute-side as calves are processed. When held against a calf’s chest (right side of chest, behind the elbow), it detects and measures heart and lung functions, and sends the data wirelessly to an app on your computer tablet. That information, plus a rectal temperature and weight, predicts the calf’s risk of developing bovine respiratory disease (BRD). You get a simple “treat” or “no-treat” message on the tablet. The goal of Whisper On Arrival is to eliminate guesswork and routine antimicrobial treatment of every animal, according to Merck veterinary experts. In tests, the technology has been shown to reduce antibiotic use by 10% to 43% in at-risk calves. Missouri cattle backgrounder Aaron Miller, an early user of the technology, says, “We now treat only the calves indicated by the system. Our overall cattle health is better, and we see fewer cases of pneumonia.” The Whisper paddle is user-friendly, he adds. “It’s about learning where to hold it to get a good reading. We take the reading, do other processing, and then see the results. It takes about 15 seconds.” The Whisper On Arrival system costs about $1,300, and you pay $2.20 per animal scanned. A 60-day trial period lets you scan for free to make sure you are comfortable with the technology. Visit: whisperonarrival.com Homegrown F1 baldy heifers ProGentus, a division of Trans Ova Genetics, has a new program for commercial cattle producers to upgrade their cow herd with a continuous source of F1 Angus-Hereford replacement females. Through embryo transfer, they are calved and grown on your own farm. ProGentus experts select the F1 embryos from the company’s herd, predetermined to be only females. The Angus cows that produce the embryos are in the top 1% of EPD traits for birth weight, mature cow height and weight, dollar energy efficiency of the Angus breed, and other traits. The Hereford sires are in the top EPDs for calving ease, birth weight, udder traits, and maternal index. The resulting elite baldy replacement heifers can upgrade your genetics in one generation, says the company. You work with a ProGentus representative to identify recipient cows and to plan your synchronization program. On embryo implant day, a ProGentus technician comes to your farm for the procedure. Your cost: about $360 per live calf. Visit: progentus.com Fast pink eye treatment Curicyn Curicyn Pink Eye Solution is a spray-on gel formula that can help heal pink eye in cows and calves on pasture. It can be sprayed from the bottle up to 10 feet away; however, it works better if the cattle are restrained. Because it is a gel, one squirt sticks to the eyeball, which heals in one to three days, says Tracey Weaver of Curicyn. “It’s an anti-inflammatory, so it offers quick pain relief,” she says. “It treats all strains of pink eye bacteria, is nontoxic and steroid-free, and can be used on horses or other livestock.” You can buy the product online in a 70-dose bottle for less than $1 per dose, she adds, or find it at farm supply retailers. Visit: curicyn.com","filter_flag":1}
{"title":"Polaris Supercomputer Streamlines the Development of Clean Energy Technologies - AZoCleantech","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zNDMwM9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zNDMwM9IBAA?oc=5","id":"CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zNDMwM9IBAA","guidislink":false,"published":"Thu, 23 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=23, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=327, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zNDMwM9IBAA?oc=5\" target=\"_blank\">Polaris Supercomputer Streamlines the Development of Clean Energy Technologies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoCleantech<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Polaris Supercomputer Streamlines the Development of Clean Energy Technologies - AZoCleantech","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiM2h0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vbmV3cy5hc3B4P25ld3NJRD0zNDMwM9IBAA?oc=5\" target=\"_blank\">Polaris Supercomputer Streamlines the Development of Clean Energy Technologies<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AZoCleantech<\/font>","source.href":"https:\/\/www.azocleantech.com","source.title":"AZoCleantech","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Since research and development is a costly endeavor for any business, a lot of companies start with a new patent—a completely original concept that has been thoroughly examined and is prepared for expansion. Argonne’s Polaris supercomputer brings advanced capabilities for research involving simulation, AI and data analysis workloads. Image Credit: Argonne National Laboratory. It can be challenging for established companies to strike a balance between profit margins and R&D costs. Modern product development requires sophisticated computer modeling, which saves companies millions of dollars by eliminating the need for costly prototypes and testing. Such modeling, whether for the search for new chemicals or materials or for simulating mechanical engineering issues, is time-intensive and costly, and new products take years to develop from concept to production. While many of the world’s fastest computers are privately held, constructing such a computing infrastructure is both dangerous and expensive. This is why government support for supercomputing is crucial to the advancement of American commerce. The High Performance Computing for Energy Innovation (HPC4EI) program of the US Department of Energy (DOE) has announced financing for a new round of business partnerships. Through these initiatives, the private sector will be able to better utilize DOE’s high-performance computing (HPC) facilities to increase industrial efficiency and investigate novel materials for use in clean energy applications. Four of the projects are receiving assistance from DOE’s Argonne National Laboratory, which also provides access to its supercomputing capabilities and expertise. This includes Argonne’s Laboratory Computing Resource Center and the potent systems at the Argonne Leadership Computing Facility (ALCF), a DOE Office of Science user facility. Employing cutting-edge computing resources is one advantage, but companies will also gain from collaborating with some of the top HPC specialists globally. Scientists at Argonne are skilled in leveraging supercomputers and collaborating with partners to optimize workloads related to artificial intelligence and high-performance computing for the systems. This year, Ford Motor Company, Capstone Green Energy, Lakril Technologies Corporation, and Power Systems Manufacturing are partners in Argonne’s HPC4EI initiatives. The breadth of these awards shows how DOE’s investment in Argonne’s massive HPC resources and deep expertise can help companies large and small improve their products while reducing carbon emissions. David Martin, Manager, Industry Partnerships and Outreach, Argonne Leadership Computing Facility, US Department of Energy Helping Ford with Battery Technology Argonne's Center for Nanoscale Materials, a DOE Office of Science user facility, is led by group leader Subramanian Sankaranarayanan, who oversees the lab’s collaboration with Ford Motor Company’s research to enhance battery manufacturing efficiency. To build robust long-cycling lithium batteries for electric vehicles, solid-electrolyte interphase (SEI) production is a crucial process that Sankaranarayanan and Ford researchers will model and enhance using high-performance computing (HPC). Currently, one of the longest processes in the battery production process is the development of the SEI, which can take a week or longer. Researchers can assist battery facilities in drastically lowering energy usage and carbon dioxide (CO 2 ) emissions by hastening the production of SEI. Power and Heat Generation with Microturbines Though the C200 microturbine system for power and heat generation from Capstone Green Energy is already environmentally friendly, the company intends to redesign, optimize, and refit the system so that it runs exclusively on hydrogen fuel in collaboration with Argonne research scientist Debolina Dasgupta. The computational fluid dynamics simulations needed to evaluate and contrast designs in order to generate a configuration that can guarantee the optimum of the engine’s design for combustion and fuel injection systems are one reason why Capstone needs supercomputers. Capstone’s transition to hydrogen fuel will be aided by this new modeling effort, which will lower nitrogen oxide emissions. Argonne Sketching Out a “Green” Paint John Low, an Argonne computational scientist, is working with Lakril Technologies to reduce the carbon footprint of the $10 billion paint, coatings, adhesive, and super absorbent polymer (diapers) markets. They hope to lessen the 16 million kg of CO 2 produced yearly to produce the acrylic acid that is normally used to make these products by turning corn and other bio-derived sugar sources into paints and coatings. The team wants to boost a new catalyst’s performance so that it can facilitate the switch to sustainable biomass feedstocks by utilizing Argonne’s HPC facilities. Reducing Hydrogen Flashback With the help of cutting-edge technology from Power Systems Manufacturing (PSM), gas turbines could co-fire with renewable gases like hydrogen, reducing the amount of carbon in the power system overall. In hydrogen-fueled combustion systems, a typical issue known as “flashback” occurs when the combustion chamber flame leaks into the nozzle, damaging the apparatus. PSM will simulate engine redesigns and optimizations using artificial intelligence and the lab’s high-performance computing (HPC) tools in collaboration with Argonne computational scientist Shashi Aithal to comprehend and lower the risk of flashbacks. These developments will help PSM reduce emissions, shorten production times, and save costs by enabling it to convert carbon-emitting power generation equipment into greener, hydrogen-burning products. The DOE’s offices of Industrial Efficiency and Decarbonization, Advanced Materials and Manufacturing Technologies, and Fossil Energy and Carbon Management, all within the Energy Efficiency and Renewable Energy Office, are the sponsors of the HPC4EI program.","filter_flag":1}
{"title":"Grundfos introduces new range of end-suction pumps to advance Singapore's smart green city ambitions - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZ3J1bmRmb3MtaW50cm9kdWNlcy1uZXctcmFuZ2Utb2YtZW5kLXN1Y3Rpb24tcHVtcHMtdG8tYWR2YW5jZS1zaW5nYXBvcmVzLXNtYXJ0LWdyZWVuLWNpdHktYW1iaXRpb25zLTMwMTk3ODM4OC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZ3J1bmRmb3MtaW50cm9kdWNlcy1uZXctcmFuZ2Utb2YtZW5kLXN1Y3Rpb24tcHVtcHMtdG8tYWR2YW5jZS1zaW5nYXBvcmVzLXNtYXJ0LWdyZWVuLWNpdHktYW1iaXRpb25zLTMwMTk3ODM4OC5odG1s0gEA?oc=5","id":"CBMioAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZ3J1bmRmb3MtaW50cm9kdWNlcy1uZXctcmFuZ2Utb2YtZW5kLXN1Y3Rpb24tcHVtcHMtdG8tYWR2YW5jZS1zaW5nYXBvcmVzLXNtYXJ0LWdyZWVuLWNpdHktYW1iaXRpb25zLTMwMTk3ODM4OC5odG1s0gEA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZ3J1bmRmb3MtaW50cm9kdWNlcy1uZXctcmFuZ2Utb2YtZW5kLXN1Y3Rpb24tcHVtcHMtdG8tYWR2YW5jZS1zaW5nYXBvcmVzLXNtYXJ0LWdyZWVuLWNpdHktYW1iaXRpb25zLTMwMTk3ODM4OC5odG1s0gEA?oc=5\" target=\"_blank\">Grundfos introduces new range of end-suction pumps to advance Singapore's smart green city ambitions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Grundfos introduces new range of end-suction pumps to advance Singapore's smart green city ambitions - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9hcGFjL25ld3MtcmVsZWFzZXMvZ3J1bmRmb3MtaW50cm9kdWNlcy1uZXctcmFuZ2Utb2YtZW5kLXN1Y3Rpb24tcHVtcHMtdG8tYWR2YW5jZS1zaW5nYXBvcmVzLXNtYXJ0LWdyZWVuLWNpdHktYW1iaXRpb25zLTMwMTk3ODM4OC5odG1s0gEA?oc=5\" target=\"_blank\">Grundfos introduces new range of end-suction pumps to advance Singapore's smart green city ambitions<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The new NK and NKE range take end-suction pumps to the next level in terms of energy efficiency, connectivity, and durability SINGAPORE, Nov. 7, 2023 \/PRNewswire\/ -- As demand for intelligent solutions accelerates to build more connected, resilient, and sustainable cities, Grundfos, a global leader in advanced pump solutions and water technologies, today launched its new NK and NKE range in Singapore. The new long-coupled end-suction pumps feature industry-leading energy efficiency, with the premium NKE range utilising smart technology to bring ease of use, monitoring capabilities, and greater connectivity. Grundfos launched its new NK and NKE range of end-suction pumps in Asia-Pacific, boasting greater energy efficiency, connectivity, and durability. With buildings accounting for over 20 per cent of Singapore's greenhouse gas emissions[1], the built environment sector plays a key role in Singapore's net-zero strategy and is vital to achieving climate change targets. Recognising the importance of greening buildings, Singapore has adopted intelligent and sustainable solutions to achieve more efficient use of resources such as energy and water in the city-state's built environment. As multi-purpose pumps that play a role in a variety of different applications in areas including cooling and heating in commercial buildings, Grundfos introduced the new and improved NK and NKE range to complement its strong portfolio of energy efficient water solutions, providing customers with a holistic range of highly efficient solutions at every level. Achieving tomorrow's efficiency demands today The new NK and NKE range offer industry-leading energy efficiency as standard. All pumps are built to IE3 as a minimum, which reduces energy consumption and operation costs and exceeds all current regulatory requirements. For even greater control and efficiency, the premium NKE range is able to operate up to the highest IE5 efficiency, achieved through intelligent features such as an integrated permanent magnet MGE motor with variable frequency drive, and built-in pressure sensor. These features work together in detecting and adjusting water pressure and flow intuitively, ensuring optimum conditions 24\/7. With these intelligent components built directly into the solution, NKE removes the need to install any external components such as controllers, frequency-converters, and sensors, which can add further complexity and costs to the process. Intelligent control and monitoring at your fingertips Combining cloud connectivity and digitalisation, the NKE range also allows for remote monitoring and access over the system, enabling intelligent control right at your fingertips. This makes NKE compatible with today's building automation and building management systems. Users can monitor, control, and schedule water use from their smartphone with the Grundfos GO REMOTE app, available for both iOS and Android operating systems. With the ability to manage tasks anytime when in range, NKE reduces the need for manpower, lowering operating costs. Users can also easily access pump diagnostics, create, and email reports on-site from the app. This ensures any operational issues can be quickly addressed, reducing unnecessary downtime and maintenance costs, and ultimately extend the lifespan of their end-suction pumps. Designed and built to last In addition to their advanced efficiency and intelligent upgrades, the new NK and NKE range also include significant technical improvements to maximise reliability and durability, enabling the pumps to be installed, operated, and maintained more easily. Notably, Grundfos utilised a single manufacturing process which eliminates misalignment, producing longer lasting seals and bearings. The pumps also boast improved hydraulics, which supports the overall efficiency in water flow conditions. The new pump design allows users to easily access the mechanical seal without the removal or disruption of other components. Other improvements include greater noise reduction and an increased temperature range. Kenth Hvid Nielsen, Grundfos' Regional Managing Director, APAC, Commercial Buildings, said, \"More intelligent and sustainable urban solutions as well as decarbonising the built environment are core to Singapore's goal of building a more resilient future. As the first company in the water solutions sector to receive full validation of our 2050 net-zero target from the Science-Based Targets initiative (SBTi), we are proud to launch the new NK and NKE range, which not only contributes to Singapore's smart city plans, but also aligns with Grundfos' climate commitments. With the new offering, we look forward to delivering more sustainable, efficient, and cost-effective pump solutions with shorter lead times and locally supported services in Singapore.\" For more information about the new Grundfos NK and NKE, please visit: https:\/\/product-selection.grundfos.com\/sg\/products\/nk-nke-nke-series-2000-nk-bare-shaft?tab=explore&b=123. [1] Building and Construction Authority (July 2022). Singapore Green Building Masterplan 2021 (4th edition). About Grundfos Grundfos pioneers solutions to the world's water and climate challenges and improves quality of life for people. As a leading global pump and water solutions company, we promise to respect, protect, and advance the flow of water by providing energy and water efficient solutions and systems for a wide range of applications for water utilities, industries and buildings. Find out more: grundfos.com SOURCE Grundfos","filter_flag":1}
{"title":"Building Products for Cold Climates and Cold-Weather Construction - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NvbGQtY2xpbWF0ZS1wcm9kdWN0c9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NvbGQtY2xpbWF0ZS1wcm9kdWN0c9IBAA?oc=5","id":"CBMiMGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NvbGQtY2xpbWF0ZS1wcm9kdWN0c9IBAA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NvbGQtY2xpbWF0ZS1wcm9kdWN0c9IBAA?oc=5\" target=\"_blank\">Building Products for Cold Climates and Cold-Weather Construction<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Building Products for Cold Climates and Cold-Weather Construction - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMGh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2NvbGQtY2xpbWF0ZS1wcm9kdWN0c9IBAA?oc=5\" target=\"_blank\">Building Products for Cold Climates and Cold-Weather Construction<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"This online version of an article that appeared in the November\/December print issue includes additional products. On-site home builders building in regions that experience cold winter weather know climate is one of the most important factors affecting not only their work process but also how they build their homes to ensure occupant comfort and health and that the home is durable and energy efficient. From using flexible sealants and adhesives that can withstand temperature fluctuations and offer durability in cold environments to installing insulation systems that will keep homeowners warm, even on the most frigid days, the following products are designed with the cold in mind. Structural Insulated Panel by ThermaFoam ThermaFoam R-Control SIPs (structural insulated panels) create a high-performance building envelope with a solid core of insulation, eliminating the need for additional insulation layers, traditional batts, or spray insulation. SIPs also reduce energy consumption and are lower maintenance than conventional framing. By minimizing air gaps and thermal bridging, the system delivers a virtually airtight envelope, resulting in improved indoor air quality (with proper ventilation) and consistent room temperatures across multiple floors, the company says. Weatherproof Sealant From DAP DAP’s AMP All Weather Window, Siding, and Door Sealant creates a weatherproof, waterproof seal for exterior surfaces such as windows, doors, siding, trim, and more. AMP surpasses silicone in wet-surface application, paintability, and clarity, the company says, and it dries in 30 minutes and resists mold and mildew. CertainTeed Wood-Look Shingles The Landmark ClimateFlex shingle from CertainTeed merges the aesthetic appeal of wood shake roofing with the durability of polymer-modified asphalt. The shingle has a Class 4 rating for hail resistance and offers exceptional all-weather performance, the company says, plus its ClimateFlex technology enhances cold-weather pliability, making the material easier to handle as it remains flat in cold weather, which simplifies installation in low temperatures. Also, the polymer-blended asphalt allows for deeper embedded granules in the shingles, resulting in less shingle degradation and better function and leak protection over time, according to CertainTeed. New Condensing Hydro-Furnace From Navien Navien has released its first HVAC product, the NPF Series Hydro-furnace. An upflow model is available now, and a horizontal configuration will be available in February 2024. Two sizes are offered, a 60,000 Btu\/hour and a 100,000 Btu\/hour option, both boasting an Annual Fuel Utilization Efficiency (AFUE) of 97%. The units use dual stainless steel heat exchangers to heat water in an isolated compartment, reducing noise and improving energy efficiency. The heated water is transferred through a hydronic coil to provide quiet forced-air heating. In addition to its variable capacity for efficient year-round heating, the furnace features a user-friendly interface for setup and diagnostics. Alabama Metal Industries' Solution for Creating a Weatherproof Seal Around Openings Speed Bead by Alabama Metal Industries Corp. (AMICO) creates a weatherproof seal for windows, doors, and openings that eliminates the need for caulk in veneer stone and stucco applications, the company says. The product incorporates a Speed Bond adhesive suitable for extreme outdoor temperatures, which the company claims can save contractors up to 40% on labor costs and reduced caulk use. Speed Bead’s patent-pending bulb technology and variable wall thickness design ensure solid adhesion to the bonding surface. Independently lab tested, Speed Bead surpasses industry standards for load resistance, water resistance, and air infiltration. RELATED Barricade Building Products' Rigid Insulation System Barricade Building Products recently introduced its ThermoPro Rigid Insulation System, an exterior wall solution that provides exceptional thermal performance without requiring a transition to 2x6 studs, making it compatible with the new 2021 International Energy Conservation Code requirements. There are two variations of the insulation: one with a metallic reflective facer and the other with a poly facer and a clear facer on the back. The metallic reflective facer addresses moisture management and energy efficiency, while the poly facer with a clear back emphasizes durability, structural support, and environmental sustainability. Closed-Cell Foam Insulation From Firestable Insulation Co. Firestable Insulation Co.’s Stablebase 2.0 Max R is a two-component hydrofluoroolefins (HFO) blown, closed-cell, polyurethane foam system. The insulation boasts an R-value of 7.5 for high thermal performance and low energy costs, and if you're building in cold climates, the company says the foam can be sprayed at low temperatures down to 20˚ F. The system is designed to work in tandem with Firestable’s FS 2.0 thermal barrier for a hybrid application that delivers a tight insulation. Impact Shingles by Atlas Roofing Atlas Roofing recently expanded its Pinnacle product line with Pinnacle Impact asphalt shingles, which offer wind resistance and incorporate several advanced features, including 3M Scotchgard Protector, to prevent roof algae, and Atlas' HP42 technology, which lets crews cover more roof area using fewer shingles and fewer nails. Pinnacle shingles are manufactured with a proprietary polymer modified asphalt technology that provides a UL 2218 Class 4 impact rating, enhancing their resilience against hail and reducing energy use during production, according to the company. Additionally, the shingles feature 3M smog-reducing granule technology that transforms smog into water-soluble ions to improve air quality. The shingles are available in six neutral colors (Weathered Wood, shown).","filter_flag":1}
{"title":"This Week in Power & Motion: Agritechnica Highlights New Tech for Agricultural Equipment - Power & Motion","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL3RlY2hub2xvZ2llcy9uZXdzLzIxMjc3NDI4L3RoaXMtd2Vlay1pbi1wb3dlci1tb3Rpb24tYWdyaXRlY2huaWNhLWhpZ2hsaWdodHMtbmV3LXRlY2gtZm9yLWFncmljdWx0dXJhbC1lcXVpcG1lbnTSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL3RlY2hub2xvZ2llcy9uZXdzLzIxMjc3NDI4L3RoaXMtd2Vlay1pbi1wb3dlci1tb3Rpb24tYWdyaXRlY2huaWNhLWhpZ2hsaWdodHMtbmV3LXRlY2gtZm9yLWFncmljdWx0dXJhbC1lcXVpcG1lbnTSAQA?oc=5","id":"CBMikAFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL3RlY2hub2xvZ2llcy9uZXdzLzIxMjc3NDI4L3RoaXMtd2Vlay1pbi1wb3dlci1tb3Rpb24tYWdyaXRlY2huaWNhLWhpZ2hsaWdodHMtbmV3LXRlY2gtZm9yLWFncmljdWx0dXJhbC1lcXVpcG1lbnTSAQA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL3RlY2hub2xvZ2llcy9uZXdzLzIxMjc3NDI4L3RoaXMtd2Vlay1pbi1wb3dlci1tb3Rpb24tYWdyaXRlY2huaWNhLWhpZ2hsaWdodHMtbmV3LXRlY2gtZm9yLWFncmljdWx0dXJhbC1lcXVpcG1lbnTSAQA?oc=5\" target=\"_blank\">This Week in Power & Motion: Agritechnica Highlights New Tech for Agricultural Equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Power & Motion<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"This Week in Power & Motion: Agritechnica Highlights New Tech for Agricultural Equipment - Power & Motion","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikAFodHRwczovL3d3dy5wb3dlcm1vdGlvbnRlY2guY29tL3RlY2hub2xvZ2llcy9uZXdzLzIxMjc3NDI4L3RoaXMtd2Vlay1pbi1wb3dlci1tb3Rpb24tYWdyaXRlY2huaWNhLWhpZ2hsaWdodHMtbmV3LXRlY2gtZm9yLWFncmljdWx0dXJhbC1lcXVpcG1lbnTSAQA?oc=5\" target=\"_blank\">This Week in Power & Motion: Agritechnica Highlights New Tech for Agricultural Equipment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Power & Motion<\/font>","source.href":"https:\/\/www.powermotiontech.com","source.title":"Power & Motion","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"There is much going on in the world of hydraulic, pneumatic and electric motion systems, from technology introductions and industry advancements to new trends and industry leaders. Each week the Power & Motion team collects the latest industry news to help keep our readers up to date on what's happening in the fluid power and electric motion control sectors as well as the industries they serve. This week we are highlighting news from one of the largest international agricultural industry events, Agritechnica, which took place November 12-18 in Hanover, Germany. Agricultural equipment is the second largest customer market for the fluid power sector, and is a particularly strong market for hydraulics. Electronic solutions such as electric actuators are also making inroads in this sector as well, noted Tom Diedrichs, Product Manager Actuators at Ewellix, in an interview with Power & Motion, demonstrating the importance of this segment to the broader motion control industry. Agritechnica 2023 brought over 2,800 exhibitors to the Hanover fair grounds. DLG, the organizers of the event, said 1,831 exhibitors from outside Germany registered for the event which is a new record in international participation. Attendance was expected to be high for this year's event as well. And of course there were several new technologies debuted by both component manufacturers and OEMs aimed at making farmers more productive and efficient so they can continue feeding an ever-increasing global population. Following are highlights of some of the news which came out of this year's largetst agricultural industry event. HydraForce Exhibits Compact Hydraulic Solutions During Agritechnica, HydraForce showed it latest compact hydraulic solutions, many of which are designed to provide precise hydraulic control, machine intelligence, automation and energy efficiency. Products on display included: Innercept Digital Proportional Control - a compact, proportional control valve with integrated LVDT (linear variable differential trnasformer) designed to provide exceptional linearity and repeatability. It can aid with the creation of more stable autonomous functions. HF-Impulse Configuration and Programming Software - a software development platform for the company's electronic controllers featuring easy-to-use diagram configurations, C++ Editor and Structured Text Editor. EDG-OBE, EDG Series - a pre-compensated proportional directional valve for small hydraulic-implemented systems. It is equipped with closed loop electronic or open loop analog piloting module for control and reliability. G3 Proportional Valves for powertrain, braking and pilot control - a valve which reduces non-energized leakage by 90% compared to standard products. READ MORE: Increased Demand for Electronic Controls Driving Hydraulic System Designs Liebherr Components Showcases Hydraulics, Sensors and Digital Solutions Liebherr's components division highlighted a range of products, including its hydrogen engine prototype. Hydraulic components and digital technologies were on display as well. During the event the company showed its DPVG 140 axial piston pump for closed circuits which has been upgraded to provide numerous benefits in agricultural equipment applications. The pump features a hydrostatic swash plate bearing which reduces material wear due to it minimizing friction compared to traditional bearings with rolling elements. It offers a robust and reliable design, ensuring a long service life in harsh operating conditions. The DPVG 140 pump features a load-independent stability of the rotary group and is available in a version with an ELS controller with additional valves. This allows the pump to switch on and off from any operating state, enabling it to meet operational safety needs. The pump can be used in traction, rotary, winch or drill drives, as well as shredder main drives. Also exhibited by Liebherr were various digital technologies aimed at helping improve the productivity and safety of farming operations. The company displayed its latest digital assistance systems, including the 360-degree surround view LiXplore which provides machine operators with a bird's eye view of the environment around them. Among its digital technology offerings is a special sensor Liebherr has developed to measure moisture in harvesting machines such as combine harvesters, forage harvesters or feed mixers and balers. The robustly designed P80-CAN sensor can determine the moisture content in, and thus quality of, a crop such as grain or corn. Machine parameters can be adjusted during harvesting based on the data collected by the sensor to adjust operation as necessary so only the optimal crop is harvested which can help to save on energy use.","filter_flag":1}
{"title":"Falmec Introduces Matte Black Finish for Polar and Plane Range Hoods - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ZhbG1lYy1pbnRyb2R1Y2VzLW1hdHRlLWJsYWNrLWZpbmlzaC1wb2xhci1hbmQtcGxhbmUtcmFuZ2UtaG9vZHPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ZhbG1lYy1pbnRyb2R1Y2VzLW1hdHRlLWJsYWNrLWZpbmlzaC1wb2xhci1hbmQtcGxhbmUtcmFuZ2UtaG9vZHPSAQA?oc=5","id":"CBMiW2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ZhbG1lYy1pbnRyb2R1Y2VzLW1hdHRlLWJsYWNrLWZpbmlzaC1wb2xhci1hbmQtcGxhbmUtcmFuZ2UtaG9vZHPSAQA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ZhbG1lYy1pbnRyb2R1Y2VzLW1hdHRlLWJsYWNrLWZpbmlzaC1wb2xhci1hbmQtcGxhbmUtcmFuZ2UtaG9vZHPSAQA?oc=5\" target=\"_blank\">Falmec Introduces Matte Black Finish for Polar and Plane Range Hoods<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Falmec Introduces Matte Black Finish for Polar and Plane Range Hoods - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiW2h0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2ZhbG1lYy1pbnRyb2R1Y2VzLW1hdHRlLWJsYWNrLWZpbmlzaC1wb2xhci1hbmQtcGxhbmUtcmFuZ2UtaG9vZHPSAQA?oc=5\" target=\"_blank\">Falmec Introduces Matte Black Finish for Polar and Plane Range Hoods<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Falmec, the Italian appliance manufacturer known for its technology and craftsmanship in kitchen ventilation, is expanding its North American product line. The Polar and Plane Range Hoods are now offered in a matte black finish, aligning with prevailing trends in the region. Falmec's decision to offer the Polar and Plane Range Hoods in matte black is a strategic response to the sustained popularity of the color in North America. The models aim to seamlessly integrate into various kitchen color palettes, accommodating both bold and minimalist designs. Lorenzo Pozer, director of sales and marketing at Falmec, said in a statement accompanying the news, \"Offering these models in this finish was a clear-cut decision for us. Our commitment has always been to provide innovative and tech-advanced solutions to our customers while maintaining the look and feel of today's contemporary designs. Falmec is committed to creating ventilation that combines both functionality and form. Models such as our Polar and Plane are meticulously crafted to elevate the everyday cooking experience with a contemporary look.\" Functional Features Falmec’s Polar Range Hood, characterized by a cylinder design, aims to enhance the cooking and food preparation experience. The addition of perimeter LED lighting serves a dual purpose, enhancing both functionality and ambiance. Conversely, the matte black Plane Range Hood offers practicality for homeowners. Featuring a removable and washable top filter, it simplifies maintenance, ensuring purified air in the home, free from cooking odors. This wall-installed range hood features precise lines and a streamlined design, balancing style and functionality. Ultimately, Falmec's addition of matte black options for the Polar and Plane Range Hoods reflects a strategic response to market trends and a commitment to offering functional solutions for contemporary kitchens. The matte black finish is positioned to meet the preferences of North American consumers and contribute to the brand's reputation for innovation in kitchen ventilation. This article was produced with assistance from OpenAI's GPT-3.5 architecture.","filter_flag":1}
{"title":"Key takeaways from China's SNEC Energy Storage & H2 tradeshow - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzExLzA4L2tleS10YWtlYXdheXMtZnJvbS1jaGluYXMtc25lYy1lbmVyZ3ktc3RvcmFnZS1oMi10cmFkZXNob3cv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzExLzA4L2tleS10YWtlYXdheXMtZnJvbS1jaGluYXMtc25lYy1lbmVyZ3ktc3RvcmFnZS1oMi10cmFkZXNob3cv0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzExLzA4L2tleS10YWtlYXdheXMtZnJvbS1jaGluYXMtc25lYy1lbmVyZ3ktc3RvcmFnZS1oMi10cmFkZXNob3cv0gEA","guidislink":false,"published":"Wed, 08 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=312, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzExLzA4L2tleS10YWtlYXdheXMtZnJvbS1jaGluYXMtc25lYy1lbmVyZ3ktc3RvcmFnZS1oMi10cmFkZXNob3cv0gEA?oc=5\" target=\"_blank\">Key takeaways from China's SNEC Energy Storage & H2 tradeshow<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Key takeaways from China's SNEC Energy Storage & H2 tradeshow - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzExLzA4L2tleS10YWtlYXdheXMtZnJvbS1jaGluYXMtc25lYy1lbmVyZ3ktc3RvcmFnZS1oMi10cmFkZXNob3cv0gEA?oc=5\" target=\"_blank\">Key takeaways from China's SNEC Energy Storage & H2 tradeshow<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The SNEC (2023) International Energy Storage Technology and Equipment and Application (Shanghai) Conference and Exhibition concluded on Nov. 3, uniting more than 600 global energy storage and hydrogen companies, with over 100,000 attendees. The event showcased various products, including energy storage systems, batteries, power control systems (PCSs), temperature control and air conditioning systems, and fire protection devices. It also featured the top 10 most innovative technologies selected by an expert panel. Huawei Huawei Digital Energy unveiled its comprehensive smart PV storage solutions and intelligent charging network solutions. It also presented its latest successful applications throughout the world. BYD BYD introduced the MC-I, a new commercial and industrial energy storage product that directly incorporates a 350 Ah blade battery, boasting a volume energy density of 70.12KWh\/m³ and a footprint energy density of 178.11KWh\/m². The system supports up to 10 cabinets in parallel and can be scaled up to 5 MWh, offering a long cycle life of up to 10,000 cycles, 5% higher battery availability compared to traditional products, and an impressive system energy efficiency of 90%. KSTAR KSTAR introduced its industrial and commercial energy storage product, the KAC120DS-BC233DE, featuring CATL lithium iron phosphate batteries, a dual fire protection design, modular cabinets, and IP65 protection. The product is known for its safety, reliability, simplicity, and adaptability, according to the company. AiSWEI AISI introduced the ASW A-S integrated micro-storage batteries, the ASW H-T2\/H-T3 new-generation three-phase energy storage inverters, and the Ai-HB G2 new-generation high-voltage batteries for energy storage, along with other notable products. Zenergy Popular content Zenergy, based in China's Jiangsu province, won the Energy Storage Applications Excellence Award for its battery packs and systems. It also introduced the mass-produced 314 Ah Qiankun Battery System, which is certified under IEC 62619 and UL 9540A, in addition to being recognized by TÜV Rheinland. TBEA TBEA introduced a string liquid-cooled energy storage system, flexible transmission system solutions, as well as several zero-carbon integrated intelligent energy solutions, and the TB-eCloud digital intelligent operation and maintenance (O&M) solutions. Growatt Growatt displayed three energy storage solutions for C&I, residential and EV charging applications. It also presented energy storage cabinets with the WIS 100K-AM and WIS 180-210K-AM energy storage converters. Jinlong Solis Jinlong Solis showcased its new series of batteries and inverters. The G6-PV60K-M battery and the S6-EH3P(29.9-50)K-H inverter is designed for C&I applications, and the S6-EH3P(12-20)K-H and S6-EH1P(12-16)K-L inverters is made for residential PV. CNTE CNTE, based in Fujian province, showcased an integrated charging station featuring DC microgrid technology. The innovation directly powers charging piles with energy storage systems, effectively minimizing power loss, reducing grid load and fluctuations, while also enhancing the quality of power supply for electric vehicles. The station is compatible with 180 kW to 350 kW super-fast charging piles, offering rapid charging for electric vehicles. Shuangliang H2 Shuangliang launched its JSDJ S1 series of alkaline electrolyzers. It said its electrolyzer has a safe and stable wideband operating load, with a hot start time of only 10 seconds and a minimum operating load of as low as 20%.","filter_flag":1}
{"title":"Pumps Mergers & Acquisitions Review: Q3 2023 - World Pumps","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LndvcmxkcHVtcHMuY29tL2NvbnRlbnQvYmxvZ3MvcHVtcHMtbWVyZ2Vycy1hY3F1aXNpdGlvbnMtcmV2aWV3LXEzLTIwMjMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LndvcmxkcHVtcHMuY29tL2NvbnRlbnQvYmxvZ3MvcHVtcHMtbWVyZ2Vycy1hY3F1aXNpdGlvbnMtcmV2aWV3LXEzLTIwMjMv0gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LndvcmxkcHVtcHMuY29tL2NvbnRlbnQvYmxvZ3MvcHVtcHMtbWVyZ2Vycy1hY3F1aXNpdGlvbnMtcmV2aWV3LXEzLTIwMjMv0gEA","guidislink":false,"published":"Fri, 17 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=321, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LndvcmxkcHVtcHMuY29tL2NvbnRlbnQvYmxvZ3MvcHVtcHMtbWVyZ2Vycy1hY3F1aXNpdGlvbnMtcmV2aWV3LXEzLTIwMjMv0gEA?oc=5\" target=\"_blank\">Pumps Mergers & Acquisitions Review: Q3 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Pumps<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pumps Mergers & Acquisitions Review: Q3 2023 - World Pumps","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LndvcmxkcHVtcHMuY29tL2NvbnRlbnQvYmxvZ3MvcHVtcHMtbWVyZ2Vycy1hY3F1aXNpdGlvbnMtcmV2aWV3LXEzLTIwMjMv0gEA?oc=5\" target=\"_blank\">Pumps Mergers & Acquisitions Review: Q3 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Pumps<\/font>","source.href":"https:\/\/www.worldpumps.com","source.title":"World Pumps","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"A roundup of merger and acquisition activity across the pump sector in the third quarter of 2023, from Ebara’s purchase of SKF’s Spandau Pumpen to PumpMan’s expansion in the US Midwest. Ebara to acquire SKF’s Spandau Pumpen Ebara Corp’s Ebara Pumps Europe SpA (EPE) reached an agreement with SKF Lubrication Systems Germany GmbH to acquire its coolant pump business Spandau Pumpen. Germany-based Spandau Pumpen makes screw-type and seal-less coolant pumps for machine tools. By taking over the business, Ebara is aiming to enter the global market for machine tools and further expand its business by providing new products and services. Ebara plans to transfer production to EPE in Italy, and work on developing new customers worldwide. Grundfos buys UK smart sewer solutions company Metasphere Grundfos acquired Metasphere, a UK-based provider of telemetry and analytics solutions for water networks, from XPV Water Partners. Metasphere provides smart network management solutions to the global utility industry. One of its key offerings is the ART Sewer integrated solution, which provides hardware and analytics software for the prediction and prevention of sewer network overflows. Duoning Biotech agrees to purchase Chinese peristaltic pump producer PreFluid Duoning Biotechnology Co Ltd, through Shanghai Duoning Yuexi Biological Technology Co Ltd, has signed an agreement to acquire Chinese peristaltic pump manufacturer Changzhou PreFluid Technology Co Ltd. PreFluid's peristaltic pumps are used in medical, pharmaceutical, chemical and environmental industries worldwide. Founded in 2007, PreFluid has a 10,000 sq m factory in Changzhou that combines lean production with automatic and manual assembly. Hayward Tyler acquires Slack & Parr assets from administration Avingtrans plc’s Hayward Tyler Fluid Handling Limited has acquired certain assets of the UK’s Slack & Parr Limited from administration, together with the company’s subsidiaries in the USA and Asia for a total consideration of £4.9 million. Slack & Parr is a manufacturer of specialist pumps and a supplier of high-precision gear metering pumps, hydraulics flow dividers and industrial pumps to customers around the world. Founded in 1917, Slack & Parr operates from a 64,000 sq ft state-of-the-art manufacturing facility in Kegworth, Derbyshire, UK. The business also has facilities in Charlotte, North Carolina, USA and Shanghai, China. Waterco to acquire Australia’s Davey Water Products Australian water treatment and pool equipment manufacturer Waterco Limited is acquiring Davey Water Products from GUD Holdings Limited in a A$64.9 million deal. Established in 1934, Davey offers water solutions, including pumps and filters, for homes and gardens, farms and irrigation, pools and spas, building service, fire protection, commercial irrigation, wastewater removal and water treatment. Davey has a 2,700 sq m manufacturing plant in Scoresby, Victoria, and a 4,700 sq m raw materials warehouse. The company also has a large research and development team in Australia involved in engineering and product development with a strong focus on water scarcity, energy efficiency, and smart connected products. Atlas Copco to purchase Australia’s Sykes Group Atlas Copco is buying Australian dewatering pump manufacturer Sykes Group Pty Ltd from Seven Group Holdings Ltd. Headquartered in Newcastle, New South Wales, Sykes is a global manufacturer of dewatering pumps, predominantly used for transferring water with solids and abrasive nature within the mining and wastewater sectors. Sykes has 123 employees globally and annual revenues of approximately A$65 million. Bain to buy US distributor Harrington Process Solutions US specialty distributor Harrington Process Solutions is being acquired by Bain Capital Private Equity. Founded in 1959 and headquartered in Chino, California, Harrington distributes piping and other engineered fluid process products such as valves, fittings, tanks, tubing and hose, pumps, filtration and instrumentation. With over 60 locations across the United States, Harrington provides solutions for a range of industries, including semiconductors, water and wastewater management, chemicals, manufacturing, life sciences, and food and beverage processing. Ceco Environmental acquires Kemco Systems Ceco Environmental Corp has acquired Kemco Systems Co LLC, a Florida-based company that specializes in the design, manufacturing and support of custom-engineered industrial water recycling and energy conservation solutions for North American industrial markets. The Kemco acquisition enhances Ceco's North American presence, adding new energy conservation and water recycling solutions, and expanding the addressable market into new high-value food processing, commercial laundry, and ready-mix concrete markets. Finish Thompson buys Penguin Pumps Finish Thompson Inc has acquired southern California-based Penguin Pumps Inc, parent company of Filter Pump Industries. Penguin Pumps is a 24-person company that manufactures corrosion-resistant pumps, mixers, filter systems, and filter chambers primarily used in the surface finishing, chemical processing, and chemical manufacturing industries. PumpMan expands in US Midwest with acquisition of Flo-Systems PumpMan has acquired Flo-Systems Inc, a Troy, Illinois-based provider of water, wastewater collection, treatment, distribution and repair services to municipal, industrial and residential properties in the St Louis, Missouri area in the US.","filter_flag":1}
{"title":"Daikin Showcases R-32 Innovations at Bi-Annual Sales Meeting - ACHR NEWS","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM3NzItZGFpa2luLXNob3djYXNlcy1yLTMyLWlubm92YXRpb25zLWF0LWJpLWFubnVhbC1zYWxlcy1tZWV0aW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM3NzItZGFpa2luLXNob3djYXNlcy1yLTMyLWlubm92YXRpb25zLWF0LWJpLWFubnVhbC1zYWxlcy1tZWV0aW5n0gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM3NzItZGFpa2luLXNob3djYXNlcy1yLTMyLWlubm92YXRpb25zLWF0LWJpLWFubnVhbC1zYWxlcy1tZWV0aW5n0gEA","guidislink":false,"published":"Wed, 01 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=1, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=305, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM3NzItZGFpa2luLXNob3djYXNlcy1yLTMyLWlubm92YXRpb25zLWF0LWJpLWFubnVhbC1zYWxlcy1tZWV0aW5n0gEA?oc=5\" target=\"_blank\">Daikin Showcases R-32 Innovations at Bi-Annual Sales Meeting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ACHR NEWS<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Daikin Showcases R-32 Innovations at Bi-Annual Sales Meeting - ACHR NEWS","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmFjaHJuZXdzLmNvbS9hcnRpY2xlcy8xNTM3NzItZGFpa2luLXNob3djYXNlcy1yLTMyLWlubm92YXRpb25zLWF0LWJpLWFubnVhbC1zYWxlcy1tZWV0aW5n0gEA?oc=5\" target=\"_blank\">Daikin Showcases R-32 Innovations at Bi-Annual Sales Meeting<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ACHR NEWS<\/font>","source.href":"https:\/\/www.achrnews.com","source.title":"ACHR NEWS","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"✕ As the HVAC industry accelerates toward global decarbonization and digitization trends, Daikin continues to set the pace. The global manufacturer held its 2023 Daikin Group Sales Meeting (DGSM), Sept. 29-30 in San Antonio, leveraging the event as a stage to showcase emerging innovations across numerous industry sectors. “Innovation isn't static, and neither is Daikin,” said Yu Nishiwaki, COO, Daikin Applied Americas. “We continue to bring innovations forward and remain process-oriented. Our goal is to keep Daikin at the forefront as the industry continues to transform.” TUNED IN: A few 2023 Daikin Group Sales Meeting attendees enjoy a preview of the company’s latest innovations. 2 equivalent impact of HFCs could be reduced by up to approximately 800 million tons of CO 2 . This is the equivalent of 50% of the annual carbon absorption provided by the Amazon rain forest.” - Philip Johnston general manager, environmental business development center Daikin Applied Americas “If all equipment presently using R-410A was replaced by R-32, the total COequivalent impact of HFCs could be reduced by up to approximately 800 million tons of CO. This is the equivalent of 50% of the annual carbon absorption provided by the Amazon rain forest.” R-32: ‘Proven, Easy, Efficient, and Available’ At the event, Daikin touted its use of low-GWP refrigerants throughout its portfolio. One refrigerant in particular, R-32, drew wide acclaim from company representatives. R-32 is an organic, colorless, odorless, mildly flammable hydrofluorocarbon (HFC) compound with the formula CH₂F₂. The refrigerant, which has a GWP of 675, is being specified by Daikin, and other HVAC manufacturers, as a next-generation equipment replacement for R-410A, an HFC that is currently being phased out by the U.S. Environmental Protection Agency (EPA) due to its high GWP value. “R-32 is the most balanced refrigerant in terms of environmental impact, energy efficiency, safety, and cost-effectiveness,” said Philip Johnston, general manager, environmental business development center, Daikin Applied Americas. “We chose R-32 because it's proven, easy, efficient, and available. “If all equipment currently using R-410A was replaced by R-32, the total CO 2 equivalent impact could be reduced by as much as 800 million tons,” continued Johnston. “This is the equivalent of 50% of the annual carbon absorption provided by the Amazon rain forest.” Daikin is very familiar with R-32. The manufacturer first introduced the refrigerant in its heat pumps in November 2012 in Japan. As of December 2022, the company has sold approximately 42 million R-32 units in more than 130 countries and regions. “R-32 has been proven to be effective time and time again,” said Kelly Hearnsberger, vice president of advanced product marketing and innovation, Daikin Comfort Technologies. “It’s currently a commodity worldwide, making it easy to obtain. And as a single-component refrigerant, it will be easy to reclaim, recycle, and reuse, which will be crucial going forward.” New Products Daikin announced it will be introducing 13 new products over the next 18 months, extending the manufacturer’s electrification, efficiency, and performance boundaries. Highlights include new centrifugal chillers, air-source heat pumps, water-source heat pumps, and more. “We’re very excited about all of our new products,” said Kyle Evenson, vice president and general manager, AAH operations, Daikin Applied Americas. “Just in our business unit, we’re spending north of $30 million on new innovations, which includes upgrading factories, adding new machinery and robotics, and more. We can’t wait to get this new equipment out into the field.” Chillers The Magnitude WME-D magnetic bearing centrifugal chiller features full-load efficiency as low as 0.53 kW per ton and part-load efficiency as low as 0.32 kw per ton. It is designed to use R-1234ze and R-515B and is capable of producing 125°F condenser leaving water temperature. The unit, which features a capacity of up to approximately 450 tons, is currently in production. The company expects to begin taking orders in March 2024. “The compressor in the WME-D now has two stages inside the impeller,” said Jim Macosko, vice president, product and sustainability solutions, Daikin Applied. “In a centrifugal chiller, generally, the more stages, the greater the operating range. Rather than dumping that 125° heat out at a cooling tower, we can now circulate it into the building and use it to preheat the domestic hot water system.” The Magnitude WMT magnetic bearing centrifugal chiller operates with a full-load performance as low as 0.50 kW per ton and a part-load operation of 0.30 kW per ton. It is designed to utilize R-1233zd, and Daikin anticipates taking orders on the unit in November. “This chiller is designed for customers seeking a low-GWP, nonflammable refrigerant,” said Arthur Rizoli, director of centrifugal products, Daikin Applied Americas. “The two-stage unit is great for retrofits, due to its size and volume.” The Trailblazer AGZ-F scroll chiller is available in 30-240 tons and operates at full-load efficiencies of up to 11.2 EER and part-load IPLV up to 16.7 EER. The unit will utilize R-32. “There's been a lot of talk about aluminum microchannel coils and the challenge with corrosion, particularly in coastal environments, so we’ve introduced a proprietary Daikin blue coil coating,” said Macosko. “This coil comes with a 10-year warranty, granting customers assurance that their equipment is protected for years to come. “This unit also showcases the advantages of R-32, as it’s smaller in size and features less aluminum and copper,” continued Macosko. “All of these factors, including a more efficient charge and performance, are appreciated by customers, especially when space and optimizing operations are primary concerns.” Heat Pumps The MEGA-Q heat pump is a VRV-based heat pump hot water generation system that warms water up to 194°. The inverter-driven heat pump operates using R-410A, and its split system design allows for indoor or outdoor installation. The product is expected to be available in the summer of 2024. “This is our first offering into commercial domestic hot water,” said Darren Sheehan, vice president, VRV and commercial products, Daikin Comfort Technologies. “The MEGA-Q heat pump offers a solution for buildings that truly aim to be all-electric.” The Rebel Applied Inverter Heat Pump packaged rooftop system, which operates with R-32, is available in 30- to 52-ton sizes. A smaller version, the Rebel Inverter Air-Source Heat Pump, is available in 3- to 31-ton sizes. Both units will be available to ship starting in the first quarter of 2024. “We've really redesigned the entire Rebel unit and optimized its size,” said Macosko. “The footprint of this is about 30%-40% smaller than the prior model. To achieve that, we've moved the condenser unit onto the top of the unit, which takes up less room.” The SmartSource Water-Source Heat Pump, available in vertical, horizontal, and V-stack configurations, is available in 2- to 6-ton sizes. The units are expected to be available by the end of the year. “This unit will be offered in a three-tier lineup with a good, better, best approach,” said Macosko. “More and more geothermal projects are seeking higher efficiency units, so we wanted to make sure we were meeting those needs.” Through all of its innovations, Daikin continues to focus on solving customers’ problems, regardless of the shape, size, or application. “We’re committed to solving our customers’ problems,” said Rob Landes, director, HVAC systems applications, Daikin Applied. “Whether it’s electrification, efficiency, refrigerants, etc., we’re here to provide the solutions to their system challenges.”","filter_flag":1}
{"title":"Ericsson intros new product portfolio designed for 'future RAN evolutions' - RCR Wireless News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJjcndpcmVsZXNzLmNvbS8yMDIzMTExNS81Zy9lcmljc3Nvbi1pbnRyb3MtbmV3LXByb2R1Y3QtcG9ydGZvbGlvLWRlc2lnbmVkLWZvci1mdXR1cmUtcmFuLWV2b2x1dGlvbnPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJjcndpcmVsZXNzLmNvbS8yMDIzMTExNS81Zy9lcmljc3Nvbi1pbnRyb3MtbmV3LXByb2R1Y3QtcG9ydGZvbGlvLWRlc2lnbmVkLWZvci1mdXR1cmUtcmFuLWV2b2x1dGlvbnPSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LnJjcndpcmVsZXNzLmNvbS8yMDIzMTExNS81Zy9lcmljc3Nvbi1pbnRyb3MtbmV3LXByb2R1Y3QtcG9ydGZvbGlvLWRlc2lnbmVkLWZvci1mdXR1cmUtcmFuLWV2b2x1dGlvbnPSAQA","guidislink":false,"published":"Wed, 15 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJjcndpcmVsZXNzLmNvbS8yMDIzMTExNS81Zy9lcmljc3Nvbi1pbnRyb3MtbmV3LXByb2R1Y3QtcG9ydGZvbGlvLWRlc2lnbmVkLWZvci1mdXR1cmUtcmFuLWV2b2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Ericsson intros new product portfolio designed for 'future RAN evolutions'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RCR Wireless News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ericsson intros new product portfolio designed for 'future RAN evolutions' - RCR Wireless News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJjcndpcmVsZXNzLmNvbS8yMDIzMTExNS81Zy9lcmljc3Nvbi1pbnRyb3MtbmV3LXByb2R1Y3QtcG9ydGZvbGlvLWRlc2lnbmVkLWZvci1mdXR1cmUtcmFuLWV2b2x1dGlvbnPSAQA?oc=5\" target=\"_blank\">Ericsson intros new product portfolio designed for 'future RAN evolutions'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">RCR Wireless News<\/font>","source.href":"https:\/\/www.rcrwireless.com","source.title":"RCR Wireless News","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The RAN compute portfolio from Ericsson includes two high-capacity processors and two high-capacity, energy-efficient routers Ericsson has announced a new portfolio of RAN compute silicon that it is confident will support demanding 5G-Advanced and enhanced artificial intelligence (AI) algorithms, enabling communications service providers (CSPs) to “get the most out of current and future radio access technology evolutions.” The RAN compute portfolio includes four products: two high-capacity processors, RAN Processor 6672 and Radio Processor 6372 and two new high-capacity, energy-efficient routers, Router 6678 and Router 6671, both of which have built-in intelligence for AI-analytics and automation. All four products, stated the vendor, are hardware prepared for Open RAN deployments and have high- and standard-capacity variants to address varying site needs. “Our new and enhanced RAN Compute portfolio was designed with Ericsson’s customers and their future needs in mind. It both addresses their need to maximize spectrum utilization and facilitates their desire to future-proof their networks with support for Open RAN architectures. The focus on innovation and energy efficiency while reducing both footprint and total cost of ownership has resulted in powerful hardware and software that is both reliable and flexible,” commented Michael Begley, head of RAN compute, Ericsson. The company said that the new RAN processors have four times the capacity compared to the previous generation and can support up to six 4G and 5G modes in a single unit, noting that in more advanced markets, 5G typically utilize three to four modes in basebands. “The additional modes made possible by the products announced today will allow CSPs to run more technologies simultaneously on one RAN Compute board, including 5G time division duplex (TDD) Massive MIMO, 4G and 5G frequency division duplex (FDD), and more, with modes to spare for future needs,” continued Ericsson. The routers can be leveraged through the new Ericsson Transport Automation Controller, announced earlier this week and designed to pick up network degradations and capacity utilization issues, delivering insights into how to optimize overall network performance. The new products all house Ericsson-made silicon built on a modular architecture, which the vendor claimed enables a 30-60% cut in power consumption compared to industry benchmarks. For this portfolio, Ericsson is working with Intel, utilizing Intel 4 technology, as part of the pair’s larger strategic collaboration around 5G SoCs.","filter_flag":1}
{"title":"Kolbe Expands Hoppe Hardware Selection | ProBuilder - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2tvbGJlLWV4cGFuZHMtaG9wcGUtaGFyZHdhcmUtc2VsZWN0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2tvbGJlLWV4cGFuZHMtaG9wcGUtaGFyZHdhcmUtc2VsZWN0aW9u0gEA?oc=5","id":"CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2tvbGJlLWV4cGFuZHMtaG9wcGUtaGFyZHdhcmUtc2VsZWN0aW9u0gEA","guidislink":false,"published":"Tue, 07 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=311, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2tvbGJlLWV4cGFuZHMtaG9wcGUtaGFyZHdhcmUtc2VsZWN0aW9u0gEA?oc=5\" target=\"_blank\">Kolbe Expands Hoppe Hardware Selection | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kolbe Expands Hoppe Hardware Selection | ProBuilder - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL2tvbGJlLWV4cGFuZHMtaG9wcGUtaGFyZHdhcmUtc2VsZWN0aW9u0gEA?oc=5\" target=\"_blank\">Kolbe Expands Hoppe Hardware Selection | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"WAUSAU, Wis — Kolbe Windows & Doors has expanded its offering of Hoppe swing door hardware to include both a European and an American Style handle set option with multi-point locking functionality. Introduced at the 2023 National Association of Home Builders International Builders’ Show (NAHB IBS), the American Style handle set features a locking cylinder located above the handle, while the European Style lock is situated below. Unique functionality allows quick locking of the door with the deadbolt, independent of the multi-point extensions. “Hoppe’s American Style hardware not only provides another option for functionality and aesthetic—it also offers added convenience to the user,” said Kolbe’s president, Jeff De Lonay. Kolbe expands Hoppe hardware selectionAvailable on a 35- or 45-mm backset, the American Style handle set features Hoppe’s LokRite functionality, which requires no sequential order of operation, as with the European Style. French door operation is also enhanced, as the lock prevents the secondary door from opening before the primary door. Kolbe’s offering of Hoppe hardware is available in a variety of styles and finishes within the VistaLuxe WD LINE, Ultra Series, Heritage Series and Forgent Series. ###","filter_flag":1}
{"title":"Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes - Yahoo Movies Canada","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5","id":"CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA","guidislink":false,"published":"Tue, 28 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=332, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5\" target=\"_blank\">Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Movies Canada<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes - Yahoo Movies Canada","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS9zdHlsZS9yb3RoeS1maWxscy1zdXN0YWluYWJpbGl0eS1yb2xlLWZhc2hpb24tMTk1NzA1MTcyLmh0bWzSAQA?oc=5\" target=\"_blank\">Rothy's Fills Sustainability Role; Fashion's Biomass Move Causes Pollution, Deforestation: Short Takes<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Movies Canada<\/font>","source.href":"https:\/\/ca.movies.yahoo.com","source.title":"Yahoo Movies Canada","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"IF THE SHOE FITS: Recyclable footwear brand Rothy’s has appointed James Rogers as vice president of sustainability. Rogers will join the San Francisco-based company from The RealReal, where he has held the director of sustainability post since 2020. Prior to The RealReal, he held senior sustainability positions as The North Face, JCR Consulting and served as an adviser to VC fund Alante Capital, whose clients include the clothing brand Everlane. More from WWD Rogers will focus on accelerating Rothy’s circular economy initiatives, and use his manufacturing background to work to reduce the company’s environmental impact across its entire supply chain. “Under James’ leadership, Rothy’s will continue to push the boundaries of what is possible in sustainable fashion. We are committed to using recycled materials, reducing our environmental impact and creating a more sustainable future for our planet. I am confident that James’ appointment will help Rothy’s to remain a leader in sustainable fashion and to inspire others to follow suit,” said chief executive officer Stephen Hawthornthwaite. “From minimizing waste to enhancing energy efficiency to exploring new circular business models that extend the lifespan of their products, I’m eager to collaborate with stakeholders across the value chain to drive meaningful change. Rooted in sustainability from its inception, I firmly believe that Rothy’s is uniquely positioned to continue making a significant and lasting difference in the fashion industry at scale,” Rogers said. In February, the company’s wholly owned and operated factory in China became both LEED and TRUE Zero Waste certified. The direct-to-consumer brand makes shoes out of discarded plastic bottles and uses a 3D knitting process to eliminate waste in the production cycle. In 2022, the seven-year-old company launched a take-back program through its retail outlets, which then disassembles the shoe, sorts by material and recycles the components into new products. The company operates 18 stores in the U.S. A June 2023 photo of recently felled rainforest trees in Aceh province, Indonesia. BIOMASS DELUSION: Stand Earth’s latest report sheds unfavorable light on the fashion industry’s switch to burning biomass, which is billed as a renewable energy source by many brands that are seeking alternatives to coal and fossil fuels. The advocacy group’s report, titled Biomass Burning: The Fashion Industry’s False Phase-Out,” notes that using biomass — often wood pellets — increases deforestation and delays the switch to renewable sources such as solar and wind. Other materials burned can include what are billed as “green alternatives,” including rice husks, straw and palm shells. Biomass has been used widely across the fashion industry to knock down carbon emissions numbers, the report said. Contrary to intent, burning biomass can increase greenhouse gas and carbon emissions in a company’s supply chain, according to the report. The report does a deep dive into the supply chains and manufacturing lists of Uniqlo parent company Fast Retailing, Gap, H&M, Zara parent company Inditex, Nike and Puma that are touting biomass as a low-carbon alternative in the dyeing and finishing process. In an email to Stand Earth, Fast Retailing acknowledged that they “recognize the issue of biomass boilers and are currently acting across [its] supply chain to minimize their use.” The company added it plans to “take immediate action with [its] production partners, including a review of the use of these boilers with serious impacts.” Inditex said it sees “biomass as a transition solution as other alternatives are developed and scaled.” The fashion companies are increasingly using biomass as an alternative to coal throughout Asian factories, including Cambodia, China, India, Indonesia, Pakistan, South Korea, Taiwan, Thailand and Vietnam. Using the example of Cambodia, Stand Earth noted that roughly one-third of the 1,200 garment factories there burn 620 tons of forest wood every day, according to a 2021 study from the University of London. “The bottom line is that there’s no such thing as ‘sustainable biomass,’” said Stand Earth research specialist Xixi Zhang, who headed up the report. “The increased reliance on biomass boilers poses severe threats to our climate, ecosystems and human health, all while hindering the industry’s essential shift to renewable energy in Asia.” Best of WWD","filter_flag":1}
{"title":"What impact do the Metaverse and Web3 have on the environment? - Telefónica","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL3doYXQtaW1wYWN0LWRvLW1ldGF2ZXJzZS13ZWIzLWhhdmUtb24tZW52aXJvbm1lbnQv0gFsaHR0cHM6Ly93d3cudGVsZWZvbmljYS5jb20vZW4vY29tbXVuaWNhdGlvbi1yb29tL2Jsb2cvd2hhdC1pbXBhY3QtZG8tbWV0YXZlcnNlLXdlYjMtaGF2ZS1vbi1lbnZpcm9ubWVudC9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL3doYXQtaW1wYWN0LWRvLW1ldGF2ZXJzZS13ZWIzLWhhdmUtb24tZW52aXJvbm1lbnQv0gFsaHR0cHM6Ly93d3cudGVsZWZvbmljYS5jb20vZW4vY29tbXVuaWNhdGlvbi1yb29tL2Jsb2cvd2hhdC1pbXBhY3QtZG8tbWV0YXZlcnNlLXdlYjMtaGF2ZS1vbi1lbnZpcm9ubWVudC9hbXAv?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL3doYXQtaW1wYWN0LWRvLW1ldGF2ZXJzZS13ZWIzLWhhdmUtb24tZW52aXJvbm1lbnQv0gFsaHR0cHM6Ly93d3cudGVsZWZvbmljYS5jb20vZW4vY29tbXVuaWNhdGlvbi1yb29tL2Jsb2cvd2hhdC1pbXBhY3QtZG8tbWV0YXZlcnNlLXdlYjMtaGF2ZS1vbi1lbnZpcm9ubWVudC9hbXAv","guidislink":false,"published":"Thu, 30 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=30, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=334, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL3doYXQtaW1wYWN0LWRvLW1ldGF2ZXJzZS13ZWIzLWhhdmUtb24tZW52aXJvbm1lbnQv0gFsaHR0cHM6Ly93d3cudGVsZWZvbmljYS5jb20vZW4vY29tbXVuaWNhdGlvbi1yb29tL2Jsb2cvd2hhdC1pbXBhY3QtZG8tbWV0YXZlcnNlLXdlYjMtaGF2ZS1vbi1lbnZpcm9ubWVudC9hbXAv?oc=5\" target=\"_blank\">What impact do the Metaverse and Web3 have on the environment?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Telefónica<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"What impact do the Metaverse and Web3 have on the environment? - Telefónica","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnRlbGVmb25pY2EuY29tL2VuL2NvbW11bmljYXRpb24tcm9vbS9ibG9nL3doYXQtaW1wYWN0LWRvLW1ldGF2ZXJzZS13ZWIzLWhhdmUtb24tZW52aXJvbm1lbnQv0gFsaHR0cHM6Ly93d3cudGVsZWZvbmljYS5jb20vZW4vY29tbXVuaWNhdGlvbi1yb29tL2Jsb2cvd2hhdC1pbXBhY3QtZG8tbWV0YXZlcnNlLXdlYjMtaGF2ZS1vbi1lbnZpcm9ubWVudC9hbXAv?oc=5\" target=\"_blank\">What impact do the Metaverse and Web3 have on the environment?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Telefónica<\/font>","source.href":"https:\/\/www.telefonica.com","source.title":"Telefónica","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Sustainability influences three fields: the environment, social issues and governance. In this article we’ll discuss the first of the above, namely the environment, and how it relates to the Metaverse and Web3. A new form of efficiency thanks to the Metaverse The concept of efficiency goes beyond economic costs, as there’s also another definition of efficiency (even more important for some people) associated with the environmental impact that we generate, be it that of a large company, an SME or even a family. One of the most positive impacts of the Metaverse with respect to environmental efficiency is related to reduced travel. The Metaverse enables us to carry out activities that normally take place in person in the real world, such as going to work, attending international congresses, travelling to conventions and concerts and so on, in a completely virtual environment from the office or the living room at home. This significantly helps us to reduce the tonnes of greenhouse gases that we normally generate when we travel by car, train or plane. One example is Movistar Immersive Experience (MEI), a new way of interacting with our Movistar world and our loved ones in a more immersive manner, together with Telefónica Theme Park and Telefónica World, virtual experiences that include fair games and attending events. Telefónica promotes sustainability by means of the Metaverse by allowing us to visit a work of art such as Okuda at MEI from home without going to the museum, displaying Movistar’s products and services in our virtual store and enabling us to attend the MWC from the sofa by means of the “metaversistic” recreation of our physical stand, as well as events such as Metaverse Day from home with our Talent & Innovation Hub. The three Rs of recycling: reduce, reuse and recycle Web3 goes hand in hand with the concept of server decentralisation. This facilitates improved resource management, as we can manage energy efficiency and even automatically allocate energy in keeping with demand, thus reducing energy consumption. Moreover, thanks to tokenisation projects, tokens generated by the user can be converted into credits to offset the carbon footprint of various forestry projects, with several different initiatives. One example applied to the home is the App Compensa tu Huella available in the “Apps” section of Movistar Plus+, helping us to offset the amount of CO2 generated in our home. This programme converts the use of Movistar’s digital environment into tokens redeemable for exclusive rewards: data allowances, monthly subscriptions to Movistar Plus+ channels, film rentals and even Movistar LaLiga and the Champions League. When we refer to Web3, we shouldn’t forget blockchain technology, which helps us to decentralise the above-mentioned servers, also serves as a tool for transparency and traceability, enabling us to track each phase accurately and simply in the life of both products and services (production, storage, transport, use and reuse). This is why Telefónica has teamed up with the Celo non-profit organisation, which manages the development of blockchain while being carbon negative. At the same time, Telefónica has also become a member of the “Celo Alliance for Prosperity”, which seeks to increase sustainability and financial inclusion through an open source, accessible and decentralised blockchain ecosystem. Telefónica reuses its extensive network infrastructure, thus playing a key role as a transaction validator and facilitating the stability and security of blockchains. Also, thanks to Web3 smart contracts are also possible. These can automatically manage the sorting and recycling of waste to ensure they are done properly. A new technology, new sustainability As you’ve seen, this new technological world is full of potential, but the relationship between innovation and sustainability will only be positive if projects like the Metaverse and Web3 also focus on being environment friendly. Telefónica believes that there can be no progress without caring for the environment and, for this reason and many others, it participates in the GSMA Open Gateway initiative, which is laying the foundations for the networks of tomorrow to make them globally more efficient and enable us to reduce the number of servers that pollute, reuse APIs and drive future development and innovation.","filter_flag":1}
{"title":"Groz-Beckert innovates with Mayer & Cie. - Knitting Industry","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtuaXR0aW5naW5kdXN0cnkuY29tL2dyb3piZWNrZXJ0LWlubm92YXRlcy13aXRoLW1heWVyLWNpZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtuaXR0aW5naW5kdXN0cnkuY29tL2dyb3piZWNrZXJ0LWlubm92YXRlcy13aXRoLW1heWVyLWNpZS_SAQA?oc=5","id":"CBMiRmh0dHBzOi8vd3d3LmtuaXR0aW5naW5kdXN0cnkuY29tL2dyb3piZWNrZXJ0LWlubm92YXRlcy13aXRoLW1heWVyLWNpZS_SAQA","guidislink":false,"published":"Mon, 27 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=331, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtuaXR0aW5naW5kdXN0cnkuY29tL2dyb3piZWNrZXJ0LWlubm92YXRlcy13aXRoLW1heWVyLWNpZS_SAQA?oc=5\" target=\"_blank\">Groz-Beckert innovates with Mayer & Cie.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Knitting Industry<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Groz-Beckert innovates with Mayer & Cie. - Knitting Industry","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRmh0dHBzOi8vd3d3LmtuaXR0aW5naW5kdXN0cnkuY29tL2dyb3piZWNrZXJ0LWlubm92YXRlcy13aXRoLW1heWVyLWNpZS_SAQA?oc=5\" target=\"_blank\">Groz-Beckert innovates with Mayer & Cie.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Knitting Industry<\/font>","source.href":"https:\/\/www.knittingindustry.com","source.title":"Knitting Industry","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Groz-Beckert has developed the optimised Relanit sinker SNK F over recent years, with the German circular knitting machine builder Mayer & Cie. Independently, the development of the new LCmax energy-saving needles took place. The focus of both developments is on efficiency, energy savings and increased process reliability. Groz-Beckert offers interested machine builders different cooperation options to jointly develop new products or optimise existing ones. The Groz-Beckert Technology and Development Center (TEZ) provides the appropriate framework for so-called co-development projects. At ITMA in Milan in June 2023, Groz-Beckert presented some of the successful cooperations under the motto ‘Innovation through cooperation’. Amongst these were two new developments realised with Mayer & Cie. Groz-Beckert also presented the two new products for the first time in Asia at ITMA Asia in November 2023. Optimised Relanit sinker SNK F At the end of 2018, circular knitting machine manufacturer Mayer & Cie. approached Groz-Beckert with a request to jointly develop an improved and more efficient sinker for selected machines of their Relanit family that would run more smoothly and reliably in the needle tricks. The innovative sinker has an integral spring with a spring force that is adapted to the sinker thickness. Field tests were consistently successful and confirmed the functionality and advantages of the new sinker. Thanks to their unique, adapted spring, the newly developed SNK F Relanit sinkers are securely guided while they are running through the cam track, resulting in a quieter operation. This increases process reliability and ensures an improved loop structure. In addition, wear on the swivel butts of the sinkers is reduced. This increases service life and makes the process more sustainable and cost-efficient. Higher energy efficiency thanks to LCmax The second recent cooperation with Mayer & Cie. was initiated by Groz-Beckert. With its products, Groz-Beckert strives to provide textile producers with the best possible support in meeting the constantly growing demands for sustainable production. Accordingly, the topic of sustainability has always been a focus of new and further developments at Groz-Beckert. The objective was to develop a cost-effective energy-saving needle. After considering various variants, the common choice of Mayer & Cie. and Groz-Beckert was the LCmax knitting machine needle with innovative, wave-shaped shank geometry. The first prototypes were extensively tested on laboratory machines at Groz-Beckert's TEZ. The trials confirmed the advantages of the new technology. The innovative, wave-shaped shank of the LCmax needle ensures a smaller contact area of the needle in the needle trick. This results in less friction, which reduces machine temperature and enables energy savings of up to 20% compared to a standard needle. This saves costs and at the same time allows operation of the machine at the maximum possible speed. In both projects, the cooperation between Mayer & Cie. and Groz-Beckert went far beyond mere product development. In addition to Applications Engineering and Construction, the companies' Sales and Purchasing departments were also involved in a close exchange. The cooperation at all levels was characterised by openness, constructiveness, partnership and goal orientation, and led to successful results from which the customers of both companies can now benefit. Groz-Beckert Groz-Beckert is the world's leading supplier of industrial machine needles, precision parts and fine tools, as well as systems and services for the production and joining of textile fabrics. Its products and services support the fields of knitting, weaving, felting, tufting, carding and sewing. Groz-Beckert is part of the Groz-Beckert Group, a market leader in the development, manufacture and distribution of process-critical textile precision tools, industrial cutting solutions and solution provider for textile construction and reinforcement solutions made from high-performance technical fibres for composite materials. The group consists of the companies Groz-Beckert, TKM and solidian and generated sales of 814 million euros in 2022 with around 9,500 employees worldwide. The company is active in more than 150 countries with agencies, production and sales subsidiaries. Mayer & Cie. Mayer & Cie. (MCT) is a leading global manufacturer of circular knitting machines. The company offers the full range of machines required for the production of modern textiles – from fabrics for home textiles, sportswear, nightwear and swimwear, seat covers and underwear to technical textiles. In addition, Mayer & Cie. regularly develops new approaches. Since 2019, Mayer & Cie.'s service portfolio has been supplemented by the production of braiding machines. These are used to produce sheathing for hydraulic hoses, for example for use in aviation, the automotive industry or other, special niche applications. Founded in 1905, Mayer & Cie. generated a turnover of around 110 million euros in 2022 with a workforce of around 450, of which approximately 350 are based at the Albstadt site. In addition to its headquarters in Albstadt in Germany and its subsidiaries in China and the Czech Republic, Mayer & Cie. is represented in a total of around 80 countries via its sales partners in the circular knitting and braiding machine sectors. www.mayercie.com www.groz-beckert.com","filter_flag":1}
{"title":"Kamala Harris roasted over Thanksgiving photo with gas stove - New York Post","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzExLzI0L25ld3Mva2FtYWxhLWhhcnJpcy1yb2FzdGVkLW92ZXItdGhhbmtzZ2l2aW5nLXBob3RvLXdpdGgtZ2FzLXN0b3ZlL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzExLzI0L25ld3Mva2FtYWxhLWhhcnJpcy1yb2FzdGVkLW92ZXItdGhhbmtzZ2l2aW5nLXBob3RvLXdpdGgtZ2FzLXN0b3ZlL9IBAA?oc=5","id":"CBMiYGh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzExLzI0L25ld3Mva2FtYWxhLWhhcnJpcy1yb2FzdGVkLW92ZXItdGhhbmtzZ2l2aW5nLXBob3RvLXdpdGgtZ2FzLXN0b3ZlL9IBAA","guidislink":false,"published":"Fri, 24 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=328, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzExLzI0L25ld3Mva2FtYWxhLWhhcnJpcy1yb2FzdGVkLW92ZXItdGhhbmtzZ2l2aW5nLXBob3RvLXdpdGgtZ2FzLXN0b3ZlL9IBAA?oc=5\" target=\"_blank\">Kamala Harris roasted over Thanksgiving photo with gas stove<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">New York Post <\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kamala Harris roasted over Thanksgiving photo with gas stove - New York Post","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYGh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzExLzI0L25ld3Mva2FtYWxhLWhhcnJpcy1yb2FzdGVkLW92ZXItdGhhbmtzZ2l2aW5nLXBob3RvLXdpdGgtZ2FzLXN0b3ZlL9IBAA?oc=5\" target=\"_blank\">Kamala Harris roasted over Thanksgiving photo with gas stove<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">New York Post <\/font>","source.href":"https:\/\/nypost.com","source.title":"New York Post","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Vice President Kamala Harris’ Thanksgiving tweet backfired after eagle-eyed social media users noticed her using a cooking appliance that the Biden administration floated banning earlier this year. “From our family to yours, happy Thanksgiving,” Harris posted on X Thursday, including a photo of her next to second gentleman Doug Emhoff, a casserole and a gas stove. Harris, 59, was roasted over the post, with many conservatives accusing her of “hypocrisy.” “Wait…that’s a gas stove! The same kind Dems want to BAN you from owning,” Sen Ted Cruz (R-Texas) wrote on X. “Gas stoves for me but not for thee,” Senate GOP staffer Charles Correll III tweeted. “I thought gas stoves were bad for the environment,” actor Kevin Sorbo said, noting the impetus behind banning the stoves and other natural-gas-powered appliances in Democrat-controlled California cities such as San Francisco and Berkeley. The White House says President Biden would not support a federal gas stove ban — the appliance veep Harris and second gentleman Doug Emhoff were pictured in front of on Thanksgiving. Vice President Kamala Harris\/X In January, concerns over a possible federal ban on gas stoves were sparked after a Biden administration appointee suggested that a gas stove ban was “on the table,” supposedly because of the potentially dangerous levels of toxic chemicals emitted by the popular appliances. “This is a hidden hazard,” Richard Trumka Jr., a commissioner of the Consumer Product Safety Commission, said in an interview with Bloomberg. “Any option is on the table. Products that can’t be made safe can be banned.” Trumka Jr., the son of the late AFL-CIO chief Richard Trumka, later walked back his remarks. “To be clear, CPSC isn’t coming for anyone’s gas stoves,” he tweeted. “Regulations apply to new products.” The chairman of the CPSC also distanced himself from Trumka Jr.’s initial claim. “I am not looking to ban gas stoves and the CPSC has no proceeding to do so,” Alex Hoehn-Saric, one of the five members on the commission, said. Likewise, White House press secretary Karine Jean-Pierre told reporters in January that “the president does not support banning gas stoves.” A Biden administration official floated banning gas stoves earlier this year before walking back his remarks. AFP via Getty Images The Republican-led House passed a bill in June that would prevent the CPSC from finalizing any rule banning gas stoves. Only 29 Democrats voted in favor of the bill. Concerns were reignited in February after the Department of Energy proposed an “energy efficiency standard” for gas cooking products. The proposed regulation would require an energy performance standard for residential cooktops for the first time ever. The DOE derided suggestions that the new rule would lead to gas stove bans as “absurd.” “Neither DOE nor the federal government plans to ban gas stoves. In February 2023, DOE published a proposal that would improve efficiency of gas and electric stoves. If implemented, the standards would not go into effect until 2027 and help U.S. consumers save up to $1.7 billion. As required by congressional mandate, DOE is determined to ensure consumers have multiple options that are both cost-effective and energy efficient,” the agency said in a statement. Energy Secretary Jennifer Granholm told congressional lawmakers in March that about half of gas cooktops currently on the market would be affected by the proposed rule – those that are “high-end” with “heavy grates” and oval-shaped burners, which she claimed lead to “an excess amount of natural gas to be emitted relative to the pot that’s on there.” Granholm noted that it would cost about $12 per appliance to bring them into compliance with the proposed regulation. In New York, Gov. Kathy Hochul signed legislation in April that requires all new buildings under seven stories to be fully electric by 2026 with larger structures following three years later — an effective ban on gas stoves.","filter_flag":1}
{"title":"Ericsson Unveils Latest Generation of Processors in the Ericsson RAN Compute Portfolio - The Fast Mode","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVmYXN0bW9kZS5jb20vdGVjaG5vbG9neS1zb2x1dGlvbnMvMzM4NTYtZXJpY3Nzb24tdW52ZWlscy1sYXRlc3QtZ2VuZXJhdGlvbi1vZi1wcm9jZXNzb3JzLWluLXRoZS1lcmljc3Nvbi1yYW4tY29tcHV0ZS1wb3J0Zm9saW_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVmYXN0bW9kZS5jb20vdGVjaG5vbG9neS1zb2x1dGlvbnMvMzM4NTYtZXJpY3Nzb24tdW52ZWlscy1sYXRlc3QtZ2VuZXJhdGlvbi1vZi1wcm9jZXNzb3JzLWluLXRoZS1lcmljc3Nvbi1yYW4tY29tcHV0ZS1wb3J0Zm9saW_SAQA?oc=5","id":"CBMijQFodHRwczovL3d3dy50aGVmYXN0bW9kZS5jb20vdGVjaG5vbG9neS1zb2x1dGlvbnMvMzM4NTYtZXJpY3Nzb24tdW52ZWlscy1sYXRlc3QtZ2VuZXJhdGlvbi1vZi1wcm9jZXNzb3JzLWluLXRoZS1lcmljc3Nvbi1yYW4tY29tcHV0ZS1wb3J0Zm9saW_SAQA","guidislink":false,"published":"Wed, 15 Nov 2023 01:48:59 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=1, tm_min=48, tm_sec=59, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVmYXN0bW9kZS5jb20vdGVjaG5vbG9neS1zb2x1dGlvbnMvMzM4NTYtZXJpY3Nzb24tdW52ZWlscy1sYXRlc3QtZ2VuZXJhdGlvbi1vZi1wcm9jZXNzb3JzLWluLXRoZS1lcmljc3Nvbi1yYW4tY29tcHV0ZS1wb3J0Zm9saW_SAQA?oc=5\" target=\"_blank\">Ericsson Unveils Latest Generation of Processors in the Ericsson RAN Compute Portfolio<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Fast Mode<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Ericsson Unveils Latest Generation of Processors in the Ericsson RAN Compute Portfolio - The Fast Mode","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy50aGVmYXN0bW9kZS5jb20vdGVjaG5vbG9neS1zb2x1dGlvbnMvMzM4NTYtZXJpY3Nzb24tdW52ZWlscy1sYXRlc3QtZ2VuZXJhdGlvbi1vZi1wcm9jZXNzb3JzLWluLXRoZS1lcmljc3Nvbi1yYW4tY29tcHV0ZS1wb3J0Zm9saW_SAQA?oc=5\" target=\"_blank\">Ericsson Unveils Latest Generation of Processors in the Ericsson RAN Compute Portfolio<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Fast Mode<\/font>","source.href":"https:\/\/www.thefastmode.com","source.title":"The Fast Mode","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Photo caption L-R. Ricardo Queiros, Head of IP Routers at Ericsson, holding the Router 6678; Ericsson strategic product managers Björn Karlberg and Amareet Kaur with the Radio Processor 6372; Ericsson strategic product manager Tijo Thazhone, with the Radio Processor 6355; Michael Begley, Head of RAN Compute at Ericsson, with the RAN Processor 6672. Ericsson announced the latest generation of processors in the Ericsson RAN Compute portfolio to help communications service providers (CSPs) get the most out of current and future radio access technology evolutions. The most advanced RAN Compute products to date are powered by Ericsson Silicon and built for the network demands of 5G Advanced and enhanced artificial intelligence (AI) algorithms. Ericsson’s next-generation RAN Compute portfolio includes four products with high and standard capacity variants, and with both enclosure and outdoor formats, to cater to varying site needs. The new RAN Compute products are also hardware prepared for Open RAN deployments. The two high-capacity processors, RAN Processor 6672 and Radio Processor 6372, offer four times the capacity compared to previous generation and can support up to six 4G and 5G modes, in a single unit. Advanced 5G markets typically utilize three to four modes in basebands at present. The additional modes made possible by the products announced today will allow CSPs to run more technologies simultaneously on one RAN Compute board, including 5G time division duplex (TDD) Massive MIMO, 4G and 5G frequency division duplex (FDD), and more, with modes to spare for future needs. A keystone to the cutting-edge network processing power and benefits achieved in the latest products is Ericsson Silicon, the company’s range of system-on-a-chip, which is at the heart of the Ericsson Radio System. It is built on a custom-made, flexible and modular architecture, which is what enables the existing RAN Compute portfolio to consume 30 to 60 percent less power compared to industry benchmarks. Ericsson is working with Intel as key partner for this new generation of RAN Compute products, utilizing Intel 4 technology, as the two companies continue to build on their strategic collaboration. The pressure on mobile networks is rapidly increasing with the growth of 5G. Emerging 5G Advanced applications such as extended reality (XR) use cases will also add to the already booming traffic growth, increasing the demands on the network both in the downlink and uplink. Efficient spectrum use and intelligence are key to boosting network capacity, reducing cost of ownership and automating manual tasks. On the RAN software front, Ericsson will also debut two new features - Automated Carrier Aggregation and Carrier Aggregation Data Steering - to optimize spectrum utilization and drastically reduce operational costs. Also introduced in this launch are two new high-capacity, energy-efficient routers that have been added to the Router 6000 family. Both Router 6678 and 6671 have built-in intelligence for AI-analytics and automation, which can be leveraged through the new Ericsson Transport Automation Controller unveiled earlier today. These enhancements of the Ericsson router portfolio address the new requirements and capabilities that the new RAN Compute portfolio introduces for both distributed and centralized RAN deployments. As the industry works toward scaling 5G coverage and preparing networks for a surge in uplink demand, it is important to also keep in mind its Net Zero goals. The launch of this latest RAN Compute portfolio is part of Ericsson’s commitment to developing solutions for the high performing, open and sustainable networks of the future, paving the path to limitless connectivity. Michael Begley, Head of RAN Compute, Ericsson, Our new and enhanced RAN Compute portfolio was designed with Ericsson’s customers and their future needs in mind. It both addresses their need to maximize spectrum utilization and facilitates their desire to future-proof their networks with support for Open RAN architectures. The focus on innovation and energy efficiency while reducing both footprint and total cost of ownership has resulted in powerful hardware and software that is both reliable and flexible. Nikos Katinakis, Telstra Group Executive for Global Networks & Technology, Telstra and Ericsson have a long history of working on innovative technologies to deploy a multi-layer 5G network. The new Automated Carrier Aggregation functionality will help increase the operational efficiency and performance of our 5G network by automatically configuring the best frequency bands for carrier aggregation. We look forward to seeing this software feature deployed in our network, to continue bringing Telstra customers the best available 5G experience.","filter_flag":1}
{"title":"Making homes greener - Lloyds Banking Group","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmxsb3lkc2Jhbmtpbmdncm91cC5jb20vd2hvLXdlLWFyZS9zdXN0YWluYWJpbGl0eS9tYWtpbmctaG9tZXMtZ3JlZW5lci5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmxsb3lkc2Jhbmtpbmdncm91cC5jb20vd2hvLXdlLWFyZS9zdXN0YWluYWJpbGl0eS9tYWtpbmctaG9tZXMtZ3JlZW5lci5odG1s0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3Lmxsb3lkc2Jhbmtpbmdncm91cC5jb20vd2hvLXdlLWFyZS9zdXN0YWluYWJpbGl0eS9tYWtpbmctaG9tZXMtZ3JlZW5lci5odG1s0gEA","guidislink":false,"published":"Wed, 15 Nov 2023 12:49:39 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=15, tm_hour=12, tm_min=49, tm_sec=39, tm_wday=2, tm_yday=319, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmxsb3lkc2Jhbmtpbmdncm91cC5jb20vd2hvLXdlLWFyZS9zdXN0YWluYWJpbGl0eS9tYWtpbmctaG9tZXMtZ3JlZW5lci5odG1s0gEA?oc=5\" target=\"_blank\">Making homes greener<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Lloyds Banking Group<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Making homes greener - Lloyds Banking Group","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3Lmxsb3lkc2Jhbmtpbmdncm91cC5jb20vd2hvLXdlLWFyZS9zdXN0YWluYWJpbGl0eS9tYWtpbmctaG9tZXMtZ3JlZW5lci5odG1s0gEA?oc=5\" target=\"_blank\">Making homes greener<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Lloyds Banking Group<\/font>","source.href":"https:\/\/www.lloydsbankinggroup.com","source.title":"Lloyds Banking Group","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Transcript 0:05 I think we've all becoming more and more increasing, increasingly aware of the fact that we are in a climate emergency. Global temperatures have been steadily rising and the science is really clear about this. So it's emissions of greenhouse gases resulting from human activity and industrialization that causing our climate to change. At the heart of this is our over reliance on fossil fuels, including those that were used to heat our homes. So if we want to address the climate emergency and stop global temperature rising any further, 0:35 what we need to do is to drastically reduce our emissions. So there's 30 million homes in the UK 0:42 and it's the oldest housing stock in Europe 0:46 and that results in around 16% of UK emissions coming from those homes and 35% of energy use. 0:56 So clearly it's a big contributor to UK emissions. 1:02 And clearly there's a there's a that means that there's a 1:07 a lot they can be done, not just to reduce emissions, but to help households reduce their energy bills. A really good way is to get started is to check what the energy efficiency of your property currently is. 1:21 Halifax and Lloyds actually already have a tool in partnership with Energy Saving Trust, so it can help provide a personalised action plan. And what this will help to do is it will provide estimates of the Homes Energy Performance Certificate. That's the we call that the EPC. So there's a rating which will estimate the energy costs and also the carbon emissions relating to that home at the moment. 1:41 That will produce a range of options. Now not all of these have to mean expensive technologies and there are a number of low cost options that people can install including energy efficient lighting, so LED light bulbs, draught proofing, which is one of the most effective things that people can do quickly. Heating controls such as smart thermostats and also insulating hot water tanks. And there are other improvements that require a bit more investment. So insulating walls, insulating floors, roofs, loft spaces and solar panels. So rooftop renewables, installing electric charging point if you've got an electric vehicle and then 2:16 all the way down to installing low carbon heating, which is expensive but is going to dramatically cut your emissions in the long term. So that's something like a heat pump. But by far the biggest challenge for that people have told us that they find is a cost. So 50% of people that responded to our recent survey said the cost of carrying out the work was by far the biggest, biggest barrier to making change. Really complex process for people. And it's not something that we should expect people to be experts in because it's not something that people are going to do every day, all the time. So being 2:51 able to have that support and knowing where to be able to start in the process is really important. It's absolutely vital that we also communicate what the benefits are, not only just of lowering costs. So we're all worrying about our energy bills, right? Energy has gone up a lot over the last couple of years and particularly last year. But we also need to be able to be able to communicate the benefits of our net zero future as well. So we need to be able to engage with people. And we know it's possible. We've already got all the technology that we need to be able to do it, but we can get there much, much faster if we're engaging people and having them informed about what they need to do. 3:25 So overall, we're going to need a lot more investment across the whole economy to generate more clean energy and reduce our reliance on fossil fuels. It's fossil fuels that are at the heart of the issue, really. And it's also important to remember that the lowest cost energy that we have is the energy that we don't use in the 1st place. So there's a really big case for reducing demand for energy in the 1st place. So investment in both of these areas will be far cheaper than doing nothing at all. It will cost us much less if we act now. So while all this may sound like a lot, the cost of ignoring the climate emergency is going to be far higher for us. Trillions of pounds, 4:00 according to some of the estimates and so and there's also a human cost. So all our lives are going to be impacted by climate change, not just here, but all around the world as well. 4:11 ","filter_flag":1}
{"title":"Groz-Beckert develops innovative new products together with Mayer & Cie. - The Textile Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9ncm96LWJlY2tlcnQtZGV2ZWxvcHMtaW5ub3ZhdGl2ZS1uZXctcHJvZHVjdHMtdG9nZXRoZXItd2l0aC1tYXllci1jaWUv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9ncm96LWJlY2tlcnQtZGV2ZWxvcHMtaW5ub3ZhdGl2ZS1uZXctcHJvZHVjdHMtdG9nZXRoZXItd2l0aC1tYXllci1jaWUv0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9ncm96LWJlY2tlcnQtZGV2ZWxvcHMtaW5ub3ZhdGl2ZS1uZXctcHJvZHVjdHMtdG9nZXRoZXItd2l0aC1tYXllci1jaWUv0gEA","guidislink":false,"published":"Fri, 24 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=24, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=328, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9ncm96LWJlY2tlcnQtZGV2ZWxvcHMtaW5ub3ZhdGl2ZS1uZXctcHJvZHVjdHMtdG9nZXRoZXItd2l0aC1tYXllci1jaWUv0gEA?oc=5\" target=\"_blank\">Groz-Beckert develops innovative new products together with Mayer & Cie.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Groz-Beckert develops innovative new products together with Mayer & Cie. - The Textile Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmluZGlhbnRleHRpbGVtYWdhemluZS5pbi9ncm96LWJlY2tlcnQtZGV2ZWxvcHMtaW5ub3ZhdGl2ZS1uZXctcHJvZHVjdHMtdG9nZXRoZXItd2l0aC1tYXllci1jaWUv0gEA?oc=5\" target=\"_blank\">Groz-Beckert develops innovative new products together with Mayer & Cie.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Textile Magazine<\/font>","source.href":"https:\/\/www.indiantextilemagazine.in","source.title":"The Textile Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Together with the German circular knitting machine builder Mayer & Cie., Groz-Beckert has developed the optimized Relanit Sinker SNK-F over the past years. Independently of this, the development of the new LCmax™ energy-saving needles took place. The focus of both developments is on efficiency, energy savings and increased process reliability. Groz-Beckert offers interested machine builders different cooperation options to jointly develop new products or optimize existing ones. The Groz-Beckert Technology and Development Center (TEZ) provides the appropriate framework for so-called co-development projects. At the ITMA in Milan in June 2023, Groz-Beckert presented some of the successful cooperations under the motto “Innovation through cooperation”. Among them were two new developments realized with Mayer & Cie. Groz-Beckert presented the two new products for the first time in Asia at ITMA Asia in November 2023. Optimized Relanit sinker SNK-F At the end of 2018, circular knitting machine manufacturer Mayer & Cie. approached Groz-Beckert with a request to jointly develop an improved and more efficient sinker for selected machines of their Relanit family that would run more smoothly and reliably in the needle tricks. The innovative sinker has an integral spring with a spring force that is adapted to the sinker thickness. Field tests were consistently successful and confirmed the functionality and advantages of the new sinker. Thanks to their unique, adapted spring, the newly developed SNK-F Relanit Sinkers are securely guided while they are running through the cam track, resulting in a quieter operation. This increases process reliability and ensures an improved loop structure. In addition, wear on the swivel butts of the sinkers is reduced. This increases service life and makes the process more sustainable and cost-efficient. Higher energy efficiency thanks to LCmax™ The second recent cooperation with Mayer & Cie. was initiated by Groz-Beckert. With its products, Groz-Beckert strives to provide textile producers with the best possible support in meeting the constantly growing demands for sustainable production. Accordingly, the topic of sustainability has always been a focus of new and further developments at Groz-Beckert. The objective was to develop a cost-effective energy-saving needle. After considering various variants, the common choice of Mayer & Cie. and Groz-Beckert was the LCmax™ knitting machine needle with innovative, wave-shaped shank geometry. The first prototypes were extensively tested on laboratory machines at Groz-Beckert’s TEZ. The trials confirmed the advantages of the new technology. The innovative, wave-shaped shank of the LCmax™ needle ensures a smaller contact area of the needle in the needle trick. This results in less friction, which reduces machine temperature and enables energy savings of up to 20 percent compared to a standard needle. This saves costs and at the same time allows operation of the machine at the maximum possible speed. In both projects, the cooperation between Mayer & Cie. and Groz-Beckert went far beyond mere product development. In addition to Applications Engineering and Construction, the companies’ Sales and Purchasing departments were also involved in a close exchange. The cooperation at all levels was characterized by openness, constructiveness, partnership and goal orientation, and led to successful results from which the customers of both companies can now benefit.","filter_flag":1}
{"title":"India's prodigious show on lighting 'LED Expo New Delhi 2023' opens today - TimesTech","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vdGltZXN0ZWNoLmluL2luZGlhcy1wcm9kaWdpb3VzLXNob3ctb24tbGlnaHRpbmctbGVkLWV4cG8tbmV3LWRlbGhpLTIwMjMtb3BlbnMtdG9kYXkv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vdGltZXN0ZWNoLmluL2luZGlhcy1wcm9kaWdpb3VzLXNob3ctb24tbGlnaHRpbmctbGVkLWV4cG8tbmV3LWRlbGhpLTIwMjMtb3BlbnMtdG9kYXkv0gEA?oc=5","id":"CBMiXGh0dHBzOi8vdGltZXN0ZWNoLmluL2luZGlhcy1wcm9kaWdpb3VzLXNob3ctb24tbGlnaHRpbmctbGVkLWV4cG8tbmV3LWRlbGhpLTIwMjMtb3BlbnMtdG9kYXkv0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vdGltZXN0ZWNoLmluL2luZGlhcy1wcm9kaWdpb3VzLXNob3ctb24tbGlnaHRpbmctbGVkLWV4cG8tbmV3LWRlbGhpLTIwMjMtb3BlbnMtdG9kYXkv0gEA?oc=5\" target=\"_blank\">India's prodigious show on lighting 'LED Expo New Delhi 2023' opens today<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TimesTech<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"India's prodigious show on lighting 'LED Expo New Delhi 2023' opens today - TimesTech","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8vdGltZXN0ZWNoLmluL2luZGlhcy1wcm9kaWdpb3VzLXNob3ctb24tbGlnaHRpbmctbGVkLWV4cG8tbmV3LWRlbGhpLTIwMjMtb3BlbnMtdG9kYXkv0gEA?oc=5\" target=\"_blank\">India's prodigious show on lighting 'LED Expo New Delhi 2023' opens today<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">TimesTech<\/font>","source.href":"https:\/\/timestech.in","source.title":"TimesTech","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"The much-anticipated LED Expo New Delhi 2023 has officially opened its doors today, promising to be a spectacular showcase of advanced lighting solutions and innovations. As the leading LED-focused trade show in India, this edition of the event is bringing together the experts from the architecture, interior design, lighting industry leaders, product designers, innovators and experts on a single show floor Inaugurated today, LED Expo New Delhi 2023 marks a significant milestone in the evolution of the LED lighting industry. With an extensive range of exhibitors, the show is set to exceed expectations and set new standards for technological advancements in the field of LED lighting. The show was inaugurated by eminent panel members consisting of: Shri Milind Deore, Secretary, Bureau of Energy Efficiency, Ministry of Power, Government of India Ar. Abhay Purohit, President, Council of Architecture Ar. Kuldeep Sharma, Chief Architect, Vishwakarma Interiors Dr Sandeep Garg, Former Energy Economist, Bureau of Energy Efficiency, Ministry of Power Ms Lipika Sud, Director and Principal Designer Lipika Sud Interiors Pvt. Ltd Mr. Raja Mukherjee, Managing Director of Lighting Business at Panasonic Mr. Kristian Jenkins, Business Development Head, Asia Pacific, CASAMBI Mr. Mukesh Gandhi, President, Luminaire – Accessories – Components – Manufacturers – Association (LACMA) Mr. Deepak Doshi, Vice President, LACMA Expressing his views on energy efficiency, Sh Milind Deore, Secretary, Bureau of Energy Efficiency, Ministry of Power, Government of India during the inauguration stated: “I saw a lot of Micro Small and Medium Enterprises (MSMEs) have participated here which is a significant thing. In the last 10 years India has grown significantly after I witness this expo. For promoting LED, our Hon’ble Prime Minister Shri Narendra Modi, Government of India had initiated ‘Ujala’ scheme in the year 2016 through which LED lamps were given to every household. Led lamps were costing around INR 400 – INR 500 per lamp and now they are available around INR 50 – INR 60, this is a big transformation that has come across the market has totally phased out the general lighting service bulbs (GLS). This indicates 80% of the market has been converted into LED which is commendable. Lot of developing countries have also participated here and this will create joint or bilateral opportunities for the MSMEs. However, if we manufacture in India through our machines and technologies will serve to be more beneficial for the Indian economy. I believe LED Expo New Delhi will benefit in these areas and also expand the clusters of this product category.” Appreciating the show and the event, Ar Abhay Purohit, President, Council of Architecture, shared his views as: “This is a very good experience because the Indian and International LED manufacturers and suppliers have brought their designs here and the transformation happening through LED lighting is showcased here. Some Indian manufacturers participating here show how LED industry has advanced the in the last five years and the industry has grown exponentially. This shows our LED industry has become more mature. The Indian and international exhibitors showcasing their products and they are very competent with each other. This creates a great learning experience for both of them and is good for the visitors.” “Mr Raj Manek, Executive Director and Board Member, Messe Frankfurt Asia Holdings Ltd, expressed his enthusiasm for the show by saying: “We are thrilled to welcome you to a yet another illustrious edition of LED Expo New Delhi 2023. The lighting industry is undergoing a transformative phase and this event will shine a light on the incredible innovations and trends that are shaping our future. We are witnessing the drive of energy efficient and smart solutions across diverse industries and lighting is also one of them. We are glad to see exhibitors utilise this platform for promoting new products which are contributing towards sustainability, energy efficiency and are aesthetically pleasing at the same time.” Key Highlights of LED Expo New Delhi 2023: Product Launches: 250+ Product launches from leading manufacturers and suppliers who will present their latest offerings, providing a first look at the show Energy Efficient Solutions: The expo will showcase environmentally friendly and energy-efficient lighting technologies, aligning with India’s commitment towards a greener future Smart Lighting: Explore the world of smart lighting systems and controls, including IoT integration and intelligent lighting management Design and Aesthetics: Discover the aesthetically designed lights for architectural, decorative, landscape and customised lighting solutions In addition to the comprehensive exhibition, LED Expo New Delhi 2023 will feature educational sessions planned in collaboration with Council of Architecture which has is a historic collaboration for this event. Also aligned are sessions in association with LACMA, a workshop by Women in Lighting and a session by Interior Designer Lipika Sud. Visitors to this year’s expo can expect a wealth of exciting developments in LED technology, with a strong emphasis on sustainability, energy efficiency and smart lighting solutions. The event will feature an array of products and services that cater to various industries, from architectural and commercial lighting to industrial and residential applications. With 1,000+ products on the show floor, the event will present product variants and innovations in areas like OLED, UV-C LED, and human-centric lighting. LED Expo New Delhi 2023 will run from Thursday 2nd to Saturday 4th November 2023 at the India Expo Mart (IEML), in Greater Noida. The platform is a must visit for all lighting enthusiasts who are looking forward to find out what is new in the industry.","filter_flag":1}
{"title":"Call for views launched on updated energy efficiency standards for social housing - Scottish Housing News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnNjb3R0aXNoaG91c2luZ25ld3MuY29tL2FydGljbGVzL2NhbGwtZm9yLXZpZXdzLWxhdW5jaGVkLW9uLXVwZGF0ZWQtZW5lcmd5LWVmZmljaWVuY3ktc3RhbmRhcmRzLWZvci1zb2NpYWwtaG91c2luZ9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnNjb3R0aXNoaG91c2luZ25ld3MuY29tL2FydGljbGVzL2NhbGwtZm9yLXZpZXdzLWxhdW5jaGVkLW9uLXVwZGF0ZWQtZW5lcmd5LWVmZmljaWVuY3ktc3RhbmRhcmRzLWZvci1zb2NpYWwtaG91c2luZ9IBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3LnNjb3R0aXNoaG91c2luZ25ld3MuY29tL2FydGljbGVzL2NhbGwtZm9yLXZpZXdzLWxhdW5jaGVkLW9uLXVwZGF0ZWQtZW5lcmd5LWVmZmljaWVuY3ktc3RhbmRhcmRzLWZvci1zb2NpYWwtaG91c2luZ9IBAA","guidislink":false,"published":"Wed, 29 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=29, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=333, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnNjb3R0aXNoaG91c2luZ25ld3MuY29tL2FydGljbGVzL2NhbGwtZm9yLXZpZXdzLWxhdW5jaGVkLW9uLXVwZGF0ZWQtZW5lcmd5LWVmZmljaWVuY3ktc3RhbmRhcmRzLWZvci1zb2NpYWwtaG91c2luZ9IBAA?oc=5\" target=\"_blank\">Call for views launched on updated energy efficiency standards for social housing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Scottish Housing News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Call for views launched on updated energy efficiency standards for social housing - Scottish Housing News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3LnNjb3R0aXNoaG91c2luZ25ld3MuY29tL2FydGljbGVzL2NhbGwtZm9yLXZpZXdzLWxhdW5jaGVkLW9uLXVwZGF0ZWQtZW5lcmd5LWVmZmljaWVuY3ktc3RhbmRhcmRzLWZvci1zb2NpYWwtaG91c2luZ9IBAA?oc=5\" target=\"_blank\">Call for views launched on updated energy efficiency standards for social housing<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Scottish Housing News<\/font>","source.href":"https:\/\/www.scottishhousingnews.com","source.title":"Scottish Housing News","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Call for views launched on updated energy efficiency standards for social housing Zero carbon buildings minister Patrick Harvie Social landlords will have a “critical” role in driving demand for heat networks and can provide a “leading voice” in how we transform communities, Patrick Harvie has told Scottish Housing News after the zero carbon buildings minister published a consultation on updated energy efficiency standards for social housing. Under proposals for a new Social Housing Net Zero Standard (SHNZS), social landlords would be required to meet an energy efficiency standard between 2033 and 2040 and install clean heating across their stock by 2045 where it is technically feasible and cost-effective to do so. The consultation document sets out proposals for a new fabric rating to be introduced, which social housing will need to meet by 2033, and for the replacement of fossil fuel gas and electric heating systems with clean heat alternatives by 2045, such as heat pumps or solar thermal heating. A consultation on Heat in Buildings for the wider housing sector has also been launched at the same time, which will introduce the same backstop of 2045 for the transition to clean heat. Speaking to Scottish Housing News this morning, Mr Harvie said the proposals deliver the certainty and long-term planning that social landlords, developers and other impacted parties have long called for. “We know where we need to get to by 2045,” he said. “Not just high performance in terms of energy standards and energy efficiency, but shifting away from fossil fuel for the way we heat our buildings. But we can’t wait until 2044 to see an impossible bottleneck, we need to give a clear sense of the direction of travel and confidence that this will continue to accelerate.” “It has been accelerating, but we need to continue that trend progressively and we need businesses that housing developers work with, whether they are housebuilders themselves or other contractors, to have the confidence to invest in the skills and the capacity. We need to make it very clear to anyone who is looking at investing in the green transition that Scotland’s a great place to put your money and to build a business, whether innovating new products onto the market that will achieve the heat transition more affordably or just scaling up. “In the construction sector, we’re already seeing changes of attitude and a lot less resistance to ambitious change than might have been the case 10 or 20 years ago. I think the construction sector knows that change is coming so we are working with the grain of that.” Heat in Buildings Bill As part of the Heat in Buildings Bill, Mr Harvie admitted that an initial target for one million homes to have low or zero-emission heating by 2030 is “unachievable” and will not be met until later in the decade. And while most of the timescales set out in his initial strategy in 2021 remain intact, the phasing out of fossil fuel heating systems for off-gas homes, which were initially set to make changes from 2025, will now align with the majority of properties that are on gas mains supply. Under the plans, all homes will need to end their use of fossil fuel emission heating systems by 2045, when Scotland is due to become net zero in law. Proposals in the Heating and Buildings Bill include: That private rented homes will be required to meet a minimum energy efficiency standard no later than 2028; That owner-occupied homes will be required to meet the same minimum energy efficiency standard by the end of 2033; That all homes and non-domestic buildings will be required to end their use of polluting heating by the end of 2045; and In order to create a smooth trajectory towards 2045, that those purchasing a home or non-domestic property before 2045 would be required to end their use of polluting heating systems within a specific period following that purchase. Mr Harvie said the changes have made the proposals “fairer and clearer”. “All the key dates that we set out in the 2021 strategy are still in place, what we have had to do is refine the expectation about how much of that heat transition we can achieve by 2030,” he told SHN. “And we recognise that more of that will happen in the early 2030s than by 2030.” He added: “That is to take account of several things. Partly it’s the cost of living crisis, which is also the cost of doing business crisis. We know that construction is a sector where inflation has hit particularly hard, as well as the challenges in terms of labour supply post-Brexit, but we’ve also had to take into account the way that Westminster announcements have undermined investment throughout the UK. “So we recognise that that goal of a million by 2030 is not the realistic path anymore and that we’re likely to see those kind of numbers enter the early 2030s instead of by 2030. But it doesn’t fundamentally change the trajectory that we’re on or indeed the actions that we need to take to support everyone whether its large-scale social landlords, community organisations, the construction industry itself, or indeed householders, and landlords.” The announcement of a proposed Social Housing Net Zero Standard, and its focus on a fabric efficiency rating, comes in response to a report by the Zero Emissions Social Housing Taskforce (ZEST) which called for an accelerated review of the Energy Efficiency Standard for Social Housing (EESSH2), and alignment with Heat in Buildings to provide clarity for social landlords to guide retrofit and investment planning. By setting out two options for the fabric efficiency rating in the consultation, Mr Harvie was asked whether the proposals will provide adequate incentive for landlords to carry out the most expensive upgrades. “Well, very clearly there’s been a great deal asked of the social housing sector in particular,” he answered. “They’ve already led the way in energy efficiency but a whole host of other quality standards have improved and need to continue to improve and we’re looking to make sure that we offer a coherent package of what’s being asked rather than asking the impossible. “We want to make sure that this is an achievable deliverable change, and that it can be done in the way that best suits the investment plans that each landlord will have. They will know their housing stock, they will know what their priorities are both in terms of retrofit and new supply and we know that we’ll need to make sure that the way that we support investment through the specific Social Housing Net Zero Fund, and the way that we support housing providers to do new supply - they need to fit together as well. “I think offering some flexibility is the most effective way of getting results for people who are going to be living in those homes and paying their energy bills. But it’s also really consistent, I think, with the long-term direction of travel. We need to see fabric improvements, we also need to see by 2045, the end of fossil fuel heating systems and I think the package that we put out yesterday is a bold package, and one that can be a template for the rest of the UK.” Financial support On how to finance the transition, Mr Harvie said it was unrealistic not to proceed with the consultation until a clearer picture of all potential funding streams were in place. “I think it’s inevitable that all of this will continue to develop over time,” he added. “We’re talking about more than 20 years’ worth of work and just as I think it would be unreasonable for me to say that the package of individual householders support that we have, generous though it is at the moment, that it’s never going to change, of course it’s going to have to change and refine over time to meet the changing circumstances. So the way that we support the social housing sector is also going to have to change over time. “I don’t think it would be right to say that we’re not going to proceed with the consultation until we have every answer to every detail, because we’ll never be in that position. These aspects about how we’re going to fund the work that’s going to happen are going to continue to change over time. Take something like heat networks, for example, social landlords could be really pivotal organisations in providing demand assurance for heat networks, so that the investors know that there are the buildings, the homes and the customers to connect to those networks. That, criticality, is going to make those networks viable. “Over time we’re going to be seeing continued innovation in how we bring together a range of different sources of investment from the social landlords investment programme, through individual building owners, through energy companies, financial products like green mortgages, and institutional investors that are interested in things like heat networks.” Sector response Sally Thomas, the Scottish Federation of Housing Associations (SFHA) CEO, who co-chaired ZEST, said it welcomes any consultation geared towards lowering energy costs for social housing tenants. Ms Thomas added: “Our social homes are already some of the most energy-efficient in Scotland and as a sector we are fully committed to tackling the climate emergency and meeting the country’s net-zero targets. This consultation is an important step in ensuring those targets are fair, affordable and deliverable. “There are approximately 600,000 homes in the Scottish social housing sector, with 500,000 gas boilers which will need to be changed by 2045 to clean heating systems. Social housing therefore has a vital contribution to make to meeting Scotland’s climate change targets, but it must be adequately supported to do so. “We have been clear from the outset that the costs of this transition must not impact on our members’ ability to maintain affordable rents for their tenants and build the new social homes our country needs, so it’s important now that the Scottish Government also outlines how we will adequately fund the transition to clean heat.” The Glasgow and West of Scotland Forum of Housing Associations (GWSF) said there won’t be a just transition without substantial financial support. Colleen Rowan, research and policy lead at the Glasgow and West of Scotland Forum of Housing Associations (GWSF), said: “GWSF very much welcomes the consultation, and the opportunities we’ve had to input via the EESSH2 Review Group. Tackling fuel poverty and reducing carbon emissions are both big priorities for our members. “The consultation on a standard for the property fabric suggests two alternatives, with one markedly less ambitious than the other because it’s spread over a much longer timescale. In an ideal world, our members would want to be really positive and to see the more ambitious target adopted. “But if it’s primarily tenants’ rent that has to fund our ambitiousness, there won’t be the ‘just transition’ ministers rightly want. Without a programme of grant subsidy similar to the one in place for new build, progress in improving energy efficiency is likely to be much slower than we would want, and in turn, that would also mean a slower transition to renewable heating.” The Existing Homes Alliance welcomed the consultations as a “step in the right direction”. Lori McElroy, chair, said: “This consultation is a welcome step in the right direction – clear standards and regulations are a core part of the package needed to ensure Scotland’s homes are warm and more affordable to heat. They will help homeowners and landlords understand what they need to do to improve their homes over the coming years. “Improving the energy efficiency of homes is key to reducing energy bills and by switching to zero emissions heating we can end households’ exposure to unstable fossil fuel prices – helping to lift people out of fuel poverty. “As demonstrated in a recent letter to the First Minister signed by over 30 industry organisations, businesses are ready and willing to help meet the climate challenge but they need certainty. Clarity on standards and timescales will give businesses a clear pipeline of work, allowing them to scale up to meet growing demand. “However, regulations won’t work on their own – they need to be accompanied by expanded advice and support services. We can learn from what is happening in other countries already, for example Ireland, where there is a network of one-stop shops which support people through the whole installation service. “The Scottish Government must also move quickly on the recommendations of the Green Heat Finance Taskforce to develop mechanisms such as property linked finance so that warm homes with clean heating are affordable to all.” Consumer Scotland head of energy Kate Morrison said: “Recent research published by Consumer Scotland found most consumers are concerned about climate change and want to do more to address it, but 67% of consumers either didn’t know or were unsure what they had to do to transition to net zero. “The consultation represents the start of this discussion, helping consumers to understand what will be expected of them and the routes they can take to decarbonise their homes. “Consumer Scotland will engage with the consultation to ensure that fairness in decision making and a strong focus on the consumer is embedded into the drafting of the Bill.” British heat pump manufacturer Kensa welcomed the Scottish Government’s “progressive” proposals. Group CEO Tamsin Lishman said: “As a proud Scot, I warmly welcome the launch of the Scottish Government’s consultation on proposals for a Heat in Buildings Bill - this Bill is urgently needed to provide clear legislation to support the decarbonisation of buildings across Scotland. “Heating is the third-largest cause of greenhouse gas emissions in Scotland, upgrading our homes to clean, efficient zero-emissions heating is therefore absolutely essential if Scotland is to meet its climate change targets, tackle fuel poverty and achieve energy security. “The Scottish Government’s proposals could be a major step in the right direction for the heat pump sector, setting out that by 2045, all building owners will need to stop using polluting heating. “If the Scottish Government is to achieve this laudable aim, it must consider the use of all available heat pump technologies, such as networked heat pumps. This established approach, with a heat pump in each home connected to a third-party network in the road, will ensure all homes, from tenements to terraces to tower blocks, are able to access sustainable and affordable heat. “Unrolling this technology on a street-by-street basis will require a more strategic approach to that taken to date, but the benefits are clear – lower energy consumption, lower energy bills, and an easier path to net zero. I look forward to responding to this consultation and working with the Scottish Government to make this a reality.” The proposals have also been welcomed by the Scottish Government’s statutory advisers, the Climate Change Committee. Chris Stark, chief executive of the Climate Change Committee, said: “These are bold proposals to decarbonise Scotland’s buildings over the next two decades. They recognise the importance of a long-term plan for low-carbon heat, with a very welcome focus on upgrading properties at the point of sale. “There is also greater clarity on the role of low-carbon heat networks and tougher obligations on landlords to upgrade the energy efficiency of their properties. If adopted, these proposals could become a template for other parts of the UK.” But concerns have been raised about the costs involved, with no clarity given by Mr Harvie over how the bulk of the £33 billion bill to decarbonise Scotland’s buildings will be paid – with an expectation it will largely come from the private sector. Scottish Labour net zero spokesperson Sarah Boyack said: “It’s been two years since the first draft heat in buildings strategy was published for consultation, but the government’s plans are still in chaos. Timescales are slipping, basic questions have not been answered, and we still have no idea how this £33bn plan will actually be paid for. “Energy bills are through the roof and fuel poverty is at appalling levels – we urgently need a real plan to make homes more energy efficient, but last year the Snp-green government failed to spend £133m of budgeted energy-efficiency funding. Scots need warm homes, not warm words, and the Snp-green government must show some leadership to deliver it.”","filter_flag":1}
{"title":"ISM 2024: More exhibitors, more diversity and new highlights - Kennedy’s Confection","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2VubmVkeXNjb25mZWN0aW9uLmNvLnVrL2lzbS0yMDI0LW1vcmUtZXhoaWJpdG9ycy1tb3JlLWRpdmVyc2l0eS1hbmQtbmV3LWhpZ2hsaWdodHMv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2VubmVkeXNjb25mZWN0aW9uLmNvLnVrL2lzbS0yMDI0LW1vcmUtZXhoaWJpdG9ycy1tb3JlLWRpdmVyc2l0eS1hbmQtbmV3LWhpZ2hsaWdodHMv0gEA?oc=5","id":"CBMiXGh0dHBzOi8va2VubmVkeXNjb25mZWN0aW9uLmNvLnVrL2lzbS0yMDI0LW1vcmUtZXhoaWJpdG9ycy1tb3JlLWRpdmVyc2l0eS1hbmQtbmV3LWhpZ2hsaWdodHMv0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2VubmVkeXNjb25mZWN0aW9uLmNvLnVrL2lzbS0yMDI0LW1vcmUtZXhoaWJpdG9ycy1tb3JlLWRpdmVyc2l0eS1hbmQtbmV3LWhpZ2hsaWdodHMv0gEA?oc=5\" target=\"_blank\">ISM 2024: More exhibitors, more diversity and new highlights<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kennedy’s Confection<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"ISM 2024: More exhibitors, more diversity and new highlights - Kennedy’s Confection","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXGh0dHBzOi8va2VubmVkeXNjb25mZWN0aW9uLmNvLnVrL2lzbS0yMDI0LW1vcmUtZXhoaWJpdG9ycy1tb3JlLWRpdmVyc2l0eS1hbmQtbmV3LWhpZ2hsaWdodHMv0gEA?oc=5\" target=\"_blank\">ISM 2024: More exhibitors, more diversity and new highlights<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Kennedy’s Confection<\/font>","source.href":"https:\/\/kennedysconfection.co.uk","source.title":"Kennedy’s Confection","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"In the year 2024, ISM, the leading global trade fair for sweets and snacks, is more international and diversified than ever before. With 1,350 exhibitors from 70 countries and 35 pavilions from Europe, Asia, North and South America, the trade fair is presenting a wide spectrum of products and innovations. The participants include both established global leaders and national industry giants as well as aspiring young companies and start-ups from countries like Albania, Algeria, Canada, Jordan and Uzbekistan. The six halls of ISM offer the visitors the opportunity to experience the world of sweets and snacks with all their senses. Particularly the expansion of Hall 4.2 including new country pavilions from the USA, Latin America and the Middle East open up room for additional, international diversity. These are enhancing the already established pavilions from Belgium, France, Greece, Ireland, Italy, the Netherlands, Switzerland and the United Kingdom. In Hall 5.2, the successful Lab5 by ISM is being continued and extended to offer a unique trade fair experience with festival flair. Further highlights of the trade fair encompass the annually conferred ISM Award, which pays tribute to a personality who has rendered special services to the sweets and snacks industry. The New Product Showcase (NPS) is equally diversified and the three most innovative products are distinguished during the ISM Night on Sunday evening. As in the previous year, the Consumer Award will be conferred for the second time in cooperation with FoodNews Germany. A new format this year is the Consumer Award in cooperation with ISM Middle East, where consumers from the United Arab Emirates are allowed to choose their favourite product from among the NPS products. Impression ISM 2023 The programme on the Expert Stage includes once again trend lectures and market analyses by Innova Market Insights and Euromonitor, start-up pitches and further main topics, including Digital Education in cooperation with dmexco as well as examples of best practice from the sweets industry on themes like energy efficiency, sustainability, climate-friendly production, regenerative value chains and the recycling economy. Exhibitors and influencers in the sweets and snacks section will be brought together in the scope of the innovative speed dating format. This promotes the networking of new products in the community and their marketing, while at the same time increasing the brand recognition. A further new item on the agenda is the ISM Party on Sunday evening, which especially addresses young professionals and serves as an informal meeting point bringing the first day of the fair to a close in a relaxed atmosphere. From the speed dating format for exhibitors and influencers through to the ISM Party for Young Professionals – ISM 2024 offers a combination between numerous event formats and inspiring networking for industry professionals and interested parties from all over the globe. ISM 2024 is being staged from 28 to 31 January. Tickets can already be purchased online now. For exhibitor preview packages in the Kennedy’s Confection’s ProSweets\/ISM edition contact Gary Smythson gsmythson@kennedys.co.uk","filter_flag":1}
{"title":"Suffolk Building Society launches new eco self-build product - Financial Reporter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZpbmFuY2lhbHJlcG9ydGVyLmNvLnVrL3N1ZmZvbGstYnVpbGRpbmctc29jaWV0eS1sYXVuY2hlcy1uZXctZWNvLXNlbGYtYnVpbGQtcHJvZHVjdC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZpbmFuY2lhbHJlcG9ydGVyLmNvLnVrL3N1ZmZvbGstYnVpbGRpbmctc29jaWV0eS1sYXVuY2hlcy1uZXctZWNvLXNlbGYtYnVpbGQtcHJvZHVjdC5odG1s0gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LmZpbmFuY2lhbHJlcG9ydGVyLmNvLnVrL3N1ZmZvbGstYnVpbGRpbmctc29jaWV0eS1sYXVuY2hlcy1uZXctZWNvLXNlbGYtYnVpbGQtcHJvZHVjdC5odG1s0gEA","guidislink":false,"published":"Thu, 02 Nov 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=2, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=306, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZpbmFuY2lhbHJlcG9ydGVyLmNvLnVrL3N1ZmZvbGstYnVpbGRpbmctc29jaWV0eS1sYXVuY2hlcy1uZXctZWNvLXNlbGYtYnVpbGQtcHJvZHVjdC5odG1s0gEA?oc=5\" target=\"_blank\">Suffolk Building Society launches new eco self-build product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Reporter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Suffolk Building Society launches new eco self-build product - Financial Reporter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZpbmFuY2lhbHJlcG9ydGVyLmNvLnVrL3N1ZmZvbGstYnVpbGRpbmctc29jaWV0eS1sYXVuY2hlcy1uZXctZWNvLXNlbGYtYnVpbGQtcHJvZHVjdC5odG1s0gEA?oc=5\" target=\"_blank\">Suffolk Building Society launches new eco self-build product<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Reporter<\/font>","source.href":"https:\/\/www.financialreporter.co.uk","source.title":"Financial Reporter","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"\"These new products have been specifically designed with that in mind, incentivising self build borrowers and renovators to build more energy efficient properties by rewarding them with reduced rates and fees\" - Andrew Sadler - Suffolk Building Society Suffolk Building Society has announced the launch of a new eco self-build mortgage, featuring a lower interest rate than its standard self-build product and a £500 reduction on the completion fee. According to the society, it will also offer all new, or existing, self-build borrowers and renovators a lower interest rate follow-on product (compared to the standard retention range) if the resulting property has an Energy Performance Certificate rating of A or B. As part of its dedication to championing self-builds, the Society will waive Early Repayment Charges for all self-builders and renovators who switch to a follow-on product, to enable them to benefit from a more competitive rate after their build is complete. New eco self-build 2-year product: - Eco Self Build & Renovation 2-Year Discount 6.09% (SVR minus 2.60%) - £999 Completion Fee (standard self-build discount is 6.19%, £1,499 fee) - The product is for self-builders and renovators who intend to build or renovate a property to an EPC rating of A or B, which includes at least two of the following qualifying energy-efficient features: Photovoltaics, solar panels, air source heat pump, ground source heat pump, rainwater harvesting, greywater collection, triple glazing, mechanical ventilation with heat recovery system, biomass pellet boiler, wind turbines, higher than usual levels of thermal insulation, geothermal heating, compostable toilet or electric car charging stations. These features will need to be evidenced in the plans\/costings. - The product is available up to an 80% LTV and with a maximum loan size of £1m. The application fee is £199 and the completion fee is £999 (£500 lower than the Society’s standard self-build product). In addition to this, the society is also offering a discounted follow-on product at 25bps lower than its residential retention products, for all self-builders and renovators if their finished build has an EPC rating of A or B. Andrew Sadler, Key Account Manager at Suffolk Building Society said: “At Suffolk Building Society, we are committed to being carbon neutral in our own operations by 2030, but we also want to support our members to improve their own energy efficiency. “These new products have been specifically designed with that in mind, incentivising self-build borrowers and renovators to build more energy-efficient properties by rewarding them with reduced rates and fees. “We’ve always aimed to make self-build projects attractive, operating flexible stage payments, as well as lending on the land purchase, so we’re pleased to be taking this a step further.”","filter_flag":1}
{"title":"Goldmedal Electricals Unveils New Line-up of Stylish, Energy-Efficient Water Heaters - CIO News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vY2lvbmV3cy5jby5pbi9nb2xkbWVkYWwtZWxlY3RyaWNhbHMtdW52ZWlscy1uZXctbGluZS11cC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vY2lvbmV3cy5jby5pbi9nb2xkbWVkYWwtZWxlY3RyaWNhbHMtdW52ZWlscy1uZXctbGluZS11cC_SAQA?oc=5","id":"CBMiQGh0dHBzOi8vY2lvbmV3cy5jby5pbi9nb2xkbWVkYWwtZWxlY3RyaWNhbHMtdW52ZWlscy1uZXctbGluZS11cC_SAQA","guidislink":false,"published":"Wed, 22 Nov 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=11, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=326, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vY2lvbmV3cy5jby5pbi9nb2xkbWVkYWwtZWxlY3RyaWNhbHMtdW52ZWlscy1uZXctbGluZS11cC_SAQA?oc=5\" target=\"_blank\">Goldmedal Electricals Unveils New Line-up of Stylish, Energy-Efficient Water Heaters<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CIO News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Goldmedal Electricals Unveils New Line-up of Stylish, Energy-Efficient Water Heaters - CIO News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vY2lvbmV3cy5jby5pbi9nb2xkbWVkYWwtZWxlY3RyaWNhbHMtdW52ZWlscy1uZXctbGluZS11cC_SAQA?oc=5\" target=\"_blank\">Goldmedal Electricals Unveils New Line-up of Stylish, Energy-Efficient Water Heaters<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CIO News<\/font>","source.href":"https:\/\/cionews.co.in","source.title":"CIO News","query":"https:\/\/news.google.com\/rss\/search?q=\"Energy Efficiency\" \"new products\"+after:2023-11-01+before:2023-11-30","text":"Goldmedal Electricals dives into the water heater market. National, November 22, 2023: Goldmedal Electricals, one of India’s leading Fast Moving Electrical Goods (FMEG) companies, is expanding its product portfolio with the introduction of its new range of water heaters. Goldmedal, an established brand in the electrical wiring devices, home automation, wires, LEDs, and fan segments, aims to replicate its success in the water heating category with a series of storage and instant water heater products that offer superior efficiency, design, and durability. Speaking at the product unveiling, Mr. Kishan Jain, Director, Goldmedal Electricals, stated, “Our commitment has always been to deliver technologically advanced, premium quality, durable, and value-driven products. The launch of our new range of water heaters is another step in that direction. These products have been meticulously designed to meet the demands of discerning consumers, offering exceptional energy efficiency and reliability.” The new Goldmedal water heaters will be available in a variety of models with multiple tank capabilities to cater to a wide variety of needs. From storage to instant water heaters, the product list boasts features such as corrosion-resistant materials, digital temperature display, Dynoflow technology for quicker heating, multiple-level safety, and highly efficient, eco-friendly insulation materials. Advanced safety features include precision temperature control, overheat protection, and pressure control valves to ensure a safe and reliable user experience. Goldmedal is committed to providing best-in-class after-sales service, backed by a dedicated call center for immediate resolution of customer grievances. The company also promises free installation in most locations across the country, along with quick and hassle-free on-site services. Speaking about the new products, Mr. Bishan Jain, Director at Goldmedal Electricals, added, “We have established a reputation as one of the most innovative companies in the electrical wiring devices segment over the last 40 years, and it’s our promise to deliver the same level of quality in every product that bears the Goldmedal brand. With Goldmedal Water Heaters, customers will experience the latest product innovations, the highest possible levels of safety, and superior installation and after-sales services. Like with our other 22-11-2023 product categories, our aim will be to continue raising the bar in the water heating segment.” All Goldmedal water heaters are rated 4-star BEE and above and offer up to 10 years of warranty. The company has ambitious plans for its water heater category, aiming to replicate the success it enjoyed with its foray into fans in 2021. Also read: Navigating the Cybersecurity Labyrinth: A Strategic Blueprint for CIOs Do Follow: CIO News LinkedIn Account | CIO News Facebook | CIO News Youtube | CIO News Twitter About us: CIO News, a proprietary of Mercadeo, produces award-winning content and resources for IT leaders across any industry through print articles and recorded video interviews on topics in the technology sector such as Digital Transformation, Artificial Intelligence (AI), Machine Learning (ML), Cloud, Robotics, Cyber-security, Data, Analytics, SOC, SASE, among other technology topics.","filter_flag":1}
