{"title":"10 Provocations for Circular Design - Metropolis Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vdmlld3BvaW50cy8xMC1wcm92b2NhdGlvbnMtZm9yLWNpcmN1bGFyLWRlc2lnbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vdmlld3BvaW50cy8xMC1wcm92b2NhdGlvbnMtZm9yLWNpcmN1bGFyLWRlc2lnbi_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vdmlld3BvaW50cy8xMC1wcm92b2NhdGlvbnMtZm9yLWNpcmN1bGFyLWRlc2lnbi_SAQA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vdmlld3BvaW50cy8xMC1wcm92b2NhdGlvbnMtZm9yLWNpcmN1bGFyLWRlc2lnbi_SAQA?oc=5\" target=\"_blank\">10 Provocations for Circular Design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Metropolis Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"10 Provocations for Circular Design - Metropolis Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vdmlld3BvaW50cy8xMC1wcm92b2NhdGlvbnMtZm9yLWNpcmN1bGFyLWRlc2lnbi_SAQA?oc=5\" target=\"_blank\">10 Provocations for Circular Design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Metropolis Magazine<\/font>","source.href":"https:\/\/metropolismag.com","source.title":"Metropolis Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"02. Are reclaimed materials good enough? Many currently popular materials and products typically depreciate in value— or are simply appreciated less—in their second life. Postconsumer PVC products, for example, are generally recycled into carpet backing, outdoor decking, or filler; ground-up ceramics must be either combined with virgin material for new products or used as aggregate in concrete. These two materials are commonplace in every building, and there are scores of others like them that currently have no clear recycling stream and cannot be reused as is or recovered without costly and extensive new manufacturing infrastructure. Even products and materials that escape damage during decommissioning have trouble finding a place in another project. Upholstered furniture is always a challenge for circularity because reupholstering is as expensive as buying new. Meanwhile, good luck finding a sustainable upholsterer like Kay Chesterfield in your area. How might this situation change? We need technological innovation in new materials and reasonable recycling processes, design shifts in how we build for disassembly and incorporate disassembled components, and a cultural revolution in how we value “used” commodities. Mock-ups have become a standard part of the design and construction process, but what happens to these expensive and well-crafted prototypes after they’ve served their purpose? New York–based firm New Affiliates began to notice a “correspondence of scale” between these mock-ups and the small sheds, greenhouses, and shade canopies in community gardens. This is how Testbeds was conceived— a collaboration with NYC Parks GreenThumb to repurpose building mock-ups in smaller structures. In a pilot project completed in September 2022, New Affiliates reused a concrete facade mock-up provided by the developer Cape Advisors in a new facility for The Garden by the Bay Community Garden. The project raises a question about building circularity: If structures could be carefully disassembled instead of being demolished, could we find similar reuses for whole assemblies rather than individual materials or products? COURTESY MICHAEL VAHRENWALD 03. Can we recycle buildings? Construction and demolition debris account for about 30 percent of all waste produced globally. And while scrap materials from construction and the detritus of demolished buildings can’t be recouped with the same value as virgin materials, it is estimated that 75 percent of all that waste still has some residual usefulness. This suggests two avenues of opportunities for the building industry. The first is to innovate in the decommissioning process—not just taking things apart with more care but perhaps removing assemblies or systems in ways that leave them intact for other immediate applications. (Architecture firm New Affiliates is piloting an approach that reuses building components in this way, and with a positive community impact.) The second is to build more horizontal integrations with other sectors. That will entail first aligning owners, contractors, architects, engineers, and workers around the value of building materials, then building new bridges with other industries so we can become part of their circular loops of materials and they can become part of ours. Mill 19 in Pittsburgh by MSR Design. COURTESY COREY GAFFER 04. Is adaptive reuse enough? Among those who are passionate about sustainable architecture and design, an adage coined by former AIA president Carl Elefante has come to be accepted wisdom: “The greenest building is the one that has already been built.” There seems to be a corresponding shift in practice, with billings for renovations and retrofits outstripping billings for new construction for the very first time in 2022. However, all retrofits and renovations are not equal. Many buildings are repeatedly adapted for different uses over time—see the case of Detroit’s Book Depository Building, which is now in its third incarnation—but whether those adaptations are done with an eye to long-term resilience, circularity, and regenerative impact on the planet’s life and resources is another matter altogether. We must also consider the social impact when low-income communities find that the old abandoned building around the corner is now a boutique hotel that makes their neighborhood too expensive to live in. For adaptive reuse to be truly considered a part of circular design principles, the retrofit itself must be as sustainable as possible. It must support our role in creating equitable communities and prepare the building for similarly sustainable retrofits in the future. Düsseldorf, Germany–based start-up Urselmann Interior used the renovation of its own office to demonstrate that interior fit-outs and tenant improvements can incorporate circular strategies and materials. In selecting products and materials, the team prioritized five principles inspired by the Cradle to Cradle standard—material health; recyclability; clean air and low emissions; protection of water, soil, and biodiversity; and social fairness. Material choices included secondhand lighting, Flokk’s Giroflex 313 chairs, and Kvadrat’s Really surface materials made from reclaimed textiles. COURTESY MAGDALENA GRUBER 05. Do you really need that renovation? Any building tends to experience many changes in its interiors over its lifetime. On average, most offices are renovated every ten years, and hotels might be refreshed much more frequently than that. With each renovation, old materials are pulled out and generally sent to the landfill; then new products are installed, which generates embodied carbon emissions. As studies done by Seattle-based LMN Architects show, these emissions tied to interior updates can add up to be more than those embodied in the structure and envelope combined. This is an aspect of carbon emissions that needs urgent attention because it’s a booming business—renovations and refreshes accounted for 49 percent of all projects at Interior Design Giants firms in 2022. In the face of the climate crisis, we must ask—is that renovation project worth the greenhouse gases it is going to send into our atmosphere? And if we must renovate, can we do it more responsibly? DENIS NOVIKOV \/ ISTOCK 06. Are trends destroying the planet? In his 1971 book Design for the Real World, sustainable design pioneer Victor Papanek incisively diagnosed what he called “Our Kleenex Culture”: “When people are persuaded, advertised, propagandized, and victimized into throwing away their cars every three years, their clothes twice yearly, their high-fidelity sets every few years, their houses every five years…then we may consider most other things fully obsolete. Throwing away furniture, transportation, clothing, and appliances may soon lead us to feel that marriages (and other personal relationships) are throw-away items as well and that on a global scale countries, and indeed entire sub-continents, are disposable like Kleenex.” More than 50 years later, things have barely changed. Meanwhile, home renovation and DIY videos amassed 39 billion views on TikTok in 2022, more than any other design topic. This, then, is the most resonant aspect of architecture and interior design to the larger public: a means to discard a previous lifestyle like used Kleenex and adopt a new style because we have been sold this behavior over and over by media. We’ve built a design culture that valorizes retrofits and renovations—acts that look circular at the architectural scale because they extend the life of existing buildings, but in actuality rely on wasteful practices at the level of interiors and products. At this year’s Alcova exhibition during Milan Design Week, crafting plastics! and DumoLab presented “SENSBIOM 2,” an installation that responded to ultraviolet radiation (UVR). Strings of lattices made out of Nuatan bioplastic and cellulose-based biomaterials automatically changed color from yellow to brick red in response to UVR in the sunshine streaming through a skylight above. The colors served as a warning—anything darker than a golden orange represented a Global Solar UV Index of 3 or higher, a range determined by the World Health Organization to be harmful to our skin and eyes. The lattices remained in the orange and red range in the Milanese spring, causing some alarm to visitors while also demonstrating the new potential of biomaterials. COURTESY DANIELA TROST 07. Will biobased materials save us? Over the past decade, we have seen something of a revolution in biobased materials—especially in soy-, corn-, sugarcane-, or hemp-derived plastics that offer comparable performance to their conventional fossil fuel–based counterparts. Can we avoid ecological catastrophe by switching our material economy to biobased alternatives? The first warning that both critics and admirers of bioplastics issue is that the sources of these materials must remain renewable and not impose a new burden on the planet. To produce enough materials to serve our current needs, we’d no doubt require a large-scale shift in our agricultural system. The second caveat is that these materials haven’t been around long enough for us to accurately predict what will happen at the end of their useful life—a November 2022 paper published in Frontiers of Sustainability found that 60 percent of plastics marketed in the United Kingdom as “home compostable” fail to disintegrate even after six months. With these unknowns, it’s best to be cautiously optimistic about biobased materials, but know for certain that there is no salvation for us that does not involve consuming less. Samuel Aguirre, an MFA furniture design student at the Rhode Island School of Design, showcased his 03VXX series of chairs at WantedDesign’s Launch Pad exhibition during NYCxDESIGN 2023. Made of a variety of compostable materials including hemp fibers, cotton fibers, and postconsumer paper pulp, the handcrafted chairs are designed to biodegrade in less than a year. COURTESY THE DESIGNER 08. Who will compost your chair? Here’s a thought experiment: If we could wave a magic wand and make every material in every product today biodegradable or compostable, would that be a good thing? Unfortunately, without the millions of composting facilities we would need, all those products would end up in landfills where they would decompose to produce methane—a greenhouse gas 21 times more potent in its ability to warm the planet than carbon dioxide. Or, as Dr. Andrew Dent, EVP of research at Material ConneXion and chief material scientist at Material Bank, explains, “when bioplastics do end up in the ocean and begin to decay it will raise the acidity levels of the oceans.” So anyone who is enamored with the possibilities of biobased and biodegradable materials needs to become a composting advocate. It’s easy to learn how to properly tend a compost heap in the backyard; it is more challenging to petition local governments to scale up composting in places where people aren’t always lucky enough to have backyards. But pick one of those options, because if our industry is set to become the number one consumer of fossil fuels through our use of plastics, we’d better become the number one adherents of composting. Oakland, California–based company Model No. 3D prints its furniture using bio-resins at a facility that runs entirely on wind and solar energy. Any hardwood components are FSC-certified or salvaged, and all finishes are nontoxic and made with natural oils and waxes. The pieces are produced to order and packaged in recycled materials. COURTESY THE MANUFACTURER 09. Is circularity sustainable? The Ellen MacArthur Foundation defines the circular economy as a “resilient system that is good for business, people, and the environment.” Many initiatives in the architecture and interior design industry fall far short of this standard by merely focusing on recycling or reclaiming materials. Not every building component (looking at you here, asbestos insulation) is worthy of being reused, and not every material—PVC with orthophthalates, for example—should be recycled because of the harm it could cause to people and the environment. Each year, new chemicals are added to an already long list of toxic components, and indeed the day might arrive when a future generation might consider all petroleum-based materials worthy of being Red Listed. Hines office in Seattle by LMN Architects. COURTESY BENJAMIN BENSCHNEIDER 10. Can we design less? Closing the loop on materials and energy is not enough if it merely confirms and facilitates our current culture of overconsumption. Indeed, is expending the energy needed to keep materials in constant use worth the cost to our planet’s already exhausted resources—especially when imperfect waste collection and recycling processes could release new, less understood toxins or cause unintended harm to ecosystems? The scenario generally painted in our industry, where business as usual can be tweaked into a closed loop through supply chain management and material substitutions, is a pipe dream. Instead, in the ideal circular design approach, we would continue to apply our design abilities in areas where proven, clean, and regenerative extraction, manufacturing, construction, and reclamation processes are available. Where such processes cannot exist, we must eventually stop designing, producing, and building. Could we then redirect those efforts into areas where our skills as shapers of space are sorely needed but rarely provided—outside of downtowns, commercial districts, and booming neighborhoods, and in places currently shaped by default to the detriment of people and the planet? In such places and communities we might need to become listeners, partners, and advocates, learning and honing skills that many of us still lack. We might find we need less design as we practice it today, and more new forms of creativity that still need to be imagined.","filter_flag":1}
{"title":"CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool - Packaging Strategies","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5","id":"CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA","guidislink":false,"published":"Wed, 20 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=263, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5\" target=\"_blank\">CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool - Packaging Strategies","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vd3d3LnBhY2thZ2luZ3N0cmF0ZWdpZXMuY29tL2FydGljbGVzLzEwNDEyNS1jZWZsZXgtdGVhbXMtdXAtd2l0aC1yZWN5ZGEtdG8tZmFjaWxpdGF0ZS1zdXN0YWluYWJsZS1kZXNpZ24tY2hlY2stdG9vbNIBAA?oc=5\" target=\"_blank\">CEFLEX Teams up with Recyda to Facilitate Sustainable Design Check Tool<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Strategies<\/font>","source.href":"https:\/\/www.packagingstrategies.com","source.title":"Packaging Strategies","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Thousands of organizations in Europe and worldwide have embraced the CEFLEX ‘Designing for a Circular Economy’ (D4ACE) guidelines since they were launched in 2020. Their objective is to ensure all flexible packaging is optimized for collection, sorting and recycling – and producing higher quality recycled materials to be used again in the circular economy. To help facilitate their use, CEFLEX has teamed up with recyclability experts Recyda to deliver design-check.ceflex.eu. This free service has been extensively beta-tested by CEFLEX stakeholders and is now being made available for anyone wanting to make a quick and effective assessment on their design journey. The ‘Design Check’ tool was developed in response to users of the guidelines who requested a way to check if a packaging design or specification adheres to them when assessing their packaging portfolios and developing new products with partners, suppliers and customers. “The tool can be used either to assess an existing package, facilitate the R&D and design process, engage with other parts of the value chain, or prepare for recyclability testing,” explained CEFLEX design lead Liz Morrish. “A team of CEFLEX stakeholders developed and tested the tool – including confidentiality and data protection elements – and many stakeholder companies have already used it successfully.” “Assessment covers all parts of the guidelines, including their sortability and recyclability principles. It indicates if a specification or design is compatible, has limited compatibility or is not compatible in terms of the D4ACE categories. Users are also able to undertake assessments for multiple specifications or designs,” Morrish added. “The Design Check tool makes our guidelines easier to use, providing a record to track improvements over time and helping the value chain continue to accelerate progress on circular design,” noted Graham Houlder, CEFLEX project coordinator. “It specifically responds to the particular needs of our stakeholders and wider flexible packaging market.” The check against D4ACE guidelines assesses whether a specification or design is Compatible – Limited compatibility – Not compatible for polyethene (PE), Polypropylene (PP) or mixed polyolefin (PO) mechanical recycling processes. By entering information about the materials and elements used in a flexible packaging structure – such as the polymer type, amount of ink and adhesives, and barrier layers – users can quickly establish whether the design adheres to the CEFLEX guidelines. The confidential online tool is applicable to: Flexible packaging structures and flexible films Packaging at R&D stage or on the market And can be used to check packaging designs or specifications:","filter_flag":1}
{"title":"The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion - Retail TouchPoints","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5","id":"CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA","guidislink":false,"published":"Tue, 19 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=262, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5\" target=\"_blank\">The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail TouchPoints<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion - Retail TouchPoints","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVmh0dHBzOi8vd3d3LnJldGFpbHRvdWNocG9pbnRzLmNvbS90b3BpY3Mvc3VwcGx5LWNoYWluLXNvdXJjaW5nL3RoZS1zdG9yZS1vZi1jb2FjaHRvcGlh0gEA?oc=5\" target=\"_blank\">The Story Behind Coachtopia, Coach’s New Vision for Circular Fashion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Retail TouchPoints<\/font>","source.href":"https:\/\/www.retailtouchpoints.com","source.title":"Retail TouchPoints","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"In the U.S. alone, up to 85% of all textiles end up in landfills every year, largely driven by inefficient and outdated practices during the product design and development stages. At the same time, global consumption of fashion has increased by 400%, while overall usage of products has dropped by about 40%. These are all realities that Coach has had to face head on as one of the top fashion and leather goods brands in the world. The brand has worked for many years to improve the sustainability of its operations and mitigate its environmental impact across the value chain. While these efforts, including the Coach Re(Loved) repair and refurbishment initiatives, have been critical, they weren’t sufficient, explained Joon Silverstein, SVP of Global Marketing, Creative and Sustainability at Coach and Head of Coachtopia during the Retail Influencer CEO Forum in New York City. Through the creation of Coachtopia, a new brand that operates separately from the core Coach business, the brand is tapping into its rich legacy while embracing a start-up mentality to completely rethink the way fashion items are designed, crafted and recycled. “Fundamentally, we needed to address the core challenge of fashion, which is that it is a linear and unsustainable system,” Silverstein said. “We had to face that realization head on, that Coach is part of that linear, unsustainable system contributing to climate change. And therefore, the only way to truly transform our impact was to rethink the end-to-end system; to go outside the linear system and think about how to reimagine it in a circular way.” Although Coachtopia has only existed since April 2023, the brand has made a big splash and has helped Coach stand out as a pioneer in the circular fashion industry. And it also quickly is becoming a fan favorite among Gen Z consumers. With sights set on growth, Coachtopia is ensuring its approach to circularity is clear, impactful and scalable. The business currently operates as a separate sub-brand so it could operate as a startup and “think radically about rethinking the system and ways of working to pioneer circularity,” Silverstein said. But the goal ultimately is to apply and scale these learnings so Coach can be circular too. “As we develop learnings and scalable processes that will feed back into Coach and Coachtopia, we’ll move on to tackle additional problems,” Silverstein said. “The whole purpose is eventually to move Coach and the overall industry.” Creating a Brand that Gen Z Loves Aesthetically, Coachtopia is a brand designed for Gen Z. Colorful charm necklaces are reminiscent of summer camp art projects and the brand’s “Wavy Dinky” handbag comes in a range of out-there patterns — from cherries to mushrooms and checkerboard. But this “fun and cool” vibe isn’t the only draw for Gen Z, according to Silverstein. Coachtopia aims to create a “more hopeful vision” that relies on Gen Z’s active participation to grow and thrive. “The way we engage Gen Z is part of the brand’s success,” Silverstein said. “We always think about the ‘what’ and the ‘why,’ but the ‘how’ is equally important to us. And it’s powered by community. Since the earliest days, when Coachtopia was just a nugget in our brain before we even named it, we had engaged a growing group of Gen Z across all walks of life: Designers, climate activists, journalists, filmmakers, entrepreneurs, fashion enthusiasts, people who care. And we’ve been pressure testing and involving them and co-creating with them at every step.” Coachtopia partnered with JUV Consulting, a Gen Z consulting agency, to better engage and resonate with Gen Z communities. The brand taps these community insights to garner feedback and perspectives that will drive the future of the brand. This “holistic community” also has become a powerful platform for change. In fact, Coachtopia is investing in talent by creating circular design scholarships like the Coachtopia Catalyst Fund, which was designed to support emerging sustainability non-profits led by the Gen Z community. Developing Consistent, Scalable Processes for Circular Fashion Silverstein admitted that “circularity” has become an industry buzzword with inconsistent definitions, which means it could lose value and impact over time. That’s why the Coachtopia team focused on establishing a clear definition of circularity that would drive product development, marketing and any form of customer communication. “It was really important to us that we defined what we meant by circularity, so our customers knew exactly what it meant too,” she explained. Coachtopia established the Made Circular design principles to inform how the brand designs, crafts and reuses its products: Advertisement Principle 1: Craft with recycled, repurposed or renewable materials The creation of new virgin raw materials accounts for more than 38% of fashion’s greenhouse gas use, Silverstein shared. “We’re starting with the problems in our backyard, and we’re taking the waste we generate as a brand at Coach and using our creativity to reconsider that waste as a valuable raw material in new products.” As a leather brand, Coactopia is prioritizing leather waste by taking all the extra scraps from new bag creation and using these small, sometimes uneven scraps of material for new product creation. ","filter_flag":1}
{"title":"Cisco Unveils Next-Generation Environmental Sustainability Strategy - CXOToday.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5","id":"CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA","guidislink":false,"published":"Fri, 22 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=22, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=265, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5\" target=\"_blank\">Cisco Unveils Next-Generation Environmental Sustainability Strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cisco Unveils Next-Generation Environmental Sustainability Strategy - CXOToday.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZ2h0dHBzOi8vY3hvdG9kYXkuY29tL3ByZXNzLXJlbGVhc2UvY2lzY28tdW52ZWlscy1uZXh0LWdlbmVyYXRpb24tZW52aXJvbm1lbnRhbC1zdXN0YWluYWJpbGl0eS1zdHJhdGVneS_SAQA?oc=5\" target=\"_blank\">Cisco Unveils Next-Generation Environmental Sustainability Strategy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CXOToday.com<\/font>","source.href":"https:\/\/cxotoday.com","source.title":"CXOToday.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Cisco is changing how it operates its business, engages with suppliers, and helps customers and communities. The strategy focuses on the transition to clean energy, evolving the business to circular, and investing in resilient ecosystems. Cisco is already making strides with technology solutions that enable energy efficiency and circular economy. Cisco, a global leader in technology and networking solutions, has announced the launch of “The Plan for Possible,” an ambitious and comprehensive environmental sustainability strategy that aims to build a regenerative future. This year is on track to being the hottest year on record. There is a critical need to limit the temperature rise to no more than 1.5C to avoid catastrophic changes to the climate, and we are currently at 1.1C. The world needs a sustainable future: one in which we can phase out our reliance on fossil fuels, address a century’s worth of pollution, provide economic opportunity to communities around the world, and align our activities with the physical boundaries of our Earth. The progress we make in this decade will be critical for future generations. Acknowledging these pressing issues, Cisco is going beyond the “doing no harm” approach and building a holistic strategy to environmental sustainability. The “plan for possible” includes how the company operates its business, how it engages with suppliers, and how it helps customers and communities reduce their environmental impacts and adapt to a changing world “The world is connected, but we’re suffering from new forms of disconnection: from each other and our health, and from the health of the planet. Fortunately, technology can help us rethink operating and business models in ways that are digital and low carbon, but also improve individual wellbeing and create opportunities for communities” said Mary de Wysocki, Chief Sustainability Officer at Cisco. “With Cisco technology, we are helping power the world with affordable clean energy through digitizing smart grids and smart buildings, we are designing out waste by re-building products from used ones, and we are using the Internet of Things (IoT) to protect the world’s biodiversity.” Priority 1: Transition to clean energy To power the world with renewables, the grid requires updated digital infrastructure to connect diverse, decentralized sources of clean energy. But even as the world electrifies, there is a need to simultaneously reduce the amount of energy used by a connected economy. As a part of this priority, Cisco has set a goal to reach Net Zero across its value chain by 2040, which includes both its suppliers and our customers’ use of energy. The company is tackling this with leading energy efficiency innovation, connecting clean energy and digitizing the grid​ and collaborating with customers, partners, and suppliers to accelerate the energy transition. With connectivity at the heart of digitalization, Cisco is in a unique position to equip businesses with technology solutions that help them achieve their sustainability goals. This includes the Silicon One chip, Cisco’s networking device for AI processing which reduces energy consumption while increasing bandwidth, and Universal Power Over Ethernet (PoE) to optimize energy use for smart buildings. Cisco also is helping its supply chain set GHG reduction targets. * Priority 2: Evolve the business to circular Cisco aims to transform its business to extend the useful life of its products and provide ongoing services. It aims to do so by adopting and scaling its business models to extend the product value and reduce environmental impacts​, investing in technology incubation to be at pace with environmental science​ and championing a digital, nature-positive value chain. The company is on track to achieving its goal of incorporating circular design principles into 100 percent of new products and packaging by 2025. Also, it launched several programs that enable circularity in its value chain: The Cisco Takeback and Reuse Program, which lets customers return hardware that has reached end-of-use, at no cost. Green Pay, a circular IT payment solution, that eliminates upfront hardware acquisition costs, offers predictable payments for 5 years, and an incentive of 5 percent. As part of this program, Cisco recovers products free of charge so these can be reused or recycled. Remanufacturing devices through Cisco Refresh to give them a new life for our business and planet. Priority 3: Invest in resilient ecosystems Recognizing the importance of resilient ecosystems and investing in regenerative solutions, Cisco sets its third priority on enabling communities to adapt to climate realities, cultivating talent for the regenerative economy, and deploying technology to protect and restore ecosystems. In 2021, Cisco Foundation committed $100 million investment over ten years in climate solutions that already draw down the carbon in the atmosphere and help regenerate depleted ecosystems. All of Cisco’s strategic priorities are underpinned by strong governance, embedding sustainability into its operations with the intent to maintain alignment with scientific advancements. “Sustainability is a top priority for the government, with India pledging a climate pact to become net zero by 2070. As a trusted technology partner to businesses across the country, we are committed to innovate with our customers’ sustainability goals in mind, and help businesses make choices with an eye towards a more sustainable digital future,” said Daisy Chittilapilly, President, Cisco India & SAARC. * Cisco has the goal that 80% of Cisco component, manufacturing, and logistics suppliers by spend have a public, absolute GHG emissions reduction target by FY25. We are at 78% as of FY22.","filter_flag":1}
{"title":"Cultivating circular design through biodiversity - FoodManufacture.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMDUvQ3VsdGl2YXRpbmctY2lyY3VsYXItZGVzaWduLXRocm91Z2gtYmlvZGl2ZXJzaXR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMDUvQ3VsdGl2YXRpbmctY2lyY3VsYXItZGVzaWduLXRocm91Z2gtYmlvZGl2ZXJzaXR50gEA?oc=5","id":"CBMiZWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMDUvQ3VsdGl2YXRpbmctY2lyY3VsYXItZGVzaWduLXRocm91Z2gtYmlvZGl2ZXJzaXR50gEA","guidislink":false,"published":"Tue, 05 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=5, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=248, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMDUvQ3VsdGl2YXRpbmctY2lyY3VsYXItZGVzaWduLXRocm91Z2gtYmlvZGl2ZXJzaXR50gEA?oc=5\" target=\"_blank\">Cultivating circular design through biodiversity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cultivating circular design through biodiversity - FoodManufacture.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vd3d3LmZvb2RtYW51ZmFjdHVyZS5jby51ay9BcnRpY2xlLzIwMjMvMDkvMDUvQ3VsdGl2YXRpbmctY2lyY3VsYXItZGVzaWduLXRocm91Z2gtYmlvZGl2ZXJzaXR50gEA?oc=5\" target=\"_blank\">Cultivating circular design through biodiversity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodManufacture.co.uk<\/font>","source.href":"https:\/\/www.foodmanufacture.co.uk","source.title":"FoodManufacture.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"When I see pictures of Jean-Emmanuel and Sabine’s vineyard in Moissac, France, it isn’t just the usual display of neatly lined identical grape trellises. Jean-Emmanuel and Sabine’s vineyard in Moissac, France Between each row, they have planted linseed and native wildflowers to attract natural predators for the pests that would otherwise eat the neighbouring grapes. Planting in this way – often called intercropping – not only negates the need for pesticides but supports surrounding biodiversity and promotes pollination. Farming in a more nature-positive way which supports the wider ecosystem can also be applied in the way they approach harvesting. Grapes are picked at full maturity and varieties are selected for flavour, not typically for yield. Amazonian growing techniques On the other side of the world, deep in the Amazon rainforest, the Yanomami people use agroforestry knowledge and traditional methods passed down through generations to prepare land in a way which cultivates the growth of unique mixed mushrooms, popular with world famous chefs. For both this grape-growing couple in the south of France and this indigenous South American tribe, nature-friendly farming methods offer multiple environmental and economic benefits. Globally, our current linear food system is the main cause of biodiversity loss and a significant contributor to climate change, accounting for a third of greenhouse gas emissions and the erosion of fertile soil. With no soil and no nature there will be no business. If we are going to continue to feed everyone on our planet, we have to keep the natural environment healthy. But stories, like the two I’ve highlighted, offer seeds of hope. To protect biodiversity and cut greenhouse gas emissions, action needs to happen in fields, fisheries, and forests across the world. Creating a circular economy By transforming the way that products are made and used, food businesses and retailers can play a crucial role in creating a circular economy for food. Empowering farmers to change the way they manage their land – ensuring regenerative farming techniques continue to grow and thrive for the benefit of us all – requires everyone to be involved; from food designers and new product developers to buyers and retailers. Both growers and brands are key to transforming the global food system from one that depletes biodiversity, pollutes the surrounding land, air, and water, and generates emissions to one which helps nature thrive and delivers benefits to farmers, businesses, and society. One way we can embrace a circular economy for food is to create more diversity in our food system. Currently, just four crops – corn, rice, potatoes, and wheat – form 60% of the world’s calories. A circular economy for food not only combines a more diverse range of crops and varieties but is also based on using upcycled ingredients which reduce crop and product level waste; lower impact ingredients which put less strain on ecosystems, and which actively bring soil back to life, and seeking out ingredients which have been regeneratively produced. Working together When food manufacturers and farmers work together to design, produce, and sell products that allow nature to thrive, significant climate and biodiversity benefits can be generated. Jean-Emmanuel and Sabine sell their grapes to Natoora, a food wholesaler that began life supplying restaurants and now produces its own products and supplies to retailers including Waitrose. Meanwhile, the Yanomami sell to Brazilian food business Māe Terra, a partnership arranged by Origens Brasil – a group dedicated to finding markets for the produce created by indigenous communities who are the guardians of more than 80% of the world’s biodiversity. For businesses, learning from these innovative growing methods and techniques presents an exciting opportunity to change the future of food. The Big Food Redesign Challenge​ ​also offers a way to start. Throwing down the gauntlet Our challenge invites producers, retailers, start-ups and suppliers to design innovative food products that embrace circular design principles. This gives food businesses an exciting opportunity to discover and develop food products which can be part of the solution, not the problem. Some progressive food brands have already started to explore the possibilities with 150 organisations already applying to take part in the challenge which will see successful products end up on supermarket shelves in places including Waitrose. Natoora is a good example of a food brand that is embracing aspects of circular design. As well as sourcing a whole range of regeneratively produced fruit and vegetables, the company pioneered the category of ‘winter tomatoes’ – black tomatoes that ripen when the weather turns colder. Trading in these diverse varieties not only ensures that they don’t die out and their growers’ livelihoods are protected, but also boosts local biodiversity in Almeria, Spain, where the tomatoes are grown. Redesigning how we produce food will nourish the earth we all depend on. But it requires action right from the field to the factory. The Big Food Redesign Challenge, launched by the Ellen MacArthur Foundation in partnership with the Sustainable Food Trust, offers a way to start making a circular economy for food a reality. Entries close on 18 September.","filter_flag":1}
{"title":"'Design Check' tool from CEFLEX to enable collaborative flexible packaging design - Packaging Europe","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL2Rlc2lnbi1jaGVjay10b29sLWZyb20tY2VmbGV4LXRvLWVuYWJsZS1jb2xsYWJvcmF0aXZlLWZsZXhpYmxlLXBhY2thZ2luZy1kZXNpZ24vMTAzMzcuYXJ0aWNsZdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL2Rlc2lnbi1jaGVjay10b29sLWZyb20tY2VmbGV4LXRvLWVuYWJsZS1jb2xsYWJvcmF0aXZlLWZsZXhpYmxlLXBhY2thZ2luZy1kZXNpZ24vMTAzMzcuYXJ0aWNsZdIBAA?oc=5","id":"CBMifmh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL2Rlc2lnbi1jaGVjay10b29sLWZyb20tY2VmbGV4LXRvLWVuYWJsZS1jb2xsYWJvcmF0aXZlLWZsZXhpYmxlLXBhY2thZ2luZy1kZXNpZ24vMTAzMzcuYXJ0aWNsZdIBAA","guidislink":false,"published":"Tue, 19 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=262, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL2Rlc2lnbi1jaGVjay10b29sLWZyb20tY2VmbGV4LXRvLWVuYWJsZS1jb2xsYWJvcmF0aXZlLWZsZXhpYmxlLXBhY2thZ2luZy1kZXNpZ24vMTAzMzcuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">'Design Check' tool from CEFLEX to enable collaborative flexible packaging design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"'Design Check' tool from CEFLEX to enable collaborative flexible packaging design - Packaging Europe","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vcGFja2FnaW5nZXVyb3BlLmNvbS9uZXdzL2Rlc2lnbi1jaGVjay10b29sLWZyb20tY2VmbGV4LXRvLWVuYWJsZS1jb2xsYWJvcmF0aXZlLWZsZXhpYmxlLXBhY2thZ2luZy1kZXNpZ24vMTAzMzcuYXJ0aWNsZdIBAA?oc=5\" target=\"_blank\">'Design Check' tool from CEFLEX to enable collaborative flexible packaging design<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Packaging Europe<\/font>","source.href":"https:\/\/packagingeurope.com","source.title":"Packaging Europe","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"CEFLEX and Recyda have developed a new ‘Design Check’ tool to streamline collaboration between designers, technologists, customers, and suppliers of flexible packaging and drive the creation of sustainability-minded packaging. CEFLEX’s ‘Designing for a Circular Economy’ (D4ACE) guidelines were launched in 2020, aiming to help companies optimise all flexible packaging for collection, sorting, and recycling and produce high quality recyclate. Now design-check.ceflex.eu has been created as a free service to assess packaging portfolios and develop new products alongside partners, suppliers, and customers. It enables users to check whether a design or specification is suitable to their individual needs. Tested and developed by a team of CEFLEX stakeholders, the tool is based on current D4ACE guidelines that cover mixed PO and mono-material PE and PP structures in a mechanical recycling process. Various stakeholders are said to have used it successfully. Revisions will be made around updated based on an extensive testing programme and new materials entering the scope of Designing for a Circular Economy – for example, flexible packaging containing aluminium foil. “The tool can be used either to assess an existing package, facilitate the R&D and design process, engage with other parts of the value chain, or prepare for recyclability testing,” said CEFLEX design lead Liz Morrish. “Assessment covers all parts of the guidelines, including their sortability and recyclability principles. “It indicates if a specification or design is compatible, has limited compatibility or is not compatible in terms of the D4ACE categories. Users are also able to undertake assessments for multiple specifications or designs.” Graham Houlder, CEFLEX project coordinator, added: “The Design Check tool makes our guidelines easier to use, providing a record to track improvements over time and helping the value chain continue to accelerate progress on circular design. It specifically responds to the particular needs of our stakeholders and wider flexible packaging market. “The tool could also play a key role in implementation of an expected EU Packaging and Packaging Waste Regulation (PPWR) conformity assessment procedure. This will require producers and importers of packaged goods to gather relevant technical information and declare that the packaging they place on the market meets legal design requirements.” Recyda previously received €1.75 million in funding to expand on its all-in-one software solution for the management and sustainability evaluation of companies’ packaging portfolios. In other news, the Confederation of Paper Industries (CPI) has developed Papercycle, an online recyclability assessment and certification tool for fibre-based packaging materials and products seeking to help producers gauge the recyclability of their packaging in line with upcoming legislation. Meanwhile, the 4evergreen alliance has released the beta version of its Fibre-Based Packaging Recyclability Evaluation protocol. The tool hopes to create an improved and standardised framework for evaluating the recyclability of packaging products in Europe. If you liked this article, you might also enjoy: The Lidl approach to packaging sustainability How did Brazil achieve its 100% aluminium can recycling rate – and can it be replicated in the EU? Experts have their say on the EU’s Packaging and Packaging Waste Directive revisions A deep dive into the most important packaging sustainability trends and solutions","filter_flag":1}
{"title":"Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact - Footwear News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5","id":"CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5\" target=\"_blank\">Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footwear News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact - Footwear News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vZm9vdHdlYXJuZXdzLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Zpdm9iYXJlZm9vdC1zdXN0YWluYWJpbGl0eS1jaXJjLWRlYWwtbGNhLTEyMDM1MDgwODkv0gFpaHR0cHM6Ly9mb290d2Vhcm5ld3MuY29tL2J1c2luZXNzL2J1c2luZXNzLW5ld3Mvdml2b2JhcmVmb290LXN1c3RhaW5hYmlsaXR5LWNpcmMtZGVhbC1sY2EtMTIwMzUwODA4OS9hbXAv?oc=5\" target=\"_blank\">Vivobarefoot Is Serious About Circularity and Scoring Its Environmental Impact<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Footwear News<\/font>","source.href":"https:\/\/footwearnews.com","source.title":"Footwear News","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Vivobarefoot was one of the first companies to use Bloom bio-based foam in its footwear continues to push for a more sustainable shoemaking process. This week, the U.K.-based footwear brand announced a new partnership with textile-to-textile recycling company Circ to kickstart cross-industry collaboration in order to develop more circular design solutions. The two B Corp companies said they will work together to design and develop footwear uppers made entirely of a single material (polyester) that can be chemically recycled and reused in the production of new footwear without the need to add any virgin materials. Their end goal is to achieve a shoe that is truly “recyclable.” Their joint creation — already dubbed the Vivobarefoot Primus Circular — is slated to launch in fall 2024. Related Will the New York Fashion Act 'Get Over the Finish Line'? Adidas CEO Hints Brand May Cease Using K-Leather 'Faster Than You Think' Crocs Expands Its Pre-Loved Shoe Takeback Program After 'Encouraging' Pilot Project “Our north star goal at Vivobarefoot is to develop performance footwear that is both durable and fully recyclable — and for us that means being able to use our recycled materials to make new footwear, rather than downcycling them,” said Charlotte Pumford, Vivobarefoot’s head of regeneration. Watch on FN The companies noted that the current method used by many brands to recycle footwear involves a mechanical process of shredding and grinding the materials for reuse. But those materials are often turned into new products that cannot be recycled in the future, eventually ending up in a landfill. By contrast, Circ says its process reduces cotton and polyester textiles to their fundamental molecules, which can be rebuilt into high-quality lyocell and polyester multiple times, and which are competitive with virgin materials. Up to this point, Circ has focused primarily on apparel textiles, but is embracing a new challenge in footwear. “Shoes are a complicated and challenging problem for recyclers that, to solve, necessitates incorporating circularity into the design from the start. Transforming shoes will take time and effort,” said Circ chief business officer Luke Henning. “When we met the team at Vivobarefoot, we immediately knew we had found a like-minded and committed team who lived sustainability and circularity. Their passion for the planet mirrors ours, making them a natural fit.” Galahad Clark, co-founder of Vivobarefoot, has been in the sustainability game for roughly 20 years, going back to the early aughts, when he started another eco-minded footwear brand, Terra Plana. At Vivobarefoot, which launched in 2012, he has taken a holistic view of responsible shoemaking, grounding the brand in the principles of natural, barefoot movement and making minimalist footwear with better materials and processes. “The definition [of sustainability] we really like is from a guy called John Ehrenfeld, who said it is about all life on Earth being able to flourish,” Clark told FN last month during a visit to the States. “Products should help us connect more with nature and or they should help us feel more human, improve human health and ask important environmental and ethical questions.” But he said at least two of those goals — connecting with nature and improving health — are ignored in most studies of environmental impact. Which is why Vivobarefoot created its own lifecycle analysis (LCA) blueprint to more fully understand and communicate its impact. Its V-Matrix scoring system was developed with its impact analysis partner, Made2Flow, and goes beyond many of the typical LCAs by also examining a product’s durability, complexity and repairability. It draws from primary and secondary data, as well as its own performance indicators, to assign each shoe an overall sustainability score (the higher the score, the less harmful the product). The Primus Lite III will be the first Vivobarefoot shoe to be scored by the V-Matrix and will be followed by the Primus Trail, Primus Lite Knit, Tracker II and Tracker Forest through the end of this year. Vivobarefoot Primus Lite III When it comes to understanding environmental impact, Clark compared it to the rigorous transparency in the financial markets. “The world has fought long and hard to create accounting standards, so you can compare different companies and financial performances,” he said. “When it comes to impact reporting, everybody’s really just marking their own homework and grading it as they see fit. In a perfect world, we’d be able to do all of our reporting by an agreed method, so our apples look like other people’s apples. But we’re comparing apples with oranges and grapes and who knows what else.” He noted that since starting to work with Made2Flow, Vivobarefoot has already uncovered surprising results. For instance, he said they discovered that many of the no-sew technologies used to construct shoes are even worse for the environment than expected. As for what it will take for manufacturers to align under one model, he predicted that government action will be needed, starting with the European Union’s proposed new legislation. Those regulations are set to start in 2025, though details are still limited, said Clark. “Companies right now are having to take a guess which aspects of which [environmental] frameworks they think [the EU] is going to actually enforce. So the good companies are saying — which everyone should really do anyway — let’s basically use them all.”","filter_flag":1}
{"title":"The Nike ISPA Mindbody is Arriving Soon With Barely Volt Accents - Sole Retriever","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnNvbGVyZXRyaWV2ZXIuY29tL25ld3MvYXJ0aWNsZXMvbmlrZS1pc3BhLW1pbmRib2R5LWJsYWNrLWJhcmVseS12b2x0LXdoaXRlLXJlbGVhc2UtZGF0ZS0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnNvbGVyZXRyaWV2ZXIuY29tL25ld3MvYXJ0aWNsZXMvbmlrZS1pc3BhLW1pbmRib2R5LWJsYWNrLWJhcmVseS12b2x0LXdoaXRlLXJlbGVhc2UtZGF0ZS0yMDIz0gEA?oc=5","id":"CBMiaGh0dHBzOi8vd3d3LnNvbGVyZXRyaWV2ZXIuY29tL25ld3MvYXJ0aWNsZXMvbmlrZS1pc3BhLW1pbmRib2R5LWJsYWNrLWJhcmVseS12b2x0LXdoaXRlLXJlbGVhc2UtZGF0ZS0yMDIz0gEA","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnNvbGVyZXRyaWV2ZXIuY29tL25ld3MvYXJ0aWNsZXMvbmlrZS1pc3BhLW1pbmRib2R5LWJsYWNrLWJhcmVseS12b2x0LXdoaXRlLXJlbGVhc2UtZGF0ZS0yMDIz0gEA?oc=5\" target=\"_blank\">The Nike ISPA Mindbody is Arriving Soon With Barely Volt Accents<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sole Retriever<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Nike ISPA Mindbody is Arriving Soon With Barely Volt Accents - Sole Retriever","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaGh0dHBzOi8vd3d3LnNvbGVyZXRyaWV2ZXIuY29tL25ld3MvYXJ0aWNsZXMvbmlrZS1pc3BhLW1pbmRib2R5LWJsYWNrLWJhcmVseS12b2x0LXdoaXRlLXJlbGVhc2UtZGF0ZS0yMDIz0gEA?oc=5\" target=\"_blank\">The Nike ISPA Mindbody is Arriving Soon With Barely Volt Accents<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sole Retriever<\/font>","source.href":"https:\/\/www.soleretriever.com","source.title":"Sole Retriever","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Updated at September 13, 2023 Nike ISPA Mindbody Black Barely Volt White The end is just the beginning for the ISPA Mindbody line Nike has available, taking scraps and discarded materials to create new products with less carbon footprint. This coincides with Nike's circular design philosophy; a vital feature of this concept is designing with product end-of-life in mind. At first glance, the Nike ISPA Mindbody Black Barely Volt White looks like another panda entry for this year. But just like its predecessors, the Koi Fish as well as Barely Volt, if you take a closer look, you notice that the pattern is a very intricate black and white. A single barely volt-colored Flywire cord system zigzags above the Flyknit upper, connecting to the midsole, tightly securing the upper. Plastic heel and toe counters provide stability, while the outsole is super soft foam, and the translucent rubber pods add grip for comfort. The Nike ISPA Mindbody Black Barely Volt White will release Holiday 2023, at Nike, the SNKRS app, and select retailers in-store and online. Coming in men’s sizing, retail is set at $180. Keep it locked to our Twitter and the Sole Retriever mobile app to stay updated on the latest releases, raffles, news, and more in the sneaker and streetwear world. Color: Black\/Barely Volt-White-Wolf Grey Style Code: DH7546-002 Release Date: Holiday 2023 Price: $180 Images via Nike [@portabletext\/react] Unknown block type \"productEmbed.block\", specify a component for it in the `components.types` prop","filter_flag":1}
{"title":"This New Upholstery Line Features Yarn Made From Marine Plastic - Metropolis Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vcHJvZHVjdHMvbWF5ZXItZmFicmljcy1jYXNwaWFuLW1pcmEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vcHJvZHVjdHMvbWF5ZXItZmFicmljcy1jYXNwaWFuLW1pcmEv0gEA?oc=5","id":"CBMiPmh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vcHJvZHVjdHMvbWF5ZXItZmFicmljcy1jYXNwaWFuLW1pcmEv0gEA","guidislink":false,"published":"Thu, 07 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=250, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vcHJvZHVjdHMvbWF5ZXItZmFicmljcy1jYXNwaWFuLW1pcmEv0gEA?oc=5\" target=\"_blank\">This New Upholstery Line Features Yarn Made From Marine Plastic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Metropolis Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"This New Upholstery Line Features Yarn Made From Marine Plastic - Metropolis Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPmh0dHBzOi8vbWV0cm9wb2xpc21hZy5jb20vcHJvZHVjdHMvbWF5ZXItZmFicmljcy1jYXNwaWFuLW1pcmEv0gEA?oc=5\" target=\"_blank\">This New Upholstery Line Features Yarn Made From Marine Plastic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Metropolis Magazine<\/font>","source.href":"https:\/\/metropolismag.com","source.title":"Metropolis Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Circular Design\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"Mayer Fabrics’ newest line of upholstery signals an impressive leap forward: a single collection marked by a slew of manufacturing advancements the company has adopted in its 13-year journey away from traditional mill relationships and toward radical reductions in its virgin polyester feedstock, VOCs, and operational carbon. Caspian and Mira, the first styles rolled out under the new SEAQUAL Initiative collection, are also noteworthy for the following features: 01 RECYCLED CONTENT Recycling is a theme within Mayer Fabrics: The latest wovens feature a warp made of recycled marine polyester (24 percent in Caspian, 35 percent in Mira); 100 percent of shipping pallets are either reused or converted to fuel and livestock bedding; and 63 tons of cardboard from packaging have been recycled since 2010. 02 SEAQUAL YARN Sourcing SEAQUAL YARN for the recycled content makes Mayer a responsible user of plastic marine litter, a process that helps clean waterways and reduces its reliance on petroleum-based virgin polyester. 03 GREENGUARD GOLD This level of the indoor air quality certification means that the fabric exceeds industry standards for low VOC emissions. 04 PFAS-FREE The new fabrics are also free of polyfluoroalkyl substances known as PFAS—thousands of chemicals traditionally added to performance textiles to repel water and oil, but which the Centers for Disease Control and Prevention say are so resilient they’re found in the blood of 98 percent of Americans. 05 CARBON NEUTRAL In 2011, Mayer was officially certified as CarbonNeutral by Climate Impact Partners, a group that funds carbon removal and carbon-avoidance projects. 06 ZERO FLAME RETARDANTS The manufacturer has eliminated the toxic compounds normally used to make fabrics fire-resistant, and known to contaminate wastewater. 07 HEAT-RECOVERED WASTE Mayer Fabrics has directed roughly 23 tons of heat-recovered waste to a Subtitle D landfill (the classification for nonhazardous solid waste), which captures gas from the waste so it can be dispersed and used again, turning waste into energy.","filter_flag":1}
