{"title":"Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse - Hart Energy","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA","guidislink":false,"published":"Fri, 14 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=195, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5\" target=\"_blank\">Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hart Energy<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse - Hart Energy","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmhhcnRlbmVyZ3kuY29tL2V4Y2x1c2l2ZXMvaGFydC1lbmVyZ3lzLTIwMjMtZXNnLWF3YXJkcy1jbGVhbmVyLXNhZmVyLW1vcmUtZGl2ZXJzZS0yMDU3NznSAQA?oc=5\" target=\"_blank\">Hart Energy's 2023 ESG Awards: Cleaner, Safer, More Diverse<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Hart Energy<\/font>","source.href":"https:\/\/www.hartenergy.com","source.title":"Hart Energy","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"ESG matters remain a critical–and sometimes, controversial–touchstone for companies across the supply chain as the energy transition cycle transforms the industry. Hart Energy’s annual ESG Awards highlight the findings of data analysis firm Clear Rating in its effort to categorize and quantify individual business efforts to improve ESG performance. Houston-based Clear Rating specializes in private company valuations, digital securities ratings, and ESG impact assessments. These awards recognize advancements made in sustainable operation, local community engagement and positive workplace culture. The firm made special recognition of individuals in an “ESG Champion” listing on a case-by-case basis. Clear Rating analyzed dozens of nominations and applied a weighted methodology to score nominated companies. In this assessment, more easily quantifiable environmental improvements were weighted the heaviest. The ratings still placed critical scoring metrics on social advancement, including community support and workforce sentiment, and on governance matters, such as board diversity. The final weighted score represents an average of the three ratings. Public Producer Pioneer Natural Resources Final Score: 90 Pioneer Natural Resources’ CEO Scott Sheffield was one of the highest profile executives to call on the industry to reduce flaring in its operations. Calling it a “black eye” as much as five years ago, Sheffield has continued calls on industry colleagues to improve environmental standards. Pioneer, a Permian Basin pure play, prioritizes emissions reductions, freshwater use and diminishing its physical footprint on the land. (Source: Hart Energy) Pioneer, a Permian Basin pure play, prioritizes emissions reductions, freshwater use and diminishing its physical footprint on the land. E – Pioneer committed to reduce methane emissions through facility design, operations and leak-management protocols. Flaring is less than 2% of Pioneer’s produced natural gas, one of the lowest rates in the Permian, and the company has eliminated routine flaring. Category Score: 90 S – The firm strives to protect the environment from damage, as well as the lives of its employees and community members who live near its operations from injury and health risks. Category Score: 90 G – The board of directors is 23% racially diverse and 31% of its membership is female. Pioneer’s board was among the first U.S. producers to report annually on sustainability and climate risk, which is now common among public operators around the world. The board also realigned its executive compensation calculations with ESG performance measurements. Category Score: 90 Talos Energy Final Score: 88.75 One of the leading independent operators in the Gulf of Mexico, Talos Energy strives to create and maintain a culture of ESG awareness with initiatives that foster corporate responsibility in daily operations. The Bayou Bend CCS project was the first offshore lease in the U.S. dedicated to CO₂ sequestration. (Source: Talos Energy Inc.) E – Talos demonstrated commitment to protecting the diverse ocean and coastal environments in which it operates. Through its safety and environmental management system, Talos actively monitors its operations to minimize impacts and ensure full compliance with applicable industry standards and regulations. Current environmental initiatives include a 30% reduction in greenhouse gas emissions (GHG) emissions intensity by 2025 from baseline 2018 levels. Category Score: 90 S – Talos was named one of Houston Chronicle’s Top Workplaces in Houston for eight consecutive years. In June 2021, the company raised approximately $70,000 through employee and company matching contributions to a local Houston children’s charity, Kid’s Meals. Category Score: 85 G – The company has increased female representation on its board of directors to 30%. It has also increased its ESG-related performance metrics to account for 20% of management’s annual incentive plan. Category Score: 85 Private Producer PureWest Energy Final Score: 90.25 PureWest, a natural gas producer in the Rockies, incorporates its ESG principles into daily operations through voluntary initiatives to self-monitor and decrease GHG emissions in support of community volunteering programs. The company, which recently was acquired by a private investor group largely led by family offices, has cultivated a positive, productive and inclusive work environment and was honored with a Denver Business Journal “Best Place to Work” award in the 2023 Large Company category. PureWest is implementing new technology to help replace energy-intensive operations, including solar heat trace pumps and well automation, which allows the company to remove pneumatic devices—eliminating those operational emissions as well as the potential for fugitives. (Source: PureWest) E – PureWest worked closely with Project Canary and TrustWell to certify all of its wells as “Responsibly Sourced” by year-end 2022. A rigorous internal auditing program was established to evaluate leak detection and repair (LDAR) findings and conduct facility evaluations. PureWest voluntarily removed thousands of pneumatic pumps to replace them with solar-powered devices, and removed all of its high-bleed pneumatic devices. The company also deployed stationary methane detection monitors at select sites. Category Score: 90 S – PureWest’s charitable giving policy focuses on providing for basic human needs, such as food, shelter, healthcare and education. The company matches employee donations to more than 60 organizations. Category Score: 85 G – PureWest seeks to encourage healthy debate and embrace the diversity of its workforce. The company says it fosters a workplace that encourages and rewards initiative and provides authority to make decisions within areas of accountability. It empowers employees to adhere to the corporate commitment to operate responsibly and continuously improve the bottom line. Category Score: 95 Sentinel Peak Resources Final Score: 90 Sentinel Peak Resources is focused on the acquisition, development and exploration of oil and gas resources, primarily in California. The firm concentrates on operational excellence, serving as a steward of the environment and investing in its people and communities. Sentinel Peak Resources’ oil and gas operation in the McKittrick oil field is located among the foothills of Western Kern County, Calif. (Source: Sentinel Peak Resources) E – The company set a target of achieving carbon neutrality by 2030 through improved efficiencies, adoption of alternative energy sources and utilization of new technologies. Sentinel has improved its methane management with a five-tank vapor recovery system that reduced CO 2 emissions from crude oil storage tanks by 93%. In addition to GHG reduction, Sentinel minimized freshwater use, sourcing over 95% of its water from non-potable sources, including produced water from its own wells. Category Score: 90 S – Sentinel supports multiple community youth programs, such as mentorship programs in local high schools, and a program to support emancipated young people develop skills required to obtain field or administrative work. The company supports the Los Angeles community by converting some non-operating sites into affordable housing and other socioeconomic needs. Category Score: 90 G – Sentinel’s regulatory compliance has allowed it to succeed despite the headwinds oil and gas companies face in California. The company adopted the California Air Resources Board reporting standards for GHG emissions, an LDAR program, groundwater monitoring, oil spill prevention and other programs. Sentinel employs a third-party whistleblower reporting service, Lighthouse Service, to ensure a safe space for employees to report concerns, and it says it is committed to adopting cybersecurity protocols to ensure system and source integrity. Category Score: 90 Public Services Baker Hughes Final Score: 92 The oilfield services giant demonstrates ESG leadership in its goal setting, its sustainability performance and its investments in new products and services. As an energy technology company, Baker Hughes is committed to not only improving its own ESG performance, but also helping customers meet their ESG challenges and opportunities in support of the energy transition. Baker Hughes’ facility in Massa, Italy, is part of the company’s efforts to run more operations on renewable energies. (Source: Baker Hughes) E – In 2022, Baker Hughes reduced its Scope 1 and 2 CO 2 emissions by 28% from the 2019 baseline, with 10 Scope 3 emissions categories reported with limited assurance. The company recycled 57,666 metric tons of waste and sourced 26% of its electricity from zero-emissions sources. Category Score: 95 S – Baker Hughes pledged $2 million in strategic grants through the Baker Hughes Foundation in support of the UN Sustainable Development Goals in 2022. The company gave $925,000 to support diversity and inclusion programs, as well as education and opportunity initiatives. It donated $417,000 to support health, safety and wellness, and disaster relief. And it gave $650,000 to support environmental programs. Categoy Score: 80 G – Last year, 53,846 Baker Hughes employees had completed annual code of conduct training, including training on ethics, compliance and anti-corruption; 99% of the company’s governance body members had received anti-corruption training; and 100% of enterprise security personnel, including full-time and embedded contractors, were trained in human rights policies. Category Score: 85 ChampionX Final Score: 90 ChampionX is a global leader in upstream and midstream oilfield technology solutions, chemistry programs and services, drilling technology, artificial lift and automation technologies for the oil and gas industry. It defines its overarching corporate purpose as improving lives, and has built a sustainability culture from the ground up. ChampionX chemical solutions and services provide chemistry, technology, engineering support and onsite expertise to improve outcomes for upstream and midstream oil and gas operations. (Source: ChampionX) E – ChampionX says it embedded sustainability into its culture and promoted more sustainable operations internally. It launched an internal carbon footprint calculator, which enables employees to calculate the manufacturing carbon footprint associated with transporting products from facilities to customer assets. In many cases, the calculator has shown the positive impact the company’s products have on reducing customers’ carbon emissions in the field. Category Score: 90 S – ChampionX supports nine resource groups with the voluntary participation of over 1,000 employees. The goal is to create a workplace culture that cultivates a sense of belonging and allows for more purposeful alignment with the principles of the company. ChampionX also launched SEED (Sustainable Energy Empowers Development), a program that connects employees with opportunities to personally support environmental programs. Category Score: 90 G – In support of their goal of continuous improvement and to strengthen the inclusivity of the company, ChampionX established an enterprise-wide Diversity and Inclusion Council, chaired by ChampionX CEO Soma Somasundaram. The council is made up of senior leaders from a cross-section of the company’s business, including a rotating set of employee resource group leaders. Category Score: 90 Private Services Danos Final Score: 93.75 A family-owned oilfield service company, Danos views its commitment to ESG principles as fundamental to its success. The company is a founding member of the National Ocean Industries Association’s (NOIA) ESG network, which shares and develops best practices across the offshore energy industry. Danos works with partner Natrx in Louisiana’s marsh to offload Cajun Coral, a restoration model that uses digital tools to work with mother nature to protect coastlines. (Source: Danos) E – Danos works with wetland conservation groups, and is involved in projects building artificial reefs–nicknamed Cajun coral–using 3D printing that will help regrow coral beds, as well as protect against coastal erosion in Louisiana. Danos utilizes engine-calibration software to reduce its fleet’s fuel consumption and cut its CO 2 emissions by 1,178 total metric tons a year. Category Score: 95 S – The Danos Foundation has given over $1 million to 120 organizations and more than 350 employees in need since it launched in 2017. Danos partners with several technical and community colleges that offer degrees supporting the industry, and the company has a robust on-the-job training program. Category Score: 90 G – Danos’ fabrication facility is fully certified to the International Organization for Standardization's quality management system standards and conducts rotating internal process audits to ensure compliance. The company is a multiyear winner of the National Ocean Industries Association (NOIA) Culture of Safety award for establishing an institutional safety culture through behavior-based safety programs and innovation. Category Score: 90 Integrity BioChem Final Score: 93.25 Integrity BioChem manufactures biopolymer products. (Source: Integrity BioChem) Integrity Bio-Chemicals appointed its first director of sustainability in fall 2021 and touts breakthroughs in sustainability initiatives throughout the organization, committing itself to sustainable natural product solutions for the full product lifecycle. E – Integrity BioChem’s bio-based, 4x-concentrated surfactants reduce combustion engine footprint by 75%. Category Score: 95 S – A small company, Integrity BioChem boasts that, at its core, it is a technology company. The company strives for employee safety, reporting zero lost-time incidents in 2022. Category Score: 85 G – Integrity BioChem made an executive commitment to ESG with the creation of a new role, director of sustainability. Laura Kuri Benavides took on this charge to implement and document the company’s sustainability processes. She also provides guidance on emerging sustainability technologies. Category Score: 90 Public Midstream Archrock Final Score: 94.5 Houston-based Archrock’s mission is to “Power a Cleaner America.” The natural gas compression services provider’s 1,000-plus employees are spread across 21 states. (Source: Archrock) E – Archrock reduced its Scope 1 and 2 carbon intensity by 11% in 2021 compared to 2020 levels. Scope 3 emissions in 2021 were 37% below 2017 levels. In 2022, Archrock acquired a 25% equity position in Ecotec, a company that provides methane emissions monitoring, leak detection and environmental compliance. Archrock is working to connect Ecotec’s proven technology with its U.S. natural gas compression infrastructure and customer support network. Category Score: 95 S – The Archrock Cares organization supports volunteer activities with organizations, such as the Houston Food Bank. In 2022, Archrock added a diversity and inclusion metric to its short-term incentive program, increasing the company’s percentage of employees that self-identify as members of underrepresented groups. Category Score: 90 G – Archrock’s majority independent and annually elected board of directors drive a focus on long-term sustainability and governance standards throughout the organization. Of the annually elected Archrock board of directors, three of the seven independent board members are either female or ethnically diverse, including audit and governance committees led by female board members. In 2022, Archrock increased the weight of safety and sustainability within its short-term incentive plan to 20%. Category Score: 95 Crestwood Equity Partners Final Score: 93.25 Crestwood Equity Partners made significant strides on its second, three-year sustainability strategy, initiated in January 2022, including deliverables achieved through its comprehensive carbon management plan. Crestwood remains committed to seeking ways to enhance its emissions monitoring. (Source: Crestwood Equity Partners LP) E – While the company’s GHG emissions increased in 2022 due to the acquisitions of new gathering, compression and processing assets, Crestwood achieved a 5% reduction in its methane emissions intensity rate from 2021 levels and a 58% reduction since 2018. The company also made advancements on its continuous, methane-monitoring pilot and installed devices on 13% of its assets in 2022, enhancing its approach to methane detection. Category Score: 95 S – In 2022, Crestwood donated $1.5 million to the communities it operates in, and Crestwood employees volunteered over 2,800 hours. Category Score: 85 G – Crestwood continues to increase its female leadership representation and was included in the 2023 Bloomberg Gender-Equality Index for the third consecutive year. Crestwood continues to make significant progress in advancing its approach to corporate governance in alignment with best practices, enhancing disclosures in its annual proxy statement and maintaining a board composition of 89% independent directors, reflecting diverse perspectives and ensuring robust decision-making. Category Score: 90 Aris Water Solutions Final Score: 89.25 Aris Water Solutions, a leading developer and operator of critical water infrastructure assets in the Midland and Delaware basins, has committed to exceeding the high standards set by its customers, global regulators and the global investment community. This enables customers to exceed their own water, safety and community commitments and focus on their core businesses. Aris Water Solutions is a leading developer and operator of critical water infrastructure assets in the Midland and Delaware basins. (Source: Aris Water Solutions) E – Aris recycled 4.6 billion gallons of water in 2022 to offset groundwater withdrawals, reduce wastewater disposal and cut carbon emissions. Aris led the formation of the largest joint industry beneficial reuse project, working with three major operators to develop, pilot and demonstrate desalination and polishing treatment technologies that aim to facilitate safe beneficial reuse of treated water outside of the oil industry. Also, Aris was able to reduce fresh and groundwater consumption by up to 90% in certain instances. Category Score: 90 S – Aris supports local communities by giving to and volunteering with first responders and local charities. Category Score: 90 G – The company is committed to ensuring a diverse and inclusive culture, with over 50% minority and female representation, including at senior leadership and executive levels. Aris has an independent governance with a diverse board, including 33% gender and minority representation. Category Score: 85 Private Midstream XRI Holdings Final Score: 88.75 XRI was founded in 2013 on the tenets of conservation of water resources, environmental sustainability, employee health and safety and corporate stewardship. XRI’s mission is to provide the industry with an environmentally sustainable alternative to groundwater use for hydraulic fracturing operations. XRI has committed to a corporate culture and code of conduct ensuring the highest level of business ethics, including anti-bribery and corruption standards, stakeholder rights and social justice practices, as well as governance of sustainability initiatives. (Source: XRI Holdings) E – The independent water midstream company’s operations avoid the emitting of 225,000 metric tons of CO 2 per year, save over 400 MMbbl of freshwater aquifers per year and prevent reinjection of over 270 MMbbl of wastewater. Category Score: 90 S – XRI engages with the community it serves through volunteering and participating in economic development. Category Score: 85 G – XRI has committed to a corporate culture and code of conduct ensuring the highest level of business ethics, including anti-bribery and corruption standards, stakeholder rights and social justice practices, as well as governance of sustainability initiatives. Category Score: 85","filter_flag":1}
{"title":"Complete guide to Technology Readiness Level federal funding - Innovation News Network","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vY29tcGxldGUtZ3VpZGUtdG8tdGVjaG5vbG9neS1yZWFkaW5lc3MtbGV2ZWwtZmVkZXJhbC1mdW5kaW5nLzM1MTk2L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vY29tcGxldGUtZ3VpZGUtdG8tdGVjaG5vbG9neS1yZWFkaW5lc3MtbGV2ZWwtZmVkZXJhbC1mdW5kaW5nLzM1MTk2L9IBAA?oc=5","id":"CBMiaWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vY29tcGxldGUtZ3VpZGUtdG8tdGVjaG5vbG9neS1yZWFkaW5lc3MtbGV2ZWwtZmVkZXJhbC1mdW5kaW5nLzM1MTk2L9IBAA","guidislink":false,"published":"Fri, 21 Jul 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=202, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vY29tcGxldGUtZ3VpZGUtdG8tdGVjaG5vbG9neS1yZWFkaW5lc3MtbGV2ZWwtZmVkZXJhbC1mdW5kaW5nLzM1MTk2L9IBAA?oc=5\" target=\"_blank\">Complete guide to Technology Readiness Level federal funding<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation News Network<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Complete guide to Technology Readiness Level federal funding - Innovation News Network","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiaWh0dHBzOi8vd3d3Lmlubm92YXRpb25uZXdzbmV0d29yay5jb20vY29tcGxldGUtZ3VpZGUtdG8tdGVjaG5vbG9neS1yZWFkaW5lc3MtbGV2ZWwtZmVkZXJhbC1mdW5kaW5nLzM1MTk2L9IBAA?oc=5\" target=\"_blank\">Complete guide to Technology Readiness Level federal funding<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Innovation News Network<\/font>","source.href":"https:\/\/www.innovationnewsnetwork.com","source.title":"Innovation News Network","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"American Diversified Enterprises LLC’s Managing Director, CJ Evans, provides an in-depth look at federal funding opportunities for each Technology Readiness Level. The U.S. Federal government provides funding to advance innovations through thousands of grants, loans, loan guarantees, and cooperative agreements. There currently is more than $350bn in funding through grants and another $400bn in loan authority, which is available for virtually every Technology Readiness Level (TRL). This article lists each of the agencies and their offices, divisions, and departments that provide funding for each of the nine TRLs. Hyperlinks are provided so you can visit the agency websites that list their funding opportunities. A list of current and upcoming grant opportunities, as well as the standing grant and loan guarantee programs for eight federal agencies, which is updated periodically as new grant opportunities become available, can be found on American Diversified Energy’s website under its Find Funding tab. Federal funding opportunities for each TRL Preparation of application for TRL-1 funding: Describe the idea, concept, approach Explain the significance of your idea, concept, approach Identify societal, environmental, or economic needs that will be addressed Lay out the proposed research plan, objectives, methods, tasks, controls, and feasibility, risk, and solution measures Assemble research team Identify milestones and go\/no-go criteria Describe alternatives if the primary approach does not work out This will be your core proposal, which should be adjusted, amplified, and updated at the conclusion of each TRL. The first step: Basic Research Federal funding opportunities: National Science Foundation (NSF) The NSF provides financial support in a wide range of scientific areas, from astronomy to zoology. In addition to funding research in the traditional academic areas, the agency also supports “high risk, high pay off” ideas, novel collaborations, and projects that may seem like science fiction today but may be commonplace tomorrow. With an annual budget of $11.5bn, NSF makes about 12,000 new grant awards each year, supporting all fields of fundamental science and engineering, including energy innovation and energy efficiency. U.S. Department of Agriculture (USDA) National Institute of Food and Agriculture (NIFA) NIFA supports research, educational, and extension efforts in a wide range of scientific fields related to agricultural and behavioural sciences. This includes: Advanced Technologies : bioenergy, biotechnology, nanotechnology : bioenergy, biotechnology, nanotechnology Animals : animal breeding, animal health, animal production, aquaculture : animal breeding, animal health, animal production, aquaculture Business and Economics: markets and trade, natural resource economics, small business, StrikeForce markets and trade, natural resource economics, small business, StrikeForce Education: learning and engagement, minority-serving institutions, workforce development Environment: climate change, ecosystems, invasive pests and diseases Farming and Ranching: agricultural safety, agricultural technology, farmer education, organic agriculture, small and family farms, sustainable agriculture agricultural safety, agricultural technology, farmer education, organic agriculture, small and family farms, sustainable agriculture Food Science: food quality, food safety food quality, food safety International : global food security : global food security Natural Resources: air, forests, grasslands and rangelands, soil, water air, forests, grasslands and rangelands, soil, water Plants: crop production, pest management, plant breeding, plant health crop production, pest management, plant breeding, plant health U.S. Department of Defense (DOD) More than 1,000 grant opportunities are offered each year by the DOD through its various branches of service, medical units, laboratories, research projects, engineering divisions, environmental cleanup and restoration programs, business and inventory management divisions, and energy security initiatives. These include: Defense Advanced Research Projects (DARPA) DARPA’s mission is “to make pivotal investments in breakthrough technologies and capabilities for national security.” DARPA has repeatedly delivered on that mission, transforming revolutionary concepts and even seeming impossibilities into practical capabilities. The results have included not only game-changing military capabilities such as precision weapons and stealth technology, but also such icons of modern civilian society such as the Internet, automated voice recognition and language translation, and Global Positioning System receivers small enough to embed in myriad consumer devices. DARPA explicitly reaches for transformational change instead of incremental advances. It is looking for promising technologies within science and engineering research communities. These new designs and technologies have to radically improve military capabilities, offering “strategies to surprise our adversaries,” with payoffs for non-military uses afterwards (such as the computer, ceramic bearings, and insulators). The DARPA investment has to fundamentally reshape existing fields or create entirely new disciplines and transform these initiatives into profoundly new, game-changing technologies for U.S. national security and the commercial and private sectors. Other DOD grant opportunities While DARPA focuses exclusively on transformational and disruptive innovations, there are many other opportunities to propose new ideas, concepts, and approaches to the DOD. The primary criterion the DOD uses in assessing a proposal is: will its development result in a procurement contract from DOD? In other words, once it reaches TRL-9 and is ready for commercialization, will it improve the DOD’s ability to carry out is mission through better technologies, systems, or operational readiness? If so, will DOD buy it? If not, you need to look elsewhere for grants. DOD has set a goal to reduce petroleum use throughout all branches of the military and increase its use of alternative energy sources for all power and fuel consumed by 50 percent within the next five years. Any innovation – at any TRL – that will help DOD meet this goal will be of interest to DOD. U.S. Department of Energy (DOE) Advanced Research Program Agency-Energy (ARPA-E) Since 2009, ARPA-E has provided approximately $1.8 billion in R&D funding for more than 660 potentially transformational energy technology projects. ARPA-E funds technology-focused, applied research and development aimed at creating real-world solutions to important problems in energy creation, distribution, and use. ARPA-E issues periodic Funding Opportunity Announcements (FOAs), which are focused on overcoming specific technical barriers around a specific energy area. ARPA-E also issues periodic OPEN FOAs to identify high-potential projects that address the full range of energy-related technologies, as well as funding solicitations aimed at supporting America’s small business innovators. Office of Science (OS) The Office of Science is the basic scientific research arm of the Department of Energy. It issues a cross-cutting, open solicitation annually that is open year-round. It also issues several FOAs each year focusing on specific research needs that are open to one or more institutions, as well as DOE National Laboratory Announcements that are open only to DOE laboratories. Research to prove viability Next, TRL-2 invention begins, with federal funding opportunities including: National Science Foundation (NSF) See description of financial support under TRL-1 above U.S. Department of Agriculture (USDA) National Institute of Food and Agriculture (NIFA) See description of financial support under TRL-1 above U.S. Department of Defense (DOD) See description of financial support under TRL-1 above Defense Advanced Research Projects (DARPA) See description of financial support under TRL-1 above Defense Innovation Unit Experimental (DIUx) DIUx is a Silicon-Valley based and inspired, fast-moving government entity that provides non-dilutive capital to companies to solve national defense problems. It can move from initial presentation to approval of a funding award in as little as 90 days. It seeks to contract with companies offering disruptive, game-changing solutions in a range of areas – from autonomy and artificial intelligence to human systems, information technology, and space – to solve a host of defence problems. View the PBS NewsHour special on DIUx that aired on August 15, 2018, at: https:\/\/www.pbs.org\/newshour\/show\/how-the-pentagon-joins-forces-with-silicon-valley-startups. Other DOD grant opportunities See description of financial support under TRL-1 above U.S. Department of Energy (DOE) DOE funding for ideas, concepts, and approaches in the TRL-2, -3, and -4 stages of development typically come through the DOE’s SBIR\/STTR program, which issue SBIR\/STTR funding solicitations twice per year tied to specific areas of focus from its various offices, except for ARPA-E. (See the Phase I SBIR\/STTR description below.) Each DOE office also issue periodic Funding Opportunity Announcements (FOAs) targeted to a wide range of TRLs for research, development, and demonstration in the fields of interest related to their missions. These include: Advanced Research Program Agency – Energy (ARPA-E) See description of financial support under TRL-1 above Office of Science (OS) See description of financial support under TRL-1 above Office of Fossil Energy (FE) The Office of Fossil Energy is responsible for federal research, development, and demonstration efforts for advanced power generation, power plant efficiency, and carbon capture, utilization, and storage (CCUS) technologies. Its interests include transformational approaches, preliminary design and techno-economic analyses, and new methods for making products from fossil fuel byproducts, wastes, and emissions; reducing the environmental impacts of fossil fuel use; and improving the efficiency, reliability, and flexibility of existing fossil fuel systems and operations. Office of Energy Delivery and Reliability (OE) and Office of Cybersecurity, Energy Security, and Emergency Response (CESER) The Office of Electricity (OE) leads the Department of Energy’s efforts to ensure a resilient, reliable, and flexible electricity system. OE works to develop new technologies to improve the infrastructure that brings electricity into the nation’s homes, offices, and factories. It also oversees the federal and state electricity policies and programs that shape electricity system planning and market operations. OE accomplishes its mission through research, partnerships, facilitation, modelling, and analytics. Funding interests include research, development, and demonstration of next-generation transformers, distributed energy systems, flexible and adaptable designs for power generation and transmission systems, and grid security and resilience. Office of Energy Efficiency and Renewable Energy (EERE) EERE’s mission is to create and sustain American leadership in the transition to a global clean energy economy. It does this through several offices and programs, including: Bioenergy Technologies The Bioenergy Technologies Office (BETO) works to develop industrially relevant technologies to enable domestically produced biofuels and bioproducts. Efficiency The goal of EERE’s Energy Efficiency program is to work with researchers and industry partners to develop innovative, cost-effective, energy-saving solutions through better power production methods, advanced materials and manufacturing processes, commercial and consumer products, new homes, ways to improve older homes, and green building designs and materials which meet the internationally-used Leadership in Energy and Environmental Design (LEED) green building rating system. Renewables EERE cooperates with a large network of researchers, universities, DOE national laboratories, and industry partners to develop, manufacture, and install cutting-edge, high-tech renewable energy systems, with the goal of “catalyzing the transformation of the nation’s energy system” to promote “U.S. leadership in science and engineering as a cornerstone of our economic prosperity.” Transportation Through its Vehicle, Bioenergy, and Fuel Cell Technologies Offices, EERE advances the development of next-generation technologies to make transportation cleaner and more efficient through advanced combustion engine and vehicle efficiency, innovative new transportation technologies, and solutions that put electric drive and fuel cell vehicles on the road and replace oil with clean domestic fuels. Phase I Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) The Small Business Innovation Research Program (SBIR) provides more than $2 billion per year in non-recourse contracts and grants to small U.S.-owned companies to develop new products and services that are based on innovative, unproven concepts and technologies. The objective of the SBIR program is to support innovation that leads to the commercialization of new technologies and final products and services to benefit U.S. communities, companies, and residents. The program is broken down into three phases. The objective of Phase I is to establish the technical merit, feasibility, and commercial potential of an applicant’s proposed research and research and development (R\/R&D) efforts and to determine the quality of performance of the small business organization prior to providing further federal support in Phase II. SBIR Phase I awards normally do not exceed $150,000 (although, in a few cases, awards may go up to $225,000) and are for projects lasting 6 to 12 months. The agencies that offer SBIR grants are as follows. U.S. Department of Agriculture (USDA) U.S. Department of Commerce (DOC): National Institute of Standards (NIS) National Oceanic and Atmospheric Administration (NOAA) U.S. Department of Defense (DOD) – also offers Phase I STTR grants U.S. Department of Energy (DOE) – also offers Phase I STTR grants U.S. Department of Health and Human Services (HHS), including the National Institutes of Health (NIH) – also offers Phase I STTR grants U.S. Department of Homeland Security (DHS) U.S. Department of Transportation (DOT) U.S. Environmental Protection Agency (EPA) National Aeronautics and Space Administration (NASA) – also offers Phase I STTR grants National Science Foundation (NSF) – also offers STTR grants. Technology development TRL-3 initiation of R&D begins. Federal funding opportunities: National Science Foundation (NSF) See description of financial support under TRL-1 above U.S. Department of Agriculture (USDA) National Institute of Food and Agriculture (NIFA) See description of financial support under TRL-1 above U.S. Department of Defense (DOD) Defense Advanced Research Projects (DARPA) See description of financial support under TRL-1 above Defense Innovation Unit Experimental (DIUx) See description of financial support under TRL-2 above Other DOD grant opportunities See description of financial support under TRL-1 above U.S. Department of Energy (DOE) Advanced Research Program Agency-Energy (ARPA-E) See description of financial support under TRL-1 above Office of Science (OS) See description of financial support under TRL-1 above Office of Fossil Energy (FE) See description of financial support under TRL-2 above Office of Energy Delivery and Reliability (OE) and Office of Cybersecurity, Energy Security, and Emergency Response (CESER) See description of financial support under TRL-2 above Office of Energy Efficiency and Renewable Energy (EERE) See description of financial support under TRL-2 above Phase I Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) See description of Phase I financial support under TRL-2 above U.S. Department of Agriculture (USDA) U.S. Department of Commerce (DOC): National Institute of Standards (NIS) National Oceanic and Atmospheric Administration (NOAA) U.S. Department of Defense (DOD) U.S. Department of Energy (DOE) U.S. Department of Health and Human Services (HHS), including the National Institutes of Health (NIH) U.S. Department of Homeland Security (DHS) U.S. Department of Transportation (DOT) U.S. Environmental Protection Agency (EPA) National Aeronautics and Space Administration (NASA) National Science Foundation (NSF) TRL-4 Integration of basic components Federal funding opportunities: National Science Foundation (NSF) See description of financial support under TRL-1 above U.S. Department of Agriculture (USDA) National Institute of Food and Agriculture (NIFA) See description of financial support under TRL-1 above U.S. Department of Defense (DOD) Defense Advanced Research Projects (DARPA) See description of financial support under TRL-1 above Defense Innovation Unit Experimental (DIUx) See description of financial support under TRL-2 above Other DOD grant opportunities See description of financial support under TRL-1 above U.S. Department of Energy (DOE) Advanced Research Program Agency-Energy (ARPA-E) See description of financial support under TRL-1 above Office of Science (OS) See description of financial support under TRL-1 above Office of Fossil Energy (FE) See description of financial support under TRL-2 above Office of Energy Delivery and Reliability (OE) and Office of Cybersecurity, Energy Security, and Emergency Response (CESER) See description of financial support under TRL-2 above Office of Energy Efficiency and Renewable Energy (EERE) See description of financial support under TRL-2 above Phase II Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) The objective of Phase II is to continue the R\/R&D efforts initiated in Phase I. Funding is based on the results achieved in Phase I and the scientific and technical merit and commercial potential of the project proposed in Phase II. Only Phase I awardees are eligible for a Phase II award. SBIR Phase II awards normally do not exceed $1.5 million in total costs for two years. U.S. Department of Agriculture (USDA) U.S. Department of Commerce (DOC): National Institute of Standards (NIS) National Oceanic and Atmospheric Administration (NOAA) U.S. Department of Defense (DOD) – also offers Phase II STTR grants U.S. Department of Energy (DOE) – also offers Phase II STTR grants U.S. Department of Health and Human Services (HHS), including the National Institutes of Health (NIH) – also offers Phase II STTR grants U.S. Department of Homeland Security (DHS) U.S. Department of Transportation (DOT) U.S. Environmental Protection Agency (EPA) National Aeronautics and Space Administration (NASA) – also offers Phase II STTR grants National Science Foundation (NSF) – also offers Phase II STTR grants TRL-5 Validation of operational integrity Federal funding opportunities: National Science Foundation (NSF) – See description of financial support under TRL-1 above See description of financial support under TRL-1 above U.S. Department of Agriculture (USDA) National Institute of Food and Agriculture (NIFA) – See financial support under TRL-1 above See financial support under TRL-1 above U.S. Department of Defense (DOD) Defense Advanced Research Projects (DARPA) – See financial support under TRL-1 above See financial support under TRL-1 above Defense Innovation Unit Experimental (DIUx) – See financial support under TRL-2 above See financial support under TRL-2 above Other DOD grant opportunities – See financial support under TRL-1 above See financial support under TRL-1 above U.S. Department of Energy (DOE) Advanced Research Program Agency-Energy (ARPA-E) – See financial support under TRL-1 above See financial support under TRL-1 above Office of Science (OS) – See financial support under TRL-1 above See financial support under TRL-1 above Office of Fossil Energy (FE) – See financial support under TRL-2 above See financial support under TRL-2 above Office of Energy Delivery and Reliability (OE) and Office of Cybersecurity, Energy Security, and Emergency Response (CESER) – See description of financial support under TRL-2 above See description of financial support under TRL-2 above Office of Energy Efficiency and Renewable Energy (EERE) – See financial support under TRL-2 above See financial support under TRL-2 above Phase II Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) – See description of Phase II financial support under TRL-4 above See description of Phase II financial support under TRL-4 above U.S. Department of Agriculture (USDA) U.S. Department of Commerce (DOC): National Institute of Standards (NIS) National Oceanic and Atmospheric Administration (NOAA) U.S. Department of Defense (DOD) U.S. Department of Energy (DOE) U.S. Department of Health and Human Services (HHS), including the National Institutes of Health (NIH) U.S. Department of Homeland Security (DHS) U.S. Department of Transportation (DOT) U.S. Environmental Protection Agency (EPA) National Aeronautics and Space Administration (NASA) National Science Foundation (NSF) TRL-6 Model, prototype, or pilot testing Federal funding opportunities: As new technologies, concepts, processes, and approaches move into TRL-6, the pool of grants and grant sources falls off – significantly, by more than $10bn – just as the costs for each TRL escalate. For example: The 10,000+ grants and $7.5 billion of funding offered each year by NSF focus solely on basic and applied research. The bulk of NFS’s solicitations are targeted to TRLs 1-3, with a smaller number of grants for TRLs-4 and -5. focus solely on basic and applied research. The bulk of NFS’s solicitations are targeted to TRLs 1-3, with a smaller number of grants for TRLs-4 and -5. The $300 million or so in annual grants available from DOE’s Office of Science and ARPA-E , with few exceptions, also focus on basic and applied research and technology development. , with few exceptions, also focus on basic and applied research and technology development. Finally, the $2.5 billion offered each year through the SBIR\/STTR program focus solely on stimulating innovation and moving promising ideas and concepts up through TRL-5. While the SBIR\/STTR program is targeted to ideas and concepts that are initiated with a view toward eventual commercialization, its Phase III stage does not include any additional grant funding: focus solely on stimulating innovation and moving promising ideas and concepts up through TRL-5. While the SBIR\/STTR program is targeted to ideas and concepts that are initiated with a view toward eventual commercialization, its Phase III stage does not include any additional grant funding: Phase III Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) The objective of the SBIR\/STTR Phase III, where appropriate, is for the small business to pursue commercialization objectives resulting from the Phase I\/II R\/R&D activities. The SBIR program does not fund Phase III; instead, the agencies that participate in the SBIR\/STTR program offer multiple grant and incentive funding opportunities through their standing programs and other solicitations to fund further development of the technologies, concepts and approaches that show commercial promise in Phase 1\/II R\/R&D. For some federal agencies, Phase III may involve follow-on non-SBIR funded R&D or production contracts for products, processes, or services intended for use by the U.S. government. Most of the agencies that participate in the SBIR\/STTR program, therefore, are potential sources of grants for TRL-6, -7, and -8: U.S. Department of Agriculture (USDA) U.S. Department of Commerce (DOC): National Institute of Standards (NIS) National Oceanic and Atmospheric Administration (NOAA) U.S. Department of Defense (DOD) U.S. Department of Energy (DOE) U.S. Department of Health and Human Services (HHS), including the National Institutes of Health (NIH) U.S. Department of Homeland Security (DHS) U.S. Department of Transportation (DOT) U.S. Environmental Protection Agency (EPA) National Aeronautics and Space Administration (NASA) Follow-on grants for projects funded at earlier TRL stages, as well as grants for projects applying for grants at TRL-6, also are available from: U.S. Department of Agriculture (USDA) National Institute of Food and Agriculture (NIFA) See description of financial support under TRL-1 above U.S. Department of Defense (DOD) Defense Advanced Research Projects (DARPA) See description of financial support under TRL-1 above Defense Innovation Unit Experimental (DIUx) See description of financial support under TRL-2 above Other DOD grant opportunities See description of financial support under TRL-1 above U.S. Department of Energy (DOE) Office of Fossil Energy (FE) See description of financial support under TRL-2 above Office of Energy Delivery and Reliability (OE) and Office of Cybersecurity, Energy Security, and Emergency Response (CESER) See description of financial support under TRL-2 above Office of Energy Efficiency and Renewable Energy (EERE) See description of financial support under TRL-2 above Other Federal Government Agencies beyond those listed above and those that participate in the SBIR\/STTR program have grant programs and offer funding that may assist in, or supplement other grants, in carrying out TRL-6. For a list of these agencies, see TRL-7 below. TRL-7 Demonstration-scale testing Federal funding opportunities: See the description of funding opportunities for TRL-6 above. Other funding opportunities may be available if there is a fit with your technology, concept, process, or approach, from: U.S. Department of Commerce (DOC) DOC has one overarching goal: Helping the American Economy Grow. The DOC promotes job creation and economic growth, provides the data necessary to support commerce, oversees ocean and coastal navigation, and fosters innovation by setting standards and conducting foundational research and development. Of its nine bureaus, five provide occasional grant and funding opportunities that can assist with moving commerce-related and oceanic- and atmospheric-related technologies, concepts, and approaches through advanced TRLs. These include: Economic Development Administration (EDA) National Institute of Standards & Technology (NIST) National Oceanic and Atmospheric Administration (NOAA) Institute of Standards & Technology (NIST) National Telecommunications & Information Administration (NTIA) U.S. Department of the Interior (DOI) DOI manages the nation’s lands. Its current priorities are to maintain and expand conservation stewardship on public lands, sustainably develop the nation’s energy and natural resources, modernize the infrastructure overseen by DOI, and promote economic development for Tribal Nations and ensure their sovereignty. Several of DOI’s nine bureaus offer grants to support energy innovation, adoption, and deployment, including: Bureau of Indian Affairs (BIA) Bureau of Land Management (BLM) Bureau of Ocean Energy Management (BOEM) Bureau of Reclamation (BOR) National Park Service (NPS) Office of Surface Mining Reclamation and Enforcement U.S. Fish and Wildlife Service (FWS) U.S. Geological Survey (USGS) U.S. Department of Transportation (DOT) DOT has embarked on an aggressive program to promote sustainability in its policies, operations, investments and research and ensure that by 2020 not less than 20% of electric energy consumed by DOT comes from renewable energy sources. DOT also has made a commitment to pursue opportunities for the national transportation system that will promote energy and natural resource conservation, decrease emissions of greenhouse gases (GHGs), reduce dependence on fossil fuels, and increase energy efficiency. One innovative program, the Smart Cities Challenge, selected Columbus, Ohio, in June 2016 to receive $40 million from DOT to become the first U.S. city to fully integrate innovative technologies – self-driving cars, connected vehicles, and smart sensors – into its transportation network. Another DOT initiative is exploring Renewable Energy Uses in Highway Rights of Way. TRL-8 Precommercial demonstration: Proof of operational technology, concept, or approach Federal funding opportunities: See TRL-7 above. TRL-9 First commercial deployment Federal funding opportunities: U.S. Department of Agriculture (USDA) Rural Development Section 9003 Biorefinery, Renewable Chemical, and Bioproduct Manufacturing Assistance Loan Guarantee U.S. Department of Defense (DOD) Defense Advanced Research Projects (DARPA) See description of financial support under TRL-1 above Defense Innovation Unit Experimental (DIUx) See description of financial support under TRL-2 above Other DOD grant opportunities See description of financial support under TRL-1 above U.S. Department of Energy (DOE) Loan Program Office (LPO) Title 17 Loan Guarantee Program: Renewable Energy and Energy Efficiency Projects Advanced Fossil Energy Projects Advanced Nuclear Energy Projects Tribal Energy Projects Advanced Technology Vehicle Manufacturing (ATVM) Direct Loan Program U.S. Treasury Investment Tax Credit (ITC) The ITC reduces federal income taxes based on capital investment in innovative and renewable energy projects (measured in dollars). The ITC is earned when the equipment is placed into service. Production Tax Credit (PTC) The PTC reduces federal income taxes on innovative and renewable energy projects based on the electrical output (measured in kilowatt-hours, or kWh) of grid-connected renewable energy facilities. Modified Accelerated Cost-Recovery System (MACRS) Or Bonus Depreciation allows businesses and project developers to reduce their federal taxes through a deduction for depreciation when renewable energy equipment or facilities producing renewable energy are placed into service. With the passage of the 2017 Tax Cuts and Jobs Act, the first-year depreciation allowance was increased from 50% to 100%. Several other types of technologies and properties that incorporate innovative concepts also are now eligible for MARCS program bonus depreciation. Development is Complete, and commercial Roll-Out Begins Federal funding opportunities: U.S. Department of Agriculture (USDA) Rural Development Business Programs: Business & Industry (B&I) Loan Guarantees Value-Added Producer Grants Rural Development Energy Programs: Advanced Biofuel Payment Program Repowering Assistance Program Renewable Energy for America Program (REAP) Loan Guarantees Rural Utility Service (RUS) Electric Programs: Distributed Generation Energy Project Financing Loan Guarantees Electric Infrastructure Loans & Loan Guarantees Rural Utility Service (RUS) Telecommunications Programs: Rural Broadband Loans & Loan Guarantees Telecommunications Infrastructure Loans & Loan Guarantees Rural Utility Service (RUS) Water & Environmental Programs: Water & Waste Disposal Loans and Grants Water & Waste Disposal Loan Guarantees U.S. Department of Defense (DOD) Contracting \/ Procurement U.S. Department of Energy (DOE) Contracting \/ Procurement U.S. Department of Commerce (DOC) Contracting \/ Procurement As well as grant programs to promote job creation and economic development to promote job creation and economic development U.S. Department of Transportation (DOI) Contracting \/ Procurement As well as grant programs for investments in and rebuilding of surface transportation infrastructure and infrastructure enhancements for investments in and rebuilding of surface transportation infrastructure and infrastructure enhancements U.S. Department of the Treasury See descriptions above under TRL-9 of the Investment Tax Credit (ITC), Production Tax Credit (PTC), and Modified Accelerated Cost-Recovery System (MACRS) or Bonus Depreciation Allowance. Clean Renewable Energy Bonds (CREBs) Clean Renewable Energy Bonds (CREBs) can be used to finance renewable energy projects using technologies that also qualify for the federal renewable energy production tax credit (PTC). CREBs may be issued by electric cooperatives, government entities (states, cities, counties, territories, Indian tribal governments or any political subdivision thereof), and certain lenders. The bondholder receives federal tax credits in lieu of a portion of the traditional bond interest, resulting in a lower effective interest rate for the borrower. Qualified Energy Conservation Bonds (QECBs) Qualified Energy Conservation Bonds (QECBs) may be used by state, local and tribal governments to finance certain types of energy projects. QECBs are qualified tax credit bonds, and in this respect, are similar to Clean Renewable Energy Bonds or CREBs. The difference is that borrower who issues the bond pays back only the principal of the bond, and the bondholder receives federal tax credits in lieu of the traditional bond interest. National Aeronautical and Space Administration (NASA) Project Development Grants \/ Loans \/ Loan Guarantees American Diversified Energy has subject matter experts in all disciplines that are required to prepare applications and secure funding to move through each TRL. The Federal Grants page on the American Diversified Energy website serves as a portal to the grants, funding, and support provided by each of the ten federal agencies listed above, with links to each agency’s grant-making programs and lists of current solicitations.","filter_flag":1}
{"title":"Current Strategic Priorities - Alberta Innovates","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vYWxiZXJ0YWlubm92YXRlcy5jYS9jdXJyZW50LXN0cmF0ZWdpYy1wcmlvcml0aWVzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vYWxiZXJ0YWlubm92YXRlcy5jYS9jdXJyZW50LXN0cmF0ZWdpYy1wcmlvcml0aWVzL9IBAA?oc=5","id":"CBMiOWh0dHBzOi8vYWxiZXJ0YWlubm92YXRlcy5jYS9jdXJyZW50LXN0cmF0ZWdpYy1wcmlvcml0aWVzL9IBAA","guidislink":false,"published":"Tue, 18 Jul 2023 19:28:20 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=7, tm_mday=18, tm_hour=19, tm_min=28, tm_sec=20, tm_wday=1, tm_yday=199, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vYWxiZXJ0YWlubm92YXRlcy5jYS9jdXJyZW50LXN0cmF0ZWdpYy1wcmlvcml0aWVzL9IBAA?oc=5\" target=\"_blank\">Current Strategic Priorities<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Alberta Innovates<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Current Strategic Priorities - Alberta Innovates","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vYWxiZXJ0YWlubm92YXRlcy5jYS9jdXJyZW50LXN0cmF0ZWdpYy1wcmlvcml0aWVzL9IBAA?oc=5\" target=\"_blank\">Current Strategic Priorities<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Alberta Innovates<\/font>","source.href":"https:\/\/albertainnovates.ca","source.title":"Alberta Innovates","query":"https:\/\/news.google.com\/rss\/search?q=\"Alternative Energy Sources\" \"new products\"+after:2023-07-01+before:2023-07-31","text":"Advancing clean resource technologies We develop and invest in applied research and innovation programs to sustain, grow and diversify the energy and resource industries, and to protect our environment. We are working with our partners in industry and post-secondary institutions to: Develop clean technologies, bioenergy and the circular economy. Develop renewable and alternative energy sources. Reduce greenhouse gas emissions and protect Alberta’s water, land and biodiversity. Support new and improved methods of extracting hydrocarbons through cleaner production. Support the development of innovative hydrocarbon products. This includes converting bitumen into valuable non-fuel products, and new methods to convert natural gas into new products. Advance homegrown capacity of technologies and products using rare elements and critical minerals like nickel, vanadium and lithium. These minerals are needed for electronics and energy storage and will enable Alberta to achieve emission reduction targets and net-zero goals. Strengthen economic diversification by using byproducts and residuals from forestry and agriculture to create bioproducts and biomaterials. Find out more about some of our clean resource initiatives by browsing through this section. Go to our funding section and check out our clean resource programs for detailed information about each program.","filter_flag":1}
