{"title":"Mobil launches 50% post-consumer recycled plastic pails in India - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5","id":"CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA","guidislink":false,"published":"Fri, 03 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=34, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5\" target=\"_blank\">Mobil launches 50% post-consumer recycled plastic pails in India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mobil launches 50% post-consumer recycled plastic pails in India - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiemh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL2luL25ld3MtcmVsZWFzZXMvbW9iaWwtbGF1bmNoZXMtNTAtcG9zdC1jb25zdW1lci1yZWN5Y2xlZC1wbGFzdGljLXBhaWxzLWluLWluZGlhLTMwMTczODM3Mi5odG1s0gEA?oc=5\" target=\"_blank\">Mobil launches 50% post-consumer recycled plastic pails in India<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Waste-to-Value\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Mobil is driving an initiative to transition to 50% Post-Consumer Recycled (PCR) plastic pails – helping customers reduce waste, convert waste to value and advance sustainability ambitions Mobil is taking steps to incorporate recycled plastics in finished lubricant product packaging The company's move towards PCR drives the use of recycled plastic, and helps reduce plastic waste, while enabling sustainable progress NEW DELHI, Feb. 3, 2023 \/PRNewswire\/ -- Mobil™, a global leader in lubrication technology innovation, has launched an initiative to encourage sustainable packaging with its 50% Post-Consumer Recycled (PCR) plastic pails. The PCR pails drive the use of recycled plastic, helping reduce plastic waste, and enabling sustainable progress. The company's 50% PCR pails, first in pails packing for lubricating oils in India, aim to help customers reduce waste, convert waste to value and advance sustainability ambitions. Mobil launches 50% post-consumer recycled plastic pails in India Vipin Rana, Chief Executive Officer, ExxonMobil Lubricants Pvt. Ltd., said, \"Mobil can help create value by advancing customers' mobility, productivity, and sustainability ambitions. Our initiative to transition to 50% post-consumer recycled plastic pails is just one example of how we are advancing our customers' sustainability ambitions. We understand the ever-changing needs of our customers and stakeholders and are committed to operating our business in an accountable and sustainable manner, supplying feature products by minimizing the environmental impacts, and supporting the communities in which we operate.\" ExxonMobil has emerged as a categorical leader in the diversion of waste in lubricant facilities. All Mobil products manufactured in the company's global network of lubricant facilities carry the Underwriters Laboratories Zero Waste to Landfill, Silver Validation, first earned in 2018. This validation recognizes ExxonMobil's commitment to reducing waste and advancing a circular economy. Additionally, ExxonMobil continues to be the first and only finished lubricants marketer to carry this credential, and each year diverts more than 90% (over 50,000 tons) of lubricant operations waste from landfills into new productive uses. ExxonMobil is also leveraging scale and integration to increase the production of certified circular plastics and meet growing demand. In December 2022, the company announced the successful startup of one of the largest advanced recycling facilities in North America. The facility at the integrated manufacturing complex in Baytown, Texas, uses proprietary technology to break down hard-to-recycle plastics and transforms them into raw materials for new products. The recycling facility in Baytown is capable of processing more than 80 million pounds of plastic waste per year, supporting a circular economy for post-use plastics and helping divert plastic waste currently sent to landfills. Mobil's range of products and solutions help support businesses, communities, and individuals to make more efficient and sustainable choices. Mobil branded offers help customers extend oil and equipment life, improve energy efficiency and fuel economy, deliver performance, and achieve more with less by making the most of valuable resources. About ExxonMobil in India ExxonMobil's downstream business engages in the distribution, sales and marketing of Mobil branded lubricants and specialties. The chemicals business provides market development support, analytical and reporting services. It also conducts chemical product application support services and product testing support at its technology center in Bengaluru. The upstream business provides consulting and LNG market development support services for other ExxonMobil upstream affiliates. The Global Business Center\/Technical Center provides a range of support services for ExxonMobil's operations around the globe. ExxonMobil contributes to a wide range of programs in India that support education, health and the community. For more news and information on Mobil lubricants in India, follow us on – FaceBook Instagram YouTube Linkedin ExxonMobil Exxon Mobil Corporation has numerous affiliates, many with names that include, but are not limited to, ExxonMobil. For convenience and simplicity, the term \"ExxonMobil\" is used as an abbreviated reference to specific affiliates or affiliate groups. Photo: https:\/\/mma.prnewswire.com\/media\/1995639\/Mobil_launch.jpg","filter_flag":1}
