{"title":"Strata Clean Energy Celebrates 15 Years of Innovation and Growth in Renewable Energy - Business Wire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTAxNjk4MTE1MS9lbi9TdHJhdGEtQ2xlYW4tRW5lcmd5LUNlbGVicmF0ZXMtMTUtWWVhcnMtb2YtSW5ub3ZhdGlvbi1hbmQtR3Jvd3RoLWluLVJlbmV3YWJsZS1FbmVyZ3nSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTAxNjk4MTE1MS9lbi9TdHJhdGEtQ2xlYW4tRW5lcmd5LUNlbGVicmF0ZXMtMTUtWWVhcnMtb2YtSW5ub3ZhdGlvbi1hbmQtR3Jvd3RoLWluLVJlbmV3YWJsZS1FbmVyZ3nSAQA?oc=5","id":"CBMijQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTAxNjk4MTE1MS9lbi9TdHJhdGEtQ2xlYW4tRW5lcmd5LUNlbGVicmF0ZXMtMTUtWWVhcnMtb2YtSW5ub3ZhdGlvbi1hbmQtR3Jvd3RoLWluLVJlbmV3YWJsZS1FbmVyZ3nSAQA","guidislink":false,"published":"Mon, 16 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=289, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTAxNjk4MTE1MS9lbi9TdHJhdGEtQ2xlYW4tRW5lcmd5LUNlbGVicmF0ZXMtMTUtWWVhcnMtb2YtSW5ub3ZhdGlvbi1hbmQtR3Jvd3RoLWluLVJlbmV3YWJsZS1FbmVyZ3nSAQA?oc=5\" target=\"_blank\">Strata Clean Energy Celebrates 15 Years of Innovation and Growth in Renewable Energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Wire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Strata Clean Energy Celebrates 15 Years of Innovation and Growth in Renewable Energy - Business Wire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTAxNjk4MTE1MS9lbi9TdHJhdGEtQ2xlYW4tRW5lcmd5LUNlbGVicmF0ZXMtMTUtWWVhcnMtb2YtSW5ub3ZhdGlvbi1hbmQtR3Jvd3RoLWluLVJlbmV3YWJsZS1FbmVyZ3nSAQA?oc=5\" target=\"_blank\">Strata Clean Energy Celebrates 15 Years of Innovation and Growth in Renewable Energy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Wire<\/font>","source.href":"https:\/\/www.businesswire.com","source.title":"Business Wire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"DURHAM, N.C.--(BUSINESS WIRE)--Strata Clean Energy is proudly celebrating its 15th anniversary. Founded in 2008 as a residential rooftop solar company, the company has grown into a leading provider of utility-scale clean energy solutions. The company celebrated this milestone with its employees, key partners, and local officials including Representative Larry Strickland (R- North Carolina, District 28) and Senator Mike Woodard (D- North Carolina, District 22), at its Durham, NC headquarters on October 13. \"At Strata, our journey over the past 15 years has been marked by a relentless pursuit of customer satisfaction and a steadfast commitment to safety and quality,\" said Markus Wilhem, CEO Strata Clean Energy. \"We are proud of our achievements. None of this could have been accomplished without the dedication and support of our team who helped build Strata into what it is today.” IMAGE: Strata Clean Energy CEO Markus Wilhelm gives an address at the 15-Year anniversary event Over the past 15 years, Strata Clean Energy has evolved into a vertically integrated clean-energy company encompassing development, engineering, procurement, construction, and operations & maintenance services for the utility market. With over 270 solar and storage projects completed, the company has been instrumental in the development and construction of 3,000 megawatts (MW) of solar energy and 3,200 megawatt hours (MWh) of utility-scale energy storage. Additionally, the operations and maintenance division oversees a 5,000 MW portfolio. Strata’s dedication to innovation and sustainability is exemplified by its growing development project pipeline, which includes 8,000 MW of solar and 31,000 MWh of battery storage. Strata is committed to having a profound impact on the transition to a cleaner and more efficient power grid. In 2020, Strata Clean Energy made headlines when it developed the Saticoy Battery Energy Storage facility in Oxnard, CA. The 400 MWh project was among the largest of its time and eliminated the need for a planned gas-fired peaker plant in the community. In 2023, Strata developed the 1,020 MWh Scatter Wash battery storage complex and entered into 20-year tolling agreement with Arizona Public Service. “Strata’s success is tied to our commitment to innovation and transformation,” said Josh Rogol, President of Strata Clean Energy. “From our beginning as a residential solar company to our current position as a leader in customized clean energy solutions, Strata’s dedicated team diligently works to develop new products and services which are focused on advancing sustainability and striving for net zero emissions.” Looking ahead, Strata is developing new initiatives that will leverage our industry leading position in hourly-matched renewable energy supply contracts to power green hydrogen solutions which promise to decarbonize the most emission intensive segments of the modern industrial economy. IMAGE: (From Left to Right): Markus Wilhem, CEO of Strata Clean Energy; Nick Mshar, Strata Clean Energy; Mark Mulhern, Strata Clean Energy; Garrett Lehman, VP of Development at Strata Clean Energy About Strata Clean Energy Strata Clean Energy, LLC, and its affiliates (collectively \"Strata\") are a vertically integrated solar and storage development, engineering, procurement, and construction (EPC) and operations & maintenance (O&M) company. With a focus on the utility market, Strata has an extensive track record of successful projects, including over 270 in operation, 3,000 MW of solar capacity, and 31,000 MWh of storage in its development pipeline. Strata is committed to providing industry-leading quality and cost competitiveness while driving the transition to cleaner and more sustainable energy solutions.","filter_flag":1}
{"title":"Qcells North America Completes Dalton Factory Expansion - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcWNlbGxzLW5vcnRoLWFtZXJpY2EtY29tcGxldGVzLWRhbHRvbi1mYWN0b3J5LWV4cGFuc2lvbi0zMDE5NTk4ODkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcWNlbGxzLW5vcnRoLWFtZXJpY2EtY29tcGxldGVzLWRhbHRvbi1mYWN0b3J5LWV4cGFuc2lvbi0zMDE5NTk4ODkuaHRtbNIBAA?oc=5","id":"CBMib2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcWNlbGxzLW5vcnRoLWFtZXJpY2EtY29tcGxldGVzLWRhbHRvbi1mYWN0b3J5LWV4cGFuc2lvbi0zMDE5NTk4ODkuaHRtbNIBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcWNlbGxzLW5vcnRoLWFtZXJpY2EtY29tcGxldGVzLWRhbHRvbi1mYWN0b3J5LWV4cGFuc2lvbi0zMDE5NTk4ODkuaHRtbNIBAA?oc=5\" target=\"_blank\">Qcells North America Completes Dalton Factory Expansion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Qcells North America Completes Dalton Factory Expansion - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMib2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvcWNlbGxzLW5vcnRoLWFtZXJpY2EtY29tcGxldGVzLWRhbHRvbi1mYWN0b3J5LWV4cGFuc2lvbi0zMDE5NTk4ODkuaHRtbNIBAA?oc=5\" target=\"_blank\">Qcells North America Completes Dalton Factory Expansion<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"This marks the first solar panel factory to be built since IRA passage ATLANTA, Oct. 18, 2023 \/PRNewswire\/ -- Qcells, an industry-leading clean energy solutions provider, today announced the successful completion of its Dalton, Georgia, factory expansion. Qcells added 2 gigawatts (GW) of solar capacity to Dalton, bringing the full factory's output to more than 5.1 GW. The Qcells Dalton factory is the largest manufacturing plant of its kind in the Western Hemisphere and the first solar panel plant expansion since the passage of the Inflation Reduction Act (IRA). This addition marks the first phase of Qcells' historic $2.5 billion investment announced in January 2023. The completed Dalton expansion created 510 additional solar factory jobs and will also assemble two new solar products: the Q.TRON G2 residential solar panel and a bifacial panel for the commercial and utility markets. Qcells' Dalton factory will manufacture nearly 30,000 solar panels per day. Beyond Dalton, the investment includes the development of a fully-integrated solar supply chain factory in Cartersville, Georgia. The highly anticipated Cartersville factory will manufacture solar ingots, wafers, cells and finished panels. By 2024, between the Dalton and Cartersville facilities, Qcells anticipates its solar production capacity to reach 8.4 GW a year, enough to power 1.3 million homes annually with clean energy. \"Completing this factory marks the third expansion we've made in Dalton, and it's just the beginning of Qcells' larger mission to build a fully integrated solar supply chain in America,\" said Justin Lee, CEO of Qcells. \"The Inflation Reduction Act and the efforts of Georgia's economic development team helped make these ambitious plans possible, and with it thousands of careers in clean energy. As we build new solar technology from Dalton and prepare for the start of Cartersville, it is critical that our local to federal leaders continue to work not only with us, but the larger industry to ensure our collective investments deliver for communities for decades to come.\" \"Out of all the places Qcells could have gone, they chose to operate and expand here in Georgia because of our unrivaled assets and the competitive package we put together in 2019,\" said Governor Brian Kemp. \"This latest milestone is a testament to the hard work of the Dalton community and the relationship we've built on the state level with this innovative company. We look forward to the new jobs this expansion will bring for Georgians in that area.\" \"When I wrote and passed the Solar Energy Manufacturing for America Act, it was with this exact goal in mind. I thank Qcells for their continued investment in Georgia,\" U.S. Senator Jon Ossoff said. \"Our state is emerging as the advanced energy capital of the nation, thanks to Federal infrastructure and manufacturing policies that are benefiting Georgia more than any other state in the country.\" \"With Qcells' multi-billion dollar factory expansion in north Georgia up and running, Georgians are seeing the real-time benefits of the Inflation Reduction Act and its clean energy provisions as our state continues to embark on a green energy revolution,\" said Senator Reverend Warnock. \"With over 500 solar manufacturing jobs added in the process, Qcells is proving that taking action to address climate change and growing our economy can go hand in hand. I look forward to continuing to partner with Qcells as our state becomes the premier destination for the solar manufacturing industry.\" Qcells opened its first factory in Georgia in 2019 and hired 750 people to manufacture 1.7 GW of solar. This initial investment was made possible in part by the Section 201 tariffs imposed on solar cells. As the nation's demand for solar grew, so did Qcells' investment in its Dalton facility. Last year, Qcells announced a plan to add 1.4 GW to its manufacturing output and hire 535 more people. This now completed third expansion, as well as Qcells investments across the full solar value chain, follow the passage of the Solar Energy Manufacturing for America Act within the IRA and are made possible with the incredible support from Georgia's economic development team. Qcells' new products – the Q.TRON G2 and their new bifacial panels – represent the company's next generation of solar and underscores its commitment to developing reliable, cost-effective products at scale. These products also showcase Qcells' larger commitment to sustainability. Both products will likely achieve an ecolabel known as EPEAT, which helps customers identify sustainably made products. Qcells' completed Dalton factory expansion and current development in Cartersville aim to accelerate the United States' shift towards renewable energy. Upon completed construction, Qcells' production in Georgia could avoid more than 12 million metric tons of CO2 equivalents per year while expanding domestic manufacturing of solar products amidst the push for Made-in-America clean energy solutions. SOURCE Hanwha Q CELLS America Inc.","filter_flag":1}
{"title":"CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5","id":"CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA","guidislink":false,"published":"Thu, 19 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=292, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5\" target=\"_blank\">CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimAFodHRwczovL3d3dy5uZXdzd2lyZS5jYS9uZXdzLXJlbGVhc2VzL2NpY2UtZnVuZHMtaW5ub3ZhdGlvbi10by1hZHZhbmNlLXRoZS1tZWFzdXJpbmctbW9uaXRvcmluZy1hbmQtdmVyaWZpY2F0aW9uLW1tdi1vZi1jYXJib24tbWFuYWdlbWVudC04NDY3NjA2NzIuaHRtbNIBAA?oc=5\" target=\"_blank\">CICE Funds Innovation to Advance the Measuring, Monitoring, and Verification (MMV) of Carbon Management<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"B.C. clean energy innovators secure a total of $2.82 million in funding to propel over $12 million in MMV projects VANCOUVER, BC, Oct. 19, 2023 \/CNW\/ - The B.C. Centre for Innovation and Clean Energy (CICE) is announcing its allocation of $2.82 million in non-dilutive funding to develop commercial pathways for innovative B.C.-based solutions that support the measurement, monitoring, and verification (MMV) of carbon emission reduction, removal and avoidance. Congratulations to CICE funding recipients: Arca, Metaspectral, Miraterra and Quatern Limited Partnership (CNW Group\/B.C. Centre for Innovation and Clean Energy) \"B.C. is uniquely positioned to be a world leader in the global shift to clean technology and a low-carbon economy. Promoting made-in-B.C. innovative solutions for decarbonization and emissions reduction moves our province even closer to meeting its CleanBC goals,\" said Josie Osborne, Minister of Energy, Mines and Low Carbon Innovation. \"I applaud the B.C. Centre for Innovation and Clean Energy for their efforts in recognizing and funding projects that have the potential to be real game-changers in carbon management and realize a healthier future.\" Through this investment CICE is supporting the commercialization of MMV solutions which are vital to assessing carbon emissions reductions, removal and avoidance at scale. This investment will help advance the expansion of the global carbon credit market and spur further investment in emissions-reductions programs and technologies. \"British Columbia has a unique opportunity to lead the advancement of carbon management solutions by establishing MMV pathways and innovations,\" said Todd Sayers, Chief Operating Officer of the B.C. Centre for Innovation and Clean Energy. \"CICE is proud to lead catalytic investment into Arca, Metaspectral, Miraterra, and Quatern Limited Partnership and looks forward to seeing their solutions reach global scaling and climate impact potential.\" CICE launched the call for MMV innovation in June 2023, and welcomed over 100 potential applicants. Using an intelligent risk-taking framework, CICE strives to maximize potential impact of breakthrough clean energy and climate solutions by: Identifying the optimal convergence points of decarbonization and real-world readiness backed by CICE research and industry consultation Accelerating clean energy adoption and growth by mobilizing collaboration between government, industry, investors, academia and Indigenous rights holders De-risking investment in early stage cleantech and climate solutions through a government and industry co-funding model MMV funding recipients include: Arca is developing MMV technology for quantifying and validating carbon dioxide removal via carbon mineralization - a geochemical process that removes atmospheric CO2 and permanently stores it as rock - in alkaline waste. While Arca's carbon dioxide removal technologies are currently focused on mine tailings, its MMV technology will be applicable to all methods of surficial carbon mineralization - which are estimated to have a total carbon dioxide removal (CDR) capacity in excess of 1 billion tonnes per year. Metaspectral is creating a precise and cost-efficient method of assessing, quantifying, and tracking the carbon sequestration capacity of land for various industries, including agriculture. AI models ingest hyperspectral imagery in real-time to measure concentrations and fluxes of greenhouse gasses more accurately - specifically CO2 and CH4, but also N2O. With a more efficient way to measure the carbon sequestration capacity of large fields, farmers are able to optimize their practices - such as tillage, over-cropping, fertilization, and watering - to maximize the carbon sequestration potential of their land. Miraterra is developing a faster, more affordable way to test the soil quality of farm fields. Its proprietary Raman sensors provide near instantaneous measurement of key soil components including pH, soil organic carbon, soil organic matter, and NPK. This technology is fast, delivers results at approximately one-third the cost of conventional sampling, eliminates the need for toxic chemicals in conventional soil testing, and will ultimately be deployable in-field. This funding will accelerate the world's ability to measure permanence of carbon sequestered in soil via Miraterra's breakthrough carbon sub-pool measurement system. Quatern Limited Partnership is a collaboration between Quatsino First Nation and Western Forest Products Inc., who will be implementing a technology to measure the change in carbon sequestration of forests due to large-scale fertilization efforts. A technology called Treeid will be used to analyze growth rates of individual trees using LiDAR data collected several years apart. In addition to quantifying the rate at which trees sequester carbon post-fertilization, this technology could also be applied to other forest management treatments such as reforestation and thinning. Past CICE funding recipients include: Anodyne Chemistries, Atlas Power Technologies Inc., Cascadia Seaweed, Corvus Energy Inc., Ekona Power, H2 Portable Power Corp, HTEC, Hydra Energy, Hydron Energy, Illuming Power Inc., Invinity Energy Systems, Lafarge Canada, Mangrove Lithium, Metro Vancouver, Moment Energy Inc., Parkland Refining BC Ltd., Rainhouse Manufacturing Canada Ltd., and Takachar About CICE The B.C. Centre for Innovation and Clean Energy (CICE) is an independent, not-for-profit corporation that grants early-stage funding to fast-track the commercialization of British Columbia's most impactful clean energy solutions – from Canada to the world. We match the urgency and efficiency of the companies we fund, driving innovation like the planet depends on it. Because it does. Together with our climate-first community of innovators, industry leaders, academia, government, and Indigenous partners, we advance future pathways to net-zero - leveraging B.C.'s clean energy advantages to attract investment, create high paying green jobs and build sustainable economic prosperity for decades to come. SOURCE B.C. Centre for Innovation and Clean Energy For questions or interviews, please contact: Stacy Gorkoff, Head of Marketing, BC Centre for Innovation and Clean Energy (CICE), [email protected], 604.828.5548, www.cice.ca","filter_flag":1}
{"title":"Arnab Das: Leading Strategic & Purposeful Growth | CEOInsightsAsia Vendor - CEO Insights Asia","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmNlb2luc2lnaHRzYXNpYS5jb20vbGVhZGVyL2FybmFiLWRhcy1sZWFkaW5nLXN0cmF0ZWdpYy1wdXJwb3NlZnVsLWdyb3d0aC1jaWQtNTU0Ny5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmNlb2luc2lnaHRzYXNpYS5jb20vbGVhZGVyL2FybmFiLWRhcy1sZWFkaW5nLXN0cmF0ZWdpYy1wdXJwb3NlZnVsLWdyb3d0aC1jaWQtNTU0Ny5odG1s0gEA?oc=5","id":"CBMiYmh0dHBzOi8vd3d3LmNlb2luc2lnaHRzYXNpYS5jb20vbGVhZGVyL2FybmFiLWRhcy1sZWFkaW5nLXN0cmF0ZWdpYy1wdXJwb3NlZnVsLWdyb3d0aC1jaWQtNTU0Ny5odG1s0gEA","guidislink":false,"published":"Wed, 11 Oct 2023 22:52:26 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=11, tm_hour=22, tm_min=52, tm_sec=26, tm_wday=2, tm_yday=284, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmNlb2luc2lnaHRzYXNpYS5jb20vbGVhZGVyL2FybmFiLWRhcy1sZWFkaW5nLXN0cmF0ZWdpYy1wdXJwb3NlZnVsLWdyb3d0aC1jaWQtNTU0Ny5odG1s0gEA?oc=5\" target=\"_blank\">Arnab Das: Leading Strategic & Purposeful Growth | CEOInsightsAsia Vendor<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CEO Insights Asia<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Arnab Das: Leading Strategic & Purposeful Growth | CEOInsightsAsia Vendor - CEO Insights Asia","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiYmh0dHBzOi8vd3d3LmNlb2luc2lnaHRzYXNpYS5jb20vbGVhZGVyL2FybmFiLWRhcy1sZWFkaW5nLXN0cmF0ZWdpYy1wdXJwb3NlZnVsLWdyb3d0aC1jaWQtNTU0Ny5odG1s0gEA?oc=5\" target=\"_blank\">Arnab Das: Leading Strategic & Purposeful Growth | CEOInsightsAsia Vendor<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CEO Insights Asia<\/font>","source.href":"https:\/\/www.ceoinsightsasia.com","source.title":"CEO Insights Asia","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Arnab Das Director The gas supply service market has been rapidly growing over the years, and Arnab Das, the Director of Group Strategies & Business Development of Global Gases Group FZE, has played a significant role in its success. With his expertise and experience, he has helped in the company’s expansion into other markets, such as healthcare and clean-green energy in emerging markets. With a Mechanical Engineering degree from the Indian Institute of Engineering Science and Technology (IIEST) and an Executive MBA from the prestigious Indian School of Business in Hyderabad, Arnab is well-equipped to lead the company’s journey. Over the past 24 years, Arnab has worked in various industries including lead acid batteries, industrial & specialty gases, chemicals, architectural hardware, and clean energy solutions across Southeast Asia, Middle East Asia, and Africa. His focus has been on creating sustainable value-based businesses for customers and providing competitiveness across multiple industry segments. Arnab’s recent work has been in corporate strategy and developing accessible and affordable clean and green energy solutions in emerging markets. Let’s hear more from him in below interview snippets. What is your approach to leadership and what has led to your success? My leadership approach is focused on creating a customer-centric organizational culture that aligns the company’s goals, business, systems & processes, with the needs of customers, communities, and the environment. Additionally, I prioritize making products and services accessible through investments in the company’s capabilities, partnerships, and collaborations. Finally, I am willing to take risks and experiment with new products, markets, and collaborations. How would you describe Global Gases Group and its position in the market? Global Gases Group, established in 2002, is a leading independent company that specializes in industrial gases, particularly helium and gas mixtures. The company operates 12 industrial gas packaging facilities in five continents worldwide. The company is currently expanding its facilities to provide efficient supply to the oil and gas, healthcare MRI, manufacturing, research and development, and defense sectors. Moreover, the company has a keen interest in healthcare and clean green energy in developing markets. Global Gases Group has made significant investments in these areas to provide affordable and accessible medical oxygen to both public and private healthcare facilities. The company also aims to provide affordable clean cooking gas such as LPG, biogas, and bio-methane for cooking and mobility fuel. Additionally, it aims to aim to develop natural gas-to-power solutions and green electricity for remote locations, as well as various waste-to-electricity projects in their operating markets. My leadership approach is focused on creating a customer-focused organizational culture that aligns the company's goals, businesses, and systems & processes, with the needs of customers, communities, & the environment What growth factors are you focused on to ensure the company achieves its objectives? At Global Gases Group, we are focused on addressing critical needs in healthcare and energy to improve the quality of living, propel inclusive growth, and address pressing environmental needs. This requires investments in plants, gas distribution assets, infrastructure, and allied collaborations necessary to improve accessibility in emerging markets like Sub- Saharan Africa and Southeast Asia. How do you ensure safety and quality standards are met in the market? Safety and quality are mandatory requirements at Global Gases Group. All products go through rigorous quality control and compliance practices. The company is ISO 9001, 14001, and 45001 certified, and a safety culture is inculcated among individuals to be responsible for their own actions within and outside the workplace. How do you promote a learning culture in your team to draw valuable market insights? Creating a high-performance organization requires a continuous learning environment. At Global Gases Group, existing talents are provided with opportunities to lead, acquire new skills, and work in different markets of varying complexities. The company invests in training, development, coaching, and reward systems for skill development and talent retention. What is your future destination? My goal is to address the energy needs of developing markets while supporting countries & communities to achieve their climate change goals. As a professional, my focus is on creating, managing, and growing purposeful businesses in these areas from multinational corporations to family business structures. My work will continue to be focused on waste-to-energy, natural gas-to-power, biogas and bio-methane, and green hydrogen, requiring aggressive investments to scale up, commercialize new technologies, and collaborate with financial institutions, governments, policymakers, influencers, technology developers, and equipment manufacturer. Arnab Das, Director, Global Gases Group Institute of Engineering Science and Technology (IIEST) and an Executive MBA from the prestigious Indian School of Business, Hyderabad, Arnab Das holds Galileo Master Certificate from The Renewable Energy Institute for Renewable Energy Management and Finance, Hydrogen Energy. He is an entrepreneurial senior executive with over two decades of experience in multinational companies like Exide Industries, The BOC Group, and The Linde Group. Hobbies: Chess, Yoga, and Meditation Awards & Recognition: Awarded Scholar of Excellence (Gold Medalist) and Dean’s List holder in Post Graduate Program in Management for Senior Executives (PGPMAX), 2018-2019 batch at Indian School of Business (ISB), Hyderabad.","filter_flag":1}
{"title":"Dover Fueling Solutions Launches DX Promote Auto, a New Industry-Leading Managed Media Service - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RvdmVyLWZ1ZWxpbmctc29sdXRpb25zLWxhdW5jaGVzLWR4LXByb21vdGUtYXV0by1hLW5ldy1pbmR1c3RyeS1sZWFkaW5nLW1hbmFnZWQtbWVkaWEtc2VydmljZS0zMDE5NTYzNDQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RvdmVyLWZ1ZWxpbmctc29sdXRpb25zLWxhdW5jaGVzLWR4LXByb21vdGUtYXV0by1hLW5ldy1pbmR1c3RyeS1sZWFkaW5nLW1hbmFnZWQtbWVkaWEtc2VydmljZS0zMDE5NTYzNDQuaHRtbNIBAA?oc=5","id":"CBMilQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RvdmVyLWZ1ZWxpbmctc29sdXRpb25zLWxhdW5jaGVzLWR4LXByb21vdGUtYXV0by1hLW5ldy1pbmR1c3RyeS1sZWFkaW5nLW1hbmFnZWQtbWVkaWEtc2VydmljZS0zMDE5NTYzNDQuaHRtbNIBAA","guidislink":false,"published":"Fri, 13 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=286, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RvdmVyLWZ1ZWxpbmctc29sdXRpb25zLWxhdW5jaGVzLWR4LXByb21vdGUtYXV0by1hLW5ldy1pbmR1c3RyeS1sZWFkaW5nLW1hbmFnZWQtbWVkaWEtc2VydmljZS0zMDE5NTYzNDQuaHRtbNIBAA?oc=5\" target=\"_blank\">Dover Fueling Solutions Launches DX Promote Auto, a New Industry-Leading Managed Media Service<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Dover Fueling Solutions Launches DX Promote Auto, a New Industry-Leading Managed Media Service - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2RvdmVyLWZ1ZWxpbmctc29sdXRpb25zLWxhdW5jaGVzLWR4LXByb21vdGUtYXV0by1hLW5ldy1pbmR1c3RyeS1sZWFkaW5nLW1hbmFnZWQtbWVkaWEtc2VydmljZS0zMDE5NTYzNDQuaHRtbNIBAA?oc=5\" target=\"_blank\">Dover Fueling Solutions Launches DX Promote Auto, a New Industry-Leading Managed Media Service<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"DOWNERS GROVE, Ill., Oct. 13, 2023 \/PRNewswire\/ -- Dover Fueling Solutions (\"DFS\"), a part of Dover (NYSE: DOV) and a leading global provider of advanced customer-focused technologies, services and solutions in the fuel and convenience retail industries, today announced the launch of DX Promote® Auto, a new managed media service that provides retailers with state-of-the-art advertising content to display on the DFS Anthem UX® platform. The new service provides fueling and convenience retailers access to a dedicated team that creates and manages custom advertising, including short-form infotainment, national promotions and major oil content. These advertisements save retailers time, drive in-store foot traffic, increase sales and enhance the customer experience at the pump. \"Many of our small- and medium-sized business customers want media but lack the time and resources to create compelling and trusted content themselves,\" said Scott Negley, Senior Director, Product Management at Dover Fueling Solutions. \"This new offering lightens the load for retailers and improves their customers' experience. With the Anthem UX platform increasing sales for promoted items by 51%, we know that targeted media is a powerful tool. Now, it's about helping our customers create curated playlists and utilize this tool effectively to drive in-store foot traffic and boost bottom lines.\" To ensure retailers will be supplied with their preferred content on DX Promote Auto, DFS will provide a customer intake form for banner ads on a quarterly basis. This will allow retailers to select monthly content picks to ensure relevance and value. Retailers will also be able to personalize the content for their marketing needs, such as calls to action and price points. The DX Promote Auto managed media service includes: Short-form infotainment, engaging national advertisements and major oil promotions (when provided) Personalized retailer-selected banner ads with a call to action, scheduled by DFS (up to six per month) If there is no media selected for the quarter, DFS will play a default playlist that includes rotating engaging content Weather and traffic tabs provided by Google through DX Promote Auto A dedicated DFS team to manage the retailer's media DX Promote Auto on Anthem UX platform has rolled out at select fuel stations in the United States, with continued expansion planned for the near future. For more information, visit https:\/\/www.doverfuelingsolutions.com\/media-dx-promote. About Dover Fueling Solutions: Dover Fueling Solutions (DFS) is part of Dover Corporation and a leading provider of advanced energy dispensing equipment, electronic automation and payment systems, automatic tank gauging and subscription solutions to fueling and convenience retail customers worldwide. Comprised of brands Wayne Fueling Systems, Tokheim, OPW Fuel Management Systems, ClearView, ProGauge, Fairbanks, AvaLAN Networks and LIQAL, DFS is dedicated to offering a broad range of solutions that power vehicles, including conventional fuel and clean energy products that support gasoline, diesel, bio-diesel and ethanol as well as LNG, H2, LPG, CNG and EV chargers. Headquartered in Austin, TX, DFS has a strong global manufacturing and technology development presence, including facilities in Brazil, China, India, Italy, Poland, Belgium, the Netherlands, the United Kingdom and the United States. For more information about DFS, visit www.doverfuelingsolutions.com. About Dover: Dover is a diversified global manufacturer and solutions provider with annual revenue of over $8 billion. We deliver innovative equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services through five operating segments: Engineered Products, Clean Energy & Fueling, Imaging & Identification, Pumps & Process Solutions and Climate & Sustainability Technologies. Dover combines global scale with operational agility to lead the markets we serve. Recognized for our entrepreneurial approach for over 65 years, our team of over 25,000 employees takes an ownership mindset, collaborating with customers to redefine what's possible. Headquartered in Downers Grove, Illinois, Dover trades on the New York Stock Exchange under \"DOV.\" Additional information is available at dovercorporation.com . Dover Fueling Solutions Contact: Amy Cearley, Director of Global Marketing Communications (512) 484-4259 [email protected] Dover Media Contact: Adrian Sakowicz, VP, Communications (630) 743-5039 [email protected] Dover Investor Contact: Jack Dickens, Senior Director, Investor Relations (630) 743-2566 [email protected] SOURCE Dover","filter_flag":1}
{"title":"Empowering India's Renewable Energy Ambitions: Sungrow's 5-Year 'Make in India' Journey - Sunil Badesra, Country ... - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8xMC8yMy9lbXBvd2VyaW5nLWluZGlhcy1yZW5ld2FibGUtZW5lcmd5LWFtYml0aW9ucy1zdW5ncm93cy01LXllYXItbWFrZS1pbi1pbmRpYS1qb3VybmV5LXN1bmlsLWJhZGVzcmEtY291bnRyeS1oZWFkLXN1bmdyb3ctaW5kaWEv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8xMC8yMy9lbXBvd2VyaW5nLWluZGlhcy1yZW5ld2FibGUtZW5lcmd5LWFtYml0aW9ucy1zdW5ncm93cy01LXllYXItbWFrZS1pbi1pbmRpYS1qb3VybmV5LXN1bmlsLWJhZGVzcmEtY291bnRyeS1oZWFkLXN1bmdyb3ctaW5kaWEv0gEA?oc=5","id":"CBMioAFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8xMC8yMy9lbXBvd2VyaW5nLWluZGlhcy1yZW5ld2FibGUtZW5lcmd5LWFtYml0aW9ucy1zdW5ncm93cy01LXllYXItbWFrZS1pbi1pbmRpYS1qb3VybmV5LXN1bmlsLWJhZGVzcmEtY291bnRyeS1oZWFkLXN1bmdyb3ctaW5kaWEv0gEA","guidislink":false,"published":"Mon, 23 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=296, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8xMC8yMy9lbXBvd2VyaW5nLWluZGlhcy1yZW5ld2FibGUtZW5lcmd5LWFtYml0aW9ucy1zdW5ncm93cy01LXllYXItbWFrZS1pbi1pbmRpYS1qb3VybmV5LXN1bmlsLWJhZGVzcmEtY291bnRyeS1oZWFkLXN1bmdyb3ctaW5kaWEv0gEA?oc=5\" target=\"_blank\">Empowering India's Renewable Energy Ambitions: Sungrow's 5-Year 'Make in India' Journey - Sunil Badesra, Country ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Empowering India's Renewable Energy Ambitions: Sungrow's 5-Year 'Make in India' Journey - Sunil Badesra, Country ... - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMioAFodHRwczovL3NvbGFycXVhcnRlci5jb20vMjAyMy8xMC8yMy9lbXBvd2VyaW5nLWluZGlhcy1yZW5ld2FibGUtZW5lcmd5LWFtYml0aW9ucy1zdW5ncm93cy01LXllYXItbWFrZS1pbi1pbmRpYS1qb3VybmV5LXN1bmlsLWJhZGVzcmEtY291bnRyeS1oZWFkLXN1bmdyb3ctaW5kaWEv0gEA?oc=5\" target=\"_blank\">Empowering India's Renewable Energy Ambitions: Sungrow's 5-Year 'Make in India' Journey - Sunil Badesra, Country ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Q1. How has the ‘Make in India’ initiative contributed to boosting the recognition and growth of India’s energy storage sector, especially in the context of Sungrow’s 5-year manufacturing journey as a provider of solar inverters and energy storage systems? Ans: Sungrow’s achievement of completing 5 years of Indian manufacturing underscores the positive impact of their participation in the “Make in India” initiative. This participation has not only fueled their own growth but has also played a significant role in advancing India’s broader renewable energy and energy storage goals. By manufacturing solar inverters locally, Sungrow has been able to address the specific requirements of the Indian market more effectively and contribute to the nation’s transition to clean and sustainable energy sources. The expansion of domestic manufacturing has created job opportunities within the energy storage sector, benefiting the local workforce and fostering economic development. Furthermore, domestic manufacturing has provided the flexibility to customize products to suit local needs and conditions. As India seeks to expand its renewable energy capacity, having a robust domestic manufacturing base for energy storage systems remains crucial. Q2. What can we expect Sungrow to unveil in terms of product launches for the Indian market during REI Expo 2023? Ans: REI Expo has consistently been a leading platform in India, and Sungrow is poised to introduce our latest innovative products to the Indian market. We are particularly thrilled to unveil our new residential on-grid and hybrid solutions. We eagerly look forward to showcasing these pioneering products at REI Expo 2023 and engaging in in-depth discussions with industry experts. We remain confident that Sungrow’s dedication to delivering clean energy solutions will continue to play a central role in promoting the widespread adoption of renewable energy technologies throughout India. Q3. How crucial is research and development (R&D) in the realm of solar inverter manufacturing, and what efforts has Sungrow undertaken to promote R&D in this field? Ans: Founded in 1997 under the visionary leadership of University Professor Cao Renxian, Sungrow has firmly solidified its position as a global leader in the solar inverter field. Our journey has been marked by our unwavering dedication to research and development, and we take pride in having the industry’s largest dedicated R&D team. Our diverse product portfolio encompasses PV inverter solutions and energy storage systems, serving utility-scale, commercial & industrial, and residential applications. Furthermore, we have gained international recognition for our innovative floating PV plant solutions and a range of other clean energy solutions. With an impressive 25-year track record in the PV industry, Sungrow’s products currently drive installations in over 150 countries. Our commitment to innovation is exemplified by our dynamic technical R&D team, comprising more than 2600 skilled professionals. Additionally, our dedication to quality and reliability is evident through our state-of-the-art in-house testing center, which holds certifications from esteemed certifying bodies like SGS, CSA, and TÜV Rheinland. Q4. Could you provide insights into Sungrow’s current market presence and its strategies for expansion? Ans: Sungrow has been actively engaged in India’s burgeoning solar energy sector, aligning with the nation’s ambitious renewable energy objectives. The global solar energy sector witnessed remarkable growth in 2022, with over 268 GW of installations, underscoring the cost-effectiveness and environmental advantages of solar power. Projections for 2023 indicate sustained expansion, with the global market expected to surpass 315 GW, while in India, it is poised to exceed 15 GW. Sungrow stands prepared and well-equipped to provide the latest technology solutions for the PV industry, boasting an extensive and appealing portfolio tailored for both utility-scale and commercial & industrial, as well as residential applications. It’s noteworthy that Sungrow, within the renewable energy sector, remains agile and responsive to evolving global standards and market dynamics. Q5. Sungrow recently achieved certification according to the European standard EN 50549-10. Can you describe the company’s approach to meeting global standards and ensuring the quality of its products for the international market? Ans: To align with global standards, companies like Sungrow diligently monitor and adhere to industry-specific regulations and certifications, including IEC (International Electrotechnical Commission) standards, UL (Underwriters Laboratories) standards, and regional certifications like EN standards in Europe. Sungrow recently achieved the European standard EN 50549-10 certification from TÜV Rheinland, marking a significant milestone as the first certification for MW-grade high-power energy storage systems (ESS) compatibility in the energy storage industry. This certification serves as a testament to the outstanding adaptability and reliability of Sungrow’s ESS, solidifying the company’s leading position in grid-connection technology. The continued success of Sungrow’s products is further underscored by its four-year streak as the most bankable inverter brand in the BloombergNEF (BNEF) PV Module and Inverter Bankability Survey. Notably, Sungrow is the sole inverter supplier to achieve a “100% bankable” ranking this year. Q6. Sungrow is renowned for aligning its products with technological advancements. Could you please spotlight some of the new technologies that the company has integrated into its offerings? Ans: Sungrow is indeed renowned for its commitment to integrating cutting-edge technologies into its products, maintaining a prominent position in the solar inverter and energy storage industry. One of its most groundbreaking innovations, introduced last year under the name “1+X modular inverter,” continues to receive widespread acclaim. This innovative solution effectively combines the efficiency benefits of string and central inverters, optimizing operational expenditures (OPEX) exceptionally well, particularly within the 8.8 MW range and below. Looking ahead, Sungrow remains steadfast in its mission of “Clean power for all.” The company will accelerate the development of clean energy power generation system integration, leveraging its expertise in new energy equipment. It also aims to foster innovation and expand its presence in the realm of clean power conversion technology. By maintaining close engagement with customers, actively participating in global competition, and striving for excellence, Sungrow is committed to establishing itself as a respected world-class company. Q7. In your view, how does technology play a pivotal role in transforming the energy storage sector, and what sorts of market trends do you anticipate in the near future? Ans: Technology plays a pivotal role in driving transformative changes within the energy storage sector. Advanced battery technologies, such as LFP, are gaining substantial traction in India’s energy storage landscape. These technologies offer heightened energy density, extended cycle life, and rapid response capabilities, rendering them well-suited for a diverse range of applications, including grid stabilization and the seamless integration of renewable energy sources. Energy storage technologies assume a critical role in mitigating the inherent variability of renewable sources like solar and wind. Battery storage systems excel in capturing surplus energy during periods of high generation and releasing it during peak demand, enhancing grid reliability. The growth of the energy storage market in India hinges significantly on government initiatives and the imperative for grid stability. As technology continues to advance and economies of scale come into play, the cost of energy storage systems, particularly batteries, is expected to decrease consistently. This trend will make these solutions more accessible and cost-effective. Moreover, energy storage systems are poised to provide essential grid ancillary services, encompassing frequency regulation, voltage support, and swift responses to grid events, further elevating grid reliability. The surge in electric vehicle (EV) sales in India is anticipated to further drive the demand for energy storage solutions. Like this: Like Loading...","filter_flag":1}
{"title":"Lindsay Precast Announces the Launch of Lindsay Renewables - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbGluZHNheS1wcmVjYXN0LWFubm91bmNlcy10aGUtbGF1bmNoLW9mLWxpbmRzYXktcmVuZXdhYmxlcy0zMDE5NDY1NzQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbGluZHNheS1wcmVjYXN0LWFubm91bmNlcy10aGUtbGF1bmNoLW9mLWxpbmRzYXktcmVuZXdhYmxlcy0zMDE5NDY1NzQuaHRtbNIBAA?oc=5","id":"CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbGluZHNheS1wcmVjYXN0LWFubm91bmNlcy10aGUtbGF1bmNoLW9mLWxpbmRzYXktcmVuZXdhYmxlcy0zMDE5NDY1NzQuaHRtbNIBAA","guidislink":false,"published":"Wed, 04 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=4, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=277, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbGluZHNheS1wcmVjYXN0LWFubm91bmNlcy10aGUtbGF1bmNoLW9mLWxpbmRzYXktcmVuZXdhYmxlcy0zMDE5NDY1NzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Lindsay Precast Announces the Launch of Lindsay Renewables<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Lindsay Precast Announces the Launch of Lindsay Renewables - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbGluZHNheS1wcmVjYXN0LWFubm91bmNlcy10aGUtbGF1bmNoLW9mLWxpbmRzYXktcmVuZXdhYmxlcy0zMDE5NDY1NzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Lindsay Precast Announces the Launch of Lindsay Renewables<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"The new division reflects the company's decades of leadership in clean energy solutions CANAL FULTON, Ohio, Oct. 4, 2023 \/PRNewswire\/ -- Lindsay Precast, a full-service designer, integrator, and prefabricator of engineered steel and precast concrete structures for renewables, electrical, utility, transportation, water\/wastewater and government end markets, announces the launch of its new division, Lindsay Renewables. The company has more than 20 years of experience in the renewable space, and the Lindsay Renewables division will build on its longstanding industry leadership while providing strategic alignment across its clean energy products and solutions. The Lindsay Precast staff and team responsible for its renewables products will continue operations under the Lindsay Renewables (LR) moniker, providing a seamless transition and uninterrupted service for customers. Lindsay Precast Announces the Launch of Lindsay Renewables \"As market demand for our renewables' products and expertise continues to grow, consolidating our capabilities in a new division allows us to streamline operations and accommodate future expansion,\" says Ron Lindsay, Chief Executive Officer of Lindsay Precast. \"We're thrilled to unify the clean energy solutions we've built over the decades under the Lindsay Renewables name.\" LR's product set includes Battery Energy Storage Systems (BESS) container integration, prefabricated skid mounted solutions, charging platforms for electric vehicles, solar ballasts for landfill applications, and substation equipment foundations within the utility and commercial and industrial (C & I) markets. In its more than 60 years in business, Lindsay Precast has acquired more than 10 million square feet of storage capacity, has deployed over 15 gigawatts of skid-mounted solutions, and provided hundreds of megawatts of solar ballasts. The LR division will leverage Lindsay Precast's nine nationwide locations and operate as a full service integrator, offering design and prefabrication support through a project's entire lifecycle. Lindsay Precast was acquired in 2021 by MiddleGround Capital, an operationally focused private equity firm that makes control investments in North American middle market B2B industrial and specialty distribution companies. In turn, Middleground acquired Dutchland Inc. (Dutchland), a leading manufacturer and installer of precast concrete tanks across the Biogas, mine reclamation, water and wastewater treatment market, in 2022. Dutchland operates on the Lindsay Precast platform, and provides additional breadth to the company's services. \"As the U.S. moves toward clean energy targets while simultaneously managing aging legacy infrastructure, Lindsay Precast offers highly engineered product solutions that support renewable energy transitions and bolster national infrastructure systems,\" says Lauren Mulholland, MiddleGround Founding Partner. \"Aligning the company's core capabilities within Lindsay Renewables positions the company for continued growth, and on a larger scale, allows it to provide even greater contributions to the energy needs of the future.\" Lindsay Precast Media Contact Joan Tesla 14127136886 [email protected] About Lindsay Precast Lindsay Precast is a premier concrete manufacturer and steel structure fabricator specializing in precast concrete products for state and municipal government entities, banks, utility companies, renewable energy companies and the US military. The company is headquartered in Canal Fulton, OH and has over 350 employees across 9 facilities located in OH, CO, FL, NC, and SC. For more information, please visit: https:\/\/lindsayprecast.com\/ About Dutchland Incorporated Dutchland, Inc. designs and builds advanced concrete structures for the biogas, mine reclamation, water and wastewater treatment industries Headquartered in Gap, PA, and established in 1969, Dutchland employs roughly 140 employees. For more information, please visit: https:\/\/dutchlandinc.com\/ About MiddleGround Capital MiddleGround Capital is a private equity firm based in Lexington, KY with over $3.4 billion of Assets Under Management. MiddleGround makes control equity investments in middle market B2B industrial and specialty distribution businesses. MiddleGround works with its portfolio companies to create value through a hands-on operational approach and partners with its management teams to support long-term growth strategies. For more information, please visit: https:\/\/middleground.com\/. SOURCE Lindsay Precast","filter_flag":1}
{"title":"Global green automotive tech company Autel makes presence felt at Automechanika Dubai - Gulf News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL2d1bGZuZXdzLmNvbS9idXNpbmVzcy9nbG9iYWwtZ3JlZW4tYXV0b21vdGl2ZS10ZWNoLWNvbXBhbnktYXV0ZWwtbWFrZXMtcHJlc2VuY2UtZmVsdC1hdC1hdXRvbWVjaGFuaWthLWR1YmFpLTEuMTY5Njg0Njc3NTQ3MtIBhwFodHRwczovL2d1bGZuZXdzLmNvbS9hbXAvYnVzaW5lc3MvZ2xvYmFsLWdyZWVuLWF1dG9tb3RpdmUtdGVjaC1jb21wYW55LWF1dGVsLW1ha2VzLXByZXNlbmNlLWZlbHQtYXQtYXV0b21lY2hhbmlrYS1kdWJhaS0xLjE2OTY4NDY3NzU0NzI?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL2d1bGZuZXdzLmNvbS9idXNpbmVzcy9nbG9iYWwtZ3JlZW4tYXV0b21vdGl2ZS10ZWNoLWNvbXBhbnktYXV0ZWwtbWFrZXMtcHJlc2VuY2UtZmVsdC1hdC1hdXRvbWVjaGFuaWthLWR1YmFpLTEuMTY5Njg0Njc3NTQ3MtIBhwFodHRwczovL2d1bGZuZXdzLmNvbS9hbXAvYnVzaW5lc3MvZ2xvYmFsLWdyZWVuLWF1dG9tb3RpdmUtdGVjaC1jb21wYW55LWF1dGVsLW1ha2VzLXByZXNlbmNlLWZlbHQtYXQtYXV0b21lY2hhbmlrYS1kdWJhaS0xLjE2OTY4NDY3NzU0NzI?oc=5","id":"CBMigwFodHRwczovL2d1bGZuZXdzLmNvbS9idXNpbmVzcy9nbG9iYWwtZ3JlZW4tYXV0b21vdGl2ZS10ZWNoLWNvbXBhbnktYXV0ZWwtbWFrZXMtcHJlc2VuY2UtZmVsdC1hdC1hdXRvbWVjaGFuaWthLWR1YmFpLTEuMTY5Njg0Njc3NTQ3MtIBhwFodHRwczovL2d1bGZuZXdzLmNvbS9hbXAvYnVzaW5lc3MvZ2xvYmFsLWdyZWVuLWF1dG9tb3RpdmUtdGVjaC1jb21wYW55LWF1dGVsLW1ha2VzLXByZXNlbmNlLWZlbHQtYXQtYXV0b21lY2hhbmlrYS1kdWJhaS0xLjE2OTY4NDY3NzU0NzI","guidislink":false,"published":"Mon, 09 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=9, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=282, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL2d1bGZuZXdzLmNvbS9idXNpbmVzcy9nbG9iYWwtZ3JlZW4tYXV0b21vdGl2ZS10ZWNoLWNvbXBhbnktYXV0ZWwtbWFrZXMtcHJlc2VuY2UtZmVsdC1hdC1hdXRvbWVjaGFuaWthLWR1YmFpLTEuMTY5Njg0Njc3NTQ3MtIBhwFodHRwczovL2d1bGZuZXdzLmNvbS9hbXAvYnVzaW5lc3MvZ2xvYmFsLWdyZWVuLWF1dG9tb3RpdmUtdGVjaC1jb21wYW55LWF1dGVsLW1ha2VzLXByZXNlbmNlLWZlbHQtYXQtYXV0b21lY2hhbmlrYS1kdWJhaS0xLjE2OTY4NDY3NzU0NzI?oc=5\" target=\"_blank\">Global green automotive tech company Autel makes presence felt at Automechanika Dubai<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global green automotive tech company Autel makes presence felt at Automechanika Dubai - Gulf News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMigwFodHRwczovL2d1bGZuZXdzLmNvbS9idXNpbmVzcy9nbG9iYWwtZ3JlZW4tYXV0b21vdGl2ZS10ZWNoLWNvbXBhbnktYXV0ZWwtbWFrZXMtcHJlc2VuY2UtZmVsdC1hdC1hdXRvbWVjaGFuaWthLWR1YmFpLTEuMTY5Njg0Njc3NTQ3MtIBhwFodHRwczovL2d1bGZuZXdzLmNvbS9hbXAvYnVzaW5lc3MvZ2xvYmFsLWdyZWVuLWF1dG9tb3RpdmUtdGVjaC1jb21wYW55LWF1dGVsLW1ha2VzLXByZXNlbmNlLWZlbHQtYXQtYXV0b21lY2hhbmlrYS1kdWJhaS0xLjE2OTY4NDY3NzU0NzI?oc=5\" target=\"_blank\">Global green automotive tech company Autel makes presence felt at Automechanika Dubai<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Gulf News<\/font>","source.href":"https:\/\/gulfnews.com","source.title":"Gulf News","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"Presence at Automechanika The well designed Autel booth at the entrance of Hall 1, during Automechanika Dubai, which ran from October 2 to 4, hosted at the Dubai World Trade Center. Image Credit: Anas Thacharpadikkal\/Gulf News Automechanika Dubai is one of the biggest international trade exhibition for the automotive aftermarket and service industry in the wider Middle East. It ran from October 2 to 4, hosted at the Dubai World Trade Center. One of the key participants was Autel, with their well-structured booth in Hall 1. The company specialises in research and development, production, sales and service of automotive intelligent products. These products include electric vehicle intelligent charging solutions, intelligent diagnostics and testing products, TPMS products, ADAS products, as well as related software cloud solutions. Over the years, Autel’s products and services have reached more than 70 countries and regions, including North America, Europe, Asia-Pacific, Latin America and IMEA (India, Middle East and Africa). Clients’ feedback \"Autel is about solutions – this is why we chose Autel,\" says Salim Achahbar, who has been working with Autel for 17 years. The 37-year-old entrepreneur’s company, autologic, is the official distributor of Autel in Morocco. Image Credit: Anas Thacharpadikkal\/Gulf News Salim Achahbar has been working with Autel for 17 years. The 37-year-old entrepreneur’s company, autologic, is the official distributor of Autel in Morocco. “We sell a wide range of products including diagnostic tools and keys programing. However, we started with the basics, things like electronics and mechanical parts in vehicles. Over the years, we’ve grown rapidly with Autel.” When asked about the reason for choosing to collaborate with Autel, Achahbar said, “Our core mission is not just selling tools and parts – essentially, we sell solutions to our customers. In addition, Autel is about solutions – this is why we chose Autel. Many years of experience in the industry has taught us that our journey with customers doesn’t stop at the point where they have purchased our products. They need solutions, even after purchasing our products. We are there for our customers, and Autel is there for us. “Utilising their robust knowledge, Autel has guided us through various questions and customer inquiries. These questions and inquiries can come in different forms. In these times of needs, Autel’s support is critical. And so far, they’ve been offering us great guidance on tackling these issues daily, despite the time differences.” A firm believer in a sustainable future, Autel has been at the forefront of green initiatives, technological advancements, and eco-friendly development. Its UAE branch is working, primarily focused on the country’s drive to promote clean energy solutions. Kemin Zuo, AUTEL IMEA DMCC General Manager Image Credit: Anas Thacharpadikkal\/Gulf News The future: Digital energy In recent years, Autel has been focusing on developing new products in the ‘digital energy’ space. This is a system or process wherein there is constant feedback between the consumer and energy supplier, which will help in a smarter and more sustainable way of utilizing energy. An area that Autel is pushing digital energy development in is in the field of electric vehicles (EV), especially with reference to repair, maintenance, charging, solar energy, and energy storage. The company’s core technologies are now being implemented in EV diagnostic devices, EV charging units, charge point operator cloud platform, solar energy and energy storage solutions. It is pushing for an integrated energy ecosystem in a rapidly expanding EV industry. As Achahbar said, “The automobile industry is undergoing significantly innovative changes. There is a shift to EV. We are upgrading our information with Autel to be in the present, and in the future of the automobile industry. For us, Autel is the best company to work with, for all automobile brands in terms of diagnostic, keys programing, and other tools such as battery, and TPMS (tire-pressure monitoring system) sensors. We chose Autel for the common passion we have for innovation in the automobile industry. “After careful consideration, we chose to collaborate with Autel. Several factors from Autel align with our vision and values. Firstly, we were impressed with Autel’s reputation and record of accomplishment within the industry. The company has a global presence and is renowned for providing durable, reliable, and innovative charging solutions and requirements that both our company and our customers value highly,\" says Alok Dayanand, senior product engineer at Dubai-based company Admiral Energy, which has been working with Autel for the past year, since 2022. Image Credit: Anas Thacharpadikkal\/Gulf News Alok Dayanand, senior product engineer at Dubai-based company Admiral Energy, said that they have been working with Autel for the past year, since 2022. The firm is involved in the design, development, and management of customised, comprehensive charging ecosystems for deployment of fleet solutions, related to clean mobility. “After careful consideration, we chose to collaborate with Autel. Several factors from Autel align with our vision and values. Firstly, we were impressed with Autel’s reputation and record of accomplishment within the industry. The company has a global presence and is renowned for providing durable, reliable, and innovative charging solutions and requirements that both our company and our customers value highly. “Autel’s commitment to delivering high-quality charging solutions and exceptional customer service stood out from the competition. The partnership has enabled us to offer customers a seamless experience, ensuring that they have access to reliable and efficient charging infrastructure when they bring electric vehicles into their fleet.” The ‘green’ Autel booth was swamped with visitors and partners visiting, during the three-day Automechanika Dubai event. Image Credit: Anas Thacharpadikkal\/Gulf news In fact, one of the challenges Dayanand’s firm faced with deploying EV chargers was the availability of power in a range of locations, along with adjusting to the summer temperature. “However, with Autel’s broad range of charger sizes, we have been able to deploy DC (direct current) chargers of lower power to our customers. In addition, Autel’s IP54 rating and high operating temperature have performed exceptionally even during peak summer time. “The demand for EV charging stations in the UAE is high, especially under the country’s plan to expand its EV charging infrastructure. Autel’s EV chargers will continue to support our journey towards carbon neutrality.” What is IP54 rating? According to electricalcounter.co.uk, “An IP54 rating means that your product will be protected against contamination from limited amounts of dust and other particles. Additionally, you can be confident that it will be protected from water sprays from all directions.” An evening celebrating progress, partners and achievements On October 2, Autel extended their gratitude to its global partners by inviting them to a dinner and awards event. At 8pm, Dubai-based Address Sky View Hotel ballroom was filled with laughter and conversation over dinner tables, while several awards were given to honour Autel’s global partners. The event also featured several rounds of raffle draws. Dina Haddad, business development director at Markazia Group, which is the distributor of Toyota, Lexus, Hino and other automotive brands in Jordan, who attended the event, said, “Our partnership with Autel started in the first half of 2023, when we became Autel's official partner in Jordan. In the process of searching for EV Charger suppliers, we focused on three elements: quality, price, and strong technical support. Autel fulfiled all these three elements. “Their wide range of EV Charger options, continuous development of new products, as well as competitive price, helps us to serve a wider audience. Not to mention the training and hands-on technical support Autels’ regional office provided to us. Their approach to listen to customers and their ability to adapt to changes are truly laudable. “Countries around the world are setting ambitious objectives to transition themselves to EVs as part of their green initiatives. There is no doubt that EV is the future. In Jordan, this year alone, 40 per cent of newly registered vehicles are EV. To be able to cope with this transition, the infrastructure must be readily available to EV customers, and we are driven to provide that readiness. “We are very happy to be part of today’s partner event, it helps us to network, get to know the partners in the region, share ideas and learn from each other’s’ experiences.” Dina Haddad, business development director at Markazia Group, which is the distributor of Toyota, Lexus, Hino and other automotive brands in Jordan, who attended the event, said, “Our partnership with Autel started in the first half of 2023, when we became Autel's official partner in Jordan.\" Image Credit: Anas Thacharpadikkal\/Gulf News To Achahbar, Autel’s partner event is more like a “family event”. “As dealers, we have information on what our customers need, so we give feedback to Autel and they in turn develop relevant products for us. This type of event offers the opportunity to meet with the Autel team face to face, it bonds us like a family.” “We are excited to hear Autel’s plans and initiatives for the region and discuss new products with the team. It’s an event that is truly appreciated,” Dayanand concluded. A partner event is a valuable platform to align our customers and partners with Autel's future plans and goals. We had good communication and built better trust. The event also served as a platform for receiving valuable feedback from our partners. Their insights can help fine-tune our plans and strategies. - Kemin Zuo, regional director of AUTEL IMEA DMCC A sentiment reiterated by Kemin Zuo, regional director of AUTEL IMEA DMCC, “I've been with Autel since June 2016. With over seven years of experience at Autel, I have had the opportunity to witness and contribute to the company's growth and development. Autel is dedicated to the field of new energy and EV (Electric Vehicle) charging, striving to contribute to achieving carbon neutrality and making the Earth more environmentally friendly and healthier. “In the EV charging field, we have customers from more than 40 countries already, including OEMs, Fleet, Charging Points Operators, etc. The winner partners. Image Credit: Anas Thacharpadikkal\/Gulf News “A partner event is a valuable platform to align our customers and partners with Autel's future plans and goals. We had good communication and built better trust. The event also served as a platform for receiving valuable feedback from our partners. Their insights can help fine-tune our plans and strategies.","filter_flag":1}
{"title":"TWG Launches New Electric Winch - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHdnLWxhdW5jaGVzLW5ldy1lbGVjdHJpYy13aW5jaC0zMDE5NjA4MzYuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHdnLWxhdW5jaGVzLW5ldy1lbGVjdHJpYy13aW5jaC0zMDE5NjA4MzYuaHRtbNIBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHdnLWxhdW5jaGVzLW5ldy1lbGVjdHJpYy13aW5jaC0zMDE5NjA4MzYuaHRtbNIBAA","guidislink":false,"published":"Wed, 18 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=291, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHdnLWxhdW5jaGVzLW5ldy1lbGVjdHJpYy13aW5jaC0zMDE5NjA4MzYuaHRtbNIBAA?oc=5\" target=\"_blank\">TWG Launches New Electric Winch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TWG Launches New Electric Winch - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvdHdnLWxhdW5jaGVzLW5ldy1lbGVjdHJpYy13aW5jaC0zMDE5NjA4MzYuaHRtbNIBAA?oc=5\" target=\"_blank\">TWG Launches New Electric Winch<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Energy Solutions\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"DOWNERS GROVE, Ill., Oct. 18, 2023 \/PRNewswire\/ -- TWG, part of Dover (NYSE: DOV), today announced the launch of the dp EL22 Electric Winch with a 22,000 lb rated line-pull. The EL22 delivers an industrial-grade, high-performance DC electric winch, differentiating itself from standard consumer-grade electric winches. \"As the industry embraces the shift toward electric options, TWG is leading the way in electric winch innovation,\" said Arjun Mirdha, President of TWG. \"Now, our customers can go electric without giving up the power from dp Winch. The EL22 delivers.\" The EL22 features a military-proven, high-efficiency, 4-stage planetary geartrain for rugged durability and optimal performance. The DC motor's impressive torque delivers up to 3x longer duty cycle than the competition. The EL22's entire electrical package is weather-resistant to deliver long-lasting reliability in the harshest conditions. Consistent with dp Winch's field-proven reputation, other standout features include an automatic brake for steady load-holding and a single-handed kickout that frees the spool with positive handle engagement for easier operation. Mirdha continued, \"We've taken electric to a new level, building on the best-in-class reliability, durability, and total cost of ownership of our proven light-duty winches.\" The new industrial and military variant EL22 Electric Winch is manufactured and tested to SAE J706 standards and rated for EN 14492. The industrial winch will be available in 24V or 12V versions through dp Winch distributors. A military variant is available from TWG. For additional information, please visit dovertwg.com. About TWG: TWG is a leading manufacturer of winches, hoists, slewing ring bearings, gear drives, hydraulic pump drives, electronic monitoring systems and more. We offer a vast range of products across seven model lines: dp Winch, Gear Products, Greer Company, LANTEC, Pullmaster, Tulsa Winch and RUFNEK-with over one million units installed. To learn more about TWG, visit dovertwg.com. About Dover: Dover is a diversified global manufacturer and solutions provider with annual revenue of over $8 billion. We deliver innovative equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services through five operating segments: Engineered Products, Clean Energy & Fueling, Imaging & Identification, Pumps & Process Solutions and Climate & Sustainability Technologies. Dover combines global scale with operational agility to lead the markets we serve. Recognized for our entrepreneurial approach for over 65 years, our team of over 25,000 employees takes an ownership mindset, collaborating with customers to redefine what's possible. Headquartered in Downers Grove, Illinois, Dover trades on the New York Stock Exchange under \"DOV.\" Additional information is available at dovercorporation.com . TWG Contact: Mark Siebert (918) 518-6964 [email protected] Dover Media Contact: Adrian Sakowicz, VP, Communications (630) 743-5039 [email protected] Dover Investor Contact: Jack Dickens, Senior Director, Investor Relations (630) 743-2566 [email protected] SOURCE Dover","filter_flag":1}
