{"title":"Green supply chain management, risk-taking, and corporate value—Dual regulation effect based on technological ... - Frontiers","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjM0OdIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjM0OdIBAA?oc=5","id":"CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjM0OdIBAA","guidislink":false,"published":"Fri, 27 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=27, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjM0OdIBAA?oc=5\" target=\"_blank\">Green supply chain management, risk-taking, and corporate value—Dual regulation effect based on technological ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Green supply chain management, risk-taking, and corporate value—Dual regulation effect based on technological ... - Frontiers","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiP2h0dHBzOi8vd3d3LmZyb250aWVyc2luLm9yZy9hcnRpY2xlcy8xMC4zMzg5L2ZlbnZzLjIwMjMuMTA5NjM0OdIBAA?oc=5\" target=\"_blank\">Green supply chain management, risk-taking, and corporate value—Dual regulation effect based on technological ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Frontiers<\/font>","source.href":"https:\/\/www.frontiersin.org","source.title":"Frontiers","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"With the promotion of carbon-peak and carbon-neutral strategies and the increase in green awareness, green development is gradually gaining attention, and the green supply chain management (GSCM) derived from traditional supply chain management is gradually becoming a path to promote green development. At the same time, enterprise, as an important source of pollution, how to consider social responsibility, such as environmental protection, in the process of ensuring efficiency improvement has become an important issue. To study the impact of green supply chain management on enterprise value and its path of action, this paper examines the impact of green supply chain management on enterprise value, explores the moderating effect of the risk-taking level, and further analyzes the dual moderating effect played by technological innovation capability and supply chain concentration. Based on the micro data of 131 Chinese listed enterprises from 2014 to 2021, a panel-regression model is used to illustrate how green supply chain management affects enterprise value, and the results show that: 1) green supply chain management can promote enterprise value; 2) the level of risk-taking strengthens the promoting effect of green supply chain management on enterprise value enhancement; and 3) the technological innovation capability negatively regulates the moderating effect of risk-taking, while the supply chain concentration positively regulates the moderating effect of risk-taking. The research results of this paper enrich the path of the effect of implementing of green supply chain management on enterprise value enhancement, i.e., the process of green supply chain management to enhance enterprise value is regulated by the level of enterprise risk-taking, while technological innovation capability and supply chain concentration will also regulate the level of enterprise risk-taking and thus promote enterprise value enhancement. This research not only extends the research perspective and enriches the existing research, but also provides a theoretical basis for enterprises to implement green supply chain management to promote value enhancement and improve the level of green supply chain management implementation and the green development of enterprises. 1 Introduction In the past forty decades, China’s industrialization has developed rapidly and achieved a leap from the early stage of industrialization to the late stage of industrialization and has become the world’s largest newly industrialized country and the second largest economy (Aslam et al., 2021), with achievements that have attracted worldwide attention. However, the problems of high emissions and pollution brought by economic development should not be underestimated (Chen, 2015). For example, air pollution due to PM2.5, soil pollution due to heavy metals and the continuous emission of carbon dioxide into the atmosphere during production and living activities have accelerated the process of global warming and caused a series of ecological problems and extreme weather (Mannucci and Franchini, 2017; Qin et al., 2021; An and Zhu, 2022), which not only affect human survival but also gradually affect the healthy economic development (Feng et al., 2021; Wei et al., 2023). In the context of the destruction of ecological environment, the continued impact of COVID-19, and the increasingly severe situation at home and abroad, China’s economic development is transforming from high-speed growth to green and high-quality growth, and enterprises are transforming from pursuing profits to pursuing benefits and how to achieve the coordinated development of economic capacity enhancement and ecological environmental protection has become an important issue (Sun et al., 2022). In October 2020, Xi Jinping proposed unswervingly implementing the concept of green development and follow the path of green development. In October 2022, Xi Jinping proposed to promote green development and the harmonious coexistence of humans and nature. In addition, various countries and organizations have been enacting laws and regulations to protect the ecological environment (Wang et al., 2018). For example, the signing of the Paris Climate Agreement and the implementation of China’s green credit policy (Zhang et al., 2022), carbon neutral strategy, carbon peak strategy, and Made in China 2025 (Xu, 2022). Because the concept of “green” is linked with “sustainability,” or “eco” (Ezuma et al., 2022), thus these assertions and regulations have led to the green development approach represented by green supply chains, sustainability transitions (Sarkis et al., 2020), corporate initiatives for environmental responsibility (Li et al., 2020; Liao et al., 2021; Li et al., 2022), etc., which has received wide attention from various social parties (Tseng et al., 2019; Becerra et al., 2021; Pal et al., 2023). This includes government, public (Baldini et al., 2018), investors, and competitors (Cao et al., 2019). Along with the increasing public awareness of environmental protection and the introduction of government laws and regulations, enterprises, as one of the main sources of environmental pollution and also an important pillar of economic development (Panigrahi et al., 2018), have to reduce pollutant emissions and enhance green development through sustainable transformation, green technological advancement, green supply chain management (GSCM) and other green development approaches (Abu Seman et al., 2019). GSCM is a comprehensive environmental management tool that has a greater potential to solve environmental problems, promote healthy business development of enterprises (Sheng et al., 2022), optimize resource efficiency and reduce environmental problems. The implementation of GSCM can lay the foundation for the development and realization of a green economy from a microscopic perspective, GSCM is becoming an inevitable choice to promote ecological civilization and solve environmental problems (Cao and Zhang, 2022). Therefore, in the context of the increasingly severe development situation of enterprises and the urgent need for green development, the creation of a green industrial chain and supply chain becomes a necessary condition for the improvement of enterprise competitiveness. But under what circumstances will companies proactively implement and operate well with GSCM as a strategy, what impact will the implementation of GSCM have on corporate value, and in what ways will that impact be realized? These questions are yet to be explored in depth. For example, we should recognize that in the development of business operation, the level of risk-taking is also an extremely important point that affects the business decision process, the level of corporate risk-taking refers to the ability or level of risk that a company can take in the course of its business, specifically including operational risk and financial risk, only when the level of risk-taking is high, enterprises will make decisions such as GSCM to promote value enhancement and at the same time, technological innovation capability (TIC) and supply chain concentration (SCC) will affect the level of risk taking. Specifically, TIC is a new technology or capability that is modified or developed by an enterprise to achieve a certain goal or meet the needs of a certain activity, especially at this stage of China’s economic transformation, the ability to innovate in technology is particularly important (Wang et al., 2021). The relationship between technology and economics has been the focus of much research (Liu et al., 2022a), many studies have mentioned that technological innovation activities have the characteristics of high investment and high risk (Lu et al., 2020; Liu et al., 2022b; Mao et al., 2022), and it is difficult to generate effective returns in the short term (Aghion et al., 2013), therefore, the higher the TIC, the more it can indicate the current technological innovation activities of the enterprise, the more it is not conducive to the stability of the enterprise’s capital, which will enhance the enterprise’s risk-taking level. SCC is an important indicator of the stability of the supply chain network in which an enterprise is located, including customer concentration and supplier concentration. The higher the concentration of the supply chain, the more stable the relationship between the enterprise and its suppliers and sellers, which to a certain extent can enhance the risk-taking level of the enterprise. Therefore, this paper will take the level of risk-taking of a company as a research perspective to explore how GSCM affects corporate value when the level of risk-taking of a company varies. The significance of this study is that, firstly, from the theoretical point of view, this study deepens the research on the impact of GSCM on enterprise value, and further enriches and expands the research on the impact of GSCM on enterprise value from the perspective of enterprises’ risk-taking level. Secondly, from the practical point of view, the research results of this paper can provide certain inspiration for enterprises to implement GSCM, and also to implement the green development approach represented by GSCM. Based on this, this research explores how GSCM affects firm value when firms have different levels of risk-taking, and helps firms to further understand and implement GSCM. Specifically, the contribution points of this paper, 1) using micro-firm data rather than data from questionnaires to argue for a facilitating effect of GSCM on firm value; 2) finding that the higher the level of corporate risk-taking, the more the implementation of GSCM can promote firm value; 3) the lower the TIC and the higher the SCC, the higher the level of risk-taking, the more significantly GSCM can influence the enhancement of firm value. The research in this paper helps to supplement the research on GSCM and enterprise value in depth and can further provide theoretical support and empirical evidence for the implementation of GSCM in enterprises. The remaining structure of this paper is organized as follows. Based on previous studies, Section 2 provides the literature review about GSCM. Section 3 presents a theoretical analysis and hypotheses on the impact of GSCM on firm value and its possible paths of action. Section 4 includes the models, data and their sources used in the paper. Section 5 empirically tests the direct, moderating and dual moderating effects of GSCM on firm value. Section 6 summarizes the paper’s research, and Section 7 discusses the policy recommendations. Finally, Section 8 points to future research directions. 2 Literature review 2.1 Supply chain management and green supply chain management Since the 21st century, competition has shifted from inter-organizational to inter-supply chain, and effective supply chain management practices have become a way to maintain a competitive advantage and improve business performance (Li et al., 2006). In the context of increasing economic globalization and the continued impact of the COVID-19, supply chain networks and their partnerships are facing many challenges and there is a risk of disruption (Wang and Yang, 2022). The outbreak, represented by COVID-19, has had a significant impact on all processes of each supply chain (Moosavi et al., 2022). As a result, we found that the traditional supply chain development model is more brittle and unable to meet the growing needs of companies (Sarkis et al., 2020). Since the traditional supply chain management ignores the negative impact that the supply chain may cause to the environment in the process of operation and optimization (Gurel et al., 2015), GSCM or Environmental Supply Chain Management (ESCM) is based on traditional supply chain management, and focuses more on the efficiency of resource utilization and the environmental impact of enterprises in the supply chain, including suppliers, manufacturers, sellers, and end customers (Rabbi et al., 2020; Li and Zhou, 2022). Rodríguez-González et al. (2022) explored the impact of circular economy on corporate financial performance and found that circular economy contributes to GSCM practices and thus to corporate financial performance. 2.2 Sustainable supply chain management With the increase of economic development, social progress and environmental protection awareness, the consideration of green sustainability and recyclability of supply chains in supply chain networks has gradually received wide attention from researchers. In order to achieve economic, social, and environmental sustainability, Panigrahi et al. (2018) provide a review and analysis of the theory of sustainable supply chains from economic, environmental and social perspectives. Salehi-Amiri et al. (2021) designed a sustainable closed-loop supply chain for the walnut industry. Yontar and Ersöz (2020) argue that the purpose of developing a green and sustainable supply chain is to provide, improve or enhance environmental and economic value for the various stakeholders in the chain. Zhu and Wu (2022) studied the impact of supply chain sustainability on supply chain performance, and found that supply chain sustainability can contribute to supply chain performance improvement, and supply chain sustainability plays a mediating role in the process of supply chain resilience affecting supply chain performance. Gholian-Jouybari et al. (2023) designed a sustainable supply chain for agri-food products by considering the concept of marketing. 2.3 Closed-loop supply chain and reverse logistics With economic, social and environmental influences, business operations and decision makers are also considering closed-loop supply chains. Compared to traditional supply chains, closed-loop supply chains have more advantages, such as considering both forward and backward logistics (reverse logistics) (Liao et al., 2020), controlling waste emissions in the logistics cycle, etc., which can reduce the environmental damage and negative impacts of companies’ supply chain activities (Chiu et al., 2021), it ensures that many industries are green and sustainable (Salehi-Amiri et al., 2021). Mirzagoltabar et al. (2021) proposed two new heuristic algorithms to study multi-objective dual-channel closed-loop supply chains considering the case of demand and price uncertainty and justified and tested them with the lighting industry. Asghari et al. (2022) studied the decision making problem of pricing and advertising in a closed-loop supply chain network. Xu et al. (2022b) incorporates overconfidence and competitive preferences into a closed-loop supply chain study and proposes a series of Stackelberg models with multiple dominant models, exploring how the chain of behavioural preferences jointly affects the pricing, profit, utility and social benefit decisions of both parties under different dominant models. Reverse logistics is not only part of the closed-loop supply chain, it is also one of the most important processes in the green supply chain management framework (Rao and Holt, 2005). Through recycling, reuse and waste reduction scarce resources can be used efficiently and pollutant emissions can be reduce. Richnák and Gubová (2021) provides practical recommendations for the development of green and reverse logistics in Slovakian companies based on summarising and sorting out the research on green and reverse logistics. Ma et al. (2022) studied the impact of blockchain technology plays a role in the process of product recovery and distribution. Li and Chen (2022) designed a reverse logistics network for third party logistics under uncertainty disruption based on a risk-averse model. Based on blockchain technology, Wu (2022) proposes a commodity traceability solution that can effectively reduce waste generation and can provide for the sustainable development of green reverse logistics. 2.4 Green supply chain management and enterprise value Enterprises are micro subjects of economic development, and important subjects of supply chain nodes. The role of GSCM in the development of enterprise operation is gradually becoming obvious. In the study of GSCM and firm value, Longoni and Cagliano (2018), Li et al. (2019), Ahmed et al. (2020) and Samad et al. (2021) concluded that GSCM can promote firm value. Min and Galle (2001) found that green procurement increases firms’ costs and inhibits improvement in their financial performance. Ni and Sun (2019) argued that GSCM might have a specific impact on firm value under certain conditions. To deeply explore the relationship between the two, Feng et al. (2018) and Abdallah and Al-Ghwayeen (2019) analyzed the mediating role played by environmental performance and operational performance in the process of GSCM affecting corporate financial performance. Zhang et al. (2019a) explored the role of social control in GSCM practices for corporate value enhancement based on social exchange theory. Sheu and Chen (2012) used a three-stage game theory model to analyze the role of government financial intervention in GSCM affecting firm value as a facilitator. Agyabeng-Mensah et al. (2020) argued that implementing green human resource management and supply chain environmental cooperation may contribute to the impact of internal GSCM practices on firm value. Fasan et al. (2021) studied the impact of the implementation of GSCM on the financial performance of companies in the context of the ongoing impact of the COVID-19, and he concluded that GSCM is there is an effective risk management tool that can buffer the COVID-19 adverse effects on firms. Salandri et al. (2022) studied the effect of green practices on operational performance when firms have different levels of agility and concluded that green practices, represented by green packaging, promote operational performance when firms are more agile. Wang and Li (2021) tested the effect of the institutional environment to positively regulate GSCM on firm value. Dong et al. (2021) empirically tested the differential impact of GSCM on clean technology innovation incentives of local and foreign firms from the perspective of firm identity. Xie and Zhu (2022) introduced dual knowledge search and green social capital to construct a third-order mediated adjustment model and explored the deep-rooted mechanism of the effect of GSCM practices on the relationship between green innovation and firm performance. In summary, there is a large amount of literature in the field of GSCM research. This includes perspectives on sustainable supply chains, closed-loop supply chains and reverse logistics, GSCM and others. Among the studies on GSCM and enterprise value, some literature clearly states that GSCM can enhance enterprise value, while others are vague. Most studies use questionnaires to obtain data on enterprise GSCM and do not use micro data to analyse the relationship between GSCM and enterprise value. In some of the studies there are articles that explore the relationship between the two in depth from the perspectives of social control, institutional environment and human resources, however, we found no relevant literature examining the value enhancement of GSCM to companies from the perspective of enterprises’ risk-taking level. Therefore, the purpose of this paper is: to explore the impact of the implementation of GSCM on enterprise value, and to analyze in depth how GSCM affects enterprise value when enterprises face different levels of risk from a risk perspective. And further explores how different TIC and SCC affect the level of corporate risk-taking to influence the enhancing effect of GSCM on corporate value enhancement. The main approach of this paper is: based on the data of 131 Chinese listed companies from 2014–2021, using panel regression, moderation and double moderation models, the role of enterprise implementation of GSCM on value enhancement is analyzed. It further analyzes how the level of risk-taking level faced by firms affects GSCM practices for corporate value when the level of risk-taking varies. It also analyzes how the implementation of GSCM by enterprises affects enterprise value when the impact of TIC and SCC on enterprise risk-taking level varies. 3 Theoretical analysis and research hypothesis 3.1 Theoretical analysis The core idea of supply chain management theory is the collaborative operation of the supply chain, that is, how to work with suppliers, sellers, manufacturers and other subjects to achieve reasonable utilization of limited resources. The implementation of supply chain management can form a dependency relationship between different enterprises, which can promote smoother information communication and more convenient collaboration among the node enterprises in the chain, reduce the occurrence of bullwhip effect and various additional costs caused by information asymmetry (Jain, 2022), thus reducing the business risk and improving the enterprise value. Stakeholder theory is a leading theoretical framework in sustainable economic and social development (Sajjad et al., 2020). It argues that no company can develop without the input and participation of various stakeholders (Dias et al., 2018). This coincides with the concept of supply chain management, which also emphasizes that the business situation of one enterprise in the chain is affected, and the business situation of other enterprises in the chain is also affected. Taking the core enterprise in the supply chain as an example, if the core enterprise has a stable relationship with its suppliers and sellers, it can better promote the development and economic interests of related enterprises. Risk management theory suggests that in a risky environment, firms identify, measure and analyze risks and proactively, choose the most effective way to reduce the impact of risks on business operations. For example, financial distress and technological innovation activities carried out by firms, because the development of technological innovation activities requires continuous investment of resources (Lu et al., 2020) and the external environment is constantly changing, which is very likely to cause an increase in business risks, so under certain circumstances, operators and decision makers will suspend technological innovation activities in order to avoid risks (Wang and Rao, 2021). 3.2 Research hypothesis 3.2.1 Direct effect Implementing GSCM by enterprises can enhance the value of enterprises. Specifically, 1) implementing GSCM can enhance the value of enterprises by reducing costs and improving resource utilization efficiency (Yildiz Çankaya and Sezen, 2018; Novitasari et al., 2022). Implementing of supply chain management affects the realization of the effective connection between supply and demand of each node enterprise in the supply chain, and the good operation of the supply chain can avoid information distortion (Neeley and Leonardi, 2018), reduce the inventory retention time (Andiappan et al., 2022), and reduce the frequency of the bullwhip effect (Xue et al., 2020), thus making more effective use of inventory resources and reducing transaction costs and inventory costs. Implementing GSCM means that the damage caused to the environment in the process of production, distribution, and even recycling is minimized (Ghobakhloo et al., 2013; Mohamed Abdul Ghani et al., 2017; Wang et al., 2020; Ali et al., 2022), which can minimize the cost of recycling and pollution reduction based on a traditional supply chain and thus enhance the value of enterprises (Karimi et al., 2021). 2) Implementing GSCM by enterprises can enhance corporate performance by improving corporate competitiveness. Meanwhile, the international community is paying increasing attention to the development of environmental protection, and various countries and regions have set green standards and requirements for import and export products. By implementing GSCM, local enterprises can integrate greening into the whole process of production and sales of goods, improve their corporate image, enhance the trust of suppliers and consumers, improve their market position and product competitiveness, and thus expand their market share and enhance their corporate value. 3) Implementing GSCM is important in promoting the green transformation of enterprises. Implementing GSCM enables enterprises to consider environmental and resource elements, coordinate the relationship between the environment and development, effectively solve increasingly serious environmental pollution and social problems, and meet the long-term interests of human development while satisfying economic development. Moreover, it is an important step that promotes the green transformation of enterprises and supports an ecological civilization and achieves the dual carbon goal (Agrawal et al., 2022). Based on the above analysis, this paper proposes the following: H1. Implementing GSCM by enterprises can promote value enhancement. 3.2.2 Indirect effect 3.2.2.1 The moderating effect of the risk-taking level The level of risk-taking is the ability of an enterprise to withstand the threat of potential losses in its production and business activities, reflecting the tendency of the enterprise to chase high profits and be able to pay a certain price for it. In terms of the financial crisis theory, if an enterprise only pursues high profits from projects, investments, and decisions without considering the level of risk it can bear, it undoubtedly exposes the enterprise’s capital flow to great uncertainty in the process of operation and increases the possibility of financial distress (Zhou and Zhao, 2021). Therefore, the financial situation and the level of risk-taking of the enterprise influence each other. Enterprises with a low probability of financial distress will have a high level of risk-taking, at this time, they intend to make strategic decisions such as GSCM. Additionally, when an enterprise implements GSCM, it will increase the economic cost, which to some extent will increase the probability of financial distress in the enterprises and thus reduce the level of risk-taking. Therefore, enterprises will be better served to conduct GSCM for value enhancement when the risk-taking level of enterprises is high. Based on the above analysis, this paper proposes the hypothesis that: H2. The risk-taking level has a positive moderating effect on the relationship between GSCM and enterprise value improvement. That is, in enterprises with high risk-taking ability, GSCM has a more significant impact on the improvement in enterprise value. 3.2.2.2 The impact of TIC on corporate risk-taking level Technological innovation can inhibit the level of risk-taking. Many studies have mentioned that technological innovation is characterized by high risk and high levels of investment, which may introduce huge operational and financial risks to enterprises (Lu et al., 2020; Mao et al., 2022). Especially in the case of an uncertain external business environment and complex technological innovation, firms will avoid technological innovation as much as possible to reduce the operational risk (Wang and Rao, 2021). At the same time, technological innovation requires continuous capital injection, and the investment experiences difficulty generating good returns in the short term (Aghion et al., 2013), which can exacerbate financial distress and thus affect the level of risk-taking. Based on this, this paper proposes the following hypothesis: H2a. TIC affects the level of corporate risk-taking and thus affects the impact of GSCM on improving corporate value. That is to say, the lower the TIC of enterprises, the smaller the probability of financial distress, which can promote the level of corporate risk-taking, thereby significantly affecting the relationship between GSCM and enterprise value. 3.2.2.3 The impact of SCC on enterprise risk-taking level SCC can positively affect the risk-taking level of enterprises (Dai and Zhu, 2020). According to supply chain management theory and stakeholder theory, implementing supply chain management can form a dependency relationship between different enterprises, which can promote smoother communication and easier collaboration among the nodes in the chain, reduce the bullwhip effect and various additional costs caused by information asymmetry, and thus reduce the frequency of financial distress and improve the level of risk-taking. In addition, according to the supply chain stability theory and transaction cost theory, the higher SCC, the more stable the proportion of core enterprises purchasing from upstream enterprises and selling to downstream enterprises, which indicates the higher the stability of the current supply chain network, which can reduce the market cost and transaction cost of finding or developing new partners, reduce the probability of financial distress, improve the risk-taking of enterprises, and ensure the healthy operation of enterprises. Based on the above analysis, this paper proposes the hypothesis that: H2b. SCC can affect the moderating effect of the enterprise’s risk-taking level; that is, in enterprises with higher SCC, the possibility of financial distress is lower and the risk-taking level is higher, which can significantly affect the relationship between GSCM and enterprise value. 4 Research design 4.1 Model design To examine the impact of GSCM on enterprise value, this paper constructs Model (l): Q i t = α 0 + α 1 G S C M i t + α 2 C o n t r o l s i t + ε i t ( 1 ) To test the moderating effect of the risk-taking level on the relationship between GSCM and enterprise value, this paper builds Model (2), which is constructed by adding moderating variables and the cross-product term of moderating variables and independent variables based on Model (1). Q i t = β 0 + β 1 G S C M i t + β 2 R I S K i t + β 3 G S C M i t ∗ R I S K i t + β 4 C o n t r o l s i t + ε i t ( 2 ) In the above model, Q it denotes the enterprise value of the ith firm in sample period t; GSCM it is the GSCM score of the ith firm in sample period t; RISK it is the enterprise risk-taking level of the ith firm in sample period t; controls are each control variables selected in this paper: the firm’s operating year (AGE); the firm size (SIZE); equity concentration (EC); board size (BOA); degree of industry competition (LER); regional economic development (GDP) and firm (ID). In Model (1), if α 1 is positive, it indicates that implementing GSCM can promote enterprise value. Model (2), on the other hand, measures the moderating role of corporate risk-taking capacity between GSCM and value enhancement, and if β 3 is positive, it means that an increase in the risk-taking level can strengthen the role of GSCM in promoting corporate value enhancement (Jiang, 2022). To further test the dual moderating effect of TIC and SCC on firms’ risk-taking level, the dual moderating effect analysis was conducted using grouped regressions, drawing on a study by Xiao et al. (2021). Grouping the samples according to the median can avoid the regression bias caused by excessive sample size differences between the two groups. Therefore, in this paper, the samples are divided into two groups based on the median of TIC and SCC, respectively, in the double moderation effect analysis to determine the effect of an enterprise’s implementation of GSCM on value enhancement when their TIC and SCC have different effects on their risk-taking level. 4.2 Variables selection 4.2.1 Explained variable Enterprise value (Q): Financial performance is useful for directly expressing good or bad business conditions and providing security for long-term business operations, and Tobin’s Q is an important indicator of a firm’s market value and business performance situation (Xu et al., 2022a; Qi and Wang, 2022). Therefore, this paper chooses Tobin’s Q value (Q) to characterize the firm’s value. The calculation formula is: Q = market value\/(total assets at the end of the period − net intangible assets − net goodwill). 4.2.2 Explanatory variable Green supply chain management (GSCM): This paper mainly selects the CITI index in GSCM disclosed by the Center for Public Environmental Studies (IPE) to measure the GSCM score of enterprises. The CITI index is mainly a dynamic evaluation of enterprises’ performance in supply chain environmental management from the perspectives of environmental compliance, energy saving and emission reduction, and information disclosure based on the information publicly disclosed by the government and enterprises. The index can objectively and systematically reflect enterprises’ willingness and ability to manage environmental pollution problems of upstream and downstream manufacturers (Dong et al., 2021). 4.2.3 Moderating variables Risk-taking level (RISK): From the perspective of corporate finance, this paper draws on the research of (Abinzano et al., 2020) and selects the Z score to measure the financial risk faced by enterprises and their ability to withstand risks. The greater the Z value is, the more stable the financial situation is and the lower the probability of financial risk. Technological innovation capability (TIC): The proportion of R&D investment in operating income is used to measure the TIC of enterprises (Gu et al., 2018). The greater the ratio, the higher the TIC of enterprises. Supply chain concentration (SCC): This paper uses the average of the ratio of the top five suppliers’ purchases to the total annual purchases and the top five customers’ sales to the total annual sales, which are disclosed in the annual reports to reflect the degree of SCC (Patatoukas, 2011; Fang et al., 2017). The higher the SCC, the better the stability of the supply chain. 4.2.4 Control variables Company operating year (AGE): this is measured by the difference between the company’s operating year and the year of establishment. In general, the longer the business time, the better the accumulation of funds, technology, credit, and other conditions, and the more conducive and capable of promoting enterprises to conduct activities. Firm size (SIZE): this selects the logarithm of the company’s total assets to characterize them. Larger enterprises can optimize the efficiency of resource allocation and reduce the probability of risk (Cuerva et al., 2014). Equity concentration (EC): this is measured by the sum of the shareholding ratios of the top ten major shareholders. Board size (BOA): this is represented by the number of board members. Industry competitiveness (LER): this is the industry Lerner index used to measure the degree of competition in the industry. Regional economic development (GDP) is the GDP index of each province (last year = 100) used for measurement. Different enterprises in different provinces and local economic development impact enterprises differently. At the same time, considering that the individual differences of different enterprises may affect the regression results, this paper also controls the enterprise individual variable (ID). 4.3 Data source and processing This paper includes data samples from enterprises and cities, specifically. The independent variable GSCM data comes from the CITI score in the GSCM section of the IPE website, which started in 2014 and dynamically evaluates the performance of enterprises in supply chain environmental management from the perspectives of environmental compliance, energy saving and emission reduction and information disclosure with the help of publicly available information from the government and enterprises. This paper follows the sample of Chinese listed enterprises in the GSCM score disclosed by IPE from 2014–2021, and excludes the sample of financial industry, the sample of enterprises with ST and PT, the sample of enterprises listed in the current year, and the enterprises with serious missing data samples in order to avoid estimation bias as much as possible, and finally gets 131 enterprises with 316 valid observations. In order to maintain the consistency of the data sample, all other data are counted and screened based on 131 enterprises from 2014–2021. The SCC data in the control variables were obtained from the corporate annual reports disclosed by each enterprise in the sample. The GDP data in the control variables are obtained from the statistical yearbooks of the cities where each enterprise in the study sample is located. All other data are obtained from the China Stock Market & Accounting Research Database (CSMAR), which is a research-oriented and accurate database in the field of China’s economy and finance with reference to the standards of authoritative databases such as CRSP and COMPUSTAT and is developed with the actual national conditions of China. It has covered 18 series of macroeconomics, industry economics, listed companies, stocks, funds, etc., and is widely used in existing research. 5 Finding and analysis 5.1 Descriptive statistic Table 1 shows the descriptive statistical results of the relevant variables. The minimum value of Q is 0.825, the maximum value is 18.262, the median is 1.750, and the mean is 2.547. This means that different enterprises have great differences in operating conditions. The minimum value of GSCM is 0, the maximum value is 47.880, the median is 5.250, and the mean value is 7.529, indicating that the degree of implementation of GSCM varies among companies, and most enterprises implement GSCM to a lower degree. The minimum value of RISK is −2.680, the maximum value is 36.257, the median is 2.294, and the mean value is 3.976, indicating a large gap between whether the enterprise faces financial distress. The risk management ability of most enterprises is relatively poor, and the probability of financial distress is relatively high. The variance inflation factor test found that the mean value of the VIF is 1.11, which is far lower than the critical value of 10, indicating that the research results are not affected by multicollinearity. TABLE 1 TABLE 1. Descriptive statistic. 5.2 Baseline regression 5.2.1 Stepwise regression In this paper, the regression test was carried out by gradually adding variables. Table 2 reports the regression results of the impact of GSCM on enterprise value improvement. The regression results show that with the addition of variables, R2 increases, the coefficient symbols of each variable remain unchanged, and the coefficient of the independent variable GSCM gradually stabilized at about 0.045, which means that the enterprise value increases by 0.045 percentage points for every unit increase in the score of GSCM. Hypothesis H1 is thus verified. TABLE 2 TABLE 2. Stepwise regression. 5.2.2 Robustness tests Replacing variables: 1) First, we can replace the explained variable. Using the market value\/total assets calculation method at the end of the period, we can replace the original calculation formula and recalculate the Tobin’s Q value (QC). The regression results of Table 3 show that implementing GSCM after replacing the explanatory variables significantly improves enterprise value, assuming that H1 is established. 2) Second, we can replace the explanatory variable. Considering that the GSCM scores of different enterprises are inconsistent, this paper performs 0\/1 processing on the data of GSCM based on the original data, that is, the GSCM score of i enterprise in t year is not 0, and it is assigned to 1, while the GSCM score is 0, and it is assigned to 0. The results in Table 3 show that H1 still holds after the explanatory variables are replaced. TABLE 3 TABLE 3. Robustness tests. Tailing processing: Since there may be extreme values in the original data that affect the regression results of the samples, this paper performs a 1% degree of bilateral tail reduction on the variables based on the original data. The regression results are shown in Table 3, and the conclusion is still valid. Endogenous processing: To avoid potential endogenous problems that interfere with the regression results, this paper draws on the research of Xie et al. (2016) and selects the average level of GSCM scores of various industries and provinces where enterprises are located as instrumental variables, and conducts endogenous tests through the 2SLS method. The regression results show that the weak instrumental variable (Cragg-Donald Wald F test) significantly rejects the original hypothesis at the 5% level, and the over-identification test (Sargan test) cannot reject the original hypothesis, indicating that all instrumental variables are exogenous, and after considering the endogenous problem, implementing GSCM can still play a positive role in promoting enterprise value. 5.2.3 Heterogeneity analysis The nature of the controlling shareholder: The decision and use of various enterprise resources are dominated by the controller (controlling shareholder). Therefore, the nature of the controlling shareholder is different, and the effect of enterprise operation and governance is also different. Based on the research of Zhang et al. (2019b), this paper divides the controlling shareholders into state-owned controlling shareholders (SOCS) and non-state-owned controlling shareholders (NSOCS) and analyzes the promotion effect of GSCM on enterprise value in enterprises with different controlling shareholders. The test results are shown in Table 4. It can be seen from Table 4 that for the enterprises of NSOCS, the coefficient of GSCM is significant at the 5% level, which means that GSCM can promote the value of the enterprise under the influence of NSOCS. On the other hand, the coefficient of GSCM of SOCS is insignificant, indicating that the impact of GSCM on the value of enterprises of SOCS is not obvious. The possible reasons for this are that enterprises influenced by SOCS are more likely to have unclear ownership, poor self-motivation, etc., resulting in the absence of managers, inefficient management and governance, etc., and affecting business and governance. When the business of enterprises of NSOCS is in good condition, shareholders can obtain greater vested interests and further lay a good foundation for realizing self-worth. Therefore, compared with SOCS, NSOCS can better play their leading role, promote enterprises to conduct GSCM, and promote enterprise value. TABLE 4 TABLE 4. Heterogeneity analysis. Type of enterprise: Different types of enterprises face different development conditions on the background of economic structure transformation and the dual carbon strategy. 1) Polluting-intensive enterprises (PIE) and non-polluting-intensive enterprises (NPIE). PIE face more severe transformation goals and policy regulations in the current context. According to the research of Liu and Liu (2015), enterprises with industry codes C19, C22, C26, C29, C30, C31, and D44 in the sample are defined as PIE, and enterprises in other industries are defined as NPIE. The results of the heterogeneity analysis are shown in Table 4. The results show that the coefficient of GSCM of NPIE is significant at the 5% level, which means that GSCM can promote the value of NPIE. The coefficient of GSCM of PIE is insignificant, indicating that implementing GSCM has no obvious impact on the value improvement in PIE. The possible reason for this is that PIE have a certain particularity in that implementing green processes costs more. At the same time, implementing of GSCM is not only the implementation of PIE, but also needs the implementation of other enterprises. However, the operators of other enterprises think that improving the environment and implementing greenization is the responsibility of PIE, and this sentiment reduces the sensitivity of enterprises on the chain to implementing GSCM. 2) Technology-intensive enterprises (TIE) and non-technology-intensive enterprises (NTIE). According to the CSRC’s 2012 industry classification standard, firms with industry codes C27, C34, C35, C36, C37, C38, C39, and M74 are defined as TIE, and the rests are NTIE. The regression results of Table 4 show that the coefficient of GSCM of NTIE is significant at the 1% level, which means that GSCM can promote the value of enterprises of NTIE. The GSCM coefficient of TIE is insignificant, indicating that implementing GSCM has no obvious impact on the value improvement in TIE. The possible reasons for this are as follows: compared with TIE, NTIE have poor technical capabilities, and the green and sustainable development of supply chain management requires enterprises to have certain technical capabilities and conditions. At the same time, digital technology has played a greater role during the COVID-19 epidemic. Therefore, implementing GSCM in enterprises with poor technical ability will help them improve their technical level and promote their ability to transform technological and other capabilities into value improvement. Therefore, implementing GSCM in NTIE will play a more significant role in promoting enterprise value. 5.3 Further analysis 5.3.1 The moderating effect test of enterprise risk-taking level The regression results in Table 5 show that the interaction term coefficient between GSCM and corporate risk-taking is 0.013 and significant at the 1% level, indicating that when the risk-taking level is higher, implementing GSCM can better promote an improvement in corporate value. It is not difficult to understand that, as mentioned earlier, the implementation of GSCM by enterprises will reduce the risk-taking level of enterprises and increase the possibility of enterprises facing financial difficulties. Only when the enterprise’s risk-taking level is higher, it can show that the enterprise does not have the possibility of facing higher financial distress under the current business condition, and the enterprise will have the intention to implement GSCM. Therefore, the higher the risk-taking level of the enterprise, the more it can indicate that the current enterprise does not have financial distress, and the more it can support the enterprise to carry out GSCM. That is, when the enterprise risk-taking level is higher, the positive promotion effect of implementing GSCM on enterprise value enhancement is obvious. TABLE 5 TABLE 5. Moderating effect analysis. 5.3.2 Test on the dual moderating effect of TIC and SCC The regression results of the dual moderating effects of Table 5 show the following: 1) When the TIC of enterprises is low, the moderating effect of the risk-taking level is more significant. This is because enterprises conducting technological innovation work spend a lot of manpower and material resources, which increases the probability of corporate financial difficulties and financial constraints, debt risk, etc., and implementing GSCM also requires enterprises to continuously inject funds; when the financial risks faced by enterprises are too large, it is not conducive for enterprises to conduct GSCM. Therefore, the lower the TIC of enterprises, the more significant the role of the risk-taking level in promoting enterprise value using GSCM. Hypothesis H2a thus holds. 2) When the SCC is higher, the risk-taking level plays a more significant role in implementing GSCM to promote enterprise value. SCC is measured by the average of the sum of the proportion of the top five customers and suppliers in the overall sales and procurement. The higher the SCC value, the stronger the relationship between enterprises, and the more conducive it is for enterprises to establish a stable supply and sales network and reduce procurement and sales risks and costs to increase the abundance of funds to conduct GSCM and turn it into enterprise value. Therefore, the higher the SCC value, the more significant the role of the risk-taking level in GSCM promoting enterprise value. Hypothesis H2b thus holds. 6 Discussion and conclusion 6.1 Discussion In the existing research, most articles analyze how GSCM improves corporate value, but analyzing mechanisms and paths and discussing the relationship between the two is not comprehensive. The implementation of GSCM requires enterprises to inject funds continuously, and enterprises’ financial level reflects the enterprises’ risk-taking ability to a certain extent. At the same time, the risk-taking level of enterprises is affected by the degree of technological innovation and the stability of the supply and sales network. Therefore, this paper first examines the impact of GSCM on enterprise value and analyzes the regulatory role of the risk-taking level in promoting enterprise value by GSCM, further discussing the dual-level regulatory role of TIC and SCC. The innovation of this paper lies in. 1) Enriching the research on the impact of GSCM on enterprise value. 2) From the perspective of corporate risk-taking level, this paper studies the role of the risk-taking level in GSCM to enhance enterprise value. 3) This paper further explores how the level of risk-taking affects the role of GSCM in promoting enterprise value when the TIC and SCC adjust the level of risk-taking. 6.2 Conclusion This paper uses the data of 131 Chinese listed companies from 2014 to 2021 to empirically test the impact of implementing GSCM on improving enterprise value. At the same time, to clarify the path of implementing GSCM affecting the improvement in enterprise value, this paper also explores the regulatory role of the risk-taking level, further analyzes the dual regulatory role of TIC and SCC and draws the following conclusion. 1) Enterprises carrying out GSCM can promote an improvement in enterprise value. 2) The nature of the controlling shareholders of enterprises is different, the type of enterprise is different, and the role of GSCM in enhancing corporate value is different. When the enterprise is NSOCS, NPIE and NTIE types, implementing GSCM significantly promotes enterprise value. 3) The level of corporate risk-taking can positively regulate the role of GSCM in enhancing enterprise value; that is, the higher the level of risk-taking, the more GSCM can promote enterprise value. 4) The level of corporate risk-taking is moderated by TIC and SCC. When the TIC is low or the SCC is high, the level of risk-taking plays a more significant role in promoting corporate value via GSCM. 7 Practical enlightenment Implementing GSCM can promote an improvement in enterprise value. To achieve this goal, we should focus on the following. (1) Starting from the government, through guidance, encouragement, and other measures to promote GSCM—we should cultivate new economic growth points and promote the acceleration of the green, intelligent, and high-end transformation and upgrading of traditional industries to form new competitive advantages and thus realize the win–win situation of ecological protection and promote the greening of enterprises. The research results reveal that when enterprises have a good level of risk-taking, the role of the GSCM in promoting enterprise value is more obvious. In addition, improving the enterprise’s TIC is not conducive to the enterprise’s risk-taking level, but implementing greenization and ecologicalization will inevitably require an injection of capital, technological, and other costs. This requires government departments to issue special support policies to strengthen support for enterprises with good finances and talent; at the same time, market resources must be guided to achieve rational allocation and ensure an improvement in the TIC of enterprises and the stability of capital and cash flow. (2) Starting from enterprises, we should deepen the management and operation awareness of the coexistence of ecological protection and economic benefits, actively incorporate greening and sustainability into the scope of enterprise management and supply chain collaboration and internalize the cognition and practice of GSCM in the ideological culture and operation management. The different types of shareholders and the different types of enterprises will affect the implementation of GSCM. This requires enterprises to adjust measures to local conditions when implementing GSCM and not blindly follow the trend so as not to cause greater management and operational risks. The higher the SCC, the better the moderating effect of the risk-taking level. On the one hand, the higher the SCC, the better the supply chain network’s stability. At this time, enterprises can implement the concept of environmental protection in the process of product manufacturing and sales using cooperation and interaction with upstream and downstream enterprises to enhance the overall greening of the chain and enhance enterprise value and performance. On the other hand, the better the stability of the supply chain, the better the positive regulatory effect of the risk-taking level is. At this time, different enterprises can establish the concept and channel of cooperation and strive to build a mutually beneficial supply and sales system. Product manufacturing and raw material supply enterprises can continuously improve their product quality, and commodity sales enterprises can improve their sales methods. While improving their competitiveness, they can increase the demand and support of other enterprises for their own enterprises, improve the stability of supply and sales networks, and reduce the probability of financial risks to improve their performance when implementing GSCM. 8 Research limitations and future research directions This paper has found that the level of risk-taking can positively promote the role of GSCM in terms of enterprise value enhancement, and TIC and SCC also influence the level of risk-taking, but there are certain shortcomings. Firstly, due to data limitations, the CITI index disclosed by IPE is selected to measure the GSCM level of companies in this paper, but the index only evaluates some specific companies, and the overall sample size is small. Future research could: 1) A universal evaluation index system can be constructed based on the evaluation criteria of IPE to meet the purpose of evaluating the GSCM scores of all companies. 2) Further, the statistical method can be used to argue the role of GSCM implementation on enterprise value based on the evaluation scores, so that the research conclusions can be more convincing to promote and facilitate the implementation of GSCM in enterprises. Secondly, the benefits of implementing GSCM for enterprises are not only reflected in value enhancement, but future research can also analyze the benefits brought by the implementation of GSCM for enterprises from the perspective of enterprise competitiveness, inventory cost, and green development. Finally, the lack of other regulating factors in the theoretical analysis and research process, future research could also find, study and argue how the implementation of GSCM affects enterprise value enhancement from the perspective of customers and suppliers, to enrich the research of GSCM and promote the implementation of GSCM in enterprises, to achieve a win-win situation of economic benefits and environmental protection. Data availability statement The raw data supporting the conclusion of this article will be made available by the authors, without undue reservation. Author contributions Conceptualization, LZ and YD; methodology, LZ and YD; software, LZ and YD; validation, LZ; formal analysis, LZ and YD; resources, LZ and YD; data curation, LZ and YD; writing—original draft preparation, LZ and YD; writing—review and editing, LZ, YD, and HW; visualization, LZ and YD; supervision, LZ, YD, and HW; project administration, YD and HW; funding acquisition, YD and HW. All authors have read and agreed to the published version of the manuscript. Funding This article is supported by the Research Projects on National Social Science Foundation of China under Grant number 20BGL015, The Shanghai Cooperation Organization (SCO) Science and Technology Partnership Program and International Science and Technology Partnership Program and International Science and Technology Cooperation Program under Grant number 2019E01009 and the Silk Road Innovation Project of Xinjiang University under Grant number SL2022010, SL2022015. Acknowledgments Thanks to Mel Dudley and Christopher Adam Dacosta for taking the time to proofread and correct the language of this article. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Abdallah, A. B., and Al-Ghwayeen, W. S. (2019). Green supply chain management and business performance: The mediating roles of environmental and operational performances. Bus. Process Manag. J. 26, 489–512. doi:10.1108\/BPMJ-03-2018-0091 CrossRef Full Text | Google Scholar Abu Seman, N. A., Govindan, K., Mardani, A., Zakuan, N., Mat Saman, M. Z., Hooker, R. E., et al. (2019). The mediating effect of green innovation on the relationship between green supply chain management and environmental performance. J. Clean. Prod. 229, 115–127. doi:10.1016\/j.jclepro.2019.03.211 CrossRef Full Text | Google Scholar Agrawal, V., Mohanty, R. P., Agarwal, S., Dixit, J. K., and Agrawal, A. M. (2022). Analyzing critical success factors for sustainable green supply chain management. Environ. Dev. Sustain doi:10.1007\/s10668-022-02396-2 CrossRef Full Text | Google Scholar Agyabeng-Mensah, Y., Ahenkorah, E., Afum, E., Nana Agyemang, A., Agnikpe, C., and Rogers, F. (2020). Examining the influence of internal green supply chain practices, green human resource management and supply chain environmental cooperation on firm performance. Supply Chain Manag. An Int. J. 25, 585–599. doi:10.1108\/SCM-11-2019-0405 CrossRef Full Text | Google Scholar Ahmed, W., Najmi, A., and Khan, F. (2020). Examining the impact of institutional pressures and green supply chain management practices on firm performance. Manag. Environ. Qual. An Int. J. 31, 1261–1283. doi:10.1108\/MEQ-06-2019-0115 CrossRef Full Text | Google Scholar Ali, Q. M., Nisar, Q. A., Abidin, R. Z., Qammar, R., and Abbass, K. (2022). Greening the workforce in higher educational institutions: The pursuance of environmental performance. Environ. Sci. Pollut. Res. doi:10.1007\/s11356-022-19888-3 CrossRef Full Text | Google Scholar An, R., and Zhu, G. (2022). Clustering of economic efficiency of urban energy carbon emissions based on decoupling theory. Energy Rep. 8, 9569–9575. doi:10.1016\/j.egyr.2022.07.063 CrossRef Full Text | Google Scholar Andiappan, V., Foo, D. C. Y., and Tan, R. R. (2022). Automated targeting for green supply chain planning considering inventory storage losses, production and set-up time. J. Industrial Prod. Eng. 39, 341–352. doi:10.1080\/21681015.2021.1991015 CrossRef Full Text | Google Scholar Asghari, M., Afshari, H., Mirzapour Al-e-hashem, S. M. J., Fathollahi-Fard, A. M., and Dulebenets, M. A. (2022). Pricing and advertising decisions in a direct-sales closed-loop supply chain. Comput. Industrial Eng. 171, 108439. doi:10.1016\/j.cie.2022.108439 CrossRef Full Text | Google Scholar Aslam, B., Hu, J., Shahab, S., Ahmad, A., Saleem, M., Syed, S., et al. (2021). The nexus of industrialization, GDP per capita and CO2 emission in China. Environ. Technol. innovation 23, 101674. doi:10.1016\/j.eti.2021.101674 CrossRef Full Text | Google Scholar Baldini, M., Maso, L. D., Liberatore, G., Mazzi, F., and Terzani, S. (2018). Role of country- and firm-level determinants in environmental, social, and governance disclosure. J. Bus. Ethics 150, 79–98. doi:10.1007\/s10551-016-3139-1 CrossRef Full Text | Google Scholar Becerra, P., Mula, J., and Sanchis, R. (2021). Green supply chain quantitative models for sustainable inventory management: A review. J. Clean. Prod. 328, 129544. doi:10.1016\/j.jclepro.2021.129544 CrossRef Full Text | Google Scholar Cao, X., and Zhang, Y. (2022). Environmental regulation, foreign investment, and green innovation: A case study from China. Environ. Sci. Pollut. Res. 29, 90046–90057. doi:10.1007\/s11356-022-22722-5 CrossRef Full Text | Google Scholar Chen, S. (2015). Environmental pollution emissions, regional productivity growth and ecological economic development in China. China Econ. Rev. 35, 171–182. doi:10.1016\/j.chieco.2014.08.005 CrossRef Full Text | Google Scholar Chiu, C.-Y., Cheng, C.-Y., and Wu, T.-Y. (2021). Integrated operational model of green closed-loop supply chain. Sustainability 13, 6041. doi:10.3390\/su13116041 CrossRef Full Text | Google Scholar Cuerva, M. C., Triguero-Cano, Á., and Córcoles, D. (2014). Drivers of green and non-green innovation: Empirical evidence in low-tech SMEs. J. Clean. Prod. 68, 104–113. doi:10.1016\/j.jclepro.2013.10.049 CrossRef Full Text | Google Scholar Dai, S., and Zhu, Z. (2020). Environmental uncertainty, supply chain concentration and corporate risk-taking. Finance Account. Newsl. 2020, 95–98. doi:10.16144\/j.cnki.issn1002-8072.2020.21.020 CrossRef Full Text | Google Scholar Dias, A., Rodrigues, L. L., Craig, R., and Neves, M. E. (2018). Corporate social responsibility disclosure in small and medium-sized entities and large companies. Soc. Responsib. J. 15, 137–154. doi:10.1108\/SRJ-05-2017-0090 CrossRef Full Text | Google Scholar Dong, Z., Tan, Y., and Cao, Z. (2021). Does green supply chain management stimulate clean technology innovation? -An empirical analysis based on identification and classification tests. J. East China Normal Univ. (Philosophy Soc. Sci. Ed.) 53, 136–149+183. doi:10.16382\/j.cnki.1000-5579.2021.04.013 CrossRef Full Text | Google Scholar Ezuma, R. E. M. R., Matthew, N. K., Ezuma, R. E. M. R., and Matthew, N. K. (2022). The perspectives of stakeholders on the effectiveness of green financing schemes in Malaysia. GF 4, 450–473. doi:10.3934\/GF.2022022 CrossRef Full Text | Google Scholar Fang, H., Zhang, Y., and Wang, P. (2017). Legal environment, supply chain concentration and comparability of corporate accounting information. Account. Res. 2017, 33–40+96. Google Scholar Fasan, M., Soerger Zaro, E., Soerger Zaro, C., Porco, B., and Tiscini, R. (2021). An empirical analysis: Did green supply chain management alleviate the effects of COVID-19? Bus. Strategy Environ. 30, 2702–2712. doi:10.1002\/bse.2772 PubMed Abstract | CrossRef Full Text | Google Scholar Feng, M., Yu, W., Wang, X., Wong, C. Y., Xu, M., and Xiao, Z. (2018). Green supply chain management and financial performance: The mediating roles of operational and environmental performance. Bus. Strategy Environ. 27, 811–824. doi:10.1002\/bse.2033 CrossRef Full Text | Google Scholar Feng, Y., Chen, H., Chen, Z., Wang, Y., and Wei, W. (2021). Has environmental information disclosure eased the economic inhibition of air pollution? J. Clean. Prod. 284, 125412. doi:10.1016\/j.jclepro.2020.125412 CrossRef Full Text | Google Scholar Ghobakhloo, M., Tang, S. H., Zulkifli, N., and Mohd Ariffin, M. K. A. (2013). An integrated framework of green supply chain management implementation. Int. J. Innovation, Manag. Technol. 4, 86–89. Google Scholar Gholian-Jouybari, F., Hashemi-Amiri, O., Mosallanezhad, B., and Hajiaghaei-Keshteli, M. (2023). Metaheuristic algorithms for a sustainable agri-food supply chain considering marketing practices under uncertainty. Expert Syst. Appl. 213, 118880. doi:10.1016\/j.eswa.2022.118880 CrossRef Full Text | Google Scholar Gu, X., Chen, Y., and Pan, S. (2018). Economic policy uncertainty and innovation-an empirical analysis based on listed companies in China. Econ. Res. 53, 109–123. Google Scholar Jiang, T. (2022). Mediating and moderating effects in empirical studies of causal inference. China Ind. Econ. 2022, 100–120. doi:10.19581\/j.cnki.ciejournal.2022.05.005 CrossRef Full Text | Google Scholar Karimi, S. K., Naini, S. G. J., and Sadjadi, S. J. (2021). An integration of environmental awareness into flexible supply chains: A trade-off between costs and environmental pollution. Environ. Sci. Pollut. Res. 2021, 1–11. doi:10.1007\/s11356-021-13454-z CrossRef Full Text | Google Scholar Li, G., Li, L., Choi, T. M., and Sethi, S. P. (2019). Green supply chain management in Chinese firms: Innovative measures and the moderating role of quick response technology. J. Operations Manag. 66, 958–988. doi:10.1002\/joom.1061 CrossRef Full Text | Google Scholar Li, M., and Zhou, Y. (2022). Analysis of supply chain optimization method and management intelligent decision under green economy. Wirel. Commun. Mob. Comput. 2022, 1–9. doi:10.1155\/2022\/4502430 CrossRef Full Text | Google Scholar Li, R., and Chen, X. (2022). Reverse logistics network design under disruption risk for third-party logistics providers. Sustainability 14, 14936. doi:10.3390\/su142214936 CrossRef Full Text | Google Scholar Li, S., Ragu-Nathan, B., Ragu-Nathan, T. S., and Subba Rao, S. (2006). The impact of supply chain management practices on competitive advantage and organizational performance. Omega 34, 107–124. doi:10.1016\/j.omega.2004.08.002 CrossRef Full Text | Google Scholar Li, Z., Liao, G., and Albitar, K. (2020). Does corporate environmental responsibility engagement affect firm value? The mediating role of corporate innovation. Bus. Strategy Environ. 29, 1045–1055. doi:10.1002\/bse.2416 CrossRef Full Text | Google Scholar Li, Z., Zou, F., and Mo, B. (2022). Does mandatory CSR disclosure affect enterprise total factor productivity? Econ. Research-Ekonomska Istraživanja 35, 4902–4921. doi:10.1080\/1331677X.2021.2019596 CrossRef Full Text | Google Scholar Liao, G., Hou, P., Shen, X., and Albitar, K. (2021). The impact of economic policy uncertainty on stock returns: The role of corporate environmental responsibility engagement. Int. J. Finance Econ. 26, 4386–4392. doi:10.1002\/ijfe.2020 CrossRef Full Text | Google Scholar Liao, Y., Kaviyani-Charati, M., Hajiaghaei-Keshteli, M., and Diabat, A. (2020). Designing a closed-loop supply chain network for citrus fruits crates considering environmental and economic issues. J. Manuf. Syst. 55, 199–220. doi:10.1016\/j.jmsy.2020.02.001 CrossRef Full Text | Google Scholar Liu, P., Zhao, Y., Zhu, J., Yang, C., Liu, P., Zhao, Y., et al. (2022a). Technological industry agglomeration, green innovation efficiency, and development quality of city cluster. GF 4, 411–435. doi:10.3934\/GF.2022020 CrossRef Full Text | Google Scholar Liu, Y., and Liu, M. (2015). Does haze affect the surplus management of heavy polluters? -An examination based on the political cost hypothesis. Account. Res. 2015, 26–33+94. Google Scholar Longoni, A., and Cagliano, R. (2018). Inclusive environmental disclosure practices and firm performance: The role of green supply chain management. Int. J. Operations Prod. Manag. 38, 1815–1835. doi:10.1108\/IJOPM-12-2016-0728 CrossRef Full Text | Google Scholar Lu, Q., Wang, H., and Liu, W. (2020). Managerial power, technological innovation and audit risk premium. China Soft Sci. 2020, 137–144+164. Google Scholar Ma, D., Qin, H., and Hu, J. (2022). Achieving triple sustainability in closed-loop supply chain: The optimal combination of online platform sales format and blockchain-enabled recycling. Comput. Industrial Eng. 174, 108763. doi:10.1016\/j.cie.2022.108763 CrossRef Full Text | Google Scholar Mao, J., Zhang, R., and Guan, C. (2022). Digital economy, fiscal decentralization and corporate innovation. J. Southwest Univ. Natl. Humanit. Soc. Sci. Ed. 43, 118–129. Google Scholar Mirzagoltabar, H., Shirazi, B., Mahdavi, I., and Arshadi Khamseh, A. (2021). Sustainable dual-channel closed-loop supply chain network with new products for the lighting industry. Comput. Industrial Eng. 162, 107781. doi:10.1016\/j.cie.2021.107781 CrossRef Full Text | Google Scholar Mohamed Abdul Ghani, N. M. A., Egilmez, G., Kucukvar, M., Bhutta, S., and Khurrum, M. (2017). From green buildings to green supply chains: An integrated input-output life cycle assessment and optimization framework for carbon footprint reduction policy making. Manag. Environ. Qual. An Int. J. 28, 532–548. doi:10.1108\/MEQ-12-2015-0211 CrossRef Full Text | Google Scholar Neeley, T. B., and Leonardi, P. M. (2018). Enacting knowledge strategy through social media: Passable trust and the paradox of nonwork interactions. Strategic Manag. J. 39, 922–946. doi:10.1002\/smj.2739 CrossRef Full Text | Google Scholar Ni, W., and Sun, H. (2019). Does construct multidimensionality matter? A nuanced examination of the relationship among supply chain integration, green supply chain management, and business performance. Sustainability 11, 5455. doi:10.3390\/su11195455 CrossRef Full Text | Google Scholar Novitasari, M., Wijaya, A. L., Agustin, N. M., Gunardi, A., and Dana, L.-P. (2022). Corporate social responsibility and firm performance: Green supply chain management as a mediating variable. Corp. Soc. Responsib. Environ. Manag. 30, 267–276. doi:10.1002\/csr.2353 CrossRef Full Text | Google Scholar Pal, B., Sarkar, A., and Sarkar, B. (2023). Optimal decisions in a dual-channel competitive green supply chain management under promotional effort. Expert Syst. Appl. 211, 118315. doi:10.1016\/j.eswa.2022.118315 CrossRef Full Text | Google Scholar Panigrahi, S. S., Bahinipati, B., and Jain, V. (2018). Sustainable supply chain management: A review of literature and implications for future research. Manag. Environ. Qual. An Int. J. 30, 1001–1049. doi:10.1108\/MEQ-01-2018-0003 CrossRef Full Text | Google Scholar Qi, X., and Wang, Q. (2022). Exploratory innovation, redundant resources and financial performance of small and medium-sized enterprises. Friends Account. 2022, 66–72. Google Scholar Rabbi, M., Ali, S. M., Kabir, G., Mahtab, Z., and Paul, S. K. (2020). Green supply chain performance prediction using a bayesian belief network. Sustainability 12, 1101. doi:10.3390\/su12031101 CrossRef Full Text | Google Scholar Rao, P., and Holt, D. (2005). Do green supply chains lead to competitiveness and economic performance? Int. J. Operations Prod. Manag. 25, 898–916. doi:10.1108\/01443570510613956 CrossRef Full Text | Google Scholar Richnák, P., and Gubová, K. (2021). Green and reverse logistics in conditions of sustainable development in enterprises in Slovakia. Sustainability 13, 581. doi:10.3390\/su13020581 CrossRef Full Text | Google Scholar Rodríguez-González, R. M., Maldonado-Guzmán, G., Madrid-Guijarro, A., and Garza-Reyes, J. A. (2022). Does circular economy affect financial performance? The mediating role of sustainable supply chain management in the automotive industry. J. Clean. Prod. 379, 134670. doi:10.1016\/j.jclepro.2022.134670 CrossRef Full Text | Google Scholar Sajjad, A., Eweje, G., and Tappin, D. (2020). Managerial perspectives on drivers for and barriers to sustainable supply chain management implementation: Evidence from New Zealand. Bus. Strategy Environ. 29, 592–604. doi:10.1002\/bse.2389 CrossRef Full Text | Google Scholar Salandri, L., Cascio Rizzo, G. L., Cozzolino, A., and De Giovanni, P. (2022). Green practices and operational performance: The moderating role of agility. J. Clean. Prod. 375, 134091. doi:10.1016\/j.jclepro.2022.134091 CrossRef Full Text | Google Scholar Salehi-Amiri, A., Zahedi, A., Akbapour, N., and Hajiaghaei-Keshteli, M. (2021). Designing a sustainable closed-loop supply chain network for walnut industry. Renew. Sustain. Energy Rev. 141, 110821. doi:10.1016\/j.rser.2021.110821 CrossRef Full Text | Google Scholar Samad, S., Nilashi, M., Almulihi, A., Alrizq, M., Alghamdi, A., Mohd, S., et al. (2021). Green supply chain management practices and impact on firm performance: The moderating effect of collaborative capability. Technol. Soc. 67, 101766. doi:10.1016\/j.techsoc.2021.101766 CrossRef Full Text | Google Scholar Sarkis, J., Cohen, M. J., Dewick, P., and Schröder, P. (2020). A brave new world: Lessons from the COVID-19 pandemic for transitioning to sustainable supply and production. Resour. Conservation Recycl. 159, 104894. doi:10.1016\/j.resconrec.2020.104894 CrossRef Full Text | Google Scholar Sheng, X., Chen, L., Yuan, X., Tang, Y., Yuan, Q., Chen, R., et al. (2022). Green supply chain management for a more sustainable manufacturing industry in China: A critical review. Environ. Dev. Sustain 25, 1151–1183. doi:10.1007\/s10668-022-02109-9 CrossRef Full Text | Google Scholar Sheu, J.-B., and Chen, Y. J. (2012). Impact of government financial intervention on competition among green supply chains. Int. J. Prod. Econ. 138, 201–213. doi:10.1016\/j.ijpe.2012.03.024 CrossRef Full Text | Google Scholar Sun, J., Sarfraz, M., Khawaja, K. F., and Abdullah, M. I. (2022). Sustainable supply chain strategy and sustainable competitive advantage: A mediated and moderated model. Front. Public Health 10, 895482. doi:10.3389\/fpubh.2022.895482 PubMed Abstract | CrossRef Full Text | Google Scholar Tseng, M.-L., Islam, M. S., Karia, N., Fauzi, F. A., and Afrin, S. (2019). A literature review on green supply chain management: Trends and future challenges. Resour. Conservation Recycl. 141, 145–162. doi:10.1016\/j.resconrec.2018.10.009 CrossRef Full Text | Google Scholar Wang, C., Zhang, Q., and Zhang, W. (2020). Corporate social responsibility, Green supply chain management and firm performance: The moderating role of big-data analytics capability. Res. Transp. Bus. Manag. 37, 100557. doi:10.1016\/J.RTBM.2020.100557 CrossRef Full Text | Google Scholar Wang, M.-X., Zhao, H.-H., Cui, J.-X., Fan, D., Lv, B., Wang, G., et al. (2018). Evaluating green development level of nine cities within the Pearl River Delta, China. J. Clean. Prod. 174, 315–323. doi:10.1016\/j.jclepro.2017.10.328 CrossRef Full Text | Google Scholar Wang, M., Li, L., Lan, H., Wang, M., Li, L., and Lan, H. (2021). The measurement and analysis of technological innovation diffusion in China’s manufacturing industry. NAR 3, 452–471. doi:10.3934\/NAR.2021024 CrossRef Full Text | Google Scholar Wang, S., and Li, S. (2021). Study on the relationship between green supply chain management, institutional environment and environmental benefits of retail enterprises. Bus. Econ. Res. 2021, 35–38. Google Scholar Wang, X., and Rao, S. (2021). Group operation, controlling shareholder equity pledge and corporate innovation. Nanfang Finance 2021, 49–58. Google Scholar Wei, L., Lin, B., Zheng, Z., Wu, W., and Zhou, Y. (2023). Does fiscal expenditure promote green technological innovation in China? Evidence from Chinese cities. Environ. Impact Assess. Rev. 98, 106945. doi:10.1016\/j.eiar.2022.106945 CrossRef Full Text | Google Scholar Wu, J. (2022). Sustainable development of green reverse logistics based on blockchain. Energy Rep. 8, 11547–11553. doi:10.1016\/j.egyr.2022.08.219 CrossRef Full Text | Google Scholar Xiao, X., Lin, S., Li, Q., and Zhuang, M. (2021). A study of the impact of knowledge distance and institutional distance on innovation catch-up of firms in emerging economies - the dual moderating role of firm characteristics. Manag. Rev. 33, 115–129. doi:10.14120\/j.cnki.cn11-5057\/f.2021.10.011 CrossRef Full Text | Google Scholar Xie, D., Zheng, D., and Cui, C. (2016). Are controlling shareholders’ equity pledges a potential “landmine”? -A study based on the perspective of stock price collapse risk. Manag. World 2016, 128–140+188. doi:10.19744\/j.cnki.11-1235\/f.2016.05.011 CrossRef Full Text | Google Scholar Xie, X., and Zhu, Q. (2022). Innovative fulcrums or conservative shackles: How can green supply chain management practices leverage corporate performance? China Manag. Sci. 30, 131–143. doi:10.16381\/j.cnki.issn1003-207x.2019.0999 CrossRef Full Text | Google Scholar Xu, H., Gao, K., Chi, Y., Chen, Y., and Peng, R. (2022b). Interactive impacts of overconfidence and competitive preference on closed-loop supply chain performance. Mathematics 10, 4334. doi:10.3390\/math10224334 CrossRef Full Text | Google Scholar Xu, L. (2022). Towards green innovation by China’s industrial policy: Evidence from made in China 2025. Front. Environ. Sci. 10. doi:10.3389\/fenvs.2022.924250 CrossRef Full Text | Google Scholar Xue, X., Dou, J., and Shang, Y. (2020). Blockchain-driven supply chain decentralized operations – information sharing perspective. Bus. Process Manag. J. 27, 184–203. doi:10.1108\/BPMJ-12-2019-0518 CrossRef Full Text | Google Scholar Yildiz Çankaya, S., and Sezen, B. (2018). Effects of green supply chain management practices on sustainability performance. J. Manuf. Technol. Manag. 30, 98–121. doi:10.1108\/JMTM-03-2018-0099 CrossRef Full Text | Google Scholar Yontar, E., and Ersöz, S. (2020). Investigation of food supply chain sustainability performance for Turkey’s food sector. Front. Sustain. Food Syst. 4. doi:10.3389\/fsufs.2020.00068 CrossRef Full Text | Google Scholar Zhang, M., Tse, Y. K., Dai, J., and Chan, H. K. (2019a). Examining green supply chain management and financial performance: Roles of social control and environmental dynamism. IEEE Trans. Eng. Manag. 66, 20–34. doi:10.1109\/TEM.2017.2752006 CrossRef Full Text | Google Scholar Zhang, Y., Liu, L., and Yin, Z. (2019b). Shareholding structure characteristics and efficiency of mixed ownership firms. Account. Econ. Res. 33, 92–107. doi:10.16314\/j.cnki.31-2074\/f.2019.03.007 CrossRef Full Text | Google Scholar Zhou, C., and Zhao, X. (2021). Do government tax cuts help enhance corporate risk-taking: Empirical evidence from Chinese listed companies. J. Jiangxi Univ. Finance Econ. 2021, 29–42. doi:10.13676\/j.cnki.cn36-1224\/f.2021.01.005 CrossRef Full Text | Google Scholar","filter_flag":1}
{"title":"The fashion exec's guide to circularity - Vogue Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5","id":"CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA","guidislink":false,"published":"Wed, 11 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=11, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=11, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5\" target=\"_blank\">The fashion exec's guide to circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The fashion exec's guide to circularity - Vogue Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiU2h0dHBzOi8vd3d3LnZvZ3VlYnVzaW5lc3MuY29tL3N1c3RhaW5hYmlsaXR5L3RoZS1mYXNoaW9uLWV4ZWNzLWd1aWRlLXRvLWNpcmN1bGFyaXR50gEA?oc=5\" target=\"_blank\">The fashion exec's guide to circularity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Vogue Business<\/font>","source.href":"https:\/\/www.voguebusiness.com","source.title":"Vogue Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"This article is part of our Advanced Membership package. To enjoy unlimited access to The Long View from Vogue Business and bi-monthly Market Insights Reports and webinars, sign up for Advanced Membership here. Key takeaway: Circular fashion is gaining traction as a necessary concept for the industry to avoid generating excessive waste, with investment flowing into rental, repair, resale and recycling. But sustainability experts say the industry is too focused on technological solutions and startups based in the Global North, and is neglecting its social impact, especially in the Global South.","filter_flag":1}
{"title":"The Bay and ReturnBear Partner to Make Returns Easier Français - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvdGhlLWJheS1hbmQtcmV0dXJuYmVhci1wYXJ0bmVyLXRvLW1ha2UtcmV0dXJucy1lYXNpZXItODk0MzI5NjE3Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvdGhlLWJheS1hbmQtcmV0dXJuYmVhci1wYXJ0bmVyLXRvLW1ha2UtcmV0dXJucy1lYXNpZXItODk0MzI5NjE3Lmh0bWzSAQA?oc=5","id":"CBMiamh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvdGhlLWJheS1hbmQtcmV0dXJuYmVhci1wYXJ0bmVyLXRvLW1ha2UtcmV0dXJucy1lYXNpZXItODk0MzI5NjE3Lmh0bWzSAQA","guidislink":false,"published":"Tue, 17 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=17, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvdGhlLWJheS1hbmQtcmV0dXJuYmVhci1wYXJ0bmVyLXRvLW1ha2UtcmV0dXJucy1lYXNpZXItODk0MzI5NjE3Lmh0bWzSAQA?oc=5\" target=\"_blank\">The Bay and ReturnBear Partner to Make Returns Easier Français<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Bay and ReturnBear Partner to Make Returns Easier Français - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiamh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvdGhlLWJheS1hbmQtcmV0dXJuYmVhci1wYXJ0bmVyLXRvLW1ha2UtcmV0dXJucy1lYXNpZXItODk0MzI5NjE3Lmh0bWzSAQA?oc=5\" target=\"_blank\">The Bay and ReturnBear Partner to Make Returns Easier Français<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"Returns For Participating Marketplace Sellers Now Accepted in Hudson's Bay Stores TORONTO, Jan. 17, 2023 \/CNW\/ - The Bay, Canada's leading destination for life and style, is excited to announce it has partnered with ReturnBear , Canada's first end-to-end online returns service provider, to provide its customers with easier returns. Now, many items purchased on TheBay.com - including purchases from Marketplace sellers - can be returned quickly and easily using ReturnBear technology on TheBay.com. Coinciding with a staggered online launch, customers will see the new process based on their proximity to Hudson's Bay stores. Additionally, ReturnBear drop-off locations have opened in 10 Hudson's Bay stores in Ontario, with rollout planned throughout the Hudson's Bay store network by Spring 2023. The Bay and ReturnBear Partner to Make Returns Easier (CNW Group\/The Bay) The Bay and ReturnBear Partner to Make Returns Easier (CNW Group\/The Bay) Return Bear logo (CNW Group\/The Bay) For online shoppers, two easy return options are at their fingertips, no matter whether they've purchased an item from The Bay or, for the first time, one of its more than 900 Marketplace sellers. No need to repack items, print shipping labels or mail back - shoppers simply 'initiate a return' in their order history to generate a QR code, then have the QR code scanned in store to drop off their return. Alternatively, customers can click 'initiate a return', print a return label and mail back. ReturnBear and The Bay are also working together through return inventory tracking and consolidated logistics, which creates transparency and service enhancements. For example, customers are able to access status updates on where their package is in transit, or timelines for refunds . Additionally, ReturnBear drop-off points within Hudson's Bay stores will also accept and process returns from other brands in the ReturnBear network. \"At The Bay, we put the customer first in every decision we make. We understand that returns are just a matter of doing business, and we want that part of the customer journey to be as satisfying as the shopping,\" says Margot Johnson, Chief Business Officer at The Bay. \"We want to ensure a seamless experience whether you are shopping for an item shipped by The Bay or a Marketplace partner. Our focus is an easy, quick and intuitive experience.\" \"Returns can be a pain point for Canadian shoppers, and retailers need to pay attention to their needs and expectations,\" said Sylvia Ng, Chief Executive Officer at ReturnBear. \"Providing such an efficient return process is a win-win - drastically enhancing both the customer and seller experience. We're very excited that The Bay has partnered with us at ReturnBear to provide consumers with better return options.\" The first ReturnBear locations, located in Hudson's Bay stores at or near the online pick up kiosks, have launched at Fairview Mall, Upper Canada Mall, Centrepoint Mall, Oakville Place, Bramalea City Centre, Markville Shopping Centre, Scarborough Town Centre, Erin Mills Town Centre, Mapleview Centre and Limeridge Mall. Following, openings are planned across the country in remaining Hudson's Bay locations. ABOUT THE BAY Through a digital-first, purpose-driven lens, The Bay helps Canadians live their best style of life. The Bay operates thebay.com featuring Marketplace, one of the largest premium life & style platforms in Canada, with a seamless connection to a network of 84 Hudson's Bay stores. The Bay has established a reputation for quality and style through an unrivaled assortment of products and categories including fashion, home, beauty, food concepts and more. Follow us on our social media channels: Instagram, Facebook, Twitter, TikTok. The Bay and Hudson's Bay operate under the HBC brand portfolio. Founded in 1670, HBC is North America's oldest company. The signature stripes are a registered trademark of HBC. ABOUT RETURNBEAR Founded in October 2021 with a mission to make returns convenient for consumers, profitable for merchants, and better for the planet, ReturnBear is Canada's first end-to-end returns and reverse logistics service. Brands using ReturnBear can offer self-serve exchanges and returns to their customers, along with convenient package-free drop-off options. They can count on ReturnBear's full-service quality control and processing to get products back into forward-supply faster, and can optimize returns and exchanges with advanced automations and analytics. ReturnBear is backed by Cadillac Fairview (CF) and Koru , an innovative venture foundry that builds new businesses to drive disruptive growth for Ontario Teachers' Pension Plan portfolio companies. ReturnBear is a modern solution that makes eCommerce exchanges and returns delightful for consumers, and more efficient for retailers by reducing the cost and complexity of their reverse logistics. SOURCE The Bay MEDIA CONTACTS: Lindsay Silverberg, Talk Shop Media, [email protected]; Tiffany Bourré, The Bay, DVP, Communications, PR & Heritage, tiffany.bourré@thebay.com","filter_flag":1}
{"title":"Recent Developments in Home Textiles - Fibre2fashion.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU0Ni9yZWNlbnQtZGV2ZWxvcG1lbnRzLWluLWhvbWUtdGV4dGlsZXPSAWFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk1NDYvcmVjZW50LWRldmVsb3BtZW50cy1pbi1ob21lLXRleHRpbGVzP2FtcD10cnVl?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU0Ni9yZWNlbnQtZGV2ZWxvcG1lbnRzLWluLWhvbWUtdGV4dGlsZXPSAWFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk1NDYvcmVjZW50LWRldmVsb3BtZW50cy1pbi1ob21lLXRleHRpbGVzP2FtcD10cnVl?oc=5","id":"CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU0Ni9yZWNlbnQtZGV2ZWxvcG1lbnRzLWluLWhvbWUtdGV4dGlsZXPSAWFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk1NDYvcmVjZW50LWRldmVsb3BtZW50cy1pbi1ob21lLXRleHRpbGVzP2FtcD10cnVl","guidislink":false,"published":"Thu, 12 Jan 2023 11:14:12 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=12, tm_hour=11, tm_min=14, tm_sec=12, tm_wday=3, tm_yday=12, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU0Ni9yZWNlbnQtZGV2ZWxvcG1lbnRzLWluLWhvbWUtdGV4dGlsZXPSAWFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk1NDYvcmVjZW50LWRldmVsb3BtZW50cy1pbi1ob21lLXRleHRpbGVzP2FtcD10cnVl?oc=5\" target=\"_blank\">Recent Developments in Home Textiles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Recent Developments in Home Textiles - Fibre2fashion.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiWGh0dHBzOi8vd3d3LmZpYnJlMmZhc2hpb24uY29tL2luZHVzdHJ5LWFydGljbGUvOTU0Ni9yZWNlbnQtZGV2ZWxvcG1lbnRzLWluLWhvbWUtdGV4dGlsZXPSAWFodHRwczovL3d3dy5maWJyZTJmYXNoaW9uLmNvbS9pbmR1c3RyeS1hcnRpY2xlLzk1NDYvcmVjZW50LWRldmVsb3BtZW50cy1pbi1ob21lLXRleHRpbGVzP2FtcD10cnVl?oc=5\" target=\"_blank\">Recent Developments in Home Textiles<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2fashion.com<\/font>","source.href":"https:\/\/www.fibre2fashion.com","source.title":"Fibre2fashion.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"The global home textiles market is one of the most profitable business segments in the global textile industry as it is witnessing a steady growth driven by factors like rising consumer spending on home renovation, fashion sensitivity towards household furnishing as well as growing real estate market among others. This feature captures what’s trending in the segment. The global home textiles market is estimated at $137 billion in 2022, growing at a CAGR of 3.8 per cent between 2016 and 2021. With an average growth of 3.5 per cent per annum it is projected to reach $152 billion in 2025. China and the US respectively account for approximately 29 per cent and 20 per cent share of this market, of which China is expected to grow at faster CAGR of close to 6 per cent between 2022 and 2025. China’s share in global textiles market is expected to rise from 25.4 per cent in 2016 to 31.6 per cent in 2025 while the share of the US is likely to decrease from 21.9 per cent to 19.5 per cent during the same period despite growing in value terms, according to Fibre2Fashion’s market insight tool TexPro. In terms of consumption, the US and Europe are the biggest consumers constituting around 60 per cent of the global home textile imports. On the supply side, countries like India, China and Pakistan stand as the key suppliers. The market trends in global home textiles sector not only help in estimating the market size and make projections but are also indicative of how the sector is shaping up. Developments and trends across the entire value chain encompassing retail, manufacturing, technology, innovation, sustainability and circularity, and colour and design is immensely contributing to the sector’s overall evolution. Let us have a look at them. DEVELOPMENTS IN RETAIL As end-part of value chain, retail reflects what consumers are looking for and how home retailers are responding to their changing tastes, demands and aspirations. Some of the top home retailers as well as those with significant home category share in their business reported key developments worth mentioning. IKEA World’s largest home retailer IKEA wants to invest in future. This made it devise a way to invite and incorporate participation from its consumers – not the adults but children. The Swedish retailer has an international digital panel named IKEA Kids Advisory Panel to get feedback from 40 children aged 8-14 years from all over the world. The panel shares feedback which shapes product development and design ideas – BLAVINGAD being one such range. Started selling in October in all IKEA markets, the new range with long-term vision is inspired by children’s curiosity about marine life and consists of vibrant new items which are not only expressive but playful too. The collection comprises soft toys of kids’ favourite marine animals, aquatic textiles, submarine and fishing games, and dreamy lighting for two age groups – 3 to 7 and 8+ years. On learning that children are concerned about the ocean and specifically the animals that call it home, IKEA based the design vision of BLAVINGAD around marine life which also consciously includes more sustainable materials, such as 100 per cent recycled polyester in select items (soft toys). The Panel feedback helped IKEA to know which ocean creatures the children from different countries like the most. As a result, the range ended up having characters of dolphins, orca, blue whale, turtle and octopus. IKEA also exhibited its social consciousness and responsibility during the year. In June, it launched a caring collection named VÅRDANDE inspired by the fundamentals of well-being and nourishing oneself. This is in partnership with five Asian social businesses – Classical (Bangladesh); Ramesh Flowers, Doi Tung (Thailand); Spun (India); and SAITEX (Vietnam) and aims at creating a better everyday life through long-term job opportunities and livelihood for vulnerable groups. Meaning ‘caring’ in Swedish language VÅRDANDE collection includes textile products such as kimono, yoga mats and blankets, a carrying basket, a soft storage solution, bowls and plant pots. A large part of this collection is either handmade or made in a sustainable industrial set up of five Asian partners. Most materials involved in producing the collection have been sourced locally like banana fibres, clay and jute. In case of cotton, it is sourced from more sustainable sources that require less water, pesticides and fertilisers. Since partners’ localised social businesses employ people who have difficulty in finding a job in the labour market, the collaboration has enabled handcrafted products made by them to sell in IKEA’s stores worldwide. Walmart The home category is attracting the attention of the world’s many top retailers, including Walmart. The retail giant expanded into home categories to meet the home décor and furniture needs for the entire family. It all began in June 2021 when Walmart unveiled Gap Home – an assortment running into 400 items including bedding and bath, home décor and tabletop. The first anniversary of this debut was marked in 2022 by launching a 200-item new category – Gap Home Kids, on its website. The range, the company says, offers prices that are parent-approved and styles that are kid-approved. The collection incorporates Gap’s signature chambrays, stripes and washed denim with kid-friendly colourways and prints. The GOTS (Global Organic Textile Standard) and OEKO-TEX Standard 100-certified collection comprises comforters, sheets, throws, shower curtains, bath rugs, towels and window panels, all constructed of organic cotton with tufted poly area rugs that are machine washable too. In addition to the online launch, Gap Home Kids made a foray into the physical space as well. For a limited time, the collection was shown at Hunker House – an experiential showroom from digital media brand Hunker, in the Abbot Kinney neighbourhood of Venice Beach. Lowe’s American home décor and textile retailer Lowe’s has similar plans to expand its home décor brands in stores and online via introduction of new brands. Implementing those plans, in February 2022 the retailer launched a new multi-category private label – Origin 21. Lowe’s private label is for millennial consumers who seek to modernise their home style. Origin 21 collection encompasses rugs and floor mats, curtains, decorative pillows and throws, furniture, patio furniture, mirrors, lighting, home accents, wall art, bathroom varieties and faucets, decorative shelving, outdoor pots and plants. Later in the year, this launch was followed by introduction of patio collection as well as replacement cushions made with fibres derived from recycled plastic bottles. Lowe’s acquiring of the carpet brand The Stainmaster in 2021 was also part of the expansion strategy. As has been proven time and again that private label is a lucrative option to fill demand gaps and enhance profit margins, Lowe’s expansion of brands underlines similar goals. Macy’s Another key development was observed in yet another American retailer Macy’s, when it launched its new ‘Own Your Style’ brand platform in March 2022 aiming to help customers discover and express their own personal style. Part of the company’s Polaris strategy, the new platform aims to position Macy’s as the go-source for fashion and style, involving digital and social-first experiences, branded content, sequenced storytelling, in-person expert advice and personalised data-driven recommendations. The site launch highlighted inspirational trends in home – Hello There, Sunshine and Contemporary Home – as well as apparel-oriented trends for prom, swim, vacation wear, and men’s and women’s clothing. Curated products within the home-themed trends included fashion bedding, tabletop, kitchen and dining wares, decorative pillows, furniture, candles\/aromatics, home décor, lighting and rugs. In addition to the digital experience, Macy’s stores feature monthly ‘Own Your Style’ and ‘Now Trending’ pavilions stocked with key items. To support the project, Macy’s reintroduced Macy’s Style Crew – a diverse community of in-house style experts. Their social media followers and Macy’s customers gave tips, live demos, product tutorials and recommendations. Bed Bath & Beyond While Lowe’s attempted expanding its brand portfolio, others like Bed Bath & Beyond chose to resurrect their existing operations by taking a pause. In September 2022, Bed Bath & Beyond candidly revealed its store closure plan with first group of 150 stores to be axed. The store closures across nearly 2 dozen states in the US also included a one-time must-see location on E Ridgewood Avenue in Paramus Mall, NJ near its headquarters. More than 50 stores constituted the first round of closure and the states with largest number of stores happened to be California (8), Illinois (6) and New York (5). The shuttering of stores is being attributed to the company’s decision of financial restructuring. Other measures of restructuring include cutting staff across corporate and supply chain offices by 20 per cent and slashing the capital expenditure, largely by pausing new store openings and remodelling. Online Retail Online retailers are also not far behind in contributing to new developments. There is an instance of San Francisco-based DTC brand Coyuchi – a pioneer in organic luxury linens, which chose to giving its customers a hands-on experience through opening stores. The brand opened new store in Palo Alto, California. The sustainable living brand’s new store is located in Town & country Village – a neighbourhood shopping centre with restaurants and specialty shops. The brand has a neighbourhood of like-minded luxury stores such as Sur La Table, Diptyque, Marine Layer, Hudson Grace and more. Opened on November 18, 2022, the 1,300 sq ft store is Coyuchi’s second retail location after Point Reyes Station that opened long back in 2008. With new CEO at helm, the store expansion is part of the company’s growth strategy. Coyuchi’s stores are staffed by ‘natural home advisors’. The new store offers coastal design inspiration, a robust display of swatches and a large interactive touchscreen to revive all possible colour and textile options. The Palo Alto store provides the brand a space to bring together industry leaders and partners, educate customers and the local community, raise awareness for the brand’s sustainability besides fostering Coyuchi’s growing community. BACKEND DEVELOPMENTS The backend of the sector was also abuzz with developments in manufacturing and supplying side as well as among textile companies, ranging from collaboration to latest technology adoption and from strategising sourcing to making a comeback. Widened Sourcing Learning from COVID experience, the global home textile companies are expanding their sourcing base. Following the trend, Dubai-based Texlynx plans to expand its global buying footprint into more countries. Celebrating its 25th anniversary this year, the company offering consulting and brand development services as well as third-party inspections, and having core products of fabrics and yarn, home textiles for retail and hospitality, medical textiles and apparel, announced opening of sourcing offices in Myanmar and Vietnam starting in mid-2023. An office in Uzbekistan later part of 2023 will also follow. The new offices will source microfibre and 100 per cent polyester-filled home textiles. It will also add sports-related items to its new Vietnam operation. The company currently operates buying offices in China, India, Italy, Pakistan, Turkey and the US, besides having partner offices in Chile, Indonesia, Thailand and Vietnam. Collaborations US-based soft home and bath products specialist Parkview Home Textiles added a new brand to its portfolio via a licensing agreement with Bluestar Alliance to produce and distribute home textiles for Kensie – a fashion apparel brand for women and girls that is sold in major department stores and boutiques across the US and Canada. The multi-year agreement covers a range of products including quilts, comforters, sheets, blankets, pillows, curtains, rugs and shower accessories. The Kensie brand is globally recognised for its contemporary designs suiting the modern women’s active lifestyle. The brand now looks forward to expanding in the home textiles and soft goods categories incorporating design from its RTW (ready to wear) and accessory collections. The new Kensie home textiles and soft goods collection will begin shipping in the first quarter of 2023. The Brooklyn-based company West Elm Kids also built on a partnership launched last spring to create a curated collection of textiles and decorative accessories. West Elm Kids collection, in collaboration with designer Sarah Samuel, featured 33 holiday-themed items inspired by The Nutcracker, including sheets, pillows, a signature rug, a play tent, pyjamas, lighting and an advent calendar. It is Samuel’s second collection with West Elm Kids that includes her love of patterns, pom-poms and a playful palette which is perfect for the holidays at home with the kids. Making a Comeback Lillian August’s Lifestyle brand returned to the fabric market by entering into a licensing agreement with Tempo Upholstery and Drapery Fabrics Inc to manufacture decorative pillows, outdoor cushions, and fabrics with high performance characteristics for both indoor and outdoor use. The new collection will be a perfect marriage of Lillian’s design elements with Tempo’s quality performance fabrics, pillows and cushions, technical and customisation capabilities and supply chain efficiencies. As a company Tempo operates two divisions – Tempo Fabrics and Tempo Home, and sells premium products to consumers, retailers, furniture manufacturers and brands. The partnership marks Lillian August brand’s return to the fabric market which is how the company started many years ago. The first collection, produced by Tempo for Lillian August, will be launched this fall and will be a signature Lillian August mix of palettes, patterns, materials and textures. The initial introduction will include indoor and outdoor performance fabrics as well as outdoor pillows. Innovation The major US home textiles supplier Standard Fiber which specialises in performance technologies that improve sleep, wellness and comfort, has introduced an innovative collection of pet products under its new Petnology brand which includes products for a variety of different pet personas. Each collection within Petnology brand will feature a pet personality and enhanced product attributes that will make it easily relatable, fun and functional unique to their character. The collection incorporates technology in easy-to-understand solutions for pet owners. Additional branded accessories will join into the product mix later in 2023. Technology At ISPO Munich fair, HeiQ unveiled its bio-based proprietary textile technology HeiQ Mint Odour. The plant-based technology is designed to make textiles smell fresh even after repeated use. This allows home textiles and clothing to be washed less frequently. The technology is jointly developed with Patagonia to address body odours on textiles. HeiQ Mint is OKEO-TEX certified, Bluesign approved and ZDHC complaint, while USDA bio-preferred certification is currently in progress. Luxury Aesthetics French luxury design house Hermès introduced a new home collection centred on colour-blocked textiles that are light as air. First time presented during the Milan Design Week at Salone del Mobile in June 2022, textiles are the central theme of the entire home collection – six creations (five plaids and a bed cover) made in cashmere – one of the mansion’s favourite materials. The textiles explore the different processing techniques: cashmere strips form the design of the plaids; the intertwined and hand-dyed squares make up a large patchwork in lustrous tones; the geometric shapes, assembled with a connection technique, evoke the image of stained-glass windows. A large, quilted bedspread brings together colours, patchwork and the traditional quilting technique. Additionally, there is also the porcelain service and the designer Coulisse lamp, presented in a new version that is covered in a hand-painted parachute fabric. SUSTAINABILITY & CIRCULARITY Textiles are an integral part of modern life. The material applications and the manufacturing processes are no less manifold. This presents a great challenge for the international textile industry since it obtains raw materials from a broad spectrum of sources and uses numerous processes to make a huge variety of products. Thus, there is a great potential for the sustainable development of the industry in today’s time as well as in the future. The industry keeps seeking ways for sustainable development. Amidst the state of environmental emergency that we are currently living through, the textile industry has a responsibility to examine its processes and bring required change. There is a need to take materials first approach and focus on the sourcing, design and sustainability of materials. Keeping this at the core, many industry players are working towards sustainability and circularity. Macy’s, for instance, announced a sustainable initiative programme to drive a circular future wherein textiles play a significant role. In 2022 beginning, Macy’s became part of the Ellen MacArthur Foundation community that focuses on accelerating and enabling the transition to a global, circular economy and FABSCRAP – a non-profit in New York city that helps to ensure that the fabric waste from the design and development process is reused, upcycled, down cycled and recycled responsibly. With an objective to reduce waste, Macy’s team embraced a technology that allows the scaling back of the number of physical samples required from suppliers without impacting fit, colour, and other design aspects. The process significantly reduced textile waste. While only 5 per cent of samples were digital in 2019, the share of all virtually-made samples increased to 61 per cent in 2022. Simultaneously, the Macy’s reverse logistics team is also working to move goods from customers back to the sellers, or manufacturers, or sold to resellers to continue the lifecycle of the product. This is being done to reuse and extend the life of all products. Through its partnership with Give Back Box, Macy’s customers can contribute to the responsible lifecycle of their clothes, toys and other pre-used items by downloading a pre-paid shipping label from Macy’s website and sending them to be donated for resale and recycling. Macy’s has also adopted best practices to reduce packaging, including standardising the size of packing cartons and minimising packaging materials. Macy’s is not the only player in the industry which is consistently developing ideas and solutions around circularity in textiles. Many others are seeking more sustainable ways to produce textiles and recycling options within the framework of the circular economy marked by continuous reuse of materials. The approach not only reduces the need for new raw materials but also cuts the amount of waste generated. In technical cycle, inorganic materials such as nylon, polyester, plastic and metal are being recycled with no loss of quality. In the biological cycle, ways to return organic materials such as linen and bast fibres to nature at the end of their useful life are being adopted. COLOUR & DESIGN TRENDS Going by Heimtextil – one of industry’s most important global event for interior textiles, interior design and interior trends, the mood for upcoming season with new products and designs can be gauged. Its special summer edition Heimtextil 2022 displayed home textile and colour trends for 2023 under the overarching theme ‘Next Horizons’. The theme comprised 4 colour palette trends – Empowered & Beyond Identity and Deep & Hyper Nature, focusing on sustainability and conservation: Empowered Identity: This colour forecast encourages new ways of seeing old crafts, heritages and expressions in a new and modern way. The colour trend represents a collaboration with the past and connects cultures with the next generations by driving sustainable transformation. The Empowered Identity colour palette consists of bold primary colours such as Raw Umber, Prussian Blue, Vermillion etc. These colours resemble their colour pigment origins. The bold colour trend is relevant for the extrovert who are driven by curiosity and the new things, and effect change. The textile trends in 2023 to go along with these colours will result in upcycled and recycled materials such as recycled synthetic fabrics, embroidered applique, and chunky woollen weaves. Beyond Identity: This trend shatters the myth that sustainability needs to be earthy only, instead offers a positive message that it can be colourful too. This is why Beyond Identity features a range of pastels which are not just sweet but aggressive as well. In this colour trend, sustainability is not down-toned but rather transforms in the vibrant pastel colour palette. Targeted at a younger consumer, the colour trend showcases flowing textiles and billowy shapes. This is exemplified in making natural textile dyes created by using food waste such as red onion peel and avocado seeds. Illustrated by fluidity, the colours symbolise the identities in flux. This colour palette includes 8 Pantone shades – 12-0646 TCX, 13-1208 TCX, 14- 4311 TCX, 14-6312 TCX, 15-1216 TCX, 16- 1452 TCX, 17-3802 TCX and 17-3936 TCX. Deep Nature: This colour trend is a continuing one that has been ongoing hence more familiar. The trend is inspired by higher understanding of resources and ecosystems. It puts into a collaboration that is upbeat and modern. The trend is geared to the consciously aware consumer and realised for the home with a modern edge. It is for a world that has just started to understand the imbalance of nature and is only in the beginning stages of taking action to rebalance. The trend also exhibits a move away from linear production with some textiles like leek paper–a more scalable textile made of fungi mycelium—and eel grass that has the ability to regenerate in addition to being biodegradable. The Deep Nature colour palette also includes 8 shades of Pantone – 13-1010 TCX, 15-1119 TCX, 16-1506 TCX, 17-0636 TCX, 18-1616 TCX, 18-4011 TCX, 18-1048 TCX and 19-0608 TCX. Hyper Nature: Centred around the fusing of digitalisation and nature, the Hyper Nature is a dynamic mix having a high visual expression which connects tech and nature to create a more sustainable environment. For instance, creating a blanket with natural, organic motif using a digital approach; or the digital art such as images that also include the leek fields in Amsterdam. Through the use of photobiology, light science technology and the use of LED lights, the use of pesticides in the leek fields is decreased by up to 50 per cent, protecting the planet in the process. At the same time, the textiles that shape the Hyper Nature trend have a digital-like quality to them as they represent nature in the metaverse. The Hyper Nature colour palette includes Pantones 14-1323 TCX, 14-0627 TCX, 15- 0343 TCX, 16-5810 TCX, 17- 0610 TCX, 18- 0724 TCX, 18-1741 TCX and 19-3842 TCX. FURNITURE DESIGN & COLOURS The pandemic introduced concept of ‘Work From Home’ made home, first by compulsion then pleasure, the place of refuge in which people want to spend best of one’s life. This new way of living craves for the living space to be beautiful and personalised as home becomes a place to both enjoy leisure time and to work with concentration. This has brought a change in the furniture and design aspects towards new solutions that express a sense of regeneration from old spaces, with emotion-expressing colours being one of them. For 2023, purple, dove grey and emerald green are projected as key design colours by Italian furniture company Arredare Moderno. Purple, an elegant and refined colour, is associated with both creativity and romanticism and proves to be extremely versatile as it can adapt to both modern and classic styles characterising daytime and night-time environments. Dove grey, one of the most widely used neutral shades in interior design in recent years, gives the room a feeling of spaciousness and creates a very cosy space. Emerald green, which expresses elegance, was once reserved only for elegant interiors but is now becoming the hero of any room in interior design. Additionally, the colour trend institutes have predicted three trendy colour combination palettes that will be found in proposals from the worlds of fashion, design and home – multicolour palette (purple, fuchsia, black and orange), delicate palette (dove grey, light blue, camel and grey), and evergreen palette representing all shades of green. It is predicted that furniture will be made of more sustainable materials such as bamboo, cork and wool. They will also be made from more unusual fabrics in response to the growing trend of ‘upcycling’ and the desire to stand out from the crowd. Some of the most popular unusual fabrics include vinyl, parachute fabric and wire mesh. FORECAST 2023 The global home textiles in 2023 is going to be exciting area. Some of the ongoing efforts of 2022 will continue, some will accelerate while the new ones that will emerge, will shape the sector’s quality output and efficiencies. The year is expected to witness an increased use of local resources, equipment and services; environment-friendly material alternatives; existing stock components; rented and loaned materials, responsible waste management; and design for recyclability. Though the action to recover from the imbalance created in our ecosystem over the last several centuries has already begun, 2023 is expected to witness the real change that needs to happen. In addition, a move from linear production to the one with circular mindset is expected too, along with more use of bio-(biodegradable) plastics.","filter_flag":1}
{"title":"How Influencer Marketing will Change the Business Landscape in 2023 - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9ob3ctaW5mbHVlbmNlci1tYXJrZXRpbmctd2lsbC1jaGFuZ2UtYnVzaW5lc3PSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9ob3ctaW5mbHVlbmNlci1tYXJrZXRpbmctd2lsbC1jaGFuZ2UtYnVzaW5lc3PSAQA?oc=5","id":"CBMieWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9ob3ctaW5mbHVlbmNlci1tYXJrZXRpbmctd2lsbC1jaGFuZ2UtYnVzaW5lc3PSAQA","guidislink":false,"published":"Sat, 07 Jan 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=1, tm_mday=7, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=5, tm_yday=7, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9ob3ctaW5mbHVlbmNlci1tYXJrZXRpbmctd2lsbC1jaGFuZ2UtYnVzaW5lc3PSAQA?oc=5\" target=\"_blank\">How Influencer Marketing will Change the Business Landscape in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How Influencer Marketing will Change the Business Landscape in 2023 - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9ob3ctaW5mbHVlbmNlci1tYXJrZXRpbmctd2lsbC1jaGFuZ2UtYnVzaW5lc3PSAQA?oc=5\" target=\"_blank\">How Influencer Marketing will Change the Business Landscape in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-01-01+before:2023-01-31","text":"FROM BYTES TO BITES: How AI is Transforming Food and Agriculture The world's population is experiencing a rapid surge, and it is foreseen to approach a staggering 9.7 billion individuals by the year 2050. Consequently, this escalating growth has engendered a mounting apprehension regarding the ability to satisfy the escalating demand for sustenance, all while ensuring the vital aspects of food security and sustainability remain intact. In light of these concerns, the integration of artificial intelligence (AI) applications in the agri-food sector holds extraordinary potential to revolutionize the industry, heralding a new era of heightened sustainability. Artificial intelligence (AI) embodies the capacity of machines or computer programs to undertake endeavours typically reliant on human intellect, encompassing domains such as learning, reasoning, problem-solving, and decision-making. The realm of AI encompasses diverse subfields, each contributing unique capabilities to this expansive discipline. These subfields encompass machine learning (ML), deep learning, natural language processing, computer vision, robotics, and cognitive computing. Within AI technology, a plethora of algorithms emerges, including reinforcement learning, swarm intelligence, cognitive science, expert systems, fuzzy logic (FL), Artificial Neural Networks (ANN), and Logic Programming, offering a rich tapestry of tools to leverage in pursuit of intelligent automation. Innovative Applications of AI in Food and Agriculture GRAIN QUALITY Manual grain inspection is a time-consuming process and is prone to human error, which can result in the selection of lower-quality grains. Therefore, the use of computer vision systems in grain inspection is becoming increasingly popular. These systems use advanced imaging techniques and ML algorithms to analyse images of grains and identify defects or impurities, such as broken kernels, foreign materials etc. Back propagation neural network (BPNN) has been effectively used to classify rice grain varieties with great accuracy (96%), even with poor image quality. PEST DETECTION AND WEED MANAGEMENT Accurate identification of insect species, size variation, and stage of development is crucial for effective pest management in agriculture. By identifying the type and number of insects present in a crop field, farmers can take appropriate measures to control the pest population and prevent damage to their crops. Several AI and ML technologies are being developed and tested for insect detection and counting. Some of these technologies use computer vision algorithms, while others rely on ML algorithms to identify and classify different insect species. Similarly, herbicides have been widely used by farmers for many years to control weeds and improve crop yields. However, the overuse or improper application of herbicides can have negative impacts on both human health and the environment. To minimize the negative impacts of herbicides, there is a growing need for more precise and accurate application methods. Robotic weed control is also an emerging technology that shows great promise for the future of agriculture. Robotic weed control systems typically use computer vision and ML algorithms to detect and identify weeds in crop fields, then use robotic arms or other mechanical tools to remove or destroy the weeds. Although intelligent mechanical weed control would be more felicitous than weeding devices with cutting action, contrary to time-based weed removal, it is possible to remotely regulate the tendency of tines of spring-tine harrow prototype systems based on the conditions of soil, the density of weed, and crop production. CROP SELECTION AND YIELD IMPROVEMENT Robots, such as the Berry 5 Robot from Harvest Croo Robotics (Tampa, FL, USA), are designed to automate the harvesting of strawberries, which is a labour-intensive and time-consuming process. The robot uses computer vision and ML algorithms to identify and pick ripe strawberries at a faster rate than humans can. This can help farmers to reduce labour costs and improve their yields by ensuring that more strawberries are harvested at the optimal time. FOOD SAFETY COMPLIANCE AI enabled cameras are used to ensure safety compliance amongst food workers in food facility. This employs facial-recognition and object-recognition software to determine whether workers are complying with good personal hygiene as required by food safety law. If violation is found, it extracts the screen images for review which can be rectified in the real time. The accuracy of this technology is more than 96%. PRODUCT DEVELOPMENT AI technology uses machine learning and predictive algorithms to model consumer flavour preferences and predict how well they will respond to new tastes. The data can be segmented into demographic groups to help companies develop new products that match the preferences of their target audience. With these, manufacturers could know what products will thrive before the hit the shelves. Companies like SPOONSHOT are using AI techniques like NLP (natural language processing) and computer vision to build organised information from unstructured data. They leverage food science domain knowledge to process data relating to physical and chemical properties of ingredients to understand how ingredient interactions impact a final recipe. SPOONSHOT can scout 3B social conversations, 5M research papers, 84M articles, 4M products, 84M blogs etc to provide actionable insights around product concepts, product and menu innovations, consumer market insights, competitor analysis etc. MARKET RESEARCH AND SALES ENABLEMENT AI offers tremendous potential to assist in market research within the food industry, providing valuable insights and facilitating better decision-making. AI algorithms can analyse vast amounts of data, including consumer preferences, purchasing behaviour, and social media interactions related to food. By recognizing patterns and correlations, AI can identify emerging trends, understand consumer preferences, and predict future demands accurately. This information can help food businesses tailor their products, marketing strategies, and overall consumer experience to meet evolving customer needs. Social listening tools like CRIMSON HEXAGON and SYNTHESIO helps generate valuable insights around audience analysis, brand intelligence, campaign analysis, customer sentiment, market research, trend analysis, competitor analysis etc, helping make smarter, data-driven decisions. (11) In the current attention-driven economy, where capturing and retaining attention is challenging due to the overwhelming choices and distractions faced by consumers, traditional market research methods have their limitations. However, AI-powered research offers a promising solution by providing rapid, reliable, and actionable insights. Companies like THE LIGHTBULB.AI leverage AI-enabled technology to offer a range of research services. These include qualitative and quantitative research, ad testing, as well as UI\/UX testing. Their advanced capabilities encompass facial coding, eye tracking, speech transcription, text sentiment analysis, and audio tonality analysis. These modules enable comprehensive analysis and understanding of user experiences and preferences. By harnessing AI in research, businesses can overcome the shortcomings of traditional methods and gain a deeper understanding of consumer behaviour. AI-based research offers the advantage of speed, accuracy, and scalability, allowing companies to adapt swiftly to evolving market dynamics and make informed decisions based on robust data-driven insights. AI can significantly contribute to sales enablement by providing valuable insights, automating tasks, and enhancing overall sales efficiency. INFILECT, a leading provider of advanced retail visual intelligence, offers cutting-edge solutions that can greatly boost sales for organizations. With their advanced image recognition technology and retail data analytics capabilities, Infilect empowers businesses to improve shelf visibility and enhance store execution performance. By analysing visual data, such as product placement, stock availability, and planogram compliance, Infilect provides valuable insights to optimize sales strategies and improve overall retail performance. CONCLUSION In conclusion, the transformational power of AI in the food and agriculture industry is undeniable. From bytes of data to the very bites we consume, AI has become a driving force behind enhanced productivity, sustainability, and innovation. Through advanced algorithms and data-driven insights, AI is optimizing crop management, improving yield predictions, and revolutionizing farming practices. It is enabling precise monitoring of soil conditions, crop health, and irrigation needs, leading to resource-efficient and environmentally conscious agricultural operations. Furthermore, AI is enhancing food safety by rapidly detecting and mitigating risks associated with contaminants, pests, and diseases. It is facilitating traceability and supply chain transparency, ensuring that consumers have access to safe and high-quality food. Beyond the farm, AI is revolutionizing food production, from automated processing and packaging to personalized nutrition recommendations. It is driving the development of novel ingredients and flavors, expanding the boundaries of culinary creativity. However, it is essential to recognize that the adoption of AI in the food and agriculture sector is an ongoing journey. Challenges such as data privacy, infrastructure limitations, and ethical considerations must be addressed to fully harness the potential of AI while ensuring equitable access and sustainable practices. In this age of bytes and bites, AI holds the promise of a transformative future for food and agriculture, ushering in a new era of abundance, efficiency, and global nourishment. Let us seize the opportunities that lie ahead and embrace AI as a powerful ally in creating a more sustainable, resilient, and inclusive food system for generations to come. Bharat Sawnani is the founder of Elevantus with 14 years' experience across innovation, technology, quality, and 6 years in clinical pharmacokinetics.","filter_flag":1}
