{"title":"Digital Twins & CPG Manufacturing Transformation - Consumer Goods Technology","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZGlnaXRhbC10d2lucy1jcGctbWFudWZhY3R1cmluZy10cmFuc2Zvcm1hdGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZGlnaXRhbC10d2lucy1jcGctbWFudWZhY3R1cmluZy10cmFuc2Zvcm1hdGlvbtIBAA?oc=5","id":"CBMiSGh0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZGlnaXRhbC10d2lucy1jcGctbWFudWZhY3R1cmluZy10cmFuc2Zvcm1hdGlvbtIBAA","guidislink":false,"published":"Wed, 01 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=1, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=60, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZGlnaXRhbC10d2lucy1jcGctbWFudWZhY3R1cmluZy10cmFuc2Zvcm1hdGlvbtIBAA?oc=5\" target=\"_blank\">Digital Twins & CPG Manufacturing Transformation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Consumer Goods Technology<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Digital Twins & CPG Manufacturing Transformation - Consumer Goods Technology","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSGh0dHBzOi8vY29uc3VtZXJnb29kcy5jb20vZGlnaXRhbC10d2lucy1jcGctbWFudWZhY3R1cmluZy10cmFuc2Zvcm1hdGlvbtIBAA?oc=5\" target=\"_blank\">Digital Twins & CPG Manufacturing Transformation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Consumer Goods Technology<\/font>","source.href":"https:\/\/consumergoods.com","source.title":"Consumer Goods Technology","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Production\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"The four key elements of a Digital Twin are (1) the physical system, (2) the digital representation, (3) the connectivity between the two, and (4) the business outcome. The first element, the physical system itself, can be an individual physical entity, an assembly of physical entities, a physical process, or even a person. It doesn’t necessarily have to be an industrial system but can be a biological, chemical, ecological, or any other system. The second element is the digital representation, which is the model itself. This is not just a collection of data, such as a data model that represents the structure of the physical system, or an IoT data dashboard that represents the current state of the physical system. A Digital Twin is a model that emulates or simulates the behavior of the physical system, such that when you give it an input, the model returns a response or output. This leads to the third element, connectivity. A true Digital Twin must be regularly updated with data from the physical system (often using IoT sensors). A validated model provides a snapshot of the behavior of the physical system at a moment in time, and a Digital Twin extends the model to where the physical system’s behavior changes significantly from the original. The frequency of the updates is dictated by the rate at which the underlying changes occur. Some use cases require near real-time updates, whereas others require only weekly updates. Lastly, the Digital Twin must drive a specific outcome related to some kind of economic or business value. And thus, drive business decisions on the managed process. The key difference between a Digital Twin and traditional modeling is the information flow between the digital and physical systems. A common misconception of a Digital Twin is that it is simply a more complex, higher fidelity virtual representation. Actually, it is the regular updating that is the key difference and directly impacts both how data is collected throughout the life cycle and how Digital Twins are constructed. A Digital Twin must consume the data streams to understand the present state of the system, learn from and update itself with new observations of the system, and be able to make predictions of the current and future behavior of the system. For example, a Digital Twin of a carbonated beverage line ingests temperature and pressure data from IoT devices to predict leakage, breaks, quality and non-observable operational elements of the flow. Results of visual inspections from periodic maintenance are used to update the Digital Twin. The Digital Twin is then used to make predictions of downtime and remaining useful life under different operational conditions and maintenance scenarios, enabling the operator to select the best maintenance schedule and plan. Output from the Digital Twin can then be shown to the process owner via a dashboard. Although CAD models, IoT dashboards, 3D renderings, immersive walkthroughs, and gaming environments are not Digital Twins by themselves, they can represent useful visualizations and building blocks of Digital Twin solutions and can be the first steps in a Digital Twin journey. Why Digital Twins in CPG Now? Four key technologies are needed to develop and deploy Digital Twins at-scale: data from the physical system, IoT connectivity, modeling methods, and at-scale computing. Each of these technologies have been developed in parallel over the past 20 years. In the 2020s, they have converged to enable Digital Twins at scale in the consumer packaged goods (CPG) industry.","filter_flag":1}
{"title":"Forever chemicals PFAS won't be in office supplies from 3M - Inhabitat","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaW5oYWJpdGF0LmNvbS9mb3JldmVyLWNoZW1pY2Fscy1wZmFzLXdvbnQtYmUtaW4tb2ZmaWNlLXN1cHBsaWVzLWZyb20tM20v0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaW5oYWJpdGF0LmNvbS9mb3JldmVyLWNoZW1pY2Fscy1wZmFzLXdvbnQtYmUtaW4tb2ZmaWNlLXN1cHBsaWVzLWZyb20tM20v0gEA?oc=5","id":"CBMiUGh0dHBzOi8vaW5oYWJpdGF0LmNvbS9mb3JldmVyLWNoZW1pY2Fscy1wZmFzLXdvbnQtYmUtaW4tb2ZmaWNlLXN1cHBsaWVzLWZyb20tM20v0gEA","guidislink":false,"published":"Fri, 24 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=83, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaW5oYWJpdGF0LmNvbS9mb3JldmVyLWNoZW1pY2Fscy1wZmFzLXdvbnQtYmUtaW4tb2ZmaWNlLXN1cHBsaWVzLWZyb20tM20v0gEA?oc=5\" target=\"_blank\">Forever chemicals PFAS won't be in office supplies from 3M<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Forever chemicals PFAS won't be in office supplies from 3M - Inhabitat","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUGh0dHBzOi8vaW5oYWJpdGF0LmNvbS9mb3JldmVyLWNoZW1pY2Fscy1wZmFzLXdvbnQtYmUtaW4tb2ZmaWNlLXN1cHBsaWVzLWZyb20tM20v0gEA?oc=5\" target=\"_blank\">Forever chemicals PFAS won't be in office supplies from 3M<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Inhabitat<\/font>","source.href":"https:\/\/inhabitat.com","source.title":"Inhabitat","query":"https:\/\/news.google.com\/rss\/search?q=\"Clean Production\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"So-called “forever chemicals” are hazardous chemicals that don’t break down over time and can accumulate in the bodies of humans and animals, causing brain damage and diseases such as cancer. 3M announced it will stop making such forever chemicals starting in 2025, an important step that sets the tone for other companies and chemical manufacturers. Forever chemicals such as PFAS have famously poisoned the water system in parts of Michigan and other U.S. states and are challenging to clean up or track. This leaves private citizens not knowing if they are ingesting chemicals in tap water or while swimming in public waters. Continue reading below Our Featured Videos PFAS: how forever chemicals damage health and the environment 3M is a company that primarily manufacturers weak adhesives used in Post-It notes and Scotch tape. It was quite by accident that someone at the company invented an adhesive that had temporary but reusable hold several decades back. Now, the company has announced it will stop making controversial per and polyfluoroalkyl substances, also called PFAS, by the end of 2025. PFAS chemicals, or forever chemicals, are found in household items and are used to make technology such as Teflon pan coating or other products that repel water, heat, oil and grease. Sprays for waterproofing or stain-proofing furniture and carpets, non-stick coatings on cooking utensils and adhesives used in various types of tapes and sticky notes, as well as industrial paints and chrome plating all contain PFAS. This chemical can leak into ground water from industrial storage, and was often released into waterways due to lack of regulations until the last few years when the adverse health effects became apparent. Scientific studies now point to PFAS being dangerous to human health and animal life at concentrations thousands of times lower than previously estimated. The EPA reports PFAS effects on health include links to cancer. The EPA website on PFAS reports what we know so far about PFAS: – PFAS are widely used, long lasting chemicals, components of which break down very slowly over time. – Because of their widespread use and their persistence in the environment, many PFAS are found in the blood of people and animals all over the world and are present at low levels in a variety of food products and in the environment. – PFAS are found in water, air, fish and soil at locations across the nation and the globe. – Scientific studies have shown that exposure to some PFAS in the environment may be linked to harmful health effects in humans and animals. – There are thousands of PFAS chemicals, and they are found in many different consumer, commercial and industrial products. This makes it challenging to study and assess the potential human health and environmental risks. In a statement, 3M said its decision to cease manufacturing of PFAS chemicals is “based on careful consideration and a thorough evaluation of the evolving external landscape,” including acknowledging that regulations are now cracking down on PFAS chemicals. In other words, it’s time for chemical manufacturers to find alternatives to harmful forever chemicals or be regulated out of profitability. What alternatives are there to PFAS chemicals? Products that use forever chemicals include adhesives, cleaner, and industrial products such as chrome plating for vehicles. They build up in the environment, particularly in soil or waterways, which lead to animal and human ingestion or contact through the skin. Some people who have come in contact with forever chemicals from living in the shadow of chemical plants have developed reproductive disorders and cancers. The EPA reports the following ways to come in contact with PFAS chemicals: – Drinking water – in public drinking water systems and private drinking water wells. – in public drinking water systems and private drinking water wells. – Soil and water at or near waste sites – at landfills, disposal sites and hazardous waste sites such as those that fall under the federal Superfund and Resource Conservation and Recovery Act programs. – at landfills, disposal sites and hazardous waste sites such as those that fall under the federal Superfund and Resource Conservation and Recovery Act programs. – Fire extinguishing foam – in aqueous film-forming foams (or AFFFs) used to extinguish flammable liquid-based fires. Such foams are used in training and emergency response events at airports, shipyards, military bases, firefighting training facilities, chemical plants and refineries. – in aqueous film-forming foams (or AFFFs) used to extinguish flammable liquid-based fires. Such foams are used in training and emergency response events at airports, shipyards, military bases, firefighting training facilities, chemical plants and refineries. – Manufacturing or chemical production facilities that produce or use PFAS – for example at chrome plating, electronics and certain textile and paper manufacturers. – for example at chrome plating, electronics and certain textile and paper manufacturers. – Food – for example in fish caught from water contaminated by PFAS and dairy products from livestock exposed to PFAS. – for example in fish caught from water contaminated by PFAS and dairy products from livestock exposed to PFAS. – Food packaging – for example in grease-resistant paper, fast food containers\/wrappers, microwave popcorn bags, pizza boxes and candy wrappers. – for example in grease-resistant paper, fast food containers\/wrappers, microwave popcorn bags, pizza boxes and candy wrappers. – Household products and dust – for example in stain and water-repellent used on carpets, upholstery, clothing and other fabrics; cleaning products; non-stick cookware; paints, varnishes and sealants. – for example in stain and water-repellent used on carpets, upholstery, clothing and other fabrics; cleaning products; non-stick cookware; paints, varnishes and sealants. – Personal care products – for example in certain shampoo, dental floss and cosmetics. – for example in certain shampoo, dental floss and cosmetics. – Biosolids – for example fertilizer from wastewater treatment plants that is used on agricultural lands can affect ground and surface water and animals that graze on the land. So what are the alternatives to such ubiquitous products? Clean Production Action says that Polylactic Acid (PLA) is a compostable plastic typically made from corn. It’s made by a number of manufacturers, including Natureworks under the Ingeo brand and used by Eco-Products, Greensafe Products, GrowPlastics and World Centric that serves as an alternative to PFAS in plastic food packaging. As new products are developed to replace PFAS, multiple solutions such as bioplastics and safer waterproofing chemicals may replace forever chemicals. It is companies such as 3M that are ideally positioned to research and develop these safer alternatives. For the moment, avoiding the following products and replacing them with biodegradable, plastic-free and chemical-coating-free alternatives is the best way to avoid PFAS. You can also filter your water with reverse osmosis and avoid rivers near industrial plants that are known exposure sites to PFAS. The CDC lists the following as the most common products that contain PFAS that you should avoid: – Some grease-resistant paper, fast food containers\/wrappers, microwave popcorn bags, pizza boxes and candy wrappers – Stain resistant coatings used on carpets, upholstery and other fabrics – Water resistant clothing – Cleaning products – Personal care products (shampoo, dental floss) and cosmetics (nail polish, eye makeup) How 3M’s announcement sets a precedent 3M expects to take a financial hit of $1.3 to $2.3 billion over the next few years because of the PFAS discontinuation. But the company is not just doing this because the writing is on the wall: forever chemicals represent a small portion of revenue for 3M. Over the past decade, a number of chemical manufacturers have voluntarily stopped producing two of the top forever chemicals, PFOS and PFOA. The U.S. Food and Drug Administration phased out the use of some PFAS chemicals in 2016. The FDA and manufacturers agreed in 2020 to additionally phase out some PFAS chemicals from food packaging and items that came into contact with food. Unfortunately, FDA monitoring has shown that the chemicals tend to linger anyway. The road map forward involves government oversight and increased regulation, cleanup of polluted sites and replacement of forever chemicals with safer and biodegradable alternatives. Toxic Free Future lists a number of retailers and other companies as having adopted policies to phase out or ban PFAS in their retail products. Companies still using PFAS you might want to avoid include Arkema, Asahi, BASF (Ciba), Clariant, Daikin, DuPont (PFAS business now under the name Chemours), Dyneon (3M) and Solvay. 3M’s announcement sets a precedent that the time to move on from PFAS is now. Consumer pressure, government regulation and fines and the profitability of a clean future will slowly drive chemical manufacturers to safer substitutes to PFAS. You can help by supporting clean businesses that use alternatives to plastics and styrofoam, chemical additives, harsh cleansers and waterproofing\/stain-proofing chemicals. Also joining your local environmental cleanup volunteer force allows you to support local cleanup efforts and stay in the know about forever chemical pollution in your local area. Via CNN Lead image via Pexels","filter_flag":1}
