{"title":"IBM to Acquire Apptio Inc., Providing Actionable Financial and Operational Insights Across Enterprise IT - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS10by1hY3F1aXJlLWFwcHRpby1pbmMtcHJvdmlkaW5nLWFjdGlvbmFibGUtZmluYW5jaWFsLWFuZC1vcGVyYXRpb25hbC1pbnNpZ2h0cy1hY3Jvc3MtZW50ZXJwcmlzZS1pdC0zMDE4NjI2NzEuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS10by1hY3F1aXJlLWFwcHRpby1pbmMtcHJvdmlkaW5nLWFjdGlvbmFibGUtZmluYW5jaWFsLWFuZC1vcGVyYXRpb25hbC1pbnNpZ2h0cy1hY3Jvc3MtZW50ZXJwcmlzZS1pdC0zMDE4NjI2NzEuaHRtbNIBAA?oc=5","id":"CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS10by1hY3F1aXJlLWFwcHRpby1pbmMtcHJvdmlkaW5nLWFjdGlvbmFibGUtZmluYW5jaWFsLWFuZC1vcGVyYXRpb25hbC1pbnNpZ2h0cy1hY3Jvc3MtZW50ZXJwcmlzZS1pdC0zMDE4NjI2NzEuaHRtbNIBAA","guidislink":false,"published":"Mon, 26 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=26, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=177, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS10by1hY3F1aXJlLWFwcHRpby1pbmMtcHJvdmlkaW5nLWFjdGlvbmFibGUtZmluYW5jaWFsLWFuZC1vcGVyYXRpb25hbC1pbnNpZ2h0cy1hY3Jvc3MtZW50ZXJwcmlzZS1pdC0zMDE4NjI2NzEuaHRtbNIBAA?oc=5\" target=\"_blank\">IBM to Acquire Apptio Inc., Providing Actionable Financial and Operational Insights Across Enterprise IT<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"IBM to Acquire Apptio Inc., Providing Actionable Financial and Operational Insights Across Enterprise IT - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2libS10by1hY3F1aXJlLWFwcHRpby1pbmMtcHJvdmlkaW5nLWFjdGlvbmFibGUtZmluYW5jaWFsLWFuZC1vcGVyYXRpb25hbC1pbnNpZ2h0cy1hY3Jvc3MtZW50ZXJwcmlzZS1pdC0zMDE4NjI2NzEuaHRtbNIBAA?oc=5\" target=\"_blank\">IBM to Acquire Apptio Inc., Providing Actionable Financial and Operational Insights Across Enterprise IT<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Resource Optimization\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"$4.6 billion acquisition to advance IBM's existing resource optimization, observability and application management offerings, maximize value for clients and drive significant synergies across several IBM growth areas ARMONK, N.Y., June 26, 2023 \/PRNewswire\/ -- IBM (NYSE: IBM) today announced that it has entered into a definitive agreement with Vista Equity Partners to purchase Apptio Inc., a leader in financial and operational IT management and optimization (FinOps) software, for $4.6 billion. The acquisition of Apptio will accelerate the advancement of IBM's IT automation capabilities and enable enterprise leaders to deliver enhanced business value across technology investments. Organizations are digitally transforming their businesses faster than ever, causing IT environments to expand across public and private clouds, with multiple service providers. To manage this dramatic increase in complexity, clients are turning to Apptio's solutions for integrated and simplified visibility into technology spend across hybrid and multi-cloud environments, labor and associated resources. Apptio, together with IBM's IT automation software and it's watsonx AI platform, will help businesses around the world manage and optimize enterprise IT spend and derive tangible financial value and operational improvement. Apptio is an established, growing and profitable technology business management and FinOps leader, with over 1,500 clients, serving more than half of the Fortune 100. Industry recognized, Apptio partners and integrates with leading companies such as Amazon Web Services, Microsoft Azure, Google Cloud Platform, Salesforce, ServiceNow, Oracle and SAP, consistent with IBM's commitment to an open partner ecosystem. Apptio empowers enterprise leaders to manage technology spend and direct investments to high-value cloud innovation and digital transformation. The company has three core offerings, all delivered as software as a service (SaaS) – ApptioOne, Apptio Cloudability, and Apptio Targetprocess: ApptioOne: Hybrid cloud spend management and optimization capabilities to analyze, optimize and plan IT spend and value. ApptioOne is used to establish repeatable and accurate planning and financial management processes, delivering actionable insights around cost and utilization, while benchmarking against industry peers for continuous optimization. Apptio Cloudability: Public cloud spend management visibility and optimization capabilities, connecting multi-cloud and SaaS infrastructure with cloud financial management best practices to maximize the value of clients' cloud strategy. Apptio Targetprocess: Agile investment planning capabilities to align development resources to business outcomes, plan and track value delivery for projects or products. \"Technology is changing business at a rate and pace we've never seen before. To capitalize on these changes, it is essential to optimize investments which drive better business value, and Apptio does just that,\" said Arvind Krishna, CEO and chairman, IBM. \"Apptio's offerings combined with IBM's IT automation software and watsonx AI platform, gives clients the most comprehensive approach to optimize and manage all of their technology investments.\" Apptio and the performance optimization and observability capabilities of IBM's IT automation software like Turbonomic, Instana and AIOps, will give clients a 360-degree technology business management platform, providing a \"virtual command center\" for spend management and optimization stretching across their entire technology landscape. In addition, Apptio will bring to IBM $450 billion of anonymized IT spend data, unlocking new insights for clients and partners. The acquisition of Apptio is a continuation of IBM's deep focus and investment in hybrid cloud and AI and is expected to drive significant synergies across several key growth areas for IBM, including automation, Red Hat, IBM's broader AI portfolio, and IBM Consulting, as well as strong partnership with other leading systems integrators like Accenture, KPMG, Deloitte and EY. IBM will also deliver new innovation by augmenting watsonx with Apptio's anonymized FinOps data. Additionally, Apptio is expected to benefit from IBM's long-established scale and reach, working with clients and partners across more than 175 countries. \"Our customers are evolving to a complex digital-first, hybrid world where technology investments are distributed and decentralized but all innovation must be aligned with clear business outcomes,\" explained Sunny Gupta, Apptio co-founder and CEO. \"We are so excited to be joining IBM and combining our industry leading offerings with IBM's global presence and strong portfolio across AIOps, automation and hybrid cloud offerings.\" \"We are committed to building resilient enterprise software companies, which has proven to be highly attractive to strategic and financial buyers, as well as public markets,\" said Robert F. Smith, founder, chairman and CEO of Vista Equity Partners. \"Our investment philosophy, value creation strategy, and industry expertise, enables us to identify and partner with companies that have the potential for long-term success. Apptio has transformed how leading organizations optimize their IT spend and performance for better outcomes. We are proud of these shared accomplishments and look forward to seeing Apptio further evolve with IBM.\" Apptio will be acquired with available cash on hand. The transaction is subject to regulatory approvals and other customary closing conditions and is expected to close in the latter half of 2023. About IBM IBM is a leading provider of global hybrid cloud and AI, and consulting expertise. We help clients in more than 175 countries capitalize on insights from their data, streamline business processes, reduce costs and gain the competitive edge in their industries. Thousands of government and corporate entities in critical infrastructure areas such as financial services, telecommunications and healthcare rely on IBM's hybrid cloud platform and Red Hat OpenShift to affect their digital transformations quickly, efficiently and securely. IBM's breakthrough innovations in AI, quantum computing, industry-specific cloud solutions and consulting deliver open and flexible options to our clients. All of this is backed by IBM's legendary commitment to trust, transparency, responsibility, inclusivity and service. Visit www.ibm.com for more information. Press Contacts: Tim Davidson, 914-844-7847 [email protected] Sarah Meron, 347-891-1770 [email protected] SOURCE IBM","filter_flag":1}
