{"title":"Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA","guidislink":false,"published":"Thu, 14 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=14, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=348, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5\" target=\"_blank\">Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaG9sY2ltLXVzLTIwMjMtc3VzdGFpbmFiaWxpdHktYWNoaWV2ZW1lbnRzLWFjY2VsZXJhdGUtZGVjYXJib25pemF0aW9uLTMwMjAxNTI4My5odG1s0gEA?oc=5\" target=\"_blank\">Holcim US' 2023 Sustainability Achievements Accelerate Decarbonization<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Initiatives\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"With renewable energy initiatives implemented or on the way, Holcim will power 45 percent of operations with renewable energy Volume of sustainable cement and concrete products hits record highs CHICAGO, Dec. 14, 2023 \/PRNewswire\/ -- News from the COP28 climate summit brought into focus the need to make faster progress cutting the world's carbon emissions, with heavy industry playing a role in implementing reductions. With the Global Cement & Concrete Association reporting momentum in the cement sector reaching net zero, building solutions leader Holcim is doing its part to work towards ambitious, verified global sustainability goals across its entire value chain. In the US, Holcim hit significant sustainability milestones in 2023 with initiatives across the country and even more planned for 2024. \"A realistic approach to a net-zero, fully sustainable future requires us to consider all facets of our operations and products,\" said Michael LeMonds, Holcim US' chief sustainability officer and vice president of ESG. \"We're committed to decarbonizing without compromise, transitioning to renewable energy, developing new carbon capture technology, and more as we drive the circular economy in leading by example.\" In one significant sign of its commitment, in 2023 Holcim became the first company in the cement sector to sign the U.S. Department of Energy's Better Climate Challenge, pledging to reduce net greenhouse gas emissions by at least 25 percent across a 10-year period. Other major sustainability milestones from this year include: Producing and selling record levels of sustainable products OneCem (PLC) volumes increased to 83 percent in 2023 compared to 57 percent in 2022, reducing approximately 1.5 million metric tons of CO 2 emissions emissions ECOPact low-carbon concrete represented nearly 27 percent of Holcim US' ready-mix volumes, tripling the volume in 2022 and reducing 123,000 metric tons of CO 2 emissions emissions Investing $100 million project at its Ste. Genevieve ( Missouri ) Cement Plant—the largest single-kiln line in the world—that will reduce net CO2 emissions by 400,000 tons per year Accelerating use of renewable energy Implemented and announced initiatives to power 45 percent of operations with renewable energy (a significant increase from 10 percent in 2022) Holcim's largest solar array in the Midwest broke ground at the Alpena ( Michigan ) cement plant ( ) cement plant Joined the New York Value of Distributed Energy Resources (VDER) program to generate green energy with solar arrays on Holcim's non-mineable aggregate sites and with offsite arrays within the agreement Combination solar power and battery energy storage system underway at the Portland ( Colorado ) cement plant Replacing fossil fuels with alternative fuel Co-processed 400,000 metric tons of industrial byproducts into alternative fuels to power operations and 1.5 million metric tons of industrial byproducts into alternative raw materials to produce low-carbon cement New tire-derived fuel (TDF) facility went online at the Alpena cement plant, supported with grants from the State of Michigan These efforts are only part of Holcim's work toward the transition to net zero. From offering low-carbon cements and concretes to incorporating renewable energy to innovative carbon capture research, the company continues to put sustainability first. \"Holcim is leading the way in transforming its operations and products to enable strong, sustainable and resilient infrastructure and building development across the US,\" said Zach Friedman, director of federal policy for nonprofit sustainability advocacy organization Ceres. \"The company's actions demonstrate a deep commitment to tackling the climate crisis with innovative solutions and with vital policy advocacy that aligns with the goals of the Paris Agreement.\" Market demand for sustainable building solutions is expected to grow, fueled by the Buy Clean initiative, which prioritizes the use of US-made, low-carbon construction materials, and climate actions in the Bipartisan Infrastructure Bill and the Inflation Reduction Act. Project owners, architects, engineers and others will continue to call for innovative, sustainable solutions and products that Holcim is uniquely poised to provide. Learn more here: https:\/\/www.holcim.us\/sustainability. About Holcim US Holcim is a global leader in innovative and sustainable building solutions. Driven by its purpose to build progress for people and the planet, its 60,000 employees are on a mission to decarbonize building, while improving living standards for all. The company empowers its customers across all regions to build better with less, with its broad range of low-carbon and circular solutions, from ECOPact to ECOPlanet . With its innovative systems, from Elevate's roofing to PRB's insulation, Holcim makes buildings more sustainable in use, driving energy efficiency and green retrofitting. With sustainability at the core of its strategy, Holcim is becoming a net-zero company with 1.5°C targets validated by SBTi. In the United States, Holcim US includes nearly 350 sites in 43 states and employs 7,000 people. Our customers rely on us to help them design and build better communities with innovative solutions that deliver structural integrity and eco-efficiency. To learn more, visit holcim.us Contact Lynn Safranek Holcim US [email protected] Lauren Blalock Pierpont Communications [email protected] SOURCE Holcim","filter_flag":1}
{"title":"Kentucky's Unbridled Solar Project Marks a Renewable Energy Milestone - Microgrid Media","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2tlbnR1Y2t5cy11bmJyaWRsZWQtc29sYXItcHJvamVjdC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2tlbnR1Y2t5cy11bmJyaWRsZWQtc29sYXItcHJvamVjdC_SAQA?oc=5","id":"CBMiPWh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2tlbnR1Y2t5cy11bmJyaWRsZWQtc29sYXItcHJvamVjdC_SAQA","guidislink":false,"published":"Tue, 19 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=19, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=353, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2tlbnR1Y2t5cy11bmJyaWRsZWQtc29sYXItcHJvamVjdC_SAQA?oc=5\" target=\"_blank\">Kentucky's Unbridled Solar Project Marks a Renewable Energy Milestone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Microgrid Media<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Kentucky's Unbridled Solar Project Marks a Renewable Energy Milestone - Microgrid Media","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiPWh0dHBzOi8vbWljcm9ncmlkbWVkaWEuY29tL2tlbnR1Y2t5cy11bmJyaWRsZWQtc29sYXItcHJvamVjdC_SAQA?oc=5\" target=\"_blank\">Kentucky's Unbridled Solar Project Marks a Renewable Energy Milestone<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Microgrid Media<\/font>","source.href":"https:\/\/microgridmedia.com","source.title":"Microgrid Media","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Initiatives\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"Kentucky, a state historically reliant on coal, is witnessing a significant shift in its energy landscape with the construction of the Unbridled Solar project. National Grid Renewables’ 160MW solar array, a groundbreaking initiative in Kentucky, is set to become operational in 2024. This project, located in Webster and Henderson counties, marks a decisive move away from the state’s coal-dependent past. The Scale and Impact of Unbridled Capacity and Location: The Unbridled solar project, situated about 40 miles south of Evansville, Indiana, and 160 miles southwest of Louisville, will have a nameplate capacity 13 times larger than the current largest array, the EW Brown facility in Harrodsburg. The Unbridled solar project, situated about 40 miles south of Evansville, Indiana, and 160 miles southwest of Louisville, will have a nameplate capacity 13 times larger than the current largest array, the EW Brown facility in Harrodsburg. Economic Benefits: With an estimated $42 million in direct economic impact over its first 20 years, Unbridled is set to create at least 200 jobs and generate over $11 million in new tax revenue. Additionally, local farmers and landowners will benefit from more than $24 million in payments. Kentucky’s Energy Landscape Despite its coal-dominated history, Kentucky ranks 43rd in the U.S. with just 172 MW of installed solar power, accounting for less than half a percent of its power generation. The state has no operating utility-scale wind turbines and lacks mandates or targets for renewable energy. Coal’s Decline: Coal production in Kentucky has plummeted by about 65% over the past decade due to competition from cheaper, more environmentally friendly alternatives. Coal production in Kentucky has plummeted by about 65% over the past decade due to competition from cheaper, more environmentally friendly alternatives. Future of Coal Plants: Several aging coal-fired power plants are slated for retirement, with controversial proposals to replace them with natural gas and solar energy. Transition to Renewable Energy The landmark US climate law signed by President Joe Biden in 2022 offers lucrative federal tax credits for solar projects in Kentucky, especially in former coal communities. The Solar Energy Industries Association (SEIA) projects that Kentucky could add up to 3.3 GW of solar capacity in the next five years. Other Solar Initiatives in Kentucky LG&E and KU Solar Plans: State regulators have approved a proposal by Louisville Gas and Electric and Kentucky Utilities to install 877 MW of solar generation capacity, accompanied by 500 MWh of battery energy storage. State regulators have approved a proposal by Louisville Gas and Electric and Kentucky Utilities to install 877 MW of solar generation capacity, accompanied by 500 MWh of battery energy storage. Starfire Renewable Energy Center: An 800-MW solar farm is planned at the site of the former Starfire Mine, representing a $1 billion investment. Statements from Key Players Blake Nixon, President of National Grid Renewables, expressed pride and excitement in constructing Kentucky’s largest solar renewable energy project. Bob Berry, CEO of Big Rivers Electric, highlighted the project’s contribution to the local economy and power supply. Rob Turner, VP of Construction for MasTec Renewables, shared enthusiasm for the partnership and future clean energy projects in the state. Renewable Energy Prospects and Challenges The development of the Unbridled project and other solar initiatives marks a significant change in Kentucky’s energy landscape, but it also presents challenges and opportunities. The state’s shift from a coal-dominated past to a more diverse energy mix involves navigating economic, environmental, and social factors. Economic Transition: The decline in coal production and employment necessitates new avenues for economic growth. Renewable energy projects like Unbridled offer new jobs and revenue streams, potentially revitalizing communities affected by the coal industry’s downturn. The decline in coal production and employment necessitates new avenues for economic growth. Renewable energy projects like Unbridled offer new jobs and revenue streams, potentially revitalizing communities affected by the coal industry’s downturn. Environmental Considerations: The move towards solar energy aligns with global efforts to reduce carbon emissions and combat climate change. Kentucky’s adoption of solar energy, despite its minimal contribution to the state’s total energy output, is a step towards a more sustainable future. The move towards solar energy aligns with global efforts to reduce carbon emissions and combat climate change. Kentucky’s adoption of solar energy, despite its minimal contribution to the state’s total energy output, is a step towards a more sustainable future. Social Impact: The transition impacts communities deeply rooted in coal culture. This shift requires not only infrastructural changes but also cultural and educational efforts to support communities through this transition. Conclusion The Unbridled Solar Project signifies a pivotal shift in Kentucky’s energy paradigm, transitioning from its coal-centric past to a more sustainable and diverse energy future. This project, along with other upcoming initiatives, underscores the state’s evolving approach toward cleaner energy sources. For more information on Kentucky’s renewable energy initiatives, visit the Solar Energy Industries Association’s Kentucky Solar page.","filter_flag":1}
{"title":"SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market - SolarQuarter","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5","id":"CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA","guidislink":false,"published":"Tue, 05 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=5, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=339, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5\" target=\"_blank\">SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market - SolarQuarter","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMieWh0dHBzOi8vc29sYXJxdWFydGVyLmNvbS8yMDIzLzEyLzA1L3NvbGF4LXBvd2VyLWx1YmktZWxlY3Ryb25pY3Mtc2lnbmVkLXN0cmF0ZWdpYy1wYXJ0bmVyc2hpcC1hZ3JlZW1lbnQtZm9yLWluZGlhLW1hcmtldC_SAQA?oc=5\" target=\"_blank\">SolaX Power & LUBI Electronics Signed Strategic Partnership Agreement for India Market<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">SolarQuarter<\/font>","source.href":"https:\/\/solarquarter.com","source.title":"SolarQuarter","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Initiatives\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"SolaX, a global supplier of solar inverters and energy storage solutions, is pleased to announce a strategic partnership with LUBI Electronics, a prominent name in the Indian electronics industry. This groundbreaking collaboration positions LUBI Electronics as a new distributor for SolaX products across PAN India, fortifying both companies’ commitment to advancing renewable energy initiatives in the region. The partnership with LUBI Electronics marks a strategic move to expand SolaX’s footprint in one of the world’s most promising solar markets. Renowned for its innovative solar solutions, SolaX has earned global acclaim for delivering high-performance, reliable, and cost-effective products. LUBI Electronics, with its decades-long legacy and extensive market presence, is poised to leverage its distribution prowess to make SolaX’s advanced solar technology accessible to a broader consumer base across India. Speaking on the occasion, Mr. Vipin Bhardwaj, the Country Manager of SolaX Power India, expressed his enthusiasm about the collaboration, stating, “We are delighted to partner with LUBI Electronics, a company with a strong presence and reputation in the Indian market. This collaboration aligns with our vision of making clean and renewable energy accessible to all. Together with LUBI Electronics, we aim to contribute significantly to India’s solar revolution.” As India looks towards a future powered by renewable energy, the partnership between SolaX Power and LUBI Electronics stands as a beacon of innovation, bringing efficient and reliable solar solutions to the doorstep of millions across the country. Like this: Like Loading...","filter_flag":1}
{"title":"VIETNAM BUSINESS NEWS DECEMBER 28\/2023 - VietNamNet","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtZGVjZW1iZXItMjgtMjAyMy0yMjMxOTUwLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtZGVjZW1iZXItMjgtMjAyMy0yMjMxOTUwLmh0bWzSAQA?oc=5","id":"CBMiTGh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtZGVjZW1iZXItMjgtMjAyMy0yMjMxOTUwLmh0bWzSAQA","guidislink":false,"published":"Thu, 28 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=28, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=362, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtZGVjZW1iZXItMjgtMjAyMy0yMjMxOTUwLmh0bWzSAQA?oc=5\" target=\"_blank\">VIETNAM BUSINESS NEWS DECEMBER 28\/2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VietNamNet<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"VIETNAM BUSINESS NEWS DECEMBER 28\/2023 - VietNamNet","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTGh0dHBzOi8vdmlldG5hbW5ldC52bi9lbi92aWV0bmFtLWJ1c2luZXNzLW5ld3MtZGVjZW1iZXItMjgtMjAyMy0yMjMxOTUwLmh0bWzSAQA?oc=5\" target=\"_blank\">VIETNAM BUSINESS NEWS DECEMBER 28\/2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">VietNamNet<\/font>","source.href":"https:\/\/vietnamnet.vn","source.title":"VietNamNet","query":"https:\/\/news.google.com\/rss\/search?q=\"Renewable Energy Initiatives\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"The Ministry of Transport has announced plans to kickstart 13 infrastructure projects next year, comprising a bridge and 12 roads, with a combined cost of VND30 trillion, or US$1.2 billion. Local authorities will oversee the implementation of 10 of these projects. They include three sections of the Ho Chi Minh Road, two components of the National Highway 2 improvement project, and the upgrade of National Highway 46. Projects such as National Highway 4B in Lang Son Province, the upgrade of National Highway 28B in Binh Thuan and Lam Dong provinces, and various projects in the Mekong Delta, like phase one of Cao Lanh-An Huu Expressway, phase one of My An-Cao Lanh Expressway, and the upgrade of national highways 53, 62 and Nam Song Hau will also be carried out. The sole bridge project scheduled for next year is Ninh Cuong, which will span the Ninh Co River on National Highway 37B in Nam Dinh Province. The Ministry of Transport will take charge of implementing the remaining three projects, which are Dau Giay-Tan Phu, Lo Te-Rach Soi, and Cho Moi-Bac Kan expressways. This year, the Ministry of Transport put into operation several expressway projects, including 475 kilometers of the North-South Expressway Phase 1. These works increased the total length of expressway in the country to nearly 1,900 kilometers. These projects are expected to enhance connectivity and reduce travel times between vital economic centers in Vietnam. Record 159,294 new businesses registered in 2023 The number of new business registrations in 2023 reached 159,294 enterprises, up 7.2 percent compared to the same period in 2022 - the highest level in history. On December 27, the Business Registration Management Agency under the Ministry of Planning and Investment reported that the number of new business registrations in 2023 reached 159,294 enterprises, up 7.2 percent compared to the same period in 2022 - the highest level in history. This figure is 1.2 times the average for the 2017-2022 period and reflects a 4.6 percent increase compared to the full-year estimate for 2023. In 2023, 58,412 enterprises returned to operation, causing the total number of businesses entering or re-entering the market to exceed 200,000 enterprises (217,706 enterprises). This represents a 4.5 percent increase compared to the same period in 2022 and is 1.3 times the number of businesses that withdrew from the market in the previous year. Notably, in the fourth quarter, there were 42,952 newly established businesses, marking a 20.2 percent increase compared to the same period in 2022 and 1.3 times the quarterly average for the 2017-2022 period. The total registered capital of new businesses entering the market demonstrated positive growth across the quarters of 2023, with VND310.33 trillion in the first quarter, VND397.13 trillion in the second quarter, VND379.32 trillion in the third quarter, and a further increase to VND434.48 trillion in the fourth quarter. Long Thanh airport terminal set to be ready by 2026 The passenger terminal of Long Thanh International Airport in Dong Nai Province will be completed by the end of 2026 as planned, according to the Airports Corporation of Vietnam (ACV). The passenger terminal, featuring a lotus-inspired design referred to as bidding package 5.10, is taking shape, and is expected to be finalized by October 2026 following a three-year construction schedule. A consortium of contractors has deployed over 1,000 personnel and a multitude of equipment for on-site construction. Package 4.6, which includes the construction and installation of the runway, taxiway, apron, and related facilities, is slated for completion by the end of July 2025. Concurrently, package 6.12 for construction of connecting roads could be done by the end of 2025. Long Thanh International Airport is an infrastructure project of national importance. Once the first phase is operational in 2026, the airport will accommodate 25 million passengers and handle 1.2 million tons of cargo annually. In the second phase, an additional runway will be added to accommodate 50 million passengers annually. Finally, in the third phase, additional facilities will be completed, enabling the airport to handle 100 million passengers per year, solidifying its position as the largest airport in Vietnam in the future. Fluctuations felt in pharma retail sphere The race in Vietnam’s pharmaceutical retail industry is becoming a tough arena for major players. According to Doan Van Hieu Em, CEO of An Khang Pharma, Vietnam’s population now prefer to buy drugs at modern pharmacies to get better services and medicines. “We see a strong increase in the number of customers compared to 2022,” Em told VIR. “The increase began after we renewed our branding several months ago.” Em said that An Khang operates under a model of modern pharma stores, with a sufficient list of drugs. It has also been paying due attention to improving advice services and the image of staff in a move to increase customer experience and satisfaction. In 2023, An Khang Pharma expanded its chain from around 500 stores to 527. “We will increase our efforts to keep the fullest range of products possible, offer whole-hearted advice through our staff, and provide the best customer experience in 2024,” Em added. Similarly, Long Chau continued its expansion plans in 2023 to more than 1,000 stores, compared to 546 in the first quarter of 2022. Explaining the operational efficiency, Nguyen Bach Diep, chairman of the board at FPT Retail, said that every newly opened Long Chau drug store was required to be profitable after six months. “This is a whole preparation process, from comprehensive assessment to choosing location to negotiating rental prices, to training pharmacists to create prestige for the chain,” she said. Pharmacity is now no longer the biggest chain, as Long Chau rose to the top with just over 1,000 drug stores. Pharmacity has over 900, and An Khang more than 500. An Khang planned to open a drug store every day with the ambitious target of having 800 pharmacies nationwide. However, it had to slow its plan in early 2023 and only hold on to its more profitable outlets. “Compared to the previous goal of having 800 stores, slowing down has helped us consolidate everything and find opportunities to increase revenue for An Khang in the near future. Currently, over 500 stores is big enough for the market,” CEO Hieu Em said. Pharmacity is in the same boat. Established in 2011, it expanded to over 1,100 stores nationwide. However, since mid-2022, it had to close nearly 200 stores. In 2023, it has focused on improving gross profit margins and optimising operating costs. Last year, the chain’s net revenue from selling drugs increased by 77 per cent over the same period. In late November, Pharmacity announced Deepanshu Madan as the new CEO, aiming to lead the pharmaceutical retail industry in Vietnam. Deepanshu has extensive experience in business management and has led successful investments in pharmacy chains in China and retail drug store chains in India. More foreign players are eyeing expansion in the local pharmaceutical retail market. In August, South Korea’s DongWha Pharm pumped in $30 million to acquire the Trung Son Pharma chain. Trung Son operates around 140 stores, mainly concentrated in the south. Last year, its revenues reached about $568 million, with a strong average annual growth rate of 46 per cent since 2019. With a team of more than 1,000 pharmacists, the chain is hoping to expand its scale to 460 stores by 2026. According to the Global Use of Medicines 2022 report from the IQVIA Institute, Vietnam’s pharmaceutical revenues could reach $7.51 billion by 2025, accounting for 1.8 per cent of GDP and almost one-third of healthcare spending, with a compound annual growth rate of 8 per cent in 2020-2025. Labour market can evolve through just transition At the workshop on promoting employment and social protection towards a just transition, held on December 11 by the Ministry of Labour, Invalids, and Social Affairs (MoLISA), consensus among experts emerged on the need to create policies ensuring that vulnerable workers receive retraining opportunities and support for a seamless transition into new employment. Luu Quang Tuan, director general of the International Cooperation Department at the MoLISA, emphasised that as Vietnam aligns with nearly 150 countries committed to achieving net-zero and undergoes a shift towards a green economy, it is crucial to navigate this process with justice and equity at its core. Recognising potential disparities across sectors and communities, especially impacting vulnerable groups, Tuan highlighted aspects such as job mobility, job loss, skills shortages, and the misalignment between existing workforce skills and the requirements of the green economy. “The MoLISA acknowledges that the energy transition process can create unfair impacts, particularly affecting the poor and lowest income groups, such as challenges in affording clean and green energy,” he noted. Trinh Thi Nguyet, representative of the Department of Social Protection at the MoLISA, presented statistics suggesting that the current demographic of disadvantaged, vulnerable, and low-income individuals in Vietnam constitutes over one-quarter of the population. “Vietnam is experiencing one of the swiftest rates of population ageing globally. Projections indicate that by 2035, approximately 20 per cent of Vietnam’s population will be elderly, and by 2025, this demographic is expected to reach 30 per cent of the total population,” she said. To provide a case study of energy transition’s impact towards vulnerable groups, she illustrated the necessity of social protection measures for older workers in coal-fired thermal power plants undergoing conversion or downsizing. “Certain workers facing job loss, such as older employees in these thermal power plants, will necessitate specific forms of social protection. This includes provisions such as unemployment benefits, paid time off, early retirement options for formal workers, and social benefits for informal workers,” she explained. “Additionally, for a different segment of the workforce, implementing job creation and retraining programmes becomes imperative to facilitate their re-employment, particularly within alternative facilities or the broader energy industries.” From the perspective of an international organisation, Do Le Thu Ngoc, assistant resident representative and head of the Inclusive Growth Unit at United Nations Development Programme in Vietnam, referenced Indonesia’s just transition framework, which comprises the key criteria of human rights, gender equality and empowerment, accountability, leaving no-one behind, and sustainability and resilience. Ngoc emphasised a significant component of the framework, involving public-private partnerships, collaboratively identifying human resource training needs with businesses and engaging with the community to address concerns. However, she clarified that there’s no one-size-fits-all solution for just transition. “The employment shift is not merely a job-by-job exchange. Rather, it involves anticipating new skill requirements during the transition, establishing institutions, and providing training for these evolving skills,” she said. Offering specific recommendations for Vietnam, Ngoc suggested that the country should proactively reform its social assistance and social security system to mitigate the potential increase in poverty resulting from the energy transition. In the short term, she proposed supporting vulnerable households grappling with escalating energy and food prices, while in the long term, reinforcing resilience, social security, and employment, along with allocating a higher budget for social security. “Social security mechanisms have a crucial role in garnering public support for green transition and climate policies,” she said, highlighting the distinction between social security, such as unemployment compensation, and social investment through skills training, underscoring their unique contributions to the overall strategy. On the domestic front, the government is also actively prioritising a just transition. Chu Thi Lan, representative of the MoLISA’s Institute of Labour Sciences and Social Affairs, underscored the significant adjustments required for the energy, transportation, and manufacturing sectors when shifting to a net-zero emissions economy. Anticipating potential workforce displacement, she emphasised the need for well-defined policies ensuring affected workers in these industries have access to retraining and comprehensive support for a successful transition to new employment. “With regards to the Just Energy Transition Partnership, the MoLISA holds several significant responsibilities, including chairing and collaborating with relevant ministries and agencies to formulate mechanisms, policies, and solutions that facilitate an equitable transition, with an emphasis placed on adapting to climate change and ensuring fairness in the energy transition process,” she said. Burden balancing ahead for firms in minimum wage shift Anew regional minimum wage scheme to take effect from July 2024 may place pressure on both domestic and foreign employers, while simultaneously helping to ease financial strife for local workers. The National Salary Council on December 20 gave the green light to lifting the regional minimum salary by 6 per cent. The increase will be submitted to the government for approval. If approved, as is likely, such a hike will take effect on July 1 as is customary. From that date, the salary in Region 1 areas will be adjusted from approximately $197 to $210 per month. The 6 per cent increase is equivalent to a rise of $10.50 in Region 2, and $9.30 and $8.40 in Regions 3 and 4, respectively. Currently, the minimum monthly salary of workers in enterprises in Region 2 is $175, in Region 3 it is $153, and in Region 4 it is $137. Region 1 covers the urban areas of Hanoi and Ho Chi Minh City, while Region 2 encompasses the rural areas of Hanoi and Ho Chi Minh City, along with major urban areas in the country such as Can Tho, Danang, and Haiphong. Region 3 covers provincial cities and the districts of Bac Ninh, Bac Giang, and Hai Duong provinces; and Region 4 embraces the rest of the country. The geographical classification is determined based on the employer’s place of operation. After the adjustment announcement, Doan Tien Dung, CEO of Nam Ha Garment JSC, expressed concern that the rise will cause a burden for the company. Each month, the company already has to pay around $29,500 for union fees and social insurance. “We may face pressure to cut production cost to offset the adjustment, while still having to ensure stable income for employees,” Dung said. Le Van Thanh, Deputy Minister of Labour, Invalids, and Social Affairs, and chairman of the National Salary Council, said the proposed pay rise is reasonable. “Increasing the regional minimum salary was a difficult decision due to difficult economic trends, businesses lacking orders, and unemployment,” Thanh said. “However, the council has also considered the difficult circumstances of workers in recent times. Without a salary increase, it will be difficult to meet their needs in the context of inflation, while the base salary of the state sector and pensions already increased in July 2022.” Nguyen Thi Huong, general director of the General Statistics Office, said the ratio of the regional minimum salary to per capita income in Vietnam is currently about 40 per cent, some distance from the average of 54.1 per cent of 149 countries and the level of 60 per cent of European countries just five years ago. “Paying salary correctly is investing in human resource development, creating motivation to improve labour productivity and work efficiency,” said Huong. An International Labour Organization (ILO) report assesses that since 2015, Vietnam has increased the minimum salary in a consistent manner, from $119 per month to the current $168 per month. Although the nominal minimum salary increased 42.7 per cent, the impact of inflation caused real salary during this period to climb 20.1 per cent. Similarly, in the 2020-2022 period, the minimum salary was adjusted by over 6 per cent, but real salary only increased 0.7 per cent. In 2021, Vietnam temporarily suspended minimum salary adjustments due to the pandemic. In Southeast Asia, Vietnam is one of the few countries to maintain salary increases that help increase the real value of workers. The report also said that strong inflation reduces the purchasing power of the minimum salary, affecting about 186 million salary earners in Asia-Pacific. As a comparison, because of mostly high inflation, countries like Thailand (2.7 per cent real drop in minimum salary), Australia (2 per cent), and Laos (27 per cent) have seen actual minimum salaries dip since 2019. The ILO believes that minimum salary adjustments should be based on accurate data on inflation, economic growth, employment, the solvency of businesses, and labour productivity. The adjustment level must also keep up with inflation to maintain the true value of the salary increase, enough to balance the needs of local workers and their families. According to a survey on working life in the first half of 2023 by the Vietnam General Confederation of Labour, the average income of workers reached nearly $340 per month, while their family’s monthly expenditure was just over $500. Thus, income currently only meets about 70 per cent of survey participants’ spending, while workers’ expenditure has also risen by 19 per cent compared to 2022, mainly due to increased prices of electricity and water bills. Localisation in renewables still lacking in high value On December 14 in Hanoi, the German Development Agency’s Clean, Affordable, and Secure Energy for Southeast Asia (CASE) programme offered a comprehensive assessment of the market potential and staged participation opportunities in each renewable energy subsector in the country. According to CASE director Vu Chi Mai, Vietnam has the capacity to domesticate renewable energy by 2050. The localisation rate for solar power is projected to increase from 37 to 55 per cent, and for wind power from 45 to nearly 80 per cent. Localised value may amount to $80 billion, or half of the total market potential. “We are keen on the possibility of specialisation in the wind and solar power sectors when Vietnam establishes an enormous market for these two energy industries,” Mai said. The localisation rate is the proportion of industrial components and basic materials utilised that are produced domestically as opposed to those that are imported. According to CASE, the localisation rate during the project development phase (specifically, the production of technical reports) for onshore wind power has achieved a remarkable 90 per cent. Additionally, 85 per cent of foundation components and equipment were manufactured, and 70 per cent of wind power plant installations were completed. Transformer stations, cables, and support pillars, in particular, have a significantly reduced domestic ratio of 30, 10, and 3 per cent, respectively. However, at the present time, Vietnam lacks a manufacturing facility capable of fabricating wind turbine components, such as nacelles, hubs, and blades. Furthermore, there are only eight manufacturing facilities in Vietnam with an estimated annual capacity of 10–20GW, with the majority of this capacity devoted to exports. On the basis of cost calculations and analysis, Mai recommended segments with substantial localisation potential in Vietnam. Vietnam is recognised as the most dynamic market in the Asia-Pacific area and is at the forefront of renewable energy development in Southeast Asia. However, Tran Thi Hong Lan, deputy director of the State Agency for Technology Innovation under the Ministry of Science and Technology, noted that Vietnamese enterprises continue to exhibit a limited level of involvement in the supply chain pertaining to wind and solar power. “According to our statistics, renewable energy initiatives continue to import 90 per cent of their instruments at this time. Localisation progression has been sluggish due to a lack of evaluation capacity and infrastructure in addition to technological capacity, and a manufacturing level that fails to meet requirements,” Lan said. “Vietnam continues to require policy structures that can promote industry for renewable electricity.” Critical juncture set for real estate prospects in 2024 Despite fluctuations expecting to continue in the Vietnamese real estate market for some months, industry analysts are quietly optimistic that 2024 will mark a turning point for a new cycle of recovery and development. Analysts say that real estate products that meet actual needs are more vital than ever to ensure the market’s positive trajectory, Currently, both supply and absorption rates continue to decrease sharply compared to 2022, down about 66 per cent. According to Hoang Hai, director of the Department of Housing and Real Estate Market Management under the Ministry of Construction, the biggest issues have involved large gaps in product structure, the short supply of affordable housing, and oversupply in the high-end segment. “Around 75 per cent of real estate businesses have difficulty accessing capital due to banks tightening lending conditions. Together with a reduced confidence from investors in the market, new capital injections are harder to mobilise,” Hai said. He added that although the government has approved the new laws on housing and real estate, they will not be fully in operation until 2025. The new land law, meanwhile, is still being considered. This year the government has implemented a range of solutions to support the market, such as reducing lending interest rates, stabilising the foreign exchange market, promoting disbursement of public investment capital, and implementing stimulus packages. Especially for the real estate market, a range of solutions were taken such as tax and fee exemptions and reductions, as well as extensions for corporate bond payments. “Some of these solutions to promote the market have had certain effectiveness. But we have to keep a closer monitor on those difficulties in order to create more suitable solutions to support the market,” Hai said. Currently, banks are adjusting lending interest rates to create more motivation for investors to participate in the market. Vo Hong Thang, director of Project Development and Consulting Services under DKRA Group, said that now could be considered appropriate for investors to return. “One of the most important factors is that in 2023, a series of key public ventures such as urban belt roads, highways, and airports have started construction. The macroeconomy remains stable and inflation is controlled. All of those have a positive impact on helping the real estate market recover and grow again,” Thang said. Subsequent changes in laws and investments focusing on the actual needs of customers will be the key to sustainable market development in the coming time, said Thang. “Products that serve real housing needs will recover better. In particular, the affordable apartment segment for the needs of people in the city centre and outskirts areas will recover well, and the land segment will also focus on densely populated areas, with enough amenities and infrastructure,” Thang added. Soothed pressure on VND-USD exchange prospects Several bank executives earlier this month noted that November was a rare moment when the VND-USD exchange rate dropped 1.2 per cent compared to October, helping to soothe the rate hike from early this year to 2.7 per cent. The VND has appreciated amid a more tempered dollar. The exchange rate in the free market, by contrast, had inched up slightly during the month, possibly being driven by gold price sharp fluctuations. One top executive at major state lender BIDV commented, “In November, the VND-USD exchange rate in the interbank market was down from 300-350 percentage points to hover around VND24,260 per dollar, meaning that compared to early this year, the exchange rate has gained nearly 3 per cent, showing fair stability compared to other pairs in the region.” The main cause behind the more tempered exchange rate came from external impact factors, he said. Accordingly, in November, the data on employment and inflation in the US tended to cool down more clearly, causing the market to return to expectations that the US Federal Reserve would have to cut interest rates soon in 2024. “The risk-on appetite of investors has also formed in the US, EU, and some Asian stock markets with the expectation that the world’s top economy can get out of recession and move towards a soft landing in 2024,” said the BIDV executive. In the domestic market, the basic factors have not changed much in general. The foreign currency balance saw a slight deficit of about $500 million in November. The VND-USD interest rate difference eyed a sharp contraction with the average one-week term of minus 4 per cent, per year in the face of very abundant VND liquidity. In addition, although credit tended to be accelerating compared to October, it did not bring a breakthrough compared to one year ago as well as the increase in the deposit volume. According to data from the State Bank of Vietnam, as of November 22, credit expansion approximated 8.21 per cent, up about 1 per cent compared to the end of October, almost equal to the growth in the deposit volume, yet still much lower compared to one year ago when it spiked by 12 per cent. In general, analysts agree that the most difficult period in 2023 for the domestic exchange rate has passed. Accordingly, the VND-USD exchange rate on the interbank market is basically stable because there are not many unexpected factors. As such, in the international market, the focus continues to be on US inflation and employment figures and the messages given at the Fed’s meeting on December 13. The previous prediction that the Fed would continue to keep interest rates at the current level became a reality when Fed officials unanimously voted a fortnight ago to keep interest rates unchanged in the 5.25-5.5 per cent range, the highest in 22 years. More noteworthy, at the December meeting, for the first time since March 2021, policymakers predicted there would be no further interest rate increases. With inflation decreasing at a faster rate than expected, and the US economy possibly witnessing growth slow down next year, the Fed would have room to cut interest rates more strongly. In related developments, the domestic currency balance is expected to stay more positive this month, with an estimated surplus of between $500 million and $1 billion. That is because the year-end is often the peak time of foreign direct investment disbursement, this year expected to touch around $3 billion, while the trade balance is likely to continue a surplus trend. According to data from the General Statistics Office, the trade balance of goods in the first 11 months was estimated to post a surplus of about $25.8 billion, setting a record. Dinh Duc Quang, managing director of the Currency Trading Division at UOB Vietnam, said that like other Asian currencies, it seems that the recent sell-off of VND has ended. “The VND-USD exchange rate fell to a lower level after reaching UOB’s forecast of VND23,500 per dollar for Q4 2023 in October after the Fed signalled it could end its rate hike cycle,” Quang said. “While the VND may follow the trend of a broad forex recovery across Asia, gains are likely to be limited by a modest economic rebound in 2024.” Vietnam enjoys trade surplus with European, American markets Vietnam recorded an estimated export surplus of US$125 billion with Europe and the Americas despite a 9.5% fall in trade exchanges with the two markets this year, according to the Ministry of Industry and Trade. Due to the negative impact from the global economic fallout, Vietnamese exports to the European and American markets this year only yielded approximately US$166 billion, down 9.6%, while its imports were estimated at nearly US$41 billion, down 9.1% compared to 2022. However, the country ‘s trade surplus with the European and American markets is estimated at US$125 billion, including US$33 billion from European economies. After obtaining high growth in consecutive years, Vietnamese export turnover with some key markets decreased sharply this year, with exports to the United States and the European Union projected to drop 12.4% to US$96.9 billion and 6.7% to US$43.7 billion, respectively. Vietnam’s main export products to these markets such as machinery, equipment, tools and other spare parts; phones, computers and accessories; PCs, electronic products and components; textiles; leather shoes and bags; wood and wood products; and seafood all witnessed an average decrease of over 10% compared to 2022. In 2024 the economic growth rate of the world and countries in Europe and America is projected to be lower than in 2023, but Europe and the Americas remain Vietnam’s major export markets thanks to the enforcement of free trade agreements such as the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), the EU-Vietnam Free Trade Agreement (EVFTA) and the UK-Vietnam Free Trade Agreement (UKVFTA). Vietnamese Commercial Counselor in Canada Tran Thu Quynh notes that among CPTPP member countries, Vietnam is the country that has best exploited this agreement to accelerate its exports to Canada, with its export turnover likely to climb to more than US$5.7 billion. The Ministry of Industry and Trade says it will keep a close watch on market developments in 2024 to consult with the government and come up with appropriate policies. PM calls for efforts to ensure power supply Prime Minister Phạm Minh Chính has called for drastic efforts to speed up the implementation of key and pressing power projects to ensure an adequate supply of power in 2024 and the following years. Of note, the three-circuit 500-kW transmission line from Quảng Trạch in the central province of Quảng Bình to Phố Nối in the northern province of Hưng Yên, must be completed and put into full operation in June 2024 to transmit electricity to the northern region. While the transmission line has yet to be completed, the Ministry of Industry and Trade must keep a close watch on the power demand and power supply to raise measures to ensure enough power, especially for the Northern region. “No electricity shortages are allowed to happen and affect production, business and people’s lives,” the PM asked. The PM also asked for a focus on completing the mechanism and policies for direct purchase between renewable energy producers and large customers together with a mechanism to encourage rooftop solar, which must be submitted for consideration before the end of this month. Việt Nam Electricity (EVN) must speed up the construction of power generation and grid projects while developing appropriate electricity system operation plans to ensure adequate supply. The PM required EVN to be more proactive in buying and selling electricity, especially renewable energy, in accordance with market rules and the spirit of harmonised benefits and shared risks. In addition, EVN must enhance cooperation with Việt Nam National Coal – Mineral Industries Holding Corporation Limited and Việt Nam Oil and Gas Group (PVN) to enhance cooperation to ensure the supply of coal and gas for electricity generation. In late May and early June, the northern region faced power outages, which significantly affected production and business and undermined investors’ confidence. Việt Nam is facing the risk of electricity shortages not only in the short term of 2024-25 but also in the medium (2025-30) and long term (2030-50), according to a report of the National Assembly Standing Committee’s supervision group. EVN forecast that the electricity demand would increase by an average 9 per cent per year, meaning that the production capacity must increase by 4,000 – 4,500MW. Meanwhile, new power sources expected to be put into operation in 2024 is only at 1,950MW and 3,770MW in 2023, mostly in the central and southern regions. With the power demand growing by around 10 per cent per year, the northern region encounters a high risk of electricity shortage, especially in the summer months of 2024. With regard to electricity supply for 2024, Đặng Hoàng An, EVN’s chairman, said that the group is preparing for the economic growth scenario of 6-6.5 per cent, meaning a growth of 9.4-9.8 per cent in electricity demand. EVN also develops scenarios to cope with the last three months of the dry seasons to avoid shortages as what had happened in 2023, he said. Regarding the 500-kV transmission line, An said that the progress is being accelerated with 219 bidding packages completed within four months which will be implemented from early January 2024. Recently, EVN has proposed to import wind power from Laos to reduce the risk of power shortage for the northern region. Enterprises in race to raise funds through share issuances Despite the volatile trend on the stock market, a number of listed enterprises still announced plans to issue millions of shares to raise capital. According to many financial experts, businesses increasing capital mobilisation through stock issuance is a reasonable solution, easing the burden on credit capital and the bond channel, which have not really improved. Last week, SSI Securities Corporation announced that the company's shareholders had approved the plan to issue a total of more than 453.3 million new shares to increase capital. In particular, the securities firm will issue 302.22 million bonus shares at a ratio of 100:20 to existing shareholders, meaning 100 shares will receive 20 new shares. SSI also issues more than 151 million shares for existing shareholders at a price of VNĐ15,000 a share (US$0.62 a share). The ratio of exercising rights is 100:10, which means shareholders owning 100 shares have the right to buy 10 new shares. It expects to earn nearly VNĐ5.3 trillion from this share issuance to supplement capital for margin trading loans and investment in bonds, certificates of deposit and other valuable papers. SSI's charter capital is also expected to increase from more than VNĐ15.1 trillion to nearly VNĐ19.65 trillion. Many other securities companies have also announced plans to issue shares to increase capital in the last days of 2023 and early 2024. For example, the Hồ Chí Minh Securities Corporation plans to release more than 297 million additional shares to increase charter capital from VNĐ4.58 trillion to more than VNĐ7.5 trillion. VNDirect Securities Corporation also plans to offer nearly 244 million shares to existing shareholders at a ratio of 5:1, with an offering price of VNĐ10,000 per share. VNDirect intends to pay stock dividends to shareholders at a rate of 5 per cent, equivalent to issuing nearly 61 million new shares. HD Securities Corporation is also implementing a plan to offer more than 67.5 million shares to existing shareholders at a price of VNĐ15,000 a share, bringing its charter capital to nearly VNĐ1.7 trillion. This helps the company improve its financial potential and raise capital size to supplement business activities. Not only in the securities industry, but many real estate companies issue a large number of shares to raise capital in the face of difficult-to-access bank credit channels. Novaland has asked for shareholders' opinions to approve the plan to issue 200 million individual shares with a par value of not less than VNĐ10,000 a share. The property developer also plans to offer a maximum of more than 1.17 billion shares to existing shareholders at a ratio of 10:6, meaning that shareholders owning 10 shares will have the right to buy 6 new shares with price not lower than VNĐ10,000 per share. The earnings from these offerings will be used for purposes such as investing and contributing additional capital to subsidiaries to restructure debt and pay off obligations. Similarly, Đất Xanh Group has just announced a public offering of more than 101 million shares to existing shareholders. With the offering price of VNĐ12,000 per share, the entire amount of mobilised capital is VNĐ1.22 trillion and is expected to be used to contribute capital to Hà An Real Estate Investment and Business JSC and pay its issuing expenses. Other real estate businesses, such as Hoà Bình Construction Group and Hưng Thịnh Corporation, also intend to raise capital through share issuances. Meanwhile, Hoàng Anh Gia Lai JSC approved a plan to offer 130 million shares to three strategic investors to mobilise VNĐ1.3 trillion to repay loans. The price of Hoàng Anh Gia Lai’s shares on the exchange has increased rapidly after the announcement, as investors believe that the additional issuance will have a positive impact on the company’s business activities while alternative mobilisation channels are difficult to access. According to many experts, raising capital through issuing shares amid the current unstable stock market is not easy. However, this is a more feasible capital mobilisation option as other channels, such as bonds, are still difficult. Corporate bond maturities are under significant strain, and bank credit channels are difficult to obtain. Previously, besides borrowing from commercial banks, some real estate businesses mobilise capital through the channel of issuing large bonds, Nguyễn Hữu Huân, HCM City University of Economics, told Người Lao động (The Labourer) newspaper. However, businesses that can access bank capital all have outstanding loans or no longer have collateral to borrow, forcing them to find other capital mobilisation plans. Meanwhile, fundraising through corporate bond issuance has not improved recently. ”Although the stock market has not yet attracted cash flow from investors, especially with the pressure of net selling from foreign investors, issuing bonds to mobilise capital is the most feasible option now,” Huân said. Economic expert Đinh Thế Hiển said that the demand for credit capital of many businesses is very high, but on the contrary, the pressure on bonds due at the end of the year and the 2024-2025 period is not small. This forces businesses to source capital from many different sources, not just bank credit. Therefore, mobilising capital from the stock channel is also a way to ease the burden on bank credit and the bond channel. VinFast to introduce new EV concept, technology at CES 2024 in US Vietnamese auto maker VinFast has announced its participation in Consumer Electronics Show (CES) 2024, one of the biggest tech events in the world, taking place from January 9 - 12, 2024 in Las Vegas city, the US. At CES 2024, for the first time, VinFast will introduce its latest electric vehicle (EV) concept and the mini eSUV VF 3 to global customers. The launch of the two new models continues to expand VinFast's EV lineup, further solidifying its commitment to sustainable mobility and EV accessibility. VinFast will also display its all-electric VF 9 full-size SUV which incorporates a new streaming service into the vehicle, providing CES 2024 attendees with a unique firsthand in-car experience of the new technology. The company will also showcase its electric bikes, DrgnFly, reinforcing its commitment to offering a holistic EV ecosystem to global customers, as well as showcasing its rapid research and development capabilities since the product was first introduced at CES 2023. Tran Mai Hoa, VinFast Global Deputy CEO of Sales and Marketing said CES is a highly influential consumer technology exhibition in technology and particularly in the EV industry. VinFast's presence at CES 2024 with new products and technology is expected to bring unique and impressive experiences to the public, affirming its commitment to a green future for everyone, she continued. Deployment of electronic invoices helps accelerate digital transformation It was heard at an online discussion with the theme ‘Implementing electronic invoices in petroleum retail - Current status and solutions’ organized by Tien Phong Newspaper. According to the tax authority's assessment, the deployment of electronic invoices with the tax authority's code generated from cash registers for petroleum retail businesses positively contributes to the process of digital transformation and prevents loss in collecting state budget revenue; hence, it will help increase the state budget. Participants said that organizations, businesses and individuals when buying gasoline and oil at retail stores require sellers to issue invoices according to the exact quantity of goods purchased is also a solution to help strengthen tax management, forming habits of civilized consumption, buying and selling goods with legal invoices and documents. Previously, on December 1, 2023, the Prime Minister issued Official Dispatch No. 1284\/CD-TTg on strengthening the management and use of electronic invoices for petroleum business and retail activities. The General Department of Taxation under the Ministry of Finance also has had two official dispatches related to the implementation of electronic invoices for gasoline and oil business and retail activities. The regulations on issuance of electronic invoices for each sale of gasoline and oil indeed started from July 1, 2022 and this is a major policy of the gasoline and oil industry. The Ministry of Industry and Trade’s statistics show that the country has about 17,000 petrol stations, of which state-owned enterprises have nearly 6,000 stores and retailers while there are more than privately-owned 10,000 stations. The data also shows that, on average, the country consumes approximately 20.5 - 21 million tons of gasoline and oil each year. Thus, if the quantity of petrol is multiplied by the number of invoices that will have to be issued each retail sale according to the new policy, it will amount to tens of millions of invoices, even hundreds of millions of new invoices issued each month. However, the authorities disclosed that there are currently only two enterprises, Saigon Petro and Petrolimex, issued invoices at their 3,000 existing stores accounting for about 16 percent of the country. According to Mr. Mai Son, Deputy Director of the General Department of Taxation, the process of making laws is not immediately promulgated but it should go step by step. Specifically, when the law was promulgated, the General Department of Taxation had 2 years of legal preparation from July 1, 2022. Previously, the General Department of Taxation posted information on the website, seminars to ask for opinions from ministries, agencies, people's committees in provinces and cities, and those businesses directly impacted by the regulatory change. From the beginning of 2023 until now, the General Department of Taxation continues to deploy electronic invoices connected to cash registers at restaurants, supermarkets, and shopping centers in localities. Along with that, the deployment of electronic invoices is applicable in petroleum retail stores. As per the latest update, over 3,000 stores have been deploying e-invoices. Electronic invoices issued each time bring many benefits. For instance, e-invoice will help businesses change management and administration technology, and enhance brand and reputation when managing with technology. More importantly, not only gasoline buyers but all goods customers will enjoy many benefits when using electronic invoices. Gradually, all goods will have their origin and standards determined as announced by the manufacturing unit. HCMC implementing science-technology to develop its circular economy The HCMC Department of Science and Technology yesterday held the conference ‘Applying science-technology to build circular economy models for socio-economic growth in HCMC’. The conference aims at sharing experience and discussing priorities in scientific research for useful technological solutions and policies in the field of circular economy in HCMC. It also wants to promote close collaboration among the State, businesses, academies, and universities in studying, developing, and offering consultation about suitable circular economy models here. The ultimate goal of the conference is to help enterprises seek measures to increase their product value, creating a driving force for innovative activities and economic restructuring. Deputy Director Le Thanh Minh of the HCMC Science-Technology Department is delivering his speech Assoc. Prof. Dr. Nguyen Hong Quan – Head of the Institute for Circular Economy Development (ICED) from Vietnam National University-HCM – shared that green growth is inevitable in Vietnam and in the world in general. To grow green, it is necessary to apply circular economy models, which normally focus more on reducing input materials, optimizing manufacturing activities, treating waste, and using renewable energy. These acts help to form a production loop for maximum effectiveness in natural resource use, and thus reaching sustainable development. To better implement the circular economy in HCMC, Dr. Quan proposed an establishment of a green innovative ecosystem among HCMC, the Central Highlands, the Southern provinces, and international partners; a development of suitable training courses for students and green startups; the provision of suitable supportive policies to help companies turn green. Huynh Phu, representative of the HCMC Institute for Environment and Circular Economy, is giving his presentation Deputy Director Le Thanh Minh of the HCMC Science-Technology Department informed that lately, innovative activities in HCMC have greatly contributed to the city’s economic growth. In the 2016-2022 period, HCMC invested VND13.66 trillion (US$561.4 million) in science and technology, accounting for over 2.55 percent of the state budget. As a result, its Total Factor Productivity Index (TFP) has rapidly risen to reach an average of 46.7 percent, including a contribution of 74 percent from science and technology. HCMC’s labor productivity doubles the national one, while that of technological businesses is 1.67 times as high as the general rate of the city. Participants in the conference suggested that current circular economy models in HCMC are still at the macro level. Therefore, it is necessary to prepare more detailed roadmaps and models. The city should concentrate more on raising awareness about circular economy in the community, especially lecturers and students. Suitable infrastructure and corresponding supportive policies should be developed so that enterprises can transform from a linear to circular and greener economy. In the 2021-2025 period, HCMC aims at creating a smart and sustainable city, playing the leading role in the national economy. However, the implementation of circular economy to fulfill that mission encounters many obstacles. This has called for such a conference like this so that related organizations (businesses, educational institutes) clearly identify the importance of circular economy in manufacturing activities, and more feasible solutions can be devised to promote this economic type. Vietnam’s OCOP shrimp paste exported to Japan and Australia For a long time, shrimp paste - a rustic dish of Vietnamese people has become an OCOP (One Commune One Product) product and exported to Japan and Australia. The dish is even served in one vermicelli restaurant and one tofu restaurant with shrimp paste in New York, according to a revelation of representatives of the Ministry of Agriculture and Rural Development. Sharing information yesterday’s seminar on increasing OCOP product consumption channels organized by the Ministry of Industry and Trade in Hanoi, Mr. Nguyen Minh Tien, Director of the Trade Promotion Center for Agriculture under the Ministry of Agriculture - Rural Development said that by mid-December 2023, as per the Ministry of Agriculture and Rural Development’s update of the number of OCOP products, there are 11,054 OCOP products, an increase of more than 1,100 products compared to the data one month ago. The number of OCOP products even exceeds the target of 10,000 products set by the Ministry of Agriculture and Rural Development from 2021 to 2025. Furthermore, the quality of OCOP products has been greatly enhanced and improved. Science and technology have been applied and formed many new products, not only purely based on local values but also meet the needs of modern consumers. Along with that, the design as well as the packaging of products has been significantly improved not as simple as prior. There are now many types of modern and impressive packaging. According to Mr. Tien, all OCOP products recognized by the Ministry of Agriculture and Rural Development meet food safety and hygiene standards as well as Vietnamese technical standards such as ISO, HACCP, and GAP. Plus, some 5-star or potential 5-star OCOP products even meet world market standards. In terms of commerce, in the early stages, OCOP products were mainly sold in the domestic market; many of them even were sold in their original province. But now, many products are displayed on supermarket shelves in many countries in the world. Specifically, Mr. Tien revealed that Le Gia shrimp paste was exported to Japan and Australia in 2023. Moreover, dong vermicelli made in a facility in Binh Lieu District of the Northern Province of Quang Ninh was also bound for Europe and Australia. VND19.8 trillion approved for 61km expressway in northern Vietnam Vietnam will spend VND19.8 trillion constructing a 60.9-kilometer expressway linking two northern provinces — Nam Dinh and Thai Binh. The project has been approved by Prime Minister Pham Minh Chinh and will be developed under the public-private partnership (PPP) format. The planned road is part of the Ninh Binh-Haiphong expressway project. It will have four lanes with a speed limit of 120 kilometers per hour and is scheduled for completion in 2027. The road will run from Nghia Hung District in Nam Dinh Province to Thai Thuy District in Thai Binh Province. The Nam Dinh section will be 27.6 kilometers long while the length of the Thai Binh section will be 33.3 kilometers. The project will help boost economic growth and enhance connectivity between major cities such as Hanoi, Haiphong and Thanh Hoa. This investment is part of Vietnam’s broader plan to establish a comprehensive nationwide network of expressways. The country aims to expand this network to 4,000 kilometers by 2025. Source: VNA\/SGT\/VNS\/VOV\/Dtinews\/SGGP\/VGP\/Hanoitimes","filter_flag":1}
