{"title":"EU consumer group wants to ban carbon-neutral claims - Food Business News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzIzNDQ2LWV1LWNvbnN1bWVyLWdyb3VwLXdhbnRzLXRvLWJhbi1jYXJib24tbmV1dHJhbC1jbGFpbXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzIzNDQ2LWV1LWNvbnN1bWVyLWdyb3VwLXdhbnRzLXRvLWJhbi1jYXJib24tbmV1dHJhbC1jbGFpbXPSAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzIzNDQ2LWV1LWNvbnN1bWVyLWdyb3VwLXdhbnRzLXRvLWJhbi1jYXJib24tbmV1dHJhbC1jbGFpbXPSAQA","guidislink":false,"published":"Mon, 20 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=79, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzIzNDQ2LWV1LWNvbnN1bWVyLWdyb3VwLXdhbnRzLXRvLWJhbi1jYXJib24tbmV1dHJhbC1jbGFpbXPSAQA?oc=5\" target=\"_blank\">EU consumer group wants to ban carbon-neutral claims<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EU consumer group wants to ban carbon-neutral claims - Food Business News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmZvb2RidXNpbmVzc25ld3MubmV0L2FydGljbGVzLzIzNDQ2LWV1LWNvbnN1bWVyLWdyb3VwLXdhbnRzLXRvLWJhbi1jYXJib24tbmV1dHJhbC1jbGFpbXPSAQA?oc=5\" target=\"_blank\">EU consumer group wants to ban carbon-neutral claims<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food Business News<\/font>","source.href":"https:\/\/www.foodbusinessnews.net","source.title":"Food Business News","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"UTRECHT, THE NETHERLANDS — BEUC, a European consumer organization, is asking the European Union to ban the use of carbon-neutral claims for all products, including food and drink products. The claims mislead consumers and are scientifically inaccurate, according to the BEUC. “There is no such thing as a ‘CO2 neutral’ banana or plastic water bottle,” said Monique Goyens, director general of the BEUC. “Carbon-neutral claims are greenwashing, pure and simple. It’s a smoke screen giving the impression companies are taking serious immediate action on their climate impact. The truth is they are delaying action for many years by ‘compensating’ their carbon emissions instead. “Planting trees that will take decades to grow is far easier and cheaper, yet significantly less effective, than cutting emissions from their current climate-harmful activities.” The BEUC takes issue with carbon offsetting, which helps companies in their efforts to reach carbon neutrality. Carbon offsetting allows companies to pay for carbon credits from offsetting projects to balance out the companies’ own carbon-emitting activities. The BEUC includes 11 consumer groups from 10 countries: Austria, Belgium, Denmark, France, Germany, The Netherlands, Portugal, Spain, Sweden and Switzerland. The Climate Neutral Group, Utrecht, includes carbon offsetting as a way to help companies achieve carbon neutrality. A carbon credit represents a reduction or removal of greenhouse gas emissions from the atmosphere through a carbon offset, also called a compensation project, according to the Climate Neutral Group. Every credit represents a reduction of one ton of CO 2 in the atmosphere. By investing in carbon offsets, companies take responsibility for emissions they have yet to reduce or avoid, according to the Climate Neutral Group, which added companies should prioritize reducing their own emissions first. “Offsetting is a legitimate working mechanism that helps companies meet their targets,” the Climate Neutral Group said in a white paper. “However, compensating for your emissions always needs to happen in conjunction with reduction: It should not be a free pass to just continue emitting.” Carbon-neutral claims have drawn attention in the United States, too. A survey from Morning Consult conducted last July among 2,310 adults found 52% said they had not seen a carbon-neutral label while 41% correctly identified the term after being given three options. A class-action lawsuit against Danone Waters of North America, a business of Danone SA, was filed Oct. 13, 2022, in US District Court for the Southern District of New York. The lawsuit took issue with a carbon-neutral claim on packaging and labeling for Evian, a Danone brand. Reasonable consumers seeing the labeling and packaging would believe the manufacturing of Evian products is sustainable and does not leave a carbon footprint, according to the lawsuit.","filter_flag":1}
{"title":"Wyke Farms carbon-neutral Aged English Cheddar expands availability in U.S. - dairyfoods.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2MjY2LXd5a2UtZmFybXMtY2FyYm9uLW5ldXRyYWwtYWdlZC1lbmdsaXNoLWNoZWRkYXItZXhwYW5kcy1hdmFpbGFiaWxpdHktaW4tdXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2MjY2LXd5a2UtZmFybXMtY2FyYm9uLW5ldXRyYWwtYWdlZC1lbmdsaXNoLWNoZWRkYXItZXhwYW5kcy1hdmFpbGFiaWxpdHktaW4tdXPSAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2MjY2LXd5a2UtZmFybXMtY2FyYm9uLW5ldXRyYWwtYWdlZC1lbmdsaXNoLWNoZWRkYXItZXhwYW5kcy1hdmFpbGFiaWxpdHktaW4tdXPSAQA","guidislink":false,"published":"Tue, 28 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=28, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=87, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2MjY2LXd5a2UtZmFybXMtY2FyYm9uLW5ldXRyYWwtYWdlZC1lbmdsaXNoLWNoZWRkYXItZXhwYW5kcy1hdmFpbGFiaWxpdHktaW4tdXPSAQA?oc=5\" target=\"_blank\">Wyke Farms carbon-neutral Aged English Cheddar expands availability in U.S.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Wyke Farms carbon-neutral Aged English Cheddar expands availability in U.S. - dairyfoods.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmRhaXJ5Zm9vZHMuY29tL2FydGljbGVzLzk2MjY2LXd5a2UtZmFybXMtY2FyYm9uLW5ldXRyYWwtYWdlZC1lbmdsaXNoLWNoZWRkYXItZXhwYW5kcy1hdmFpbGFiaWxpdHktaW4tdXPSAQA?oc=5\" target=\"_blank\">Wyke Farms carbon-neutral Aged English Cheddar expands availability in U.S.<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">dairyfoods.com<\/font>","source.href":"https:\/\/www.dairyfoods.com","source.title":"dairyfoods.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Wyke Farms has expanded U.S. availability of Ivy’s Reserve Vintage Cheddar, which it says is the “world’s first carbon-neutral Aged English Cheddar.” Founded in 1861 in Somerset, England, Wyke Farms notes that its Ivy’s Reserve Vintage Cheddar, which is aged up to 18 months under wood to produce a creamy, complex flavor and nutty, rounded finish, produces 18,000 tons of cheese annually using milk from its own grass-grazing herds. The reserve cheddar cheese will be available in April in more than 200 Vons and 120 Raley stores in California for a suggested retail price of $9.99-$10.99 for a 7-ounce brick. It’s currently available in Shaw’s Supermarkets, Star Market, Safeway and Fresh Thyme Market stores nationwide for around $8.99. ","filter_flag":1}
{"title":"Hanon Systems Commits to Science-Based Targets Initiative (SBTi) - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaGFub24tc3lzdGVtcy1jb21taXRzLXRvLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLXNidGktMzAxNzc1MzI1Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaGFub24tc3lzdGVtcy1jb21taXRzLXRvLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLXNidGktMzAxNzc1MzI1Lmh0bWzSAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaGFub24tc3lzdGVtcy1jb21taXRzLXRvLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLXNidGktMzAxNzc1MzI1Lmh0bWzSAQA","guidislink":false,"published":"Sun, 19 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=19, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=6, tm_yday=78, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaGFub24tc3lzdGVtcy1jb21taXRzLXRvLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLXNidGktMzAxNzc1MzI1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Hanon Systems Commits to Science-Based Targets Initiative (SBTi)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Hanon Systems Commits to Science-Based Targets Initiative (SBTi) - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvaGFub24tc3lzdGVtcy1jb21taXRzLXRvLXNjaWVuY2UtYmFzZWQtdGFyZ2V0cy1pbml0aWF0aXZlLXNidGktMzAxNzc1MzI1Lmh0bWzSAQA?oc=5\" target=\"_blank\">Hanon Systems Commits to Science-Based Targets Initiative (SBTi)<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Company publicly declares it is setting emission reduction targets in line with the Business Ambition for 1.5°C campaign SEOUL, South Korea, March 19, 2023 \/PRNewswire\/ -- Hanon Systems (KS:018880), a leading global provider of automotive thermal and energy management solutions, is announcing it has joined the Business Ambition for 1.5°C campaign of the Science-Based Targets Initiative (SBTi) to further demonstrate its commitment to address the effects of climate change. The SBTi is leading the campaign that helps companies set emission reduction targets in line with the 2015 Paris Agreement pursue efforts to limit warming to 1.5°C. \"Committing to establish SBTi targets is an important step in the company's journey to become carbon neutral by 2040 and support the global effort to address climate change,\" said Hanon Systems President and Chief Executive Officer Min Sung. \"We are proud to join the Business Ambition for 1.5°C campaign and encourage other companies to do the same.\" Since 2021, the Hanon Systems Carbon Neutral Office has been overseeing the actions of various work streams to accelerate efforts to reduce the company's carbon footprint. Among these includes defining the company's carbon neutral roadmap; understanding the carbon neutral requirements of customers; developing low-carbon variants of existing products and new low-carbon solutions; educating the workforce to inform, motivate and garner involvement; and partnering with the supply chain to source low-carbon parts and materials. In addition to establishing science-based emissions targets, executing projects and promoting greater transparency of corporate-wide carbon emissions have been among the company's top carbon neutral priorities. In line with the requirements of the SBTi, the company will submit its science-based targets for official validation within the next 24 months. The SBTi is a global body enabling businesses to set ambitious carbon emission reduction targets in line with the latest climate science. This initiative is a collaboration between Carbon Disclosure Project (CDP), the United Nations Global Compact, World Resources Institute (WRI) and the World Wide Fund for Nature (WWF). About Hanon Systems Hanon Systems is a full-line supplier of automotive thermal and energy management solutions for electrified and conventional vehicles. Its offering includes a wide range of solutions in the areas of heating ventilation and air conditioning; powertrain cooling; compressor; fluid transport; and electronics and fluid pressure. The company currently operates 53 manufacturing sites and three regional innovation centers, and employs more than 21,000 people across 21 countries. To learn more, visit hanonsystems.com. Follow Hanon Systems: LinkedIn: https:\/\/www.linkedin.com\/company\/hanonsystems YouTube: https:\/\/www.youtube.com\/channel\/UC6bSZ7NMg7LPhXDyTOMwebQ\/feed Media Contact: Tracy Stallings Director – Global Corporate Communications +1-313-418-8409 – mobile [email protected] Asia Jiwon You +82 2 3498 5572 +82 10 8926 1603 – mobile [email protected] Europe Veronika Prudilova +420-556-780388 +420-737222791 – mobile [email protected] Investor Relations Chung Kwan Shin +82-2-3498-5530 +82-10-9557-9388 [email protected] SOURCE Hanon Systems","filter_flag":1}
{"title":"EU urged to ban 'carbon neutral' claims for food and drink: 'There's no such thing as a CO2 neutral banana' - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMTAvRVUtdXJnZWQtdG8tYmFuLWNhcmJvbi1uZXV0cmFsLWNsYWltcy1mb3ItZm9vZC1hbmQtZHJpbmstVGhlcmUtcy1uby1zdWNoLXRoaW5nLWFzLWEtQ08yLW5ldXRyYWwtYmFuYW5h0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMTAvRVUtdXJnZWQtdG8tYmFuLWNhcmJvbi1uZXV0cmFsLWNsYWltcy1mb3ItZm9vZC1hbmQtZHJpbmstVGhlcmUtcy1uby1zdWNoLXRoaW5nLWFzLWEtQ08yLW5ldXRyYWwtYmFuYW5h0gEA?oc=5","id":"CBMilwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMTAvRVUtdXJnZWQtdG8tYmFuLWNhcmJvbi1uZXV0cmFsLWNsYWltcy1mb3ItZm9vZC1hbmQtZHJpbmstVGhlcmUtcy1uby1zdWNoLXRoaW5nLWFzLWEtQ08yLW5ldXRyYWwtYmFuYW5h0gEA","guidislink":false,"published":"Fri, 10 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=69, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMTAvRVUtdXJnZWQtdG8tYmFuLWNhcmJvbi1uZXV0cmFsLWNsYWltcy1mb3ItZm9vZC1hbmQtZHJpbmstVGhlcmUtcy1uby1zdWNoLXRoaW5nLWFzLWEtQ08yLW5ldXRyYWwtYmFuYW5h0gEA?oc=5\" target=\"_blank\">EU urged to ban 'carbon neutral' claims for food and drink: 'There's no such thing as a CO2 neutral banana'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"EU urged to ban 'carbon neutral' claims for food and drink: 'There's no such thing as a CO2 neutral banana' - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilwFodHRwczovL3d3dy5mb29kbmF2aWdhdG9yLmNvbS9BcnRpY2xlLzIwMjMvMDMvMTAvRVUtdXJnZWQtdG8tYmFuLWNhcmJvbi1uZXV0cmFsLWNsYWltcy1mb3ItZm9vZC1hbmQtZHJpbmstVGhlcmUtcy1uby1zdWNoLXRoaW5nLWFzLWEtQ08yLW5ldXRyYWwtYmFuYW5h0gEA?oc=5\" target=\"_blank\">EU urged to ban 'carbon neutral' claims for food and drink: 'There's no such thing as a CO2 neutral banana'<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Is a ‘climate neutral’ food basket too good to be true? According to The European Consumer Organisation (BEUC), multiple examples of products claiming carbon neutrality suggest it is. From single-use bottled water, to milk and cheese, meat, and plant-based alternatives, products across various categories now carry the ‘CO2 neutral’ claim. Even some fruit, from bananas to blueberries and clementines, are known to carry the claim. However, in BEUC’s opinion, there is ‘no such thing as a carbon neutral banana’. The consumer organisation is calling for a ban on all carbon neutral claims, including ‘carbon neutral’, ‘CO2 neutral’, ‘carbon positive’, and ‘carbon neutral certified’. Why ban carbon neutral claims?​ For a brand to claim carbon neutrality, all emissions it cannot decarbonise are neutralised through the support of environmental projects. This practice is called carbon offsetting. It is also expected that a carbon neutral brand will work to reduce its emissions over time. BEUC takes issue with carbon neutral claims, even when carbon offsetting projects are funded to achieve it. The consumer organisation argues the claim is ‘scientifically inaccurate’, since the production of all food and drinks will always necessitate the emission of carbon. And the practice of carbon offsetting itself, according to BEUC, provides no guarantees of ‘locking in’ carbon for the future. Further, the consumer organisation believes such claims mislead consumers, giving the false impression that the products are a good choice for the planet. Carbon neutral claims mislead consumers, argues BEUC. GettyImages\/gilaxia The Carbon Trust, which measures and certifies companies’ carbon neutral claims, agrees that claims such as ‘carbon positive’ or ‘climate negative’ should be off the table. Only ‘carbon neutrality’ has an internationally recognised definition and specification – PAS 2060, which the Carbon Trust certifies against, explained John Newton, Director, Label Programme Delivery at the Carbon Trust. “Our communications guidelines do not allow the use of terms like ‘carbon positive’ or ‘climate negative’ as there is no recognised definition or specification for these terms, and they can easily be misleading,” ​he told this publication. The Carbon Trust does, however, advocate for carbon neutrality. Consumer understanding and labelling transparency can be improved by brands including more context wherever the label is used, Newton advised. There should also be links available, providing consumers access to resources explaining exactly what carbon neutrality is and how it is achieved, he added, which starts with measuring a footprint, then implementing a carbon reduction plan, and finally offsetting the remaining footprint. ‘Almost all food and drinks will necessitate emissions of carbon’​ One of BEUC’s main arguments, is that carbon neutrality is ‘scientifically inaccurate’, as the production of ‘all’ food and drinks necessitate the emission of carbon. “There is no such thing as a ‘CO2 neutral’ banana or plastic water bottle. Carbon neutral claims are greenwashing, pure and simple,” ​said Monique Goyens, director general of BEUC. “It’s a smoke screen giving the impression companies are taking serious immediate action on their climate impact.”​ Research conducted by the German consumer group vzbv found that ‘CO2 neutral’ and ‘climate neutral’ claims had the strongest impact on consumer perception of the supposed climate friendliness of a food product – even more so than providing the product’s detailed CO2 footprint. The same survey found that while a strong majority of consumers (69%) said they felt they understood the ‘climate neutral’ claim, only 8% of consumers actually understood that the claim did not mean ‘no greenhouse gas emissions’ had been created. Whether carbon offsetting guarantees the ‘locking in’ of carbon for the future, or not, is something that should be assessed when selecting offsets, suggests the Carbon Trust. GettyImages\/gan chaonan The Carbon Trust acknowledges that almost all food and drinks will necessitate emissions of carbon. But explained that carbon neutrality simply means that the product has been verified to PAS 2060 and does not attest that there is no net climate impact in the product’s lifecycle. PAS 2060, the internationally accepted methodology for carbon neutrality requires that the manufacturer has a verified footprint for the baseline year of the product; a verified year-on-year reduction in emissions of the product; a commitment to future reductions with a validated carbon reduction plan for the production of the product; and verification that the residual emissions are matched by the purchase of high-quality carbon offsets. “Carbon neutrality is a mature and well-defined term with a well-publicised methodology,” ​explained Carbon Trust’s Newton. “Although the name at face value does not adequately explain the full concept, consumers who have an interest in the claim have access to multiple sources of information, and the opportunity to understand the meaning of the term.”​ ‘Locking in’ carbon via offsetting: does it depend on the scheme?​ Another reason BEUC takes issue with food and drink brands claiming carbon neutrality, is that carbon offsetting – which underpins most such claims – provides no guarantees for ‘locking in’ carbon for the future. Rather, these companies are ‘delaying action for many years’ by ‘compensating’ their carbon emissions, according to Goyens. “Planting trees which will take decades to grow is far easier and cheaper, yet significantly less effective, than cutting emissions from their current climate-harmful activities.”​ Further, the compensatory effects of nature-based offsetting projects are ‘anything but guaranteed’, stressed the consumer organisation. As in the case of forestry projects, logging – as well as droughts and wildfires – can quickly eradicate forests planted as offsetting projects, while the carbon for which they are meant to compensate remains in the atmosphere for centuries. “The same is true for offsetting schemes that rely on carbon farming programmes, whereby farmers are being paid to implement certain agricultural practices supposed to draw carbon into their soils: once the programme ends, land can be converted to a parking lot or ploughed up, releasing the carbon that has been sequestered.”​ Whether carbon offsetting guarantees the ‘locking in’ of carbon for the future, or not, is something that should be assessed when selecting offsets, suggested the Carbon Trust’s Newton. “There are differences in the quality of offset schemes and our guidance is that to ensure a carbon offset delivers measurable climate impact, it must meet all five of the following criteria, permanence being one of these.”​ Selecting a carbon offset scheme Verified: ​to ensure the integrity of the verification process, emissions reductions achieved through a carbon credit should always be verified by an independent third party according to an established standard or protocol. Additional: ​a carbon credit is only valuable if the project it funds results in greenhouse gas emissions reductions or removals that would not otherwise have occurred. This condition helps to demonstrate that the project has a measurable impact on the global level of greenhouse gas emissions. Permanent:​ the provider must guarantee that the level of carbon emissions avoided, reduced, or removed by the project is maintained over time. For instance, if a carbon credit is used to finance reforestation of an area of land, and that forest then burns down, additional credits must be allocated towards financing an equivalent amount of carbon sequestration. No leakage:​ the project funded must not lead to the unintended release of greenhouse gas emissions elsewhere. For example, a reforestation project that displaces agricultural activities to other areas where they could generate emissions would not meet this criterion. No double-counting: ​the carbon credit must not be double counted (i.e., sold to more than one buyer, enabling two or more buyers to take ownership of the same carbon reduction). This is often ensured by the provider ‘retiring’ the credit after sale, making it unavailable for repurchase. This ensures all carbon credits available on the market genuinely represent a unique unit of carbon. Weeding out greenwashing​ Ultimately, BEUC believes carbon neutral claims are doing more harm than good. Last year, the European Commission published a proposal aimed at empowering consumers for the green transition, which includes a targeted amendment for the Unfair Commercial Practices Directive (UCPD). The consumer organisation wants the Commission to ban carbon neutral claims and their derivatives from the annex of the UCPD, and in so doing, effectively ‘weed out’ carbon neutral claims from the market. The Carbon Trust acknowledges that greenwashing exists, and that is a ‘significant concern’ in every industry – with implications for business and consumers. But the ‘best way’ to avoid greenwashing, according to the Carbon Trust, is via transparent communication. “The same rules apply no matter what industry a company is operating in; be factual, evidence-based, and make sure claims are not more than achievements. By being honest, truthful, and accurate, consumers will have a clearer, better understanding of the implications of their choices.”​ Where there is not enough space on a product’s packaging to provide more information, the consultancy recommends using URL weblinks or QR codes directly to the source of information, and not just to the product’s homepage.","filter_flag":1}
{"title":"Multi X launches 100% carbon-neutral certified salmon - Aquafeed.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9mYXJtaW5nLW5ld3MvbXVsdGkteC1sYXVuY2hlcy0xMDAtY2FyYm9uLW5ldXRyYWwtY2VydGlmaWVkLXNhbG1vbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9mYXJtaW5nLW5ld3MvbXVsdGkteC1sYXVuY2hlcy0xMDAtY2FyYm9uLW5ldXRyYWwtY2VydGlmaWVkLXNhbG1vbi_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9mYXJtaW5nLW5ld3MvbXVsdGkteC1sYXVuY2hlcy0xMDAtY2FyYm9uLW5ldXRyYWwtY2VydGlmaWVkLXNhbG1vbi_SAQA","guidislink":false,"published":"Thu, 02 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=61, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9mYXJtaW5nLW5ld3MvbXVsdGkteC1sYXVuY2hlcy0xMDAtY2FyYm9uLW5ldXRyYWwtY2VydGlmaWVkLXNhbG1vbi_SAQA?oc=5\" target=\"_blank\">Multi X launches 100% carbon-neutral certified salmon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Multi X launches 100% carbon-neutral certified salmon - Aquafeed.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LmFxdWFmZWVkLmNvbS9uZXdzcm9vbS9mYXJtaW5nLW5ld3MvbXVsdGkteC1sYXVuY2hlcy0xMDAtY2FyYm9uLW5ldXRyYWwtY2VydGlmaWVkLXNhbG1vbi_SAQA?oc=5\" target=\"_blank\">Multi X launches 100% carbon-neutral certified salmon<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Aquafeed.com<\/font>","source.href":"https:\/\/www.aquafeed.com","source.title":"Aquafeed.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Multi X Frozen, Fillet Trim D is the first Chilean carbon-neutral certified product available in the U.S. market. As one of the largest importers of fresh, frozen, and smoked Atlantic salmon into the U.S., Multi X is committed to feeding the future by advocating and promoting responsible solutions that meet the growing global demand for protein. As a result of that commitment, the company launched the first 100% CarbonNeutral® Certified Chilean salmon in the U.S. market. Multi X's 100% Carbon Neutral Trim D frozen fillet is now available in the U.S. and debuts at the Boston Seafood Show 2023. To achieve CarbonNeutral® Product Certification, Multi X works with Climate Impact Partners, specialists in carbon market solutions for climate action, in accordance with the requirements of the CarbonNeutral® Protocol. Fernando Pérez, Multi X sales and marketing officer, said that “in addition to our Zero Waste to landfill commitment, already achieved in 2020 in our processing plants, our 100% CarbonNeutral® certified product gives retailers the opportunity to provide a sustainable option for shoppers. Consumer trends show that environmental impacts from the foods they eat are relevant drivers for their buying decisions.\" He further added that “by buying our 100% CarbonNeutral® certified products, consumers are helping develop local communities and increasing green energy infrastructures in addition to their impact on the environment. When Multi X Salmon reaches the dinner table, families can feel confident their meal is making a difference in taking care of our planet.” Francisco Lobos, Multi X chief of sustainability and corporate affairs, added, “we are launching a new line of products according to our purpose of nourishing the future, and caring for the world. Multi X continues to work on CarbonNeutral® certification for other product lines as it drives to achieve carbon neutrality by 2030.” Multi X recently partnered with BioMar to reduce the carbon footprint of the final product with sustainable feed alternatives.","filter_flag":1}
{"title":"How sustainable are your running shoes? - Runner's World UK","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnJ1bm5lcnN3b3JsZC5jb20vdWsvZ2Vhci9zaG9lcy9hNDMzODc2MzAvc3VzdGFpbmFibGUtcnVubmluZy1zaG9lcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnJ1bm5lcnN3b3JsZC5jb20vdWsvZ2Vhci9zaG9lcy9hNDMzODc2MzAvc3VzdGFpbmFibGUtcnVubmluZy1zaG9lcy_SAQA?oc=5","id":"CBMiT2h0dHBzOi8vd3d3LnJ1bm5lcnN3b3JsZC5jb20vdWsvZ2Vhci9zaG9lcy9hNDMzODc2MzAvc3VzdGFpbmFibGUtcnVubmluZy1zaG9lcy_SAQA","guidislink":false,"published":"Wed, 29 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=88, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnJ1bm5lcnN3b3JsZC5jb20vdWsvZ2Vhci9zaG9lcy9hNDMzODc2MzAvc3VzdGFpbmFibGUtcnVubmluZy1zaG9lcy_SAQA?oc=5\" target=\"_blank\">How sustainable are your running shoes?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Runner's World UK<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How sustainable are your running shoes? - Runner's World UK","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiT2h0dHBzOi8vd3d3LnJ1bm5lcnN3b3JsZC5jb20vdWsvZ2Vhci9zaG9lcy9hNDMzODc2MzAvc3VzdGFpbmFibGUtcnVubmluZy1zaG9lcy_SAQA?oc=5\" target=\"_blank\">How sustainable are your running shoes?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Runner's World UK<\/font>","source.href":"https:\/\/www.runnersworld.com","source.title":"Runner's World UK","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"The running shoe industry is awash with sustainable messaging, net-zero targets and innovative material developments that seek to assure us our running footsteps are treading lighter on the planet, but the uncomfortable truth is these incremental changes in manufacturing are only scratching the surface. And if the current unsustainable manufacturing practices and consumption patterns continue, the planet will face irreversible ecological consequences, warn scientists. A panel of industrial engineers from Loughborough University’s Centre for Sustainable Manufacturing and Recycling Technologies (SMART) has warned that the current initiatives, investments and regulations to mitigate the impact of manufacturing on climate change are, at best, slowing down the rate of growth rather than eliminating or reversing the damage caused. Scientists agree that to have any hope of limiting global warming to a maximum increase of 2%, greenhouse gas (ghg) emissions need to be reduced by 80% by 2050. Yet the current targets fall far short of this level. The latest estimate is that by 2050, ghg emissions will have increased by over 50%, even with all the current policies and targets in place. ‘It is the grossest kind of simplification and understatement to say we are not taking enough meaningful action,’ warns Shahin Rahimifard, professor of sustainable engineering at SMART. And the global trainer industry is a huge part of the problem – if it were a country, it would be the world’s 17th largest polluter, emitting as much CO2 as the whole of the UK. What is sustainability, anyway? Let’s go back to basics and ask if we’re all even speaking the same language when it comes to what we’re trying to achieve. Specific definitions of what sustainability is and how it can be achieved are difficult to agree on, but the term broadly relates to surviving on earth for a long time by protecting the environment. Professor Rahimifard argues the term is becoming ineffectual, however, because it often refers to the ‘least worse option’ and the ‘less bad solution’ but does not go far enough towards solving the earth’s manufacturing and consumption problems. And as companies set their own emission goals, they all interpret environmental language differently. Recognising the vagueness of the term, the London College of Fashion and publisher Condé Nast have developed a sustainable-fashion glossary. The term ‘carbon neutral’, is defined as equivalent to ‘net zero’ and, in the long term, is achieved by transitioning to an economy that doesn’t rely on burning fossil fuels. This means durable footwear that is manufactured using renewable energy and is made from regenerative organic materials. The materials and products must be transported using packaging and freight that does not rely on fossil fuels. Allbirds Which running shoes are eco-friendly? No major brand has managed to achieve this yet, though is perhaps the closest of the bigger players. Starting with a clean slate (it was set up in 2016), the company has been able to explicitly set its mission statement as ‘reversing climate change through better business’. ‘It’s not just about doing less and less of a bad thing; it’s about ultimately using regenerative technologies and ways to actually remove carbon over time through a more modern business model,’ says Jad Finck, Allbirds’ vice president of innovation and sustainability. ‘One of the biggest challenges of the existing incumbents is the burden of an old dirty portfolio.’ Allbirds does not calculate carbon offsetting in its race to carbon zero, but many companies do and their methods are not always transparent. In reality, many brands are reaching a self-imposed net zero target largely by carbon offsetting. This includes schemes such as planting trees and capturing CO2, which, in itself, requires energy. Carbon offsetting has been heavily criticised for not delivering enough of a reduction in carbon and continuing the status quo, allowing the industry to avoid making radical changes to manufacturing processes. Professor Rahimifard describes a large proportion of carbon offsetting as a ‘totally shambolic’ approach that doesn’t stand up to scrutiny. ‘Carbon neutral doesn’t stop creating carbon, which is what’s needed,’ he says. ‘It’s an estimated type of approach. Net zero, carbon neutral, sustainability – these terms are becoming part of a dated view that doesn’t address the challenges we’re facing.’ Replacing this language are terms such as climate positive, net-negative emissions and net positive. ‘The only way is the net positive approach, because sustainability itself is not enough,’ says Professor Rahimifard. ‘Net positive is a restorative, regenerative, healing approach towards our ecosystem and production industry that puts back more into society and the environment than is taken out.’ What are the current challenges in the footwear industry? The reality of achieving this in the world of running shoes is extremely complex, with convoluted supply chains, dozens of shoe components (65 distinct parts on average) and global distribution of products. The average pair of running shoes generates 14kg of carbon emissions during its life cycle, from raw material to landfill, with manufacturing the largest emitter in the process (9.5kg). Then there is the release of toxic chemicals when shoes are disposed of. ‘Polyurethane and polyester are responsible for the majority of the carbon footprint,’ explains Danny McLoughlin, author of a report on ‘eco sneakers’ by running website RunRepeat. ‘Nylon also has a disproportionate impact. They have a large impact on the carbon footprint because of the amount of energy required to process the materials.’ Critics argue that the footwear industry has been slow to address its role in the climate crisis, using sustainability as a marketing ploy rather than a means to effect meaningful change. But others believe things are beginning to shift in the right direction. ‘I’m sure there will be examples of brands doing it more as a kind of marketing tool, but I think that is less common today,’ says Naomi Braithwaite, senior lecturer in fashion marketing and branding at Nottingham Trent University. ‘The way the world is moving, business at all levels is recognising we have to do something differently. So brands really want to make that change, but it’s very hard to be 100% sustainable and I think it takes time,’ says Dr Braithwaite. If we decide to become eco-conscious consumers, it can be difficult to distinguish between greenwashing and genuine net-positive business models when it comes to choosing our running shoes. Allbirds hopes the industry will follow its example by labelling all shoes with a carbon life-cycle emission stamp, which clearly indicates output from cradle to grave. But until this happens, consumers are left to weigh up the pros and cons of the growing array of ‘sustainable’ footwear products on the market. What can we do to shop more sustainably? One of the simplest ways to reduce your footprint is to buy a shoe that lasts a long time and can be repaired, or recycled when it no longer performs. But recycling via charity shops and clothing banks is hugely problematic. Only 10% to 30% of donated items are actually sold in the charity shops we donate them to, with the rest sold to textile merchants, who ship much of what they buy overseas, often to developing countries. This has led to a surplus in those countries and, ultimately, huge numbers of donations being discarded. Every week, Kantamanto Market in Ghana – the largest secondhand clothing market in West Africa – receives 15 million items of used clothing. With 40% of those products being discarded, Ghana’s capital, Accra, is overflowing with clothing waste. This waste is either burned on street corners or on huge bonfires or sent to landfills, where the overflow washes downstream into the ocean, polluting beaches and entire ecosystems as a result. ON RUNNING So which running brands are taking sustainability seriously? Fortunately, some brands are now stepping in to directly recycle their products, grinding down materials to reuse in the manufacture of new shoes. In summer 2022, Merrell launched its , which aims to keep footwear out of landfill. The scheme involves taking back hundreds of thousands of pairs of shoes in the UK, Spain, France, Germany, Belgium, the Netherlands, Luxembourg, Sweden and Finland. These shoes are repaired and refurbished for resale at 50% of the original price, broken down for use in new products or recycled for other uses. As an incentive, when runners send their no-longer-wanted shoes back, they receive £20 off new Merrell footwear on purchases over £80. Going a step further, Swiss brand . For £25 a month, members can get a fresh pair of shoes every six months, sending their old, used ones back to be ground down and recycled into new components. Related Story On launches a recyclable shoe you can subscribe to Meanwhile, sportsshoes.com has partnered with and delivery firm Evri to enable runners to return old or unwanted shoes, which are then distributed to charities around the world. But critics such as Professor Rahimifard argue that while returning and reusing individual pairs of shoes may provide short-term benefits, these need to be carefully assessed against the carbon involved in shipping and cleaning the footwear. Michael Doughty, co-founder of , says the industry is largely ‘propagating the same problem, which is a reliance on a finite resource’. ‘Currently, the sportswear and footwear market is very reliant on fossil fuel-derived materials such as polyester and nylon,’ says Doughty. ‘A lot of the sustainability work is focused on recycled content of those same materials.’ Related Story 8 best vegan running trainers The issue raised by Professor Rahimifard, Doughty and others is that while recycling may delay products from reaching landfill and have lower carbon emissions than manufacturing shoes from virgin materials, it does not address the underlying issue and is not enough to prevent irreversible changes to the climate. Nor does it do enough to address the huge problem of overconsumption, with schemes such as Cyclon encouraging consumers to get value for money by replacing their footwear every six months. This leads to the hugely damaging belief that shoes have to be replaced after around 500 miles, which drives overconsumption and the carbon emissions needed to satisfy demand. What is the life span of running shoes? Dan Lawson, ultrarunner and co-founder of upcycling outfit ReRun Clothing, says to ignore advice on when to change your trainers. ‘Shoes can last thousands of miles,’ says Lawson. ‘It baffles me how shoe companies bang on about shoes’ short lifespans; they should be doing everything to make them last longer.’ Record-breaking ultrarunner Jasmin Paris, a co-founder of The GreenRunners, agrees, estimating that she wears her running shoes for around 2,000 miles. Related Story ReRun clothing: Everything you need to know Addressing the issue of shoes’ lifespan, one of Allbirds’ key commitments is to double the life of its shoes by 2025 through improved construction techniques. It also highlights its machine-washable footwear’s versatility as well as its durability, because, obviously, the more situations a shoe can be worn in, the fewer shoes you need. ‘We wanted shoes that could blur categories and could be used for running, but that you could also wear for business casual, or to a restaurant,’ explains Finck. ‘We’re going after modern, timeless classics that stay in our line for a very long time.’ Zen Running Club Newcomers Zen Running Club and Hylo Athletics follow the same mantra, stressing that their plant-powered footwear is built for durability. ‘We’re very insistent on this shoe lasting as long as any other running shoe on the market,’ says Dominic Sinnott, designer and co-founder of Zen. Meanwhile, Hylo has an NFC (near field communication) tag that, when scanned, links its customers to hyloop, a technology platform that advises on care, repair and recycling options. ‘We’re trying to encourage longer use of products,’ says Doughty. ‘The most significant decision you can make is not to buy anything new so we’re trying to encourage that through technology.’ Durability is definitely on the radar of ultrarunning superstar Kilian Jornet, who recently launched NNormaltrail shoes with Spanish footwear brand Camper. Its aim is to produce fewer, more durable products that eschew seasonal changes and fashion trends. The shoes are minimal by design, to reduce the number of seams that degrade over time and use as few components as possible. ‘I think we need to change the way we sell and buy products,’ says Jornet, ‘not to try to sell new products to replace old ones that are still in great shape but can “feel old”. That seems simple, but it involves big changes in the industry. We also need to realise that products are something we should take care of, repair and, eventually, when we need to replace them, ensure a circularity to build new products.’ Which running brands are eco-friendly? Some brands are focusing their attention on recycled materials as a means to reach net zero (but not net positive). Merrell’s Moab Speed trail shoes are made with 100% recycled mesh lining and laces, while Nike’s sustainable materials range feature models such as Pegasus TurboNext Nature, made from 50% recycled content by weight. Using recycled materials is, of course, a positive step, but some argue it doesn’t go far enough. ‘Those types of materials are really working with the system that we have right now, which is, unfortunately, a large amount of consumer waste is being put into the environment, such as drinks bottles and fishing nets, and these types of things are being turned into those recycled products,’ says Matt Williams, co-founder of Greenspark, which supports businesses’ sustainability goals. But while recycled polyester uses up to 84% less energy to produce than virgin polyester, the material needs to be processed in the first place. Adidas uses waste plastic salvaged from the ocean in the uppers of its Parley shoes, which is undeniably a good thing, but these materials still require energy to be turned into the Primeknit that wraps around your feet. Nike uses polyester made from plastic bottles diverted from landfill, which, again is beneficial, but not without energy costs. A 2021 report by RunRepeat concluded that without updating manufacturing processes, major companies were not going to make meaningful strides in reducing carbon emissions regardless of what material shoes were made from. ‘Eco-shoes are not going to save the planet – all they’ll do is kill it a little more slowly than conventional shoes,’ says McLoughlin. His report concluded that ‘eco-sneakers’ (footwear containing some recycled materials) cut emissions by less than 10% and a shoe with 100% recycled materials makes a saving of just 24%. This was largely due to the manufacturing process making up 64% of all carbon emissions, irrespective of the materials used. You also need to be aware of just how much recycled material is being used, as recycled components may just make up a fraction of a shoe. ‘There’s definitely been a lot of greenwashing in the market, brands jumping on the green bandwagon,’ says Williams. ‘That has made it more difficult for consumers to make the right choice. How much is actually recycled? Is it 100% recycled or just 20%, with 80% still being made from virgin materials?’ Is Nike really eco-friendly? Meanwhile, huge brands such as Nike have been promoting their ‘journey towards a zero carbon and zero waste future’ by announcing partnerships with carbon-offsetting asset management companies such as EFM). But while Nike aims to power owned and operated facilities with 100% renewable energy by as soon as 2025, there is still a reliance on recycled materials. If the footwear industry is serious about having a carbon neutral (without offsetting) or positive impact on the planet, then renewable energy, green transportation and recycled materials are still not enough. Using renewable – rather than recycled – materials is the only way to create a completely closed-loop economy. Innovation with plant-based materials, as well as climate-positive wool, are starting to emerge. The question is whether change will occur quickly enough to prevent irreparable damage to the earth. What about Asics? In 2022, Asics launched the Gel-Lyte III CM shoe, with a carbon emission stamp of 1.95kg across its life cycle. This is significantly less than a traditional pair of running shoes, which emit 14kg CO2, according to researchers at the Massachusetts Institute of Technology. The Gel-Lyte III CM contains bio-based polymers in the midsole and sockliner that are partially derived from sugar cane, but a large part of the shoe is derived from recycled polyester. Still, like other initiatives, Williams acknowledges that this is a ‘step in the right direction’ and Asics sustainability manager Minako Yoshikawa says it ‘is only the beginning’. Could Allbirds be the most sustainable running brand? Allbirds, which has ambitions to be emissions-free well before 2050, also acknowledges it has a long way to go. But by working with brands such as Adidas on the 2.94kg CO2e [CO2 and other greenhouse gases] Futurecraft shoe, it is trying to lead innovation. Using natural renewable materials such as sugar cane, eucalyptus, plant rubber and merino wool, the company is on target to reduce the use and carbon footprint of raw materials by 25% by the end of 2025. But its goal of ‘75% sustainably sourced materials’ still relies on both natural and recycled components – for now. ‘We think natural bio-based is the long-term vision,’ says Finck. ‘Renewable source, low carbon and, ultimately, regenerative.’ What are the most ethical running shoe brands? Exploring material science is also key to Hylo’s vision of the future of running-shoe production. The company currently uses organic cotton, corn, algae and natural rubber to create a shoe with 60% bio content. ‘We’re not fully at that north star, but when we look to develop new shoes, we not only think about how can we improve the performance, but also how can we improve that number to 100,’ says Doughty. Similarly, Zen Running Club is innovating with castor beans, eucalyptus, natural rubber and sugar cane while still placing an emphasis on performance. It’s an ongoing process but the company is making consistent progress. ‘We’re now getting close to 60% sugar cane within the shoe, when a few years ago it was 30%,’ says Sinnott. So how about ‘super shoes’, which rely heavily on chemicals to create their energy-returning midsoles? Biotechnology is closing in. ‘There’s a lot of work going into it from our side to try to create a nitrogen-infused bio-based mix,’ says Andy Farnworth, Zen co-founder. ‘But the super shoe carbon-plated, eco rocker shoes aren’t there yet,’ he admits. While the shift to renewable materials could be a giant stride towards shoe sustainability, Professor Rahimifard points out that organic materials emit methane when they degrade. Methane is a powerful greenhouse gas, so the end-of-life assessment has to include this. Part of Allbirds’ solution is to use carbon-absorbing wool through regenerative farming techniques in New Zealand, which means the process of producing the wool absorbs more carbon than it emits. Positive change is happening at varying rates across the shoe industry, but when we turn the focus to ourselves as individuals, the biggest thing we can do is simply consume less. Continuing as we are is not a viable option. Professor Rahimifard cites studies that show if everyone in the world consumed at the rate of the average US resident, the resources of five earths would be needed to sustain consumption. The required shift in mindset is not all down to us as individuals. ‘Perhaps the most important action by all manufacturers, including footwear producers, is to identify how they can create economic growth but not through producing a large volume of products and encouraging increased consumption,’ concludes Professor Rahimifard. But we can play an important part. ‘Consumers have to change as well,’ says Braithwaite. ‘It really requires a shift in consumer attitudes and consumer behaviour.’ If you want to take a step towards protecting the planet, looking for more sustainable footwear when you need new shoes can help – reducing your carbon emissions by around 9% according to RunRepeat. But ‘the most effective thing a consumer can do is buy one less pair of shoes per year, cutting their carbon footprint by a third,’ says McLoughlin. Related Story How the Green Runners are making the planet fitter Related Story Should European Athletics end Shell sponsorship? ","filter_flag":1}
{"title":"Elovena® considered one of the most responsible brands in Finland – our systematic responsibility work continues - Cision News","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL25ld3MuY2lzaW9uLmNvbS9yYWlzaW8tb3lqL3IvZWxvdmVuYS0tY29uc2lkZXJlZC1vbmUtb2YtdGhlLW1vc3QtcmVzcG9uc2libGUtYnJhbmRzLWluLWZpbmxhbmQtLS1vdXItc3lzdGVtYXRpYy1yZXNwb25zaWJpbGl0eS13byxjMzczNzg1N9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL25ld3MuY2lzaW9uLmNvbS9yYWlzaW8tb3lqL3IvZWxvdmVuYS0tY29uc2lkZXJlZC1vbmUtb2YtdGhlLW1vc3QtcmVzcG9uc2libGUtYnJhbmRzLWluLWZpbmxhbmQtLS1vdXItc3lzdGVtYXRpYy1yZXNwb25zaWJpbGl0eS13byxjMzczNzg1N9IBAA?oc=5","id":"CBMikgFodHRwczovL25ld3MuY2lzaW9uLmNvbS9yYWlzaW8tb3lqL3IvZWxvdmVuYS0tY29uc2lkZXJlZC1vbmUtb2YtdGhlLW1vc3QtcmVzcG9uc2libGUtYnJhbmRzLWluLWZpbmxhbmQtLS1vdXItc3lzdGVtYXRpYy1yZXNwb25zaWJpbGl0eS13byxjMzczNzg1N9IBAA","guidislink":false,"published":"Tue, 21 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=80, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL25ld3MuY2lzaW9uLmNvbS9yYWlzaW8tb3lqL3IvZWxvdmVuYS0tY29uc2lkZXJlZC1vbmUtb2YtdGhlLW1vc3QtcmVzcG9uc2libGUtYnJhbmRzLWluLWZpbmxhbmQtLS1vdXItc3lzdGVtYXRpYy1yZXNwb25zaWJpbGl0eS13byxjMzczNzg1N9IBAA?oc=5\" target=\"_blank\">Elovena® considered one of the most responsible brands in Finland – our systematic responsibility work continues<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cision News<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Elovena® considered one of the most responsible brands in Finland – our systematic responsibility work continues - Cision News","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL25ld3MuY2lzaW9uLmNvbS9yYWlzaW8tb3lqL3IvZWxvdmVuYS0tY29uc2lkZXJlZC1vbmUtb2YtdGhlLW1vc3QtcmVzcG9uc2libGUtYnJhbmRzLWluLWZpbmxhbmQtLS1vdXItc3lzdGVtYXRpYy1yZXNwb25zaWJpbGl0eS13byxjMzczNzg1N9IBAA?oc=5\" target=\"_blank\">Elovena® considered one of the most responsible brands in Finland – our systematic responsibility work continues<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Cision News<\/font>","source.href":"https:\/\/news.cision.com","source.title":"Cision News","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Elovena® considered one of the most responsible brands in Finland – our systematic responsibility work continues Tue, Mar 21, 2023 11:04 CET Report this content Press release 21 March 2022 Elovena® ranked in the top three in the newly released Sustainable Brand Index. Every year, the survey examines Finnish consumers’ perceptions of the responsibility of brands. Elovena® ranked third this year. At Raisio, responsibility is not only part of our strategy, it also reflects the way we do business. “At Raisio, responsibility and its impact starts with the strategy. It is reflected in everything we do. Successful responsibility work requires effort and cooperation both within Raisio and with partners,” says Sari Koivulehto-Mäkitalo, Raisio’s CLO, legal affairs and corporate responsibility. “Our goal is to ensure that our products are responsible, so that consumers do not need to worry about it themselves.” “We promote sustainability continuously, as an integral part of our everyday work. The key to systematic work is to have a well-thought-out approach to sustainability; clear policies, practices and objectives; and a constant dialogue within the company. With the changes in the world, responsibility work has become even more important than before. We are delighted that our work has also been noticed by consumers,” says Koivulehto-Mäkitalo. “We are constantly improving our operations to meet the perceptions and expectations of consumers.” The Sustainable Brand Index measures consumer perceptions. It does not assess the actual responsibility of brands. Recent key responsibility actions we have taken Plant-based products from a new factory: Our plant-based products factory, completed in 2021 in the Raisio industrial area that uses carbon-neutral energy, produces many new products that encourage plant-based eating that is good for the environment and people’s health. The raw material is Finnish, gluten-free oats. Environmentally friendly packaging: All packaging for Elovena® products is recyclable. Because we do not want to see plastic litter in the environment, especially on the seashore, we are among the first companies to produce drink packaging with caps that stay attached. The EU’s Single-use Plastics (SUP) Directive will require plastic caps to remain attached to the packaging in the future. This requirement for drink packaging will enter into force in July 2024, but we have already taken action on this important goal, ahead of schedule. In 2023, the wrapping of Elovena® snack biscuits will be replaced by a material suitable for cardboard recycling. The new packaging will reduce the amount of plastic we use. One of our key objectives is to encourage consumers to be responsible and recycle packaging. In addition to recycling labels, our products also include clear, written instructions on how to recycle the packaging. Carbon neutrality: We have worked systematically to make our production facilities carbon-neutral. The Raisionkaari industrial area has long run on carbon-neutral energy, and the Nokia mill has started to produce heating energy from its own oat side streams: whatever does not end up in the products is used in the mill’s own energy plant. Our goal is for the Kauhava factory to also become carbon-neutral by the end of this year. Biodiversity: We are involved in the Hiililounas project, which produces a knowledge base on the carbon footprint of domestic plant proteins and develops nutritionally balanced lunch options with a lower climate impact. In addition to the management of carbon emissions, the protection of biodiversity is important for the well-being of nature and a sustainable future. Scientific and reliable carbon footprint data is seen as a way to increase the use of local plant proteins in catering services and help consumers make responsible food choices. The main funder of the Hiililounas project is the ELY Centre of Southwest Finland, and Raisio is one of the participating companies. Contract farmers: We buy our grain directly from farmers. Our contract options also include an advance payment contract, introduced last year, with the aim of helping farmers at a time when many primary producers are facing a difficult situation due to a number of overlapping crises. Under an advance payment contract, the farmer receives an advance payment for the autumn harvest before sowing has even started. Health: Healthiness without compromising on taste is the basis of Elovena® products. The nutritional qualities of the products are so good that you can eat them without worrying. This is demonstrated by the Heart Symbol on the products, which indicates that they are healthy alternatives in their respective product categories. A comprehensive overview of our responsibility work can be found in our annual review, entitled Raisio’s Annual Review and Corporate Responsibility Report 2022, to be published on 22 March 2023. The report will be available on our website from 22 March 2023 onwards: www.raisio.com . Inquiries: Sari Koivulehto-Mäkitalo, chief legal officer, legal affairs and corporate responsibility, sari.koivulehto-makitalo(at)raisio.com, telephone +358 40 594 9512 RAISIO PLC At Raisio, we make food from the heart, with the aim of bringing health to ourselves and the Earth. We keep creating better plant-based and heart-healthy products so that eating healthily and within the Earth’s ecological capacity can be a pleasure. Our strong brands, such as Benecol®, Härkis® and Elovena®, turn our ambitions into reality. Through our responsibility work, we make the hard choices for consumers, so that they can choose Raisio products with confidence. We have around 350 healthy food colleagues in six countries and export to more than 40 markets around the world. Raisio's shares are listed on Nasdaq Helsinki Ltd. In 2022, the Group’s comparable net sales for continuing operations were approximately EUR 221 million and the comparable EBIT was approximately EUR 18 million. www.raisio.com","filter_flag":1}
{"title":"Unwrapping Eco-Labels: What Do They Really Mean? - U.S. News & World Report","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5","id":"CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA","guidislink":false,"published":"Thu, 02 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=61, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5\" target=\"_blank\">Unwrapping Eco-Labels: What Do They Really Mean?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. News & World Report<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Unwrapping Eco-Labels: What Do They Really Mean? - U.S. News & World Report","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vaGVhbHRoLnVzbmV3cy5jb20vaGVhbHRoLW5ld3MvYmxvZ3MvZWF0LXJ1bi9hcnRpY2xlcy91bndyYXBwaW5nLWVjby1sYWJlbHMtd2hhdC1kby10aGV5LXJlYWxseS1tZWFu0gEA?oc=5\" target=\"_blank\">Unwrapping Eco-Labels: What Do They Really Mean?<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">U.S. News & World Report<\/font>","source.href":"https:\/\/health.usnews.com","source.title":"U.S. News & World Report","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"You may be in the habit of checking the nutrition facts label on food products before putting them in your cart. Now, new eco-labels that signify the environmental impact of food are showing up on the front of packages and on restaurant menus. Getty Images It seems that carbon is the new calorie. Panera, Chipotle and Just Salad were the first restaurants to include carbon emissions on menu items. The labels estimate a food’s environmental impact as a carbon equivalent reflecting the greenhouse gas emissions or CO2 spent in the entire journey of a food product, from growing to transportation to cooking or production. This environmental impact is measured in grams or kilograms of carbon. Now there’s an entire movement to put climate change on the menu – from “climate positive” entrees to entire restaurants that are certified carbon-free. In the supermarket, foods and beverages are embellished with on-package seals that declare “carbon neutral” or “climate neutral.” Do Eco-Labels Matter? I’ll breakdown many of the label claim definitions, but let’s start with the question if these eco-labels can make a difference. Two recent studies suggest they do have the potential to nudge consumers to more climate-responsible food choices. One study conducted by researchers from Harvard and Johns Hopkins found that people may be less likely to choose red meat items from menus that were labeled “high climate impact.” The beef burger on the menu included the description: “This item is not environmentally sustainable. It has high greenhouse gas emissions and a high contribution to climate change.” Researchers at the University of Bristol in the U.K. found similar results in a study that used a traffic light system to rank eco-friendliness of menu items. The green traffic light symbol on a vegetarian burrito helped to significantly increase the likelihood that this more sustainable option was selected. Additionally, 90% of the study participants were supportive of eco-labels. Keep in mind, both of these studies were online experiments exposing people to hypothetical menu items instead of ordering at an actual restaurant. Yet the researchers believe the findings suggest eco-labels have the potential to make a positive impact in real-world settings. Seeking More Sustainable Choices Increasingly people are eager to make changes to their behaviors to benefit the planet. Over three-quarters (78%) agree they want to buy from companies that help them achieve a more sustainable and socially responsible life, according to GreenPrint’s Business of Sustainability Index. They’ll even pay more for sustainable products, yet 78% of those surveyed say that, despite their desire to support companies that align with their values, they don’t know how to identify environmentally friendly companies. Here’s where eco-labels could help. Over two-thirds (68%) use labels to determine if a product is environmentally friendly, with that number jumping to 78% for Generation Z and Millennial consumers. What Different Eco-Labels Mean Some of the so-called green and ethical labels have been around for years, such as USDA Organic, Non-GMO Project Verified, Fair Trade Certified, Rainforest Alliance Certified and Certified Humane Raised & Handled. Here’s a look at some of the newer eco-labels used in the food industry and what they mean. Carbon Neutral Certified Carbon neutral or carbon free does not mean a food produces zero emissions. It refers instead to a company compensating for all of the carbon or greenhouse gases emitted during its production and delivery. That’s where third-party organizations come in, such as Carbonfund. that helps companies calculate, reduce and offset their carbon footprint with projects that remove an equal amount of carbon from the atmosphere. Carbonfund’s Certified Carbonfree® products have \"net zero\" CO2 emissions, meaning brands measure and offset the carbon footprint of the products over their full lifecycle. This lifecycle focus is also called “cradle-to-grave,” which means the calculation includes the ingredient sourcing and packaging, product manufacturing, distribution, consumer use and eventual disposal. Carbon Trust is another organization offering carbon neutral certification for products. The group has certified over 27,000 individual product footprints, and many display the label in more than 40 countries. Climate Neutral Certified This label is certified by a nonprofit group called Climate Neutral that’s on a mission to make climate neutrality a priority for companies and individuals. Similar to Carbonfund, they work with companies to measure, reduce and offset greenhouse gas emissions with carbon credit investments that help to capture carbon – projects that include reforestation, mangrove rehabilitation, and landfill management. More than 300 brands have been certified by Climate Neutral, including Zero Carbon Coffee, Numi Organic Tea, and Bud Light Next. Regenerative Organic Certified Regenerative agriculture is often referred to as carbon farming because it restores soil biology, which pulls carbon out of the atmosphere. Regenerative organic agriculture is a collection of practices that focus on regenerating soil health and the entire farm ecosystem – from the animals to the workers. Developed by the nonprofit Regenerative Organic Alliance, this certification uses the USDA Certified Organic standard as a baseline and adds criteria for soil health, animal welfare and social fairness. The alliance was founded by the Rodale Institute, Dr. Bronner’s and Patagonia. Other members include Compassion in World Farming, Fair World Project and the Textile Exchange. Although “regenerative agriculture” has become a popular buzzword, the term is not fully defined and the claim is not regulated. Upcycled Certified Upcycled products are made with ingredients that would have otherwise been thrown out, such as the pulp created when fruits are turned into juice, the spent grain from the beer-making process or the cacao beans that are wasted when making chocolate. This new certification program was developed by the Upcycled Food Association, which has certified more than 200 food products and ingredients – representing 840 million pounds of food waste. One third of all food produced in the world ends up wasted, which accounts for 8% of global greenhouse gas emissions, according to the U.S. Environmental Protection Agency. The Upcycled Certification on-package mark signifies that a specified amount of upcycled ingredients were used. Upcycled certified products include ReGrained bread mixes, Pulp Pantry vegetable chips and Blue Stripes Urban Cacao chocolate bars and cacao water. Certified B Corporations While the Certified B Corporation label does not make any claim about a specific food, it does flag a company’s commitment to meet standards of social and environmental performance, accountability, and transparency on factors from supply chain practices and input materials to charitable giving and employee benefits. The certification is managed by B Lab, a nonprofit organization “transforming the global economy to benefit all people, communities and the planet.” The pledge serves as a legal framework for the company's corporate structure, which is intended to help balance profit with purpose. Carbon Confusion Eco-labels have exploded in recent years, totaling 456 globally, according to the Ecolabel Index, a directory of eco-labels across 25 industry categories including food. But not everyone agrees this is a positive trend. Matthew Hayek, an assistant professor in the department of environmental studies at New York University, believes the “climate neutral” or “climate positive” claims are confusing and misleading. Actually, these foods do not even exist, he says. The trouble is that these claims rely on carbon offsets – or those projects that are attempting to compensate for a product’s own emissions. While carbon offsets can play a role, it is important to ensure that offset projects are transparent, verifiable and result in real, permanent and additional emissions reductions, he says. Few of these labels give shoppers meaningful guidance in choosing environmentally superior products, he says. You may be tempted to choose an item with a “climate neutral” label because the item next to it does not make that claim. Yet, he says the non-labeled item could have a 10 times lower carbon footprint. “If you are feeling confused, there’s probably someone trying to confuse you,” Hayek says. What You Should Do So what should you do? Rather than relying on eco-labels, which may be providing an undeserved green halo, eat more plants and waste less food, Hayek says. Reducing meat and wasting none of it will go a long way in reducing your own personal carbon footprint at home. He also suggests paying attention to the label that really matters – the nutrition facts panel on the back of the package, which is federally-regulated, transparent and benefits from decades of hard science, all things that the current slate of climate labels lack.","filter_flag":1}
{"title":"Royale® tissue products are certified carbon neutral by the Carbon Trust - Canada NewsWire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcm95YWxlLXItdGlzc3VlLXByb2R1Y3RzLWFyZS1jZXJ0aWZpZWQtY2FyYm9uLW5ldXRyYWwtYnktdGhlLWNhcmJvbi10cnVzdC04OTkyNzI1ODQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcm95YWxlLXItdGlzc3VlLXByb2R1Y3RzLWFyZS1jZXJ0aWZpZWQtY2FyYm9uLW5ldXRyYWwtYnktdGhlLWNhcmJvbi10cnVzdC04OTkyNzI1ODQuaHRtbNIBAA?oc=5","id":"CBMifmh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcm95YWxlLXItdGlzc3VlLXByb2R1Y3RzLWFyZS1jZXJ0aWZpZWQtY2FyYm9uLW5ldXRyYWwtYnktdGhlLWNhcmJvbi10cnVzdC04OTkyNzI1ODQuaHRtbNIBAA","guidislink":false,"published":"Thu, 23 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=82, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcm95YWxlLXItdGlzc3VlLXByb2R1Y3RzLWFyZS1jZXJ0aWZpZWQtY2FyYm9uLW5ldXRyYWwtYnktdGhlLWNhcmJvbi10cnVzdC04OTkyNzI1ODQuaHRtbNIBAA?oc=5\" target=\"_blank\">Royale® tissue products are certified carbon neutral by the Carbon Trust<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Royale® tissue products are certified carbon neutral by the Carbon Trust - Canada NewsWire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifmh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNhL25ld3MtcmVsZWFzZXMvcm95YWxlLXItdGlzc3VlLXByb2R1Y3RzLWFyZS1jZXJ0aWZpZWQtY2FyYm9uLW5ldXRyYWwtYnktdGhlLWNhcmJvbi10cnVzdC04OTkyNzI1ODQuaHRtbNIBAA?oc=5\" target=\"_blank\">Royale® tissue products are certified carbon neutral by the Carbon Trust<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Canada NewsWire<\/font>","source.href":"https:\/\/www.newswire.ca","source.title":"Canada NewsWire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Royale, Canada's Most Trusted bathroom tissue brand†, has achieved carbon neutral certification from the Carbon Trust DIEPPE, NB, March 23, 2023 \/CNW\/ - Royale, one of Canada's leading household consumer brands, announced today that its tissue products have been certified carbon neutral by the Carbon Trust, a leading, global, and independent certification body specializing in the verification of carbon footprints. Royale® tissue products are certified carbon neutral by the Carbon Trust (CNW Group\/Irving Consumer Products Limited) Royale tissue products are manufactured by Irving Consumer Products Limited, an affiliate of J.D. Irving, Limited. J.D. Irving, Limited is recognized for responsible forest management and contributions to ecosystem research, habitat conservation and reforestation. J.D. Irving, Limited and its affiliates plant millions of trees annually, and collectively have planted more than 1 billion trees since 1957. In addition: Forests managed by J.D. Irving, Limited and its affiliates remove more carbon per year than is emitted in the life cycle of Royale tissue products manufactured in the year. Each year, J.D. Irving, Limited and its affiliates harvest less than 2% of the forest it manages, ensuring that the company grows more wood than it harvests annually. J.D. Irving, Limited and its affiliates integrated supply chain ensures the highest utilization of the forest resource, leaving little to waste - from lumber, chips, and bark to sawdust and wood shavings. The Carbon Trust has certified that Royale tissue products have achieved carbon neutrality on the total carbon footprint of tissue products sold in Canada from cradle-to-grave in accordance with the PAS 2060:2014 standard. This includes the carbon footprint of all scopes including input materials, production, distribution, use-phase, and end-of-life phase of the tissue products. \"The confirmation that Royale tissue products are carbon neutral is another step in a larger commitment to caring about the environment by Irving Consumer Products,\" said Robert K. Irving, President of Irving Consumer Products and Co-CEO of J.D. Irving, Limited. \"Households across Canada use Royale tissue products in their homes every day, so we're thrilled to be able to reward that choice with a carbon neutral product that brings unchanged premium quality, value and softness that Royale consumers expect.\" Through its 2030 public sustainability goals, Irving Consumer Products' tissue manufacturing operations has pledged to continue to deliver exceptional product and service experiences, while ensuring its products, including Royale tissue products, meet high standards for both quality and environmental impact. \"We believe that if we look after the forest, the forest will continue to look after all of us,\" said Stewart Van Horn, Corporate Vice President, Environment, Health, Safety and Operational Excellence at J.D. Irving, Limited. \"Our commitment is rooted in our core value to operate at the highest standards to ensure the protection of employees, the public and the environment. Ensuring Royale tissue products remain carbon neutral is one step in the fight against climate change and is part of our overall commitment to caring about the environment.\" †Voted most trusted bathroom tissue by Canadian shoppers based on the 2023 BrandSpark® Canadian Trust Study. *For more information about the Irving Forest Supply Chain, please refer to Irving's 2021 ESG Report, available at: jdirvingsustainability.com About Royale Royale products have been loved by Canadians for 60 years. It offers a full line of household paper products including bathroom tissue, paper towel, facial tissue, and napkins. Royale is made by a proud Canadian company. About Irving Consumer Products Irving Consumer Products is one of North America's leading manufacturers of household paper and baby diaper products. Irving Consumer Products companies include Irving Tissue and Irving Personal Care. Irving Tissue produces premium household store brand paper products for many of North America's top retailers, in addition to some of the top-selling tissue brands in the marketplace. Irving Personal Care is the only manufacturer of baby diapers and training pants in Canada. Using state-of-the-art equipment and technology, they produce premium quality private label products for major North American customers. About J.D. Irving, Limited Founded in 1882, J.D. Irving, Limited is a family-owned business with diverse operations including forest products, retail, transportation, shipbuilding, and consumer products. The company employs a team of over 19,000 people in Canada and the United States and is proudly headquartered in New Brunswick. About the Carbon Trust The Carbon Trust is a not-for-profit company with the mission to accelerate the move to a low carbon economy, providing specialist support to business and the public sector to help cut carbon emissions, save energy, and commercialize low carbon technologies. By stimulating low carbon action, they contribute to key goals of lower carbon emissions, the development of low carbon businesses, increased energy security, and associated jobs. They help to cut carbon emissions by providing specialist advice and finance to help organizations cut carbon, setting standards for carbon reduction, and reducing potential future carbon emissions by opening markets for low carbon technologies, leading industry collaborations to commercialize technologies, and investing in early-stage low carbon companies. SOURCE Irving Consumer Products Limited Marc Doucette, Vice President of Communications, J.D. Irving, Limited, ([email protected])","filter_flag":1}
{"title":"Discover the Top 10 Emission Reduction Technology Trends in 2023 - StartUs Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA","guidislink":false,"published":"Wed, 29 Mar 2023 21:10:01 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=29, tm_hour=21, tm_min=10, tm_sec=1, tm_wday=2, tm_yday=88, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5\" target=\"_blank\">Discover the Top 10 Emission Reduction Technology Trends in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Discover the Top 10 Emission Reduction Technology Trends in 2023 - StartUs Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LnN0YXJ0dXMtaW5zaWdodHMuY29tL2lubm92YXRvcnMtZ3VpZGUvZW1pc3Npb24tcmVkdWN0aW9uLXRlY2hub2xvZ3ktdHJlbmRzL9IBAA?oc=5\" target=\"_blank\">Discover the Top 10 Emission Reduction Technology Trends in 2023<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">StartUs Insights<\/font>","source.href":"https:\/\/www.startus-insights.com","source.title":"StartUs Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Climate change continues to dominate the global agenda, making large businesses reduce their carbon emissions and take a more proactive approach to emission management. This has led to a tech-driven approach that reduces the environmental impact of each product or service from the early stages of its development. At the same time, startups and scaleups develop technologies that reduce emission concentrations both at the source and in the atmosphere. These innovative technologies range from carbon offsetting and carbon capture technologies to bio-based solutions and emission monitoring. This data-driven research provides you with the top 10 global emission reduction technology trends in 2023 based on our research on 1680 startups and scaleups. Innovation Map outlines the Top 10 Emission Reduction Technology Trends & 20 Promising Startups For this in-depth research on the Top Emission Reduction Technology Trends & Startups, we analyzed a sample of 1680 global startups & scaleups. This data-driven research provides innovation intelligence that helps you improve strategic decision-making by giving you an overview of emerging technologies in the cleantech industry. In the Emission Reduction Technology Innovation Map, you get a comprehensive overview of the innovation trends & startups that impact your company. These insights are derived by working with our Big Data & Artificial Intelligence-powered StartUs Insights Discovery Platform, covering 3 790 000+ startups & scaleups globally. As the world’s largest resource for data on emerging companies, the SaaS platform enables you to identify relevant technologies and industry trends quickly & exhaustively. Tree Map reveals the Impact of the Top 10 Emission Reduction Technology Trends Based on the Emission Reduction Technology Innovation Map, the Tree Map below illustrates the impact of the Top 10 Emission Reduction Technology Trends in 2023. Startups and scaleups are developing solutions that utilize artificial intelligence (AI), big data, and the internet of things (IoT). Such solutions monitor and analyze emission data and offer insights into abatement strategies. Advances in electrification, green hydrogen, and bio-based fuels and polymers aid the transition from fossil fuel-based energy sources to low or zero-carbon alternatives. Further, startups develop carbon capture, utilization, and storage (CCUS) technologies as well as waste valorization solutions. They reduce the emission concentrations both in the atmosphere and at the source. Additionally, energy-efficient integrations reduce the use of energy, improving emission reduction. Top 10 Emission Reduction Technology Trends in 2023 Global Startup Heat Map covers 1680 Emission Reduction Technology Startups & Scaleups The Global Startup Heat Map below highlights the global distribution of the 1680 exemplary startups & scaleups that we analyzed for this research. Created through the StartUs Insights Discovery Platform, the Heat Map reveals high startup activity in the UK and the US, followed by the rest of Western Europe. Below, you get to meet 20 out of these 1680 promising startups & scaleups as well as the solutions they develop. These emission reduction technology startups are hand-picked based on criteria such as founding year, location, funding raised, & more. Depending on your specific needs, your top picks might look entirely different. Interested to explore all 1600+ emission reduction technology startups? Book Demo Top 10 Emission Reduction Technology Trends 1. Carbon Offsetting Carbon offsetting allows net-positive emitters to neutralize their greenhouse gas (GHG) emissions by trading negative carbon credits. The purchase of offset tokens facilitates the funding of initiatives that reduce carbon emissions, such as reforestation projects. Carbon-negative projects include technologies that capture GHG at industrial sites, improve soil management, and leverage energy-efficient integrations. This allows individuals, organizations, and governments to compensate for their polluting activities and mitigate them through the use of carbon credits. Further, cloud and blockchain-based bookkeeping improves the transparency of carbon credit records and makes them fully traceable. By offsetting emissions, individuals and organizations support projects that reduce or remove emissions from the atmosphere, mitigating the impact of climate change. Abatable simplifies Carbon Intelligence & Procurement UK-based startup Abatable offers a carbon intelligence and procurement platform. It aids the purchase of high-quality offsets for hard-to-abate emissions and maximizes the social impact of climate contributions. The platform provides insights into carbon projects and project developers by evaluating the fundamental factors contributing to the quality of carbon credits. Abatable continuously monitors every project to mitigate risks stemming from infrastructure, systems, and policies, ensuring the committed quality of carbon credits for organizations. Tanso offers Automated Carbon Accounting German startup Tanso automates carbon accounting and offers analytical solutions for effective emission reduction. The startup’s software simplifies data collection and emissions calculation through process automation, Excel\/CSV uploads, application programming interface (API), and a single-source-of-truth approach. Tanso’s single-source-of-truth approach and automated processes provide organizations with their carbon footprint and set clear reduction goals. This allows the planning of decarbonization initiatives, like carbon offsetting and benchmarking, against science-based target standards. 2. Artificial Intelligence AI allows organizations to collect and derive insights from massive amounts of data and identify patterns that humans fail or take time to recognize. Deeper insights into carbon emissions provide organizations with higher agility to adopt processes that cut down GHG emissions. This accelerates sustainable transformation and reduces expenses in a period of lower cash flow. AI-powered solutions also analyze the environmental impact of emissions and provide forecasts on storms, wildfires, and droughts, which enables better mitigation plans. Finally, AI aids the optimization of technologies related to carbon capture and renewable energy that improves efficiency and reduces emissions. AI Shading ensures Low Building Carbon Footprint AI Shading is a Canadian smart and green technology startup developing economical solutions that allow commercial buildings to achieve emission reduction targets. The startup’s solution also accomplishes this by regulating indoor temperatures through smart indoor shades, sensors, mobile apps, and energy management platforms. AI Shading equips building managers with energy-saving reports to better analyze energy usage and track emission reduction goals. GAIA provides Automated Emission Tracking Dutch startup GAIA leverages AI to simplify and automate GHG emissions reduction for businesses. The startup’s solution measures and tracks emissions by analyzing the data from the input of choice – manual, linked, or integrated. The AI algorithm utilizes the raw data to extrapolate measurements and approximate any missing data. This way, GAIA’s solution pinpoints main emission sources as well as customizes optimization roadmaps and emission reduction priorities. 3. Electrification Electrification aids in emission reduction by replacing traditional fossil fuel-powered energy sources with clean, electric energy sources such as wind and solar power. This emission reduction technology trend finds application in multiple industries such as transportation, building, manufacturing, mining, and more. Besides the lower carbon intensity of clean electricity, energy efficiency is a key benefit of electrification as electric equipment is more efficient than its fossil-powered alternatives. Additionally, electrification enables demand flexibility to provide a cost-effective mechanism to share the available energy. Thus, the widespread adoption of electrification across various industries significantly reduces global emissions. Zevx accelerates Fleet Electrification US-based startup Zevx develops battery electric power systems and data intelligence for e-mobility applications. The startup’s powertrains and power system products accelerate the electrification of commercial fleet assets. Zevx’s data intelligence services further improve operational efficiency and enhance the control framework for power usage. The solution, in this way, provides an integrated platform that allows fleet owners to decarbonize all operational components. Leaf Energy allows Seamless Energy Transition US-based startup Leaf Energy offers electrification solutions like electric vehicles (EVs) and charging stations. The startup’s technology provides high-speed charging through its proprietary terminal designs that are compatible with existing grid networks. Leaf Energy also provides a platform that enables real-time environmental tracking, which allows businesses to measure progress at every step of the energy transition. 4. Green Hydrogen Hydrogen fuel produced through the use of renewable energy in the electrolysis process emits no greenhouse gases and generates only water as a byproduct. The high calorific value and chemical properties of hydrogen offer utility across various industries, including transportation, heating, and industrial processes. In the transportation sector, green hydrogen fuel cells power vehicles, reducing emissions. It also serves as a key ingredient in the production of low-carbon chemicals and fuels, further decreasing emissions in these industries. As a clean energy source, green hydrogen reduces emissions and combats the effects of climate change. Azolla generates Fuel-cell Spec Green Hydrogen Canadian startup Azolla offers green hydrogen solutions for the power and transportation industries. The startup’s Biodrome technology utilizes a blend of bio-methanol and de-ionized water to generate fuel-cell spec hydrogen. The catalytic reformation of Azolla’s bio-methanol\/water blend produces low-carbon hydrogen production on-site. This enables the use of methanol as a hydrogen carrier, which is easier to transport, store, and handle than high-pressure hydrogen or ammonia. Faraday Fuels offers Solid Oxide Electrolyzers US-based cleantech startup Faraday Fuels develops a scalable, high-throughput solid oxide technology to make green hydrogen. The startup’s solid oxide electrolyzers feature tubular design and proprietary electrodes to ensure efficient and low-cost production of clean hydrogen. This hydrogen serves as fuel to facilitate deep decarbonization of emission-intensive industries like steel, chemical, and aviation. 5. Carbon Capture, Utilization, & Storage CCUS technologies capture carbon dioxide emissions and use them to make things or permanently store them thousands of feet below the surface. Startups utilize a range of technologies, some using membranes and others using solvents, to capture CO2. The captured carbon dioxide is then concentrated either chemically or in biological processes, which further serves as a feedstock or is simply stored underground. By preventing the CO2 from industrial operations from reaching the atmosphere, CCUS stabilizes CO2 levels. This provides carbon-neutral feedstock alternatives to industries like oil and gas, aviation, construction, and chemical. CO2 storage solutions, on the other hand, facilitate the use of depleted oil or gas fields or saline formations. Algiecel advances Algal-based Carbon Capture UK-based startup Algiecel develops modular photobioreactors that convert CO2 emissions and LED light into microalgae biomass and oxygen. The startup’s compact mobile microalgae photobioreactors and downstream units fit into standard shipping containers. This enables the transformation of industrial CO2 emissions into biomass rich in food-grade omega-3, proteins, vitamins, and carotenoids. The carbon capture solution in this way allows industrial plants to reduce their carbon emissions and enable a new revenue stream. Aqualung achieves Absorbant-free Carbon Capture Norwegian startup Aqualung develops an absorbent-free and highly compact membrane separation technology for carbon capture. The startup’s system utilizes less energy than conventional membranes by eliminating the regeneration energy associated with absorbents. It also avoids toxic additives or absorbents to lower operational risks and maintenance costs. Aqualung’s modular technology enables the deployment of carbon capture systems even for environments with low CO2 concentrations. 6. Energy-Efficient Integrations Industrial excess energy is a largely untapped resource, for which there is potential for reuse as well as benefits industries and society. The utilization of excess energy in the form of heat, power, and fuel provides a way to reduce the use of primary energy. This contributes to the mitigation of CO2 emissions. The most common recovery solutions reuse discarded heat in secondary processes on site or use it to preheat incoming water and combustion air. Other power recovery solutions include the reclamation of pressure energy from processes operating at elevated pressures using even small pressure differences to produce electricity through pressure recovery turbines. In addition to solutions that recover wasted energy, innovations in materials and processes avoid energy wastage and cut down on the associated emissions. Sapphire Technologies simplifies Excess Pressure Energy Recovery US-based startup Sapphire Technologies creates energy recovery systems that harness the power of expanding gas to produce reliable and clean electricity. The startup’s FreeSpin In-line Turboexpander Generator specifically converts energy wasted in pressure reduction processes into electric power without interrupting operations. Sapphire Technologies’ solution caters to hydrogen and natural gas industrial applications. It maximizes efficiencies, improves productivity, reduces carbon emissions, offsets electrical costs, and achieves financial returns. HT Materials Science facilitates Efficient Heat Transfer Irish startup HT Material Science offers smart heat transfer fluids for commercial and industrial heating and cooling systems. The startup’s patented nanofluid additive, Maxwell, is a drop-in solution that enhances the heat transfer of a base refrigerant, improving the efficiency of HVAC systems. This reduces energy consumption and facilitates a proportional reduction in carbon emissions. The higher heat transfer rate enables the adoption of smaller, less costly, and more efficient equipment that further adds to operational sustainability. 7. Big Data Big data allows businesses to identify areas of excessive energy consumption and carbon emissions, providing valuable information for efficient energy use energy and actions to curb emissions. Such solutions collate information from emission sensors and smart energy devices dotted across cities and facilities as well as historical operational data. Energy utilization data analysis allows businesses to identify patterns in energy use and improve energy efficiency. Big data solutions also aid supply chain optimization by analyzing transportation routes, inventory levels, and delivery times, reducing the distance traveled by goods and the resulting carbon footprint. Finally, by analyzing data on energy production and consumption, companies identify the best times to use renewable energy. This allows them to reduce reliance on non-renewable sources and, in turn, decrease their carbon footprint. Grid Matrix aids Transport Emission Reduction US-based startup Grid Matrix offers software that leverages existing traffic infrastructure to reduce congestion, emissions, and accidents. The startup’s cloud-based platform combines data from existing sensors and online sources to employ big data and analytics. It then provides real-time insights based on the collected data, facilitating the optimization of mobility services. This accelerates the transportation goals of cities and allows them to transition into safer, greener, and more efficient places to live and work. Consequently, this results in the elimination of congestion and greenhouse gas emissions. CarbonSense simplifies Carbon Footprint Management Chinese startup CarbonSense makes a software solution that allows businesses to achieve carbon neutrality. The startup’s green management system collects energy data from smart meters, water meters, gas sensors, temperature sensors, and equipment PLC as well as analyzes them through big data algorithms. The resultant insights include visualization of energy consumption, multi-dimensional energy consumption analysis, equipment efficiency analysis, and early warnings on equipment abnormalities. These insights enable intelligence decisions that minimize energy consumption and accelerate the adoption of renewable sources. 8. Waste Valorization Waste valorization converts waste materials into useful products, upcycling end-of-life products and reducing carbon emissions. By diverting waste from landfills, it reduces methane emissions, which is a potent greenhouse gas that contributes significantly to climate change. Waste valorization also generates low-carbon energy in the form of biogas or biochar, which replaces fossil fuels and reduces GHG emissions associated with energy production. Recycling waste materials into new products further reduce the need for new materials and lower greenhouse gas emissions. Lastly, some waste valorization processes capture and utilize carbon dioxide emissions, mitigating their environmental impacts and advancing a circular carbon economy. Alimentary advances Domestic Waste Valorization New Zealand-based startup Alimentary designs and builds an integrated waste treatment plant (IWTP) that accepts all forms of organic waste. The startup’s patented waste treatment process combines biomimicry and anaerobic co-digestion, which is configurable to the local waste sources, to reduce waste disposal costs. It reduces all atmospheric greenhouse gas emissions related to household waste and wastewater treatment processes. In addition, the high-value biogas byproduct offsets costs by generating revenue. Pyro-degrade facilitates Plastic Waste to Fuel Conversion Kenyan startup Pyro-degrade develops a pyrolysis technology that converts plastic waste into fuel. Pyro-diesel is the startup’s fuel that serves as an environmentally friendly diesel substitute, which is free of sulfur and has a low carbon footprint. Moreover, the startup’s process is self-sufficient, enabling it to run off the grid with the fuel it produces. This technology avoids the open burning of plastic waste and provides a low-carbon diesel substitute for agricultural and other domestic applications. 9. Bio-based Fuels & Polymers Bio-based solutions enable emission reduction by providing sustainable alternative energy sources and materials. Biofuels, such as bioethanol and biodiesel, are made from renewable plant-based materials and reduce the need for fossil fuels, resulting in fewer emissions. Biopolymers, such as biodegradable plastics, are sourced from natural fibers and resins that replace traditional petroleum-based plastics. Additionally, the production of biofuels and biopolymers often utilizes waste materials and by-products, reducing waste and emissions associated with waste management. By providing sustainable alternative energy sources and materials, biofuels, and biopolymers help to reduce emissions and contribute to a more sustainable future. SeaH4 produces Carbon-Neutral Fuels South African cleantech startup SeaH4 offers solutions that enable the profitable production of sustainable biodiesel and liquefied natural gas (LNG) from algae. The startup utilizes base technologies involving land-based algae farming, biogas production, gas processing, and gas-to-liquid conversion. SeeH4’s system is fully circular, minimizing operational expenditure and increasing yield. The final fuel product enables the CO2-neutral operation of combustion engines, accelerating the transition away from fossil fuels. Dionymer offers Petrochemical Plastic Alternatives French startup Dionymer develops material technology that upcycles industrial organic waste. The startup’s proprietary fermentation technology incorporates a biomimetic process that transforms organic waste into biodegradable polymer material polyhydroxyalkanoates (PHA). These polymer materials serve as low-carbon alternatives for petrochemical plastics. In addition to reducing carbon emissions, the technology provides a recovery path for bio-waste across industries like agriculture and pharmaceuticals. 10. Emission Monitoring Emission monitoring and management reduce emissions by enabling organizations to accurately measure and track their emissions and identify opportunities for reduction. Monitoring systems detect emissions from various sources and provide real-time data on emissions levels. Management systems then analyze and interpret this data, allowing organizations to identify improvement areas and implement emission reduction strategies. By regularly monitoring and managing emissions, organizations ensure their emissions are within legal limits, reduce their environmental impact, and improve their sustainability. Moreover, organizations now leverage a comprehensive and systematic approach to emission reduction, monitoring, and management. This helps them to achieve emission reduction goals and ensure carbon-neutral operations. GAIT delivers Greenhouse Gas Measurement Singaporean startup GAIT offers climate tech solutions that facilitate the deployment of GHG measurement systems. The startup’s technology combines machine learning, flux sensors, and spatial data to deliver real-time measurements of greenhouse gas emissions. Additionally, it accesses historical flux data to provide more accurate models that measure the effectiveness of climate action projects. The solution also provides recommendations on actions required to further reduce emissions and achieve the set air quality targets. Blue Sky advances Fugitive Methane Emission Detection Blue Sky is a US-based startup that develops an infrared optical sensor technology for the continuous detection and measurement of fugitive methane emissions. NIRview is the startup’s emission monitoring solution that employs a spectroscopy-based approach to automatically scan a user-defined grid and provide a detailed 2D concentration map. The solution in this way offers oilfields a cost-effective detection technology that pinpoints the location of leaks, facilitating quick repairs and substantially reducing emissions. Discover all Emission Reduction Technology Trends, Technologies & Startups Advances in emissions reduction technologies continue to advance as the demand for a net zero existence becomes critical. Carbon offsetting serves as a crucial method in ensuring the financial sustainability of carbon reduction projects and initiatives. Innovations in emission monitoring and reporting through the integration of technologies, like blockchain and IoT, ensure transparency across supply chains. This facilitates close monitoring of emission reduction efforts and allows businesses to properly channel resources for achieving emission goals. The Emission Reduction Technology Trends & Startups outlined in this report only scratch the surface of trends that we identified during our data-driven innovation & startup scouting process. Identifying new opportunities & emerging technologies to implement into your business goes a long way in gaining a competitive advantage.","filter_flag":1}
{"title":"The Drop List: New Releases From Cold Picnic, Boy Smells x Kin, Gelato Pique x Eames, and More - Architectural Digest","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyYWxkaWdlc3QuY29tL3N0b3J5L3Nob3AtbmV3LXJlbGVhc2VzLWNvbGQtcGljbmljLWJveS1zbWVsbHMta2luLWdlbGF0by1waXF1ZS1lYW1lcy0yMDIz0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyYWxkaWdlc3QuY29tL3N0b3J5L3Nob3AtbmV3LXJlbGVhc2VzLWNvbGQtcGljbmljLWJveS1zbWVsbHMta2luLWdlbGF0by1waXF1ZS1lYW1lcy0yMDIz0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyYWxkaWdlc3QuY29tL3N0b3J5L3Nob3AtbmV3LXJlbGVhc2VzLWNvbGQtcGljbmljLWJveS1zbWVsbHMta2luLWdlbGF0by1waXF1ZS1lYW1lcy0yMDIz0gEA","guidislink":false,"published":"Fri, 31 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=31, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=90, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyYWxkaWdlc3QuY29tL3N0b3J5L3Nob3AtbmV3LXJlbGVhc2VzLWNvbGQtcGljbmljLWJveS1zbWVsbHMta2luLWdlbGF0by1waXF1ZS1lYW1lcy0yMDIz0gEA?oc=5\" target=\"_blank\">The Drop List: New Releases From Cold Picnic, Boy Smells x Kin, Gelato Pique x Eames, and More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architectural Digest<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The Drop List: New Releases From Cold Picnic, Boy Smells x Kin, Gelato Pique x Eames, and More - Architectural Digest","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LmFyY2hpdGVjdHVyYWxkaWdlc3QuY29tL3N0b3J5L3Nob3AtbmV3LXJlbGVhc2VzLWNvbGQtcGljbmljLWJveS1zbWVsbHMta2luLWdlbGF0by1waXF1ZS1lYW1lcy0yMDIz0gEA?oc=5\" target=\"_blank\">The Drop List: New Releases From Cold Picnic, Boy Smells x Kin, Gelato Pique x Eames, and More<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Architectural Digest<\/font>","source.href":"https:\/\/www.architecturaldigest.com","source.title":"Architectural Digest","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Welcome to another edition of The Drop List, where we, self-proclaimed shopping obsessives, give you the lowdown on the most highly anticipated new releases and intriguing launches of the past few weeks. We hope you’ll think of this as a one-stop shop to discover your new favorite brand, an emerging designer, or a fun collaboration straight out of the gate. (And, if you’re craving even more Clever content, don’t forget to sign up for our newsletter.) March 1, 2023 — Bokksu, the online grocer and a favorite of senior commerce editor Rachel Fletcher, is here to add some charm to your snack time. In celebration of Sakura Season, the brand recently launched a very kawaii snack box in partnership with Hello Kitty and Friends. Inside each bundle you’ll find sweet and savory goodies, including shrimp chips, biscuits, hard candies, and even a ceramic cup set that's perfect for tea time. Hello Kitty and Friends + Bokksu Box $55 Bokksu March 1, 2023 — We think you deserve a treat for braving the winter months. Our recommendation? The newest flavor from Alec’s Ice Cream, a salty and sweet blend of peanut butter, chocolate-covered honeycomb toffee, and fudge swirls. Plus, all of the frozen delights from Alec’s are made using A2 Diary and carbon-neutral regenerative cane sugar—meaning they're easier on the gut for those with diary sensitivities. March 1, 2023 — Aesop’s newest offering is designed to transform the energy in your space through a fragrant blend of wood and spice. With this incense set, you’ll be treated to fresh, woody resins of hinoki and warm aromas of of cinnamon and clove to liven up the mood. Priced at under $50, we think this might even make a lovely housewarming gift for someone who’s just finished a recent move. Aēsop Murasaki Aromatique Incense $43 Aēsop March 7, 2023 — Wellness brand Sidia announced its newest scent offering this week, just in time for spring. Stored in a hazy lavender and moss green ombré vessel, and affectionately labeled “Soaked,” this fragrant mix of grapefruit, spearmint, thyme, juniper, and more is designed to emulate “the meditative magic of morning times,” as well as a reminder to us that “new discoveries are always unfolding.\" March 7, 2023 — Early in March, the brand behind the Insta-famous Always Pan released a cast-iron version of its Perfect Pot, designed to replace eight pieces of traditional cookware—including your stock pot, dutch oven, sauce pot, roasting rack, steamer, colander, braiser, and spoon rest. And if you need more persuading, you’ll remember we said its sibling, the cast-iron Always Pan, “works as well as it looks.” March 14, 2023 — Cold Picnic released new bath mats this month, and the delightfully abstract designs are bursting with personality. Handmade in India from 100% organic cotton and featuring nonslip backing, each bath mat feels and looks like a unique piece of art. In fact, if you can't bring yourself to use it as intended, we think it’s worthy enough for a spot on your gallery wall as an unexpected art piece. March 15, 2023 — Cool-kid genderless fragrance brand Dedcool launched new lotions and washes in three of their best-selling scents this month. It’s perfect for anyone who’s looking to touch up their fragrance while on the go, and we think you’ll want to grab one (or a few!) to experience your signature scent (Taunt, Milk, or Red Dakota) in a fun new way. DedCool Hand + Body Lotion 01 \"Taunt\" $30 DedCool March 16, 2023 — H&M Home launched a second installment of their For the Love of Art collaborations in March, featuring the visions of two different female creatives this time: South African artist Lulama Wolf and American artist, poet, and author Amber Vittoria. We’ve got our eye on the lovely tufted items in the collection—like this neutral rug that’s under $500 and even has matching throw pillows you can purchase too. H&M Home x For The Love of Art Tufted Wool Rug $449 H&M Home March 16, 2023 – A friendly-looking frog candle from Redoux and Collina Strada is possibly the most charming way to add some color to your interiors for the new season. While you may be hesitant to burn it, just know that the hand-poured wax amphibian diffuses calming notes of sandalwood, orange blossom, ginger, amber, and saffron into your space. Collina Strada x Redoux Large Green Frog Candle $150 Collina Strada March 17, 2023 — This delicate milk jug with a tongue-in-check illustration by artist Nick Cave will be a quirky addition to tea time or your morning coffee fix. To accompany the capsule, there’s also an installation on display in London’s Dover Street Market that features personal touches referencing Nick and his wife Susie’s home. There you’ll also find other pieces from the collection—including T-shirts, hats, and some jovial porcelains. Cave Things Up Jumped The Devil Milk Jug $44 Cave Things March 21, 2023 — Herman Miller's newly rereleased Alexander Girard Originals prints are just the thing we want for our next art refresh. Reproducing new iterations from the designer’s original screen prints, these modern artworks maintain the essence and integrity of their predecessors, while offering a new age twist. We like this interesting circular repetition in an eye-catching shade of red for just about any room in your space. Herman Miller Girard Circle Sections $230 Herman Miller March 22, 2023 — Obsessed with Nate Berkus and Jeremiah Brent’s home? We certainly are—which is why the items from the recent collab between Nate and home decor brand mDesign are high up on our spring wish list. Featuring a thoughtfully designed collection of bedding, bath, and organization items, we think the collection has just what you need to bring some understated elegance into your home, the Nate way. mDesign Printed Shapes Quilt Set $120 mDesign March 22, 2023 — Smelling fresh as a daisy this spring is easy with the newest detergents from one of our bedding go-tos, Brooklinen. The home brand already makes some of our favorite sheets, comforters, and pillows (Sleep Week recap here), making it only natural that we plan on integrating the detergents (fragrance-free, dream clean, and herbal clean) into our wash days ASAP. March 22, 2023 — The second collection from Kvadrat and Raf Simons is filled with luxurious soft goods to majorly upgrade your wellness routines. Perfect for the jet-setter who's always on-the-go or the chic homebody, anyone can appreciate the line's range of towels, toiletry holders, slippers, and this logo-embossed bathrobe that's available in black, white, hunter green, and pastel pink. March 23, 2023 — Next up on our list of new releases is this collab from USM and Chicago-based mixed media artist Noel Mercado. Entitled One And The Same, the collection is an exploration of “the relationship between process and function and the difference between handmade and machine-made,” as well as an embodiment of Noel’s philosophy that anything can be a canvas. Spanning over 40 handmade items, we have our eye on the limited-edition wearables from the collab—or maybe even this charming newsstand that's perfect for housing your favorite mag. USM X Noel Mercado Newsstand $650 Noel Mercado March 24, 2023 — Boy Smells and Kin are helping you achieve total zen with their newest collaboration. Featuring three limited-edition Boy Smells scents inspired by Kin Euphorics’ lineup of adaptogen-filled drinks (happiness-triggering Turn On, energizing Restart, and calming Dropout), these pairings feature “innovative patented scent technology,” specially designed to illuminate your neural pathways and enhance your mood. Boy Smells x Kin Euphorics Emotional Illuminations Full Spectrum Bundle $200 Boy Smells March 24, 2023 — Japanese loungewear brand Gelato Pique released a third and final collaboration with Eames in March to keep you extra cozy for the remaining chilly weather. There’s lots of printed tees, fuzzy hoodies, and even coordinating sets for design aficionados to peruse through, though we like the thought of cozying up at night with this rainbow-checkered throw blanket and a good show or book. Gelato Pique Eames Air Moco Check-patterned Blanket $113 Gelato Pique March 27, 2023 — This colorfully dyed Kopak mattress from Goodee’s recent team-up with design brand Tensira is the statement piece your home has been looking for. With the shared goal of creating thoughtfully made offerings for sustainable homes, this natural partnership combines playful checks and stripes made by Tensira’s tie-dye experts, including the brand’s first-ever tricolor tie-dye, exclusive to Goodee. GOODEE x Tensira Kapok Mattress Rectangular $225 GOODEE March 28, 2023 — Lucky for us, there was lots of newness to shop at J.Crew last month. In addition to launching new bed and table linens in adorable Liberty prints, the brand teamed up with Clever crush Olivia Cheng and her NYC-based brand Dauphinette on an exclusive array of eye-catching patterned apparel that’s perfect for beach and pool season. Dauphinette X J.Crew Cropped Shirt in Red Blooms $80 J.Crew March 29, 2023 — Clever-approved design expert Athena Calderone launched two new incense fragrances with Cinnamon Projects, and they're both swoon-worthy, to say the least. Elegantly formulated to diffuse scents of iris and saffron or bergamot and eucalyptus, you'll definitely want to pair either with a minimally designed burner for the full, calming effect. Eyeswoon x Cinnamon Projects Saturnine Incense $40 Eyeswoon March 29, 2023 — If spring is calling for a total decor makeover, Leanne Ford’s Crate & Barrel collection is full of enviable pick-ups for both your indoor and outdoor spaces. Though there’s lots of furniture we’re adding to our virtual cart (like this versatile concrete side table), this dinnerware (available in a full set) is an affordable way to shake up your kitchen in a small but meaningful way.","filter_flag":1}
{"title":"Haeckels Launches Experimental \"Lab\" Collection - HYPEBEAST","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzMvaGFlY2tlbHMtbGFicy1leHBlcmltZW50YWwtc2tpbmNhcmXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzMvaGFlY2tlbHMtbGFicy1leHBlcmltZW50YWwtc2tpbmNhcmXSAQA?oc=5","id":"CBMiQGh0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzMvaGFlY2tlbHMtbGFicy1leHBlcmltZW50YWwtc2tpbmNhcmXSAQA","guidislink":false,"published":"Wed, 08 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=8, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=67, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzMvaGFlY2tlbHMtbGFicy1leHBlcmltZW50YWwtc2tpbmNhcmXSAQA?oc=5\" target=\"_blank\">Haeckels Launches Experimental \"Lab\" Collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HYPEBEAST<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Haeckels Launches Experimental \"Lab\" Collection - HYPEBEAST","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQGh0dHBzOi8vaHlwZWJlYXN0LmNvbS8yMDIzLzMvaGFlY2tlbHMtbGFicy1leHBlcmltZW50YWwtc2tpbmNhcmXSAQA?oc=5\" target=\"_blank\">Haeckels Launches Experimental \"Lab\" Collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">HYPEBEAST<\/font>","source.href":"https:\/\/hypebeast.com","source.title":"HYPEBEAST","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Haeckels has launched three new products as part of the new “Haeckels Lab” range, which sees the brand build on its mission to provide sustainable yet effective skincare by exploring lab-grown ingredients. Since its foundation in 2012, Margate-based Haeckels has become the skincare industry’s small-but-mighty disruptor when it comes to carbon-neutral efforts. Now, the team takes its next steps into reducing emissions – and is doing so by exploring ingredients that have been cultivated in-house, and made from renewable sources. Initially, the collection will include cleansing milk, toner, and serum, with subsequent additions to be launched through a “test then drop” method. “Put simply, the carbon emissions in growing, processing, shipping, and manufacturing natural ingredients far outweigh their benefits,” the brand says. “Moreover, natural woods and trees are felled to create land to facilitate the growth of these ingredients, while water is refunneled and directed to this land.” The first pieces to be launched were sent out to a select customer base back in November 2022, with the response – according to the team – “exceeding predicted metrics”. By testing the products before launching them to market, the brand hopes to be able to work at an even more disruptive and innovative rate – allowing them to test products without the need for long production runs and bespoke packaging. The new trio has been developed around a proprietary ingredient named Spiraglow. Microbiologically optimized, the ingredient has been shown in clinical trials to reduce fine lines and wrinkles by up to 22 per cent, alongside improving overall elasticity. “Like lab-grown vegan meats, these products are engineered as nature-identical – they come from renewable ingredients that are far less resource intensive than their natural counterparts,” the brand continues. “The aim of this new arm of the business is to offer effective solutions in sustainability through lab-grown innovation.” Each of the new Haeckels Labs products is available now. The Spiraglow Hydrating Toner is priced at £42 GBP (approximately $49 USD), the Spiraglow Cleansing Milk at £48 GBP ($57 USD), and the Spiraglow EGF Serum at £72.00 ($87 USD). Take a closer look above, and for more UK brand news – check out the new collaboration between Drake’s and London restaurant St. JOHN.","filter_flag":1}
{"title":"10 Sustainable British Beauty Brands To Discover Now - Country and Town House","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA","guidislink":false,"published":"Mon, 13 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=72, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5\" target=\"_blank\">10 Sustainable British Beauty Brands To Discover Now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Country and Town House<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"10 Sustainable British Beauty Brands To Discover Now - Country and Town House","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNvdW50cnlhbmR0b3duaG91c2UuY29tL3N0eWxlL2hlYWx0aC1hbmQtYmVhdXR5L3N1c3RhaW5hYmxlLWJyaXRpc2gtYmVhdXR5LWJyYW5kcy_SAQA?oc=5\" target=\"_blank\">10 Sustainable British Beauty Brands To Discover Now<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Country and Town House<\/font>","source.href":"https:\/\/www.countryandtownhouse.com","source.title":"Country and Town House","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"It’s estimated that the global cosmetics industry produces 120 billion units of packaging each year – most of which are not recyclable. It’s also an alarming contributor to the climate crisis (a study showed that 70 percent of CO2 emissions from the beauty industry could be reduced by just using reusable bottles) and has a history of unfair practices that have only been rectified in recent years. Thankfully, there are a number of brands speaking out against harmful practices and setting an example with carbon neutral manufacturing, plastic-free packaging and community-focused social action. Want to know who to have on your radar? These are the sustainable British beauty brands making a difference. The Country & Town House Responsible Buyers’ Guide","filter_flag":1}
{"title":"Porsche reports record 2022 earnings, updated EV pipeline includes entirely new SUV model - Electrek","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWxlY3RyZWsuY28vMjAyMy8wMy8xMy9wb3JzY2hlLXJlcG9ydHMtcmVjb3JkLTIwMjItZWFybmluZ3MtdXBkYXRlZC1ldi1waXBlbGluZS1uZXctc3V2LW1vZGVsL9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWxlY3RyZWsuY28vMjAyMy8wMy8xMy9wb3JzY2hlLXJlcG9ydHMtcmVjb3JkLTIwMjItZWFybmluZ3MtdXBkYXRlZC1ldi1waXBlbGluZS1uZXctc3V2LW1vZGVsL9IBAA?oc=5","id":"CBMiZmh0dHBzOi8vZWxlY3RyZWsuY28vMjAyMy8wMy8xMy9wb3JzY2hlLXJlcG9ydHMtcmVjb3JkLTIwMjItZWFybmluZ3MtdXBkYXRlZC1ldi1waXBlbGluZS1uZXctc3V2LW1vZGVsL9IBAA","guidislink":false,"published":"Mon, 13 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=72, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWxlY3RyZWsuY28vMjAyMy8wMy8xMy9wb3JzY2hlLXJlcG9ydHMtcmVjb3JkLTIwMjItZWFybmluZ3MtdXBkYXRlZC1ldi1waXBlbGluZS1uZXctc3V2LW1vZGVsL9IBAA?oc=5\" target=\"_blank\">Porsche reports record 2022 earnings, updated EV pipeline includes entirely new SUV model<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Electrek<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Porsche reports record 2022 earnings, updated EV pipeline includes entirely new SUV model - Electrek","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vZWxlY3RyZWsuY28vMjAyMy8wMy8xMy9wb3JzY2hlLXJlcG9ydHMtcmVjb3JkLTIwMjItZWFybmluZ3MtdXBkYXRlZC1ldi1waXBlbGluZS1uZXctc3V2LW1vZGVsL9IBAA?oc=5\" target=\"_blank\">Porsche reports record 2022 earnings, updated EV pipeline includes entirely new SUV model<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Electrek<\/font>","source.href":"https:\/\/electrek.co","source.title":"Electrek","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"During its annual press conference earlier today, Porsche AG is reporting four new financial records for 2022 following a successful IPO last fall. With record revenues for the previous year, Porsche now looks ahead toward its goal of delivering 80% electrification throughout its entire vehicle lineup by 2030 and has updated the public on what and when we will see new EV models, including a bespoke SUV prototype. Porsche AG is coming off a big year in 2022. After Porsche chief Oliver Blume took over as CEO of parent company Volkswagen Group last summer, he immediately got to work in boosting the Group’s transition to EVs. The German automaker saw its 100,000th Taycan EV roll off its assembly lines last fall, while Porsche simultaneously began teasing additional EVs to come, including the all-electric Macan SUV. Over the past year, we’ve also learned of an EV version of the 718 on the way, which has been spotted out of roads testing. To build hype head of its planned IPO, Blume and the Porsche team had also begun promising an entirely new SUV codenamed “K1” which will be positioned above both the Macan and Cayenne EVs in the sales pipeline. After completing the largest IPO in Europe by market capitalization last September, Porsche is now reporting encouraging financial figures on its way toward full electrification. Here’s the latest. Credit: Porsche AG Porsche aims for huge sales return on wings of new EVs During its annual press conference earlier today, Porsche’s chairman of the executive board Oliver Blume relayed 13.6% revenue growth in 2022 (37.6 billion euros compared to 33.1 billion in 2021). Operating profit was also up 1.5 billion euros compared to a year prior (+27.4%) alongside record highs in vehicle deliveries and net-cash flow (+0.2 billion euros). Blume elaborated: In difficult conditions, we achieved the strongest result in the history of Porsche, by some distance. We were also able to offer our customers exciting new products yet again in 2022. This is the result of a great team performance. Fresh off its successful public offering, Porsche AG looks to carry momentum into 2023 with lofty new targets. The new year kicked off the group’s new “Road to 20” program, which aims to achieve an operating return of sales over 20% in the long term. Porsche deputy chairman and member of the executive board for finance and IT Lutz Meschke, spoke to the group’s goals and newfound freedom to achieve them: With the Road to 20 we are making Porsche even more resilient and our brand stronger than ever. And we’re going to take a fresh look at everything, from our product range and pricing to our cost structure. We want to increase the quality of our contribution margins and make our products even more attractive. We can now become even more focused and pick up even more speed. The newly attained autonomy gives us additional entrepreneurial freedom. We will strengthen specific capabilities in key areas such as software and battery technology. According to consulting firm Brand Finance, Porsche sits as the most valuable luxury brand in the world right now, and it looks to transition that reputation over into a complete lineup of new EVs to join the Taycan. According to the Group’s latest production timeline, that will begin with the all-electric Macan in 2024, followed by the aforementioned 718 by mid-decade. Next will come a fourth generation, EV version of Porsche’s larger Cayenne SUV, followed by the entirely new “K1” SUV, positioned at a price point above all its other large EVs. Porsche shared that the new model will offer strong performance and automated driving functions while atop the Group’s SSP sport EV platform. With the new chassis, Porsche is also promising on-road performance and range combined with off-road capabilities in some models. Looking ahead, Porsche is still working to reach a net carbon neutral value chain for its vehicles by 2030, including a net carbon neutral use phase for the BEV models mentioned above. The group also began researching and developing e-fuels at a pilot plant with partners in Chile last year – a hot topic of debate in the EU as its commission has delayed a final vote to completely ban new sales of combustion vehicles by 2035. Porsche was one of the German automakers requesting guidance on the use of those fuels in the future before the vote is finalized. Meschke states that Porsche expects an operating return on sales between 17-19% in 2023 based on projected sales revenue around 40-42 billion euros.","filter_flag":1}
{"title":"No more 'bee-friendly juice' or 'carbon neutral bananas'? Commission proposes ban on misleading environmental claims - FoodNavigator.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wMy8yNC9Db21taXNzaW9uLXByb3Bvc2VzLWJhbi1vbi1taXNsZWFkaW5nLWVudmlyb25tZW50YWwtY2xhaW1z0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wMy8yNC9Db21taXNzaW9uLXByb3Bvc2VzLWJhbi1vbi1taXNsZWFkaW5nLWVudmlyb25tZW50YWwtY2xhaW1z0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wMy8yNC9Db21taXNzaW9uLXByb3Bvc2VzLWJhbi1vbi1taXNsZWFkaW5nLWVudmlyb25tZW50YWwtY2xhaW1z0gEA","guidislink":false,"published":"Fri, 24 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=83, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wMy8yNC9Db21taXNzaW9uLXByb3Bvc2VzLWJhbi1vbi1taXNsZWFkaW5nLWVudmlyb25tZW50YWwtY2xhaW1z0gEA?oc=5\" target=\"_blank\">No more 'bee-friendly juice' or 'carbon neutral bananas'? Commission proposes ban on misleading environmental claims<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"No more 'bee-friendly juice' or 'carbon neutral bananas'? Commission proposes ban on misleading environmental claims - FoodNavigator.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LmZvb2RuYXZpZ2F0b3IuY29tL0FydGljbGUvMjAyMy8wMy8yNC9Db21taXNzaW9uLXByb3Bvc2VzLWJhbi1vbi1taXNsZWFkaW5nLWVudmlyb25tZW50YWwtY2xhaW1z0gEA?oc=5\" target=\"_blank\">No more 'bee-friendly juice' or 'carbon neutral bananas'? Commission proposes ban on misleading environmental claims<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">FoodNavigator.com<\/font>","source.href":"https:\/\/www.foodnavigator.com","source.title":"FoodNavigator.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"This week, the Commission proposed common criteria against greenwashing, targeting environmental claims such as ‘bee-friendly juices’ or ‘carbon neutral bananas’. Too often, such claims are made with ‘no evidence and justification whatsoever’, according to Frans Timmermans, executive vice-president for the European Green Deal. This, he explained, opens the door to greenwashing and puts companies making genuinely sustainable products at a disadvantage. “Many Europeans want to contribute to a more sustainable world through their purchases. They need to be able to trust the claims made. With this proposal, we give consumers the reassurance that when something is sold as green, it is actually green.”​ Backing up claims with scientific evidence​ The proposed criteria would legally bind companies to respect minimum norms on how they substantiate ‘green claims’ as well as how they communicate them. Before companies communicate ‘green claims’ – with the exception of those covered by existing EU rules such as the organic food logo – they would need to be independently verified and proven with scientific evidence. Companies would be required to identify the environmental impacts that are actually relevant to their product, while also identifying any possible trade-offs, to give a ‘full and accurate picture’. Promoting requirements imposed by law as a distinctive feature would also be banned. The new proposal was informed by research conducted by the Commission in 2020, which found that more than half (53.3%) of examined environmental claims across the bloc were vague, misleading or unfounded. A total of 40% were unsubstantiated. These findings were confirmed by the Consumer Protection Cooperation authorities in the same year, which revealed that in 57.5% of cases, the trader did not provide sufficient elements allowing for judgement of the claim’s accuracy. Following the ordinary legislative procedure, the Green Claims Directive proposal will now be subject to the approval of the European Parliament and the Council. Half the time, authorities had difficulty identifying whether the claim covered the whole product or only one of its components. It was also unclear whether ‘green’ claims referred to the company or only certain products. In 75% of the cases, it was unclear which stage of the products lifecycle it covered. In 2020, more than half of examined environmental claims were vague, misleading or unfounded. GettyImages\/Francesco Scatena This is likely having a negative impact on consumer trust in environmental claims, which the Commission described as being ‘quite low’. During the 2020 open public consultation, the general public did not agree with the statement that they trust environmental statements on products. Making for a level playing field​ As it stands, authorities are concerned that companies offering truly sustainable products are disadvantaged compared to those that do not. The Commission hopes the proposed laws, if enforced, will make for a level playing field. For this reason, trade association FoodDrinkEurope, which represents food and beverage manufacturers, is backing the Commission’s objective. “We firmly support the purpose of the Commission’s proposal which is to avoid misleading information and greenwashing, while ensuring a level playing field among businesses,” ​an FDE spokesperson told this publication. “Establishing harmonised requirements for the voluntary provision of environmental information will further motivate businesses to continue improving their environmental footprint and increase consumer trust.”​ Its success, however, hinges on ‘legal certainty and clarity’, as well as alignment with international standards and the creation of simple and effective tools to enable informed consumer choices, suggested the spokesperson. “As a Directive, the proposal leaves a lot of room for Member State interpretation, which could create different approaches and divergence for businesses trading across borders.​ “It will be crucial to bring SMEs on board with proportionate rules and effective support systems.”​ Has the Commission gone far enough?​ Others who have welcomed the proposal suggest the Commission could have gone further in banning ‘climate-washing’ claims. Changing Markets Foundation, for example, applauded the EU ‘striking a match’ for the ‘upcoming bonfire of certification schemes’. “We have warned such labels to become more robust and transparent for many years, so those who have dragged their heels are in for an unpleasant surprise,” ​said Changing Markets Foundation campaign manager George Harding-Rolls. But the campaigning organisation is disappointed the Commission stopped short of banning generic climate claims, which it described a ‘prevalent greenwashing tactic’. “Our research showed that over half of dodgy climate claims in food rely on offsets of dubious quality, misleading consumers into believing they’re buying products with reduced emissions,” ​said Nusa Urbancic, campaigns director at Changing Markets Foundation. “The latest IPCC report​ showed that we must rapidly reduce emissions from all sectors, so it is a shame that the Green Claims Directive is not turbocharging real climate solutions by banning these false claims.”​ The European Consumer Organisation (BEUC) also welcomed the Commissions’ ‘long-awaited’ proposal as an ‘important step’ towards greener and more sustainable consumption in the EU. In the face of what BEUC describes as a ‘jungle of unregulated claims’, the Commission is ‘raising its game’ to fight greenwashing, putting an end to the ‘wild west’ of unsubstantiated green claims. “Preventing the problem instead of correcting it once the harm is done is an innovative move which will benefit consumers, who want to act sustainably and need reliable information to do so,” ​said BEUC director general Monique Goyens. But BEUC takes issue with the proposal’s approach to carbon neutral claims, such as ‘CO2 neutral’. The Commission wants companies to distinguish between their own emission reduction efforts and use of carbon offsetting schemes. BEUC, on the other hand, wants carbon neutral claims banned outright​. Neither Changing Markets Foundation nor BEUC believe the Commission has gone far enough. GettyImages\/filaxia Ultimately, how effective the proposed law will be is dependent on its enforcement, Goyens suggested. “Authorities will have to heavily fine companies to clean up the market from misleading green claims and labels once and for all. It is also great news that consumer organisations will be able to bring collective complaints to court.”​","filter_flag":1}
{"title":"Mitsubishi Electric Pickup Truck Coming From More Than $10B EV Investment - The Drive","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZWRyaXZlLmNvbS9uZXdzL21pdHN1YmlzaGktZWxlY3RyaWMtcGlja3VwLXRydWNrLWNvbWluZy1mcm9tLW1vcmUtdGhhbi0xMGItZXYtaW52ZXN0bWVudNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZWRyaXZlLmNvbS9uZXdzL21pdHN1YmlzaGktZWxlY3RyaWMtcGlja3VwLXRydWNrLWNvbWluZy1mcm9tLW1vcmUtdGhhbi0xMGItZXYtaW52ZXN0bWVudNIBAA?oc=5","id":"CBMiZmh0dHBzOi8vd3d3LnRoZWRyaXZlLmNvbS9uZXdzL21pdHN1YmlzaGktZWxlY3RyaWMtcGlja3VwLXRydWNrLWNvbWluZy1mcm9tLW1vcmUtdGhhbi0xMGItZXYtaW52ZXN0bWVudNIBAA","guidislink":false,"published":"Fri, 10 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=69, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZWRyaXZlLmNvbS9uZXdzL21pdHN1YmlzaGktZWxlY3RyaWMtcGlja3VwLXRydWNrLWNvbWluZy1mcm9tLW1vcmUtdGhhbi0xMGItZXYtaW52ZXN0bWVudNIBAA?oc=5\" target=\"_blank\">Mitsubishi Electric Pickup Truck Coming From More Than $10B EV Investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Drive<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mitsubishi Electric Pickup Truck Coming From More Than $10B EV Investment - The Drive","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZmh0dHBzOi8vd3d3LnRoZWRyaXZlLmNvbS9uZXdzL21pdHN1YmlzaGktZWxlY3RyaWMtcGlja3VwLXRydWNrLWNvbWluZy1mcm9tLW1vcmUtdGhhbi0xMGItZXYtaW52ZXN0bWVudNIBAA?oc=5\" target=\"_blank\">Mitsubishi Electric Pickup Truck Coming From More Than $10B EV Investment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Drive<\/font>","source.href":"https:\/\/www.thedrive.com","source.title":"The Drive","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Mitsubishi Motors announced Friday it will invest as much as $13.2 billion into electrification as part of its global comeback bid. The scheme will spawn a broad range of products, including an electric pickup truck alongside a conventional, internal combustion-powered pickup. The trucks were confirmed as part of Mitsubishi’s Mid-Term Business Plan that will commit $10.26 billion to $13.19 billion to electrification through 2030. The money will be spent on R&D and new facilities, including those used for battery production, with more than $1.5 billion earmarked for securing 15 gigawatt-hours of annual battery supply. Mitsubishi expects this investment to cut vehicle CO2 emissions by 40% come 2025, and operational CO2 in half by 2030. By that point, Mitsubishi expects EVs to account for half its global sales, though it doesn’t forecast full electrification until 2035. That means ICE will still play a central role in Mitsubishi’s product plans for the next five years, which will see it launch 16 products globally, nine of them electrified in one way or another. Mitsubishi’s new products for the next five years. Mitsubishi Motors A slide in Mitsubishi’s presentation confirms a wide range of vehicles, from the aforementioned pickups to full-size SUVs and tiny EVs, and everything in between. Mitsubishi Motors CEO Takao Kato said that U.S.-bound EVs will have to be planned with the help of local Renault-Nissan-Mitsubishi Alliance partner Nissan, which has the domestic manufacturing needed to qualify for the new federal EV tax credit under the Inflation Reduction Act. Some of the vehicles shown above will broaden Mitsubishi’s lineup of electrified vehicles in the U.S., though the Renault-based Colt hybrid won’t be among them. Mitsubishi’s U.S. product planner confirmed a pickup is of interest, though they emphasized that the global-market Triton isn’t a good candidate due to the Chicken Tax. The prospects for the electric pickup—while still tailored to Mitsubishi’s best markets in Asia and Australia—look better, though whether it’s a long-range model like most American electric trucks or something more affordable doesn’t sound like it has been decided. “I think there will be demand for battery-electric pickups. In the U.S., the Ford Lightning F-150 is quite popular. So, there will be such a trend,” Kato said, according to Automotive News. “There is demand for environmentally friendly pickups with shorter driving range. So, we would like to consider such possibility as well.” Mitsubishi Ralliart teaser. Mitsubishi Motors Mitsubishi performance cars will also return as soon as next year, which rumors indicate to be an “almighty” Outlander PHEV-based Ralliart SUV. At least one other performance model may be in the works, and Mitsubishi closed its presentation on a slide (above) showing the Ralliart Triton that won its debut rally in 2022. No caption was included to hint at its possible significance, however. Mitsubishi enters 2023 with two years of sales growth and a strong showing in JD Power’s 2023 dependability study, beating Toyota. A company spokesperson admitted at the 2023 Outlander PHEV‘s launch that Mitsubishi still isn’t a destination brand, though its investment in desirable products such as pickups and performance vehicles may yet change that. Got a tip or question for the author? You can reach them here: james@thedrive.com","filter_flag":1}
{"title":"European Green Steel Market Report 2022-2028: Rising Green Penetration, Carbon Neutrality, Certificate-based ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wMy8wMy8yNjIwMDU5LzI4MTI0L2VuL0V1cm9wZWFuLUdyZWVuLVN0ZWVsLU1hcmtldC1SZXBvcnQtMjAyMi0yMDI4LVJpc2luZy1HcmVlbi1QZW5ldHJhdGlvbi1DYXJib24tTmV1dHJhbGl0eS1DZXJ0aWZpY2F0ZS1iYXNlZC1Qcm9kdWN0cy1QcmVtaXVtLUdyZWVuLVN0ZWVsLU11bHRpcGxlLUVuZC1Vc2Vycy1Cb2Rlcy13ZWxsLWZvci10aGUtU2VjdG9yLmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wMy8wMy8yNjIwMDU5LzI4MTI0L2VuL0V1cm9wZWFuLUdyZWVuLVN0ZWVsLU1hcmtldC1SZXBvcnQtMjAyMi0yMDI4LVJpc2luZy1HcmVlbi1QZW5ldHJhdGlvbi1DYXJib24tTmV1dHJhbGl0eS1DZXJ0aWZpY2F0ZS1iYXNlZC1Qcm9kdWN0cy1QcmVtaXVtLUdyZWVuLVN0ZWVsLU11bHRpcGxlLUVuZC1Vc2Vycy1Cb2Rlcy13ZWxsLWZvci10aGUtU2VjdG9yLmh0bWzSAQA?oc=5","id":"CBMiggJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wMy8wMy8yNjIwMDU5LzI4MTI0L2VuL0V1cm9wZWFuLUdyZWVuLVN0ZWVsLU1hcmtldC1SZXBvcnQtMjAyMi0yMDI4LVJpc2luZy1HcmVlbi1QZW5ldHJhdGlvbi1DYXJib24tTmV1dHJhbGl0eS1DZXJ0aWZpY2F0ZS1iYXNlZC1Qcm9kdWN0cy1QcmVtaXVtLUdyZWVuLVN0ZWVsLU11bHRpcGxlLUVuZC1Vc2Vycy1Cb2Rlcy13ZWxsLWZvci10aGUtU2VjdG9yLmh0bWzSAQA","guidislink":false,"published":"Fri, 03 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=62, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wMy8wMy8yNjIwMDU5LzI4MTI0L2VuL0V1cm9wZWFuLUdyZWVuLVN0ZWVsLU1hcmtldC1SZXBvcnQtMjAyMi0yMDI4LVJpc2luZy1HcmVlbi1QZW5ldHJhdGlvbi1DYXJib24tTmV1dHJhbGl0eS1DZXJ0aWZpY2F0ZS1iYXNlZC1Qcm9kdWN0cy1QcmVtaXVtLUdyZWVuLVN0ZWVsLU11bHRpcGxlLUVuZC1Vc2Vycy1Cb2Rlcy13ZWxsLWZvci10aGUtU2VjdG9yLmh0bWzSAQA?oc=5\" target=\"_blank\">European Green Steel Market Report 2022-2028: Rising Green Penetration, Carbon Neutrality, Certificate-based ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"European Green Steel Market Report 2022-2028: Rising Green Penetration, Carbon Neutrality, Certificate-based ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggJodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wMy8wMy8yNjIwMDU5LzI4MTI0L2VuL0V1cm9wZWFuLUdyZWVuLVN0ZWVsLU1hcmtldC1SZXBvcnQtMjAyMi0yMDI4LVJpc2luZy1HcmVlbi1QZW5ldHJhdGlvbi1DYXJib24tTmV1dHJhbGl0eS1DZXJ0aWZpY2F0ZS1iYXNlZC1Qcm9kdWN0cy1QcmVtaXVtLUdyZWVuLVN0ZWVsLU11bHRpcGxlLUVuZC1Vc2Vycy1Cb2Rlcy13ZWxsLWZvci10aGUtU2VjdG9yLmh0bWzSAQA?oc=5\" target=\"_blank\">European Green Steel Market Report 2022-2028: Rising Green Penetration, Carbon Neutrality, Certificate-based ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Dublin, March 03, 2023 (GLOBE NEWSWIRE) -- The \"European Green Steel Market: Analysis & Forecast with Impact Analysis of COVID-19 and Forecast up to 2028\" report has been added to ResearchAndMarkets.com's offering. In 2022, the Europe green steel market was valued at US$47.36 million, and is probable to reach US$1272.06 million by 2028 as Europe's green steel market supply stood at 756.30 thousand tonnes in 2022 The Europe green steel market is projected to grow at a CAGR of 75.24%, during the forecast period of 2023-2028 Green steel is environmentally friendly steel that has a lower carbon footprint than traditional steel-making processes. The implementation of non-coal-based alternative technologies results in a reduction in this footprint. In most cases, green steel production uses green hydrogen rather than coal or electricity generated from non-fossil sources. European green steel market is expected to see growth in the future as European steelmaking rivals, such as Germany's Thyssenkrupp and ArcelorMittal, are also looking at using hydrogen to replace coking coal. With demand growth rising rapidly, it is expected that suppliers of green steel to enjoy a uniquely tight supply\/demand balance over the coming decade with attractive margin upside expected. But as supply grows and green steel becomes the new norm, pricing power is likely to fade in the longer-term. The outlook for green steel demand has positively surprised over recent years with a broader mix of end users than initially expected. It can be observed that demand for green steel has expanded too many more end markets than initially expected. Demand for green steel is ultimately led by a combination of two key drivers: Scope 3 emissions reduction targets and end consumer demand. Europe green steel market demand stood at 1.23 million tonnes in 2022. Europe green steel market has seen a supply in 2021 as SSAB, a Swedish consortium delivered the first batch of the metal - made using 'green' hydrogen - to an automobile manufacturer for truck production. Swedish steel companies will ramp up the country's steel production over the next few years as green hydrogen helps drive the transformation of one of the hardest industries to decarbonize. Europe Green Steel Market Dynamics: Growth Drivers: Green steel is the manufacturing of steel without the use of fossil fuels. Demand for green steel is increasing and technologies continue to be developed as the industry moves towards decarbonization and a more sustainable future. This is considered a positive indicator for the green steel market. Further, the market is expected to increase due to carbon neutrality, certificate-based products, premium green steel, multiple end users, etc. Challenges: Higher cost of production is a major challenge facing the green steel market. One of the main reasons for the higher cost of green steel production is the use of alternative raw materials and energy sources. For example, green steel production often involves using recycled steel scrap as raw material, which is more expensive than using virgin iron ore. The other challenge that green steel market complex carbon accounting calculation, energy crisis, etc. Trends: A major trend gaining pace in green steel market is increasing investment in launching green field projects. Market players are increasingly investing in launching green field projects and building partnerships and strategic alliances to transform their businesses in green steel is driving the market. About two thirds of the projects (31 out of 47) are in Europe, where the largest investments occur. Swedish companies have announced the largest share of investment (with US$22-51 Billion for 6 projects), followed by a South Korean company (US$8.8 Billion) and 11 projects announced by German firms. More trends in the market are believed to augment the growth of green steel market during the forecasted period include high utilization of biomass resources, new technologies, etc. Market Segmentation Analysis: By Type: According to the report, the Europe green steel market is segmented into two types: Molten Oxide Electrolysis (MOE) and Electric Arc Furnace (EAF). Molten Oxide Electrolysis (MOE) segment acquired majority of share in the market in 2022, as it removes the need for coking ovens and blast furnaces. Instead, iron ore is dissolved in a liquid electrolyte solution at a temperature of about 1,600oC before an electrical current is passed through the solution, reducing the iron ore into a liquid in an endothermic reaction. Whereas, Electric Arc Furnace (EAF) segment is expected to have the highest CAGR in the future as arc furnaces used in research laboratories and by dentists may have a capacity of only a few dozen grams. These furnaces run on natural gas and will eventually use green hydrogen (H2), dramatically reducing the plant's carbon emissions. By End User: According to the report, the Europe green steel market is segmented into four end users: Automotive, Construction, Electronics and Other End Users. Automotive segment acquired majority of share in the market in 2022, as green steel is now being used by automakers to ensure a cleaner, greener manufacturing ecosystem. Moreover, international auto makers like GM, Volvo, Mercedes etc., have pledged to become carbon neutral by 2040. By Region: According to this report, the Europe green steel market can be divided into five sub regions: Sweden, Germany, France, UK and Rest of Europe. Sweden green steel market enjoyed the highest market share in 2022, primarily owing to aims for climate neutrality by 2045 and accounts for the biggest investment volume that has been announced. Swedish steel venture H2 Green Steel - founded in 2020 - announced that some of the most prominent European financial institutions have decided to support the hydrogen-based steel plant construction in northern Sweden. These investments and funding would increase the supply as many players would establish green steel plants in Europe. Swedish steel companies will ramp up the country's steel production over the next few years as green hydrogen helps drive the transformation of one of the hardest industries to decarbonize. Competitive Landscape and Recent Developments: As the European market transitions there is a clear first mover advantage with SSAB and Salzgitter ahead of peers and aiming to fully shift to green steel by 2030 and 2033, respectively, vs peers' targets of 2050. Notably, this will allow both companies to gain share in premium green products above and beyond their existing market share in standard grades whilst ArcelorMittal and Thyssenkrupp are set to lose market share due to their relatively slower transitions. SSAB has taken this one step further identifying the transition to green steel as an opportunity to take share in high value automotive markets by also investing in new downstream finishing capacity. The key players are constantly investing in strategic initiatives, such as new product launches, introducing their products to emerging markets and more, to maintain a competitive edge in this market. For instance, in 2022, ArcelorMittal plans to invest US$100 million Also, in 2021, Iberdrola & H2 Green Steel signed a green hydrogen deal of US$2.59 billion. With a capacity to generate 2 million tons of pig iron would be produced & fueled by green hydrogen at the new facility. Europe green steel market is concentrated with SSAB, Salzgitter and ArcelorMittal as best positioned, in Europe. Key Metrics Report Attribute Details No. of Pages 116 Forecast Period 2023 - 2028 Estimated Market Value (USD) in 2023 $76.97 Million Forecasted Market Value (USD) by 2028 $1272.06 Million Compound Annual Growth Rate 75.2% Regions Covered Europe Key players of Europe green steel market are: ArcelorMittal S.A. Salzgitter AG SSAB AB ThyssenKrupp AG Tata Steel Europe Limited Tenaris S.A. Swiss Steel Group (Deutsche Edelstahlwerke Specialty Steel GmbH & Co. KG) Voestalpine AG H2 Green Steel Vanir Green Industries (Blaster Green Steel) GFG Alliance (Liberty Steel Group Holdings UK Ltd) O-I Glass, Inc. Market Dynamics Growth Drivers Rising Green Penetration Carbon Neutrality Certificate-based Products Premium Green Steel Multiple End Users Challenges Energy Crisis Complex Carbon Accounting Calculation Higher Cost of Production Market Trends Increasing Investment in Launching Greenfield Projects High Utilization of Alternative Resources New Technologies Europe Green Steel Market: An Analysis Europe Green Steel Market: An Overview Europe Green Steel Market by Value Europe Green Steel Market by Type (Molten Oxide Electrolysis (MOE) and Electric Arc Furnace (EAF)) Europe Green Steel Market by End User (Automotive, Construction, Electronics and Other End Users) Europe Green Steel Market by Region (Sweden, Germany, France, UK and Rest of Europe) Regional Market Analysis Sweden Germany France UK Rest of Europe For more information about this report visit https:\/\/www.researchandmarkets.com\/r\/oifqk8 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment","filter_flag":1}
{"title":"Digiprint Nettl launches new sustainable range following HP install - Printweek","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnByaW50d2Vlay5jb20vY29udGVudC9uZXdzL2RpZ2lwcmludC1uZXR0bC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcmFuZ2UtZm9sbG93aW5nLWhwLWluc3RhbGwv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnByaW50d2Vlay5jb20vY29udGVudC9uZXdzL2RpZ2lwcmludC1uZXR0bC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcmFuZ2UtZm9sbG93aW5nLWhwLWluc3RhbGwv0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3LnByaW50d2Vlay5jb20vY29udGVudC9uZXdzL2RpZ2lwcmludC1uZXR0bC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcmFuZ2UtZm9sbG93aW5nLWhwLWluc3RhbGwv0gEA","guidislink":false,"published":"Thu, 23 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=82, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnByaW50d2Vlay5jb20vY29udGVudC9uZXdzL2RpZ2lwcmludC1uZXR0bC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcmFuZ2UtZm9sbG93aW5nLWhwLWluc3RhbGwv0gEA?oc=5\" target=\"_blank\">Digiprint Nettl launches new sustainable range following HP install<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Printweek<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Digiprint Nettl launches new sustainable range following HP install - Printweek","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3LnByaW50d2Vlay5jb20vY29udGVudC9uZXdzL2RpZ2lwcmludC1uZXR0bC1sYXVuY2hlcy1uZXctc3VzdGFpbmFibGUtcmFuZ2UtZm9sbG93aW5nLWhwLWluc3RhbGwv0gEA?oc=5\" target=\"_blank\">Digiprint Nettl launches new sustainable range following HP install<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Printweek<\/font>","source.href":"https:\/\/www.printweek.com","source.title":"Printweek","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Digiprint Nettl has launched an environmentally friendly range of products following the installation of an HP Latex R1000 printer. Established in 1987 as a litho and copy shop in Bath and Chippenham, Digiprint Nettl now offers all kinds of print, and has two advanced design and digital print studios. In January it opened a new signs, display, and exhibition factory to further widen its offering to customers and this led to the purchase of the Latex R1000, which was installed in the same month. Running alongside an HP Latex 800W printer, which was installed a few months earlier in October, the Latex R1000 has changed the way the company operates, particularly the machine’s use of water-based HP Latex inks, which have enabled the business to roll out its new range of products. “Our most important requirement when investing in the printer was the environmentally friendly Latex technology,” said Ben Gregory, director of Digiprint Nettl. “Our business became carbon neutral in 2015 and Climate Positive in 2019, and HP Latex was an essential step to help us achieve this goal. “For us, choosing to partner with HP was deliberate and researched extensively. As a result of the new HP Latex R1000 investment, we are going to be launching a fully comprehensive range of PVC-free environmentally friendly sign and display products.” He added: “Having already offered HP Latex to our customers for roll-to-roll printing, adding the flatbed option with an HP R1000 will deliver new markets instantly. “We have secured contracts with schools, councils, government bodies and larger businesses all due to the increased eco-friendly options available to us now. “Within a week of installing the HP R1000 we had customers enquiring about new products and services that were previously not achievable. For example, a customer who uses our business for regular print has placed orders for bespoke packaging boxes for large items and has ordered point-of-sale and pallet wrappers to match. “Another business was ordering transfers for skateboards from China; after some testing on our HP R1000 we profiled a film and have landed an order of over 5,000 skateboard prints.” Digiprint Nettl is a long-term HP customer, having taken on its first HP printer in the 1990s and regularly upgrading its production setup with the manufacturer ever since.","filter_flag":1}
{"title":"LafargeHolcim logs record profit, bucking industry trend - Finance News: Latest Financial News, Finance News today in Bangladesh","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vdG9kYXkudGhlZmluYW5jaWFsZXhwcmVzcy5jb20uYmQvc3RvY2stY29ycG9yYXRlL2xhZmFyZ2Vob2xjaW0tbG9ncy1yZWNvcmQtcHJvZml0LWJ1Y2tpbmctaW5kdXN0cnktdHJlbmQtMTY3Nzc3ODQyOdIBhAFodHRwczovL3RvZGF5LnRoZWZpbmFuY2lhbGV4cHJlc3MuY29tLmJkL3N0b2NrLWNvcnBvcmF0ZS9sYWZhcmdlaG9sY2ltLWxvZ3MtcmVjb3JkLXByb2ZpdC1idWNraW5nLWluZHVzdHJ5LXRyZW5kLTE2Nzc3Nzg0Mjk_YW1wPXRydWU?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vdG9kYXkudGhlZmluYW5jaWFsZXhwcmVzcy5jb20uYmQvc3RvY2stY29ycG9yYXRlL2xhZmFyZ2Vob2xjaW0tbG9ncy1yZWNvcmQtcHJvZml0LWJ1Y2tpbmctaW5kdXN0cnktdHJlbmQtMTY3Nzc3ODQyOdIBhAFodHRwczovL3RvZGF5LnRoZWZpbmFuY2lhbGV4cHJlc3MuY29tLmJkL3N0b2NrLWNvcnBvcmF0ZS9sYWZhcmdlaG9sY2ltLWxvZ3MtcmVjb3JkLXByb2ZpdC1idWNraW5nLWluZHVzdHJ5LXRyZW5kLTE2Nzc3Nzg0Mjk_YW1wPXRydWU?oc=5","id":"CBMie2h0dHBzOi8vdG9kYXkudGhlZmluYW5jaWFsZXhwcmVzcy5jb20uYmQvc3RvY2stY29ycG9yYXRlL2xhZmFyZ2Vob2xjaW0tbG9ncy1yZWNvcmQtcHJvZml0LWJ1Y2tpbmctaW5kdXN0cnktdHJlbmQtMTY3Nzc3ODQyOdIBhAFodHRwczovL3RvZGF5LnRoZWZpbmFuY2lhbGV4cHJlc3MuY29tLmJkL3N0b2NrLWNvcnBvcmF0ZS9sYWZhcmdlaG9sY2ltLWxvZ3MtcmVjb3JkLXByb2ZpdC1idWNraW5nLWluZHVzdHJ5LXRyZW5kLTE2Nzc3Nzg0Mjk_YW1wPXRydWU","guidislink":false,"published":"Fri, 03 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=3, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=62, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vdG9kYXkudGhlZmluYW5jaWFsZXhwcmVzcy5jb20uYmQvc3RvY2stY29ycG9yYXRlL2xhZmFyZ2Vob2xjaW0tbG9ncy1yZWNvcmQtcHJvZml0LWJ1Y2tpbmctaW5kdXN0cnktdHJlbmQtMTY3Nzc3ODQyOdIBhAFodHRwczovL3RvZGF5LnRoZWZpbmFuY2lhbGV4cHJlc3MuY29tLmJkL3N0b2NrLWNvcnBvcmF0ZS9sYWZhcmdlaG9sY2ltLWxvZ3MtcmVjb3JkLXByb2ZpdC1idWNraW5nLWluZHVzdHJ5LXRyZW5kLTE2Nzc3Nzg0Mjk_YW1wPXRydWU?oc=5\" target=\"_blank\">LafargeHolcim logs record profit, bucking industry trend<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Finance News: Latest Financial News, Finance News today in Bangladesh<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"LafargeHolcim logs record profit, bucking industry trend - Finance News: Latest Financial News, Finance News today in Bangladesh","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMie2h0dHBzOi8vdG9kYXkudGhlZmluYW5jaWFsZXhwcmVzcy5jb20uYmQvc3RvY2stY29ycG9yYXRlL2xhZmFyZ2Vob2xjaW0tbG9ncy1yZWNvcmQtcHJvZml0LWJ1Y2tpbmctaW5kdXN0cnktdHJlbmQtMTY3Nzc3ODQyOdIBhAFodHRwczovL3RvZGF5LnRoZWZpbmFuY2lhbGV4cHJlc3MuY29tLmJkL3N0b2NrLWNvcnBvcmF0ZS9sYWZhcmdlaG9sY2ltLWxvZ3MtcmVjb3JkLXByb2ZpdC1idWNraW5nLWluZHVzdHJ5LXRyZW5kLTE2Nzc3Nzg0Mjk_YW1wPXRydWU?oc=5\" target=\"_blank\">LafargeHolcim logs record profit, bucking industry trend<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Finance News: Latest Financial News, Finance News today in Bangladesh<\/font>","source.href":"https:\/\/today.thefinancialexpress.com.bd","source.title":"Finance News: Latest Financial News, Finance News today in Bangladesh","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Despite a tough year for the whole cement industry, LafargfeHolcim Bangladesh posted a record net profit of Tk 4.45 billion in 2022 riding on innovation, new product and new distribution channels. This is the highest profit for the multinational cement manufacturer since its listing in 2003, registering a 14 per cent increase from the previous year's profit of Tk 3.88 billion. \"Launching of new products and acceleration of our waste management services contributed significantly to the record results,\" said Iqbal Chowdhury, CEO of LafargeHolcim Bangladesh. As a result, the cement maker's earnings per share (EPS) stood at Tk 3.83 for 2022 as against Tk 3.34 in the previous year, the company said in a statement on Thursday. Based on the profit, the company declared a record dividend -- 48 per cent cash in total for the year 2022, with a final 15 per cent cash dividend announced on Thursday. Earlier, the cement maker disbursed 15 per cent and 18 per cent interim cash dividend in two phases. The top-tier cement producer's sales revenue also rose 15 per cent year-on-year to Tk 23.59 billion for the year ended December 2022. \"2022 was a commendable year for LafargeHolcim Bangladesh, as we delivered record performance both in profitability and cash generation,\" said Mr Chowdhury. \"We launched new sustainable products, like 'Supercrere Plus', ensured growth in aggregates business, increased our digital footprint and gained traction in our new business channels.\" Mr Chowdhury said LafargeHolcim Bangladesh continued to advance its leadership in sustainability with the 'Geocyle', the waste management initiatives towards the company's goal of becoming carbon neutral by 2050. \"We are poised for 2023 as we look to continue introducing new innovative and sustainable building material solutions in the Bangladesh market. This will further differentiate us in the market,\" he added. Market experts said LafargeHolcim has a unique edge in business as it sources core raw material -- limestone -- from mines in Meghalaya, India, which is transported to its factory in Chhatak, Sylhet, through a conveyor belt. This edge offers the company to avert freight charges and international raw material market volatility, while the profitability of its competitors mostly depends on these factors. LafargeHolcim also started the aggregates business and production in its Chhatak plant in January 2021. The profitable aggregates business also contributed to the company's revenue growth. The company also launched two new products -- Holcim Water Protect and Holcim Shokti -- in 2021. In the same year, the company's annual net sales increased by 27 per cent to Tk 20.53 billion and net profit jumped 64 per cent to Tk 3.88 billion while the company paid a 25 per cent cash dividend. Listed in 2003, its share price remained stuck at floor level at Tk 64.80 each. Out of the seven cement companies listed in the stock market, three went into the red and three saw their profit slow down at 15-30 per cent while LafargfeHolcim is the only cement manufacturer that posted profit growth in 2022. The industry's decade-low performance in 2022 was rendered by soaring costs, a decline in development work, and a stiff competition among peers amid the acute crisis of the dollar, industry people say. [email protected]","filter_flag":1}
{"title":"Cauldron set to supercharge precision fermentation - Food & Drink Business","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua2J1c2luZXNzLmNvbS5hdS9uZXdzL2NhdWxkcm9uLXNldC10by1zdXBlcmNoYXJnZS1wcmVjaXNpb24tZmVybWVudGF0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua2J1c2luZXNzLmNvbS5hdS9uZXdzL2NhdWxkcm9uLXNldC10by1zdXBlcmNoYXJnZS1wcmVjaXNpb24tZmVybWVudGF0aW9u0gEA?oc=5","id":"CBMiX2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua2J1c2luZXNzLmNvbS5hdS9uZXdzL2NhdWxkcm9uLXNldC10by1zdXBlcmNoYXJnZS1wcmVjaXNpb24tZmVybWVudGF0aW9u0gEA","guidislink":false,"published":"Mon, 27 Mar 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=27, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=86, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua2J1c2luZXNzLmNvbS5hdS9uZXdzL2NhdWxkcm9uLXNldC10by1zdXBlcmNoYXJnZS1wcmVjaXNpb24tZmVybWVudGF0aW9u0gEA?oc=5\" target=\"_blank\">Cauldron set to supercharge precision fermentation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food & Drink Business<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Cauldron set to supercharge precision fermentation - Food & Drink Business","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiX2h0dHBzOi8vd3d3LmZvb2RhbmRkcmlua2J1c2luZXNzLmNvbS5hdS9uZXdzL2NhdWxkcm9uLXNldC10by1zdXBlcmNoYXJnZS1wcmVjaXNpb24tZmVybWVudGF0aW9u0gEA?oc=5\" target=\"_blank\">Cauldron set to supercharge precision fermentation<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Food & Drink Business<\/font>","source.href":"https:\/\/www.foodanddrinkbusiness.com.au","source.title":"Food & Drink Business","query":"https:\/\/news.google.com\/rss\/search?q=\"Carbon Neutral\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"From its base in New South Wales’ agriculturally rich Central West region, Australian start-up Cauldron says its recent $10.5 million raise will go towards building Asia-Pacific’s largest network of precision fermentation facilities. Founder and CEO of Australian precision fermentation start-up Cauldron, Michele Stansfield. (Source: Cauldron) Founded by Michele Stansfield, the oversubscribed funding round received local and global investment including Main Sequence and Horizon Ventures. It was also one of the largest seed rounds for a female founded start-up. Cauldron said it uses a “revolutionary hyper-fermentation platform that will unlock the production of new forms of food, feed and fibre, and unlock a $700 billion global industry opportunity”. The company claims its unique continuous fermentation process\/hyper-fermentation platform “radically lowers commercial risk, producing ingredients five times more efficiently, with a five times reduction in cost” compared to conventional methods. While fermentation has been used for thousands of years to brew beer and culture cheese, it can take months or years to perfect. Precision fermentation “hypercharges” that process, creating the optimal conditions for microorganisms and bacteria to create new proteins, fats, fuels and more, the company said. With Cauldron’s revolutionary fermaculture platform, we are supercharging that process and unlocking the next evolution of how we produce food, feed, and fibre globally. Cauldron CEO and founder Stansfield said, “Humanity has spent thousands of years getting fermentation to work. With Cauldron’s revolutionary fermaculture platform, we are supercharging that process and unlocking the next evolution of how we produce food, feed, and fibre globally. Horizons Ventures’ Chris Liu said, “We believe Australia has the unique advantages and natural resources to become a world leader in the age of bio-based manufacturing. “Cauldron’s hyper-fermentation platform provides a supercharger in the quest for scalable precision fermentation without sacrificing cost and efficiency, particularly due to its easy access to abundant local feedstock supply alongside a carbon neutral production process.” Cauldron founder and CEO, Michele Stansfield. (Source: Cauldron) Stansfield added, “Our technology, 35 years of expertise, combined with Australia’s unique infrastructure and abundance of natural resources, will help ensure companies in this space can get new products and ingredients to market quickly, at lower cost and risk.” Cauldron’s hyper-fermentation platform is a breakthrough for the growing industry, helping precision fermentation companies scale and commercialise new products faster at a much lower risk. The company said it would expand its existing pilot facility in Orange, New South Wales and start building a network of precision fermentation facilities around regional Australia that tap into the country’s agricultural know-how and feedstock while diversifying and creating new local jobs. In January, the Queensland government announced funding for Cauldron to conduct a feasibility study of bringing a world-leading Future Foods BioHub to Mackay in northern Queensland. Stansfield said that the combination of local and global investors with its strong team at the helm meant Cauldron had the resources and experience needed to scale initial production facilities and prove the feasibility of other hubs around Australia. Cauldron co-founder and CFO David Kestenbaum was formerly general partner at ZX Ventures (the CVC arm of AB InBev), where he led all of its investments in biotech and alternative protein. While precision fermentation has been used to create many vitamins and enzymes in food products, and guaranteed a supply of medications like insulin, manufacturing at commercial scale has slowed the industry’s growth dramatically. Issues of commercial scale, time, capital investment, and high production costs have stymied the sector’s capabilities. Cauldron will serve as a regional powerhouse for production to ensure Australia plays a part in the future of agriculture and other industries. Main Sequence partner Phil Morle said, “If Australia doesn’t tackle this opportunity, others will. Precision fermentation is already a crucial part of medicines like insulin and many animal feeds but is often done at smaller scale and overseas. “Cauldron will serve as a regional powerhouse for production to ensure Australia plays a part in the future of agriculture and other industries.” CSIRO predicts it will become a $700 billion industry by 2040, but issues of commercial scale, time, capital investment, and high production costs have been major hurdles. Australian biotech company Loam Bio is using Cauldron’s network to accelerate the production of the microbial technology needed to capture carbon and store it long-term. And ULUU, the Australian company creating a revolutionary natural replacement for plastics, is working with Cauldron to scale up production to help get its first products to market faster and replace plastics across a variety of uses. Other Australian businesses specialising in precision fermentation: ULUU – Perth-based, creating biomaterials out of seaweed to replace plastic; – Perth-based, creating biomaterials out of seaweed to replace plastic; Eden Brew – CSIRO-backed start-up, brewing proteins in a lab to create dairy-free milk which has the same taste and nutritional benefits as traditional milk (just without the cows); – CSIRO-backed start-up, brewing proteins in a lab to create dairy-free milk which has the same taste and nutritional benefits as traditional milk (just without the cows); Loam Bio – biotech company producing the microbial technology needed to capture carbon and store it long-term; – biotech company producing the microbial technology needed to capture carbon and store it long-term; All G Foods – combining precision fermentation and cutting-edge technology to produce animal-dairy and other proteins for use and application in everyday consumer products; and – combining precision fermentation and cutting-edge technology to produce animal-dairy and other proteins for use and application in everyday consumer products; and Nourish Ingredients – developing sustainable, animal-free fats without sacrificing taste for a growing market of alternative protein food brands. Precision Fermentation 101 (Source: Cauldron) Synthetic biology A field of science that involves redesigning organisms for useful purposes by engineering them to have new abilities. Precision fermentation technology A form of synthetic biology that has been around for several decades. The technology uses genetically engineered yeasts and other microorganisms to custom-make a wide range of molecules. How does precision fermentation work? It typically requires the use of genetically engineered microorganisms, which are cultivated in brewery-style fermentation tanks. Think of the microorganism as a little critter that’s been programmed through a range of in-vitro nucleic acid techniques. These little critters “eat” one material, and “excrete” a different material – usually edible fats or proteins that are biologically similar to animal products. The most common types of microorganisms used in precision fermentation include yeast, algae, and bacteria. Precision fermentation is designed to develop new ingredients (i.e., proteins, fats, and fibres) which can then be used to create animal-free milk, or plant-based meats, for example. Why is the industry taking off now? While precision fermentation has been around for a while, mostly used in the medical industry (i.e., the development of life-saving medications such as insulin) it’s a relatively new food technology that’s entering the mainstream. Start-ups and established companies alike are looking for ways to harness the technology and bring new products to the market, from pharmaceuticals and food through to new materials such as compostable plastics. These products are often sustainable, climate-friendly alternatives that buck the system and promise a better tomorrow. Products such as milk protein, animal fats, cell-based meat, egg whites and more are receiving hundreds of millions of investor dollars. What’s the difference between fermentation and precision fermentation? Fermentation has been used for thousands of years to brew beer and culture cheese, a process that takes months or years to perfect. Precision fermentation hypercharges that process, creating the optimal conditions for microorganisms and bacteria to create new proteins, fats, fuels and more.","filter_flag":1}
