{"title":"Automakers move to adopt a circular economy - Economist Intelligence Unit","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5","id":"CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA","guidislink":false,"published":"Fri, 17 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=17, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=48, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5\" target=\"_blank\">Automakers move to adopt a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Intelligence Unit<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Automakers move to adopt a circular economy - Economist Intelligence Unit","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQmh0dHBzOi8vd3d3LmVpdS5jb20vbi9hdXRvbWFrZXJzLW1vdmUtdG8tYWRvcHQtYS1jaXJjdWxhci1lY29ub215L9IBAA?oc=5\" target=\"_blank\">Automakers move to adopt a circular economy<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Economist Intelligence Unit<\/font>","source.href":"https:\/\/www.eiu.com","source.title":"Economist Intelligence Unit","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Automakers move to adopt a circular economy Fri, 17th Feb 2023 Several automakers, including Renault (France), Stellantis (Netherlands) and Volkswagen (Germany), are trying to develop circularity in vehicle production, allowing them to reuse materials and resources to reduce waste. Despite these moves, circularity in the automotive industry remains low at present as most automakers lack a defined process to recycle materials. The European Commission is currently reviewing its targets for end-of-life vehicles (ELVs) and is aiming to submit its proposal in 2023. However, a successful move to circularity will depend not only on regulations but also on automakers’ ability to make recycling profitable. The circular economy was one of the agenda items of the recent United Nations Climate Change Conference (COP27), which took place in November. However, aside from some small-scale funding for circular economy-related projects in Spain, nothing constructive was concluded at the climate conference. For an automotive industry burdened by high costs, this represents a wasted opportunity. While reducing waste is the central aim of a circular economy, it would also allow companies to cut costs, reduce the uncertainty associated with securing raw materials and comply with emissions regulations. Eventually, recycling should become profit-making. Shifting to a circular value chain This is not yet happening, with most recycling efforts driven largely by regulation. European automakers are already required to adhere to the European Commission’s directive on ELVs, which sets targets for the recyclability, reusability and recoverability of motor vehicles and their components. The current directive requires a minimum of 85% reuse and recycling and a minimum of 95% reuse and recoverability for light vehicles. The Commission is reviewing the directive and is expected to present a proposal on it in 2023. Japan and South Korea have had similar vehicle recycling laws for more than 15 years now. Meanwhile, India also launched a similar framework for scrapping ELVs in August 2021. In the US, there is no federal law for ELVs, but several state governments have legislation and requirements for vehicle recycling. Pressure groups want this legislation to go further, pushing the automotive industry away from an “open-loop” recycling policy (which allows materials to be turned into other products) towards a “closed-loop” policy (whereby materials are turned into a new version of the original product). They argue that closed-loop recycling processes and life cycle optimisation will be required to attain full circularity in automotive production. It would also reduce uncertainties related to procuring raw materials and help to control costs. Renault spins off its circular economy business Automakers are taking voluntary steps in this direction. In November, Renault announced that it will split its business into five units focused on electric vehicles (EVs) and software, low-emission fossil-fuel vehicles, motor racing, financial services and the circular economy. The last of these, called “The Future is NEUTRAL”, aims to achieve closed-loop circularity across the vehicle life-cycle, starting from procuring raw materials, production, and use to scrapping. It aims to become carbon negative in automotive production by 2030. Currently, only about 30% of vehicle materials are recycled for new vehicles – mainly through metal scrapping and battery repairs for ELV, but Renault claims that about 85% could be. Renault has three subsidiaries – Gaia, Indra and Boone Comenor – which form part of its circular economy factory, Refactory, located in Flins, France. The new addition to this factory will be a closed-loop battery recycling plant. In November 2021, the company launched another circular economy factory in Spain with a targeted roll-out between 2022 and 2024. It is also planning to launch similar projects in Turkey, South America and Portugal. Automakers set material recycling targets Stellantis (Netherlands) has also announced plans for the launch of its circular economy business unit to become carbon neutral by 2038. The company is aiming to generate about €2bn in revenue from the unit and will launch a “Circular Economy Hub” in Italy in 2023. In September, the company unveiled its concept electric vehicle, Citroën oli, made from recycled material and with end-of-life recyclability. Meanwhile, Volkswagen is aiming to set clear targets and indicators as part of its circular economy strategy, according to its 2021 sustainability report. Ford has set an interim target of using 20% recycled and renewable plastics in new vehicle designs by 2025 at its factories in North America and Europe and a 10% target for its factories in China and Turkey. Ford also uses a closed-loop system to manufacture its F-series trucks and is the largest closed-loop aluminium recycling automaker in the world, according to its 2022 sustainability report. The government push will play a key role Despite these initiatives, companies are far from attaining a closed-loop recycling system for their vehicle production. Most of their initiatives are limited to Europe, where both national and regional governments have strict targets. However, to achieve a full shift to circularity carmakers need to be driven not only by regulation but also by the potential to develop more efficient – possibly even profit-making – business models for recycling. The analysis and forecasts featured in this piece can be found in EIU’s Country Analysis service. This integrated solution provides unmatched global insights covering the political and economic outlook for nearly 200 countries, helping organisations identify prospective opportunities and potential risks.","filter_flag":1}
{"title":"How businesses can implement the Global Biodiversity Framework - World Economic Forum","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyLzUtd2F5cy1idXNpbmVzc2VzLWNhbi1pbXBsZW1lbnQtdGhlLW5ldy1nbG9iYWwtYmlvZGl2ZXJzaXR5LWZyYW1ld29yay_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyLzUtd2F5cy1idXNpbmVzc2VzLWNhbi1pbXBsZW1lbnQtdGhlLW5ldy1nbG9iYWwtYmlvZGl2ZXJzaXR5LWZyYW1ld29yay_SAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyLzUtd2F5cy1idXNpbmVzc2VzLWNhbi1pbXBsZW1lbnQtdGhlLW5ldy1nbG9iYWwtYmlvZGl2ZXJzaXR5LWZyYW1ld29yay_SAQA","guidislink":false,"published":"Tue, 21 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=52, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyLzUtd2F5cy1idXNpbmVzc2VzLWNhbi1pbXBsZW1lbnQtdGhlLW5ldy1nbG9iYWwtYmlvZGl2ZXJzaXR5LWZyYW1ld29yay_SAQA?oc=5\" target=\"_blank\">How businesses can implement the Global Biodiversity Framework<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How businesses can implement the Global Biodiversity Framework - World Economic Forum","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LndlZm9ydW0ub3JnL2FnZW5kYS8yMDIzLzAyLzUtd2F5cy1idXNpbmVzc2VzLWNhbi1pbXBsZW1lbnQtdGhlLW5ldy1nbG9iYWwtYmlvZGl2ZXJzaXR5LWZyYW1ld29yay_SAQA?oc=5\" target=\"_blank\">How businesses can implement the Global Biodiversity Framework<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">World Economic Forum<\/font>","source.href":"https:\/\/www.weforum.org","source.title":"World Economic Forum","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The Global Biodiversity Framework (GBF) sets ambitious targets to conserve nature and ensure its sustainable use and businesses are essential to its implementation. A key step for businesses to successfully contribute to the GBF is transparency and awareness of their impact on nature, reducing their adverse effects while ramping up good practices. Businesses would do well to collaborate with others and ensure they include indigenous people and local communities within decision-making. The ground-breaking Kunming-Montréal Global Biodiversity Framework (GBF) at the UN Biodiversity Conference (COP15) was signed in December 2022 by 196 parties committed to halting biodiversity loss by 2030. After four years of negotiations, the GBF sets ambitious goals with 23 targets for the conservation and sustainable use of nature. Businesses are key to implementing the GBF – target 15 calls for them to “progressively reduce negative impacts on biodiversity.” The stakes are high and the risks of biodiversity loss are well documented, with half of the world’s global domestic product highly or moderately dependent on nature. Nevertheless, there is a significant economic opportunity, circa $10.1 trillion annually, to be seized by taking the right action now. Have you read? The Post-2020 Global Biodiversity Framework and What it Means for Business 5 ways to implement the Global Biodiversity Framework Here are five ways businesses can lead the transition to a nature-positive economy. 1. Assess and disclose The Global Biodiversity Framework sends a strong signal for all companies to start understanding and disclosing biodiversity-related information. Although economic activity significantly impacts nature, corporate transparency remains low. Only 5% of companies have assessed their impacts on nature, with less than 1% understanding their dependencies. Companies need to gain a science-based view of their impact to identify biodiversity hotspots and the underlying drivers putting their operations at risk. Target 15, therefore, outlines the first step: for all large businesses and financial institutions to “regularly monitor, assess and transparently disclose their risks, dependencies and impacts on biodiversity.” That includes assessing the impacts of their operations, products and services on biodiversity and reporting on their progress. Businesses need robust biodiversity performance indicators to do so and should integrate them into existing governance mechanisms so they receive the same attention as financial targets. The guidance, High-level Business Actions on Nature, outlines the tools and frameworks for businesses to assess and measure, commit and set targets, take actions and publicly disclose progress. 2. Reduce the bad Companies should avoid degrading nature or significantly reduce their negative impact. Target 7 of the Global Biodiversity Framework calls for reducing pollution; target 16 calls for reducing global food waste. Businesses can address their dependency on natural resources by investing in environmentally-friendly technologies and practices. Closed-loop recycling and cradle-to-cradle approaches, for example, can vastly reduce the need to extract natural resources and cut end-of-life waste, thereby decreasing their impact on biodiversity. These actions also provide significant financial returns. In the automotive sector, for example, maximizing the reuse and recycling of materials could save $870 billion a year by 2030. Around 40% of the world’s food is lost annually and the agriculture, food and hospitality sectors must act. Up to half of all food that doesn’t reach our plates is lost at or near the farm, making tackling food waste a business imperative. Measures can be taken production side, including more accurate forecasting of demand and adopting sustainable crop management approaches to prevent and reduce environmental risks to crops. On the retail and consumption side, businesses can invest in improved storage and transportation methods and technology to increase product traceability and map food-loss hotspots. Simpler measures such as portion control and repurposing leftovers can significantly cut waste and mustn’t be overlooked. “ Up to half of all food that doesn’t reach our plates is lost at or near the farm, making tackling food waste a business imperative. ” — Marie Quinney, Lead, Impact Measurement and Management - Nature Action Agenda | Xinqing Lu, Community Lead, Champions for Nature 3. Increase the good A business-as-usual scenario presents an inherent risk to businesses, especially resource-dependent ones. While the diagnosis may seem dire, thankfully, nature can regenerate when given the space and time to do so. Target 3 of the Global Biodiversity Framework calls for restoring at least 30% of ecosystems. Abundant biodiversity is a strong indicator of a healthy ecosystem, increasing business resilience. By investing in protected areas and conservation initiatives, businesses can allow nature to bounce back, protecting the ecosystems they and their consumer base depend on. Target 10 calls for sustainable land use and resource management to provide benefits far beyond biodiversity. For example, if regenerative ocean farming was practised across 5% of US waters, it could absorb 135 million tonnes of carbon and create millions of additional jobs. In addition, companies can adopt sustainable procurement policies for mismanaged commodities that have a lasting impact on nature – e.g. wood, palm oil, soy and beef – by imposing strict sustainability criteria on suppliers. Third-party certification schemes, such as the Forest Stewardship Council, are useful tools to identify and signal sustainable management. Businesses that act on biodiversity will benefit from addressing supply chain risks while fostering trust with consumers and stakeholders. 4. Be inclusive and just Successful implementation of the Global Biodiversity Framework can’t occur by overlooking people’s role in a given ecosystem. As such, target 22 of the GBF calls for the involvement of Indigenous people and local communities (IPLCs) in decision-making, typically pushed to the periphery. Indigenous people comprise 5% of the population but are vital stewards of an estimated 80% of the planet’s biodiversity. At least 32% of land and associated inland waters (excluding Antarctica) is owned or governed by IPLCs and they have been implementing the solutions we need to adopt. By making stakeholder consultations and community engagement standard practice, businesses will benefit from indigenous knowledge. They will also mitigate their impact on local communities by ensuring respect for their rights and livelihoods. This approach is especially necessary for businesses in the consumer goods, food, agriculture, forestry, fisheries, extractive industries, infrastructure and water utilities sectors. 5. Don’t do it alone Isolated efforts to safeguard nature will prove futile. A race to the top must be fuelled by collaboration. Businesses should pursue partnerships and join initiatives to pool resources and knowledge and overcome barriers, such as cost and access to technology. Notable examples include the Champions for Nature, the Natural Capital Coalition and the Business for Nature coalition. Specialized initiatives and research can also support companies dealing with industry-specific environmental issues related to the Global Biodiversity Framework. Organizations, such as the World Economic Forum, World Business Council for Sustainable Development (WBCSD) – a CEO-led community of sustainable businesses – Business for Nature and TNFD, among others, are working with businesses to develop sector-specific guidance this year. In addition, coalitions and initiatives that support transitions in sectors such as textile, agriculture and consumer goods are also gaining ground. Nature loss is a material risk to corporate longevity but the high ambition set during the COP15 will wane without rapid and collective action. Thankfully, numerous tools, communities, frameworks and standards exist to guide the private sector. Businesses that lead on implementing the Global Biodiversity Framework can enter new markets as they develop new products and business models, improve their value proposition and public image, and reduce operational costs.","filter_flag":1}
{"title":"Mars Wrigley China Launches First Package Containing 100% rPET in a Local Chocolate Brand - Cui Xiang Mi - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtd3JpZ2xleS1jaGluYS1sYXVuY2hlcy1maXJzdC1wYWNrYWdlLWNvbnRhaW5pbmctMTAwLXJwZXQtaW4tYS1sb2NhbC1jaG9jb2xhdGUtYnJhbmQtLWN1aS14aWFuZy1taS0zMDE3NTYzMzkuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtd3JpZ2xleS1jaGluYS1sYXVuY2hlcy1maXJzdC1wYWNrYWdlLWNvbnRhaW5pbmctMTAwLXJwZXQtaW4tYS1sb2NhbC1jaG9jb2xhdGUtYnJhbmQtLWN1aS14aWFuZy1taS0zMDE3NTYzMzkuaHRtbNIBAA?oc=5","id":"CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtd3JpZ2xleS1jaGluYS1sYXVuY2hlcy1maXJzdC1wYWNrYWdlLWNvbnRhaW5pbmctMTAwLXJwZXQtaW4tYS1sb2NhbC1jaG9jb2xhdGUtYnJhbmQtLWN1aS14aWFuZy1taS0zMDE3NTYzMzkuaHRtbNIBAA","guidislink":false,"published":"Mon, 27 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=27, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=58, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtd3JpZ2xleS1jaGluYS1sYXVuY2hlcy1maXJzdC1wYWNrYWdlLWNvbnRhaW5pbmctMTAwLXJwZXQtaW4tYS1sb2NhbC1jaG9jb2xhdGUtYnJhbmQtLWN1aS14aWFuZy1taS0zMDE3NTYzMzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Mars Wrigley China Launches First Package Containing 100% rPET in a Local Chocolate Brand - Cui Xiang Mi<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Mars Wrigley China Launches First Package Containing 100% rPET in a Local Chocolate Brand - Cui Xiang Mi - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMingFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hcnMtd3JpZ2xleS1jaGluYS1sYXVuY2hlcy1maXJzdC1wYWNrYWdlLWNvbnRhaW5pbmctMTAwLXJwZXQtaW4tYS1sb2NhbC1jaG9jb2xhdGUtYnJhbmQtLWN1aS14aWFuZy1taS0zMDE3NTYzMzkuaHRtbNIBAA?oc=5\" target=\"_blank\">Mars Wrigley China Launches First Package Containing 100% rPET in a Local Chocolate Brand - Cui Xiang Mi<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Closed-loop recycling\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"GUANGZHOU, China, Feb. 27, 2023 \/PRNewswire\/ -- The efficient use of limited resources is key to the future of a low-carbon, green economy. The 14th Five-year Plan for the Development of Circular Economy issued by the National Development and Reform Commission of China in 2021 advocated development of a circular economy and an increase in resource recycling efficiency. At the same time, public acceptance of resource recycling is also at an all-time high. According to the 2022 Report on Chinese Consumers' Recognition of rPET, issued by the China Food Information Center, 82% of respondents accepted the replacement of traditional plastics with rPET (recycled PET). At Mars, we want to contribute to a circular economy where packaging material never becomes waste. Mars Wrigley China has taken a series of actions since 2019 to reimagine and redesign its packaging, making sure it is reusable, recyclable or compostable through innovation and advocacy. In 2023, Mars Wrigley China will make further progress in sustainable packaging innovation. We have launched our first package containing rPET in the Chinese market via a local chocolate brand, Cui Xiang Mi (CXM). The 216g canister lid of CXM is made from 100% rPET. It demonstrates a new chapter in recycled contents application for Mars Wrigley China's package portfolio. Exploring new solutions via recycled content application Recycled content application is essential to improving the closed-loop for a circular economy. However, the high-value application of recycled materials is still a challenge for the industry due to an immature industry value-chain and high cost. Take rPET as an example. According to the data published by the Plastic Recycling Branch of the China Synthetic Resin Association, China, a major PET producer and supplier to the world, recycled 5.68 million tons of PET scrap in 2020. But most of this was downgraded to rPET fibers used in textiles. They would normally be land-filled or incinerated at the end of their lifecycle. The circular economy advocates closed-loop recycling of resources to extend their life cycle and reduce the natural resources exploitation. This year, Mars Wrigley China achieved a breakthrough for recycled content application on chocolate core SKUs. The new 216g canister lid of CXM adopted 100% Post-Consumer Recycled PET with no change to the consumer experience due to appearance or tactile aspects. We want to inspire consumers with more green and sustainable moments in addition to our tasty products. Compared to the virgin PET, rPET contributes lower carbon emission and less petroleum consumption. We estimate that the launch of the new CXM rPET canister lid could save 36 tons of virgin plastic in a rolling year[1]. The circular economy is a complex system. Without a sound infrastructure, the recycling value chain breaks easily and cannot form a closed loop. Mars Wrigley China believes advocacy can contribute to circular economy development. In 2022, Mars China, together with other industrial leaders and national associations, kicked off China's first industry-wide flexible collection pilot - Flexible Plastics Reborn - to build a full-chain and closed-loop recycling system in China for flexible packs. The program aims to collect 50000 tons of flexible packaging waste by the end of 2025. Mars Wrigley expects this program can uplift recyclability for flexible packs and provide more resources and energy saving. Next step: this kind of rPET lid will be adopted by more brands over the rest of this year, such as SNICKERS and M&M'S. Mars Wrigley China aims to save 300 tons[2] of virgin plastics in a rolling year. Delivering commitments with diverse solutions Tomorrow Starts Today. Mars Wrigley China is committed, from today, to make efforts to create a healthier planet tomorrow for our next generation. In the past three years, it has released a range of diverse sustainable packaging solutions. Since 2019, the package weight lightening projects of Dove and Extra, have successfully saved more than 1000 tons of virgin plastics, equivalent to 60 million plastic packages reduction that could stretch over 4000 kilometers when connected. Moreover, Mars Wrigley China has explored the new sustainable materials application. In 2022, Mars Wrigley China released its first compostable paper package for M&M'S. This package can be composted by more than 90% in six months, under industrial composting conditions, into harmless water and carbon dioxide. Mars Wrigley China has also developed new business models based on sustainability purpose. In 2021, M&M'S launched a reusable tin, providing DIY purchasing consumer experience and encouraging consumer repurchase of M&M'S with this reusable package. This new business model and new pack has been welcomed by consumers and has generated 7.1 tons[3] of virgin plastics saving per year. To contribute to Mars Sustainable in a Generation Plan, Mars Wrigley China will continue our efforts on packaging sustainability today to build a circular economy where packaging never become waste. [1] Source: Internal data, subject to fluctuation. [2] Source: Internal data, subject to fluctuation. [3] Source: Internal data, subject to fluctuation. SOURCE Mars Wrigley China","filter_flag":1}
