{"title":"Sterling Generators collaborates with Pi Green for emission control device - Your Gateway to Power Transmission ... - T&D India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zdGVybGluZy1nZW5lcmF0b3JzLWNvbGxhYm9yYXRlcy13aXRoLXBpLWdyZWVuLWZvci1lbWlzc2lvbi1jb250cm9sLWRldmljZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zdGVybGluZy1nZW5lcmF0b3JzLWNvbGxhYm9yYXRlcy13aXRoLXBpLWdyZWVuLWZvci1lbWlzc2lvbi1jb250cm9sLWRldmljZS_SAQA?oc=5","id":"CBMiZGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zdGVybGluZy1nZW5lcmF0b3JzLWNvbGxhYm9yYXRlcy13aXRoLXBpLWdyZWVuLWZvci1lbWlzc2lvbi1jb250cm9sLWRldmljZS_SAQA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zdGVybGluZy1nZW5lcmF0b3JzLWNvbGxhYm9yYXRlcy13aXRoLXBpLWdyZWVuLWZvci1lbWlzc2lvbi1jb250cm9sLWRldmljZS_SAQA?oc=5\" target=\"_blank\">Sterling Generators collaborates with Pi Green for emission control device - Your Gateway to Power Transmission ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Sterling Generators collaborates with Pi Green for emission control device - Your Gateway to Power Transmission ... - T&D India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZGh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zdGVybGluZy1nZW5lcmF0b3JzLWNvbGxhYm9yYXRlcy13aXRoLXBpLWdyZWVuLWZvci1lbWlzc2lvbi1jb250cm9sLWRldmljZS_SAQA?oc=5\" target=\"_blank\">Sterling Generators collaborates with Pi Green for emission control device - Your Gateway to Power Transmission ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","source.href":"https:\/\/www.tndindia.com","source.title":"T&D India","query":"https:\/\/news.google.com\/rss\/search?q=\"Emission Control\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"New Products Sterling Generators collaborates with Pi Green for emission control device T&D India T&D India September 12, 2023 Share Sterling Generators Pvt Ltd (SGPL) has announced the launch of an innovative clean air solution “Retrofit Emission Control Device (RECD)”, in collaboration with Pi Green Innovations. RECD is built on filter-less technology and based on Electrostatic Precipitation fundamentals. It captures Particulate Matter (PM) from the engine exhaust with more than 70 per cent efficiency. Meeting compliance requirement Commenting on the product launch, Sanjay Jadhav, CEO, Sterling Generators Private Limited said,“We are happy to collaborate with Pi Green Innovations for their RECD technology. This collaboration provides an excellent opportunity to expand and enhance the product offerings we offer to our customers. The newly launched RECD is highly efficient in improving air quality and provides a viable solution for our customers to meet the PM compliance requirement, as per pollution control board norms.” “At Sterling Generators, we believe that environmental sustainability is a shared responsibility, and this collaboration reflects our dedication to finding cleaner, more efficient solutions for our customers and our planet. Together with Pi Green Innovations, we aim to redefine how the industry addresses air pollution, setting a new standard for cleaner energy solutions”, he added. Reusing particulate matter The RECD is installed after the DG exhaust (muffler\/silencer), and no modifications to the engine\/ DG set are required. What sets this technology apart is its ability to transform the separated particulate matter\/ byproduct and reuse it as a high-value raw material in paints, dyes, toners for laser printers and copiers as well as in a vulcanization process to treat rubber, thus eliminating the need for disposal and secondary contamination. The product is all weatherproof, needs minimal maintenance with a simple, efficient, and sturdy construction that provides constant performance and long operational life. Prestigious partnership Speaking at the launch event, Irfan Pathan, Founder & CEO, Pi Green Innovations noted, “We are honoured and proud to partner with a prestigious brand like Sterling Generators. This partnership not only gives a boost to the DG retrofit (RECD) industry in India but also adds impetus to Pi Green’s vision of A Pollution Free Tomorrow.” Also read:Sterling Generators Wins Rs.510 Crore Orders In FY23 Featured photograph shows Sanjay Jadhav, CEO, Sterling Generators (left) andIrfan Pathan, Founder & CEO, Pi Green Innovations, at the launch of RECD in Pune, on September 11, 2023","filter_flag":1}
{"title":"BMW Debuts More Powerful and Lighter F900GS For 2024 - ADV Pulse","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFkdnB1bHNlLmNvbS9hZHYtbmV3cy9ibXctZGVidXRzLW1vcmUtcG93ZXJmdWwtYW5kLWxpZ2h0ZXItZjkwMGdzLWZvci0yMDI0L9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFkdnB1bHNlLmNvbS9hZHYtbmV3cy9ibXctZGVidXRzLW1vcmUtcG93ZXJmdWwtYW5kLWxpZ2h0ZXItZjkwMGdzLWZvci0yMDI0L9IBAA?oc=5","id":"CBMiV2h0dHBzOi8vd3d3LmFkdnB1bHNlLmNvbS9hZHYtbmV3cy9ibXctZGVidXRzLW1vcmUtcG93ZXJmdWwtYW5kLWxpZ2h0ZXItZjkwMGdzLWZvci0yMDI0L9IBAA","guidislink":false,"published":"Fri, 08 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=8, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=251, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFkdnB1bHNlLmNvbS9hZHYtbmV3cy9ibXctZGVidXRzLW1vcmUtcG93ZXJmdWwtYW5kLWxpZ2h0ZXItZjkwMGdzLWZvci0yMDI0L9IBAA?oc=5\" target=\"_blank\">BMW Debuts More Powerful and Lighter F900GS For 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ADV Pulse<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"BMW Debuts More Powerful and Lighter F900GS For 2024 - ADV Pulse","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiV2h0dHBzOi8vd3d3LmFkdnB1bHNlLmNvbS9hZHYtbmV3cy9ibXctZGVidXRzLW1vcmUtcG93ZXJmdWwtYW5kLWxpZ2h0ZXItZjkwMGdzLWZvci0yMDI0L9IBAA?oc=5\" target=\"_blank\">BMW Debuts More Powerful and Lighter F900GS For 2024<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ADV Pulse<\/font>","source.href":"https:\/\/www.advpulse.com","source.title":"ADV Pulse","query":"https:\/\/news.google.com\/rss\/search?q=\"Emission Control\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"BMW Debuts More Powerful and Lighter F900GS For 2024 Three more powerful mid-range adventure models break cover. BMW has unveiled a significantly updated mid-range adventure bike lineup for 2024. Boasting a bump in capacity, the three new models include a thoroughly overhauled F900GS, a mile-munching F900GS Adventure and an A2-friendly F800GS released to replace the F850 and 750 platform. All three new models from the Bavarian manufacturer will feature a 895 cc (previously 853 cc) powerplant with a 270\/450 degree firing interval. While the detuned F800GS delivers 87 horsepower, the 900 machines pump out a claimed 105 hp – up from the 95 hp of the outgoing 850 machine. That peak power output out-punches established models like Honda’s Africa Twin and is on par with the KTM 890 Adventure. However, the F900GS and F900GS Adventure’s increase in torque is more modest, going from 67.9 lb-ft to 68.6 lb-ft but BMW says the new engines have a much fuller torque curve, increased pulling power and faster acceleration so it remains to be seen how that translates into the real world. The most notable changes are seen in the F900GS though, which is not only slimmer but also lighter at 483 lbs (219 kg) wet — shaving off 31 lbs (14 kg) compared to the predecessor model. The weight reduction is in part due to the newly-developed 14.5-liter plastic fuel tank (0.5 L smaller) which saves 9.9 lbs (4.5 kg) of weight compared to the steel tank of the previous model. The revamped F900GS also features new close-fitting tank side panels, a new radiator trim and a completely redesigned rear section, which shaves around 5.3 lbs (2.4 kg) and an additional 3.7 lbs (1.7 kg) is saved thanks to the Akrapovič silencer. ADVERTISEMENT To optimize the F900GS for off-road use, BMW has also updated its ergonomic triangle (handlebar – seat – footrests). The bike now features lower footrests, a higher handlebar position and a new foot brake lever in a higher position. All three new models offer an adjustable gear shift lever as standard. In conjunction with an optimized bearing and new gearshift lever kinematics, it was also possible to optimize shifting the six-speed transmission even further. The F900GS still rolls on 21”\/17” wheels but now has new, fully-adjustable USD Showa forks and boasts longer legs to match those of the Adventure variant, going from 8.0″ \/ 8.6″ (204 mm \/ 219 mm) of suspension travel to 9.1” \/ 8.5” (230 mm \/ 215 mm). The new F900GS can be given even more off-road prowess with the optional equipment ex works Enduro Pro package featuring fully-adjustable titanium nitride-coated USD 45mm Showa forks, fully-adjustable central spring strut as well as handlebar risers and an M Endurance chain. The Dynamic ESA (Electronic Suspension Adjustment) electronic suspension is available as optional equipment for the new F900GS Adventure and the F800GS. Compared to the predecessor model, the new LED headlight on the new BMW F900GS offers a larger low beam opening angle and thus better illumination directly in front of the motorcycle. The new F900GS Adventure and the F800GS also feature LED headlights as standard. Furthermore, the turn indicator and control lights of all three models also use LED technology. The new GS models in the F series each have a large 6.5-inch TFT display as standard with phone calling, listening to music and navigating capabilities. This applies in particular to the F800GS, which previously had an analogue display. Moreover, the new BMW F900GS is equipped with a 12 mm holder as standard, which permits action cams or other devices to be mounted. BMW F900GS Highlights: • Weight reduced by 14 kg • Significantly lighter plastic fuel tank and rear section • New body parts • New, fully adjustable upside-down telescopic forks • Lighter swinging arm • Enduro Pro package as optional equipment ex works • Sport silencer by Akrapovič • Ergonomics optimized for off-road use • Enduro footrests • Heated grips • Hand protectors • Aluminum side stand • New foot brake lever • New LED headlight • Multifunction holder BMW F900GS Adventure Highlights: • New, fully adjustable upside-down telescopic forks • LED headlights • New side panels • Heated grips • Aluminum engine guard • New Ride Pro optional equipment package • 6.1 gallon (23 liter) fuel tank BMW F800GS Highlights: • TFT display as standard • Heated grips • LED headlight. • Hand protectors • Variocase carrier Common highlights: • 2-cylinder in-line engine with increased capacity of now 895 cc (previously 853 cc). • Even higher output and torque: F900GS and F900GS Adventure with 77 kW (105 hp) at 8,500 rpm and 93 Nm at 6,750 rpm. F 800 GS with 64 kW (87 hp) at 6,750 rpm and 91 Nm at 6,750 rpm. • 35 kW (48 hp) versions for driving license class A2 (F 800 GS only). • High refinement due to two counter-rotating counterbalance shafts. • Two riding modes “Rain” and “Road” as well as ABS Pro and DTC as standard. • Ride modes Pro with two additional ride modes as well as Dynamic Brake Control (DBC) and engine drag torque control as optional equipment ex factory. • B ridge-type style frame. • Optimized adjustable gear shift lever. • Sophisticated ergonomics and numerous seat alternatives. • Practical wind and weather protection. • Powerful LED lighting units. • Large, perfectly readable 6.5-inch TFT display with unrivaled information diversity and functionality. • Intelligent emergency call for quick help in emergency situations as optional equipment ex works. • Keyless Ride for convenient activation of the locking functions by radio as an optional extra ex works. • Powerful paintwork and model variants make for unmistakable Enduro characteristics. • Extensive range of optional equipment, original BMW Motorrad accessories and rider equipment. Pricing and Availability *UPDATED 1\/23\/24* All three models are slated to arrive during the second quarter of 2024. The new F900GS starts at $13,495 and is available as a basic version in Blackstorm metallic, as a Passion model version in São Paulo yellow solid paint and as a GS Trophy version in Light White solid paint\/Racing Blue metallic. Starting at $14,195, the new F900GS Adventure is available as a basic variant in Blackstorm metallic and as a Ride Pro model variant in matt White Aluminum while the new F800GS starts at $10,495 and is available as a basic variant in Light White solid paint, as a Sport model variant in Racing Blue and as a Triple Black version in Blackstorm metallic. 2024 BMW F900GS & F900GS Adventure Specs Engine Capacity: 895cc Bore\/stroke: 86 x 77 mm Power Output: 105 hp (77 kW) @ 8,500 rpm Torque: 68.6 ft-lbs (93 Nm) @ 8,500 rpm Engine Type: Water-cooled, 2-cylinder, four-stroke in-line engine with four valves per cylinder operated by cam followers, two overhead camshafts and dry sump lubrication Compression: 13.1\/1 Fuel: Premium unleaded 95 RON Valves per cylinder: 4 Ø intake\/outlet: 33.5\/27.2 mm Ø throttle valve: 48 mm Engine control: BMS-ME Emission control: Closed-loop three-way catalytic converter, exhaust standard EU-5+ Generator: 416W Battery: 12V\/9Ah maintenance-free Headlight: LED Turn indicators: LED Starter: 900 W Clutch: Wet clutch with anti-hopping function, mechanically activated Gearbox: Claw-shift 6-speed gearbox Primary ratio: 1.821 1st Gear Ratio: 2.833 2nd Gear Ratio: 2.067 3rd Gear Ratio: 1.6 4th Gear Ratio: 1.308 5th Gear Ratio: 1.103 6th Gear Ratio: 0.968 Secondary drive: Endless O-ring chain with drive-train vibration damping in the rear wheel hub Secondary ratio: 2.765 (F900GS), 2.588 (F900GS Adventure) Frame construction type: Bridge-type steel frame in shell construction, load-bearing engine Front wheel suspension: USD telescopic forks, spring base, rebound and compression damping adjustable Ø 43 mm Rear wheel suspension: Aluminum double-sided swinging arm, directly linked WAD central spring strut, spring base and rebound damping adjustable (Optional equipment: sport suspension) (Option: Dynamic ESA) Spring travel, front\/rear: 9.1″\/8.5 inches (230\/215 mm) Wheel castor: F900GS: 4.7″ (119.78 mm); F900GS Adventure: 4.7″ (119.99 mm) WheelbasE: F900GS: 62.6″ (1,590 mm); Adventure: 62.4″ (1,585 mm) Steering head angle: 62° Brakes Front: Twin disc brake, floating brake discs, Ø 305 mm, 2-piston floating calipers Brakes Rear: Single disc brake, Ø 265 mm, 1-piston floating caliper ABS: Standard equipment BMW Motorrad ABS Pro (banking angle optimized) Wheels Front: Cross Spoke Wheels 2.15 x 21” Wheels Rear: Cross Spoke Wheels 4.25 x 17″ Tires Front: 90\/90-21 Tires Rear: 150\/70 R 17 Total length (mm): 2,270 (F900GS), 2,300 (F900GS Adventure) Total width (mm): 943 (F900GS), 939 (F900GS Adventure) Seat height: F900GS: 34.3″ (870 mm); F900GS Adventure: 34.4″ (875 mm) DIN unladen weight, road ready: F900GS: 483 lbs (219 kg); F900GS Adventure: 542 lbs (246 kg) Permitted total weight: 445 kg (F900GS), 455 kg (F900GS Adventure) Fuel tank capacity: F900GS: 3.8 gallons (14.5L); F900GS Adventure 6.1 gallons (23L) Fuel consumption (WMTC) 1\/100 km: 4.4 CO2 g\/km: 103 Acceleration 0-100 km\/h: 3.8 seconds (F900GS), 3.7 seconds (F900GS Adventure) Top speed: 124 mph+ (190 km\/h) 2024 BMW F800GS Specs ","filter_flag":1}
{"title":"Anand Group and Korea’s HL Group ink aftermarket JV, target rapid domestic and global growth - Autocar Professional","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtaW50ZXJuYXRpb25hbC9hbmFuZC1ncm91cC1hbmQta29yZWFzLWhsLWdyb3VwLWluay1hZnRlcm1hcmtldC1qdi10YXJnZXQtcmFwaWQtZG9tZXN0aWMtYW5kLWdsb2JhbC1ncm93dGgtMTE2NzMx0gGUAWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FuYW5kLWdyb3VwLWFuZC1rb3JlYXMtaGwtZ3JvdXAtaW5rLWFmdGVybWFya2V0LWp2LXRhcmdldC1yYXBpZC1kb21lc3RpYy1hbmQtZ2xvYmFsLWdyb3d0aC0xMTY3MzE_YW1wPTE?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtaW50ZXJuYXRpb25hbC9hbmFuZC1ncm91cC1hbmQta29yZWFzLWhsLWdyb3VwLWluay1hZnRlcm1hcmtldC1qdi10YXJnZXQtcmFwaWQtZG9tZXN0aWMtYW5kLWdsb2JhbC1ncm93dGgtMTE2NzMx0gGUAWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FuYW5kLWdyb3VwLWFuZC1rb3JlYXMtaGwtZ3JvdXAtaW5rLWFmdGVybWFya2V0LWp2LXRhcmdldC1yYXBpZC1kb21lc3RpYy1hbmQtZ2xvYmFsLWdyb3d0aC0xMTY3MzE_YW1wPTE?oc=5","id":"CBMijgFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtaW50ZXJuYXRpb25hbC9hbmFuZC1ncm91cC1hbmQta29yZWFzLWhsLWdyb3VwLWluay1hZnRlcm1hcmtldC1qdi10YXJnZXQtcmFwaWQtZG9tZXN0aWMtYW5kLWdsb2JhbC1ncm93dGgtMTE2NzMx0gGUAWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FuYW5kLWdyb3VwLWFuZC1rb3JlYXMtaGwtZ3JvdXAtaW5rLWFmdGVybWFya2V0LWp2LXRhcmdldC1yYXBpZC1kb21lc3RpYy1hbmQtZ2xvYmFsLWdyb3d0aC0xMTY3MzE_YW1wPTE","guidislink":false,"published":"Wed, 13 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=256, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtaW50ZXJuYXRpb25hbC9hbmFuZC1ncm91cC1hbmQta29yZWFzLWhsLWdyb3VwLWluay1hZnRlcm1hcmtldC1qdi10YXJnZXQtcmFwaWQtZG9tZXN0aWMtYW5kLWdsb2JhbC1ncm93dGgtMTE2NzMx0gGUAWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FuYW5kLWdyb3VwLWFuZC1rb3JlYXMtaGwtZ3JvdXAtaW5rLWFmdGVybWFya2V0LWp2LXRhcmdldC1yYXBpZC1kb21lc3RpYy1hbmQtZ2xvYmFsLWdyb3d0aC0xMTY3MzE_YW1wPTE?oc=5\" target=\"_blank\">Anand Group and Korea’s HL Group ink aftermarket JV, target rapid domestic and global growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Anand Group and Korea’s HL Group ink aftermarket JV, target rapid domestic and global growth - Autocar Professional","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMijgFodHRwczovL3d3dy5hdXRvY2FycHJvLmluL25ld3MtaW50ZXJuYXRpb25hbC9hbmFuZC1ncm91cC1hbmQta29yZWFzLWhsLWdyb3VwLWluay1hZnRlcm1hcmtldC1qdi10YXJnZXQtcmFwaWQtZG9tZXN0aWMtYW5kLWdsb2JhbC1ncm93dGgtMTE2NzMx0gGUAWh0dHBzOi8vd3d3LmF1dG9jYXJwcm8uaW4vbmV3cy1pbnRlcm5hdGlvbmFsL2FuYW5kLWdyb3VwLWFuZC1rb3JlYXMtaGwtZ3JvdXAtaW5rLWFmdGVybWFya2V0LWp2LXRhcmdldC1yYXBpZC1kb21lc3RpYy1hbmQtZ2xvYmFsLWdyb3d0aC0xMTY3MzE_YW1wPTE?oc=5\" target=\"_blank\">Anand Group and Korea’s HL Group ink aftermarket JV, target rapid domestic and global growth<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Autocar Professional<\/font>","source.href":"https:\/\/www.autocarpro.in","source.title":"Autocar Professional","query":"https:\/\/news.google.com\/rss\/search?q=\"Emission Control\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"The partnership will broaden both enterprises’ aftermarket portfolios by adding new products largely for passenger vehicles, and entering new markets; JV to double Anand’s aftermarket sales in five years. The $2-billion-plus Anand Group, a leading manufacturer of world-class auto systems and components, has signed a joint venture (JV) with Korea’s $8.1-billion HL Group. The JV will increase the size of the Indian conglomerate’s aftermarket business two-fold while building the Korean entity’s presence in India. The JV will expand the aftermarket portfolio with products manufactured by Anand’s existing JVs with HL Group’s Mando Corporation, an automotive components leader based in Korea. These existing partnerships are HL Mando Anand Automotive, which makes steering, brake, and suspension systems, and Anand Mando eMobility, which manufactures motors and controllers for EVs. The partnership will be called ‘HL Anand Automotive Parts Pvt Ltd’ and provide a wide range of aftermarket components for the passenger vehicle segment in domestic and international markets. Two dedicated distribution centres will be set up for the new company in the next two years. The Seoul-based HL Group consists of 44 companies across Asia, North America, Europe, the Middle East, and South America. Speaking about the new JV, Mahendra Goyal, co-COO of Anand Group, said: “At Anand, we have a special focus on the aftermarket business and want to grow ahead of market. This strategic JV with HL Group will significantly expand our aftermarket business in both domestic and international markets. The JV will capitalise on the strong ANAND Group aftermarket ecosystem in India and HL Group’s sourcing expertise and well-established global network.” He added, “With this alliance, we expect our aftermarket business to grow at a CAGR of 15% over the next five years. The company will focus on the core products manufactured by the existing JV entities and will be free to source other products, as feasible, for growth. This JV will be selling HL Mando and Anand co-branded products, building on the brand strengths of both partners.\" The Anand Group’s basket of aftermarket products comprising of around 6,000 SKUs are well distributed by over 2,500 industry-leading channel partners and nine distribution centres located across the country. The JV further plans to add around 1,200 new SKUs in the next two years.\" Speaking about the JV, Joon-Bom Kim, CEO of HL Holdings, who signed the agreement at Anand’s New Delhi corporate headquarters late on Tuesday, with Mr. Goyal, said: “Anand Group is a highly respected auto leader in India. The coming together of HL Group, a visionary industry leader in Korea with an extensive global presence in auto and other sectors, and Anand, with its India-wide aftermarkets network, will be a positive for both businesses and help expand the opportunity-rich Indian aftermarket sector overall.” India’s auto aftermarket, which is growing at around 10% annually, is approximately Rs 85,000 crore ($10.6 billion), while the global aftermarket is estimated at around $408 billion, according to industry reports.","filter_flag":1}
{"title":"Pratik Agarwal, Managing Director, Sterlite Power - Your Gateway to Power Transmission & Distribution - T&D India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9wcmF0aWstYWdhcndhbC1tYW5hZ2luZy1kaXJlY3Rvci1zdGVybGl0ZS1wb3dlci_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9wcmF0aWstYWdhcndhbC1tYW5hZ2luZy1kaXJlY3Rvci1zdGVybGl0ZS1wb3dlci_SAQA?oc=5","id":"CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9wcmF0aWstYWdhcndhbC1tYW5hZ2luZy1kaXJlY3Rvci1zdGVybGl0ZS1wb3dlci_SAQA","guidislink":false,"published":"Tue, 12 Sep 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=9, tm_mday=12, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=255, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9wcmF0aWstYWdhcndhbC1tYW5hZ2luZy1kaXJlY3Rvci1zdGVybGl0ZS1wb3dlci_SAQA?oc=5\" target=\"_blank\">Pratik Agarwal, Managing Director, Sterlite Power - Your Gateway to Power Transmission & Distribution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Pratik Agarwal, Managing Director, Sterlite Power - Your Gateway to Power Transmission & Distribution - T&D India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiSWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9wcmF0aWstYWdhcndhbC1tYW5hZ2luZy1kaXJlY3Rvci1zdGVybGl0ZS1wb3dlci_SAQA?oc=5\" target=\"_blank\">Pratik Agarwal, Managing Director, Sterlite Power - Your Gateway to Power Transmission & Distribution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","source.href":"https:\/\/www.tndindia.com","source.title":"T&D India","query":"https:\/\/news.google.com\/rss\/search?q=\"Emission Control\" \"new products\"+after:2023-09-01+before:2023-09-30","text":"View Point Pratik Agarwal, Managing Director, Sterlite Power T&D India T&D India September 12, 2023 Share “The global focus on decarbonisation is increasing demand for our manufactured products and services, such as conductors, cables, and OPGW and the company is building a large order book for exports to developed markets. On the other hand, unprecedented growth in demand for data has put our Convergence business on a high-growth trajectory. Recently, a record Rs.75,408 crore worth of power transmission projects have been approved by the 14th NCT (National Committee on Transmission) and are likely to be awarded this year through the bidding route. With our solid track record of executing complex projects, we are well positioned to capture a sizeable chunk of this opportunity.” Also read: Pratik Agarwal Recognized As ‘CEO Of The Year’ (Pratik Agarwal, Managing Director, Sterlite Power, expressed this view while commenting on the financial results of Sterlite Power for FY23. The business highlights for Sterlite Power during FY23 included the winning of the Rs.1,500-crore Rajasthan Green Energy Corridor (Part G) project, the commissioning of the Lakadia Vadodara transmission scheme, winning of Rs.5,200 crore worth of new orders, and the commissioning of four developmental transmission projects in Brazil.)","filter_flag":1}
