{"title":"CPHI Barcelona 2023: forging collaborations for a promising future in the pharmaceutical sector - Chemistry World","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jaGVtaXN0cnl3b3JsZC5jb20vaW5kdXN0cnkvY3BoaS1iYXJjZWxvbmEtMjAyMy1mb3JnaW5nLWNvbGxhYm9yYXRpb25zLWZvci1hLXByb21pc2luZy1mdXR1cmUtaW4tdGhlLXBoYXJtYWNldXRpY2FsLXNlY3Rvci80MDE3ODg4LmFydGljbGXSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jaGVtaXN0cnl3b3JsZC5jb20vaW5kdXN0cnkvY3BoaS1iYXJjZWxvbmEtMjAyMy1mb3JnaW5nLWNvbGxhYm9yYXRpb25zLWZvci1hLXByb21pc2luZy1mdXR1cmUtaW4tdGhlLXBoYXJtYWNldXRpY2FsLXNlY3Rvci80MDE3ODg4LmFydGljbGXSAQA?oc=5","id":"CBMilgFodHRwczovL3d3dy5jaGVtaXN0cnl3b3JsZC5jb20vaW5kdXN0cnkvY3BoaS1iYXJjZWxvbmEtMjAyMy1mb3JnaW5nLWNvbGxhYm9yYXRpb25zLWZvci1hLXByb21pc2luZy1mdXR1cmUtaW4tdGhlLXBoYXJtYWNldXRpY2FsLXNlY3Rvci80MDE3ODg4LmFydGljbGXSAQA","guidislink":false,"published":"Thu, 24 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=236, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jaGVtaXN0cnl3b3JsZC5jb20vaW5kdXN0cnkvY3BoaS1iYXJjZWxvbmEtMjAyMy1mb3JnaW5nLWNvbGxhYm9yYXRpb25zLWZvci1hLXByb21pc2luZy1mdXR1cmUtaW4tdGhlLXBoYXJtYWNldXRpY2FsLXNlY3Rvci80MDE3ODg4LmFydGljbGXSAQA?oc=5\" target=\"_blank\">CPHI Barcelona 2023: forging collaborations for a promising future in the pharmaceutical sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Chemistry World<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"CPHI Barcelona 2023: forging collaborations for a promising future in the pharmaceutical sector - Chemistry World","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMilgFodHRwczovL3d3dy5jaGVtaXN0cnl3b3JsZC5jb20vaW5kdXN0cnkvY3BoaS1iYXJjZWxvbmEtMjAyMy1mb3JnaW5nLWNvbGxhYm9yYXRpb25zLWZvci1hLXByb21pc2luZy1mdXR1cmUtaW4tdGhlLXBoYXJtYWNldXRpY2FsLXNlY3Rvci80MDE3ODg4LmFydGljbGXSAQA?oc=5\" target=\"_blank\">CPHI Barcelona 2023: forging collaborations for a promising future in the pharmaceutical sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Chemistry World<\/font>","source.href":"https:\/\/www.chemistryworld.com","source.title":"Chemistry World","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"CPHI Barcelona, the renowned global pharma event, is set to take centre stage from 24–26 October 2023 at Fira Barcelona Gran Via, Spain. Building on its legacy of excellence, this year’s event promises to unite suppliers, innovators, and pharma professionals in an exceptional setting, combining the best of in-person and online experiences. CPHI Barcelona presents a unique opportunity to learn, procure, and connect with events that inspire innovation and drive change. By seamlessly blending the benefits of both digital and in-person formats, attendees develop relationships all year round. It provides unparalleled opportunities to source valuable partnerships, secure contracts, and stay ahead in a rapidly evolving industry. Whether you’re seeking to forge relationships with thought leaders, trailblazers, or innovators, this event has it all. CPHI Barcelona is designed to inspire innovation and drive change in the pharma industry Silvia Forroova, director of partnerships & sustainability, Informa Markets Silvia Forroova, director of partnerships & sustainability, Informa Markets, commented ’we are very excited to be back in Barcelona, one of Europe’s premier biotech and pharma manufacturing hubs. This year, the event will return to its former size and is designed to inspire innovation and drive change in the pharma industry. In the post-pandemic era, it’s exciting to see so many new products in clinical development and companies looking to widen and diversify their networks.’ Smart and personalised CPHI Barcelona offers different pass options to cater for your specific needs. Standard pass: for those focused on meeting people, discovering fresh innovations, and connecting with over 1,800 suppliers. Explorer pass: for those looking for more networking time with early access to the event and access to the meeting services. VIP pass: comes with exclusive privileges, grants access to VIP reserved spaces, breakfast, lunch, refreshments and more. Register for CPHI Barcelona 2023 Register now Our event planner web tool and app allows you to plan your activity at the event in advance, making your time at CPHI Barcelona more effective. Attendees can plan meetings, bookmark interesting exhibitions and products, and receive personalised recommendations from AI regarding products, exhibitions and relevant content sessions. The app also contains all event essentials in one place, including your event badge and personal schedule. This maximises your efficiency and enjoyment while reducing event stress. Not only is the event planner useful for pre-event planning, it can also be used during and after the event. During the event, you can navigate using the interactive floor plan to find the exhibits that you bookmarked ahead of time, while receiving notifications about your schedule to track meetings and sessions. Once the event is finished, you can export the contact information of the connections you made for easy follow-up calls. So, dive into the immersive event platform before the in-person event, engage with the vibrant CPHI Barcelona community, and plan your experience early. Then, at Fira Barcelona, navigate the event effortlessly through intuitive zones, attend pre-scheduled 1:1 meetings, connect with exhibitors on-the-fly, and explore seminars while sourcing new suppliers. New and cutting edge This year, CPHI Barcelona introduces the Start-Up Market, a dedicated space in Hall 3 of Fira Barcelona, where start-ups, innovators, and small enterprises from the industry can exhibit their exciting new products and solutions. The Start-Up Market is the space to visit to discover new innovations and connect with companies at the cutting edge of the pharma industry. Eligible companies classified as start-ups and active in the pharma, biopharma, digital, or medical device sectors can exhibit. The market space offers various benefits, including promotion as a show feature, access to start-up mentors, and a dedicated start-up networking lounge. Sustainable and socially responsible CPHI Barcelona is committed to organising an environmentally and socially responsible event. Efforts are being made to reduce the environmental impact, including sustainable transportation and shuttle services, the use of 100% renewable energy, and implementing initiatives to minimise single-use exhibitor stands. The event aims to support local businesses, empower communities, inspire sustainable development by celebrating initiatives through the sustainability award, and amplifying diverse voices through forums and events. Sustainability is embedded throughout CPHI Silvia Forroova Silvia Forroova explained ’there has never been a better time to attend CPHI. At the heart of pharma, we provide the vital connections that will underpin growth in pharma manufacturing in the next few years. Alongside this, we are committed to accelerating our progress in sustainability. Sustainability is embedded throughout CPHI, from our Better Stands programme to reduce waste, through to our conference content, where we are bringing industry leaders together to inspire and create conversation through a number of sessions dedicated to various aspects of sustainability.’ Comprehensive and engaging CPHI Barcelona 2023 will feature an extensive conference agenda covering a wide range of topics, including next-gen biomanufacturing, partnering for success, formulating the future, future therapies, manufacturing 4.0, patient-centric development, creating a circular economy, quality management fundamentals, and hiring for diversity. These sessions will provide valuable insights and help shape the future of the industry. The power of CPHI Barcelona extends beyond the event dates. With the event platform and CPHI Online, you can access on-demand conference content, stay connected with the CPHI community throughout the year, and fuel the growth of your business. Content overview Here are some highlights from our full conference programme. Day 1: Tuesday 24 October 2023 The first day focuses on the themes next-gen biomanufacturing, formulating the future, partnering for success, and creating a circular economy. Sheila Ann Mikhail, co-founder and former CEO of Asklepios BioPharmaceutical Inc, sets the scene for the biomanufacturing landscape with a keynote address. Later in the day, after the panel sessions, Vinay Saluja, Novartis, will give a keynote and provide a detailed appraisal on CMDO landscape. A second speaker will provide insights on sustainability in pharma. Day 1: Panel sessions Strategies for commercialising cell and gene therapies Looking to the future: what’s next for the generic drugs market? Anders Wallstron, Xbrane Biopharma AB; Unmesh Lal, Frost & Sullivan; and Magnus Blomberg, AstraZeneca Covering topics such as manufacturing challenges for autologous cell therapies and cell therapy roadmaps to address challenges and drive speed-to-market Camille Dumont, Lonza Capsules and Health Ingredients, Juan Colberg, Pfizer, and Sven Stegemann, Leibniz JointLab Tackling the issue of shortages utilising fresh formulation approaches and driving quality improvements through process control optimisation. Day 2: Wednesday 25 October 2023 The themes introduced on the second day are future therapies, manufacturing 4.0, patient centric development, and quality management fundamentals. Aser Alonso, vice president engineering & transformation, GE Healthcare, starts us off with a keynote address for drug manufacturing. There will be a groundbreaking panel in the afternoon delving into the growing role of AI as a technology to transform manufacturing efficiency, which is another topic generating much industry excitement. Samantha Parker, chief patient access officer, Innoskel, will pick up the second half of the day with a keynote address on patient centric landscape, while Elisabeth Stampa, president, Medicines for Europe, gives a keynote address on quality management fundamentals. Day 2: Panel sessions Loading potential: artificial intelligence for pharma manufacturing Industry 4.0: setting the new standard for manufacturing quality Andrew Kewson, Basilea Pharmaceutica; Guglielmo Iozzia, Merck; Sean Daughtry, Vertex Pharmaceuticals; and Aurelio Arias, IQVIA The implications of AI for improving batch manufacturing processes, defining the role of chatbots, and even potential improvements in patient engagement Lawrence De Belder, Pharmatech Associates Inc.; Isamir Martinez, ACS Green Chemistry Institute; Danita Broyles, Harmony Biosciences; and Sanjay Sharma, Dr. Reddy’s Making data actionable to improve decision-making and real-world automation, identifying the right enterprise resource planning system for supply chains and manufacturing processes, and establishing measurable KPIs. Day 3: Thursday 26 October 2023 There will be a morning programme of sessions including a sustainability workshop on the final day. Awarding excellence The CPHI Pharma Awards will mark its 20th anniversary with a grand ceremony on Tuesday 24 October 2023. This special edition will introduce three new categories, acknowledging the remarkable wave of innovation that has engulfed the industry. These categories will honour advancements in methodologies, sustainability efforts, and philanthropic initiatives. Categories Accelerating Innovation API Development & Innovation Finished Formulation Manufacturing Excellence Drug Delivery & Device Innovation Packaging & Machinery Supply Chain Excellence Sustainability Regulatory and Compliance CEO of the Year Start-Up Initiative At the Heart of Pharma","filter_flag":1}
{"title":"Exploring Beauty Trends Rooted in Natural Simplicity - Powder Bulk Solids","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvd2RlcmJ1bGtzb2xpZHMuY29tL2Nvc21ldGljcy1wZXJzb25hbC1jYXJlL2V4cGxvcmluZy1iZWF1dHktdHJlbmRzLXJvb3RlZC1pbi1uYXR1cmFsLXNpbXBsaWNpdHnSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvd2RlcmJ1bGtzb2xpZHMuY29tL2Nvc21ldGljcy1wZXJzb25hbC1jYXJlL2V4cGxvcmluZy1iZWF1dHktdHJlbmRzLXJvb3RlZC1pbi1uYXR1cmFsLXNpbXBsaWNpdHnSAQA?oc=5","id":"CBMibWh0dHBzOi8vd3d3LnBvd2RlcmJ1bGtzb2xpZHMuY29tL2Nvc21ldGljcy1wZXJzb25hbC1jYXJlL2V4cGxvcmluZy1iZWF1dHktdHJlbmRzLXJvb3RlZC1pbi1uYXR1cmFsLXNpbXBsaWNpdHnSAQA","guidislink":false,"published":"Fri, 25 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=237, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvd2RlcmJ1bGtzb2xpZHMuY29tL2Nvc21ldGljcy1wZXJzb25hbC1jYXJlL2V4cGxvcmluZy1iZWF1dHktdHJlbmRzLXJvb3RlZC1pbi1uYXR1cmFsLXNpbXBsaWNpdHnSAQA?oc=5\" target=\"_blank\">Exploring Beauty Trends Rooted in Natural Simplicity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Powder Bulk Solids<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Exploring Beauty Trends Rooted in Natural Simplicity - Powder Bulk Solids","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibWh0dHBzOi8vd3d3LnBvd2RlcmJ1bGtzb2xpZHMuY29tL2Nvc21ldGljcy1wZXJzb25hbC1jYXJlL2V4cGxvcmluZy1iZWF1dHktdHJlbmRzLXJvb3RlZC1pbi1uYXR1cmFsLXNpbXBsaWNpdHnSAQA?oc=5\" target=\"_blank\">Exploring Beauty Trends Rooted in Natural Simplicity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Powder Bulk Solids<\/font>","source.href":"https:\/\/www.powderbulksolids.com","source.title":"Powder Bulk Solids","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The beauty industry is a super-competitive business. Look at stores shelves and you will see myriad brands with new products coming out all the time — new shades\/colors, new packaging, combo products, one-ingredient items, and more. Sustainable practices are not new for beauty, and an increasing number of consumers are choosing natural, vegan, and medically approved products over the more traditional. In 2022, the beauty industry — which includes skin care, fragrance, cosmetics, and hair care — generated approximately $430 billion in revenue, according to The State of Fashion: Beauty 2023 report by McKinsey & Co. Regionally, North America is accounting for $85 billion of the industry in 2022 and expected to reach approximately $115 billion by 2027. Projected Year-over-year growth from 2022-2027 Fragrance 7% growth Cosmetics 6% growth Hair Care 6% growth Skin Care 6% growth with 45% of market value Regionally, the report shows that Middle East and Africa will grow the most at 12% YoY to 2027, with China at 8%, and APAC (not including China) at 7%. More than half of respondents to McKinsey’s 2023 global consumer survey said they use three or more brands for skin care, hair care and fragrance, while one-third use five or more brands for cosmetics. Profitable, sustained growth over the coming years will depend on supercharged innovation, according to McKinsey’s report. Brand portfolios need to adapt to rapid product lifecycles, with “hero” products no longer the primary way to win with customers. Competition is intensifying, as is consumer desire to put to work a full range of beauty products that help them to look and feel their best. 42% of survey respondents across the US, UK, France, Germany, Italy, and China say they enjoy trying new brands. – McKinsey’s The State of Fashion: Beauty 2023 report Channels Consumers readily buy beauty products at department stores, grocery stores, ecommerce, drugstores, travel retail, and specialty stores. Purchasing through e-commerce has jumped between 2015 and 2022 with a share over 20%. It is the fastest-growing segment for beauty products with YoY growth to 2027 expected at 12%. Travel retail is at 10%; specialty retail is forecast to grow 7%; grocery retail and drugstore tie at 4%; and department store and “other” will see a 2% YoY growth. Between 2015 and 2022, global e-commerce sales grew at a CAGR of 20% with significant growth during the pandemic, especially for eye makeup and skin care products (due to wearing masks). By 2022, digital shopping overtook specialty retail as the largest individual sales channel worldwide, with around one-fifth of the industry’s overall total. So far this year, 31% of digital buyers in the US spent between $1 and $50 per month on beauty products on average, a Statista report shows. Social Media To see how beauty products can be applied and how they rate with consumers, there is no other place than social media. It is the top channel for new product reviews, thanks in most part to Generation Z. These teens and 20-somethings reign supreme as beauty influencers as well as offering views on what beauty means today. Beauty companies, influencers, and consumers alike make trends known with video reviews of beauty products and application how-tos on TikTok and Instagram. In addition to the two most popular, other platforms include YouTube for even more how-to and review videos, and Facebook, and Twitter. Today, consumers are following advice from dermatologists and other medical professionals over celebrity influencers, showing that they are serious about their skin, hair, and facial needs for the future. Top 5 Beauty & Personal Care Trends Research group Euromonitor International has revealed the top 5 trends. Premiumization and affordability Ingredient-led beauty Blurring wellness spaces Supporting health & wellness From function to emotion 1. Premiumization and affordability As beauty and health products become more expensive due to recent inflation increases, consumers are forced to make more selective decisions when it comes to the products they buy. According to Euromonitor International’s Voice of the Consumer: Beauty Survey in summer 2022, more global respondents in 2022 sought out price-sensitive attributes (value for money, multi-functional benefits, low price) when shopping for skin care compared to 2021. This is an increase of approximately 2.5%. The survey results suggest that more quality seekers and premium buyers sought lower prices, such as through promotions or price-accessible brands in 2022 year compared to 2021. As 2023 progresses, the concept of “value” is expected to evolve as beauty consumers reconsider their spending habits, such as efficacy seekers being more price sensitive in 2022 vs 2021. 2. Ingredient-led beauty The use of science in beauty products is nothing new, but biotechnology is taking it to a whole new level. There are many brands today that are catering to eco-conscious consumers with products made from plant-based ingredients. This moves the needle on consumer trust of the brand due to familiarity of formulations. Beauty consumers are seeking sustainability, biotech, and international beauty concepts. Essentially combining environmental sustainability with advances in biotech, “green chemistry,” which focuses on eliminating hazardous substances and adding or replacing previous ingredients with biobased ones, has emerged as a major focus area among beauty and personal care companies. “Upcycling” is the latest green chemistry innovation, which refers to the transformation of a by-product or waste stream to a usable ingredient and is a segment that is expected to accelerate in 2023. 3. Blurring wellness spaces Driven by increasing consumer demand for holistic health and prevention since COVID-19, companies have rushed to merge traditional portfolios with emerging health needs, says Euromonitor. This has resulted in blurring of the beauty and wellness spaces. Beauty is expected to strengthen its overlap with other industries, as well. “Looking healthy” was the #1 way beauty was perceived among global consumers. – Euromonitor International’s Voice of the Consumer: Beauty Survey McKinsey’s survey show that 45% of US consumers are interested in products that are 100% natural and are cruelty-free, not tested on animals – this percentage is roughly the same across the board in UK, France, Germany, Italy, and China. And 39% of US consumers look for products that do not use ingredients harmful to the environment. The report also reveals that the wellness industry, worth $1.5 trillion, is expected to grow at a CAGR of 10% to 2027. 4. Supporting health & wellness As female empowerment and gender inclusivity widens, a greater awareness of women’s health will have a notable impact on the industry from 2023 onward. For instance, a greater understanding of how hormonal imbalances correlate with changing skin and hair needs presents prospects for alignment of beauty routines with tailored solutions across cycle care. This will be a natural extension to brand strategies that endorse a more holistic wellness-oriented approach. 5. From function to emotion Gen Z has defined the new beauty. Nearly 50% of them research beauty products extensively before purchasing, another fact from the McKinsey survey. Emotional values such as internal health benefits and social value identities have become essential factors in beauty consumers’ purchasing decisions, the Euromonitor report reveals. Neuroscience, especially brain wave detection, is starting to be used as a biometric signal to evaluate emotional functionality. The concept of “neuroscents” which elicits emotional responses that are neurologically proven, opens new opportunities for fragrance and ingredient companies to provide the product and educate consumers on this emerging segment. Mergers & Acquisitions The number of M&A in 2019 and 2022 was nearly the same (174 and 175 respectively); however, in 2022 they were worth half the average value of 2019’s deals, the McKinsey report shared. Of 139 deals that closed in 2022 and acquired stakes of 30% or more, 90% were conglomerates. To name a few bigger deals in 2022, Procter and Gamble acquired Tula, a probiotic skin care brand; Unilever acquired a majority stake in Nutrafol, which manufactures hair wellness products; L’Oréal purchased Skinbetter Science, an American skin care brand; and Estée Lauder Co. acquired Tom Ford brand, creator of fragrances and accessories. Sally Beauty — a leading retailer for salon-quality hair color, hair care, and nail products — has just entered into a retail agreement with XMONDO Color hair color brand. L'Oréal is also moving into another retail space. It's Professionnel's hair care line is now available on Sephora.com. Both reports and additional research have shown that beauty is competitive, growing, and extremely innovative. Demand will continue for beauty and personal care products that educate, delight, and provide value — both monetarily and ethically speaking.","filter_flag":1}
{"title":"Aveda anticipates 'unlimited potential and growth' in Vietnam - CosmeticsDesign-Asia.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDgvMjkvQXZlZGEtYW50aWNpcGF0ZXMtdW5saW1pdGVkLXBvdGVudGlhbC1hbmQtZ3Jvd3RoLWluLVZpZXRuYW3SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDgvMjkvQXZlZGEtYW50aWNpcGF0ZXMtdW5saW1pdGVkLXBvdGVudGlhbC1hbmQtZ3Jvd3RoLWluLVZpZXRuYW3SAQA?oc=5","id":"CBMic2h0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDgvMjkvQXZlZGEtYW50aWNpcGF0ZXMtdW5saW1pdGVkLXBvdGVudGlhbC1hbmQtZ3Jvd3RoLWluLVZpZXRuYW3SAQA","guidislink":false,"published":"Tue, 29 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=29, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=241, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDgvMjkvQXZlZGEtYW50aWNpcGF0ZXMtdW5saW1pdGVkLXBvdGVudGlhbC1hbmQtZ3Jvd3RoLWluLVZpZXRuYW3SAQA?oc=5\" target=\"_blank\">Aveda anticipates 'unlimited potential and growth' in Vietnam<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Asia.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Aveda anticipates 'unlimited potential and growth' in Vietnam - CosmeticsDesign-Asia.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMic2h0dHBzOi8vd3d3LmNvc21ldGljc2Rlc2lnbi1hc2lhLmNvbS9BcnRpY2xlLzIwMjMvMDgvMjkvQXZlZGEtYW50aWNpcGF0ZXMtdW5saW1pdGVkLXBvdGVudGlhbC1hbmQtZ3Jvd3RoLWluLVZpZXRuYW3SAQA?oc=5\" target=\"_blank\">Aveda anticipates 'unlimited potential and growth' in Vietnam<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CosmeticsDesign-Asia.com<\/font>","source.href":"https:\/\/www.cosmeticsdesign-asia.com","source.title":"CosmeticsDesign-Asia.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Green Chemistry\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"The Estée Lauder-owned brand recently launched in Vietnam across multiple channels, including brick-and-mortar retail, e-commerce, and the professional salon channel. Its official launch was marked by an event held on August 15 which highlighted Aveda's capabilities in the professional salon setting. During the event, Kelly Park, vice president and general manager of Aveda Asia Pacific, expressed excitement over Aveda’s launch in Vietnam. “Vietnam is the most vibrant market in South East Asia. It’s such an untapped opportunity. I cannot express enough how tremendously honoured and excited I am about Aveda’s launch in the Vietnam market, a place of unlimited potential and growth.​ “Vietnam is a perfect mix of professional hair care with a huge salon industry and desirability for prestige hair care. So, we believe Aveda has a huge opportunity in the Vietnam market.”​ Park told CosmeticsDesign-Asia​ that Aveda is aiming to become the top omnichannel luxury hair care brand in Vietnam. It is working to unveil more direct-to-consumer touchpoints, both online and offline. “Especially beautiful Aveda boutiques and counters at top shopping locations across Vietnam, especially Ho Chi Minh and Hanoi,” ​said Park. It was also imperative to build the vegan brand across the professional channel in Vietnam as a natural and high-performance alternative to other more conventional salon brands. “[We want Aveda] to be the top-of-mind and first-choice hair care brand among the amazing thriving community of talented hairdressers and network of salons in Vietnam because they know that they can depend on Aveda’s rituals and products to work wonders and delight consumers,” ​said Park. Trends taking root in Vietnam Aveda partnered with Singapore-based omnichannel distributor LUXASIA for its entry into Vietnam. The latter previously worked with the brand in markets including Singapore, Malaysia and the Phillippines. Speaking to us, LUXASIA echoed Aveda’s excitement and confidence in the Vietnam venture. “It’s a country with a big population and an emerging, more affluent middle class. With the urbanisation of the market, we’re seeing the modernisation of shopping malls, department stores and also salons,”​ said Dinh Nguyen, country manager of LUXASIA Vietnam. Nguyen highlighted that these emerging consumers were looking for the cream of the crop, which was now synonymous with safety and environmental responsibility. He added that Aveda’s eco-credentials totally resonated with the modern Vietnamese consumer. “The consumer today expects the best, and the best means safe beauty, cruelty-free beauty, and natural beauty. They are now starting to think about their social responsibility to the environment and are more conscious about their health,” ​he said. One of the trends taking root strongly in Vietnam is the demand for vegan products, Nguyen highlighted. “People in Vietnam were hungry for something new, and vegan is something that was totally new that attracted more knowledgeable consumers. Right now, it’s an emerging opportunity,” ​said Nguyen. In Vietnam, luxury hair care is still a nascent segment. It only accounts for 6.6% of overall premium beauty and personal care, signalling huge potential for the premium hair segment to grow. Raymond Tan, regional general manager of Aveda LUXASIA noted that many luxury brands have recognised the untapped opportunities in Vietnam and it was important for Aveda to be one of the pioneers. “This year especially, we have seen a lot of luxury brands wanting to come to Vietnam to sell. And that's why we see the opportunity for Aveda to come in as the first mover before the rest of the luxury brands come in.”​ Being first to market is also important because Vietnam does not have much retail space to offer for now. “Especially in Ho Chi Minh City, the number of quality department stores or shopping malls is quite limited. They have not been on that retail journey but in the next three to five years, you will see it moving. They are already building a lot of malls in Hanoi now,” ​said Tan. Reinventing the salon experience​ One of the most exciting channels for Aveda is the professional channel as it is able to create a new salon experience for Vietnamese consumers. Using essential oils and sprays, the brand can bring a new holistic dimension to elevate the most basic cut-and-colour sessions to a luxury hair pampering experience. “Consumers are not just simply looking for a haircut or hair-colouring session solely when they visit a salon these days. They are looking for an entire mind and body experience, a total wellness experience. Furthermore, Vietnamese consumers are increasingly desiring the luxury experience,”​ said Tan. “Using essential oils, sprays, and massages, even teas prepared for the guests, these are elements which make the Aveda experience incomparable and is truly what set it apart from the competitors.”​ Tan highlighted the importance of securing partnerships with the top-tier hair salons in Vietnam, noting that their influence will cascade down to other salons and eventually the end-consumers. “We need the very top tier salons in the market influencers. We want the leaders of this entire hair salon industry to use this brand and other will want to be part of this family too.”​ According to the firm, Aveda has experienced double-digit year-on-year growth in neighbouring SEA markets Malaysia, Singapore, and the Philippines. “The future in bright for Aveda in Vietnam as we ride on the high social media connectedness of consumers, the increasing propensity to indulge in luxury among the growing middle-class, the emerging sustainability and wellness trend which are aligned with Aveda’s brand ethos and values,” ​said Tan.","filter_flag":1}
