{"title":"Infinium Wins Energy Transition Technology of the Year at S&P Global Commodity Insights' 25th Annual Platts Global ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZmluaXVtLXdpbnMtZW5lcmd5LXRyYW5zaXRpb24tdGVjaG5vbG9neS1vZi10aGUteWVhci1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkLTMwMjAxMTgyNC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZmluaXVtLXdpbnMtZW5lcmd5LXRyYW5zaXRpb24tdGVjaG5vbG9neS1vZi10aGUteWVhci1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkLTMwMjAxMTgyNC5odG1s0gEA?oc=5","id":"CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZmluaXVtLXdpbnMtZW5lcmd5LXRyYW5zaXRpb24tdGVjaG5vbG9neS1vZi10aGUteWVhci1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkLTMwMjAxMTgyNC5odG1s0gEA","guidislink":false,"published":"Tue, 12 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=12, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=346, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZmluaXVtLXdpbnMtZW5lcmd5LXRyYW5zaXRpb24tdGVjaG5vbG9neS1vZi10aGUteWVhci1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkLTMwMjAxMTgyNC5odG1s0gEA?oc=5\" target=\"_blank\">Infinium Wins Energy Transition Technology of the Year at S&amp;P Global Commodity Insights' 25th Annual Platts Global ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Infinium Wins Energy Transition Technology of the Year at S&P Global Commodity Insights' 25th Annual Platts Global ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMitQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2luZmluaXVtLXdpbnMtZW5lcmd5LXRyYW5zaXRpb24tdGVjaG5vbG9neS1vZi10aGUteWVhci1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkLTMwMjAxMTgyNC5odG1s0gEA?oc=5\" target=\"_blank\">Infinium Wins Energy Transition Technology of the Year at S&amp;P Global Commodity Insights' 25th Annual Platts Global ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Transition\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"SACRAMENTO, Calif., Dec. 12, 2023 \/PRNewswire\/ -- Infinium, a leading electrofuels (eFuels) provider, was named Energy Transition Technology of the Year at the 25th Annual Platts Global Energy Awards. S&P Global Commodity Insights, the leading global independent provider of data, insights, analysis and benchmark prices for the commodities, energy and energy transition markets, honored industry excellence in 21 performance categories and winners from nearly a dozen countries at the Platts Global Energy Awards gala. The awards program, now in its 25th year and often described as the \"Oscars of the energy industry,\" recognizes corporate and individual innovation, leadership, and performance in the energy and petrochemicals sectors, and bestowed honors on companies from Belgium, Germany, India, Singapore, Thailand, UK, Ukraine, United Arab Emirates and US. The Platts Global Energy Awards are often described as the \"Oscars of the energy industry.\" Post this Infinium is developing next-generation fuels that will accelerate the market's progress toward achieving climate goals during the ongoing energy transition. Infinium eFuels are created using carbon dioxide (CO 2 ) that would otherwise be emitted into the atmosphere and renewable power-derived green hydrogen. Ultra-low carbon eFuels contain no sulfur and are cleaner burning than petroleum-based fuels. An independent panel of judges chose the winners of the 2023 Platts Global Energy Awards. Winners were recognized for leadership, innovation, and exemplary performance. The awards honor organizations and individuals in the energy industry who are dedicated to achieving excellence. \"Knowing the 2023 Platts Global Energy Awards program prides itself on selecting the best of the best in the energy industry, we are honored to be selected as the recipient of the Energy Transition Technology of the Year,\" said Robert Schuetzle, CEO at Infinium. \"We were in great company among the finalists who are also developing groundbreaking, innovative solutions to speed the energy transformation.\" Saugata Saha, President of S&P Global Commodity Insights, said: \"At this celebratory quarter-of-a-century milestone for the Platts Global Energy Awards, we are particularly honored by the industry's continued recognition of the program as the energy industry's longstanding premier awards event and welcome the opportunity to congratulate not only the finalists and winners of 2023 but those across the history of the event. Each has contributed not only to a better energy future, but in recent years, has demonstrated an enhanced commitment to greater community service, energy security and a more sustainable energy transition.\" For details of these and other Awards winners of this year's Platts Global Energy Awards, access the December issue of the S&P Global Commodity Insights Magazine or visit the Platts Global Energy Awards website. About S&P Global Commodity Insights At S&P Global Commodity Insights, our complete view of global energy and commodity markets enables our customers to make decisions with conviction and create long-term, sustainable value. We're a trusted connector that brings together thought leaders, market participants, governments, and regulators and we create solutions that lead to progress. Vital to navigating commodity markets, our coverage includes oil and gas, power, chemicals, metals, agriculture, shipping and energy transition. Platts® products and services, including leading benchmark price assessments in the physical commodity markets, are offered through S&P Global Commodity Insights. S&P Global Commodity Insights maintains clear structural and operational separation between its price assessment activities and the other activities carried out by S&P Global Commodity Insights and the other business divisions of S&P Global. S&P Global Commodity Insights is a division of S&P Global (NYSE: SPGI). S&P Global is the world's foremost provider of credit ratings, benchmarks, analytics and workﬂow solutions in the global capital, commodity, and automotive markets. With every one of our offerings, we help many of the world's leading organizations navigate the economic landscape so they can plan for tomorrow, today. For more information visit https:\/\/www.spglobal.com\/commodityinsights. About Infinium Infinium is an electrofuels provider on a mission to decarbonize the world. Electrofuels are a new class of synthetic fuels made using renewable power and waste carbon dioxide, not petroleum or resources needed to produce food. Infinium electrofuels can be dropped into existing trucks, planes and ships, significantly reducing harmful carbon dioxide emissions compared to fossil-based fuels. In addition to helping the transport industry meet carbon reduction goals, Infinium electrofuels are a lower carbon alternative for chemical processing, including plastics production. Learn why Amazon and other leading cleantech investors have chosen Infinium at www.infiniumco.com. SOURCE Infinium","filter_flag":1}
{"title":"Solar PV key to transforming water, energy, food crises into a nexus opportunity - pv magazine International","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIxL3NvbGFyLXB2LWtleS10by10cmFuc2Zvcm1pbmctd2F0ZXItZW5lcmd5LWZvb2QtY3Jpc2VzLWludG8tYS1uZXh1cy1vcHBvcnR1bml0eS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIxL3NvbGFyLXB2LWtleS10by10cmFuc2Zvcm1pbmctd2F0ZXItZW5lcmd5LWZvb2QtY3Jpc2VzLWludG8tYS1uZXh1cy1vcHBvcnR1bml0eS_SAQA?oc=5","id":"CBMidmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIxL3NvbGFyLXB2LWtleS10by10cmFuc2Zvcm1pbmctd2F0ZXItZW5lcmd5LWZvb2QtY3Jpc2VzLWludG8tYS1uZXh1cy1vcHBvcnR1bml0eS_SAQA","guidislink":false,"published":"Thu, 21 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=21, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=355, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIxL3NvbGFyLXB2LWtleS10by10cmFuc2Zvcm1pbmctd2F0ZXItZW5lcmd5LWZvb2QtY3Jpc2VzLWludG8tYS1uZXh1cy1vcHBvcnR1bml0eS_SAQA?oc=5\" target=\"_blank\">Solar PV key to transforming water, energy, food crises into a nexus opportunity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Solar PV key to transforming water, energy, food crises into a nexus opportunity - pv magazine International","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMidmh0dHBzOi8vd3d3LnB2LW1hZ2F6aW5lLmNvbS8yMDIzLzEyLzIxL3NvbGFyLXB2LWtleS10by10cmFuc2Zvcm1pbmctd2F0ZXItZW5lcmd5LWZvb2QtY3Jpc2VzLWludG8tYS1uZXh1cy1vcHBvcnR1bml0eS_SAQA?oc=5\" target=\"_blank\">Solar PV key to transforming water, energy, food crises into a nexus opportunity<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">pv magazine International<\/font>","source.href":"https:\/\/www.pv-magazine.com","source.title":"pv magazine International","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Transition\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"As the global community gears up for COP28, one of the most debated topics is how to support local authorities’ efforts towards a sustainable energy transition and to create high-level platforms for public-private dialogue. Yet, the silo approach to energy seems to be the most common in the discussions. To address this problem, RES4Africa calls for integrated policy actions where energy, water and food intersect and interconnect. Recognizing the intertwined connection as a cross-cutting challenge that needs to be tackled in an integrated way could reduce risk, and ensure long-term emissions target reduction. The urgency of addressing the challenges of climate change can accelerate the path towards a green and inclusive transition, by turning climate change from a water-energy-food nexus crisis to a nexus opportunity. This can happen through several PV technologies, including desalination coupled with renewables, PV shading for horticulture, and solar irrigation. The International Renewable Energy Agency (IRENA) expects solar energy development to be the dominant renewable source of electricity by 2050. The solar PV global cumulative installed capacity is expected to rise to 8,519 GW by 2050 compared to 480 GW in 2018 and reach 151 GW in 2040 in North Africa. Solar desalination RES4Africa has recently published reports on financing water-energy-food-nexus and the different business models and applications Desalination coupled with renewables Desalination currently with solar PV photovoltaics is a very widespread PV technology. It provides a promising direction for the future of water supply as a carbon-free and less energy-intensive option. This is even more true for countries where water scarcity and high availability of renewable energy sources coincide, such as Morocco. The country is endowed with tremendous solar energy potential, solid leadership in the installation and management of renewable energies, and the technical capacity to explore new advancements in the field. Moreover, this solution also appears cost-effective, given the rising prices of fossil fuels and the stable cost of PV. Morocco has a relatively low desalination capacity compared to other countries in the region; nevertheless, in 2021, the government declared the aim to achieve long-term desalination production by announcing nine new plants, expected to produce an additional water capacity of 397 Mm3\/year, representing over a 500% growth rate between 2020 and 2030 and 97% of the new capacity is disclosed to be coupled with renewable sources. Agrivoltaics Popular content Agrivoltaics combine agriculture and the generation of solar energy in the same location, adapting them to each other. RES4Africa strongly believes that combining agriculture and solar panels on the same land will allow countries in the region to harvest the sun twice, ease water stress, and land use competition while enhancing the food security of a rapidly growing population. Globally, agrivoltaics are a confirmed practice, while in the southern Mediterranean, it remains embryonic: pilot projects – funded by EU and UN agencies – are underway in Algeria, Morocco, Tunisia, Egypt, and Jordan, to assess the compatibility, efficiency, and profitability for energy and agriculture production. Deploying agrivoltaics in these countries can only happen with a political commitment from governments and institutions. Nations like France, Korea, Germany, and Japan, among others, have politically declared their interest in agrivoltaics, explicitly outlining its benefits to co-locate solar power generation and crop production. This strategic commitment enabled the speedy application of the system in the countries, and the incorporation of agrivoltaics across national strategies, plans, and policy tools, with growing public support. Author: Rima Jreich Sign up to RES4Africa’s Newsletter to learn more about its reports. RES4Africa Foundation (Renewable Energy Solutions for Africa) envisions the sustainable transformation of Africa’s electricity systems to ensure reliable and affordable electricity access for all, enabling the continent to achieve its full, resilient, inclusive and sustainable development. The Foundation’s mission is to create favorable conditions for scaling up investments in clean energy technologies to accelerate the continent’s just energy transition and transformation. See more: www.res4africa.org The views and opinions expressed in this article are the author’s own, and do not necessarily reflect those held by pv magazine.","filter_flag":1}
{"title":"TS Conductor Wins Rising Star Company at S&P Global Commodity Insights' 25th Annual Platts Global Energy Awards - PR Web","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvdHMtY29uZHVjdG9yLXdpbnMtcmlzaW5nLXN0YXItY29tcGFueS1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkcy0zMDIwMTcxMzAuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvdHMtY29uZHVjdG9yLXdpbnMtcmlzaW5nLXN0YXItY29tcGFueS1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkcy0zMDIwMTcxMzAuaHRtbNIBAA?oc=5","id":"CBMimwFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvdHMtY29uZHVjdG9yLXdpbnMtcmlzaW5nLXN0YXItY29tcGFueS1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkcy0zMDIwMTcxMzAuaHRtbNIBAA","guidislink":false,"published":"Mon, 18 Dec 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=12, tm_mday=18, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=352, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvdHMtY29uZHVjdG9yLXdpbnMtcmlzaW5nLXN0YXItY29tcGFueS1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkcy0zMDIwMTcxMzAuaHRtbNIBAA?oc=5\" target=\"_blank\">TS Conductor Wins Rising Star Company at S&amp;P Global Commodity Insights' 25th Annual Platts Global Energy Awards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Web<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TS Conductor Wins Rising Star Company at S&P Global Commodity Insights' 25th Annual Platts Global Energy Awards - PR Web","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMimwFodHRwczovL3d3dy5wcndlYi5jb20vcmVsZWFzZXMvdHMtY29uZHVjdG9yLXdpbnMtcmlzaW5nLXN0YXItY29tcGFueS1hdC1zcC1nbG9iYWwtY29tbW9kaXR5LWluc2lnaHRzLTI1dGgtYW5udWFsLXBsYXR0cy1nbG9iYWwtZW5lcmd5LWF3YXJkcy0zMDIwMTcxMzAuaHRtbNIBAA?oc=5\" target=\"_blank\">TS Conductor Wins Rising Star Company at S&amp;P Global Commodity Insights' 25th Annual Platts Global Energy Awards<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Web<\/font>","source.href":"https:\/\/www.prweb.com","source.title":"PR Web","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Transition\" \"new products\"+after:2023-12-01+before:2023-12-31","text":"\"This advanced conductor technology not only means safer and more reliable power, it also means that a clean energy future is closer and more feasible than ever.\" —Dr. Jason Huang, CEO of TS Conductor Post this TS Conductor specializes in the development and manufacturing of advanced conductors for transmission and distribution grids. Their flagship innovation lies in the production of high-performance, high-strength conductors capable of transporting three times the electricity with only half the line losses and minimal sag when compared to conventional ACSR\/ACSS conductors. TS technology can be easily installed using the same tools and techniques that line crews have been utilizing for decades. This adaptability makes their conductors applicable to both new construction and reconductoring projects. The transformative impact of TS' solutions extends beyond efficiency gains, playing a pivotal role in accelerating grid decarbonization by facilitating increased connectivity for renewable generation and mitigating current interconnection bottlenecks. Notably, this translates into heightened reliability and resilience for the grid, coupled with cost savings for utilities, enabling them to upgrade transmission and distribution infrastructure without the need for extensive tower replacements. Saugata Saha, President of S&P Global Commodity Insights, said: \"At this celebratory quarter-of-a-century milestone for the Platts Global Energy Awards, we are particularly honored by the industry's continued recognition of the program as the energy industry's longstanding premier awards event and welcome the opportunity to congratulate not only the finalists and winners of 2023 but those across the history of the event. Each has contributed not only to a better energy future, but in recent years, has demonstrated an enhanced commitment to greater community service, energy security and a more sustainable energy transition.\" An independent panel of judges chose the winners of the 2023 Platts Global Energy Awards from finalists selected from nominations that represented 33 different countries. Dr. Jason Huang, CEO of TS Conductor, said: \"It is such an honor for our company to be recognized by this team of industry leaders and experts as we work to transform the world's power grids for the better. This advanced conductor technology not only means safer and more reliable power, it also means that a clean energy future is closer and more feasible than ever.\" TS technology has been deployed by utilities nationwide, including Basin Electric Power Cooperative in North Dakota, Montana-Dakota Utilities Company (MDU), NextEra Energy, SRP in Arizona, and Tennessee Valley Authority (TVA). TS is currently finalizing site selection for a second U.S. facility, which is planned to be a production mega-site with the capacity to make up to 50,000 miles of conductors annually. TS is backed by investors such as Breakthrough Energy Ventures, National Grid Partners, NextEra Energy, and others. Series B financing is currently underway. To learn more about TS Conductor solutions, visit www.tsconductor.com or contact the team at www.tsconductor.com\/contact. For details on all of the winners of this year's Platts Global Energy Awards, access the December issue of the S&P Global Commodity Insights Magazine or visit the Platts Global Energy Awards website. About TS Conductor TS Conductor products allow transmission & distribution grid operators to be active participants to the energy transition – by reducing line losses and accelerating the integration of wind, solar, and battery storage — while leveraging existing infrastructure assets. Our products can be used to substitute ACSR conductors using the same tools and installation procedures. TS Conductor is a Minority Business Enterprise (MBE), and a public benefit company focused on sustainable development and GHG reduction. TS is backed by Breakthrough Energy Ventures, National Grid and NextEra. For more information, visit www.tsconductor.com. About S&P Global Commodity Insights At S&P Global Commodity Insights, our complete view of global energy and commodity markets enables our customers to make decisions with conviction and create long-term, sustainable value. We're a trusted connector that brings together thought leaders, market participants, governments, and regulators and we create solutions that lead to progress. Vital to navigating commodity markets, our coverage includes oil and gas, power, chemicals, metals, agriculture, shipping and energy transition. Platts® products and services, including leading benchmark price assessments in the physical commodity markets, are offered through S&P Global Commodity Insights. S&P Global Commodity Insights maintains clear structural and operational separation between its price assessment activities and the other activities carried out by S&P Global Commodity Insights and the other business divisions of S&P Global. S&P Global Commodity Insights is a division of S&P Global (NYSE: SPGI). S&P Global is the world's foremost provider of credit ratings, benchmarks, analytics and workﬂow solutions in the global capital, commodity and automotive markets. With every one of our offerings, we help many of the world's leading organizations navigate the economic landscape so they can plan for tomorrow, today. For more information visit https:\/\/www.spglobal.com\/commodityinsights. Media Contact Logan Varsano, Inflection Point Agency for TS Conductor, 1 714-842-3389, [email protected], https:\/\/tsconductor.com\/ SOURCE TS Conductor","filter_flag":1}
