{"title":"Packaging legislation taking hold in US - BakingBusiness.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81ODc4Ny1wYWNrYWdpbmctbGVnaXNsYXRpb24tdGFraW5nLWhvbGQtaW4tdXPSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81ODc4Ny1wYWNrYWdpbmctbGVnaXNsYXRpb24tdGFraW5nLWhvbGQtaW4tdXPSAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81ODc4Ny1wYWNrYWdpbmctbGVnaXNsYXRpb24tdGFraW5nLWhvbGQtaW4tdXPSAQA","guidislink":false,"published":"Mon, 03 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=3, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=93, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81ODc4Ny1wYWNrYWdpbmctbGVnaXNsYXRpb24tdGFraW5nLWhvbGQtaW4tdXPSAQA?oc=5\" target=\"_blank\">Packaging legislation taking hold in US<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BakingBusiness.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Packaging legislation taking hold in US - BakingBusiness.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LmJha2luZ2J1c2luZXNzLmNvbS9hcnRpY2xlcy81ODc4Ny1wYWNrYWdpbmctbGVnaXNsYXRpb24tdGFraW5nLWhvbGQtaW4tdXPSAQA?oc=5\" target=\"_blank\">Packaging legislation taking hold in US<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BakingBusiness.com<\/font>","source.href":"https:\/\/www.bakingbusiness.com","source.title":"BakingBusiness.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"AMELIA ISLAND, FLA. — State by state, the United States is introducing and passing legislation to implement Extended Producer Responsibility (EPR). At the American Bakers Association (ABA) Convention, held March 26-28, Dan Felton, executive director of AMERIPEN, and Kelly Smith, vice president of institutional affairs at Ferrero USA, Parsippany, NJ, spoke with Rasma Zvaners, vice president of regulatory and technical services, ABA, about the growing issue. EPR legislation isn’t new on a global scale. The first programs appeared in Europe in 2000 and have spread throughout the world including Canada, and in the past two years four bills have been passed into law in four states: Maine, Oregon, Colorado and California. EPR is a policy mechanism that shifts the responsibility of products’ end of life from consumers and government to the producer. Producers pay fees into an organization that sets up the recovery and recycling of the products at the end of life. “We have a lot of EPR in the U.S. for hard-to-recycle items like carpet, paint, batters and light bulbs,” Mr. Felton explained. Never before, however, has packaging been a part of these programs, until now. The laws already passed and the 35+ bills in motion now across at least 16 states all would require branded companies responsible for packaging to pay fees to these organizations, most likely starting in 2025, based on packaging material, weight, size and other parameters. “For anyone who follows politics in the way ABA does, this is moving really fast for a very complicated issue,” he said. “We’re expecting to see one or two more bills enacted into law this year, though which states changes from day to day.” These bills are complicated and will require companies to pay fees that currently aren’t fully understood. “We’re still working to figure out how much we’ll be paying,” said Ms. Smith, who is familiar with Canada’s EPR fees through Ferrero’s global business. “They could be $1 million or $20 million. It depends on the states, their laws, the packaging design, and the materials used.” Much of this confusion stems from the fact that there is no uniformity between states. Mr. Felton said some guidance around definitions from the federal government or support could at least provide some clarity and ensure every state’s legislation is on the same page. An ideal bill would place much of the control of the EPR programs in the hands of the producers. “Industry is willing to accept these policies and the fact that they will also help companies meet their ESG goals, but we also want some control over the program,” he said. “We also want it to cover all packaging materials as that provides strength in numbers and will help everybody. Let the producers figure it out based on states, current and future packaging materials, needs and performance goals.” He also pointed out that there should be some input from different levels of government and the consumer since the consumer ultimately decides what to do with packaging at the end of its life. Preparing for the implementation of current and future legislation, however, Ms. Smith encouraged companies to create an internal team to ensure that the company is paying the correct fees and is in compliance with EPR programs. Many different departments within the company will be affected: legal, regulatory, supply chain, packaging, finance and government affairs. Bringing them together can help manage the load. “There are 40 million people in California, and you hope they’re all buying your products,” she said. “But 40 million people across all of your SKUs, that’s a lot of packaging and a lot of calculations.” As companies consider their approach, they can also look to future packaging needs and ESG plans and look for ways to invest in more sustainable packaging to mitigate these costs. Compostable or recyclable packaging can provide credits that reduce fees companies will have to pay out.","filter_flag":1}
{"title":"US plastics recycling rebounds from pandemic lows - Plastics Recycling Update","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9wbGFzdGljcy8yMDIzLzA0LzExL3VzLXBsYXN0aWNzLXJlY3ljbGluZy1yZWJvdW5kcy1mcm9tLXBhbmRlbWljLWxvd3Mv0gFlaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3BsYXN0aWNzLzIwMjMvMDQvMTEvdXMtcGxhc3RpY3MtcmVjeWNsaW5nLXJlYm91bmRzLWZyb20tcGFuZGVtaWMtbG93cy8?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9wbGFzdGljcy8yMDIzLzA0LzExL3VzLXBsYXN0aWNzLXJlY3ljbGluZy1yZWJvdW5kcy1mcm9tLXBhbmRlbWljLWxvd3Mv0gFlaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3BsYXN0aWNzLzIwMjMvMDQvMTEvdXMtcGxhc3RpY3MtcmVjeWNsaW5nLXJlYm91bmRzLWZyb20tcGFuZGVtaWMtbG93cy8?oc=5","id":"CBMiZWh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9wbGFzdGljcy8yMDIzLzA0LzExL3VzLXBsYXN0aWNzLXJlY3ljbGluZy1yZWJvdW5kcy1mcm9tLXBhbmRlbWljLWxvd3Mv0gFlaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3BsYXN0aWNzLzIwMjMvMDQvMTEvdXMtcGxhc3RpY3MtcmVjeWNsaW5nLXJlYm91bmRzLWZyb20tcGFuZGVtaWMtbG93cy8","guidislink":false,"published":"Tue, 11 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=101, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9wbGFzdGljcy8yMDIzLzA0LzExL3VzLXBsYXN0aWNzLXJlY3ljbGluZy1yZWJvdW5kcy1mcm9tLXBhbmRlbWljLWxvd3Mv0gFlaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3BsYXN0aWNzLzIwMjMvMDQvMTEvdXMtcGxhc3RpY3MtcmVjeWNsaW5nLXJlYm91bmRzLWZyb20tcGFuZGVtaWMtbG93cy8?oc=5\" target=\"_blank\">US plastics recycling rebounds from pandemic lows<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Plastics Recycling Update<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"US plastics recycling rebounds from pandemic lows - Plastics Recycling Update","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiZWh0dHBzOi8vcmVzb3VyY2UtcmVjeWNsaW5nLmNvbS9wbGFzdGljcy8yMDIzLzA0LzExL3VzLXBsYXN0aWNzLXJlY3ljbGluZy1yZWJvdW5kcy1mcm9tLXBhbmRlbWljLWxvd3Mv0gFlaHR0cHM6Ly9yZXNvdXJjZS1yZWN5Y2xpbmcuY29tL3BsYXN0aWNzLzIwMjMvMDQvMTEvdXMtcGxhc3RpY3MtcmVjeWNsaW5nLXJlYm91bmRzLWZyb20tcGFuZGVtaWMtbG93cy8?oc=5\" target=\"_blank\">US plastics recycling rebounds from pandemic lows<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Plastics Recycling Update<\/font>","source.href":"https:\/\/resource-recycling.com","source.title":"Plastics Recycling Update","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"The U.S. plastic bottle recycling rate was 28.2% in 2021, up 1 percentage point from a year earlier, according to an industry report released April 11. The increase in the bottle recycling rate was driven by PET bottles, the data shows. The country recycled about 28.7% of PET bottles in 2021, up 1.6 percentage points from 2020. The HDPE bottle recycling rate was 28.9%, which was roughly flat from the year before. PP and other polymers made up an extremely small percentage of other containers. The report was released today by the Association of Plastic Recyclers (APR), the Institute of Scrap Recycling Industries (ISRI) and the U.S. Plastics Pact. The Recycling Partnership also contributed funding to the research, which was conducted by Stina Inc. using surveys conducted by Stina and the National Association for PET Container Resources (NAPCOR). (APR owns Resource Recycling, Inc., publisher of Plastics Recycling Update.) In addition to recycling rates, the study shows an overall increase in weights of plastic recovered in 2021, reflecting a bounceback from the pandemic dip in 2020. In 2021, 5.08 billion pounds total were recovered for recycling, up 5.8% from the year before. That weight includes bottles, non-bottle rigid plastics, film and other plastic, but it excludes foam. “The 2021 rate report shows the strength of the recycling industry, as they face ongoing challenges including competition with low disposal costs, collection rates and virgin resin prices,” Steve Alexander, APR’s president and CEO, stated in a press release. HDPE volume down Within the total weight recycled, there was good news and bad news, however. The weight of PET bottles recycled came in at 1.93 billion pounds, up 9.3% from the year before. But the weight of HDPE bottles recovered was 927 million pounds, down 1.7% from 2020. The analysis also showed that domestic reclaimers continue to handle the vast majority of post-consumer plastic recovered here. Overall across all categories, 92.3% of recovered plastic was purchased by domestic reclaimers, and 7.7% was exported in 2021. That breakdown is the result of a trend going back several years. In the release, Alexander said that to achieve larger recycling increases, public policy is needed to drive systemic change and improve collection and sortation and stabilize demand for recycled resins. “APR is supportive of extended producer responsibility (EPR) laws and recycled post-consumer content requirements recently enacted in several states,” he stated. “APR also supports a national bottle bill and other federal legislation that can drive change through a combination of supply and demand policies, targeted funding and incentives, as well as streamlined collection programs.” In the release, ISRI’s president, Robin Wiener, said the recycling industry is doing more than ever to reduce waste. “Our goal is to make the supply chain ever more sustainable by providing manufacturers with high-quality material and reducing the need to extract natural resources to make new products we rely on every day,” she stated. The U.S. Plastic Pact is an organization that unites businesses, nonprofits, government agencies and research institutions as it works to carry out goals outlined by the Ellen MacArthur Foundation’s New Plastics Economy Initiative. Members include a number of major consumer product brand owners. “The U.S. Plastics Pact is working to raise the quality and quantity of post-consumer recycled plastics, particularly for PET and HDPE packaging, which make up the largest tonnages of packaging represented by our members,” Emily Tipaldo, U.S. Plastics Pact executive director, stated in the press release. “If we expect to achieve true recyclability, we need high demand for recycled plastics. Achieving true recyclability, as well as using higher percentages of PCR requires significantly greater tonnages of recycled plastics.” More stories about research","filter_flag":1}
{"title":"Chile's Atacama Desert has become a fast fashion dumping ground - National Geographic","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5jb20vZW52aXJvbm1lbnQvYXJ0aWNsZS9jaGlsZS1mYXNoaW9uLXBvbGx1dGlvbtIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5jb20vZW52aXJvbm1lbnQvYXJ0aWNsZS9jaGlsZS1mYXNoaW9uLXBvbGx1dGlvbtIBAA?oc=5","id":"CBMiTmh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5jb20vZW52aXJvbm1lbnQvYXJ0aWNsZS9jaGlsZS1mYXNoaW9uLXBvbGx1dGlvbtIBAA","guidislink":false,"published":"Mon, 10 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=10, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=100, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5jb20vZW52aXJvbm1lbnQvYXJ0aWNsZS9jaGlsZS1mYXNoaW9uLXBvbGx1dGlvbtIBAA?oc=5\" target=\"_blank\">Chile's Atacama Desert has become a fast fashion dumping ground<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Geographic<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Chile's Atacama Desert has become a fast fashion dumping ground - National Geographic","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTmh0dHBzOi8vd3d3Lm5hdGlvbmFsZ2VvZ3JhcGhpYy5jb20vZW52aXJvbm1lbnQvYXJ0aWNsZS9jaGlsZS1mYXNoaW9uLXBvbGx1dGlvbtIBAA?oc=5\" target=\"_blank\">Chile's Atacama Desert has become a fast fashion dumping ground<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">National Geographic<\/font>","source.href":"https:\/\/www.nationalgeographic.com","source.title":"National Geographic","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"The scene in northern Chile has been dubbed in one online video “the great fashion garbage patch,” a terrestrial variation of the better-known Great Pacific Garbage Patch. Colossal piles of discarded clothes, with labels from all over the world, stretch as far as the eye can see on the outskirts of Alto Hospicio, a hardscrabble city of 120,000 residents. In one ravine, a pile of jeans and suit jackets, bleached by the harsh sun, rises above a mound of fake-fur coats and dress shirts, some still bearing price tags. Bottles, bags, and other trash are mixed in. As images of the clothing heaps spread on the internet, many Chileans expressed surprise. “I was shocked to think that we were becoming the textile dump for developed countries,” says Franklin Zepeda, a director of a company that focuses on circular economic practices. But the story of how the South American nation came to be a repository for the world’s apparel rejects has as much to do with globalization and trade as it does with fleeting style trends. Fuel their curiosity with your gift GIVE NAT GEO At first glance, it might seem that an isolated desert nearly a thousand miles from Chile’s population centers would be an unlikely destination for fast fashion’s discards, but the country is also home to one of South America’s largest duty-free ports—located in the coastal city of Iquique on the Atacama’s western edge. Millions of tons of clothes arrive annually from Europe, Asia, and the Americas. Last year’s tally was 46 million tons, according to Chilean customs statistics.","filter_flag":1}
{"title":"These organizations are trying to tackle plastic pollution and poverty at the same time - CNBC","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDYvcGxhc3RpYy1wb2xsdXRpb24tY3JlZGl0cy1jb3VsZC1iZS10aGUtbmV3LWNhcmJvbi1vZmZzZXRzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8wNi9wbGFzdGljLXBvbGx1dGlvbi1jcmVkaXRzLWNvdWxkLWJlLXRoZS1uZXctY2FyYm9uLW9mZnNldHMuaHRtbA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDYvcGxhc3RpYy1wb2xsdXRpb24tY3JlZGl0cy1jb3VsZC1iZS10aGUtbmV3LWNhcmJvbi1vZmZzZXRzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8wNi9wbGFzdGljLXBvbGx1dGlvbi1jcmVkaXRzLWNvdWxkLWJlLXRoZS1uZXctY2FyYm9uLW9mZnNldHMuaHRtbA?oc=5","id":"CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDYvcGxhc3RpYy1wb2xsdXRpb24tY3JlZGl0cy1jb3VsZC1iZS10aGUtbmV3LWNhcmJvbi1vZmZzZXRzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8wNi9wbGFzdGljLXBvbGx1dGlvbi1jcmVkaXRzLWNvdWxkLWJlLXRoZS1uZXctY2FyYm9uLW9mZnNldHMuaHRtbA","guidislink":false,"published":"Thu, 06 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=96, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDYvcGxhc3RpYy1wb2xsdXRpb24tY3JlZGl0cy1jb3VsZC1iZS10aGUtbmV3LWNhcmJvbi1vZmZzZXRzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8wNi9wbGFzdGljLXBvbGx1dGlvbi1jcmVkaXRzLWNvdWxkLWJlLXRoZS1uZXctY2FyYm9uLW9mZnNldHMuaHRtbA?oc=5\" target=\"_blank\">These organizations are trying to tackle plastic pollution and poverty at the same time<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"These organizations are trying to tackle plastic pollution and poverty at the same time - CNBC","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDYvcGxhc3RpYy1wb2xsdXRpb24tY3JlZGl0cy1jb3VsZC1iZS10aGUtbmV3LWNhcmJvbi1vZmZzZXRzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8wNi9wbGFzdGljLXBvbGx1dGlvbi1jcmVkaXRzLWNvdWxkLWJlLXRoZS1uZXctY2FyYm9uLW9mZnNldHMuaHRtbA?oc=5\" target=\"_blank\">These organizations are trying to tackle plastic pollution and poverty at the same time<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC<\/font>","source.href":"https:\/\/www.cnbc.com","source.title":"CNBC","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Humanity has produced over 9.5 billion metric tons of plastic. That's over one metric ton, aka 2,200 pounds, per each of the Earth's 7.9 billion inhabitants. That plastic doesn't go away. \"All the plastic we've ever produced since the inception of the material is still here,\" said David Katz, Founder and Chairman of Plastic Bank, a company that's trying to implement plastic recycling systems in developing nations. \"If you yourself remember a small toy you played with when you were a child, it's still here somewhere. Remember that coffee cup lid that you took 10 years ago? It's here somewhere still, too.\" Globally, only about 9% of plastic is recycled. But that's not generally because the recycling technology is lacking. It's usually because it's not economically feasible to collect, clean and sort plastic waste — at least not in the U.S., where new plastic is cheaper. Katz said he's found a way to make the economics work in developing nations where Plastic Bank operates, including Brazil, Egypt, Indonesia, and the Philippines. It goes like this: Plastic Bank's partner companies help fund informal waste collection efforts in one or more of the countries where it operates. Local plastic collectors pick up plastic in their area. That plastic might otherwise end up in the ocean, since the organization operates in communities within 50 kilometers of a waterway. These informal waste workers often clean and sort their material before dropping it off at Plastic Bank collection centers, where it's weighed and sent to local processors. There, it's further sorted and shredded into flakes. Local processors might turn the flakes into pellets or ship them overseas to be turned into pellets. Some of Plastic Bank's partners then buy the recycled material at a premium for use in their new products. The plastic collectors are paid for the market value of the material, plus a premium that Plastic Bank provides, allowing some of the world's poorest to support themselves through plastic collection alone. Asis Wijayanto and his wife Atmawati support themselves and their daughter by collecting plastic with Plastic Bank. They live in Bali, Indonesia. Ruda Putra \"The money we earn from collecting plastic is used to support our family's daily necessities and to pay our daughter's tuition fee,\" said Atmawati, a waste collector CNBC spoke with in Indonesia who collects and sorts plastic with her husband. And Plastic Bank profits too. Katz said the company is estimating it will bring in $60 million in revenue this year. Ultimately, this all works because it's cheaper to pay informal and low-wage workers in developing nations to collect and recycle plastic than it is to pay for municipal recycling infrastructure in wealthier countries. Even though recycled plastic still generally costs more, Plastic Bank partners such as cleaning supplies manufacturer SC Johnson and German multinational consumer goods company Henkel are willing to pay a premium for the green credentials. Plastic credits But only about 20% of Plastic Bank's partners are actually buying recycled plastic for use in new products. The other 80% are buying plastic credits, meant to help offset their new plastic production by funding recycling efforts in the countries where Plastic Bank operates. Both types of partnerships support waste collection and recycling, but Alix Grabowski, director of plastic and material science at the World Wildlife Fund, said it's far preferable to use recycled plastic rather than pay for offsets. \"We need to make sure that plastic credits don't enable business as usual,\" Grabowski said. \"We really want to see that companies are first really cleaning up their own house, right? Looking at their own portfolio, making reductions, and working on things like reuse and thinking about changing to responsible sources for the plastic that they do need before they're looking at something like credits.\" The whole concept of plastic credits is born out of the voluntary carbon credits and offsets market, which has long been plagued with questions around efficacy. Verra, a nonprofit organization that operates one of the most widely used carbon crediting programs, is now working to develop standards for the plastic credits market. Yet just a few months ago a Guardian investigation found that the great majority of Verra's certified rainforest carbon offsets are worthless, findings that Verra described as \"patently unreliable.\" But the plastic credits and carbon credits markets do have some key differences, said Svanika Balasubramanian, co-founder and CEO of rePurpose Global, a for-profit company that sells plastic credits to companies looking to measure and reduce their plastic footprint. \"We're not thinking about avoidance, we're thinking about actual recovery, right? So we're not calculating what was avoided from the oceans. In a sense, we're actually calculating what we recovered. And so the math becomes a lot easier.\" Like Plastic Bank, RePurpose's partners generate credits by funding plastic recovery and recycling projects largely in the developing world. While Plastic Bank works solely with informal waste workers, RePurpose works with a variety of in-country partners to address gaps in local waste management infrastructure. Workers with RePurpose Global's partner organization Green Worms collect plastic in Kerala, India. RePurpose Global \"And so these can be nonprofits, these can be private sector waste management organizations, these can be waste worker unions and cooperatives,\" Balasubramanian said. RePurpose also helps brands identify how they can reduce their use of new plastic or use alternative packaging materials, but unlike Plastic Bank it doesn't sell recycled plastic. RePurpose wouldn't reveal its revenue, but said it's upward of $1 million and growing quickly. Companies that buy credits from Plastic Bank and RePurpose can be certified as Plastic Neutral or Plastic Net-Zero, meaning they're removing as much plastic from the environment as they're producing. But the WWF opposes terms like these — borrowed lingo from the carbon credits market that Grabowski said is misleading. \"So if you bought a plastic product and it said that it was plastic neutral, what would you interpret that to mean? Would you think that that meant this product has no impact? Because that isn't true [...] 99% of plastic is made from fossil fuels,\" Grabowski explained. \"It impacts our climate. It impacts communities around the world. And the fact that someone cleaned that piece up does not negate all of this other life cycle impacts.\" Looking forward","filter_flag":1}
{"title":"Global E-waste Management Market to grow at 12.82% through 2023-28 to be valued at USD 122.48 Billion: Bonafide ... - GlobeNewswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiwQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNC8yNjUyNDUyLzAvZW4vR2xvYmFsLUUtd2FzdGUtTWFuYWdlbWVudC1NYXJrZXQtdG8tZ3Jvdy1hdC0xMi04Mi10aHJvdWdoLTIwMjMtMjgtdG8tYmUtdmFsdWVkLWF0LVVTRC0xMjItNDgtQmlsbGlvbi1Cb25hZmlkZS1SZXNlYXJjaC5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiwQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNC8yNjUyNDUyLzAvZW4vR2xvYmFsLUUtd2FzdGUtTWFuYWdlbWVudC1NYXJrZXQtdG8tZ3Jvdy1hdC0xMi04Mi10aHJvdWdoLTIwMjMtMjgtdG8tYmUtdmFsdWVkLWF0LVVTRC0xMjItNDgtQmlsbGlvbi1Cb25hZmlkZS1SZXNlYXJjaC5odG1s0gEA?oc=5","id":"CBMiwQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNC8yNjUyNDUyLzAvZW4vR2xvYmFsLUUtd2FzdGUtTWFuYWdlbWVudC1NYXJrZXQtdG8tZ3Jvdy1hdC0xMi04Mi10aHJvdWdoLTIwMjMtMjgtdG8tYmUtdmFsdWVkLWF0LVVTRC0xMjItNDgtQmlsbGlvbi1Cb25hZmlkZS1SZXNlYXJjaC5odG1s0gEA","guidislink":false,"published":"Mon, 24 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=114, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiwQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNC8yNjUyNDUyLzAvZW4vR2xvYmFsLUUtd2FzdGUtTWFuYWdlbWVudC1NYXJrZXQtdG8tZ3Jvdy1hdC0xMi04Mi10aHJvdWdoLTIwMjMtMjgtdG8tYmUtdmFsdWVkLWF0LVVTRC0xMjItNDgtQmlsbGlvbi1Cb25hZmlkZS1SZXNlYXJjaC5odG1s0gEA?oc=5\" target=\"_blank\">Global E-waste Management Market to grow at 12.82% through 2023-28 to be valued at USD 122.48 Billion: Bonafide ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global E-waste Management Market to grow at 12.82% through 2023-28 to be valued at USD 122.48 Billion: Bonafide ... - GlobeNewswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiwQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8yNC8yNjUyNDUyLzAvZW4vR2xvYmFsLUUtd2FzdGUtTWFuYWdlbWVudC1NYXJrZXQtdG8tZ3Jvdy1hdC0xMi04Mi10aHJvdWdoLTIwMjMtMjgtdG8tYmUtdmFsdWVkLWF0LVVTRC0xMjItNDgtQmlsbGlvbi1Cb25hZmlkZS1SZXNlYXJjaC5odG1s0gEA?oc=5\" target=\"_blank\">Global E-waste Management Market to grow at 12.82% through 2023-28 to be valued at USD 122.48 Billion: Bonafide ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">GlobeNewswire<\/font>","source.href":"https:\/\/www.globenewswire.com","source.title":"GlobeNewswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Clifton, New Jersey, April 24, 2023 (GLOBE NEWSWIRE) -- The e-waste management market is expanding rapidly as electronic devices become ubiquitous in our daily lives. The rapid pace of technological innovation results in quickly replaced and obsolete models, leading to a growing amount of electronic waste. It has become imperative to dispose of the e-waste generated by the recycling of electronic devices, which can contain hazardous materials that can harm the environment and human health. As awareness of the importance of e-waste management grows, governments and businesses around the world are investing in the development of more efficient and effective methods for managing e-waste. Furthermore, e-waste often contains valuable materials such as gold, silver, and copper, which can be recovered and reused, reducing the need for new raw materials and the environmental impacts associated with their extraction. Key Takeaways: The Asia Pacific region leads with 38.65%, as China and India generate high volumes of e-waste and are also illegal dumping grounds for Western countries. E-waste management for Printed Circuit Boards, Batteries, Cables and Wires, Ferrous and Non-Ferrous Metals, and Hazardous and Toxic Substances is anticipated to rise rapidly at a CAGR of 14.81%. Household appliances like air conditioners, dishwashers, clothes dryers, refrigerators, kitchen stoves, water heaters, washing machines, etc. generate 54.82% of e-waste. Brazil contributes 38.08% of South America's e-waste market whereas Saudi Arabia contributes 35.89% of Middle East & Africa`s e-waste management revenue in 2022. Get a free sample report: https:\/\/www.bonafideresearch.com\/product\/230139921\/global-e-waste-management-market IoT sensors and blockchain technology are being used to track e-waste throughout the supply chain, providing real-time data on the location and condition of e-waste and enabling more efficient and transparent management of e-waste. Robotics and automation are being used to improve the efficiency and safety of e-waste processing, reducing the need for manual labor and improving resource recovery rates. AI and machine learning are being used to optimize e-waste processing and resource recovery. Data analytics is being used to track e-waste flows. 3D printing is being used to create new products using chemical processes to recover valuable materials from e-waste. These technological trends drive innovation in the e-waste management industry, creating new opportunities for companies to improve the efficiency and sustainability of e-waste management and support the transition to a more circular economy. Many companies are not fully aware of the environmental and health risks associated with the improper disposal of e-waste, which can lead to inadequate e-waste management practices. E-waste management is subject to a complex web of regulations at the national and international levels, which can be challenging for companies to navigate and comply with. E-waste management requires specialized equipment and expertise for the safe and efficient collection and transportation of electronic devices, which can be difficult and costly for companies to implement. Electronic devices often contain sensitive information, such as personal and financial data, that must be protected during the e-waste management process to prevent data breaches. E-waste management can be expensive, particularly for companies that generate large quantities of electronic waste. The costs associated with collection, transportation, and recycling can be a significant burden for companies. Many companies operate in global supply chains, which can complicate e-waste management efforts. Ensuring e-waste is properly managed throughout the supply chain can be challenging and requires coordination and collaboration with suppliers and partners. Addressing these challenges requires a comprehensive approach to e-waste management that includes regulatory compliance, stakeholder engagement, and investment in specialized equipment and expertise. Companies can also benefit from collaboration with other organizations and industry associations to share knowledge and best practices in e-waste management. “The e-waste recycling industry presents a significant opportunity for companies to not only make a positive impact on the environment but also to benefit financially from the valuable materials contained in these products. At present the recycled e-waste amounts to USD 12 Billion. There is a growing demand for companies to offer certified e-waste recycling services to ensure that the materials are being disposed of properly and safely. E-waste management brings new opportunities for reuse and recycling, leading to a circular economy.” Says, Mr. Dhwipal Shah, Research Director with Bonafide Research, a research-based consulting firm. For a detailed TOC: https:\/\/www.bonafideresearch.com\/product\/230139921\/global-e-waste-management-market The United Nations Sustainable Development Goals (SDGs) also include targets related to e-waste management. Specifically, Target 12.5 aims to substantially reduce waste generation through prevention, reduction, recycling, and reuse by 2030, while Target 8.4 aims to promote sustainable economic growth by improving resource efficiency and reducing waste generation. Household appliances are typically large and complex, containing a wide range of materials, including plastics, metals, glass, and electronic circuit boards. Industrial electronics used in manufacturing, construction, and other industries, such as control systems, measurement instruments, and electronic machinery, are another major source of e-waste management. These devices often have a short lifespan and are frequently replaced as technology advances, resulting in a significant amount of e-waste being generated. These contain hazardous materials, such as lead, mercury, and cadmium, which can pose a threat to the environment and human health if not managed properly. There are several other types of products that generate significant amounts of e-waste, like IT and telecommunications equipment, medical devices, lighting equipment, electrical and electronic tools, toys, and leisure and sports equipment. Get customized report as per requirement: https:\/\/www.bonafideresearch.com\/product\/customize\/230139921\/global-e-waste-management-market As per United Nations Study on e-waste management statistics: Country Million tones Year US 6.9 2020 China 9.0718 2020 Saudi Arabia 0.171 2019 Japan 2.1 2019 UK 1.4515 2019 India 2.903 2019 South Korea 0.721 2019 The majority of countries in the world have an effective national program for e-waste management and recycling based on the principle of extended producer responsibility (EPR). Under the program, all producers of electronic products are required to register with their respective government bodies and participate in a collective recycling system. The countries have also banned the export of e-waste to non-OECD countries and require exporters to obtain a permit from the FOEN for the export of e-waste to OECD countries. However, most of the e-waste generated in North America, West Europe, Australia, Japan, and South Korea is dumped illegally in India, China, Thailand, Vietnam, Brazil, Mexico, Egypt, Ghana, Nigeria, and the Ivory Coast. The high amount of e-waste generated in the US amounts to one-fourth of the global market share. This can be attributed to several factors, including the large and growing population, high levels of consumption of electronic devices, and relatively short product lifecycles. However, the US does have a relatively mature e-waste management industry compared to many other countries, with a number of established companies and regulations in place to manage the disposal and recycling of electronic waste. Despite several measures, e-waste management in China still faces several challenges, including illegal dumping, informal recycling, and inadequate infrastructure in some regions. Sony, Panasonic, and Mitsubishi Electric are Japanese companies with an established recycling program for their products. Recycle One and Eco-System is specialized companies in e-waste recycling, and each operates several recycling facilities in the country. Electronic waste is a growing problem in India , as the country is one of the largest generators of e-waste in the world. E-waste management in India is primarily governed by the E-Waste (Management and Handling) Rules, 2011. The government has also launched programs to encourage the refurbishment and reuse of electronic devices and to support the development of a circular economy for e-waste management. To access the complete report: https:\/\/www.bonafideresearch.com\/product\/230139921\/global-e-waste-management-market In Saudi Arabia , e-waste management is the responsibility of the Ministry of Environment, Water, and Agriculture (MEWA) and the Saudi Arabian Standards, Metrology, and Quality Organization (SASO). However, e-waste management in Saudi Arabia still faces several challenges, including a lack of public awareness and participation, limited resources, and inadequate infrastructure in some regions. The European Union has implemented the Waste Electrical and Electronic Equipment (WEEE) Directive, which requires member states to collect and dispose of e-waste in an environmentally sound manner. In addition, the UK government has launched a number of initiatives to encourage consumers to recycle their electronic devices, such as the Recycle Your Electricals campaign. The illegal dumping of e-waste into Brazil from Europe and North America is a serious issue that violates international agreements and Brazilian laws, including the Basel Convention. Despite this, e-waste continues to be illegally shipped to Brazil, where it is often disassembled and recycled in informal and unsafe conditions. The Brazilian government has taken steps to regulate the import and disposal of e-waste, but enforcement remains a challenge. Considered in the Report Geography: Global Historic Year: 2017 Base year: 2022 Estimated year: 2023 Forecast year: 2028 To buy the research report: https:\/\/www.bonafideresearch.com\/buy-now\/230139921 Related Reports: The Global Plastic Waste Management Market 2028 is anticipated to grow at a CAGR of 4.20% and to be valued at USD 40.75 Billion. Plastic waste is becoming an alarming need of the hour to reduce GHG emissions and global warming issues. In terms of geography, the Asia Pacific region is expected to dominate the plastic waste management market due to the high production and consumption of plastic in countries such as China and India . However, other regions such as North America and Europe are also expected to see growth in the market due to increasing government regulations and consumer demand for sustainable products. While South America may have less developed plastic waste management systems compared to other regions, there is potential for improvement through increased awareness, investment in infrastructure, and effective government policies and regulations. The Global Rigid Plastic Packaging Market is valued at USD 197 Billion in 2021 and is expected to grow further at a CAGR of 5.73% up to 2027. PET is the most widely used material in the rigid plastic packaging market due to its excellent properties such as transparency, toughness, and barrier resistance. Asia-Pacific is the largest and fastest-growing market due to the high demand for packaged goods, increasing disposable income, and growing population in the region. In the MEA region, the market is driven by the increasing use of rigid plastic packaging in several industries, including food and beverage, healthcare, and personal care. In South America , the market is expected to grow significantly due to the increasing demand for packaged goods and the growing consumer awareness of sustainable packaging solutions. The Global Pulse Oximeter Market is a rapidly growing industry with a CAGR of 7% during 2022–27. It involves the development and production of devices that measure oxygen saturation levels in the blood. The Fingertip pulse Oximeter is the most widely used type of device on the market due to its ease of use, portability, and accuracy. North America is the largest market, driven by the high incidence of respiratory diseases and the presence of a well-established healthcare infrastructure in the region. Some of the key players in the Asia Pacific market include Masimo Corporation, Medtronic plc, Nonin Medical, Inc., and Nihon Kohden Corporation. The Global Medical Oxygen Concentrator Market was valued at USD 1.67 Billion in 2021. The market is driven by the increasing prevalence of respiratory diseases such as COPD and asthma, rising demand for home-based oxygen therapy, and the growing geriatric population worldwide. Portable oxygen concentrators are the most widely used type of device on the market due to their lightweight and portable nature. North America is the largest market for medical oxygen concentrators, driven by the high prevalence of respiratory diseases and the increasing demand for home-based oxygen therapy in the region. Germany , France , and the United Kingdom are the largest markets for medical oxygen concentrators in Europe . In India , the market is driven by the increasing government initiatives to improve healthcare infrastructure and the availability of affordable medical oxygen concentrators in the country. Contact us: Steven Thomas - Sales & Marketing Manager E-mail: sales@bonafideresearch.com Asia-Pacific: +91 7878231309 Europe: +44 20 8089 0049 North America: +1 201 793 8545 https:\/\/www.bonafideresearch.com\/ About us: Bonafide Research is the fastest-growing global market research and consulting company, providing syndicated research reports, customized research reports, and consulting services to a range of verticals. They have been closely working with a wide client base ranging from Fortune 1000 companies to small and medium enterprises, helping them track the constantly changing market scenario. Bonafide has continuously made efforts to evolve and enhance the report quality with each passing day. Bonafide Research has a strong base of analysts and consultants from assorted areas of expertise who track the latest economic, demographic, trade, and market data globally and help clients make informed business decisions. They periodically update their market research studies to ensure that their clients get the most recent, relevant, actionable, and valuable information for strategy development and to extract tangible results. ","filter_flag":1}
{"title":"How yachts are disposed of – and why it's so environmentally toxic - Yachting Monthly","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5","id":"CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA","guidislink":false,"published":"Thu, 13 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=103, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5\" target=\"_blank\">How yachts are disposed of – and why it's so environmentally toxic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yachting Monthly<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"How yachts are disposed of – and why it's so environmentally toxic - Yachting Monthly","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMibmh0dHBzOi8vd3d3LnlhY2h0aW5nbW9udGhseS5jb20vc3BlY2lhbHMvaG93LXlhY2h0cy1hcmUtZGlzcG9zZWQtb2YtYW5kLXdoeS1pdHMtc28tZW52aXJvbm1lbnRhbGx5LXRveGljLTkzNjQy0gEA?oc=5\" target=\"_blank\">How yachts are disposed of – and why it's so environmentally toxic<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yachting Monthly<\/font>","source.href":"https:\/\/www.yachtingmonthly.com","source.title":"Yachting Monthly","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"The marine industry is puzzling over how to dispose safely of redundant, environmentally toxic GRP-built craft. Ollie Taylor investigates The annual volume of composite waste generated by the marine industry each year is a staggering 55,000 tonnes – and it’s predicted to increase by 10% every year in the near future as more and more leisure yachts reach their end of life (EOL). Glass reinforced plastic (GRP), commonly known as fibreglass, is the wonder material that created the modern leisure marine industry back in the 1960s, transforming what was once an artisanal, predominantly wood-based industry, into the high volume mass production model now pumping out an estimated 10,000 new boats in the UK alone each year. However, GRP, and the successful lightweight, rigid structures it produces were never designed with an EOL solution in mind, leaving today’s boatbuilding industry scratching its head for a solution to what is becoming an increasingly urgent problem. There are an estimated six million boats in the EU at the moment, 95% of which are made of GRP. Each year, 1-2% (60,000-120,000) reach the end of their usable life. The fate of these craft is relatively unknown but it’s estimated that only 2,000-3,000 are properly recycled each year. And, unfortunately, there are several fundamental challenges that currently restrict the marine industry and its ability to solve this problem. Composite structures, such as GRP, by their very nature are designed to last a long time, delivering very specific material properties. Stronger than many metals by weight, non-conductive, and with the ability to be moulded into highly complex shapes, GRP is the perfect material for making boats in high volumes and at low cost. However, the process of combining glass fibre with a thermoset resin to achieve the properties modern designs need results in a structure that was never meant to ever be separated again. So why has this problem not been addressed before now? The average lifespan of mixed composite laminates is anywhere between 25 to 100 years, and most usually towards the latter end of that scale. Given that GRP was widely adopted in the marine industry during the 1960s and 1970s, we are only now reaching the point where a high volume of vessels are beginning to reach the end of their life. This ticking time bomb is combining with a fast-evolving and much stricter waste control landscape than seen in previous decades. A number of European countries have banned, or soon will ban, fibreglass waste from landfill completely, so finding a secondary purpose for waste GRP will be critical. By reducing our demand for virgin raw materials, and thereby reducing our negative impact on the environment, we can begin to solve this urgent and growing problem for the maritime industry. Recycling technologies Five main recycling technologies offer potential solutions to how we can deal with the 55 kilotons of GRP waste the industry creates each year: mechanical grinding; incineration with energy recovery; co-processing in cement production; pyrolysis; and solvolysis. Mechanical grinding is the most widely available recycling process, although still only at a small scale compared to other processes such as glass recycling. It takes small to medium-size GRP panels through multiple stages of crushing and grinding to reduce the material into small fragments or powder. It doesn’t separate the fibre from the resin, or any other laminate reinforcements (plywood or foam core, for instance). Instead, it lumps everything together, resulting in a material that has limited mechanical properties and thus very low financial value. The recyclate can be used as a filler or bulk agent in new composite products. However, market demand for it is low, while the cost and energy required to complete the process is relatively high. Incineration with energy recovery converts fibreglass panels into energy by burning the organic resin element to create heat which can be converted to electricity via steam turbines. Unfortunately, the glass fibre element has no calorific value and limits the ability for generating energy. It has also been documented that using domestic refuse incinerators for GRP tends to overload the incinerator and displaces domestic refuse which may end up in landfill rather than being incinerated. The biggest challenge is the creation of bottom ash from the process which is typically sent to landfill. Very few commercial incinerator operators actively choose to take GRP waste as it’s a tricky material to deal with. Co-processing in cement production uses almost 100% of the EOL composite. During co-processing the waste is simultaneously used as both an energy source (the resin) and a raw material input (the fibres) into clinker cement production. There is a growing consensus that this solution could significantly reduce the greenhouse gas emissions of the cement industry whilst also solving the EOL composite waste conundrum. Cement production is one of the world’s biggest causes of carbon pollution, responsible for 7% of global emissions, equivalent to more than any country except China and the US. Unfortunately, this process is still operating at a relatively small scale, but we’re likely to see a widespread scaling up of the technology in the near future. However, it is still considered to be ‘downcycling’ as you are not actually reclaiming the original material inputs. Pyrolysis and solvolysis both use a combination of high heat (pyrolysis) and chemicals (solvolysis) in the absence of oxygen to break the composite down into its separate fibre and resin components. The incineration temperatures range from 300-700°C and essentially burn the resin from the fibre. It currently only operates at academic or pilot scale. The very high cost of running the process means it’s geared towards carbon fibre reclamation only. The benefit is that you end up with the raw fibre, which can be reused. The downside is that recycled fibre is short and discontinuous, requiring further processing. Lineat, a new company based in Bristol has come up with an innovative solution for realigning the reclaimed fibres into uni-directional discontinuous fibre tapes that can be used in a wide range of new composite products. The tapes retain >75% of the strength and >85% of the stiffness of continuous virgin carbon fibre tapes. The process takes the short, reclaimed fibres and immerses them in a liquid which is then fired through a small nozzle to realign all the fibres into a straight line. The newly aligned fibres are then combined with a resin to create a pre-preg tape. Again, this technology is operating at a small scale, but it has proven that we are now able to use reclaimed carbon fibre. Price incentives The key barrier to all of these processes reaching widespread scale and adoption is money. The price of virgin raw materials remains incredibly low, and the incentive to use recycled raw materials is almost non-existent as the price and availability of virgin materials is more attractive. This is combined with the fact that most recycled materials often have worse mechanical properties than the virgin material, and in a world of high performance lightweight structures there is little room for performance trade-offs. Due to the low demand and the commercial value of the recyclate from the processes shown above, few operators are willing to invest in developing suitable infrastructure to perform the process. That leaves the marine industry in the chicken and egg situation of having no suitable infrastructure development and no commercial incentive for investors to fund development. APER scheme However, there is some good news. France’s APER scheme offers a glimpse of what is possible when the marine industry works collaboratively. APER is a world first which requires French manufacturers to pay an ‘eco-contribution’ for every new boat sold. That money is then supplemented by contributions from the national annual taxation on recreational craft, giving the scheme an operating budget to deal with recycling the legacy fleet, partially funded by the new fleet. In 2022, the scheme recycled 2,980 boats and is now building up its infrastructure to deal with around 3,000 vessels per year, ranging from 2.5m to 24m. The scheme currently has 30 approved deconstruction sites across France catering for most regional boating centres. At present, just over 60% of the composite waste is sent for incineration with energy recovery, while the remaining 40% is ‘disposed’ of, although it’s not clear if this simply means landfill. The other main components are separated and sent to their respective material recycling processes. Producer Responsibility The APER scheme is an example of ‘extended producer responsibility’ (EPR), a legislative instrument that will significantly change how new products are designed, used, and treated at EOL in the future. EPR works on the simple premise that the original manufacturer retains responsibility for the item when it reaches its EOL. Legacy fleet So where does this leave the marine industry? The problem can be split into two distinct categories: the legacy fleet; and the new fleet. How we reuse, recycle or recover materials from the legacy fleet remains unclear. What is becoming evident, though, is the need to collaborate across various industries to scale the technology and build the required infrastructure. The marine industry will not solve this problem in isolation. Even then, the need to develop innovative and commercially viable uses for the recyclate itself is paramount. If this can be achieved, the vital investment required to scale the technology will come. Ultimately, the power to completely remove this problem for future generations lies in the hands of designers and engineers, as over 80% of a product’s lifelong environmental impact is determined during the design phase. New fleet The new fleet is potentially easier to solve, as it currently exists within the minds of the industry’s designers and engineers, who have the power to solve this problem permanently. The key lies in the marine industry’s ability to transition to circular models of operation. Much of this will be driven by coming legislation. EPR and the addition of ‘digital product passports’ will require manufacturers to not only take their product back at EOL but also provide full transparency and traceability of a product’s impact across its entire lifespan. All manufacturers will have to change their business models and design production processes to ensure they extract maximum value from the product at EOL. With the increasing availability of bio-based materials, recyclable resin systems and novel ownership models being developed every day, the future looks bright for boatbuilding. Whether the current industry’s heavy hitters choose to take notice and alter their path, however, remains to be seen. Flax future Bio-based materials and natural fibres offer multiple benefits across the life cycle of a vessel. They come from renewable feedstocks that can be regrown on an annual basis and have low global warming potential as they produce fewer greenhouse gas emissions during production. Plant-based fibres also sequester carbon during growth and lock this carbon into the structure for the life of the product. The calorific value of flax-based structures is far greater than GRP as both the fibre and resin get burnt, increasing energy recovery. Flax, if used with a bio-based resin system, will also naturally biodegrade over time, returning the stored carbon to the short-term carbon cycle. German boatbuilder Greenboats has developed a novel concept utilising flax-based laminate panels. It produces interior panels, doors and bulkheads from flax which has NFC (near field communication) chips embedded into the laminate structure to show the user or recycler the complete material content and process for recycling, including strain gauges and temperature sensors, so they know what level of stress a panel has experienced across its 30-year lifespan. Design for Disassembly Another core concept boatbuilders might embrace is ‘design for disassembly’. Lots of work is being done to create reversible bonding joints using thermally expanding graphite particles, for instance, to make splitting bonded composite panels possible. Or even simpler, looking at using traditional panel designs rather than highly complex moulded shapes so the deconstruction at EOL is straightforward, with the resultant panels capable of being reused in new structures. Enjoyed reading this? A subscription to Yachting Monthly magazine costs around 40% less than the cover price. Print and digital editions are available through Magazines Direct – where you can also find the latest deals. YM is packed with information to help you get the most from your time on the water. Take your seamanship to the next level with tips, advice and skills from our experts Impartial in-depth reviews of the latest yachts and equipment Cruising guides to help you reach those dream destinations Follow us on Facebook, Twitter and Instagram.","filter_flag":1}
{"title":"Scottish Gov to consult on mandatory textile collection - Resource.co","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9zY290dGlzaC1nb3YtY29uc3VsdC1tYW5kYXRvcnktdGV4dGlsZS1jb2xsZWN0aW9u0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9zY290dGlzaC1nb3YtY29uc3VsdC1tYW5kYXRvcnktdGV4dGlsZS1jb2xsZWN0aW9u0gEA?oc=5","id":"CBMiTWh0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9zY290dGlzaC1nb3YtY29uc3VsdC1tYW5kYXRvcnktdGV4dGlsZS1jb2xsZWN0aW9u0gEA","guidislink":false,"published":"Fri, 21 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=21, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=111, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9zY290dGlzaC1nb3YtY29uc3VsdC1tYW5kYXRvcnktdGV4dGlsZS1jb2xsZWN0aW9u0gEA?oc=5\" target=\"_blank\">Scottish Gov to consult on mandatory textile collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource.co<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Scottish Gov to consult on mandatory textile collection - Resource.co","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vcmVzb3VyY2UuY28vYXJ0aWNsZS9zY290dGlzaC1nb3YtY29uc3VsdC1tYW5kYXRvcnktdGV4dGlsZS1jb2xsZWN0aW9u0gEA?oc=5\" target=\"_blank\">Scottish Gov to consult on mandatory textile collection<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Resource.co<\/font>","source.href":"https:\/\/resource.co","source.title":"Resource.co","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Minister for Green Skills, Circular Economy and Biodiversity Lorna Slater confirmed in Scottish Parliament on Wednesday (19 April) that the Scottish Government will be consulting on the mandatory collection of textiles by local authorities by 2025. Lorna Slater at the 'Evidencing the Need for a National Citizens Clothing Circularity Strategy’ launch event The move is a possible sign that Scotland may still uphold the commitment made before Brexit to introduce mandatory textile collections by 2025, as part of the EU’s Waste Framework Directive (WFD). The announcement came during a launch event to present research from the University of Glasgow and outline the white paper ‘Evidencing the Need for a National Citizens Clothing Circularity Strategy’ by Dr Lynn Wilson, Professor Deirdre Shaw and Dr Katherine Duffy. The announcement also follows the release of an analysis of responses to the 2022 consultation on ‘Delivering Scotland's Circular Economy: Route map to 2025 and Beyond’. Despite the Route Map to 2025 consultation having called for responses on the introduction of mandatory collection of textiles, the analysis does not touch on this topic. Alongside collections, the Route Map to 2025 consultation also called for responses to a proposed mandatory reporting of waste and surplus food and textiles by businesses. The responses to this call are also absent from the analysis. Lorna Slater has recently been criticised for her work on the Scottish deposit return scheme (DRS). The scheme was delayed by First Minister Humza Yousaf from August 2023 to March 2024 earlier this week. Scotland’s Labour Party has called for Yousaf to remove the DRS from Slater’s ministerial duties. Alan Wheeler, CEO of the Textile Recycling Association, commented: “We welcome the statement from the Green Skills Minister Lorna Slater that the Scottish Government is still committed to consulting upon the introduction of mandatory collections of textiles for local authorities by 2025. I would like to repeat the invitation that I made on behalf of the Textile Recycling Association to work with her, the Scottish Government and Zero Waste Scotland to deliver the best outcome from this. “Whilst this could be a vital tool for delivering a circular textiles economy in Scotland, there will still be a necessity to deliver policy interventions elsewhere to create new markets for used textiles and to encourage investment in new technologies that improve economic and logistical efficiencies in collections, sorting and processing. “An Extended Producer Responsibility scheme for textiles was referred to at the event this week, but other interventions such as product design standards, minimum recycled content in new products and an agreed end of waste status are just some of the other proposals that should be considered.” Peter Page, Group Head of Recycling at Textile Recycling International, added: “I think it’s excellent the Scottish government are going to be consulting on this initiative, and getting this right will be paramount in reducing the number of textiles that go to landfill each year, textiles collected at the kerbside does not work for numerous reasons predominately the Scottish weather and not having a weatherproof receptacle. “Further thought should be on increasing textile collection points across Scotland. Over the past ten years councils have increasingly removed these leaving members of the public less opportunity to recycle. Another thought should be on a dedicated doorstep collection service for textiles.” The EU’s Waste Framework Directive and textiles legislation The EU’s WFD sets the basic standards for all waste collection by EU member states. A 2018 revision mandated that by 1 January 2025, all member states must have introduced separate collections for textiles – although it does not specify that collections must be kerbside. When the UK left the EU, Westminster initially expressed its intention to uphold the commitment to introduce mandatory collections of used textiles by 2025. However, the Government’s current intentions are unclear. Some EU member states have already implemented mandatory collections ahead of the WFD coming into effect. For example, Finland’s law came into force in January this year, following a series of trials. The WFD also states that extended producer responsibility (EPR) for textiles will be introduced as one of the targeted revisions of the WFD, currently scheduled to be implemented this year. Defra Secretary of State, Thérèse Coffey, has said that the UK Government currently does not have any plans to introduce an EPR scheme for textiles.","filter_flag":1}
{"title":"Compactor presses proving useful to manage on-farm used silage and bale wrap plastics - Alberta Beef Producers - ABP Daily","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2FicGRhaWx5LmNvbS9pc3N1ZXMtaW5zaWdodHMtaW5mbHVlbmNlL2NvbXBhY3Rvci1wcmVzc2VzLXByb3ZpbmctdXNlZnVsLXRvLW1hbmFnZS1vbi1mYXJtLXVzZWQtc2lsYWdlLWFuZC1iYWxlLXdyYXAtcGxhc3RpY3Mv0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2FicGRhaWx5LmNvbS9pc3N1ZXMtaW5zaWdodHMtaW5mbHVlbmNlL2NvbXBhY3Rvci1wcmVzc2VzLXByb3ZpbmctdXNlZnVsLXRvLW1hbmFnZS1vbi1mYXJtLXVzZWQtc2lsYWdlLWFuZC1iYWxlLXdyYXAtcGxhc3RpY3Mv0gEA?oc=5","id":"CBMihQFodHRwczovL2FicGRhaWx5LmNvbS9pc3N1ZXMtaW5zaWdodHMtaW5mbHVlbmNlL2NvbXBhY3Rvci1wcmVzc2VzLXByb3ZpbmctdXNlZnVsLXRvLW1hbmFnZS1vbi1mYXJtLXVzZWQtc2lsYWdlLWFuZC1iYWxlLXdyYXAtcGxhc3RpY3Mv0gEA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2FicGRhaWx5LmNvbS9pc3N1ZXMtaW5zaWdodHMtaW5mbHVlbmNlL2NvbXBhY3Rvci1wcmVzc2VzLXByb3ZpbmctdXNlZnVsLXRvLW1hbmFnZS1vbi1mYXJtLXVzZWQtc2lsYWdlLWFuZC1iYWxlLXdyYXAtcGxhc3RpY3Mv0gEA?oc=5\" target=\"_blank\">Compactor presses proving useful to manage on-farm used silage and bale wrap plastics - Alberta Beef Producers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABP Daily<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Compactor presses proving useful to manage on-farm used silage and bale wrap plastics - Alberta Beef Producers - ABP Daily","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMihQFodHRwczovL2FicGRhaWx5LmNvbS9pc3N1ZXMtaW5zaWdodHMtaW5mbHVlbmNlL2NvbXBhY3Rvci1wcmVzc2VzLXByb3ZpbmctdXNlZnVsLXRvLW1hbmFnZS1vbi1mYXJtLXVzZWQtc2lsYWdlLWFuZC1iYWxlLXdyYXAtcGxhc3RpY3Mv0gEA?oc=5\" target=\"_blank\">Compactor presses proving useful to manage on-farm used silage and bale wrap plastics - Alberta Beef Producers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABP Daily<\/font>","source.href":"https:\/\/abpdaily.com","source.title":"ABP Daily","query":"https:\/\/news.google.com\/rss\/search?q=\"Extended producer responsibility\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Issues & Insights Compactor presses proving useful to manage on-farm used silage and bale wrap plastics By Cleanfarms and APRG Silage plastic, densified & prepared for transport using the manual compacting system. Photo Credit: Cleanfarms Many beef and dairy producers in Alberta protect livestock feed by covering it with special plastic film widely used in agriculture today. Whether it’s silage bags or tubes, large tarps that cover the top of the silage piles, or plastic stretch film used to wrap hay bales, once the plastic is removed and no longer useful, it becomes waste. Historically, the only disposal options for these materials were landfilling or piling them behind the farm gate in hopes of a future recycling program. Fortunately, a recycling option is now available for farmers in several parts of the province. Through a multi-year, federally-funded pilot program called ‘Building a Zero-Plastic-Waste Strategy for Agriculture’, Alberta farmers in select municipalities can recycle these used plastic materials by taking them to a local collection site or contacting their ag department. One challenge with recycling these plastics is densifying the material, in this case, bale wrap and silage plastic, to improve efficiencies in transporting them to an end market. Generally, plastics that are collected loose take up a large amount of space and are time-consuming and difficult to handle with equipment. To quickly and inexpensively densify these plastics for storage, handling, and transport, Cleanfarms is testing the use of a manual compacting system. The compactors in use were designed by Full Circle Plastics of Nobleford, Alberta. Cleanfarms initially commissioned 25 of them for Alberta and loaned several of them to beef and dairy farmers throughout the province. Through its ‘Here For Tomorrow’ partnership, Dairy Farmers of Canada has provided funding to supply some compactors to a group of dairy farmers around Silage plastic, densified & prepared for transport Olds, Alberta. Each compactor takes approximately 22,000 square feet or about 300 kg of loose material at one time and compresses it into a 2’ x 4’ x 4’ bale. The bales are easy to store and transport to a local collection site and from there to a recycling facility in Alberta or the U.S. “This compactor is a ‘made in Alberta’ solution to a problem all livestock producers face. So far, it demonstrates that managing our used silage plastic can be easy and it saves us time. Farmers love practical solutions and the compactor is a practical answer, plus it’s the right thing to do,” said Dan Deboer of Monarch Feeders. How to access a manual compactor Compactors are currently available year-round for public use during regular operating hours in several municipalities throughout Alberta (see the Cleanfarms Alberta map and contact details). Additional sites may be added as the pilot program expands. Some municipalities (listed in the map above) also offer mobile compactors that can be delivered directly to farm. Those interested can contact the municipality or agricultural department to inquire if the mobile option is available. Photo Credit: Cleanfarms The Cleanfarms project to reduce ag plastic waste is funded in part by the Government of Canada through Agriculture and Agri-Food Canada’s Canadian Agricultural Strategic Priorities Program (CASPP), a $50.3 million, five-year investment to help the agricultural sector adapt and remain competitive. Recycling silage covers and bale wrap so they can be turned into new plastic products such as new agricultural film plastics, plastic bags, plastic dimensional lumber, or plastic ag fence posts, adds to farm operation sustainability, a goal which is a priority for many farm families. View the compactor in action… Managing ag plastics: Compaction with a manual baler Cleanfarms and the Alberta Agricultural Plastics Recycling Group (APRG) are publishing a series of information articles for Alberta farmers to develop a shared understanding of the importance of used agricultural plastics resource management. A common theme throughout this monthly series is an exploration of how ag plastics, once used, can be recycled to reclaim the natural resources and the invested energy, returning them to the economy where they can be remanufactured into new products. This practice is important to Alberta farmers because it contributes to agricultural sustainability that begins and ends on the farm, providing stewardship for future generations, as well as environmental health. Future articles will feature discussions on change management such as first sellers and manufacturers taking responsibility for used materials (extended producer responsibility), and explore practical recycling, including opportunities and challenges, for products such as grain bags, silage and bale wrap and baler twine that have real-time applications for farmers. Cleanfarms is operating a three-year pilot project for grain bag and baler twine recycling in Alberta. The project is led by the multi-stakeholder APRG. Funds were granted by the Government of Alberta and are being administered by Alberta Beef Producers. Find out more:","filter_flag":1}
