{"title":"Top 4 benefits of customized, closed-loop and end-of-life recycling programs for automakers - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcC00LWJlbmVmaXRzLW9mLWN1c3RvbWl6ZWQtY2xvc2VkLWxvb3AtYW5kLWVuZC1vZi1saWZlLXJlY3ljbGluZy1wcm9ncmFtcy1mb3ItYXV0b21ha2Vycy0zMDE4NDM4NzQuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcC00LWJlbmVmaXRzLW9mLWN1c3RvbWl6ZWQtY2xvc2VkLWxvb3AtYW5kLWVuZC1vZi1saWZlLXJlY3ljbGluZy1wcm9ncmFtcy1mb3ItYXV0b21ha2Vycy0zMDE4NDM4NzQuaHRtbNIBAA?oc=5","id":"CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcC00LWJlbmVmaXRzLW9mLWN1c3RvbWl6ZWQtY2xvc2VkLWxvb3AtYW5kLWVuZC1vZi1saWZlLXJlY3ljbGluZy1wcm9ncmFtcy1mb3ItYXV0b21ha2Vycy0zMDE4NDM4NzQuaHRtbNIBAA","guidislink":false,"published":"Tue, 06 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=6, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=157, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcC00LWJlbmVmaXRzLW9mLWN1c3RvbWl6ZWQtY2xvc2VkLWxvb3AtYW5kLWVuZC1vZi1saWZlLXJlY3ljbGluZy1wcm9ncmFtcy1mb3ItYXV0b21ha2Vycy0zMDE4NDM4NzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Top 4 benefits of customized, closed-loop and end-of-life recycling programs for automakers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Top 4 benefits of customized, closed-loop and end-of-life recycling programs for automakers - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMikgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RvcC00LWJlbmVmaXRzLW9mLWN1c3RvbWl6ZWQtY2xvc2VkLWxvb3AtYW5kLWVuZC1vZi1saWZlLXJlY3ljbGluZy1wcm9ncmFtcy1mb3ItYXV0b21ha2Vycy0zMDE4NDM4NzQuaHRtbNIBAA?oc=5\" target=\"_blank\">Top 4 benefits of customized, closed-loop and end-of-life recycling programs for automakers<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"End-of-life recycling\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"By Jamie Zinser, Vice President, Global Automotive, Novelis Inc. ATLANTA, June 6, 2023 \/PRNewswire\/ -- As the global automotive industry strives to reach ambitious sustainability targets, most notably regarding carbon emissions, it continues to gravitate toward the world's infinitely recyclable material—aluminum. In fact, aluminum can be recycled and reused endlessly without losing its material properties. This phenomenon is the foundation of a circular economy for the automotive industry fueled by closed-loop and end-of-life recycling. Top 4 benefits of customized, closed-loop and end-of-life recycling programs for automakers To help the automotive industry reduce carbon emissions and ultimately achieve carbon neutrality, as well as reduce waste and preserve natural resources, Novelis, the largest recycler of aluminum in the world, works in partnership with automakers to create and implement customized circular economy programs. These programs include closed-loop recycling solutions that address the unique infrastructure and business dynamics of each automaker. Novelis is dedicated to shaping the automotive circular economy of the future and understands that truly collaborative and transparent partnerships with automakers are the key to realizing this goal. Jamie Zinser, Vice President, Global Automotive at Novelis, outlines the top 4 benefits of customized closed-loop recycling programs for automakers. 1. Preserving the value of aluminum alloys : Recycled aluminum is essential for the future of sustainable mobility. A customized, closed-loop and end-of-life recycling program is key to keep like alloys separated, which is critical to maintaining the performance specifications of automotive alloys. To enable this, aluminum scrap segregation and sorting technologies are critical to any successful recycling program as scrap aluminum can be collected and transformed into new vehicle parts. These processes separate different alloys by refined alloy families. Keeping these alloys separate ensures the same alloy can go back into its original application, which preserves its value, and requires less primary metal input, enabling the conversion of high-quality scrap material into new coils. While aluminum scrap separation is a complex process, Novelis continues to invest in sorting and segregation technologies to streamline the process for automakers. The use of recycled aluminum reduces the demand for raw materials. 2. Reducing CO2 emissions : Recycled aluminum uses approximately 95% less energy than primary aluminum production, resulting in 95% less carbon emissions. Increasing the use of recycled aluminum improves energy efficiency and promotes a true circular economy. Closed-loop agreements with customers allow Novelis to recycle production scrap into new automotive sheet and its customers to enhance the sustainability profile of their vehicles. 3. Establishing a secure supply chain : Using recycled materials in a circular economy system strengthens the automaker's supply chain and makes its production schedule less vulnerable to disruptions caused by external factors. The average stamping process turns 30%-40% of an aluminum coil into scrap that can be recycled back into the same product, leveraging aluminum's unique benefit of being infinitely recyclable without losing its material properties. 4. Enhancing economic benefits : Because aluminum is infinitely recyclable, automakers can leverage closed-loop recycling programs to reuse aluminum again and again without impacting its properties. This reduces total vehicle costs and helps maximize the sustainability benefits of aluminum, including its extensive lightweight properties that can enable EV efficiency and allow for traveling longer distances on a single battery charge. As the leader in automotive closed-loop recycling, Novelis is working extensively with OEMs around the world. In North America, we worked with our customer to develop the largest closed-loop system in the automotive industry. Through this partnership, we recycle enough aluminum scrap generated from the automotive stamping process to produce 37,000 new vehicle bodies each month. In addition, Novelis worked with partners in Europe to establish the first regional closed-loop recycling system, which is a dedicated round-trip railway service that delivers materials across Europe. With a common goal of a more sustainable future, the automotive and aluminum recycling industries can work together to develop solutions to make the circular economy a reality today. About the author: Jamie Zinser is Vice President of Global Automotive at Novelis, where she is responsible for global automotive commercial strategy. Jamie has nearly 30 years of experience in the automotive industry. Prior to joining Novelis, Jamie was Chief Technology Officer at Global Automotive Systems, where she was responsible for new business development strategy, product and process engineering, and program management. Jamie also worked at DURA Automotive Systems for two decades in engineering and leadership roles. Jamie is a sought-after speaker for industry events and was recognized as one of the Top 100 Leading Women in the North American Automotive Industry and as a Rising Star by Crain's Automotive News. She is a mentor to the Women of Tomorrow (WOT) Mentor and Scholarship Program for at-risk young women. Jamie is also Vice President of Alumobility and a member of its Board of Directors, where she lends her expertise in automotive and aluminum technology development, OEM-supplier collaboration, and global manufacturing to the organization's mission. Jamie earned her Bachelor of Science in Mechanical Engineering degree from GMI Engineering and Management Institute in Flint, Michigan (now Kettering University). SOURCE Novelis Inc.","filter_flag":1}
{"title":"Battle for the Box - Tech Briefs","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnRlY2hicmllZnMuY29tL2NvbXBvbmVudC9jb250ZW50L2FydGljbGUvNDgyMzMtYmF0dGxlLWZvci10aGUtYm940gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnRlY2hicmllZnMuY29tL2NvbXBvbmVudC9jb250ZW50L2FydGljbGUvNDgyMzMtYmF0dGxlLWZvci10aGUtYm940gEA?oc=5","id":"CBMiTWh0dHBzOi8vd3d3LnRlY2hicmllZnMuY29tL2NvbXBvbmVudC9jb250ZW50L2FydGljbGUvNDgyMzMtYmF0dGxlLWZvci10aGUtYm940gEA","guidislink":false,"published":"Wed, 07 Jun 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=6, tm_mday=7, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=158, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnRlY2hicmllZnMuY29tL2NvbXBvbmVudC9jb250ZW50L2FydGljbGUvNDgyMzMtYmF0dGxlLWZvci10aGUtYm940gEA?oc=5\" target=\"_blank\">Battle for the Box<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tech Briefs<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Battle for the Box - Tech Briefs","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiTWh0dHBzOi8vd3d3LnRlY2hicmllZnMuY29tL2NvbXBvbmVudC9jb250ZW50L2FydGljbGUvNDgyMzMtYmF0dGxlLWZvci10aGUtYm940gEA?oc=5\" target=\"_blank\">Battle for the Box<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Tech Briefs<\/font>","source.href":"https:\/\/www.techbriefs.com","source.title":"Tech Briefs","query":"https:\/\/news.google.com\/rss\/search?q=\"End-of-life recycling\" \"new products\"+after:2023-06-01+before:2023-06-30","text":"Hot stamping, cold stamping, roll-forming, hydroforming, casting and steel, aluminum, composites, and thermoplastics — are all raising “lively discussions” in pack development. Whether you call them packs, boxes, or trays, the structures that envelop and protect EV battery cells and their supporting electrical and thermal-management hardware are among the industry’s top subsystem priorities. Optimizing the battery pack involves a host of manufacturing and material choices, mass and package tradeoffs, safety provisions, and structural design\/engineering challenges, OEM and supplier experts told SAE Media. “Do you want the battery pack bolted into the vehicle or integrated into the body structure?” asked Darren Womack, Senior Department Manager, Body, and Structures, at Magna’s global R&D group. Hot stamping, cold stamping, roll-forming, hydroforming, casting and steel, aluminum, composites, and thermoplastics — are all raising “lively discussions” in pack development, he said at a recent meeting of analysts. Inside Novelis’s state-of-art Gen-II battery enclosure. From the top: Aluminum top cover; advanced cell-to-pack battery system (green); s701 and s650 roll-formed AL profiles; simple modular extruded frame enclosure; structurally integrated cooling plate (blue), fire-resistant AL bottom plate. (Image: Novelis) OEMs clearly want to eliminate redundant structure to optimize package space and reduce mass and complexity, said Womack. Integrating the EV battery into its surrounding platform involves various configurations. Cell-to-pack design, currently in production at BYD, does away with the intermediate module stage, putting the cells directly into the pack. Cell-to-chassis technology integrates the battery cell with the vehicle chassis, electric drive, and thermal management. All battery components are housed in the vehicle body-in-white, eliminating the separate pack. In such setups, under investigation by Tesla and others, the chassis pan and vehicle side structure double as the battery’s bottom plate and sides. In this marriage, impact integrity, accurate pack assembly, and robust sealing are paramount. “Each OEM is going to want a ‘playbook’ – a menu of options based on their criteria including cell form factor, battery size, and vehicle,” explained Mario Greco, Director of Strategy and Marketing, Global Automotive, at aluminum specialist Novelis. “No single solution for battery enclosures is going to fit everybody.” For example, a high-volume solution may be a stamped, single-piece enclosure. It might include an integrated cooling structure because the vehicle architecture lends itself to a cell-to-chassis design versus a cell-to-pack, he said. “I think we’ll see a convergence between the ‘skateboard’ and next-generation unibody architectures,” Greco said, “because the OEM incumbents that are stepping into EVs have all-new unibody architectures that are designed to serve them for quite a while.” Wide-Open Field for Design DuPont’s 3-in-1 battery-box concept is a new example of modular design that consolidates cell cooling, electrical interconnection, and structural components. Its housing is made of the company’s heat-resistant Zytel HTN. (Image: DuPont) Despite the significant mass burden of liquid-cooled lithium battery packs, EV mass reduction improvements are still possible, according to Gregor Klement, Global Chief Engineer, Battery Trays, at Magna. “Looking into the future, we see more and more integration of the battery into the vehicle body,” he said, with light metals and composites both playing a role. “Magna R&D is working on cell-to-chassis solutions, and we see customers looking in a similar direction. By eliminating redundant structural parts, we see opportunity for good improvement in weight and cost.” But he reckons battery weight will likely never be completely offset. With vehicle electrification still in its nascent phase, much EV subsystems development is on the critical path, said Jeremy Loveday, Program Engineering Manager for Cadillac’s superluxury 2024 Celestiq. In this scenario, Tier 1s are offering both near- and long-range solutions for OEM evaluation. DuPont’s 3-in-1 battery-box concept unveiled in late 2022 is a new example of modular design that consolidates cell cooling, electrical interconnection, and structural components. Its housing is made of the company’s Zytel HTN, a nylon-based polyamide capable of resisting high temperatures. According to Frank Billotto, Battery Materials Business-Development Leader in DuPont’s Mobility and Materials group, the concept provides semi-direct cooling (cells are cooled through their tabs) and easy assembly via electrical interconnections. He said the design enables batteries with greater energy density, improving vehicle range and package efficiency. SABIC-supplied polypropylene top cover for Honda CR-V plug-in hybrid used in the China market. (Image: SABIC) The “battle for the box” has kicked off a new wave of creativity among engineers and materials scientists. Roughly 80 percent of current EVs have an aluminum battery enclosure, but engineers are quick to note that the field is wide open for alternatives, based on vehicle type, duty cycles, volumes, and cost. “I think we will see more light-weight-steel enclosures in the future, mainly on smaller, shorter-range vehicles,” said Dr. Andreas Asfeth, Technical Director, North American Automotive at Constellium, a specialist in aluminum extrusions and sheet. He acknowledged steel’s “strong cost-competitiveness” and said the ferrous metal’s significant weight penalty versus aluminum isn’t a huge issue with small-vehicle batteries. But in larger, long-range vehicles, “the battery represents the value of the vehicle. The larger the battery, the more aluminum makes sense for battery packs,” Asfeth added. Aluminum Rules — For Now Aluminum battery enclosures typically deliver a weight savings of 40 percent compared to an equivalent steel design. According to Asfeth, the alloys best suited for battery enclosures are the 6000-series Al-Si-Mg-Cu family — alloys that are also highly compatible with end-of-life recycling, he said. The current state-of-the-art solution for bottom plates is high-strength 6111 alloy in peak-aged temper, which reduces weight by 30 percent compared to the benchmark 5754 O-temper alloy, he said. Looking intensely at vehicle impact requirements, Constellium is developing a “cost competitive” 4xxx-series alloy boasting 80-GPa E-modulus and 350-MPa yield stress, according to Asfeth. The alloy offers potential for a 40 percent weight reduction. He added that the 4xxx-series gauges and widths will be similar to 6000 series alloy and is compatible with conventional cold forming. Aluminum’s workhorse 6xxx-series alloy is used in two different advanced extruded alloys that underpin a recent Constellium dual-frame enclosure prototype. The inner frame (a second buttress to protect the cells in an impact) is in strength-optimized 6000 (HSA6 family). The outer reinforcement, designed as a crumple zone, is a ductile 6000 alloy, HCA6 family. Pack design could shift, however, if the industry moves to solid-state lithium batteries, Asfeth said. “We may see some load-bearing function in the solid-state battery cells themselves and therefore less structural demand on the enclosure,” he said. The Promise of Molded Packs AL extrusions currently play a major role in the design of EV packs, as shown in this Constellium illustration. (Image: Constellium) Suppliers of composites and plastics are undeterred by aluminum’s current dominance in EV battery enclosures. They’re developing new formulations and processes aimed at matching or exceeding the performance and cost-competitiveness of the light metal. “Current battery packs use a lot of metal that is not optimized. They were designed using existing materials and technologies,” said Dhanendra Nagwanshi, Global Automotive Leader, EV Batteries and Electricals, at thermoplastic giant SABIC. He argues that compared to aluminum, new-generation thermoplastics offer mass savings of 30 to 50 percent depending on application. They also offer equal or better impact performance, lower cost through simplified assembly, and less environmental impact than aluminum, he claimed. Tejin’s multi-material EV battery structure on display. (Image: Lindsay Brooke) SABIC’s latest innovation aims directly at one of aluminum’s weaknesses — its very high thermal conductivity. Aluminum begins to melt at approximately 1166 °F; temperatures generated by an internal thermal runaway can lead to battery fires as hot as 2012 °F. Nagwanshi noted SABIC’s development of a new Stamax FR long-glass-fiber PP with “unique” flame-retardant properties. “When the material comes in contact with fire, it chars. The char then becomes an insulating layer,” he said. The company’s testing based on the UL2596 standard for battery enclosure materials demonstrated the plastic can withstand 1832 °F for 30 minutes — “a temperature threshold where aluminum would be perforating,” he added. SABIC currently produces a flame-resistant PP battery pack cover used by Honda in the China market. The cover eliminates thermal blankets, reducing weight by 40 percent vs. a similar metal cover. Next-generation thermoplastic battery pack and module prototypes are in development. Rhode Island-based Tri-Mack Plastics recently showed light-weight, high-strength enclosures made from just eight plies of unidirectional carbon-fiber reinforced thermoplastic composite (TPC) tape, one millimeter (.040-in.) thick. The company’s Process Engineering Manager Ben Lamm said that the material, combined with Tri-Mack’s manufacturing process, offers new opportunities in part geometry, parts consolidation, and integrated EMI countermeasures. New twists on proven resin families and compounds are also aimed at the battery box. Among SABIC’s projects is an all-plastic EV battery tray with integrated cooling channels and crash-protection elements. It offers up to 12 percent mass reduction compared with an aluminum pack, Nagwanshi claimed. Integrated plastic-metal hybrid structures based on the Stamax FR long glass fiber PP are also in the works. Testing has demonstrated the structures meet drop-test requirements. Engineers are encouraged by its ability to absorb significant energy, as would be required in vehicle side-impact tests. Nagwanshi considers thermoset plastics such as SMC to be a competitor in some regards but criticizes the material type as “not optimized” due to the need for a thermal blanket, as well as its secondary manufacturing operations. “And you cannot recycle thermosets,” he added. Magna’s Gregor Klement with Ford F-150 Lightning battery tray. Magna has the Lightning battery structure except the top cover. (Image: Magna) Hugh Foran might disagree with his industry colleague. As Director of New Business Development\/New Markets at Teijin Automotive Technologies (supplier of the C8 Corvette’s thermoset exterior panels), he said that SMC regrind has variety of second-use applications. For the EV market, Teijin has become a major supplier of thermoset battery box top covers. “We’ve got over 30 of them in production for various EVs,” Foran told SAE Media. Top covers are typically a fire-retardant-loaded polymer or steel sheet, which resist internal fire for longer periods than aluminum and provide crash protection. But the Japan-based supplier is looking beyond just pack covers. Teijin also has molded some prototype battery-box parts in phenolic resins that resist heat to 1100 °F and providing them to customers for testing. Will the EV battery enclosure of 2028 be significantly different than that of 2023? “With some customers, we see the change to structural batteries and cell-to-chassis starting in the next couple years,” Magna’s Klement said. “Others are in the concept phase. It’s not far away anymore, but I’m not sure everybody will go in this direction.” This article was written by Lindsay Brooke, Editor-in-Chief, Automotive Engineering magazine, SAE Media Group. For more information, visit here .","filter_flag":1}
