{"title":"Towards circular plastics within planetary boundaries - Nature.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxODkzLTAyMi0wMTA1NC050gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxODkzLTAyMi0wMTA1NC050gEA?oc=5","id":"CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxODkzLTAyMi0wMTA1NC050gEA","guidislink":false,"published":"Mon, 06 Mar 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=3, tm_mday=6, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=65, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxODkzLTAyMi0wMTA1NC050gEA?oc=5\" target=\"_blank\">Towards circular plastics within planetary boundaries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Towards circular plastics within planetary boundaries - Nature.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiMmh0dHBzOi8vd3d3Lm5hdHVyZS5jb20vYXJ0aWNsZXMvczQxODkzLTAyMi0wMTA1NC050gEA?oc=5\" target=\"_blank\">Towards circular plastics within planetary boundaries<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nature.com<\/font>","source.href":"https:\/\/www.nature.com","source.title":"Nature.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Environmental impact mitigation\" \"new products\"+after:2023-03-01+before:2023-03-31","text":"Goal and scope of the study The goal of this study was to assess the planetary footprints of GHG mitigation strategies for the global production of plastics. To calculate planetary footprints, we apply LCA in combination with the planetary boundaries framework as proposed by ref. 22. As GHG mitigation strategies, we consider recycling, bio-based production and production via CCU, and compare their planetary footprints to the planetary footprints of fossil-based plastics. We use a bottom-up model covering >90% of global plastic production for 2030 (and 2050, Supplementary Information, section 3). The bottom-up model builds on the plastic production system from ref. 10 and includes plastic production, the supply chain and the disposal of plastics at the end of life. Functional unit In LCA, the functional unit quantifies the functions of the investigated product system. In this study, the function of the product system is the production and disposal of >90% of global plastics. To cover >90% of global plastics, we define the functional unit as the yearly global production and disposal of 14 large-volume plastics (summarized in Supplementary Table 5). We estimated the yearly production volumes for 2030 and 2050 based on the production volumes in 2015 and the annual growth rates shown in Supplementary Table 5. Our assessment includes plastic disposal. However, the production and disposal of plastics do not necessarily occur in the same year. For instance, while polyolefins used for plastic packaging have an average lifetime of 6 months, the average lifetime of polyurethane used in construction is 35 years11. Including the lifetime of plastics, and hence, the temporal difference between production and disposal, would lead to an increasing plastic stock. An increasing stock, in turn, represents a carbon sink during the production year that appears to enable the production of net-negative GHG emission plastics based on biomass or CCU. However, the plastic stock is not a permanent carbon sink, which would be required for producing net-negative GHG emission plastics55. To avoid misleading conclusions about net-negative bio- and CCU-based plastics, we assign the planetary footprints from disposal to the year of plastic production. Thereby, we conservatively assess the planetary footprints of plastics. In addition, we address the challenge highlighted in ref. 56 that the increasing demand for plastics renders determining the absolute sustainability of plastics difficult. We meet this challenge by assuming a steady-state production system with a recurring functional unit in the same amount every year. We thereby analyse discrete scenarios with constant consumption levels for plastics. Therefore, our conclusions depend on the accuracy of the demand forecasts and apply only to the production volumes considered. System boundaries We use cradle-to-grave system boundaries, including plastic production and supply chain, potential recycling and final disposal at the end of life. Assessing the use phase of plastics is not possible because of a lack of data. The versatile properties of plastics result in a wide range of applications that cannot be represented in a single study. Furthermore, it would be necessary to consider not only the emissions of the use phase (probably relatively small) but also the system-wide environmental consequences of using plastics in each application compared to other materials. Thus, a consequential assessment of the plastic use phase is desirable but beyond the scope of this study. The plastics supply chain includes several intermediate chemicals such as monomers, solvents or other reactants. The bottom-up model covers the production of all intermediate chemicals in the foreground system. As a background system, we use aggregated datasets from the LCA database ecoinvent. A list of all intermediate chemicals and all aggregated datasets can be found in Supplementary Information, section 1. In addition, the foreground system of the bottom-up model does not include environmental impacts from infrastructure and transportation because of a lack of data. However, we consider the environmental impacts of infrastructure and transportation from other industrial sectors by aggregated datasets, for example, from electricity generation and biomass cultivation. The bottom-up model includes the best available fossil-based technologies and the following technologies for plastic disposal and virgin production based on biomass and CCU. Plastic waste disposal The bottom-up model includes three options for plastic waste disposal: landfilling, incineration with energy recovery and recycling. Plastic waste can occur in several forms: as sorted fraction of municipal solid waste, as mixed plastics and residues from sorting, and as residues from mechanical recycling. For all fractions, we include waste incineration with energy recovery and landfilling. Landfilled plastic waste is assumed to degrade by approximately 1% of the contained carbon, which is in line with the ecoinvent database45. Mechanical recycling is only modelled for sorted fractions of packaging waste owing to impurities of mixed and non-packaging wastes. In contrast, chemical recycling can be applied to all plastic fractions. In this study, we model chemical recycling as pyrolysis to refinery feedstock, that is, naphtha. The pyrolysis has yields of 29 to 69% depending on the type of plastic (details in Supplementary Information, section 1). Furthermore, we include options for chemical recycling of plastic waste to monomers, which are still early-stage technologies. To derive the minimal necessary recycling rate in Fig. 5, we apply an optimistic scenario with a 95% yield of chemical recycling processes following common modelling in life-cycle inventories of chemicals (Supplementary Information, section 3)57. All calculations are constrained to maximum recycling rates of 94% as the remaining 6% are assumed to be the minimal landfilling rate until the middle of the century11. The assumption is based on historical trends in end-of-life treatment of plastics. Bio-based production Bio-based GHG mitigation is frequently discussed in the literature and is often associated with competition with the food industry58. To avoid competition with the food industry, the bottom-up model is restricted to lignocellulosic biomass as feedstock, that is, energy crops, forest residues and by-products from other industrial biomass processes (for example, bagasse). In this study, unless mentioned otherwise, we model biomass as energy crops because of their potential for large-scale application (Supplementary Information, section 3). However, we conduct a sensitivity analysis for other lignocellulosic biomass sources to assess the sustainability of bio-based plastics in more detail. For each biomass type, we account for the carbon uptake during the biomass growth phase by giving a credit corresponding to the biomass carbon content. We do not consider land use change emissions as current literature lacks an assessment of land use change effects on other Earth-system processes besides climate change. For biomass processing, we include the following high-maturity processes: gasification to syngas and fermentation to ethanol, and the subsequent conversion to methanol and ethylene (Supplementary Table 1). Methanol and ethylene can be further converted to propylene and aromatics, which all together represent the building blocks for all plastics in this study. CCU-based production CCU-based plastic production particularly requires CO 2 and hydrogen. For CO 2 supply, we consider CO 2 capture from highly concentrated point sources within the plastics supply chain. Highly concentrated point sources include the conventional fossil-based processes, ammonia production, steam methane reforming, ethylene oxide production, the bio-based processes for ethanol and syngas, and plastic waste incineration. Capturing from processes within the plastics supply chain is limited by the amount of CO 2 emitted by these processes and avoids the corresponding emissions. For these processes, we considered the energy demand for compressing the CO 2 with 0.4 MJ of electricity59. For waste incineration, we consider a decrease in energy output when capturing CO 2 . All further CO 2 sources are conservatively approximated by direct air capture. For 1 kg CO 2 captured via direct air capture, we include an uptake of 1 kg of CO 2 equivalent while considering the energy demand of 1.29 MJ electricity and 4.19 MJ heat60. Hydrogen for CCU is produced by water electrolysis, with an overall efficiency of 67%61. Previous studies have already shown that renewable electricity is required for CCU to be environmentally beneficial13. Thus, we conduct a sensitivity analysis for multiple electricity technologies to assess their influence on the sustainability of CCU-based plastics (Supplementary Information). For CCU-based production, we include high-maturity technologies, such as CO 2 -based methanol and methane, as well as subsequent production of olefins and aromatics (Supplementary Table 1). We do not consider CCS as an additional scenario, as fossil resources and storage capacities are ultimately limited. Therefore, CCS may serve as an interim solution for GHG mitigation but stands in contrast to long-term sustainability as the goal of this study. Pathway definition We assess nine pathways for the plastics industry towards sustainability. Pathway 1 is fossil-based plastic production (current recycling rate of 23%) that serves as a reference. We also include two pathways that combine all circular technologies: Pathway 2, which minimizes the climate change impact (climate-optimal), and pathway 3, which minimizes the maximal transgression of the share of SOS of the plastics industry (balanced) (Fig. 2). To assess the impact of switching from fossil to renewable feedstocks, we introduce pathway 4, which is bio-based, and pathway 5, which is CCU-based (Fig. 3). Pathways 4 and 5 include the current recycling rate of 23%. In addition, we introduce three pathways with the maximum recycling rates of 94%: pathway 6, in which the remaining virgin production is based on fossil resources; pathway 7, in which it is based on biomass; and pathway 8, in which it is based on CO 2 (Fig. 3). Pathway 9 combines biomass, CCU and recycling, and additionally includes chemical recycling of polymers to monomers to calculate the minimal recycling rate to achieve sustainable plastics (Fig. 5). The planetary boundaries framework We follow the recommendations for absolute environmental sustainability assessment in ref. 29 and choose the planetary boundaries framework for the assessment. The planetary boundaries framework suits the goal of the study best because of its precautionary principles for the definition of environmental thresholds, the SOS. We assess eight of the nine Earth-system processes suggested in ref. 21, namely, climate change, ocean acidification, changes in biosphere integrity, the biogeochemical flow of nitrogen and phosphorus (referred to as N cycle and P cycle), aerosol loading, freshwater use, stratospheric ozone depletion, and land-system change. We do not assess the Earth-system process of novel entities since neither control variables nor the boundary itself is yet adequately defined22. We consider the global boundaries for the Earth-system processes in line with the scope of this study. These global boundaries and the corresponding calculation of planetary footprints are subject to assumptions and thus incorporate uncertainty (Supplementary Information, section 2). For the two subprocesses for climate change (namely, atmospheric CO 2 concentration and energy imbalance at the top-of-atmosphere), we only consider the energy imbalance at the top-of-atmosphere quantified by radiative forcing. We focus on radiative forcing, as the control variable is more inclusive and fundamental, and the global limits are stricter than for atmospheric CO 2 concentration21. Thereby, we conservatively assess climate change. Biosphere integrity is divided into functional and genetic diversity of species. Preserving functional diversity ensures a stable ecosystem by maintaining all ecosystem services. We assess the functional diversity of species using the method proposed in ref. 18. The method covers the mean species abundance loss caused by the two main stressors, direct land use and GHG emissions, as a proxy for the biodiversity intactness index. Genetic diversity provides the long-term ability of the biosphere to persist under and adapt to gradual changes of the environment21. Genetic diversity is often approximated by the global extinction rate. However, using the global extinction rate does not fully cover variation of genetic composition, resulting in high uncertainties when quantifying genetic diversity18. Thus, we focus on functional diversity. Downscaling of the safe operating space As the plastics industry accounts for only a fraction of all human activities, we assign a share of the SOS to plastics. The plastics industry should operate within its assigned share to be considered environmentally sustainable. To assign a share of SOS to the plastics industry, we apply utilitarian downscaling principles. Utilitarian downscaling principles are tailored to maximize welfare in society29. We approximate welfare by consumption expenditure on plastics as an economic indicator for consumer preferences and human needs62. An extensive discussion on the other downscaling principles and their implications can be found in Supplementary Information. Although the final consumption expenditures on plastics are negligible, the industry consumes plastics to produce other goods and services. Accordingly, plastics are produced mostly in the upstream supply chain to support the final consumption of other goods and services. Thus, consuming other goods and services induces plastic production. To account for this inducement of plastic production, we used the total global plastic production x plastics to represent the global intermediate and final consumption expenditure on plastics. For this purpose, we use the gross output vector x of the product-by-product input–output table of EXIOBASE for the year 2020 (ref. 63). To calculate the share of SOS of the plastics industry, we divide the total global plastic production x plastics by the gross world product. The gross world product equals the total global final consumption expenditure. Analogously, we also consider the end-of-life treatment of plastics to be consistent with the system boundaries of the environmental assessment. We estimate the share of SOS for the plastics industry for 2030 and 2050 based on data for the year 2020. Accordingly, we assume that the market share of the plastics industry and, therefore, its share of SOS do not change in the coming years despite the increasing production volume of plastics. Thereby, we implicitly assume that all industries grow equally economically. Alternatively, economic forecasting models could estimate future market shares of plastics. However, applying economic forecasting models is complex, and the results would still be highly uncertain, especially if industry pursues low-carbon technology pathways. Therefore, estimating future market shares is beyond the scope of this study. Technology choice model To calculate the planetary footprint of plastics, we use a bottom-up model of the plastics industry. The model builds on the technology choice model (TCM) that allows for linear optimization of production systems27. The TCM represents the production system based on the following elements: technologies, intermediate flows, elementary flows and final demands. Ref. 27 describes each element in detail. The TCM is based on the established computational structure of LCA64. This structure arranges the data that represent the physical production system in the technology matrix A and the elementary flow matrix B. In the technology matrix A, columns represent technologies, and rows represent intermediate flows. Therefore, the coefficient a ij of the A matrix corresponds to an intermediate flow i that is either produced (a ij > 0) or consumed (a ij < 0) by technology j. The final demand describes the total output of plastics and the total input of plastic waste. Thus, the final demand corresponds to the functional unit. The final demand for intermediate flow i is described by entry y i in vector y. The elementary flow matrix B includes all technologies j and all elementary flows e, that is, flows that are exchanged between the production system and the environment. Accordingly, the coefficient b ej shows an elementary flow e that is either taken from (b ej < 0) or emitted to (b ej > 0) the environment by technology j. To calculate the environmental impacts of elementary flows, the elementary flows are characterized by the characterization matrix Q. In Q, columns represent elementary flows e, and rows represent life-cycle impact assessment methods z. We incorporated the life-cycle impact assessment methods for planetary boundaries proposed in refs. 18,22,23,24 as environmental impact categories in the Q matrix. In addition, we adapted several characterization factors to increase consistency (Supplementary Information, section 2). For each intermediate product, the bottom-up model includes multiple technologies, allowing for a choice between technologies. The TCM employs linear optimization to identify the technologies with the lowest environmental impact. As the goal of this study is to assess the sustainability of GHG mitigation strategies, we choose the climate change planetary footprint as the objective function, which can be calculated as $$PF_{CC} = q_{CC}Bs$$ (1) All other planetary footprints are calculated after the optimization. The scaling vector s is defined to adjust the quantities of intermediate and elementary flows. Overall, we define the optimization problem as $$\\min PF_{CC} = q_{CC}Bs$$ (2) $$s.t.\\,As = y$$ (3) $$s \\ge 0$$ (4) $$s \\le c$$ (5) $$q_zBs \\le PF_z$$ (6) where equation (3) specifies the production and consumption of the final demand, that is, the global demand for plastics and their end-of-life treatment. Equations (4) and (5) represent the constraints that the entries of the scaling vector must be between zero and an optional technology constraint (for example, a maximum recycling rate). Equation (6) defines additional optional constraints for planetary footprints in other Earth-system processes, for example, to calculate the minimum recycling rates at which plastics are produced within all planetary boundaries or to limit the maximal transgression of the share of SOS of the plastics industry. Limiting the maximum transgression is used to find the balanced solution in Fig. 2. We normalize the resulting planetary footprints by the SOS defined by ref. 21. Reporting summary Further information on research design is available in the Nature Portforlio Reporting Summary linked to this article.","filter_flag":1}
