{"title":"TREX Introduces TREX SIGNATURE DECKING | ProBuilder - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RyZXgtaW50cm9kdWNlcy10cmV4LXNpZ25hdHVyZS1kZWNraW5n0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RyZXgtaW50cm9kdWNlcy10cmV4LXNpZ25hdHVyZS1kZWNraW5n0gEA?oc=5","id":"CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RyZXgtaW50cm9kdWNlcy10cmV4LXNpZ25hdHVyZS1kZWNraW5n0gEA","guidislink":false,"published":"Thu, 02 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=2, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=33, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RyZXgtaW50cm9kdWNlcy10cmV4LXNpZ25hdHVyZS1kZWNraW5n0gEA?oc=5\" target=\"_blank\">TREX Introduces TREX SIGNATURE DECKING | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"TREX Introduces TREX SIGNATURE DECKING | ProBuilder - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiQWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RyZXgtaW50cm9kdWNlcy10cmV4LXNpZ25hdHVyZS1kZWNraW5n0gEA?oc=5\" target=\"_blank\">TREX Introduces TREX SIGNATURE DECKING | ProBuilder<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Reclaimed Materials\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"WINCHESTER, Va., (February 2, 2023) – Once again, Trex, maker of high-performance, low-maintenance composite decking and railing, is revolutionizing outdoor living with the introduction of its latest innovation—Trex Signature decking. This premium offering from the category inventor and industry leader pioneers a realistic woodgrain that raises the bar for beauty, performance and sustainability, and is now available in designated markets across the West Coast, Northeast and Mid-Atlantic regions of the U.S. “Trex Signature marks a watershed moment for composite decking,” said Adam Zambanini, president of Trex Residential. “Just as Trex Transcend® shattered preconceived notions about how composites perform, Trex Signature elevates the premium composite decking category with the achievement of the most authentic wood aesthetics to date.” Introducing an altogether new decking material for those who find joy at home and inspiration in nature, Trex Signature is crafted with the natural look of interior hardwoods but engineered to withstand the elements and demands of the outdoors. Establishing the next category for composite decking, Trex Signature features a whole new level of realism for wood plastic composites (WPC). “Today’s design-savvy consumers seek the highest style expressions for their homes and are willing to pay a premium for the quality, performance and aesthetic they desire,” explained Zambanini. “As the pinnacle of style in the composite decking category, Trex Signature offers a seamless transition from indoors to outside with decking that is distinctively durable and luxuriously crafted.” Positioned as the brand’s top-of-the-line product, Trex Signature delivers an unparalleled look that replicates the graining and color richness of real wood in two luxurious hues inspired by stunning natural settings: Ocracoke evokes the rich dark browns found on the secluded North Carolina island where nature is sheltered by sandy dunes and marshy shores. Whidbey features variated grey hues reminiscent of the misty cliffs of the island in Washington State where salt-washed fog rolls in like a morning blanket. In addition to its unmatched aesthetics and performance, Trex Signature is sustainably made from recycled and reclaimed materials, making it ideal for today’s increasingly eco-conscious consumers. Like all Trex decking, Signature is engineered to endure the rigors of time and nature. A periodic cleaning with soap and water is all that is needed to keep the pristine surface looking like new for decades. Further enriching its appeal, the new line is backed by an industry-leading 50-year limited residential warranty and is complemented by the full range of Trex Signature railing, including numerous design options like mesh rail, rod rail and glass panels. “Signature is a tastefully distinct innovation from the brand that started it all,” added Zambanini. “From its impeccably resilient core to its beautifully designed surface, it is a next-generation product that creates a new category for outdoor living.” Prospective customers within the designated markets across the West Coast, Northeast and Mid-Atlantic can learn more about Trex Signature decking and find Signature Specialty Sellers by visiting Signature.Trex.com. ###","filter_flag":1}
{"title":"The European startups transforming supply chains, according to VCs - Sifted","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N1cHBseS1jaGFpbi1zdGFydHVwcy10by13YXRjaNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N1cHBseS1jaGFpbi1zdGFydHVwcy10by13YXRjaNIBAA?oc=5","id":"CBMiOWh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N1cHBseS1jaGFpbi1zdGFydHVwcy10by13YXRjaNIBAA","guidislink":false,"published":"Wed, 22 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=22, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=53, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N1cHBseS1jaGFpbi1zdGFydHVwcy10by13YXRjaNIBAA?oc=5\" target=\"_blank\">The European startups transforming supply chains, according to VCs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sifted<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"The European startups transforming supply chains, according to VCs - Sifted","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiOWh0dHBzOi8vc2lmdGVkLmV1L2FydGljbGVzL3N1cHBseS1jaGFpbi1zdGFydHVwcy10by13YXRjaNIBAA?oc=5\" target=\"_blank\">The European startups transforming supply chains, according to VCs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sifted<\/font>","source.href":"https:\/\/sifted.eu","source.title":"Sifted","query":"https:\/\/news.google.com\/rss\/search?q=\"Reclaimed Materials\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Supply chains can be precarious things — events like the pandemic or the Suez Canal blockage in 2021 can throw them out of whack and cause global disruption. They 're also not often particularly climate-friendly — something companies are under pressure to change. That leaves an open space for startups to fill. And there’s a growing number working to make supply chains run as smoothly, and greenly, as possible. Sifted turned to three European investors focused on logistics for the ones they have on their radar. Jan-Hendrik Bürk, partner at btov Partners Btov Partners is a European VC firm focused on early-stage investments in digital and industrial technology companies. Advertisement Ecoplanet — Germany In light of surging energy prices and a stronger push for companies to join the green energy transition, we've observed a market pull for holistic energy management and procurement for currently underserved SMEs. Integrating smart meter data, Ecoplanet’s B2B energy platform is a cost-efficient method for users to optimise energy consumption. On-site consumption is minimised via auto-generated optimisation measures and automated consumer control. This is paired with AI-based procurement, tailored to companies’ individual consumption characteristics. Medishout — UK Medishout digitally connects hospital teams with their suppliers to efficiently report operational issues such as broken equipment. Medishout is one of the few SaaS companies whose initial value proposition simultaneously benefits several health stakeholders. It benefits: Patients (through greater quality of care at lower waiting times); Care providers (through decreased downtime and thus higher utilisation rates); Equipment manufacturers (through lower process costs and enhanced customer relationships, leading to more sales). Florian Reichert, managing director and partner at Picus Capital Picus Capital is an early-stage tech investment firm based in Munich. Root Global — Germany We continue to see great potential in solutions unlocking transparency across stakeholders in a supply chain. Root is a good example of this. The company builds software to enable food and beverage companies to reduce their environmental impact. For producing companies, most of their impact typically lies in their supply chain, making reductions difficult to control. Root provides data that shows reduction measures companies can take, allowing improved supplier selection and emissions reporting. The food industry, and meat and dairy in particular, is a highly attractive vertical given its particular supply chain characteristics. Trawa — Germany Since the beginning of 2022, companies need to consider energy as an additional element in their value chain, as it's become a significantly larger cost driver than before, and therefore causes more complex planning exercises. Trawa is building a full-stack energy procurement solution, which is one of the most crucial parts in the supply chain (eg. for manufacturing businesses). Its product enables customers to more optimally procure energy, to increase transparency of consumption and efficiency in their operations and recommends measures to reduce consumption and how to shift to more sustainable energy sources. It allows smaller businesses to get access to the same power purchase agreements (longer term, cheaper contracts) on energy as corporate companies. Trawa's positioning is very strategic and allows customers to manage all energy-related supply chain operations on the platform. Advertisement Sebastian Peck, partner at Kompas VC Kompas VC is a European early-stage fund focused on the decarbonisation and digitalisation of the built environment and the manufacturing industry. GreenDozer — Denmark Circularity is becoming an important principle in the creation of new products, from car batteries to buildings, and we expect that the legally required share of recycled and reclaimed materials in new products will steadily increase. In the Netherlands, for example, the government has set targets to halve the use of primary materials in construction by 2030 and create a circular economy with net-zero carbon emissions for the sector by 2050. “Urban mining” companies like Green Dozer are creating scalable supplies of reusable materials for building material manufacturers and construction companies, thus contributing to these goals. The company’s online platform supplies recycled building materials, which are sourced from demolition projects or surplus from construction sites. It’s signed up three of the four largest demolition companies in Denmark to secure scalable supplies, and is enjoying regulatory tailwinds as the country will increasingly require buildings to be systematically disassembled so materials can be reused. While urban mining companies still have to demonstrate that they can scale rapidly and deliver outsized returns, this is definitely a space to watch.","filter_flag":1}
