{"title":"Products That Raise the Bar on Home Water Savings and Efficiency - Pro Builder","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RoZXNlLXByb2R1Y3RzLXJhaXNlLWJhci1ob21lLXdhdGVyLXNhdmluZ3MtZWZmaWNpZW5jedIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RoZXNlLXByb2R1Y3RzLXJhaXNlLWJhci1ob21lLXdhdGVyLXNhdmluZ3MtZWZmaWNpZW5jedIBAA?oc=5","id":"CBMiUWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RoZXNlLXByb2R1Y3RzLXJhaXNlLWJhci1ob21lLXdhdGVyLXNhdmluZ3MtZWZmaWNpZW5jedIBAA","guidislink":false,"published":"Tue, 11 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=101, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RoZXNlLXByb2R1Y3RzLXJhaXNlLWJhci1ob21lLXdhdGVyLXNhdmluZ3MtZWZmaWNpZW5jedIBAA?oc=5\" target=\"_blank\">Products That Raise the Bar on Home Water Savings and Efficiency<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Products That Raise the Bar on Home Water Savings and Efficiency - Pro Builder","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiUWh0dHBzOi8vd3d3LnByb2J1aWxkZXIuY29tL3RoZXNlLXByb2R1Y3RzLXJhaXNlLWJhci1ob21lLXdhdGVyLXNhdmluZ3MtZWZmaWNpZW5jedIBAA?oc=5\" target=\"_blank\">Products That Raise the Bar on Home Water Savings and Efficiency<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Pro Builder<\/font>","source.href":"https:\/\/www.probuilder.com","source.title":"Pro Builder","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Efficiency\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"With many communities in the U.S. now enforcing water restrictions, homeowners in locales across the nation increasingly face the question of how to ensure a clean, reliable water supply for their homes. Home builders can play an important role in helping homeowners reduce water demand and ensure water quality by installing fixtures and fittings that use water wisely. The water-saving technologies and appliances below provide a range of options that can help homeowners ease the burden on their local water supply and ensure the water in their homes is free of contaminants, while saving money in the process. Smart dishwasher from Beko Beko’s 24-Inch Smart Built-In Dishwasher is Wi-Fi enabled and features nine wash cycles, an EverClean Filter, and interior lighting. The DDT39434X dishwasher is Energy Star certified and uses just 47% of the Department of Energy’s (DOE) recommended gallons per wash, amounting to hundreds of gallons saved annually, the company says. Water-saving toilets by Icera Icera’s Malibu Suite collection features six toilet configurations designed with the company’s patented EcoQuattro gravity flush technology, which conserves water and is low maintenance. Like Icera’s other toilets, Malibu Suite toilets use less than 1.28 gallons per flush and are certified as EPA WaterSense compliant. Kohler digital shower valves for total control Anthem Digital Valves from Kohler act as the control center for the company’s Statement Shower Collection, offering users complete control over temperature, pressure, and sprays. Anthem Digital allows for total personalization of any combination of shower sprays, rainheads, showerheads, hand showers, and body sprays. Its precision-control feature allows homeowners to create 10 programmed presets, and the digital display also provides information about water consumption at the end of each shower. Bosch dishwasher with leak protection Bosch’s 800 Series 24-Inch Built-In Bar Handle Dishwasher is designed for water efficiency with a 1-hour run time, an AquaStop leak protection feature, and an energy output of just 269 kWh per year. The unit is Energy Star certified and uses 55% of the DOE’s recommended number of gallons of water per wash cycle. Energy-saving tankless water heater from Rheem Rheem’s ProTerra Hybrid Electric Water Heater draws heat from the air around it to work like a standard electric water heater when the air is too cold, ensuring hot water year round, the company says. The unit protects the home from water damage with a leak detection and prevention system that limits leaks to no more than 20 ounces of water, and as one of the most efficient water heaters on the market with up to a 4.07 Uniform Energy Factor (UEF)*, Rheem says the ProTerra Hybrid heater can save homeowners up to $491 per year in energy costs. *Uniform Energy Factor (UEF) is the latest measure of water heater overall efficiency. The higher the UEF value, the more efficient the water heater. GE auto-cycle dishwasher GE’s 24-Inch Smart Built-In Dishwasher connects to Wi-Fi for remote user control and includes an Autosense Cycle that measures soil levels and water temperature so it can adjust to the ideal cycle time and never use more water than needed. The GE Profile PDT785SYNFS unit offers both energy and water efficiency and is Energy Star certified. Soake Pool's plunge pool for energy efficiency Soake Pools’ plunge pools use about 80% less water than a typical large in-ground pool, the company says, and that smaller water volume reduces the amount of energy needed to heat the pool. The company’s plunge pools also exclusively use variable speed pumps for additional energy-efficient programming. New color for the Oasense smarter showerhead The Oasense Reva smart sensor showerhead is 100% water-powered and lets users enjoy a full-pressure, high-flow rate shower while saving 50% of the shower water, according to the company. Smart sensors in the showerhead automatically reduce water flow to 15% when the user isn’t actively rinsing, resuming full-pressure flow whenever the user steps back in, so the showering experience isn't compromised by saving water and energy. Now available in a Matte Black color option. Under-sink water filtration from Kraus The Purita 2-Stage Carbon Block Under-Sink Water Filtration System from Kraus minimizes water waste by providing purified water on demand at the kitchen sink. The unit removes impurities as small as 0.5 microns, reducing contaminants such as lead, select pharmaceuticals, and volatile organic compounds without any chlorine taste or odor. The eco-friendly filters provide as much clean water as 5,300 standard 16.9-ounce bottles, and their long-lasting cartridges filter up to 700 gallons of water and last up to six months before they need to be replaced. Leak detection and water monitoring by Kohler Kohler’s H2Wise+ water monitor is installed onto the main water line so homeowners can shut off the main water supply automatically and remotely when a leak is detected. The system runs regular diagnostics of the entire home’s plumbing to detect hidden issues, tracks daily water use by each fixture and faucet in the home, and provides pre-freeze warnings to help prevent burst pipes. RELATED Wi-Fi leak shut-off valve by Resideo Resideo’s Braukmann L5 WiFi Water Leak Shutoff Valve connects to the main water supply and can automatically shut off the supply to the home if a water leak is detected either by a sensor cable or a paired Resideo WiFi Water Leak and Freeze Detector. The valve is easy to install and can be monitored using the Resideo App. Vacuum-assist toilet from Niagara The Phantom One Piece toilet from Niagara includes the company’s patented Stealth Technology for a water-efficient flush with a vacuum-assist pull and a noise-canceling tank. The new Phantom One Piece is MaP Premium rated, WaterSense certified, and surpasses all industry drain line carry standards, the company says. Signature Kitchen Suite dishwasher with steam Signature Kitchen Suite’s PowerSteam Stainless Steel Dishwasher saves time and water by eliminating the need to pre-wash thanks to its multiple steam cycles, which help to dissolve caked-on food, the company says. QuadWash technology features four multi-motion wash arms that rotate back and forth while spinning to power-clean dishes from multiple angles throughout the wash process, and the Energy Star–rated unit uses an average of just 2.9 gallons per cycle. Kohler double-cartridge water purifier Aquifer, Kohler’s double-cartridge water filtration system, is designed with filters made from ground coconut shells for an eco-friendly filtration process. The Aquifer system effectively reduces contaminants including lead, mercury, chlorine, and pharmaceuticals without compromising the faucet’s performance, according to the company. Push-to-connect pipe fittings by Uponor Designed for use with PEX, PE-RT, CPVC, and copper piping systems, TotalFit is Uponor’s newest engineered polymer (EP), push-to-connect fitting solution ideal for service repair, maintenance, remodels, and retrofits for potable hot-water and cold-water distribution piping systems. The TotalFit line includes 33 push-to-connect fittings in sizes from 1\/2-inch to 1-inch diameter. Leak and flood detection from Flowban Flowban’s leak and flood detection device monitors the water level in sinks and bathtubs and automatically shuts off the water to bathroom faucets before an overflow occurs. The Flowban system reacts when the water reaches a certain level in the tub to prevent flooding and resets itself automatically as soon as the faucets are turned off. Neoperl water-pressure limiter Neoperl’s Pressure Limiters regulate and reduce downstream pressure for showers, washing machines, and dishwashers. With the Pressure Limiter DS, Neoperl now offers a solution for water efficiency for pressure-sensitive applications both in dynamic mode (open outlet\/water flows) and in static mode (closed outlet\/static pressure). A customized showering experience from Brizo The SensoriPlus Digital Thermostatic Custom Shower from Brizo gives users complete control over their showering experience, automating everything from temperature and music to water flow. The system includes four user profiles, with multiple presets for a more comfortable, efficient shower.","filter_flag":1}
{"title":"Flume Q1 2023 Residential Water Use Index Ranks Indoor Efficiency By State - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZsdW1lLXExLTIwMjMtcmVzaWRlbnRpYWwtd2F0ZXItdXNlLWluZGV4LXJhbmtzLWluZG9vci1lZmZpY2llbmN5LWJ5LXN0YXRlLTMwMTgwMjYyMy5odG1s0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZsdW1lLXExLTIwMjMtcmVzaWRlbnRpYWwtd2F0ZXItdXNlLWluZGV4LXJhbmtzLWluZG9vci1lZmZpY2llbmN5LWJ5LXN0YXRlLTMwMTgwMjYyMy5odG1s0gEA?oc=5","id":"CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZsdW1lLXExLTIwMjMtcmVzaWRlbnRpYWwtd2F0ZXItdXNlLWluZGV4LXJhbmtzLWluZG9vci1lZmZpY2llbmN5LWJ5LXN0YXRlLTMwMTgwMjYyMy5odG1s0gEA","guidislink":false,"published":"Thu, 20 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=20, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=110, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZsdW1lLXExLTIwMjMtcmVzaWRlbnRpYWwtd2F0ZXItdXNlLWluZGV4LXJhbmtzLWluZG9vci1lZmZpY2llbmN5LWJ5LXN0YXRlLTMwMTgwMjYyMy5odG1s0gEA?oc=5\" target=\"_blank\">Flume Q1 2023 Residential Water Use Index Ranks Indoor Efficiency By State<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Flume Q1 2023 Residential Water Use Index Ranks Indoor Efficiency By State - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiggFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2ZsdW1lLXExLTIwMjMtcmVzaWRlbnRpYWwtd2F0ZXItdXNlLWluZGV4LXJhbmtzLWluZG9vci1lZmZpY2llbmN5LWJ5LXN0YXRlLTMwMTgwMjYyMy5odG1s0gEA?oc=5\" target=\"_blank\">Flume Q1 2023 Residential Water Use Index Ranks Indoor Efficiency By State<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Efficiency\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Flume Data Labs Analyzes Efficiency Based on Policy Trends SAN LUIS OBISPO, Calif., April 20, 2023 \/PRNewswire\/ -- Flume Data Labs released the Q1 2023 update to the Household Water Use Index , the leading measure of U.S. household water use. Flume Data Labs publishes the Household Water Use Index quarterly, regularly assessing water use from single-family homes in the largest 15 Metropolitan Statistical Areas (MSAs). Analysis is based on data from tens of thousands of Flume sensors installed on household water meters across the nation. Indoor and Outdoor Water Use Flume Data Labs publishes the Household Water Use Index quarterly, regularly assessing water use in homes across the US. Post this The Impact of State Codes on Toilet Efficiency During Q1 2023, the average residential indoor use in the 15 largest MSAs was 38.0 Gallons per Capita per Day (GPCD). Regionally, the range of indoor water use varied by area. The Phoenix Metro Area consistently had the highest indoor use in Q1 2023, averaging 48.5 GPCD. The San Francisco Bay MSA had the lowest indoor use, averaging 30.3 GPCD in Q1 2023 – the lowest indoor quarterly use measured to date. The Flume Index also shows outdoor water use patterns during Q1 2023. Average outdoor Gallons per Household per Day (GPHD) was highest in the Miami MSA during Q1 2023, averaging around 139.7 GPHD. The Boston MSA had the lowest outdoor water use, with 20.5 GPHD during Q1 2023. Outdoor water use patterns vary widely by season, with winter being the lowest use across MSAs. The Impact of State Efficiency Standards on Water Use Across the United States, state law governs the efficiency level of fixtures and appliances sold and installed in the state. Last year, the Alliance for Water Efficiency (AWE) published the 2022 U.S. State Policy Scorecard for Water Efficiency and Sustainability. This scorecard ranked each U.S. state based on its adoption and implementation of state-level laws and policies that advance water efficiency, conservation, sustainability, and affordability. \"Adoption and implementation of water efficiency laws vary widely across the U.S.,\" said Ron Burke, President and CEO of AWE. \"The Scorecard is intended to encourage state action by identifying exemplary laws and policies as well as opportunities for improvement.\" The scorecard alone, however, is not a measure of how efficiently water is used in each state. Using data pulled from sensors across the country, Flume overlaid the average indoor residential water use of each state with the fixture efficiency rules from AWE's scorecard. This analysis found that homes located in states with more comprehensive fixture efficiency standards have the lowest average indoor water use. Homes in states lacking fixture standards had the highest average indoor use. Additional analysis by Flume of homes in Southern California demonstrates that the very newest homes are equipped with the most water-efficient toilets and also have the lowest indoor water use. \"Flume's data show that state-level fixture efficiency standards do seem to be having an impact,\" said Peter Mayer, P.E., Principal of WaterDM. \"People living in states with comprehensive efficiency standards use less water on average than people living in states without these measures in place and the data show the newest homes use the least water indoors.\" To view an interactive dashboard showing this data and to learn more about the Flume Data Labs Household Water Use Index, visit Flume Data Labs at www.flumedatalabs.com or contact us at [email protected] . To learn more about the Alliance for Water Efficiency's 2022 State Policy Scorecard for Water Efficiency and Sustainability, click here . Also available are the Executive Summary, the 2022 Scorecard Full Report , and Individual State Scorecards . About Flume Data Labs Flume Data Labs understands the unique challenges faced by organizations that touch water. Flume Data Labs uses real-time data monitoring to collect and understand how residential water is used. Utilizing a nationwide network of data sensors and one-of-a-kind analysis, Flume Data Labs provides dynamic informed analysis in response to changing conditions and local challenges. To date, Flume Data Labs has tens of thousands of devices installed across the United States. Visit us at www.flumedatalabs.com or contact us at [email protected] to learn more. About the Alliance for Water Efficiency The Alliance for Water Efficiency (AWE) is a nonprofit organization with more than 500 organizational members dedicated to the efficient and sustainable use of water across North America. AWE provides training, research, and other resources for water efficiency professionals, and we encourage the public to conserve water through tools like our Home Water Works Calculator. In addition, AWE advocates for products, programs, and policies that advance water efficiency. Learn more by visiting our website at www.allianceforwaterefficiency.org or emailing us at [email protected] . SOURCE Flume, Inc.","filter_flag":1}
{"title":"Grolsch Brewing Company: Drink Sustainably - Blog - Business & Environment - Harvard Business School","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3Lmhicy5lZHUvZW52aXJvbm1lbnQvYmxvZy9wb3N0L0lGQy1Hcm9sc2No0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3Lmhicy5lZHUvZW52aXJvbm1lbnQvYmxvZy9wb3N0L0lGQy1Hcm9sc2No0gEA?oc=5","id":"CBMiNWh0dHBzOi8vd3d3Lmhicy5lZHUvZW52aXJvbm1lbnQvYmxvZy9wb3N0L0lGQy1Hcm9sc2No0gEA","guidislink":false,"published":"Thu, 13 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=13, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=103, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3Lmhicy5lZHUvZW52aXJvbm1lbnQvYmxvZy9wb3N0L0lGQy1Hcm9sc2No0gEA?oc=5\" target=\"_blank\">Grolsch Brewing Company: Drink Sustainably - Blog - Business & Environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Harvard Business School<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Grolsch Brewing Company: Drink Sustainably - Blog - Business & Environment - Harvard Business School","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiNWh0dHBzOi8vd3d3Lmhicy5lZHUvZW52aXJvbm1lbnQvYmxvZy9wb3N0L0lGQy1Hcm9sc2No0gEA?oc=5\" target=\"_blank\">Grolsch Brewing Company: Drink Sustainably - Blog - Business & Environment<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Harvard Business School<\/font>","source.href":"https:\/\/www.hbs.edu","source.title":"Harvard Business School","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Efficiency\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"In January 2023, Professors Willy Shih and Mike Toffel led more than 40 HBS MBA students on site visits to witness the energy transition and innovative sustainable production activities throughout Denmark and the Netherlands, in their new Immersive Field Course (IFC). This is one of 13 student essays posted on the HBS Business and Environment Initiative’s Blog that highlights their reflections. Learn more about this IFC course on Decarbonization and Sustainable Production by watching this five minute video summary. Visit Date: January 11, 2023 At Grolsch Brewery in the eastern Netherlands city of Enschede, our group of students heard about the beer company’s corporate sustainability initiatives, saw these initiatives in action during our brewery tour, and then got to taste their results in an on-site beer sampling. Their innovations ranged from sustainable packaging to resource efficiency to heat and energy sourcing. Many of these initiatives were reminiscent of practices at other sites we had visited over the past two weeks, even in different industries, which helped us tie together many of the threads and outstanding questions that arose throughout our trip. Our class at the Grolsch Brewery in Enschede, the Netherlands. Highlights: Product and Operational Sustainability Initiatives Sustainable Packaging. One of the most surprising facts we learned at Grolsch is that the average beer bottle in the Netherlands is recycled 25 times. Dutch consumers are used to recycling their beer bottles at their local supermarket, which sends bottles back to brewers to be cleaned and refilled with new products. In this way, their standard bottling practices already reflect their ambitions to maximize circularity. Beyond this baseline, Grolsch shared that they’ve recently innovated a recyclable cardboard “TopClip” to replace the conventional glue and plastic approach to hold a six-pack together. We learned that this innovation has resulted in significant savings in methane emissions. Grolsch is also investigating potential alternatives to plastics for its other shipping packaging. Resource Efficiency. In 2004, Grolsch had a beer-to-water ratio of 1:5.5, indicating a high water intensity of beer production. By 2022 they had gotten that ratio down to 1:3.8 and are continuing to improve their water efficiency through initiatives such as reusing wastewater for cleaning production facilities. They’re also starting work with distributors and retailers such as pubs and restaurants that serve Grolsch beers and perform “sustainability scans” to increase drafting efficiency and reduce “beer loss.” Heat and Energy. Grolsch has transitioned from three natural gas-powered boilers powering their brewery in 2008 to one back-up boiler today by switching to sourcing “green heat” from nearby sustainable energy producer, Twence, which uses renewable energy sources to deliver piped hot water to the brewery. Grolsch is also working on converting its own biogas from brewery operations into biogas (renewable natural gas). Key Takeaways: Crisis Times, Regulation and Collaboration One of our biggest takeaways from this visit was the extent to which the current European energy crisis altered the payback periods for their in-flight (ongoing) and potential upcoming sustainability investments. At Grolsch and many other sites, we consistently heard that times of crisis can also be times of transition and opportunity because spikes in energy prices can improve the business cases for investment in renewable projects. Another takeaway was the extent to which Grolsch and many other companies we visited were supportive of market interventions by government policy and regulation to encourage sustainable investments. For example, Grolsch shared that taxes on landfilling (which is now prohibited in the Netherlands) and water pollution helped shorten the payback periods of various sustainability projects that they were consequently able to invest in. Finally, another major takeaway was the extent to which industry collaboration can drive sustainability improvements across the board. When we asked Grolsch whether they shared their sustainability innovations with other brewers in the region, they confirmed that collaboration on sustainable technology was a norm in the industry and region, and that they saw sustainable technology sharing as a crucial component of driving necessary change. Our Remaining Questions Supply Chain Emissions. Although Grolsch shared some sustainability initiatives in their supply chain, including a pilot program equipping commercial trucks with solar panels that power the trucks loading and unloading chain, we remain curious about other supply chain initiatives. Specifically, we wonder about the environmental impacts of the raw material inputs like barley and hops, and any programs they might be considering to source these feedstocks more sustainably or increase their use efficiency. Consumer Behavioral Change. Throughout the tour of sites around Denmark and the Netherlands, our group asked many of our hosts how they thought their learnings might apply to other markets like the United States. This question was particularly relevant at Grolsch, where bottle recycling was a big component of their circularity and dependent on the common Dutch practice of consumers consistently returning used bottles to supermarkets. We visited several other sites where encouraging consumer product-return was a major challenge because of the behavioral change required for that industry, hence we continued to wrestle with the question of how consumer bottle return for refilling could be normalized in other markets. Regulatory Pathways. Because Grolsch was so forthcoming about how policy and regulation helped make viable business cases for their sustainable investments, our group thought about potential pathways to similar regulations in other markets. While we heard from lobbyists at several other sites we visited, many of us continued to discuss what types of lobbying and policies might be best suited to sustainability transformations in other industries and geographies. ----- Read more posts in the IFC Series: Deconstructing LEGO’s Decarbonization Port Esbjerg: Deploying Offshore Wind HySynergy and Crossbridge Energy Grundfos: Innovation & Inspiration for Sustainable Product Design Arla Foods: How Sustainable Can A Dairy Company Be? Novo Nordisk Amager Bakke: A Look into the Future of Waste Incineration Maersk’s Journey to Decarbonize Shipping Circularity in Denmark BTG Bioliquids: Creating Fast Pyrolysis Bio-Oil from Biomass Residue Streams Grolsch Brewing Company: Drink Sustainably Van den Ende Rozen: Greenhouse Rose Production Koppert Cress: Macro Greenhouses, Microgreens","filter_flag":1}
{"title":"Making Better Essential: Pentair Showcases Positive Impact on People and the Planet in 2022 Corporate ... - businesswire.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiswFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQxODAwNTU0MC9lbi9NYWtpbmctQmV0dGVyLUVzc2VudGlhbC1QZW50YWlyLVNob3djYXNlcy1Qb3NpdGl2ZS1JbXBhY3Qtb24tUGVvcGxlLWFuZC10aGUtUGxhbmV0LWluLTIwMjItQ29ycG9yYXRlLVJlc3BvbnNpYmlsaXR5LVJlcG9ydNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiswFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQxODAwNTU0MC9lbi9NYWtpbmctQmV0dGVyLUVzc2VudGlhbC1QZW50YWlyLVNob3djYXNlcy1Qb3NpdGl2ZS1JbXBhY3Qtb24tUGVvcGxlLWFuZC10aGUtUGxhbmV0LWluLTIwMjItQ29ycG9yYXRlLVJlc3BvbnNpYmlsaXR5LVJlcG9ydNIBAA?oc=5","id":"CBMiswFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQxODAwNTU0MC9lbi9NYWtpbmctQmV0dGVyLUVzc2VudGlhbC1QZW50YWlyLVNob3djYXNlcy1Qb3NpdGl2ZS1JbXBhY3Qtb24tUGVvcGxlLWFuZC10aGUtUGxhbmV0LWluLTIwMjItQ29ycG9yYXRlLVJlc3BvbnNpYmlsaXR5LVJlcG9ydNIBAA","guidislink":false,"published":"Tue, 18 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=18, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=108, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiswFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQxODAwNTU0MC9lbi9NYWtpbmctQmV0dGVyLUVzc2VudGlhbC1QZW50YWlyLVNob3djYXNlcy1Qb3NpdGl2ZS1JbXBhY3Qtb24tUGVvcGxlLWFuZC10aGUtUGxhbmV0LWluLTIwMjItQ29ycG9yYXRlLVJlc3BvbnNpYmlsaXR5LVJlcG9ydNIBAA?oc=5\" target=\"_blank\">Making Better Essential: Pentair Showcases Positive Impact on People and the Planet in 2022 Corporate ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Making Better Essential: Pentair Showcases Positive Impact on People and the Planet in 2022 Corporate ... - businesswire.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiswFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQxODAwNTU0MC9lbi9NYWtpbmctQmV0dGVyLUVzc2VudGlhbC1QZW50YWlyLVNob3djYXNlcy1Qb3NpdGl2ZS1JbXBhY3Qtb24tUGVvcGxlLWFuZC10aGUtUGxhbmV0LWluLTIwMjItQ29ycG9yYXRlLVJlc3BvbnNpYmlsaXR5LVJlcG9ydNIBAA?oc=5\" target=\"_blank\">Making Better Essential: Pentair Showcases Positive Impact on People and the Planet in 2022 Corporate ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">businesswire.com<\/font>","source.href":"https:\/\/www.businesswire.com","source.title":"businesswire.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Efficiency\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"LONDON--(BUSINESS WIRE)--Pentair, (NYSE: PNR) a leader in helping the world sustainably move, improve and enjoy water, life’s most essential resource, today released its 2022 Corporate Responsibility Report, reporting on the Company’s efforts toward Making Better Essential through its products and solutions, for people and the planet. “At Pentair, our social responsibility efforts and corporate responsibility program are guided by ‘Making Better Essential,’” said John L. Stauch, Pentair President and CEO. “Minimizing the impact on the environment is essential to the products we create, the solutions we offer, the customers we serve, and how we operate. With our mission of helping the world sustainably move, improve and enjoy water, we believe that we can make our planet better and address the world’s toughest water challenges.” The Report highlights progress towards Pentair’s Social Responsibility Strategic Targets that are focused in the areas that matter to employees, customers and shareholders, including the following highlights from 2022: Carbon Footprint Reduction Progress Highlights*: Pentair’s total Scope 1 and 2 greenhouse gas emissions decreased 29% compared to the 2019 baseline. Pentair’s total Scope 1 and 2 compared to the 2019 baseline. Water Reduction Progress Highlights*: Pentair’s absolute water withdrawal within its operations decreased 0.7% compared to the 2019 baseline, and represents a 9.3% decrease compared to 2021. Pentair’s compared to the 2019 baseline, and represents a Design for Sustainability Progress Highlights: 100% of Pentair’s new products were assessed through a Product Sustainability Scorecard . In addition: Pentair further advanced its innovation process by including sustainability as a required factor for review, along with the review of other product attributes, as part of the product commercialization process. Pentair developed standard processes for assessing product sustainability impact claims and implemented a life cycle assessment tool. . In addition: Responsible Supply Chain Progress Highlights: Pentair successfully launched a refreshed and enhanced Supplier Code of Conduct. The Company also launched a new supplier Environmental, Social and Governance (ESG) assessment process in collaboration with a third-party expert and assessed the ESG maturity of approximately 46% of its top 80% of existing suppliers by spend. Pentair successfully launched a refreshed and enhanced Supplier Code of Conduct. The Company also in collaboration with a third-party expert and assessed the ESG maturity of approximately 46% of its top 80% of existing suppliers by spend. Inclusion & Diversity Progress Highlights*: Focused efforts continue to improve diversity representation: Pentair’s representation of women in its workforce was 32% (2019 baseline of 30%), and women in leadership positions was 32% (2019 baseline of 28%). Its U.S. people of color (POC) representation in its workforce was 40% (2019 baseline of 39%) and its U.S. POC representation in leadership positions was 25% (2019 baseline of 23%). “This past year was an exciting one for Pentair as we continued our advancements toward being a leading sustainability company. I am proud of our accomplishments as we drove critical progress across our strategic targets,” said Karla Robertson, Executive Vice President, General Counsel, Secretary, and Chief Social Responsibility Officer. “We look forward to furthering our positive impact while delivering products and solutions that help the world sustainably move, improve and enjoy water, life’s most essential resource.” The positive impact of Pentair’s products and solutions and workplace initiatives in 2022 is meaningful, as further highlighted within the Report: 83% of solutions supported energy efficiency by requiring less energy to operate or by aiding broader systems to operate more efficiently** 71% of solutions supported water efficiency, helping reduce, reuse, or recover water, directly or indirectly*** Residential water filtration capacity helped avoid 7,767,579,509 single-use plastic bottles Supplied customers with Carbon Dioxide Recovery Solutions with capacity to recover 7.61 million metric tons of carbon dioxide annually 37% of Pentair’s total electricity usage came from renewable resources, representing 18% of total energy use For the eleventh consecutive year, recognized as ENERGY STAR Partner of the Year Named one of Forbes’ 2022 Best Employers for Women Received an MSCI ESG Rating of AAA Pentair engaged with a third party to assure the GHG, water, safety, and diversity, inclusion and equity (DEI) data in the 2022 Corporate Responsibility Report. To learn more about Pentair’s Social Responsibility Strategic Targets and its 2022 Corporate Responsibility Report, visit Pentair.com\/Impact. *As of December 31, 2022. **Products subject to DOE standards, effective July 2021, are not included if the model sold did not comply with the upcoming efficiency requirements. “Less” is defined as less than a prior version, less than a competitor (as known), or less than industry standard \/norm. ***This is based on total sales in 2022 of Pentair’s brands meeting this definition, as a percentage of total revenue. ABOUT PENTAIR PLC At Pentair, we help the world sustainably move, improve and enjoy water, life’s most essential resource. From our residential and commercial water solutions, to industrial water management and everything in between, Pentair is focused on smart, sustainable water solutions that help the planet and people thrive. Pentair had revenue in 2022 of approximately $4.1 billion, and trades under the ticker symbol PNR. With approximately 11,250 global employees serving customers in more than 150 countries, we work to help improve lives and the environment around the world. To learn more, visit Pentair.com. CAUTION CONCERNING FORWARD-LOOKING STATEMENTS This release contains statements that we believe to be “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical fact, are forward-looking statements. Without limitation, any statements preceded or followed by or that include the words “targets,” “plans,” “believes,” “expects,” “intends,” “will,” “likely,” “may,” “anticipates,” “estimates,” “projects,” “should,” “would,” “could,” “positioned,” “strategy,” or “future” or words, phrases, or terms of similar substance or the negative thereof are forward-looking statements. These forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties, assumptions, and other factors, some of which are beyond our control, which could cause actual results to differ materially from those expressed or implied by such forward-looking statements, including the risk that we will be unable to execute our strategy or achieve our ESG goals because of market or competitive conditions. Additional information concerning these and other factors is contained in our filings with the U.S. Securities and Exchange Commission, including our Annual Report on Form 10-K for the year ended December 31, 2022. All forward-looking statements speak only as of the date of this release. Pentair plc assumes no obligation, and disclaims any obligation, to update the information contained in this release.","filter_flag":1}
{"title":"SUSTAINABLE AND EFFICIENT METHODS OF WATER CONSERVATION - Realty Plus Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJwcmVhbHR5cGx1cy5jb20vYnVpbGRpbmctYmxvY2tzL3N1c3RhaW5hYmxlLWFuZC1lZmZpY2llbnQtbWV0aG9kcy1vZi13YXRlci1jb25zZXJ2YXRpb24tMTEwMzc4Lmh0bWzSAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJwcmVhbHR5cGx1cy5jb20vYnVpbGRpbmctYmxvY2tzL3N1c3RhaW5hYmxlLWFuZC1lZmZpY2llbnQtbWV0aG9kcy1vZi13YXRlci1jb25zZXJ2YXRpb24tMTEwMzc4Lmh0bWzSAQA?oc=5","id":"CBMicGh0dHBzOi8vd3d3LnJwcmVhbHR5cGx1cy5jb20vYnVpbGRpbmctYmxvY2tzL3N1c3RhaW5hYmxlLWFuZC1lZmZpY2llbnQtbWV0aG9kcy1vZi13YXRlci1jb25zZXJ2YXRpb24tMTEwMzc4Lmh0bWzSAQA","guidislink":false,"published":"Mon, 24 Apr 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=4, tm_mday=24, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=114, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJwcmVhbHR5cGx1cy5jb20vYnVpbGRpbmctYmxvY2tzL3N1c3RhaW5hYmxlLWFuZC1lZmZpY2llbnQtbWV0aG9kcy1vZi13YXRlci1jb25zZXJ2YXRpb24tMTEwMzc4Lmh0bWzSAQA?oc=5\" target=\"_blank\">SUSTAINABLE AND EFFICIENT METHODS OF WATER CONSERVATION<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Realty Plus Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"SUSTAINABLE AND EFFICIENT METHODS OF WATER CONSERVATION - Realty Plus Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicGh0dHBzOi8vd3d3LnJwcmVhbHR5cGx1cy5jb20vYnVpbGRpbmctYmxvY2tzL3N1c3RhaW5hYmxlLWFuZC1lZmZpY2llbnQtbWV0aG9kcy1vZi13YXRlci1jb25zZXJ2YXRpb24tMTEwMzc4Lmh0bWzSAQA?oc=5\" target=\"_blank\">SUSTAINABLE AND EFFICIENT METHODS OF WATER CONSERVATION<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Realty Plus Magazine<\/font>","source.href":"https:\/\/www.rprealtyplus.com","source.title":"Realty Plus Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Water Efficiency\" \"new products\"+after:2023-04-01+before:2023-04-30","text":"Water is precious and non –substitutable natural resource. But, rapid urbanisation and untreated sewage disposal entering into the water sources is leading to the misuse and depletion of water across cities in India and globally. Hemalatha AG - SME - Water management, Embassy Services Pvt Ltd added, “We are in the era where there is a dire need to protect our water for ourselves and future generations. Water management should include storage supply infrastructure and efficient treatment of waste water to recycle for even drinking.” Ashok Mehra, President Sales & Chief Marketing Officer, Prince Pipes and Fittings Ltd agreed, “There is no doubt, urbanisation is straining the urban infrastructure. \"As per UN Report by the year 2030 India will have 60 Smart Cities with the population of over one million and six mega cities with the population of more than 10 million. Thus, to balance the demand and supply of water, we need sustainable water management for the cities. Cities like Ahmedabad, Delhi and Bengaluru have already reported a drastic dip in the water table.\" Shama Chanekar, Vice President, Architecture, Bhartiya Urban expressed that sustainability starts with design. “In integrated townships, big tanks and reservoirs are constructed to store excess water to reuse it for irrigation. Water recharge pits, rainwater harvesting pits and recharge bore wells are provided across the site. In addition to that there are different areas like swales which help to percolate water. So, all these measures are incorporated during the project design. For construction also recycled water is used. Fly ash as against cement helps in reduction of water usage and drip curing method reduces water requirement.” Shakuntala Ghosh, Principal Architect and Partner, Ghosh Bose and Associates & Immediate Past Chairperson, IGBC Kolkata Chapter cautioned, “The whole natural water cycle which has existed for millenniums, we have upset in the last 200 years. We have managed to completely pollute, deplete and abuse our sources of water. The mind-set towards loose attitude towards water has to change. Current development pattern is not sustainable. We really have to act at an international level, regional level, city level, building level and at the individual home level. Knowledge dissemination has to go across the board and stakeholders from the planners, professionals to homeowners and product suppliers.” NEW TECHNOLOGIES & WATER SYSTEMS Ashok Mehra- We are working on introducing new products which would help in siphonic drainage and harvesting water in a much more efficient manner. They are GRIHA Council Certified Products. We are also designing pipes that can work for low pressure flushing as well. Shama Chanekar- IoT can monitor the usage of water across every level whether its indoor, outdoor, irrigation level or at cooling towers level. This will give visibility of different data points of water use across the property and help in terms of managing water and predictive maintenance of water systems. Hemalatha AG - IoT based analytical systems are designed for flow rates monitoring and checking leakages. In residential, smart water metering monitors water consumption and charges accordingly to make residents sensitive of their water usage. Shakuntala Ghosh- Every premises should be given a mandate to become a net zero user of water if not a net positive because all the technologies are available. For instance water based chillers in HVAC that are energy efficient but need huge amounts of water can use all the recycled water that can then be used for landscaping and furthermore gardening residual water can be left to percolate in the ground. SUSTAINABLE WATER MANAGEMENT COMPRISES EXPLORING ALTERNATE WAYS AND MEANS OF EFFICIENT CONSUMPTION OF WATER AND RECYCLING WASTEWATER. GOVERNMENT HAS COME UP WITH VARIOUS SCHEMES AND WE ARE CONTRIBUTING TOWARDS THOSE SCHEMES. ASHOK MEHRA ONE HAS TO BEGIN AT THE DESIGN STAGE, FOLLOWING UP WITH THE CORRECT EXECUTION AND CONSTRUCTION METHODS. MOST IMPORTANTLY, WE NEED TO PLAN WATER MANAGEMENT IN ADVANCE DURING CONSTRUCTION PREPARATION. SHAMA CHANEKAR THERE IS A LACK OF KNOWLEDGE AND AWARENESS ABOUT VARIOUS WAYS OF SAVING WATER. AT THE CITY LEVEL THE DECISION MAKERS WILL HAVE TO FIGURE OUT THE ACTUAL NUMBERS IN TERMS OF WATER USAGE PER PERSON, PER BUILDING TYPE ETC. SHAKUNTALA GHOSH AN IMPORTANT ASPECT IN WATER SAVING IS LEAKAGE DETECTION. MORE THAN 30 PERCENT OF OUR WATER GOES IN LEAKAGES. HEMALATHA AG","filter_flag":1}
