{"title":"Global Size of Reverse Logistics Market Envisaged to Reach USD 2,986.17 Billion By 2032, at 12.3% CAGR Growth ... - PR Newswire","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC1zaXplLW9mLXJldmVyc2UtbG9naXN0aWNzLW1hcmtldC1lbnZpc2FnZWQtdG8tcmVhY2gtdXNkLTItOTg2LTE3LWJpbGxpb24tYnktMjAzMi0tYXQtMTItMy1jYWdyLWdyb3d0aC1wb2xhcmlzLW1hcmtldC1yZXNlYXJjaC0zMDE5MDgxMTMuaHRtbNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC1zaXplLW9mLXJldmVyc2UtbG9naXN0aWNzLW1hcmtldC1lbnZpc2FnZWQtdG8tcmVhY2gtdXNkLTItOTg2LTE3LWJpbGxpb24tYnktMjAzMi0tYXQtMTItMy1jYWdyLWdyb3d0aC1wb2xhcmlzLW1hcmtldC1yZXNlYXJjaC0zMDE5MDgxMTMuaHRtbNIBAA?oc=5","id":"CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC1zaXplLW9mLXJldmVyc2UtbG9naXN0aWNzLW1hcmtldC1lbnZpc2FnZWQtdG8tcmVhY2gtdXNkLTItOTg2LTE3LWJpbGxpb24tYnktMjAzMi0tYXQtMTItMy1jYWdyLWdyb3d0aC1wb2xhcmlzLW1hcmtldC1yZXNlYXJjaC0zMDE5MDgxMTMuaHRtbNIBAA","guidislink":false,"published":"Wed, 23 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=23, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=235, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC1zaXplLW9mLXJldmVyc2UtbG9naXN0aWNzLW1hcmtldC1lbnZpc2FnZWQtdG8tcmVhY2gtdXNkLTItOTg2LTE3LWJpbGxpb24tYnktMjAzMi0tYXQtMTItMy1jYWdyLWdyb3d0aC1wb2xhcmlzLW1hcmtldC1yZXNlYXJjaC0zMDE5MDgxMTMuaHRtbNIBAA?oc=5\" target=\"_blank\">Global Size of Reverse Logistics Market Envisaged to Reach USD 2,986.17 Billion By 2032, at 12.3% CAGR Growth ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Global Size of Reverse Logistics Market Envisaged to Reach USD 2,986.17 Billion By 2032, at 12.3% CAGR Growth ... - PR Newswire","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMivAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dsb2JhbC1zaXplLW9mLXJldmVyc2UtbG9naXN0aWNzLW1hcmtldC1lbnZpc2FnZWQtdG8tcmVhY2gtdXNkLTItOTg2LTE3LWJpbGxpb24tYnktMjAzMi0tYXQtMTItMy1jYWdyLWdyb3d0aC1wb2xhcmlzLW1hcmtldC1yZXNlYXJjaC0zMDE5MDgxMTMuaHRtbNIBAA?oc=5\" target=\"_blank\">Global Size of Reverse Logistics Market Envisaged to Reach USD 2,986.17 Billion By 2032, at 12.3% CAGR Growth ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">PR Newswire<\/font>","source.href":"https:\/\/www.prnewswire.com","source.title":"PR Newswire","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"NEW YORK, Aug. 23, 2023 \/PRNewswire\/ -- A latest research report [115+] pages with 360-Degree visibility, titled \"Reverse Logistics Market Share, Size, Trends, Industry Analysis Report, By Return Type (Recalls, Commercial Returns, Repairable Returns, End-of-Use Returns, End of Life Returns); By Service; By End User; By Region; Segment Forecast, 2023 - 2032\" published by Polaris Market Research in its research repository. \"According to research report, the global reverse logistics market size\/share was valued at USD 939.43 Billion in 2022 and is expected to touch USD 2,986.17 Billion By 2032, growing at a CAGR of 12.3% during the forecast period.\" What is Reverse Logistics? How Big is Reverse Logistics Market Size? Overview Also called aftermarket logistics or retrogistics, reverse logistics is a crucial aspect of supply chain management. Put simply, reverse logistics refers to the set of activities and processes used to implement, control, and plan the cost-effective flow of products or materials from their point of consumption to their origin or other destinations. It includes several processes that enhance the value recovery, adequate disposal, and reuse of materials or products. Reverse logistics has a wide range of applications in several sectors. It is used by organizations in the e-commerce, automotive, consumer electronics, retail, luxury goods, and reusable packaging industries for efficient execution of operations and increasing value for end customers. The introduction of new regulations and policies by governments worldwide and the growing emphasis on sustainability and environmental responsibility are spurring the reverse logistics market demand. Request Sample Copy of Reverse Logistics Market Research Report @ https:\/\/www.polarismarketresearch.com\/industry-analysis\/reverse-logistics-market\/request-for-sample (The sample of this report is readily available on request. The report sample contains a brief introduction to the research report, Table of Contents, Graphical introduction of regional analysis, Top players in the market with their revenue analysis and our research methodology.) Our Sample Report May Includes: 2032 Updated Report Introduction, Overview, and In-depth industry analysis. 115+ Pages Research Report (Inclusion of Updated Research). Provide Chapter-wise guidance on Request. 2023 Updated Regional Analysis with Graphical Representation of Size, Share & Trends. Includes Updated List of table & figures. Updated Report Includes Top Market Players with their Business Strategy, Sales Volume, and Revenue Analysis. Some of the Top Market Players Covered Are: FedEx UPS DHL Supply Chain XPO Logistics CEVA Logistics C.H. Robinson Worldwide DB Schenker Ryder System Reverse Logistics Company Liquidity Services Genco Genpact Re-Teck Inmar eCycle Solutions Optoro The Retail Equation Flextronics International Walmart Best Buy Amazon Dell Technologies Apple Samsung Electronics LG Electronics HP Lenovo Group Cisco Systems Ingram Micro Arrow Electronics Avnet Synnex Tech Data Digi-Key Electronics Brightstar Asurion Blancco Technology Hyla Mobile Apto Solutions ITRenew For Additional Information on Key Players, Request to Download Sample Pages Here: https:\/\/www.polarismarketresearch.com\/industry-analysis\/reverse-logistics-market\/request-for-sample OR Directly Purchase a copy of report with TOC Here: https:\/\/www.polarismarketresearch.com\/buy\/2611\/2 Reverse Logistics Market: Report Scope Report Attribute Details Revenue forecast in 2032 USD 2,986.17 Billion Market size value in 2023 USD 1,053.76 Billion Expected CAGR Growth 12.3% from 2023 - 2032 Base Year 2022 Forecast Year 2023 - 2032 Top Market Players FedEx, UPS, DHL Supply Chain, XPO Logistics, CEVA Logistics, C.H. Robinson Worldwide, DB Schenker, Ryder System, Reverse Logistics Company, Liquidity Services, Genco, Genpact, Re-Teck, Inmar, eCycle Solutions, Optoro, The Retail Equation, Flextronics International, Walmart, Best Buy, Amazon, Dell Technologies, Apple, Samsung Electronics, LG Electronics, HP, Lenovo Group, Cisco Systems, Ingram Micro, Arrow Electronics, Avnet, Synnex, Tech Data, Digi-Key Electronics, Brightstar, Asurion, Blancco Technology, Hyla Mobile, Apto Solutions & ITRenew Segments Covered By Return Type, By Service, By End User, By Region Customization Options Customized purchase options are available to meet any research needs. Explore customized purchase options Prominent Growth Driving Factors Rising collaborations in the marketplace : Collaborations among reverse logistics industry players play an important role in driving the growth of the market. These partnerships lay the foundation for increased demand for reverse logistics services through supply chain optimization and focus on sustainability initiatives. : Collaborations among reverse logistics industry players play an important role in driving the growth of the market. These partnerships lay the foundation for increased demand for reverse logistics services through supply chain optimization and focus on sustainability initiatives. Effective disposal of non-reusable products : Reverse logistics facilitates proper disposal of products and materials that can't be repaired or reused. It involves material recycling and safe disposal of hazardous products by following environmental regulations and providing after-sales support. The adequate disposal of products that can't be reused or recycled positively impacts reverse logistics market size. : Reverse logistics facilitates proper disposal of products and materials that can't be repaired or reused. It involves material recycling and safe disposal of hazardous products by following environmental regulations and providing after-sales support. The adequate disposal of products that can't be reused or recycled positively impacts reverse logistics market size. Growing emphasis on sustainability initiatives: Businesses across the globe are recognizing the importance of sustainable and efficient reverse logistics solutions. As a result, the market is projected to experience further growth and development in the coming years. Request for a Discount on this Report Before Purchase @ https:\/\/www.polarismarketresearch.com\/industry-analysis\/reverse-logistics-market\/request-for-discount-pricing Recent Trends Influencing the Market Partnership between Aramco & DHL Supply Chain: Saudi Arabian oil group Aramco and German logistics company DHL Supply Chain recently signed a stakeholders' agreement for establishing a new logistics & procurement hub in Saudi Arabia . The agreement between the two firms aims at enhancing the efficiency and sustainability of supply chain services in the area. The new facility will serve clients across multiple industries, including the chemical, petrochemical, and energy sectors. Segmental Analysis End-of-use returns segment is anticipated to witness the fastest growth Many end-of-use components and materials still have a residual value. Businesses can recover value and generate revenue from such products by adopting efficient reverse logistics processes. The asset recovery aspect through repair or resale tends to appeal to companies as it offers financial incentives and minimizes potential losses linked to end-of-use products. Rather than treating items as waste, they are returned to the supply chain. This method paves the way for a highly sustainable approach to product consumption, which is a major driver behind reverse logistics market growth. Reselling segment is projected to account for a large revenue share The reselling segment is expected to account for a significant portion of the reverse logistics market share in the upcoming years. This is primarily because reselling provides additional revenue sources for businesses. Companies can garner additional revenue and sales through effective refurbishment and resale of returned items. Besides, these services can help boost customer satisfaction and loyalty as buyers can return items and know they can be refurbished or resold. This, in turn, can lead to enhanced customer loyalty and commitment to customer value, further driving the market's growth. E-commerce segment is expected to garner the largest market share The e-commerce segment is anticipated to account for a major share of the reverse logistics market. This is largely because the e-commerce boom has resulted in a large number of people giving preference to online shopping. As more and more customers shop online, product returns have also increased. In the highly competitive e-commerce landscape, offering seamless and hassle-free returns is key to attracting and retaining customers. Effective reverse logistics solutions allow companies to meet customer expectations and enhance customer experience. Inquire more about this report before purchase @ https:\/\/www.polarismarketresearch.com\/industry-analysis\/reverse-logistics-market\/inquire-before-buying (Inquire a report quote OR available discount offers to the sales team before purchase.) Regional Insights North America witnessed the highest growth in 2022 The reverse logistics market in North America region accounted for the highest growth in 2022. This can primarily be attributed to the introduction of new governmental policies and initiatives that offer a conducive environment for the industry's growth in the region. For instance, the Biden-Harris Administration introduced the FLOW initiative that contributes to the expansion of effective reverse logistics processes through technology adoption, sustainability considerations, and improved collaboration and information sharing. This drives the demand for advanced reverse logistics solutions and boosts market sales in the United States and North America. Europe is anticipated to witness a significant growth rate The European region is projected to grow significantly over the forecast period. This is primarily because Europe emphasizes sustainability and environmental responsibility. The region has seen the implementation of numerous regulations and initiatives focusing on water reduction and adequate product disposal. Reverse logistics is crucial for managing returns and enabling organizations to comply with sustainability initiatives, boosting the reverse logistics market sales in Europe. Browse the Detail Report \"Reverse Logistics Market Share, Size, Trends, Industry Analysis Report, By Return Type (Recalls, Commercial Returns, Repairable Returns, End-of-Use Returns, End of Life Returns); By Service; By End User; By Region; Segment Forecast, 2023 - 2032\" with in-depth TOC: https:\/\/www.polarismarketresearch.com\/industry-analysis\/reverse-logistics-market For Additional Information OR Media Enquiry, Please Mail At: [email protected] Recent Developments In December 2022 , American transport company FedEx introduced its new service FedEx Consolidated Returns in the United States . The new service aims to provide merchants with a simplified and cost-effective e-commerce returns solution they can offer their customers. , American transport company FedEx introduced its new service FedEx Consolidated Returns in . The new service aims to provide merchants with a simplified and cost-effective e-commerce returns solution they can offer their customers. In May 2022 , DHL Supply Chain unveiled its new recovery management solution in the market. The new solution help businesses reduce electronic waste by proper recycling, processing, and reuse of used electrical products. The Report Answer Questions Such As: What is the current size of the reverse logistics market? At what CAGR is the market expected to grow over the forecast period? What are the challenges and opportunities faced by businesses in the industry? Which segments accounts for the largest market share? Who are the reverse logistics market key players? What are the recent developments and upcoming trends in the sector? What growth strategies are the players considering to stay in the market? Polaris Market Research has segmented the reverse logistics market report based on return type, service, end user and region: By Return Type Outlook Recalls Commercial Returns Repairable Returns End-of-Use Returns End of life Returns By Service Outlook Transportation Warehousing Reselling Replacement Management Refund Management Authorization Others By End User Outlook E-Commerce Automotive Pharmaceutical Consumer Electronic Retail Luxury Goods Reusable Packaging By Region Outlook North America (U.S., Canada ) (U.S., ) Europe ( France , Germany , UK, Italy , Netherlands , Spain , Russia ) ( , , UK, , , , ) Asia Pacific ( Japan , China , India , Malaysia , Indonesia . South Korea ) ( , , , , . ) Latin America ( Brazil , Mexico , Argentina ) ( , , ) Middle East & Africa ( Saudi Arabia , UAE, Israel , South Africa ) About Polaris Market Research: Polaris Market Research is a global market research and consulting company. The company specializes in providing exceptional market intelligence and in-depth business research services for PMR's clientele spread across different enterprises. We at Polaris are obliged to serve PMR's diverse customer base present across the industries of healthcare, technology, semi-conductors and chemicals among various other industries present around the world. We strive to provide PMR's customers with updated information on innovative technologies, high growth markets, emerging business environments and latest business-centric applications, thereby helping them always to make informed decisions and leverage new opportunities. Adept with a highly competent, experienced and extremely qualified team of experts comprising SMEs, analysts and consultants, we at Polaris endeavor to deliver value-added business solutions to PMR's customers. Contact: Likhil G 30 Wall Street 8th Floor, New York City, NY 10005, United States Phone: +1-929 297-9727 Email: [email protected] Web: https:\/\/www.polarismarketresearch.com Follow Us: LinkedIn | twitter Blog: https:\/\/www.polarisnewsblog.com Logo: https:\/\/mma.prnewswire.com\/media\/1316207\/Polaris_Market_Research_Logo.jpg SOURCE Polaris Market Research","filter_flag":1}
{"title":"Reverse Logistics Market Size & Share, Growth Trends 2023-2032 - Global Market Insights","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL3JldmVyc2UtbG9naXN0aWNzLW1hcmtldNIBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL3JldmVyc2UtbG9naXN0aWNzLW1hcmtldNIBAA?oc=5","id":"CBMiRWh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL3JldmVyc2UtbG9naXN0aWNzLW1hcmtldNIBAA","guidislink":false,"published":"Tue, 22 Aug 2023 12:31:34 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=22, tm_hour=12, tm_min=31, tm_sec=34, tm_wday=1, tm_yday=234, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL3JldmVyc2UtbG9naXN0aWNzLW1hcmtldNIBAA?oc=5\" target=\"_blank\">Reverse Logistics Market Size & Share, Growth Trends 2023-2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Market Insights<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Reverse Logistics Market Size & Share, Growth Trends 2023-2032 - Global Market Insights","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiRWh0dHBzOi8vd3d3LmdtaW5zaWdodHMuY29tL2luZHVzdHJ5LWFuYWx5c2lzL3JldmVyc2UtbG9naXN0aWNzLW1hcmtldNIBAA?oc=5\" target=\"_blank\">Reverse Logistics Market Size & Share, Growth Trends 2023-2032<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Global Market Insights<\/font>","source.href":"https:\/\/www.gminsights.com","source.title":"Global Market Insights","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Reverse Logistics Market Size Reverse Logistics Market size was valued at USD 743.3 billion in 2022 and is estimated to register a CAGR of 8% between 2023 and 2032. Government regulations surrounding waste management, recycling, and product disposal have become more stringent in many regions. For instance, the Basel Convention regulates the Transboundary Movements of Hazardous Wastes and their disposal and prohibits the export of hazardous waste from developed countries to developing countries. Likewise, the European Union Waste Electrical and Electronic Equipment Directive (WEEE) requires manufacturers of electrical and electronic equipment to take back and recycle their products at the end of their life. To get key market trends Download Free Sample Companies are required to comply with regulations related to the disposal of hazardous materials, electronic waste (e-waste), and other items with environmental implications. Non-compliance can result in fines and damage to a company's reputation. Additionally, the reverse logistics market is being propelled by the advancements in the logistics automation market and the expanding influence of the third-party logistics market. These developments are enhancing the efficiency of reverse logistics processes, reducing costs, and optimizing returns management. The collaboration between these two trends is fostering growth and innovation within the reverse logistics industry. Reverse Logistics Market Report Attributes Report Attribute Details Base Year: 2022 Reverse Logistics Market Size in 2022: USD 743.3 Billion Forecast Period: 2023 to 2032 Forecast Period 2023 to 2032 CAGR: 8% 2032 Value Projection: USD 1.61 Trillion Historical Data for: 2018 to 2022 No. of Pages: 271 Tables, Charts & Figures: 316 Segments covered: Processes, Return type, Service Provider, End User, and Region Growth Drivers: Rapid growth of e-commerce Increasing environmental awareness Advancements in technology, such as IoT devices, data analytics, and real-time tracking Rising importance of adoption of circular economy principles Pitfalls & Challenges: Complexity of operations Regulatory compliance and safety What are the growth opportunities in this market? Download Free Sample Unlike forward logistics, where products move from the manufacturer to the consumer, the reverse logistics journey can be less predictable and more fragmented. Products may follow various routes depending on the reason for return (defects, recalls, customer dissatisfaction, etc.). This lack of visibility and control can lead to inefficiencies, longer processing times, increased transportation costs, and potential loss of value in returned products. Companies often struggle to gain a comprehensive view of their reverse logistics processes, hindering their ability to optimize operations, thus, impacting the reverse logistics market outlook. On the other hand, the rapid expansion of e-commerce has significantly increased the volume of product returns. According to IBEF, the e-commerce market in India could reach USD 350 billion by 2030, with an estimated number of online shoppers exceeding 200 million by 2025. Online shoppers expect hassle-free return processes, and companies need effective reverse logistics solutions to handle these returns efficiently. E-commerce retailers are exploring ways to minimize return rates, optimize return transportation, and manage returned products to recover their value. This growth in e-commerce has spurred demand for innovative reverse logistics strategies. COVID-19 Impact The COVID-19 pandemic exerted a substantial impact on the reverse logistics market. As supply chains were disrupted and consumer behaviors shifted, the volume of product returns surged due to factors like e-commerce growth and supply chain challenges. Companies faced difficulties in processing returns, assessing product conditions, and managing inventory. Health and safety concerns added complexity to handling returned goods. In response, businesses had to adapt their reverse logistics strategies, implement contactless return processes, and find innovative solutions to handle increased returns while prioritizing employee and customer well-being. Reverse Logistics Market Trends The concept of a circular economy is gaining momentum, and it's closely linked with reverse logistics. Companies are looking beyond simple returns management and exploring ways to extract maximum value from returned products and materials. This involves strategies such as refurbishing and reselling returned items, recycling materials to create new products, and designing products for easier disassembly and repair. Citing an instance, in January 2023, Nike announced that it would recycle 1 billion plastic bottles from its suppliers, employees, and consumers and use them to create new shoes and apparel. Embracing a circular economy approach not only aligns with sustainability goals but also presents opportunities for cost savings and revenue generation, carving an upward growth trajectory for the reverse logistics business. Reverse Logistics Market Analysis Learn more about the key segments shaping this market Download Free Sample The reverse logistics market from B2B returns and commercial returns masks segment is set to exhibit a growth of over 7% CAGR during the forecast period. In B2B sectors, companies often deal with large volumes of products, leading to higher return rates due to quality issues, overstocking, or changing customer requirements. For instance, in the electronics industry, manufacturers receive defective components from suppliers, necessitating efficient return channels. Similarly, in commercial settings, surplus or outdated equipment prompts the need for effective reverse logistics. These trends underline the importance of streamlined processes to recover value from returned items and reduce operational costs. Learn more about the key segments shaping this market Download Free Sample The reverse logistics market from retail & e-commerce segment dominated around USD 320 billion revenue in 2022. The growth of online shopping has led to an increase in product returns, with customers seeking hassle-free return processes. For instance, major e-commerce players like Amazon and Walmart have refined their return policies to meet customer expectations. Additionally, the need to manage excess inventory, reduce waste, and refurbish returned items for resale has driven retailers to invest in efficient reverse logistics systems. This trend highlights the essential role of effective returns management in maintaining customer satisfaction and optimizing operations. Looking for region specific data? Download Free Sample Asia Pacific reverse logistics market accounted for 50% of revenue share in 2022, due to rapid economic growth, increased e-commerce adoption, and growing environmental awareness. Countries like China and India are witnessing significant e-commerce expansion, resulting in higher product return rates. For instance, Alibaba's Cainiao Network has developed a nationwide returns network in China. Moreover, as sustainability gains importance, companies are focusing on responsible disposal and recycling. This push is driving the adoption of reverse logistics practices, making the Asia Pacific a pivotal region for its growth. Reverse Logistics Market Share Major companies operating in the reverse logistics market include Blue Dart Express Ltd. C H Robinson Worldwide Inc. CMA CGM SA Core Logistic Pvt. Ltd. Deutsche Post DHL Group FedEx Corporation Happy Returns LLC Kintetsu World Express, Inc. NFI Industries, Inc. Pitney Bowes Inc. Reverse Logistics Group RLG Systems AG Safexpress Pvt. Ltd. United Parcel Service, Inc. (UPS) Yusen Logistics Co., Ltd. Reverse Logistics Industry News In January 2023, UPS announced an investment worth USD 1 billion in its global reverse logistics network to expand its capacity to handle returned goods, improve its tracking and tracing capabilities, and develop new technologies for reverse logistics. In March 2023, UPS partnered with Optoro, a company that specializes in reverse logistics, to improve the efficiency and sustainability of its reverse logistics operations. This reverse logistics market research report includes in-depth coverage of the industry with estimates & forecast in terms of revenue (USD Billion) from 2018 to 2032, for the following segments: Click here to Buy Section of this Report Market, By Processes Returns management Remanufacturing Recycling Disposal Others Market, By Return Type Defective returns Recalled returns B2B returns and commercial returns Repairable returns End of life returns Others Market, By Service Providers In-House reverse logistics Third-Party Logistics (3PL) providers Recycling companies Waste management companies Market, By End User Retail & e-commerce Electronics Automotive Pharmaceuticals Manufacturing Others The above information has been provided for the following regions and countries:","filter_flag":1}
{"title":"NewRoad Capital Partners hires former Walmart exec Bob Arvin - talkbusiness.net","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vdGFsa2J1c2luZXNzLm5ldC8yMDIzLzA4L25ld3JvYWQtY2FwaXRhbC1wYXJ0bmVycy1oaXJlcy1mb3JtZXItd2FsbWFydC1leGVjLWJvYi1hcnZpbi_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vdGFsa2J1c2luZXNzLm5ldC8yMDIzLzA4L25ld3JvYWQtY2FwaXRhbC1wYXJ0bmVycy1oaXJlcy1mb3JtZXItd2FsbWFydC1leGVjLWJvYi1hcnZpbi_SAQA?oc=5","id":"CBMiXmh0dHBzOi8vdGFsa2J1c2luZXNzLm5ldC8yMDIzLzA4L25ld3JvYWQtY2FwaXRhbC1wYXJ0bmVycy1oaXJlcy1mb3JtZXItd2FsbWFydC1leGVjLWJvYi1hcnZpbi_SAQA","guidislink":false,"published":"Fri, 25 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=25, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=237, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vdGFsa2J1c2luZXNzLm5ldC8yMDIzLzA4L25ld3JvYWQtY2FwaXRhbC1wYXJ0bmVycy1oaXJlcy1mb3JtZXItd2FsbWFydC1leGVjLWJvYi1hcnZpbi_SAQA?oc=5\" target=\"_blank\">NewRoad Capital Partners hires former Walmart exec Bob Arvin<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">talkbusiness.net<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"NewRoad Capital Partners hires former Walmart exec Bob Arvin - talkbusiness.net","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXmh0dHBzOi8vdGFsa2J1c2luZXNzLm5ldC8yMDIzLzA4L25ld3JvYWQtY2FwaXRhbC1wYXJ0bmVycy1oaXJlcy1mb3JtZXItd2FsbWFydC1leGVjLWJvYi1hcnZpbi_SAQA?oc=5\" target=\"_blank\">NewRoad Capital Partners hires former Walmart exec Bob Arvin<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">talkbusiness.net<\/font>","source.href":"https:\/\/talkbusiness.net","source.title":"talkbusiness.net","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Rogers firm NewRoad Capital Partners, Arkansas’ largest private equity fund, has hired Bob Arvin as a strategic advisor. According to a news release Thursday (Aug. 24), Arvin brings NewRoad’s roster to six operating partners and eight strategic advisors. “I am excited to have Bob join our strategic advisor team,” NewRoad partner Tracy Black said in the release. “He will bring a fresh perspective to how we think about reverse logistics and the sustainability needs of the industry.” NewRoad invests in high-growth supply chain and logistics, retail and marketing technology companies. Arvin, a former divisional vice president of supply chain at Walmart, has over 45 years of leadership and supply chain experience. According to the release, he worked for Walmart for more than four decades. His work spanned strategy, engineering, building design, network design and operational responsibility for many of the retailer’s logistics functions. Avin formed the first industrial engineering team at Walmart, which designed and installed many of the productivity-enhancing processes used in logistics today. His operations experience encompasses ambient and refrigerated distribution, grocery transportation, e-commerce fulfillment, apparel, shoe and jewelry operations, sustainability and customer returns. He spent the past nine years redefining the returns model at Walmart to extract greater value from customer returns. He was influential in changing vendor agreements, improving store processes, and clarifying the cost of product returns to senior management. He also established electronic refurbishment programs and developed resale channels, including B2C websites, auction platforms, and B2B programs. Arvin also spearheaded the development of sustainability programs to divert plastics and other materials from landfills to new products in the returns channel. Arvin is a past board advisor to the Reverse Logistics Association. “I am humbled to be joining the extremely talented group at NewRoad Capital,” Arvin said. “They are all recognized as industry leaders in their fields and bring exceptional experience, knowledge, and thought leadership in support of the NewRoad mission. It’s exciting to join such an accomplished team that adds value to both the management teams at portfolio companies and NewRoad Capital investors.” Bob holds a master’s degree in operations management from the University of Arkansas, where he received the Distinguished Alumni Award from the College of Engineering in 2018. He also earned a BSOM, summa cum laude, from John Brown University. “Bob brings decades of experience in implementing logistics solutions for Walmart, especially in reverse logistics — a sector of the supply chain that has expanded in complexity and scale faster than anticipated,” NewRoad partner Chris Ladd said. “We are highly focused on investing in this sub-sector and eagerly anticipate the expertise Bob will bring to the process.”","filter_flag":1}
{"title":"Circularity and Frugal Innovation in the Making of a Sustainable Future - APAC Outlook Magazine","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFwYWNvdXRsb29rbWFnLmNvbS9leHBlcnQtZXllL2NpcmN1bGFyaXR5LWFuZC1mcnVnYWwtaW5ub3ZhdGlvbi1pbi10aGUtbWFraW5nLW9mLWEtc3VzdGFpbmFibGUtZnV0dXJl0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFwYWNvdXRsb29rbWFnLmNvbS9leHBlcnQtZXllL2NpcmN1bGFyaXR5LWFuZC1mcnVnYWwtaW5ub3ZhdGlvbi1pbi10aGUtbWFraW5nLW9mLWEtc3VzdGFpbmFibGUtZnV0dXJl0gEA?oc=5","id":"CBMicWh0dHBzOi8vd3d3LmFwYWNvdXRsb29rbWFnLmNvbS9leHBlcnQtZXllL2NpcmN1bGFyaXR5LWFuZC1mcnVnYWwtaW5ub3ZhdGlvbi1pbi10aGUtbWFraW5nLW9mLWEtc3VzdGFpbmFibGUtZnV0dXJl0gEA","guidislink":false,"published":"Mon, 14 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=14, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=226, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFwYWNvdXRsb29rbWFnLmNvbS9leHBlcnQtZXllL2NpcmN1bGFyaXR5LWFuZC1mcnVnYWwtaW5ub3ZhdGlvbi1pbi10aGUtbWFraW5nLW9mLWEtc3VzdGFpbmFibGUtZnV0dXJl0gEA?oc=5\" target=\"_blank\">Circularity and Frugal Innovation in the Making of a Sustainable Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">APAC Outlook Magazine<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Circularity and Frugal Innovation in the Making of a Sustainable Future - APAC Outlook Magazine","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMicWh0dHBzOi8vd3d3LmFwYWNvdXRsb29rbWFnLmNvbS9leHBlcnQtZXllL2NpcmN1bGFyaXR5LWFuZC1mcnVnYWwtaW5ub3ZhdGlvbi1pbi10aGUtbWFraW5nLW9mLWEtc3VzdGFpbmFibGUtZnV0dXJl0gEA?oc=5\" target=\"_blank\">Circularity and Frugal Innovation in the Making of a Sustainable Future<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">APAC Outlook Magazine<\/font>","source.href":"https:\/\/www.apacoutlookmag.com","source.title":"APAC Outlook Magazine","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Kapila Mehta, Sustainability Vice President of Power Products at Schneider Electric, explores a win-win solution for profitability, partnerships, and the planet. Countries around the world continue to face the economic crisis left over by the implications of the COVID-19 pandemic. With pressure to recover growth, governments are looking for more sustainable solutions, and will play a critical role in fostering long-term resiliency to withstand future crises. Many companies have taken a head-on approach to growth following the COVID-19 pandemic, but the surge in energy prices has intensified the need to cut costs. The dilemma companies in this situation often face is how to manage growth sustainably. If we want to map out a clear road to recovery and ensure a safe and balanced future, sustainability and circularity should be at the top of our minds and embedded into our solutions. However, according to the latest Circularity Gap Report, only 7.2 percent of the global economy is circular, dropping even lower than pre-pandemic levels of 8.6 percent in 2020. Despite this, countries are demonstrating an effort to create more circular economies. In 2021, ASEAN announced its own circular economy framework comprising actions that include harmonising circular products and services. Creating more efficient and sustainable products will help to reduce energy and resource consumption, drive higher repairability, and minimise waste – all working to reduce cost. With more than 80 percent of a product’s environmental impact determined during the design phase, this process needs to start from a product’s inception. BEING ‘FRUGAL’ CAN BE PROFITABLE There is an assumption that reusing, recycling and refurbishing products may not be a profitable way of doing business. However, contrary to popular belief, it is possible to run a profitable business whilst protecting the planet. When businesses rethink their models with circularity in mind, they can make products faster as they require fewer materials. This is a significant advantage when it comes to being ‘frugal’, especially when raw materials have soared in price by 18 percent compared to this time last year. It also mitigates the risk of material shortages due to supply chain issues, ensuring that businesses continue to hit targets despite disruption. The new business model of choice will be end-to-end circularity. The key to getting customers on board is demonstrating the right value proposition and showing the benefits of giving products a second life. By investing time and energy in planning, educating the market, and increasing awareness of skills and resources, we can spread the benefits of a circular mindset. DEMONSTRATING WHAT CIRCULARITY LOOKS LIKE Buying a re-manufactured product does not only have a positive impact on reducing carbon emissions but also on the consumption of raw materials and minerals. At Schneider Electric, we have created a new sustainable model where products can have a second life thanks to re-industrialisation. For instance, the Schneider Electric MasterTech site has been re-industrialising MasterPact circuit breakers since 2020. The circuit breakers are collected, disassembled, upgraded, and tested before being put back on the market. Being based in the factory where new products are made means that circular circuit breakers meet the same rigorous quality control standards as new products. It is estimated that by recycling and reusing products, we were able to reduce emissions by approximately 45 percent, resulting in savings of 755 kilogrammes (kg) of CO 2 per MasterPact. NEW WAYS OF WORKING INTRODUCE NEW CHALLENGES Taking one step further beyond repurposing parts is reverse circularity. It refers to the process of reintroducing waste materials back into the production cycle. The aim is to reduce waste and conserve resources, and involves taking end-of-life products or waste materials and turning them into new products or raw materials. By closing the loop in the production process, minimising waste and reducing environmental impact, reverse circularity is another way companies can reduce their reliance on virgin materials and conserve resources. However, circularity creates new pain points for businesses. For example, implementing a circular economy can be a difficult decision for vendors due to the challenge of reverse logistics, which can be up to 11 times more expensive than traditional logistics. This is due to the cost of returns, transportation, repairs, and reselling. To counter that, designing and producing products for services with a higher level of repairability would help to ease this new pain point, and hopefully reduce costs and dead inventory. TURNING BARRIERS INTO LADDERS FOR OPPORTUNITY Despite the challenges, circularly can bring new opportunities for partnership and innovation. Developing a new circular system hinges on nurturing new partnerships and evolving business models. Exploring the right partnership is crucial at the start and organisations should look to ‘recycler’ partners as a first step. These are exemplary model companies who are already active in the field and have mastered reverse logistics. Business partners also play a vital role in building out and driving circularity across the full value chain. By establishing an industrial ecology – or utilising all available or useful material and turning one person’s trash into another person’s treasure – we can create a win-win situation for our partners and the planet. Businesses can generate new revenue streams and save on operating expenses by creating upgradable offers that are circular and easily repairable. Furthermore, sustainable product packaging is a really big part of circularity. Making the transition away from single-use plastics to 100 percent recycled packaging is just one example of how small changes can forge a better, and more circular future. Approaching sustainability as a business can seem daunting, and it was only recently that more companies started incorporating sustainability into their strategies and targets. The advantage of the circular economy framework is that it can be applied to any type of business and sector, and it addresses pressing global issues like climate change, minimising waste, and pollution. If we want to bring a net zero world to life, we must look at how each element of our take-make-waste system can be improved. This spans from how we collect and distribute resources, the production and use of products, and how we process those materials afterwards. Our vision of a sustainable future can only be materialised if it is a circular one.","filter_flag":1}
{"title":"Stellantis SUSTAINera at MEMA Sustainability Summit: Circular Economy business plays key role in global ... - Stellantis.com","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9wYXJ0cy1zZXJ2aWNlcy9wcmVzcy9zdGVsbGFudGlzLXN1c3RhaW5lcmEtYXQtbWVtYS1zdXN0YWluYWJpbGl0eS1zdW1taXQtY2lyY3VsYXItZWNvbm9teS1idXNpbmVzcy1wbGF5cy1rZXktcm9sZS1pbi1nbG9iYWwtZGVjYXJib25pemF0aW9uLXN0cmF0ZWd50gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9wYXJ0cy1zZXJ2aWNlcy9wcmVzcy9zdGVsbGFudGlzLXN1c3RhaW5lcmEtYXQtbWVtYS1zdXN0YWluYWJpbGl0eS1zdW1taXQtY2lyY3VsYXItZWNvbm9teS1idXNpbmVzcy1wbGF5cy1rZXktcm9sZS1pbi1nbG9iYWwtZGVjYXJib25pemF0aW9uLXN0cmF0ZWd50gEA?oc=5","id":"CBMiuwFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9wYXJ0cy1zZXJ2aWNlcy9wcmVzcy9zdGVsbGFudGlzLXN1c3RhaW5lcmEtYXQtbWVtYS1zdXN0YWluYWJpbGl0eS1zdW1taXQtY2lyY3VsYXItZWNvbm9teS1idXNpbmVzcy1wbGF5cy1rZXktcm9sZS1pbi1nbG9iYWwtZGVjYXJib25pemF0aW9uLXN0cmF0ZWd50gEA","guidislink":false,"published":"Wed, 16 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=2, tm_yday=228, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9wYXJ0cy1zZXJ2aWNlcy9wcmVzcy9zdGVsbGFudGlzLXN1c3RhaW5lcmEtYXQtbWVtYS1zdXN0YWluYWJpbGl0eS1zdW1taXQtY2lyY3VsYXItZWNvbm9teS1idXNpbmVzcy1wbGF5cy1rZXktcm9sZS1pbi1nbG9iYWwtZGVjYXJib25pemF0aW9uLXN0cmF0ZWd50gEA?oc=5\" target=\"_blank\">Stellantis SUSTAINera at MEMA Sustainability Summit: Circular Economy business plays key role in global ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stellantis.com<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Stellantis SUSTAINera at MEMA Sustainability Summit: Circular Economy business plays key role in global ... - Stellantis.com","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiuwFodHRwczovL3d3dy5tZWRpYS5zdGVsbGFudGlzLmNvbS9lbS1lbi9wYXJ0cy1zZXJ2aWNlcy9wcmVzcy9zdGVsbGFudGlzLXN1c3RhaW5lcmEtYXQtbWVtYS1zdXN0YWluYWJpbGl0eS1zdW1taXQtY2lyY3VsYXItZWNvbm9teS1idXNpbmVzcy1wbGF5cy1rZXktcm9sZS1pbi1nbG9iYWwtZGVjYXJib25pemF0aW9uLXN0cmF0ZWd50gEA?oc=5\" target=\"_blank\">Stellantis SUSTAINera at MEMA Sustainability Summit: Circular Economy business plays key role in global ...<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stellantis.com<\/font>","source.href":"https:\/\/www.media.stellantis.com","source.title":"Stellantis.com","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"Alison Jones, senior vice president, Global Circular Economy, shares the 4-R strategy – Reman, Repair, Reuse and Recycle – as core pillar of Stellantis’ plan for achieving carbon net zero by 2038 SUSTAINera label for parts and accessories, saves up to 80% materials and 50% non-emitted CO2 as compared to their equivalent new parts The industrial and innovative scale up contributes to the Stellantis Dare Forward 2030 strategic plan August 16, 2023, Auburn Hills, Mich. – Stellantis took center stage at the MEMA “Motor & Equipment Manufacturers Association” Sustainability Summit on August 15th in Troy Michigan, USA. As a keynote speaker at the conference titled ‘Sustainability: Competing in Today’s Environment’, Alison Jones, senior vice president, Global Circular Economy, outlined how Circular Economy plays a key role in the organization’s Dare Forward 2030 strategic plan, supporting the ambitious target of leading the industry to achieving carbon net zero by 2038. Specifically, in her presentation ‘SUSTAINera Circular Economy – our industrial and innovative scale up’, Jones highlighted how SUSTAINera, the dedicated label representing all the Company’s Circular Economy activities and launched in October 2022, is expanding its rigorous approach based on the 4R strategy – Reman, Repair, Reuse and Recycle – to support the Company’s carbon net zero targets, and at the same time bringing financial value to Stellantis and consequently to its suppliers, customers and stakeholders. The SUSTAINera Circular Economy products and services provide savings of up to 80% of raw materials and 50% of non-emitted CO2 as compared to their equivalent new parts*. As a result, repairers and customers receive a sustainable and affordable solution, without compromising on quality while helping to preserve the environment through decreased waste, less use of our planet’s resources and reduced carbon footprint. Remanufacturing (Reman) is a key strategy of the SUSTAINera Circular Economy business as it pursues the objective of extending product lifespan and provide a sustainable addition in the aftersales spare parts range. SUSTAINera Reman parts provide the same performance and warranty conditions as new parts, and the current global range has more than 13,000-part numbers in 37 product lines including starters, alternators, clutches, turbochargers, injectors, brake calipers, electronic control modules, high-voltage battery packs, transmissions and engines. For North America a key focus for the next two years is the expansion of the current supplier footprint, extending existing product lines and developing new products such as headlamps and tail-lamps, all with the aim of accelerating the remanufacturing portfolio coverage. Core return management is of strategic importance for any Remanufacturing business, with a 95% return rate supporting long term sustainability and waste elimination. Investments have been made to optimize Stellantis Core Closed loop process through reverse logistics enhancements, driving sustainability by reducing transport CO2 emissions and improving customer service levels and time to market. Currently Remanufacturing in North America makes up 72% of the Circular Economy business, with recycling and repair accounting for 28%. Worldwide SUSTAINera sales of remanufactured parts grew by 19% in 2022, on track to achieve the 2030 objective of more than €2 billion turnover quadrupling revenues derived from extending product lifespan and increasing revenues from recycling tenfold compared to 2021. In parallel, within the scope of results derived from extending product lifespan, the Reuse e-commerce business in Europe performed a 108% sales growth in 2022. Stellantis will expand this offer into North America, opening the e-commerce Reuse channel in the US by the end of 2023. The B-Parts Reuse business provides an online customer solution offering original multi-brand reused parts to B2C and B2B customers. As Jones highlighted ‘Stellantis continues to expand its customer offering, worldwide infrastructure and innovative thinking, both in-house and with suppliers. To achieve this, the Circular Economy team continues to search for proactive suppliers to expand and innovate the product range to offer a growing number of sustainable parts to customers and at the same time create new recycling opportunities for the development of a true closed-loop process. These are all paramount initiatives in our drive to achieve our Dare Forward 2030 ambitions.’ The Motor & Equipment Association held their Sustainability Summit on August 15, 2023. For more event information, see mema.org\/sustainability. *Source: Life-Cycle Assessment (LCA) Europe. Values are given for information only, corresponding to the main seller of the similar products, and determined according to a methodology approved by an independent company (Sphera). Stellantis Stellantis N.V. (NYSE \/ MTA \/ Euronext Paris: STLA) is one of the world's leading automakers and a mobility provider. Its storied and iconic brands embody the passion of their visionary founders and today’s customers in their innovative products and services, including Abarth, Alfa Romeo, Chrysler, Citroën, Dodge, DS Automobiles, Fiat, Jeep, Lancia, Maserati, Opel, Peugeot, Ram, Vauxhall, Free2Move and Leasys. Powered by our diversity, we lead the way the world moves – aspiring to become the greatest sustainable mobility tech company, not the biggest, while creating added value for all stakeholders as well as the communities in which it operates. For more information, visit www.stellantis.com. Contacts: Dan Reid Stellantis Communications – North America Cell: +01 248.202.7697 dan.reid@stellantis.com communications@stellantis.com","filter_flag":1}
{"title":"Revolutionizing Last-Mile Delivery: Blockchain and the Future of Instantaneous Logistics - Indian Retailer","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9yZXZvbHV0aW9uaXppbmctbGFzdC1taWxlLWRlbGl2ZXJ5LWJsb2NrY2hhaW4tYW5k0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9yZXZvbHV0aW9uaXppbmctbGFzdC1taWxlLWRlbGl2ZXJ5LWJsb2NrY2hhaW4tYW5k0gEA?oc=5","id":"CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9yZXZvbHV0aW9uaXppbmctbGFzdC1taWxlLWRlbGl2ZXJ5LWJsb2NrY2hhaW4tYW5k0gEA","guidislink":false,"published":"Fri, 11 Aug 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=8, tm_mday=11, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=223, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9yZXZvbHV0aW9uaXppbmctbGFzdC1taWxlLWRlbGl2ZXJ5LWJsb2NrY2hhaW4tYW5k0gEA?oc=5\" target=\"_blank\">Revolutionizing Last-Mile Delivery: Blockchain and the Future of Instantaneous Logistics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Revolutionizing Last-Mile Delivery: Blockchain and the Future of Instantaneous Logistics - Indian Retailer","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMifWh0dHBzOi8vd3d3LmluZGlhbnJldGFpbGVyLmNvbS9hcnRpY2xlL3RlY2hub2xvZ3ktZS1jb21tZXJjZS9kaWdpdGFsLXRyZW5kcy9yZXZvbHV0aW9uaXppbmctbGFzdC1taWxlLWRlbGl2ZXJ5LWJsb2NrY2hhaW4tYW5k0gEA?oc=5\" target=\"_blank\">Revolutionizing Last-Mile Delivery: Blockchain and the Future of Instantaneous Logistics<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Indian Retailer<\/font>","source.href":"https:\/\/www.indianretailer.com","source.title":"Indian Retailer","query":"https:\/\/news.google.com\/rss\/search?q=\"Reverse logistics\" \"new products\"+after:2023-08-01+before:2023-08-31","text":"FROM BYTES TO BITES: How AI is Transforming Food and Agriculture The world's population is experiencing a rapid surge, and it is foreseen to approach a staggering 9.7 billion individuals by the year 2050. Consequently, this escalating growth has engendered a mounting apprehension regarding the ability to satisfy the escalating demand for sustenance, all while ensuring the vital aspects of food security and sustainability remain intact. In light of these concerns, the integration of artificial intelligence (AI) applications in the agri-food sector holds extraordinary potential to revolutionize the industry, heralding a new era of heightened sustainability. Artificial intelligence (AI) embodies the capacity of machines or computer programs to undertake endeavours typically reliant on human intellect, encompassing domains such as learning, reasoning, problem-solving, and decision-making. The realm of AI encompasses diverse subfields, each contributing unique capabilities to this expansive discipline. These subfields encompass machine learning (ML), deep learning, natural language processing, computer vision, robotics, and cognitive computing. Within AI technology, a plethora of algorithms emerges, including reinforcement learning, swarm intelligence, cognitive science, expert systems, fuzzy logic (FL), Artificial Neural Networks (ANN), and Logic Programming, offering a rich tapestry of tools to leverage in pursuit of intelligent automation. Innovative Applications of AI in Food and Agriculture GRAIN QUALITY Manual grain inspection is a time-consuming process and is prone to human error, which can result in the selection of lower-quality grains. Therefore, the use of computer vision systems in grain inspection is becoming increasingly popular. These systems use advanced imaging techniques and ML algorithms to analyse images of grains and identify defects or impurities, such as broken kernels, foreign materials etc. Back propagation neural network (BPNN) has been effectively used to classify rice grain varieties with great accuracy (96%), even with poor image quality. PEST DETECTION AND WEED MANAGEMENT Accurate identification of insect species, size variation, and stage of development is crucial for effective pest management in agriculture. By identifying the type and number of insects present in a crop field, farmers can take appropriate measures to control the pest population and prevent damage to their crops. Several AI and ML technologies are being developed and tested for insect detection and counting. Some of these technologies use computer vision algorithms, while others rely on ML algorithms to identify and classify different insect species. Similarly, herbicides have been widely used by farmers for many years to control weeds and improve crop yields. However, the overuse or improper application of herbicides can have negative impacts on both human health and the environment. To minimize the negative impacts of herbicides, there is a growing need for more precise and accurate application methods. Robotic weed control is also an emerging technology that shows great promise for the future of agriculture. Robotic weed control systems typically use computer vision and ML algorithms to detect and identify weeds in crop fields, then use robotic arms or other mechanical tools to remove or destroy the weeds. Although intelligent mechanical weed control would be more felicitous than weeding devices with cutting action, contrary to time-based weed removal, it is possible to remotely regulate the tendency of tines of spring-tine harrow prototype systems based on the conditions of soil, the density of weed, and crop production. CROP SELECTION AND YIELD IMPROVEMENT Robots, such as the Berry 5 Robot from Harvest Croo Robotics (Tampa, FL, USA), are designed to automate the harvesting of strawberries, which is a labour-intensive and time-consuming process. The robot uses computer vision and ML algorithms to identify and pick ripe strawberries at a faster rate than humans can. This can help farmers to reduce labour costs and improve their yields by ensuring that more strawberries are harvested at the optimal time. FOOD SAFETY COMPLIANCE AI enabled cameras are used to ensure safety compliance amongst food workers in food facility. This employs facial-recognition and object-recognition software to determine whether workers are complying with good personal hygiene as required by food safety law. If violation is found, it extracts the screen images for review which can be rectified in the real time. The accuracy of this technology is more than 96%. PRODUCT DEVELOPMENT AI technology uses machine learning and predictive algorithms to model consumer flavour preferences and predict how well they will respond to new tastes. The data can be segmented into demographic groups to help companies develop new products that match the preferences of their target audience. With these, manufacturers could know what products will thrive before the hit the shelves. Companies like SPOONSHOT are using AI techniques like NLP (natural language processing) and computer vision to build organised information from unstructured data. They leverage food science domain knowledge to process data relating to physical and chemical properties of ingredients to understand how ingredient interactions impact a final recipe. SPOONSHOT can scout 3B social conversations, 5M research papers, 84M articles, 4M products, 84M blogs etc to provide actionable insights around product concepts, product and menu innovations, consumer market insights, competitor analysis etc. MARKET RESEARCH AND SALES ENABLEMENT AI offers tremendous potential to assist in market research within the food industry, providing valuable insights and facilitating better decision-making. AI algorithms can analyse vast amounts of data, including consumer preferences, purchasing behaviour, and social media interactions related to food. By recognizing patterns and correlations, AI can identify emerging trends, understand consumer preferences, and predict future demands accurately. This information can help food businesses tailor their products, marketing strategies, and overall consumer experience to meet evolving customer needs. Social listening tools like CRIMSON HEXAGON and SYNTHESIO helps generate valuable insights around audience analysis, brand intelligence, campaign analysis, customer sentiment, market research, trend analysis, competitor analysis etc, helping make smarter, data-driven decisions. (11) In the current attention-driven economy, where capturing and retaining attention is challenging due to the overwhelming choices and distractions faced by consumers, traditional market research methods have their limitations. However, AI-powered research offers a promising solution by providing rapid, reliable, and actionable insights. Companies like THE LIGHTBULB.AI leverage AI-enabled technology to offer a range of research services. These include qualitative and quantitative research, ad testing, as well as UI\/UX testing. Their advanced capabilities encompass facial coding, eye tracking, speech transcription, text sentiment analysis, and audio tonality analysis. These modules enable comprehensive analysis and understanding of user experiences and preferences. By harnessing AI in research, businesses can overcome the shortcomings of traditional methods and gain a deeper understanding of consumer behaviour. AI-based research offers the advantage of speed, accuracy, and scalability, allowing companies to adapt swiftly to evolving market dynamics and make informed decisions based on robust data-driven insights. AI can significantly contribute to sales enablement by providing valuable insights, automating tasks, and enhancing overall sales efficiency. INFILECT, a leading provider of advanced retail visual intelligence, offers cutting-edge solutions that can greatly boost sales for organizations. With their advanced image recognition technology and retail data analytics capabilities, Infilect empowers businesses to improve shelf visibility and enhance store execution performance. By analysing visual data, such as product placement, stock availability, and planogram compliance, Infilect provides valuable insights to optimize sales strategies and improve overall retail performance. CONCLUSION In conclusion, the transformational power of AI in the food and agriculture industry is undeniable. From bytes of data to the very bites we consume, AI has become a driving force behind enhanced productivity, sustainability, and innovation. Through advanced algorithms and data-driven insights, AI is optimizing crop management, improving yield predictions, and revolutionizing farming practices. It is enabling precise monitoring of soil conditions, crop health, and irrigation needs, leading to resource-efficient and environmentally conscious agricultural operations. Furthermore, AI is enhancing food safety by rapidly detecting and mitigating risks associated with contaminants, pests, and diseases. It is facilitating traceability and supply chain transparency, ensuring that consumers have access to safe and high-quality food. Beyond the farm, AI is revolutionizing food production, from automated processing and packaging to personalized nutrition recommendations. It is driving the development of novel ingredients and flavors, expanding the boundaries of culinary creativity. However, it is essential to recognize that the adoption of AI in the food and agriculture sector is an ongoing journey. Challenges such as data privacy, infrastructure limitations, and ethical considerations must be addressed to fully harness the potential of AI while ensuring equitable access and sustainable practices. In this age of bytes and bites, AI holds the promise of a transformative future for food and agriculture, ushering in a new era of abundance, efficiency, and global nourishment. Let us seize the opportunities that lie ahead and embrace AI as a powerful ally in creating a more sustainable, resilient, and inclusive food system for generations to come. Bharat Sawnani is the founder of Elevantus with 14 years' experience across innovation, technology, quality, and 6 years in clinical pharmacokinetics.","filter_flag":1}
