{"title":"Siemens expands sustainable MV switchgear range - Your Gateway to Power Transmission & Distribution - T&D India","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zaWVtZW5zLWV4cGFuZHMtc3VzdGFpbmFibGUtYW5kLWRpZ2l0YWwtbXYtc3dpdGNoZ2Vhci1yYW5nZS_SAQA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zaWVtZW5zLWV4cGFuZHMtc3VzdGFpbmFibGUtYW5kLWRpZ2l0YWwtbXYtc3dpdGNoZ2Vhci1yYW5nZS_SAQA?oc=5","id":"CBMiVWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zaWVtZW5zLWV4cGFuZHMtc3VzdGFpbmFibGUtYW5kLWRpZ2l0YWwtbXYtc3dpdGNoZ2Vhci1yYW5nZS_SAQA","guidislink":false,"published":"Mon, 16 Oct 2023 07:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=10, tm_mday=16, tm_hour=7, tm_min=0, tm_sec=0, tm_wday=0, tm_yday=289, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zaWVtZW5zLWV4cGFuZHMtc3VzdGFpbmFibGUtYW5kLWRpZ2l0YWwtbXYtc3dpdGNoZ2Vhci1yYW5nZS_SAQA?oc=5\" target=\"_blank\">Siemens expands sustainable MV switchgear range - Your Gateway to Power Transmission & Distribution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Siemens expands sustainable MV switchgear range - Your Gateway to Power Transmission & Distribution - T&D India","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiVWh0dHBzOi8vd3d3LnRuZGluZGlhLmNvbS9zaWVtZW5zLWV4cGFuZHMtc3VzdGFpbmFibGUtYW5kLWRpZ2l0YWwtbXYtc3dpdGNoZ2Vhci1yYW5nZS_SAQA?oc=5\" target=\"_blank\">Siemens expands sustainable MV switchgear range - Your Gateway to Power Transmission & Distribution<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">T&amp;D India<\/font>","source.href":"https:\/\/www.tndindia.com","source.title":"T&D India","query":"https:\/\/news.google.com\/rss\/search?q=\"Sustainable Energy Transition\" \"new products\"+after:2023-10-01+before:2023-10-31","text":"New Products Siemens expands sustainable MV switchgear range T&D India T&D India October 16, 2023 Share Siemens Smart Infrastructure has expanded its range of sustainable and digital medium-voltage switchgear to support the decarbonization of today’s power grids. The new F-gas-free blue GIS primary switchgear enables an early transition to sustainable grids ahead of regulation. With a focus on industrialized and high-end ratings up to 24kV and 2,500A, Siemens has launched the 8DAB24 and upgraded the NXPLUS C24. The 8DAB24 with its single and double busbar design is available for ratings up to 24kV, 40kA, and 2,500A and is based on a proven single pole encapsulated design with an installed base of more than 150,000 panels worldwide. This provides high reliability, operational safety, and compact dimensions. Developed with the Robust Eco Design concept, the 8DAB24 ensures reduced carbon footprint from manufacturing until end-of-life, making it an ideal choice for a sustainable energy transition, a company release said. Enhancements to NXPLUS C24 Siemens has also made significant enhancements to its NXPLUS C24 medium-voltage switchgear, which was successfully launched in May 2020. The NXPLUS C24 is maintenance-free and enables innovative and cost-effective operations, thanks to digital protection, control devices, and integrated sensors. Due to continuous development, the NXPLUS C 24 now enables the supply of climate-neutral energy distribution up to 2000A, and a fully flexible extension within the NXPLUS C family is possible. As a result, Siemens now covers a wide range of medium-voltage applications for primary distribution and will continue to further upgrade the portfolio with higher ratings and additional customer specific features in the next few years. Clean air and vacuum interrupter technology Siemens’ sustainable and innovative blue GIS portfolio helps electrical grids transition to eco-friendly networks. Alongside proven vacuum-interrupter technology, the switchgear uses Clean Air, based on natural-origin gases, is free of fluorinated and PFAS gases, and has a global warming potential (GWP) below 1. By combining Clean Air for insulation with Siemens’ proven vacuum-interrupter technology, these blue GIS switchgear help customers to reduce their carbon footprint. “Our blue GIS range supports our customers’ efforts to create a more sustainable future,” said Stephan May, CEO of Electrification and Automation at Siemens Smart Infrastructure. Siemens Xcelerator The blue GIS switchgear incorporates software from Siemens Xcelerator, an open digital business platform that enables customers to accelerate their digital transformation easier, faster, and at scale. Switchgear integrated smart sensors provide asset transparency and cloud-based analysis methods enable efficient and effective predictive maintenance support which reduces downtime and maintenance costs. Also read: Siemens Clocks 6 Per Cent Growth In Order Inflow Capital investment In March 2023, Siemens announced investment of 30 million euros in its Frankfurt-Fechenheim site in Germany, where blue GIS is developed, tested, and manufactured. A new fully automated warehouse and a 1,200 sqm production area will allow the company to meet growing demand for environmentally friendly medium-voltage switchgear. The factory runs solely on green electricity, has a significantly reduced waste to landfill rate, and a sustainable packaging process, contributing to the many measures Siemens is taking to cut the manufacturing carbon footprint.","filter_flag":1}
