{"title":"Rise in noise complaints threatens late-night sector - MorningAdvertiser.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xMC9SaXNlLWluLW5vaXNlLWNvbXBsYWludHMtdGhyZWF0ZW5zLWxhdGUtbmlnaHQtc2VjdG9y0gEA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xMC9SaXNlLWluLW5vaXNlLWNvbXBsYWludHMtdGhyZWF0ZW5zLWxhdGUtbmlnaHQtc2VjdG9y0gEA?oc=5","id":"CBMia2h0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xMC9SaXNlLWluLW5vaXNlLWNvbXBsYWludHMtdGhyZWF0ZW5zLWxhdGUtbmlnaHQtc2VjdG9y0gEA","guidislink":false,"published":"Fri, 10 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=10, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=4, tm_yday=41, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xMC9SaXNlLWluLW5vaXNlLWNvbXBsYWludHMtdGhyZWF0ZW5zLWxhdGUtbmlnaHQtc2VjdG9y0gEA?oc=5\" target=\"_blank\">Rise in noise complaints threatens late-night sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MorningAdvertiser.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Rise in noise complaints threatens late-night sector - MorningAdvertiser.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMia2h0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xMC9SaXNlLWluLW5vaXNlLWNvbXBsYWludHMtdGhyZWF0ZW5zLWxhdGUtbmlnaHQtc2VjdG9y0gEA?oc=5\" target=\"_blank\">Rise in noise complaints threatens late-night sector<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MorningAdvertiser.co.uk<\/font>","source.href":"https:\/\/www.morningadvertiser.co.uk","source.title":"MorningAdvertiser.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Noise Abatement\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"The east London music venue had not faced noise complaints until the pandemic struck but when hospitality reopened its doors, 27 complaints were made against the pub. The council threatened to fine or take away its equipment, so Otiende took matters to court. Survey Have you experienced a rise in noise complaints at your venue since the pandemic? Yes 74% No 26% “We feel that, since the pandemic, some people got used to areas being very quiet, and now everything’s back open, nights are not as quiet as they used to be,” he adds. It’s a sentiment echoed by many in the sector. While the Jago retained its licence, others have not been so lucky. According to Clara Cullen, the venue support manager at Music Venues Trust (MVT), which aims to protect, secure and improve the UK’s grassroots music venues, noise complaints had been a “really core threat” to music venues since 2018. Of the 118 emergency cases handled by MVT last year, around a third were related to noise complaints. Cullen puts the problem down to people complaining about noise after moving to the area during lockdown, where areas were under restrictions. Last year, George Orwell’s “perfect pub” was hit by complaints by nearby residents claiming the site was too loud and posed a health hazard. The historic site managed to retain its licence​ but with an added noise management and dispersal policy issued by Islington Council. Under the Licensing Act 2003,​ licence holders are required to prevent public nuisance, so the issue comes when neighbours complain of loud music being a ‘nuisance’. Furthermore, iconic venue Night & Day Café in Manchester is in the process of appealing a noise abatement notice served by Manchester City Council in 2021, after residents who moved into a neighbouring flat during Covid complained about noise levels. The site’s history is star-studded, with band names including Elbow, Wet Leg, Arctic Monkeys and Kasabian having played at the venue as they rose to fame. Iconic Northern Quarter venue Night & Day Café Almost 10,000 people, including The Charlatans singer Tim Burgess, have signed a petition​ calling for the venue’s noise abatement notice to be removed. A spokesperson for Manchester City Council comments: “Following a joint application between the council and representatives from Night & Day Café, an adjournment has been granted by the presiding judge. The council remains hopeful a solution that allows Night & Day to thrive as well as allowing the council to uphold its legal duties can be found.” A fragile sector Noise complaints join the perfect storm of problems facing the sector, including soaring energy costs, a staffing shortage and climbing inflation rates. New research from the Night Time Industries Association (NTIA) reveals the worrying statistic that one third​ of UK nightclubs have been lost since before the pandemic. NTIA chief executive Michael Kill says noise complaints have been a growing issue over the past five years. Without a doubt, he says they have been exacerbated by the pandemic when residents experienced periods of lower noise levels due to the closure of night-time economy businesses. As the night-time economy reopened, the trade body saw an influx of complaints​ from people living in towns and cities that has led to enforcement officers taking action without consideration for the contrasting lockdown periods. Kill adds: “Under the current financial operating constraints, businesses are struggling to survive and, in many cases, the approach by local authorities has led to premises licences being challenged, costing thousands in legal fees that operators do not have, tipping vulnerable businesses into financial hardship.” This is something experienced first-hand by Pauline Forster, ​licensee of legendary arts and music venue the George Tavern, which she claims to be the last pub in Stepney, east London. “Under the current financial operating constraints, businesses are struggling to survive and, in many cases, the approach by local authorities has led to premises licences being challenged, costing thousands in legal fees that operators do not have, tipping vulnerable businesses into financial hardship.” Some 15 years ago, a building association planned to build flats on top of an old nightclub adjacent to the Grade II-listed pub. Forster was “fired up”. She started a campaign against the decision with celebrities including Amy Winehouse and Kate Moss sporting ‘Save the George’ T-shirts in solidarity. The pub won the appeal but the building association put in another request a few years later. Forster piled pressure on the council, and once again, successfully blocked the flats from being built. After sound surveys were conducted, the pub was granted a legal ‘deed of easement’. This meant, if anyone bought flats in the area, they would not have the right to complain about the noise created by music. However, there is still a threat because residents who already live there do have the ability to complain, according to the publican. “If we lost our music licence, we would lose the pub,” says Forster. She is insulating the building with toughened glass to appease a neighbour across the road. Asa temporary measure, she has covered windows with roof insulation as well as hanging up double-lined velvet curtains. It will cost a fortune, she adds, but will have to be done because “one person can close you down”. Communication is key For Forster, it is important to reach out to neighbours you think might pose a problem. She visited the neighbour with flowers and an invite to the pub. A Tower Hamlets Council spokesperson says: “It is recognised that noise exposure can cause annoyance and sleep disturbance both of which impact on quality of life. It is also agreed by many experts that annoyance and sleep disturbance can give rise to adverse health effects, especially if exposed to it over longer periods.” The spokesperson says venues can stop music becoming a ‘nuisance’ by offering conditions to their licences that can be as simple as keeping doors and windows closed when playing music or having a sound limiter fitted. The Jago has also taken measures to keep noise levels down. An acoustic company ran a sound test and the pub now covers windows and plays music at a much lower level. Since then, the pub has not received any complaints. Otiende wishes the council could see the synergy between local businesses. “If we’re busy, the restaurants are busy,” he says. “It’s not just seeing these venues as ‘it’s a venue where people drink and it’s noisy’. We’re part of a bigger ecosystem and that relies on everyone.” London night czar Amy Lamé says London’s nightlife is “key” to its economic and social recovery, but businesses have battled through a few tough years due to the pandemic and were now struggling with staff shortages and the spiralling cost of business. She continues: “The mayor made protecting venues a key priority in his London Plan, which included the introduction of the ‘agent-of-change principle’, and we continue to work with local authorities to ensure well-run venues are safeguarded. “We are doing all we can to offer advice and support through our Culture and Community Spaces at Risk team and continue to call on the Government to play its part in supporting London’s venues and tackling the soaring cost of doing business.” “It’s not just seeing these venues as ‘it’s a venue where people drink and it’s noisy’. We’re part of a bigger ecosystem and that relies on everyone.” Soho’s bustling high streets have also caused issues for its residents. Some 60% of respondents to the 2022 Soho Sleep Survey​​ say sleep deprivation from noise nuisance has adversely impacted their health. Soho, London, at night (Getty\/fotoVoyager) One resident says they can't work after insomnia led to anxiety and depression. “I’ve lived in Soho for 60 years… born and bred,” another adds. “It’s never been this noisy!” What's the solution? What should you do if you get a noise complaint? Advice from Poppleston Allen solicitor Felix Faulkner​ Keep a log of complaints to show you’ve been proactive in monitoring them and any solutions you have put in place. Outline what you intend to do to stop those complaints – understanding the root cause of the issue. For instance, if the noise is coming from an external smoking area, outline how you will manage that area. Cooperate with the authorities at all times. Take resident complaints and comments seriously If you’re hit with a noise abatement notice, don’t ignore it, do seek legal advice. Put plans in place to find a solution – e.g. play slow songs to calm customers’ mindsets before the end of the night to ensure a relaxed atmosphere and a healthier disperal, or give out free food at the end of a night so guests will be focused on eating rather than making noise. But Cullen believes there’s a solution, and it lies in residents and venues communicating with each other. “If people in the local area feel they are connected to their local music venue, they become a kind of stakeholder,” she says. She also says more dialogue between council departments would be “really helpful” because she finds often within the cultural, environmental and planning departments, the “left hand is not speaking to the right”. UKHospitality (UKH) chief executive Kate Nicholls agrees instances of noise complaints should be attempted to be resolved, in the first instance, by dialogue between the parties. UKH also supports the ‘agent-of-change principle’, where developers of any new accommodation near to existing licensed premises have a duty to mitigate noise in their plans rather than seeing premises being penalised after development. “At a time when hospitality venues are under immense pressure​ from rising costs across the board, we’d hope this dialogue can resolve any issues before it reaches the point of a review, or even a licence being removed,” Nicholls adds. Eye-watering fines and abatement notices are the last thing the fragile late-night sector needs. Here's to hoping venues and residents can communicate, work together, and reduce the threat noise complaints pose to Britain's vibrant music venues.","filter_flag":1}
{"title":"Noise abatement notice advice for pubs - MorningAdvertiser.co.uk","links":"[{'rel': 'alternate', 'type': 'text\/html', 'href': 'https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xNi9Ob2lzZS1hYmF0ZW1lbnQtbm90aWNlLWFkdmljZS1mb3ItcHVic9IBAA?oc=5'}]","link":"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xNi9Ob2lzZS1hYmF0ZW1lbnQtbm90aWNlLWFkdmljZS1mb3ItcHVic9IBAA?oc=5","id":"CBMiXWh0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xNi9Ob2lzZS1hYmF0ZW1lbnQtbm90aWNlLWFkdmljZS1mb3ItcHVic9IBAA","guidislink":false,"published":"Thu, 16 Feb 2023 08:00:00 GMT","published_parsed":"time.struct_time(tm_year=2023, tm_mon=2, tm_mday=16, tm_hour=8, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=47, tm_isdst=0)","summary":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xNi9Ob2lzZS1hYmF0ZW1lbnQtbm90aWNlLWFkdmljZS1mb3ItcHVic9IBAA?oc=5\" target=\"_blank\">Noise abatement notice advice for pubs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MorningAdvertiser.co.uk<\/font>","title_detail.type":"text\/plain","title_detail.language":null,"title_detail.base":null,"title_detail.value":"Noise abatement notice advice for pubs - MorningAdvertiser.co.uk","summary_detail.type":"text\/html","summary_detail.language":null,"summary_detail.base":null,"summary_detail.value":"<a href=\"https:\/\/news.google.com\/rss\/articles\/CBMiXWh0dHBzOi8vd3d3Lm1vcm5pbmdhZHZlcnRpc2VyLmNvLnVrL0FydGljbGUvMjAyMy8wMi8xNi9Ob2lzZS1hYmF0ZW1lbnQtbm90aWNlLWFkdmljZS1mb3ItcHVic9IBAA?oc=5\" target=\"_blank\">Noise abatement notice advice for pubs<\/a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MorningAdvertiser.co.uk<\/font>","source.href":"https:\/\/www.morningadvertiser.co.uk","source.title":"MorningAdvertiser.co.uk","query":"https:\/\/news.google.com\/rss\/search?q=\"Noise Abatement\" \"new products\"+after:2023-02-01+before:2023-02-28","text":"Q​. I recently acquired a rural village pub with a large outdoor area. The pub is surrounded by local residents who were all very supportive of the pub when it reopened after being closed for a long period of time. Things have turned sour more recently after a we ran a series of events and mini festivals in the external area. These events are all permitted as part of the premises licence, but I have had numerous visits from the environmental health officer telling me that the residents of the village have complained about noise from music and customers when they are leaving the premises. The environmental health officer has told me I will be served with a noise abatement notice and the premises licence is going to be reviewed. The pub will not be viable in the long term without these types of events. My overheads are increasing daily and I need to be able to provide these events to generate additional income to make the premises viable. What should I do? A​. This is an increasing problem, particularly following the quiet period the pandemic enforced upon all of us. Many residents who live in close proximity to licensed premises got used to the relative peace the pandemic restrictions imposed and have found it difficult to adjust to pre pandemic levels of noise. That said, there is a duty upon you as an operator to ensure that any activities you carry out at the premises do not cause a nuisance to nearby neighbours or businesses. The first thing you should do is request a meeting with the environmental health officer to see if the noise abatement notice and the application to review the premises licence have been issued and to explore if there are any steps you can take to appease local residents and the environmental health officer. Once a noise abatement notice has been served, you risk prosecution and\/or an unlimited fine if the notice is breached. It is possible to appeal against a noise abatement notice, but you would need to seek legal advice to see if this is worthwhile. Once an application to review the premises licence has been submitted, the matter will proceed to a hearing before the council’s licensing sub-committee, and you will need to be proactive in defending the review in order to have the best possible chance of ensuring that the hours and activities permitted by the premises licence remain intact. The worst-case scenario with a review of the licence is that the council can revoke or suspend the premises licence (with a suspension of up to three months). The council may also decide to reduce the hours you are permitted to have licensable activities, remove licensable activities or add\/amend conditions on the premises licence. Ultimately, this may affect your ability to have any events within the external area at the premises at all. Appointing a specialist acoustic consultant to assist with measuring noise levels when events are taking place and formulating an event management plan and dispersal policy are also good initial steps to take. You may also wish to consider meeting with local residents to understand the extent of their concerns and see if there are any additional measures you can take to address these. The best chance of defending a review is showing that you have been proactive in taking reasonable steps to address the concerns raised and can alleviate any issues of noise nuisance in the future. Find out more here​.","filter_flag":1}
